{"duration": 0.07324051856994629, "input_args": {"text": "'SAN FRANCISCO  —   It’s good to be Google. Sometimes it’s just plain great. Revenue regularly increases at a clip rarely achieved by firms of its size. The same goes for profits. Seven of its products have over a billion users, a scale unimaginable in the predigital era. A reorganization last year into a holding company called Alphabet, accompanied by some related   personnel moves, was unexpected but generally applauded. Investors and analysts see little in the short term to disrupt this happy state of affairs, which has pushed Alphabet’s value to more than $500 billion. Those sentiments were confirmed in its   earnings report, released Thursday after the market closed. It was even better than the rosy forecasts. Revenue rose to $21. 5 billion, about $750 million more than analysts were predicting and a 21 percent jump from a year earlier. Earnings per share after excluding certain items was $8. 42, or 39 cents more than forecasts. Last year, it was $6. 99. Celebration ensued. Alphabet’s shares, which drifted sideways during regular trading, immediately rose 4 percent after hours. In some ways, the quarter was the mirror image of the previous quarter, which was good but not as great as analysts hoped. That knocked the stock back and induced some    —   never far below the surface with even the best and most successful internet companies  —   that Google’s days of dominance in search and advertising might be on the verge of starting to wane. No such worries were on display on Thursday as executives talked to analysts. Google rose to fame and fortune on desktop searches, but the health of the company is now reflected in its presence on people’s phones, not only with advertising but also with its Android operating system. “The strength of the quarter is about mobile,” said Sundar Pichai, chief executive of the Google division where most of the company’s revenue and profits are made. “It’s transformed the way that people consume information, and Google’s products have become a central and   part of their experience. ” Last fall, Google revamped its ad formats and delivery, which have been powering the increase in revenue. The number of paid clicks in the second quarter increased 29 percent from last year, the same rate as in the first quarter. Aggregate cost per click fell 9 percent from 2015, the same drop as in the first quarter. Mr. Pichai’s lengthy prepared remarks took a   perspective, focusing on the importance of machine learning  —   software that adjusts to the user’s experience. It will be, he promised, the source of the next great innovations after the switch to mobile runs its course. He also made a reference to the latest game craze, Pokémon Go, “which I suspect a few of you are playing right now. ” Google had spun off Pokémon Go’s developer, Niantic, last year. The biggest complaint some shareholders can come up with is that Alphabet’s     moonshots  —   things like   cars and delivering goods by drone  —   are still in the early stages. Revenue for these “other bets” was $185 million, driven largely by Google Fiber the thermostat company, Nest and Verily, a life sciences company. Alphabet said it lost $859 million on “other bets” in the second quarter, more than the $660 million loss a year ago. Alphabet does not break down how many employees work at the moonshots, but in general the company’s head count is rising almost as fast as its revenue. More than 66, 000 people now work at the company, up nearly 17 percent over the last year. Some analysts predict that Google will sooner or later need innovation closer to home than its moonshots, somewhat in the mode of the ceaselessly inventive Amazon or Apple. “Amazon took their retailing platform and built a   stream of web services. Apple is increasingly talking about money from services, not just hardware,” said Frank Gillett, an analyst with Forrester Research. “Google needs things that expand beyond advertising to give it greater breadth. ” A more immediate problem could be European regulators, who unveiled another round of charges against the company earlier this month. The accusations involve Google abusing its dominance in search, advertising and Android. Google disputes the charges. Google could eventually be forced to pay   fines. It would not miss the money but if the cases succeed in distracting the company and tempering its innovations, that could be a real problem for management and ultimately shareholders. On Thursday, no one seemed unduly worried about this possibility.'"}, "time": 1742562958.529305}