{"duration": 0.048619747161865234, "input_args": {"text": "\"This story by Paris Swade . \\nThe FBI is acting mysterious. Something is happening over there and it is good for the American people. Then need our help. The media is now accusing FBI Director Comey of trying to throw the election. \\n*** Remember, they earlier applauded him for helping Hillary Clinton. William J. Clinton Foundation: This initial release consists of material from the FBI's files related to the Will… https://t.co/Y4nz3aRSmG \\n— FBI Records Vault (@FBIRecordsVault) November 1, 2016 \\nPresident Obama said on Tuesday that the FBI did not consult the White House about the information that was released. BILL CLINTON IS A BAD, BAD DUDE. \\nPresident Bill Clinton pardoned Marc Rich, the husband of a wealthy Democratic donor. Key Points FBI Marc Rich doc: 1980 Iran hostages, Eric Holder, DNC contributions, Clinton Foundation, corruption squad on Pardons 00-05' pic.twitter.com/g5SFh0TLcY \\n— (@vidalexperience) November 1, 2016 \\nOn Jan. 20, 2001, Bill Clinton issued a pardon for the fugitive Marc Rich. This happened on his last day in office. \\nMarc Rich traded with America’s enemies. He traded with Ayatollah Khomeini’s Iran when the Ayatollah held 53 Americans hostage in 1979. He made $2 billion selling oil to South Africa during the UN embargo of the country. He did deals with Khadafy’s Libya,Milosevic’s Yugoslavia, Kim Il Sung’s North Korea, Communist dictatorships in Cuba and the Soviet Union itself. \\n*** He was on the FBI’s ten most wanted list. \\nNow, we know that Bill Clinton pardoned Marc Ritch because his wife gave $100,000 to Hillary Clinton’s senatorial campaign. \\nThere is literally evidence that Bill Clinton pardoned a known criminal because that criminal gave money to the Clinton Foundation. \\n*** HOW MUCH MORE CORRUPTION CAN WE STAND!?!? \\nShare this everywhere! We need to take down the Clinton’s this week. This is the final stand. The second American revolution has started. It is peaceful and it relies on the people of the United States waking up to the crimes of the Clintons. \\nShare this 1 million times, patriots!\""}, "time": 1742564415.066944}