{"duration": 0.035485029220581055, "input_args": {"text": "'Previous Next Megyn Kelly Could Be Out-Is Judge Jeanine Her Replacement At Fox News? \\nAlthough, as of this printing, nothing is official, but numerous rumors are swirling on New York City talk radio circles that F ox News is planning to replace Megyn Kelly with Justice Jeanine Pirro due to plummeting ratings and a total loss of credibility with Fox viewers. \\nKelly’s most recent fall from grace came when Newt Gingrich eviscerated her on her own show over her biased coverage of Donald Trump’s alleged issues, while almost totally ignoring Hillary Clinton’s sociopathic and criminal behaviors. \\nThis past Tuesday night on Fox News, host Megyn Kelly provoked Donald Trump supporter Newt Gingrich into a rage by insisting that Trump’s alleged history of sexual predation is a story worth covering. Gingrich, told Megyn Kelly that “ You are fascinated by sex and you don’t care about public policy. ” He followed up that outburst by demanding that Kelly repeat his words about Bill Clinton: “I want to hear you use the words, ‘ Bill Clinton, sexual predator .’ Say, ‘Bill Clinton, sexual predator. ’ ” Being that it was her show and she control the microphone, Kelly ended the interview ended with Kelly telling Gingrich, “ You can take your anger issues and spend some time working on them .” Fireworks on FAUX NEWS! Further, this shift accentuates the fact that Trump is leading Clinton by an overwhelming majority and Kelly has aligned with the losing side and it is going to cost her the coveted career that she has worked all of her life to obtain. \\nSince the Gingrich interview, Kelly’s already declining ratings, the result of her incessant Trump bashing, took a nose dive into the toilet and emptied out into the local sewer. Megyn Kelly is not likely to recover from the fact that she has been exposed as a Clinton supporter and denier of her crimes. Look for Judge Jeanine Pirro to take her place in the 9-10 PM Eastern time slot. Meanwhile, Sean Hannity’s ratings continue to climb for all the obvious reasons. \\nThe Trump crowd has spoken, Megyn Kelly is on the wrong side of history.'"}, "time": 1742563708.517559}