{"duration": 0.08006000518798828, "input_args": {"text": "'Media and Hollywood elites were among the many who mocked incoming senior Donald Trump adviser Kellyanne Conway, over the outfit she wore for President Trump’s inauguration on Friday. [What Conway told NBC News was her “Trump revolutionary wear” is actually a red, white, and blue Gucci coat. Conway wore the $3, 600 coat with a bright red hat and red gloves.  It didn’t take long for the internet to notice Conway’s outfit, and she was mercilessly mocked. Below is a sampling of some of the sexist insults hurled at Trump’s incoming senior strategist, many of them from the very media tasked to cover the Trump White House. The Daily Show Twitter: Kellyanne Conway dressed as the era Trump wants to take America back to. #InaugurationDay pic. twitter.   —   The Daily Show (@TheDailyShow) January 20, 2017,    blog Jezebel: Haha what the fuck is Kellyanne Conway wearing #inauguration2017 https:  .  pic. twitter.   —   Jezebel (@Jezebel) January 20, 2017,  The Huffington Post Lifestyle: Kellyanne Conway really loves America. Just ask her outfit. https:  .  pic. twitter.   —   HuffPost Lifestyle (@HPLifestyle) January 20, 2017,  The Hollywood   offshoot   : Kellyanne Conway dresses like court jester for #TrumpInauguration: https:  .  pic. twitter.   —      (@pretareporter) January 20, 2017,  NBC, Today Show reporter Ronan Farrow: My aesthetic is Kellyanne Conway revolutionary war cosplay. pic. twitter.   —   Ronan Farrow (@RonanFarrow) January 20, 2017,  Staff writer for The Hollywood Reporter Ryan Parker: pic. twitter.   —   Ryan Parker (@TheRyanParker) January 20, 2017,  Managing Editor, Video for Mic Slade Sohmer: ♫ Guns. And ships. And so the balance shifts. ♫ pic. twitter.   —   Slade Sohmer (@Slade) January 20, 2017,  New York Time SundayStyles reporter Katie Rosman: Because I can’t stop tweeting about Kellyanne Conway’s awful $3500 Gucci coat: please salute the Homewood, Alabama HS drum major team! pic. twitter.   —   katie rosman (@katierosman) January 20, 2017,  Assignment Editor for New York Daily News Joseph Barracato: Ready, Set, Inaugurate! @KellyannePolls wears     ‘Trump Revolutionary Wear’ coat to inauguration https:  .  pic. twitter.   —   Joseph Barracato (@JoeBarracato) January 20, 2017,  Columnist, Opinion Producer, CBC Robyn Urback: For inauguration day, Kellyanne Conway debuts the uniform of the new Trump guard pic. twitter.   —   Robyn Urback (@RobynUrback) January 20, 2017,  The Huffington Post reporter Matt Fuller: Can’t believe Steve Bannon didn’t wear a matching outfit with Kellyanne Conway. pic. twitter.   —   Matt Fuller (@MEPFuller) January 20, 2017,  NFL Draft analysts Tyler Brooke: Why does Kellyanne Conway look like the old New England Patriots logo? pic. twitter.   —   Tyler Brooke (@TylerDBrooke) January 20, 2017,  Late Night With Seth Meyers writer Dina Gusovsky: Here’s Kellyanne Conway fresh from defeating the Hessians at the battle of Trenton CC: @jeffkbell pic. twitter.   —   Dina Gusovsky (@DinaGusovsky) January 20, 2017, '"}, "time": 1742564475.8835225}