{"duration": 0.06993460655212402, "input_args": {"text": "'Email \\nThe year 2016 is set to become one of Chicago’s bloodiest in decades. More than 100 people were shot in just the first 10 days of the year. By the end of March, 345 people had been murdered. The month of May saw 66 people murdered and another 400 wounded. Over Labor Day 13 were killed and another 52 injured by gunfire. By the end of September, 500 people had been murdered and more than 3,000 shot and wounded. \\nThe last weekend in October saw 17 people murdered and another 41 wounded, despite the Chicago Police Department cancelling leaves and putting officers on 12-hour shifts. \\nBy the end of October, 641 people had been killed with more than 3,660 wounded — putting Chicago on track for the worst year for gun violence in decades. \\nThere are multiple causes. Perhaps the primary one is the lack of certainty when it comes to gun ownership in Illinois. Article I section 22 of the Illinois Constitution states, “Subject only to the police power, the right of the individual citizen to keep and bear arms shall not be infringed.” Put another way, gun rights don’t exist in Illinois unless the “police power” gives permission. \\nThe 2010 Supreme Court decision McDonald v. City of Chicago , holding that “the Second Amendment right to keep and bear arms for self-defense in one’s home is fully applicable to the states [including Illinois]” left the door open for state legislatures to determine what rules and regulations would apply outside the home. Illinois legislators took full advantage, putting in place burdens on citizens wanting to obtain a carry permit: \\n• 16 hours of concealed carry firearms training, provided by an instructor approved by the Illinois State Police; \\n• A valid driver’s license or Illinois Identification card; \\n• A valid FOID (Firearms Owner Identification) card; \\n• A head and shoulders electronic photograph taken within the last 30 days; \\n• Proof of the last 10 years of residency; \\n• Fingerprints; and \\n• a $150 fee. \\nThe burdens put off limits legal carry outside the home for many of Chicago’s citizens, especially those living in the war zones in West and Southside Chicago where nearly all the murders are taking place. \\nChicago is considered the most gang-infested city in the country, with an estimated gang population of over 100,000, representing nearly 60 different groups including the Vice Lords, the Black Disciples, the Four Corner Hustlers, the Black P. Stones, and the Latin Kings. \\nPart of the problem is the so called \"Ferguson Effect,\" which has caused CPD officers to back off from enforcing all but the most heinous of crimes. Some officers reported anonymously to the Chicago Sun-Times that they have been afraid to make preemptive stops because the federal Justice Department and the American Civil Liberties Union are scrutinizing every move they make. This has resulted in the number of “street stops” dropping by 80 percent since the first of the year. \\nCriminals couldn\\'t care less about gun restrictions placed on private citizens. Chicago’s Crime Lab interviewed Cook County Jail inmates last year and learned that they don’t obtain their guns from gun shows, Internet sales, or gun shops. As Alan Gottlieb, chairman of the Citizens Committee for the Right to Keep and Bear Arms (CCRKBA), explained: “More than two-thirds of these offenders got their guns from family, friends or fellow gang members. These people can’t obtain guns via legal means, and the existing restrictions don’t prevent them from being armed. Criminals can’t get a [FOID] card, and they darn sure can’t get a concealed carry permit.” \\nUnless Chicagoans are more freely allowed to possess firearms for personal protection outside their homes, the violent crime rampage that makes headlines nearly every day in the Windy City will continue unabated. \\n\\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. . Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742563709.6018863}