{"duration": 0.07272553443908691, "input_args": {"text": "'The newspaper USA Today ran an article on Monday claiming that Donald Trump’s election last November has led to the hijab, commonly known as a symbol of oppression in the Muslim world, becoming a “symbol of resistance and feminism. ”[The piece predominantly focuses on the experiences of multiple Muslim women who have chosen to wear the hijab —  rather than being forced —   such as University of Maryland student Sameeha Ahmad, “whose very independence that drove her to cast off the traditional head covering has since drawn her to don one. ”  “I do believe hijab support feminism,” Ahmad is quoted as saying, adding that “the way you look at it from a religious perspective, it empowers you by strengthening your relationship with God. It’s a step you are taking to further yourself within your own religion. ” The author also quotes the view of Dalia Mogahed, a director of research at the Institute for Social Policy and Understanding, which seeks to empower American Muslims. Mogahed claims that the “the ‘hijab oppresses women’ narrative is not only racist, it is also sexist. ” Mogahed adds that the “hijab is a choice by the vast majority of women who wear it, especially in the U. S. where there is great societal pressure to not wear it, rather than the reverse. ” Since the election of Trump, the hijab has emerged as a new symbol of resistance and feminism. https:  .  #MuslimWomensDay,  —   USA TODAY (@USATODAY) March 27, 2017,  Another student, Fatima Khan, who has worn a hijab for nine years, argues that her hijab “limits how much someone can objectify me and instead have the power to only be judged for my intellect, abilities and personality rather than simply my appearance. ” The backdrop to the article is Donald Trump’s election, which author Waseem Abasi argues led to “debate around Islamic dress has [taking] a new turn,” amid “policies from the Trump administration targeting Muslim immigrants. ” Earlier this month, sports brand Nike introduced a new line that includes a Hijab head covering featuring the Nike swoosh brand logo. “The Nike Pro Hijab has been a year in the making, but its impetus can be traced much further back to Nike’s founding mission, to serve athletes, with the signature addendum: If you have a body, you’re an athlete,” the company said in an announcement. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742562931.1838045}