{"duration": 0.05223727226257324, "input_args": {"text": "'We Are Change \\nHillary Clinton hasn’t been the most favored candidate. In fact, she is one of the most disliked candidates to ever run for president. Election day is just on the horizon, and as this presidential race draws to a close, the indictment of Hillary Clinton seems increasingly more likely with every new scandal that comes around the corner.\\n\\nOn Wednesday, a Fox News report revealed two sources with “intimate knowledge of the FBI investigations” had stated, that the probe of the Clinton Foundation would continue to be ongoing after the election. However it is not certain as to whether this will result in an indictment yet. Fox News redacted the earlier claim stating that this would indeed lead to an indictment. These sources also told Fox News anchor, Bret Baier, that this investigation was being treated as ‘very high priority’, with ‘a lot of’ evidence having been gathered, even before the Wikileaks revelations , which have revealed the absolute highest levels of corruption from within the Clinton Campaign.\\nThese sources also stated that they’re “looking into possible pay-for-play interaction between secretary of state, Hillary Clinton, and the foundation” and that this investigation has been “going on for more than a year.” The FBI have interviewed individuals who are suspected to be linked with this activity.\\nIn an article published by the Wall Street Journal on Wednesday, it was stated that:\\n“Secret recordings of a suspect talking about the Clinton Foundation fueled an internal battle between FBI agents who wanted to pursue the case and corruption prosecutors who viewed the statements as worthless hearsay, people familiar with the matter said.”\\nWe are uncertain as to what these recordings entail, but it’s evident that their contents must be of substantial importance, as it was concerning enough to contribute to the reopening of the Clinton Foundation investigation.\\nMeanwhile, The FBI have also discovered new, not duplicated, emails that they believe to have come from Hillary’s server. However, it is currently unknown as to whether they contain classified information. These emails were discovered whilst combing through former Democratic Congressman Anthony Weiner’s laptop—after a sexting scandal involving a 15-year-old girl.\\nWith an “avalanche of new information coming every day,” this investigation will have wide-reaching implications for the Clinton Foundation. Appearing more intensive and expansive than we ever could have imagined. The reopening of the investigation into the Clinton Foundation has also show Trump to have gained support in the polls, appearing almost even with Clinton in most polls, while the L.A Times shows Trump to have a 4 per cent lead.\\nDespite attempts on behalf of Department of Justice officials to shut this investigation down, a report from the Wall Street Journal states FBI deputy director Andrew McCabe refused to close the case, calling it a “validly predicated investigation” while discussing this with other DOJ officials. The FBI investigation into the Clinton campaign is now running parallel to the reopened criminal investigation into Hillary’s private email server, which she created violating State Department regulations.\\nWith an onslaught of evidence confirming the Clinton campaign’s deceit and rampant corruption, it is highly unlikely that they’ll come out of this ordeal unscathed. If she were to be elected, there are a large number of possible charges Hillary could be facing whilst in the White House. Including perjury, obstruction of justice, bribery, pay-for-play, and undoubtedly many more.\\nEarlier today, in a morbid turn of events, batch 30 of the Wikileaks Podesta emails revealed the sadistic past times of the Podesta brothers, having been invited to a ‘Spirit Cooking’ dinner with performance artist Marina Abramovic. The grotesque nature of Clinton’s inner circle really is the gift that keeps on giving. From raunchy sexting to ritual sacrifice, this election cycle has divulged the darkest, more abhorrent secrets held by this crooked campaign. If there is any justice left in the world, it is morally essential that Hillary Clinton and her mob go down, to prison, as well as hell.\\nThe post Is This The End For Hillary Clinton? appeared first on We Are Change .\\n'"}, "time": 1742561770.7362263}