{"duration": 0.26945018768310547, "input_args": {"text": "'November 1, 2016 By 21wire 4 Comments \\nPatrick Henningsen 21st Century Wire \\nThe longer this soap opera drags on, it’s becoming more and more evident that the Russian government did not ‘hack’ into the DNC, and Moscow is not feeding John Podesta’s emails to Wikileaks. For those who are deeply invested in this now official conspiracy theory, this might be a hard pill to swallow. \\nThe White House and the Hillary Clinton campaign are now married to the idea that ‘Putin is hacking the US elections.’ In response, the President is weighing his options – tougher economic sanctions, revoking diplomatic status to Russian envoys in the US, or even deploying his newly developed ‘malicious cyber-activity’ tools. \\nEven VP Joe Biden wants in on the action, threatening Moscow by saying,”We’re sending a message. We have the capacity to do it.” \\nIt seems that where ever you turn nowadays, someone in Washington is issuing a threat against Russia. Are US-Russian relations really that bad, or does this trend have more to do with the defense industry and power struggles within the US? \\nWhat was previously a stance reserved for right-wing neoconservative hawks and Cold War hold-outs has now infected America’s left-wing, and is a firm plank in the Democratic Party platform, as evidenced by Hillary Clinton’s constant anti-Russian rhetoric throughout this 2016 election cycle. Along with the White House, Clinton has now transformed the Democrats into the vanguard of Washington’s new anti-Russia movement. \\nOn July 27th, Josh Rogin from the Washington Post wrote, “The Clinton campaign has decided to escalate its rhetoric on Russia. After Trump suggested Wednesday that if Russia had indeed hacked Clinton’s private email server it should release the emails, the Clinton campaign sent out its Democratic surrogates to bash Russia and Trump in a manner traditionally reserved for Republicans.” \\nAnyone who was paying attention back then knew this ‘Russian hack’ talking point was purely political, but then again, who’s really paying attention these days? Certainly not the US media. \\nYou can trace the genesis of the Democratic Party’s hardcore anti-Russian strategy back to when President Vladimir Putin made a mild passing remark about Donald Trump’s GOP primary success. From that point on, Trump’s political opponents saw this as an open target. In their words, ‘comparing one dictator to another.’ \\nNever one to pass up an opportunity to score cheap political points, President Obama got in on the act, intensifying the Trump-Putin narrative to the level of bromance . “If you’ve made a career out of idealizing Ronald Reagan, then where were you when your own party’s nominee for president was kissing up to Vladimir Putin?” said Obama on Oct 20th at a Clinton rally in Miami. \\nBacked by the Obama White House, Clinton and the media felt they had a green light to keep pressing ahead with blaming Russia – not only for the controversial DNC leaks, but also for hacking into US election systems in Arizona – a charge devoid of any evidence other than innuendo and speculation. The media’s coverage on this issue was deceptive from the onset. In a leading news release, entitled, “ Russian hackers targeted Arizona election system ,” we can see how after the cock-sure headline, the first paragraph would always sound definitive: \\n“Hackers targeted voter registration systems in Illinois and Arizona, and the FBI alerted Arizona officials in June that Russians were behind the assault on the election system in that state.” \\nBut then by the time you advanced down the story, the report would quickly retreat into a zone of uncertainty: \\n“The bureau described the threat as “credible” and significant, “an eight on a scale of one to 10,” Matt Roberts, a spokesman for Arizona Secretary of State Michele Reagan (R), said Monday. As a result, Reagan shut down the state’s voter registration system for nearly a week.” \\nAnd then, down to almost nothing… \\n“It turned out that the hackers had not compromised the state system or even any county system. They had, however, stolen the username and password of a single election official in Gila County.” \\nAt no point was any evidence ever given. Only ambiguous statements like, “Cyber security officials agree that this looks very much like a Russian government-directed hack.” \\nAre American politicians so callous as to tempt geopolitical conflict in order to further their short-term political ambitions? Better yet, has American political life really arrived in such a dark cul de sac (translated in French: ‘bottom of the bag’) where politicians in power are so insecure as to make-up and propagate wild international conspiracy theories – in the middle a national election cycle? It’s a very depressing prospect, and yet, this is exactly what we are seeing in this 2016 Presidential Election. \\nBehind Clinton’s wild hyperbolic rants about the Kremlin and Wikileaks, you will find the White House… \\nOn October 7th, the Obama Administration formally accused the Russian government of stealing emails from the Democratic National Committee and other high-profile individuals including Hillary Clinton’s campaign manager John Podesta – giving them to Wikileaks. \\nSoon, there was a queue of ‘national security’ politicians eager to hitch a ride on this bandwagon. Senator Ben Sasse (NE-R), a member of the Homeland Security Committee spouted out, “Russia must face serious consequences. Moscow orchestrated these hacks because [Russian President Vladimir] Putin believes Soviet-style aggression is worth it. The United States must upend Putin’s calculus with a strong diplomatic, political, \\xadcyber and economic response.” \\nAccording to a Washington Post report by technology editor, Ellen Nakashima , the only ‘evidence’ that seems to be available on this story is a corporate analysis of the alleged ‘Russian government hacks’– provided by a US cyber security company called Crowdstrike . No actual specifics are given, so we are meant to take private firm Crowdstrike’s word for it. \\nIMAGE: Crowdstrike cyber security. \\nThe Post’s Nakashima then added: \\n“The administration also blamed Moscow for the hack of the Democratic Congressional Campaign Committee and the subsequent leak of private email addresses and cellphone numbers of Democratic lawmakers.” \\nAn online persona calling himself Guccifer 2.0 has claimed responsibility for posting the material. Those sites and that persona are “consistent with the methods and motivations of Russian-directed efforts,” the joint statement said. “… We believe, based on the scope and sensitivity of these efforts, that only Russia’s senior-most officials could have authorized these activities.” \\nMoscow’s press secretary’s reply: “This is some sort of nonsense,” said Dmitry Peskov. \\nDespite the constant repetition by Democrat media surrogates, and as CNN’s Maria Cardona said last night, no US national intelligence agency has really “confirmed” that Russia was behind the email hacks – and still no evidence , other than speculative guesswork, has been presented. \\nLikewise, US intelligence agencies have never actually said definitively on record that “Russia did it,” thus, leaving the door open to walk-back the accusation at a later date. Standard Washington procedure of ambiguity. This little detail doesn’t seem to matter in this hyperbolic political climate though. It seems that the White House, Hillary Clinton and media operatives like Cardona – are quite happy living in what John Kerry recent dubbed as a ‘ parallel universe .’ \\nStill, during the final Presidential debate, Hillary Clinton proudly crowed how “ 17 US intelligence agencies ” aka the “Intelligence Community”– all agreed that Russia did it. \\nThe announcement, albeit vague, actually originated from the Office of the Director of National Intelligence. \\n“We have 17 intelligence agencies, civilian and military, who have all concluded that these espionage attacks, these cyberattacks, come from the highest levels of the Kremlin, and they are designed to influence our election,” said Clinton. “I find that deeply disturbing.” \\nWhat’s even more disturbing is the fact that Clinton is lying in front of a national audience. The highest levels of the Kremlin? Here are Clinton’s ’17 agencies’: \\nAir Force Intelligence, Army Intelligence, Central Intelligence Agency, Coast Guard Intelligence, Defense Intelligence Agency, Energy Department, Homeland Security Department, State Department, Treasury Department, Drug Enforcement Administration, Federal Bureau of Investigation, Marine Corps Intelligence, National Geospatial Intelligence Agency, National Reconnaissance Office, National Security Agency, Navy Intelligence and the Office of the Director of National Intelligence. \\nWhat does the Coast Guard Intelligence, National Geospatial Intelligence Agency or the Drug Enforcement Administration know about John Podesta’s emails? Answer: nothing. \\nThe exact same thing happened following Wikileaks first trove of DNC emails back in July 2016 . The US government issued a vague accusatory statement, but would not actually name the culprit. Some might call that propaganda. \\nIn both instances, the Obama Administration refused to present any evidence. Translated: there was no evidence. If there had been, the White House would have been shouting from the rooftops and using it as leverage to apply muscle in the UN over Washington’s flagging efforts in Syria. Both Obama Administration announcements were nothing more than dog whistles for Democrats and “journalists” working for hopelessly partisan outlets like New York Times and CNN – none of whom have bothered to press the White House for one ounce of evidence pertaining to the Party’s decree that “Russian is hacking the US election process.” If you actually look at the joint DNI-DHS statement issued on the matter, it contains no definitive statement: “… [the hacks] are consistent with the methods and motivations of Russian-directed efforts. These thefts and disclosures are intended to interfere with the US election process. Such activity is not new to Moscow — the Russians have used similar tactics and techniques across Europe and Eurasia, for example, to influence public opinion there. We believe, based on the scope and sensitivity of these efforts, that only Russia’s senior-most officials could have authorized these activities.” According to NSA intelligence worker-turned whistleblower William Binney , when asked about WikiLeaks and whether the Russians are ‘hacking’ US elections, he concluded that the cyber efforts against the DNC were more likely to be the work of a “ disgruntled U.S. intelligence worker. ” \\nUnder partisan pressure from senior Democrat Senator Harry Reid , the FBI also initiated another investigation into “people linked to the Trump team with Russia.” Reid was unset about the DNC hacks and the Podesta emails and demanded the FBI do something about the Trump campaign. To date, the FBI haven’t come up with anything. \\nTo be fair, Hillary would have every reason to believe that the Kremlin is behind the hack – because her staff read it to her from the campaign’s daily intelligence briefings, presumably, supplied from the US government’s much vaunted Intelligence Community . Of course, that’s the same Intelligence Community that briefed George W Bush about Saddam’s nonexistent nuclear weapons program, and who also briefed Colin Powell about Iraq’s imaginary “Winnebagos of Death” aka mobile anthrax labs disguised as senior double-wide camper vans. So, of course, they would know if Putin directed the DNC leaks and Podesta email hacks. \\nFor those us who are skeptical of the great oxymoron known as ‘Washington Intelligence,’ I can almost hear the mainstream rebuttal now, “No, that was Iraq, that was Bush. We’re not like that. No, this time it’s different. This time we are sure the Russians did it!” \\nIn 2014, Obama claimed that Kim’s notorious “Bureau 121” hacked into Sony Pictures. \\nThis isn’t the first time that President Obama has cried wolf on a foreign ‘hack’ and then tried to sell it for political purposes. Back in December 2014, Obama claimed that North Korea had hacked Sony Pictures in Hollywood. Pentagon-CIA media proxy CNN quickly chimed in to support Washington’s conspiracy theory, floating a colorful story that Kim Jing-Un had deployed a secret underground hacking unit called ‘ Bureau 121 .’ Just like with today’s “Russian Hack” theory, no member of the mainstream press dared to question the White House’s ridiculous North Korean claim, and like the ‘Russian Hack’ claims, the only source cited for Sony hack was analysis provided by US firm Crowdstrike . \\nJumping the Shark \\nAfter their Democratic Party Convention on July 27th, the Clinton campaign machine put all of its chips on their Putin narrative. \\nSoon after, a cadre of top Clinton national security surrogates then accused Trump of emboldening Russia in their evil plot to “destabilize and dominate the West.” Tom Donilon, a former national security adviser then accused Russia of ‘interfering’ with elections all over Europe and then accused Trump is helping Russia directly. At that point, they were in too deep to turn back. The biggest impact of @wikileaks ? Shining a spotlight on Russia’s attempt to undermine American democracy and Trump’s refusal to condemn it https://t.co/ALzpYm1Bb5 \\n— Josh Schwerin (@JoshSchwerin) October 21, 2016 \\nClinton spin doctors Josh Schwerin and Michael Fallon would stoop even lower by accusing RT of having possession of the Podesta emails even before Wikileaks did. Their only ‘evidence’ seemed to be Twitter posts by RT News which Clinton held up as ‘proof’ that the Kremlin was front-running Wikileaks email dumps. The Clinton braintrust failed to note that the Podesta emails were posted on Wikileaks own website well before RT News had tweeted about them. At that point it became obvious that the Clinton campaign was panicking and hysterically grabbing for any excuse they could get their hands on. We then watched, as one RT reporter after another dismantled the Clinton campaign’s desperate claims. It was embarrassing. \\nThey could not face the uncomfortable fact that it was WikiLeaks head Julian Assange who chose the timing of the release of the DNC and Podesta emails. Rather than attack Assange himself, who happens to be popular with millennials (the very group Clinton struggles to connect with), her operatives opted to target Russia and Trump instead. \\nEither way, the political strategy here is clear – to shoot the messenger . The Clinton campaign is stuck in permanent rear-guard mode, because based on the content of both the DNC Leaks, Wikileaks files, and Project Veritas video – their own Democratic Party has been discredited and exposed as a corrupt political organization. \\nTheir other big problem is that despite all the outrage from Democrats and their mainstream media surrogates, none of the leaked content has been challenged on the basis of its authenticity. The results speak for themselves. The initial DNC leak of 20,000 emails resulted in the resignation of DNC Chairwoman Debbie Wasserman Schultz . They revealed the unthinkable: the Democratic National Committee actively worked to undermine the Presidential campaign of Bernie Sanders in favor of the establishment choice in Hillary Clinton. Sanders never had a chance. Honest commentators called this an affront to the democratic process, while party insiders and Clinton supporters pretended to be aloof as if it never happened. \\nTo prove this point, both President Obama and Hillary Clinton then gave Wasserman-Schultz a glowing endorsement on the way out. “For the last eight years, Chairwoman Debbie Wasserman Schultz has had my back. This afternoon, I called her to let her know that I am grateful,” said Obama. Not surprisingly, Clinton thanked Wasserman Schultz, presumably for helping to knock her only competitor Sanders out of the Democrat primary race. “I am grateful to Debbie for getting the Democratic Party to this year’s historic convention in Philadelphia, and I know that this week’s events will be a success thanks to her hard work and leadership,” said Clinton. \\nThe party had sold its soul to devil and no one seemed to care too much about it. \\nParty Meltdown \\nWasserman Schultz’s replacement didn’t fair much better. DNC Vice Chairwoman Donna Brazile was installed to serve as interim chair through the remainder election, but Brazile was soon skewered by subsequent Wikileaks batches – showing how, on more than one occasion, she fed debate questions obtained from corrupt mainstream media operatives – straight to Hillary Clinton. \\n“ A March 12 email exchange shows Brazile stating that she received a town hall question from Roland Martin, a TV One host who co-moderated a March 13 town hall with CNN’s Jake Tapper.” \\n“ A March 5 email shows that she shared a question with Clinton campaign chairman John Podesta and communications director Jennifer Palmieri that was to be asked in a March 6 debate hosted by CNN in Flint, Mich.” (Source: Daily Caller ) \\nBrazile’s audacious fraud also helped contribute to her party’s planned sabotage of Democrat challenger Bernie Sanders. Watch Brazile go into full meltdown when confronted here: \\n. Completely corrupt and still, Brazile even had to temerity to deny doing it when pressed on FOX News last week. Brazile’s reputation is so bad now that even CNN has severed ties with her – and that’s saying a lot. \\nIn addition, it was also revealed how CNN’s head political commentator, Gloria Borger , was named by Podesta as one of a shortlist of ‘journalists’ the Clinton campaign would “work with” to gain favorable coverage. You’d think that CNN would have dropped Borger after this was revealed, but no. Amazingly, Borger is still leading CNN’s election coverage. \\nClearly, CNN cannot be trusted to police itself when it comes to matters of outright collusion with Hillary Clinton and the Democratic Party. Ever-unbiased CNN\\'s Gloria Borger refers to being in \"GOP hell\" and says she\\'ll \"reach out soon\" to Podesta. Heart-warming #PodestaEmails13 pic.twitter.com/CQFdcJ12Q5 \\n— 400-lb Hacker Owens (@NubianAwakening) October 21, 2016 \\nWorse Than Watergate \\nPerhaps a bigger scandal which the Obama White House and Clinton campaign operatives would like to bury – is the FBI’s investigation into the Clinton Foundation. Yesterday, the Wall Street Journal confirmed the existence of an internal feud between the FBI and the Justice Department, over whether or not to pursue an investigation into Clinton issue: \\n“Some investigators grew frustrated, viewing FBI leadership as uninterested in probing the charity, these people said. Others involved disagreed sharply, defending FBI bosses and saying Mr. McCabe in particular was caught between an increasingly acrimonious fight for control between the Justice Department and FBI agents pursuing the Clinton Foundation case. It isn’t unusual for field agents to favor a more aggressive approach than supervisors and prosecutors think is merited. But the internal debates about the Clinton Foundation show the high stakes when such disagreements occur surrounding someone who is running for president.” \\nThere’s more. It was also revealed last week how Jill McCabe, the wife of FBI Deputy Director, Andrew McCabe , received $467,500 in campaign funds in late 2015 for her Virginia State Senate run. This unusually large donation came via a political action committee run by Virginia Gov.Terry McAuliffe – a Clinton Foundation board member. After the funds were donated, Andrew McCabe was then put in charge of the Clinton Email case. In normal times, this one scandal would be bigger than Watergate, but these are not normal times . \\nSo why is Washington going all out to deflect to Russia , and cover-up the Clinton scandals, and the Wikileaks document dumps? One reason is because the Clinton email issue goes all the way to the top – to the President himself. \\nWhat 21WIRE reported on Oct 21st is how President Obama lied when first confronted about whether or not he knew about the existence of Hillary’s unauthorized private server. Obama told CBS News on March 7, 2015 that he only found out about Clinton’s server “the same time everybody else learned it through news reports.” The President’s lie was confirmed when newly released FBI documents showed that: \\n“Obama used a pseudonym [bobama@ameritech.net] when communicating with then-Secretary of State Hillary Clinton by email, and at least one of those emails ended up on Clinton’s private email server.” \\nSo, not only did Obama lie on national TV, but he also broke strict White House security protocols by carelessly exchanging private emails “off grid” with Hillary Clinton on a unsecured and unauthorized mail server – maybe to avoid the same scrutiny one would have on a government system. Who knows why he did it. \\nSure, he’s not the first US President to lie, but like, Richard Nixon and Bill Clinton, Obama just joined that exclusive liars club – caught out lying to the American people. \\nOn top of this, any communications made by the President of the United States are de facto labeled as “ born classified .” The same goes for any State Department communications with other foreign ministers. \\nCOVER-UP: John Podesta and Huma Abedin on the Hillary campaign jet (Image: ABC News ) \\nIt should be well known by now after watching both Attorney Generals Eric Holder and Loretta Lynch in action – that the Obama Justice Department (DOJ) is one of the most politicized in history. Bear that in mind when looking at the latest leg of the Hillary Email case. \\nOn Friday, FBI Director James Comey set the election alight after announcing that the FBI would be reopening the Clinton email case – currently examining 650,000 emails found while investigating a laptop belonging to former US Congressman Anthony Weiner (estranged husband of top Clinton aid and long-time confidant Huma Abedin) who was snared in a ‘sexting’ scandal, allegedly involving a underaged female. So which DOJ person is in charge of this investigation? None other than Assistant Attorney General Peter J. Kadzik . Who is Kadzik? Zero Hedge reports: \\n“Oh yes. Recall our post from last week, “ Clinton Campaign Chair Had Dinner With Top DOJ Official One Day After Hillary’s Benghazi Hearing ” in which we reported that John Podesta had dinner with one of the highest ranked DOJ officials the very day after Hillary Clinton’s Benghazi testimony? It was Peter Kadzik.” \\nOh, and if that wasn’t good enough, Kadzik was also Podesta’s lawyer back in 1998 when Ken Starr was investigating Podesta over his role in helping Bill Clinton intern/mistress Monica Lewinsky land a job at the United Nations. The two were described as ‘best friends.’ FOX News confirms: \\n“Fantastic lawyer. Kept me out of jail,” Podesta wrote on Sept. 8, 2008 to Obama aide Cassandra Butts, according to emails hacked from Podesta’s Gmail account and posted by WikiLeaks. \\nTo call the Clinton circle incestuous would be an understatement, and on the whole, Americans are sick of it. \\nRussia – The Party Scapegoat \\nFormer Democratic Party leader Howard Dean was so incensed about the FBI reopening the case, he accused the FBI director of being in league with Russia, Tweeting: “Ironically Comey put himself on the same side as Putin.” Ironically Comey put himself on the same side as Putin. \\n— Howard Dean (@GovHowardDean) October 29, 2016 \\nAnother veteran party operative and lifetime Clinton defender, James Carville , was so upset by the FBI announcement that he accused “the KGB” working with Republicans to “hijack the election” during his wild rant on MSNBC . \\n“I think this an outrage and I think the fact that the KGB is involved in this election is an outrage and I think the American people ought to take their democracy back regardless of what the press wants to do and the excuses they want to make for Comey. That’s what I think,” said Carville. \\nMaybe someone can remind Carville that there is no KGB , and that the Soviet Union actually dissolved in 1991. \\nThese are just a few scandals surrounding the Democratic Party and the Clinton campaign, along with the many exposés revealed through Wikileaks, and the Podesta email batches. Those are actual scandals with real tangible evidence – unlike the ‘Russians hacking the DNC and John Podesta and passing those to Wikileaks.’ \\nSuffice to say, the Democratic Party machine has already demonstrated that it is prepared to say anything in order to deflect and divert attention away from the damning Wikileaks material, and also blame Donald Trump in the process. It should be obvious by now that in their desperation to push a highly comprised Hillary Clinton over the finish line on November 8th, the Washington establishment has concocted the story that ‘Putin is trying to influence our electoral process in the US.’ They’ve tried to lay this at the feet of Donald Trump, who Obama and Clinton claim has some secret special relationship with Vladimir Putin. The liberal mainstream media have made a meal out of this talking point, and anti-Russian war hawks on the Republican side love it too. For the White House and the Clinton campaign this seemed like the ultimate clean sweep – a perfect double entendre . \\nThe geopolitical strategy behind this move was twofold. First, this non event would be used to advance immediate calls for sanctions against Russia. Secondly, the US could continue to lean on Russia in the UN over Syria. Previously, 21WIRE reported how Washington’s State Dept and UN delegations, led by the dynamic trio of John Kerry , Samantha Power , and John Kirby , already lied when levelling charges against Russia for war crimes in Aleppo, and again while accusing Russia and Syria of conducting an airstrike on a UN Aid Convoy in Syria. As we have already shown – that raid was most likely a ground attack carried out of US-backed ‘rebels’ Al Nusra Front, or Nour al-Din al-Zenki. \\nWith so much at stake geopolitically, why would Washington lie about a potential World War III trigger event? If they are prepared to lie about this, what else are they prepared to lie about? \\nThe demonization of all things Russian has definitely accelerated since late 2013 when the US engineered a coup d’etat in Kiev, Ukraine. Ever since that it’s been a go-to talking point for ginning-up and new transaltlantic arms race, as with Republican war hawks – and a convenient scapegoat for any politician requiring misdirection, like Clinton and the Democrats. When the new year rang in 2015, the newly appointed head of the U.S. Broadcasting Board of Governors, Andrew Lack, announced the new challenges facing America’s own state-run media arm that includes U.S. overseas propaganda assets including Voice of America, Radio Free Europe/Radio Liberty, the Middle East Broadcasting Networks and Radio Free Asia. Lack said , “We are facing a number of challenges from entities like Russia Today which is out there pushing a point of view, the Islamic State in the Middle East and groups like Boko Haram,” He was forced to resign shortly after that. \\nWhat’s clear is that when it comes to all things Russian, there is an established pattern of compulsive lying by this US Administration. The list is too long to chronicle here, although ‘ Russian-backed Rebles Shootting Down MH17 ,’ and ‘ Assad Regime Sarin Attack in Damascus in 2013 ‘ certainly comes to mind. \\nThat said, it’s hard to imagine a lie as egregious and potentially destructive than one which accuses the Russia government, a world nuclear power and member of the UNSC, of ‘Hacking Into the US Electoral Process.’ When you examine history however, what you will find is plenty of evidence documenting exactly how the US government and the CIA have altered and flipped 100 foreign elections throughout history, the attempted assassination of over 50 foreign leaders . Knowing all this, one might find it hard to take seriously Washington’s claims that Putin and Trump are trying manipulate the 2016 Election \\nOn Oct 9, 2016, Russian Foreign Minister Sergei Lavrov laid it all on the table: \\n“We have witnessed a fundamental change of circumstances when it comes to the aggressive Russophobia that now lies at the heart of U.S. policy towards Russia. It’s not just a rhetorical Russophobia, but aggressive steps that really hurt our national interests and pose a threat to our security.” \\nSelf-serving, career political operatives in Washington are playing a dangerous game. History will mark this as one of the biggest political follies of the Obama-Clinton era. \\nKnowing what we now know about the NSA and its ability to hack and grab any email or text message from anyone, anywhere – if Washington really wanted to know where the hacks came from, maybe they could start there. Far be it from anyone in Washington or the media to ever adopt that line of inquiry. \\nStill, we’re waiting for the emergence of an adult in the room in Washington – before it’s too late. \\nREAD MORE ELECTION NEWS AT: 21st Century Wire 2016 Files \\nSUPPORT 21WIRE – SUBSCRIBE & BECOME A MEMBER @21WIRE.TV \\nFiled Under: Featured , Patrick Henningsen , Shout , US News Tagged With: CNN , Debbie Wasserman Schultz , Donna Brazile , Gloria Borger , Hillary Clinton , Media Cog , Russia , wikileaks WillDippel \\nHere is an article that looks at the real story behind one of the more interesting conspiracy theories about the 2016 election: \\nSometimes the real story is even more fascinating than any conspiracy theory. WeAreYourGods \\nWanna bet money that the Weiner laptop, on which the over 600,000 emails were stored in a folder titled “Life Insurance”, holds information linking the CF to human trafficking and typical elite pedophilia “vacations”? Ever wonder why nobody ever really goes after the Clinton Foundation from a government office? Same old blackmail scheme involving underage sex slaves that was going on during the Boys Town scandal with Lawrence King and elite politicians and business people in the 80’s. Why would they stop? Brad Dueringer \\nIt seems the most morally depraved beings are the ones we let run things. But they have help crafting “reality” with the tribe that owns the media Analyze_This_88 \\nBarrak Obama and Hillary Clinton are both political scam artists. It’s amazing that a US President would invent a Russian Hacking conspiracy theory in order to drive a geopolitical agenda. But then again, Bush did the same with Bin Laden and 9/11. \\nClinton on the other hand is pure corruption personified. She’s should never be allowed near public office. '"}, "time": 1742628452.711237}