{"duration": 0.16043949127197266, "input_args": {"text": "'Friday on his nationally syndicated radio show, Rush Limbaugh questioned the motives of the numerous investigations into President Donald Trump and his alleged ties to the Russian government.  Limbaugh said despite the lack of evidence of such ties, there are these investigations underway and that it goes beyond incompetence, which he called a “silent coup. ” Limbaugh went on to criticize former FBI Director James Comey, who he suggested exhibited odd behavior regarding his interactions with Trump. Partial transcript as follows (courtesy RushLimbaugh. com): I don’t know that there’s a lot of incompetence here. I know what you mean by that, but I think (sigh) this is all being fairly well executed by the people who have a strategy behind it. I mean, you have to have a lot of pieces in place to be able to carry out a story for which there’s no evidence for over a year. You have to have a  …     You want to talk about a conspiracy? I mean, people love conspiracy theories. How’s this happen? How do we get no evidence of anything into five investigations on Capitol Hill, numerous media investigations, and the big investigation by the real pros: The CIA, the NSA, and the FBI? Those are the people that can survival and wiretap, and there’s nothing. There’s not a scintilla. There’s not a whit. There’s no evidence whatsoever. And yet theirs no end is in sight to this. That’s a pretty good trick, and it takes a conspiracy. It takes a lot of people conspiring together to make this happen. All it would take to unravel this is for one of these people on the left to say, “There isn’t any evidence. “What are we doing here? We’re wasting our time. We need to look at something else. We’re not gonna find any evidence. There’s no evidence!” All it would take is one person in the media, in the FBI, the CIA, the NSA. All it would take would be one staffer somewhere of one Democrat. All it would take would be one renegade media member. And not a single leak, not a single betrayal of this. So I don’t think this is incompetence. I think it’s much worse. I think it has a purposeful, studied effort and outcome, which is a coup. We are watching a silent coup here to oust a duly elected president, and this coup is being mounted by career government people who can traffic anonymously and who are protected by people in the media and within the Democrat Party. Stop and think of it, folks. A year. How many  …    ? Hasn’t the Washington Post at one time admitted that they have over 30 anonymous sources for all of this? That’s just one newspaper, 30 anonymous sources there. How many anonymous people are talking New York Times? How much overlap? How many sources are talking to both places? All these deep state career government people,   people that are civilians now? We don’t know. But it is a lot of people, and there isn’t any evidence. There’s none! And it’s gonna continue whether or not  …     Not only is there no evidence, there’s nothing to suggest the need of a special counsel. They can’t even find a   to cover up the fact that there’s no evidence. What is the  ? When you don’t have a crime, then what the hell is being covered up? But they’ve got people believing that there’s a scandal here, and you know what the scandal is? Firing Comey. That’s not a scandal. Firing Comey? The president can do that any time he wants for whatever reason he wants, and he doesn’t need anybody’s permission. But that is the supposed scandal. Now, about Comey, I mentioned earlier that I was reading some things last night about it and I said, “This is embarrassing. This is really a bit of desperation here. ” You have to balance what’s coming up here with another reputation that we’ve been presented with. In the case of James Comey  —   and this goes back to the Bush presidency when he was a deputy attorney general for John Ashcroft. That’s when I first became aware of the name of James Comey, and from that day forward James Comey has been presented as a lawyer beyond repute. He is a lawyer who exudes integrity. He is flawless. He has never slipped up. This man is the epitome of honesty. This man is the epitome of courage. This man is the epitome of independence. This is the reputation of James Comey. This is why the Clinton campaign went through such conniptions when Comey was doing what he was doing, because he was doing all of that with the finest reputation anybody in Washington has ever had. Now that reputation’s beginning to crumble. That’s the dirty little secret. That reputation’s starting to take some hits, and not because of anything Trump did. Because of things Comey has done. The July 5th press conference, the October 28th letter to Congress, the listing of charges but there’s not gonna be any prosecution. That just isn’t done. There’s all kinds of things being done. And now this guy with the impeccable reputation all of a sudden some people are whispering he’s got a power complex. People are starting to whisper, “This man’s trying to make it all about himself. This man’s trying to figure out where the bright lights are in every story and end up right in them. ” Well, those are serious, serious assaults if you have spent your life crafting and building this impeccable reputation for virtue and for honesty and for integrity. So it’s against all that that this now is beginning to happen. So here’s the first thing. This is Washington Examiner: “Comey Hid Among White House Curtains to Avoid Trump. ” I’m sorry. The only reason we know this is because Comey told somebody, and the fact that Comey’s telling people this so that they will then tell the media? I would be embarrassed, is what I’m saying. This is embarrassing. “Former FBI Director James Comey now says he tried to hide among the tall, blue curtains adorning a White House meeting room in an attempt to hide from President Trump at an Inauguration Day event. “Comey said the incident was one example of what he believed were times Trump tried to create a public image that showed Comey was on his side. ” So we have image protection going on here. (translated) “We have my independence is at stake here! I’ve got to do something! That’s bad. So now I’m gonna tell people I had to hide in the curtains. This guy Trump? This guy Trump was so eager to corrupt me, so eager to make it look like he and I were buds, I had to hide in the curtains!” The FBI director is admitting that he hid from the president of the United States in the curtains on Inauguration Day. This is embarrassing! Benjamin Wittes, who runs a blog  —   Lawfare or some such thing  —   is said to be a good Comey friend. Quote, “Comey described really not wanting to go to that meeting” on Inauguration Day, “for the same reason he later did not want to go to the private dinner with Trump: the FBI director should be always at arm’s length from the president, in his view. “There was an additional sensitivity here too,” Benjamin Wittes said, “because many Democrats blamed Comey for Trump’s election, so he didn’t want any shows of closeness between the two that might reinforce a perception that he had put a thumb on the scale in Trump’s favor. ” This is so embarrassing. This is a window into the way Comey’s thinking, and all he’s thinking about is himself! He’s making all of this about him! Most people do. Most people’s egos are such that everything ends up being about them. But this is not about James Comey, and yet he’s trying to make it about him, and this is about trying to save and protect his reputation. And then he goes on to say (paraphrased) “I didn’t want to shape Trump’s hand. You know, Trump when he shakes your hand he pulls you to him and he tries to make it look like you’re buddies and friends. ” No, no, no, no. You people, you’ve been in politics so long, you don’t understand how people actually interact with each other in the real world. But Comey thought that Trump was engaging  …     Everything Trump was doing was designed to create an image that he and Comey were buds. (scoffs) But Benjamin Wittes said, “Mr. Comey also felt he could not refuse a presidential invitation, particularly not one that went to a broad array of law enforcement leadership. ” So it wasn’t just Comey? You’ve got all other kinds of law enforcement people there, and yet Comey admits to hiding in the curtains so that Trump will not notice him? (scoffs) This is like my cat thinking I can’t see her when her head’s poking around the corner. How in the world do you hide in the curtains and think you’re not going to be seen in more importantly: Why would you then like this story? Because it feeds the lunatic left. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563324.2388525}