{"duration": 0.06633853912353516, "input_args": {"text": "'Donald J. Trump’s campaign moved on Sunday to squelch reports  —   set off by the candidate himself  —   that Gennifer Flowers, the woman whose claims of an affair with Bill Clinton imperiled his 1992 presidential campaign, would be Mr. Trump’s guest on Monday at his first debate with Hillary Clinton. In television interviews on Sunday morning, Mr. Trump’s running mate, Gov. Mike Pence of Indiana, flatly denied that Ms. Flowers would attend the debate, at Hofstra University on Long Island. And Mr. Trump’s campaign manager, Kellyanne Conway, said that in threatening on Saturday to invite Ms. Flowers, Mr. Trump had merely been making a point. “He wants to remind people that he’s a great counterpuncher,” Ms. Conway said on ABC’s “This Week. ” The specter of Ms. Flowers’s attendance arose during a skirmish of psychological warfare between the two campaigns and their supporters in the   to Monday night’s matchup. Mark Cuban, the voluble billionaire who owns the Dallas Mavericks basketball team and is supporting Mrs. Clinton, announced on Twitter on Thursday that Mrs. Clinton’s campaign had given him a   seat at the debate to watch her “overwhelm” Mr. Trump. For good measure, Mr. Cuban  —   who once hosted a   reality television show called “The Benefactor,” and more recently offered $10 million to the charity of Mr. Trump’s choice if the Republican nominee would let Mr. Cuban interview him for four hours about his “policies and their substance”  —   suggested the debate would become known as the “Humbling at Hofstra. ” On Saturday, Mr. Trump responded even more provocatively. The   Mr. Trump, whose second marriage grew out of an affair during his first one, has repeatedly raised Mr. Clinton’s infidelities as a character attack against Mrs. Clinton. Several of Mr. Trump’s advisers have a long history of calling attention to Mr. Clinton’s scandals. Ms. Flowers herself lent credence to the idea: “Yes I will be there,” she wrote in a text message to The New York Times on Saturday. She did not respond to   messages on Sunday. Each campaign receives tickets from the Commission on Presidential Debates to give to supporters at its discretion, and campaigns often engage in mind games when picking guests, as appeared to be the case with Mrs. Clinton’s choice of Mr. Cuban. But inviting Ms. Flowers would be in a different category. In 1992, Mr. Clinton denied Ms. Flowers’s claim of an affair, but years later, when asked in a deposition whether he had engaged in “sexual relations” with Ms. Flowers, he admitted having done so one time, in 1977. Ms. Flowers, in recently broadcast interviews, has accused Mrs. Clinton of being an “enabler” and has said the scandal is a relevant issue in 2016. Inviting Ms. Flowers would be risky for Mr. Trump, because he faces a potentially   gender gap with women, who might be troubled by such an aggressive and personal move. On NBC’s “Meet the Press,” John Podesta, Mrs. Clinton’s campaign chairman, portrayed Mr. Trump’s Twitter post about Ms. Flowers as yet another example of behavior unbecoming of someone seeking the presidency. “You saw his reaction, which is to do his favorite sport, which is to dive in the sewer and go for a swim,” Mr. Podesta said. But on “Fox News Sunday,” Mr. Pence, the Indiana governor, sought to put an end to the matter. “Gennifer Flowers will not be attending the debate tomorrow night,” Mr. Pence said. “Donald was using the tweet yesterday really to mock an effort by Hillary Clinton and her campaign to really distract attention from where the people  —   the American people  —   are going to be focused tomorrow night, which is on the issues. It’s on the choice that we face. ”'"}, "time": 1742628336.2356968}