{"duration": 0.11174941062927246, "input_args": {"text": "'by Jerri-Lynn Scofield \\nJerri-Lynn here. Normally, I would not post another Real News Network interview with Colin Powell’s former chief of staff when he was Secretary of State, Tom Wilkerson so close to Yves posting Is the US Headed Towards War in Syria? , another interview with the same subject just last week. Yet given the urgency of the topic, reader interest in last week’s post, and the perhaps Panglossian hope that high-level focus on this issue now might limit the range of future options that hawkish Hillary Clinton can take in future– in what I must admit still looks to be the likeliest scenario, that she is inaugurated come January– I upload this post. Perhaps if the Obamamometer took time off from his rounds of legacy-burnishing interviews and concentrated on this problem, he might have a chance of correcting one specific aspect of his horrendous existing foreign policy legacy before the clock runs out on his administration. \\nThis Real News Network interview with Lawrence Wilkerson , offers some suggestions on what would be necessary to stop the immediate ongoing slaughter and reach a peaceful solution in the longer term. It’s by no means the most comprehensive nor the last word on the subject. I cleaned up the rush transcript as best I could. Please excuse any remaining errors. \\nSHARMINI PERIES, TRNN: Welcome to the Real News Network. I’\\x92m Sharmini Peries coming to you from Baltimore. As the civil war in Syria rages on, a school was struck in an airstrike in a rebel held area of northern Syria last week. Reports indicate that 22 children died in the attack along with several civilians. The Russians who are supporting Syria\\x92’s president al-Assad denied any involvement in the strike. There\\x92’s also much speculation that Russians were not reelected to the UN Human Rights Council last Friday because of its involvement in Syria. But this is not known for certain since nations do not need to disclose why they choose to reject candidates for the council. Also last week, Amnesty International released a report in which it estimates that US-led coalition airstrikes in Syria have killed at least 300 civilians. It suggests the US military must come clean on the casualties that they have caused. So far, the war in Syria has cost somewhere between 250 thousand and 400 thousand deaths and has created over 4 million refugees. The highly complicated conflict has increased tensions between the US and Russia and a ceasefire seems more remote than ever. \\nJoining us now to take a closer look at the conflict and what is required to end this is Larry Wilkerson. Larry is a retired United States army soldier and former chief of staff to the United States Secretary of State, Colin Powell. Larry, it\\x92’s so good to have you with us today. \\nLARRY WILKERSON: Thanks for having me Sharmini. \\nPERIES: So Larry, last week when we talked, you mentioned that Hillary Clinton\\x92’s proposal to implement a no fly zone over Syria and what that would probably mean is that it would worsen the conflict. So then, what steps need to be taken by the US to bring this conflict to a peaceful resolution? \\nWILKERSON: Sharmini, this is going to sound like the impossible but there are two steps that need to be taken right away, immediately. The first is a high-level policy step which says President Obama and his council of elders, his National Security Council, whatever, should decide that Bashar al-Assad does not have to go. I think from what we have seen, the United States continuing to insist that Bashar al-Assad being untenable– that is unacceptable as President Obama said it earlier– is simply a position that now is part and parcel to all this blood and carnage and treasure and lives and diaspora being caused. If you can\\x92’t back up from a strategic error like this and count your loses and say okay I made a mistake. You don\\x92’t have to publicly say that but you have to say that in the councils of government and you have to be able to say I\\x92’m going to rectify that mistake. I miscalculated. \\nBashar al-Assad has enormous support. He has support not just outside Syria from Iran and Russia and elsewhere. He has support from inside Syria. Significant support. Then you have to face the reality too that on the other side you are largely supporting your own enemy, Al Qaeda. No matter what you say about the CIA\\x92’s ability to differentiate between so called moderate rebels and those of the Al Nusra Front and those of Al Qaeda affiliates, that is pure nonsense. The CIA does not have that kind of capability. It does not have that kind of discrimination. So, most of the people we are now arming to fight Assad look a lot like Al Qaeda to me. So, you’ve got to admit you’ve made two huge errors and you have to rectify those errors. Those are the steps you need to make immediately. \\nPERIES: Now what’\\x92s preventing them from doing that and is what you\\x92’re proposing unrealistic in the US diplomatic and military milieu? \\nWILKERSON: Unrealistic if you don\\x92’t have the political will nor the political courage to pursue a rectification of your errors. But what is the consequence? The consequence is more death, more conflict, more destruction, more damage, more tragedy, more refugees, more making Jordan unstable, and so forth. You\\x92’ve got to be able to back up from these strategic errors and instead of doing what throughout history, bad leaders have done, that is reinforce the strategic error until it becomes catastrophic, you\\x92’ve got to reverse it. And you’ve got to replace it with a better policy. You\\x92’ve got to force Saudi Arabia, you\\x92’ve got to force the Qataris, you\\x92’ve got to force the Turks however way you may do it. Economic, political, financial, whatever, you’ve got to force them to follow you. They don’t have to follow you like lapdogs but at least they do have to recognize your change in policy and begin to at least for appearance’s sake, support it. \\nIf the United States were to leave I think the rest of them would, reluctantly somewhat, follow in domain. What does that mean? That means you quit supplying these opposition forces with the massive arms that we are supplying them with. That includes anti-tank missiles and other elements. They\\x92’re just going to make them go on and on and on. After all, Iran and Russia and Syria had an inexhaustible [coffers] of the kind of equipment that they need to oppose us as we do to oppose them. So, what are we doing here? We\\x92’re having a great power confrontation over the graves and the blood of the Syrian people. This just simply has to stop. \\nPERIES: Now in the past, Larry you said that Israel seems to be playing a contradictory role in Syria\\x92’s conflict. If one is to believe that Israel actually prefers Assad to be in power than an Islamic regime there, would it not make sense for US to do what you\\x92’re saying? To reassess and take a step back and keep Assad in power? \\nWILKERSON: I think I\\x92’d have to say the contrary is operating right now Sharmini. Michael Horne has said point blank, he has that Israel would rather \\x96when I say Israel, let me be more precise, Bibi Netanyahu and Bibi Netanyahu\\x92’s government would rather see ISIS in command, Al Qaeda in command in Damascus, than they would Bashar al-Assad. So, that\\x92’s what we\\x92’re up against here. But I don\\x92’t think we\\x92’re up against the Israeli people. If the Israeli people were confronted with the reality of this chaos and this collapse of nations all around them, it\\x92’s more detrimental to their long-term security than coming to some accommodation with these countries and helping them come back to some reasonable degree of stability and political feasibility, I think it\\x92’d get a change of attitude in Israel. \\nBut no one\\x92’s telling them the truth. Everyone is scaring them and everyone is saying well you\\x92’ve got to keep these people in chaos. You\\x92’ve got to keep them on the verge of collapse if not collapsing. You\\x92’ve got to change these regimes and it would be better to have ISIS in charge in Damascus rather than have Assad. Just think how preposterous that is and yet that\\x92’s what’s being said. \\nPERIES: Now in the last few weeks Larry, we\\x92’ve seen the battle of Aleppo covered extensively in the media. However there\\x92’s another battle going on in Mosul similar in that sense in terms of the number of people that it\\x92s attacking and very devastating there as well but very little attention in the media about what\\x92’s happening in Mosul. What is going on there and what\\x92’s the comparison here? \\nWILKERSON: Well the media in this country don\\x92’t care about this place Sharmini. They don\\x92’t care about anything but Donald Trump and Hillary Clinton and how big Kim Kardashian is today. What\\x92’s happening in Mosul is in one sense a tactical defeat and maybe even an operational and maybe even strategic defeat for the group known as ISIS, ISIL and their ideal of upholding territory. It\\x92’s going to happen in Mare’. They\\x92’re going to be roundly defeated with regard to that aspect of their strategy. But what\\x92’s going to happen in Mosul afterwards is going to refer back to their previous comments just now Sharmini which are going to have happen in Mosul afterwards is going to be the Turks and the Iraqis confronting one another. \\nEveryone has made it pretty clear that he’\\x92s not going to respond to the Baghdad government\\x92’s request for him to stay out of Mosul in any real way. You\\x92’re going to have Kurds. You\\x92’re going to have all manner of different groups that have sufficient power to contest power in Mosul after ISIS is kicked out. Then you’re going to see the proof of the pudding with regard to whether Iraq stays a state as it is currently constituted, however fragile, or it goes into something else. Splinters into two or three or possibly even more states. And you\\x92’re going to see whether or not the Kurds can be talked into an autonomous relationship with these countries rather than an independent country of their own or whether everyone in Turkey will bless any of that. \\nSo, you\\x92’re going to have the aftermath of Mosul and the defeat of ISIL which I think is going to happen. You\\x92’re going to have that aftermath determine the future of several countries in that region if not the future of the region for many years to come and it\\x92’s going to be indicative of whether or not we\\x92’re going to be able to politically, diplomatically, economically and otherwise forge some kind of stability, some kind of peace, some kind of prosperity for the many young people in the region and bring people home from places like Jordan and Lebanon. And put them back in their own homes in places like Libya and Syria and so forth. The proof of the pudding as I said is going to be in the aftermath of Mosul, not necessarily in the tactical battle occurring there right now. \\nPERIES: Alright Larry, I\\x92ll let you go for now but looking forward to having you back next week. \\nWILKERSON: Thanks. Take care. \\nPERIES: And thank you for joining us on the Real News Network. 0 0 0 0 0 0 This entry was posted in Guest Post on'"}, "time": 1742628448.3413143}