{"duration": 0.18965744972229004, "input_args": {"text": "'During the opening monologue of “Tucker Carlson Tonight,” host Tucker Carlson offered his thoughts on last week’s controversy involving Kathy Griffin holding up a severed bloodied mannequin head of President Donald Trump.  After apologizing, Griffin later held a news conference and declared herself to be the victim, to which Carlson said was a signal of her embodiement of the left. Transcript as follows: Earlier this week, as you just saw, Kathy Griffin released a video of herself posing with a bloody mannequin head made up to look like President Trump, comedy that failed completely, nobody thought it was funny. As performance art, it was lame, least creative stunt of the week by far. As a political statement it didn’t even make any sense but it did have the effect of briefly making Griffin famous again and of course, that was likely the whole point. Today, Griffin elbowed her way back into the news cycle holding a press conference with celebrity misery chaser Lisa Bloom, here’s part of what she said. (BEGIN VIDEO CLIP) KATHY GRIFFIN,   COMEDIAN: Imagine that I participated in. That apology absolutely stands. I feel horrible. I have performed in war zones, the idea that that people think of this tragedy, have been touched by this tragedy is horrifying and it’s horrible. Thrust me, if I could redo the whole thing, I would’ve had a blowup doll and no catch up. I’m going to make fun of the President and, you know, what, I’m going to make fun of him more now, more. I’m not afraid of Donald Trump, he’s a bully. I’ve dealt with older white guys trying to keep me down my whole life, my whole career. I just wanted to say, you know, if you don’t stand up, you get run over. And what’s happening to me has never happened ever in the history of this great country. Which is that a sitting president of the United States and his grown children and the First Lady are personally I feel personally trying to ruin my life forever. This is America, and you shouldn’t have to die for it. The death threats that I’m getting are constant and they are detailed and they are serious and they are specific. And today it’s me, and tomorrow it could be you. I don’t think I will have a career after this. I think he  —   I’m going to be honest, he broke me. And then I was like, no, this isn’t right, it’s just not right. There’s a bunch of old white guys trying to silence me and I’m just here to say that’s wrong. CARLSON: That’s just unbelievable, I don’t know where to begin. Kathy Griffin isn’t particularly talented or amusing, he does have a point, it’s a little disproportionate for all of us to keep so much attention on someone who probably shouldn’t be famous in the first place, so why are we doing this segment? Because whether she realizes it or not and I bet she has no idea, Griffin is an important figure in American life and that she’s the perfect embodiment of what the modern left beliefs. Consider carefully what she said today. Griffin publicly fantasizes violently about murdering the President yet she holds a press conference to announce she’s the one who has been wronged. Trump and his family bullied her she says, so have unnamed older white guys who have oppressed her despite giving her a series of very high paying jobs. In other words, she is the real victim here. Of course she is, liberals are always the victims. Being the victim is virtually what it means to be a member of the progressive America. It has more benefits it turns out than AAA and it’s free. It means never having to say you’re sorry, it also means being right even when you’re wrong. Victimhood is the modern equivalent of holiness, it excuses anything. That’s why liberals will say almost anything no matter how ludicrous to get it. Do you remember when President Obama the most powerful human being in history use to imply that he was somehow the victim of racial bias? Did you catch Hillary Clinton the other day, a woman so rich and pampered, she hasn’t driven her own car in 30 years complain that sexism prevented her from becoming even richer and more pampered. Before you laugh, remember that overpaid sports figures make these kinds of claims all the time, entertainers  —   even TV anchors and now even   unfunny comedians. We see a trend here because there is one. Wait, if the most powerful and richest people on the planet can be victims, who can’t be a victim? Good question. The most remarkable thing about victimhood as that it allows the alleged victims to commit to the very offenses they are complaining about. They will punch you in the face and accuse you of assault. Or more specifically smash you in the head with the bike lock and then complain you’re making them feel unsafe. They’ll crush a bible club at a school that never even been to and then tell you that other people’s beliefs oppressed them. They will take over a college campus forcing spineless administrators to enact every one of their demands and then claimed to be powerless victims of a climate of racism. And then they will conduct a nationwide   for Christian small businesses trying to shut them down if they don’t violate their own faith. They will throw illiterate refugees into   public schools and call you a bigot for questioning it. Oh, well, they fled a $50, 000 a year private schools for their own kinds. And then of course, they will fly private even as they berate you for destroying the world with your SUV. It used to be that the point of running a country was to make things better for the people who live there. That has changed. Now the goal, it’s almost explicit is to achieve moral superiority over the population often while making their lives worse. It’s quite a trick and victimhood makes it possible. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742562629.7568243}