{"duration": 0.14389991760253906, "input_args": {"text": "\"Democracy Now Standing Rock Special Share on Facebook Tweet Part 1 - Unlicensed #DAPL Guards Attacked Water Protectors with Dogs & Pepper Spray Many across the United States are celebrating this Thanksgiving holiday. But many for Native Americans observe it as a National Day of Mourning, marking the genocide against their communities and the theft of their land. We spend the hour looking at the standoff at Standing Rock in North Dakota—the struggle... read more \\nPart 1 - Unlicensed #DAPL Guards Attacked Water Protectors with Dogs & Pepper Spray \\nMany across the United States are celebrating this Thanksgiving holiday. But many for Native Americans observe it as a National Day of Mourning, marking the genocide against their communities and the theft of their land. We spend the hour looking at the standoff at Standing Rock in North Dakota—the struggle against the $3.8 billion Dakota Access pipeline that has galvanized the largest resistance movement of Native Americans in decades. The movement has largely been ignored on this year’s presidential campaign trail and by the national corporate media. But Democracy Now! has been covering the standoff closely. We begin with our report from North Dakota Labor Day weekend. It was Saturday, September 3, when unlicensed Dakota Access security guards attacked water protectors trying to defend a sacred tribal burial site from destruction. - 13mins \\nPart 2 - Standing Rock Special: Historian Says Dakota Access Co. Attack Came on Anniv. of Whitestone Massacre \\nWhile reporting from the standoff at Standing Rock in September, Democracy Now! sat down with Standing Rock Sioux tribal historian LaDonna Brave Bull Allard to speak about another attack against her tribe—this one on the same day 153 years before. On September 3, 1863, the U.S. Army massacred more than 300 members of the Standing Rock Sioux Tribe in what became known as the Whitestone massacre. LaDonna Brave Bull Allard is not only the tribal historian, she’s also one of the founders of the Sacred Stone Camp, launched on her land April 1, 2016, to resist the Dakota Access pipeline. - 7mins \\nPart 3 - Dakota Excess Pipeline? Media & Water Protectors Face Strip Searches, Jail \\nToday we’re revisiting Democracy Now! reports on the ongoing standoff at Standing Rock in North Dakota, where thousands of Native American water defenders are resisting the construction of the Dakota Access pipeline, over concerns a pipeline leak could contaminate the Missouri River, which provides water for millions of people. Their resistance has been met by increasing repression by hundreds of police officers from North Dakota and surrounding states, as well as by unlicensed pipeline security guards, who unleashed dogs and pepper spray against Native American protectors on September 3. Five days after the Democracy Now! report on the attack went viral, Morton County issued an arrest warrant for Amy Goodman. The original charge against her was criminal trespass. Yet, on Friday, October 14, after Democracy Now! returned to North Dakota to challenge the charges and to continue covering the resistance to the Dakota Access pipeline, we learned that the state’s attorney, Ladd Erickson, had dropped the criminal trespass charge for lack of evidence, but had filed a new charge: riot. We feature part of our live broadcast from outside the Morton County Courthouse on the morning of October 17 as we waited to see whether Judge John Grinsteiner would approve the new riot charge, and speak with Tara Houska, national campaigns director for Honor the Earth, and with Anishinaabe activist Winona LaDuke, co-founder of Honor the Earth. - 21mins \\nPart 4 - Dallas Goldtooth on Police Violence & Repression of Movement Against DAPL \\nWe continue our look back at Democracy Now!'s coverage of the ongoing standoff at Standing Rock in North Dakota, where thousands of Native American water defenders are resisting the construction of the $3.8 billion Dakota Access pipeline. In recent months, the repression against the water protectors—and journalists covering the movement—has continued to intensify. The state of North Dakota has approved $10 million to police the ongoing protest, and Morton County Sheriff Kyle Kirchmeier has called in hundreds of deputies from neighboring states. North Dakota Governor Jack Dalrymple has also activated the National Guard. Riot police with military-grade equipment have attacked the Native American protectors with pepper spray, tear gas, bean bag rounds, rubber bullets and sound cannons called LRADs—that's a long-range acoustic device. Water protectors also report near-constant surveillance from police planes and helicopters. Over 400 people have been arrested during the ongoing protests, and many report being subjected to strip searches while in the Morton County jail in North Dakota. On October 31, we spoke with Dakota and Dine activist Dallas Goldtooth of the Indigenous Environmental Network about a violent police raid on a frontline camp established at the site of the same sacred tribal burial ground where unlicensed Dakota Access security guards attacked Native Americans with dogs and pepper spray on September 3. - 14mins [watch video below]\""}, "time": 1742562985.3556833}