{"duration": 0.19988799095153809, "input_args": {"text": "'Idi Diallo started playing soccer when he was 5, living in a small Ivory Coast village, kicking a ball on his family farm through two rocks that served as the goal. Even as he played, he could see troops fighting in the distance and hear gunfire ringing out in the civil wars that raged through his childhood. He practiced every day, dreaming of playing in professional European soccer leagues. He had never seen a soccer game on television  —   played on pristine fields with roaring fans  —   but at 11, he left his family for Abidjan, the country’s largest city, to play for a local team for the next three years. He also joined the Ivory Coast national team and traveled to Ghana, where the team made the semifinals in a tournament of African nations. In 2010, he got a chance to play in Italy for the AC Milan Football Academy Camp, a youth program sponsored by the elite Italian football league. But when a relative in Milan was unable to house him, he decided to pursue his dream in the United States. Then 15, Mr. Diallo boarded a plane with a friend of his brother’s and headed to New York. They settled in the Bronx, but when his companion returned to Africa a month later, Mr. Diallo found himself alone on the streets. A practicing Muslim, Mr. Diallo found refuge at the Musa Mosque Islamic Center in the Bronx, where he often slept in the prayer hall. He also informally played soccer with the Fordham University team. “He’d have played me, but I didn’t have a diploma,” Mr. Diallo said of the coach, recalling an interaction on the field. “He said, ‘Where do you come from?’ And I said, ‘You don’t want to know. ’” Then a friend at the university invited him to play in pickup games at Heritage Field, the site of the original Yankee Stadium. That is where Mr. Diallo met Fernando Rodriguez, a   high school basketball coach battling advanced melanoma, who watched the games. Mr. Rodriguez approached Mr. Diallo after a game to compliment his performance. Mr. Diallo spoke little English, but he recognized Mr. Rodriguez’s accent and responded in Spanish  —   the language he had chosen to learn at the soccer academy in Ivory Coast. “So from then, we started talking,” Mr. Diallo said with a smile. “It was a good moment. As time went by, he asked me about my life. I don’t like talking about my problems the past is in the past. But he’d take me to eat at a nearby cafeteria, and he’d ask small questions. He asked where I lived, and I said, ‘No house for me,’ and he invited me to stay with him. ” A month after their initial meeting, Mr. Diallo accepted an invitation for a   dinner and saw Mr. Rodriguez’s spare room. “There was no way I’d find something better than that,” he recalled thinking. Mr. Diallo, then 17, moved in and enrolled at Urban Assembly Media High School in Manhattan, starting as a 10th grader. He took classes to learn English and joined the soccer team, which won the championship in his first year. Mr. Rodriguez became Mr. Diallo’s legal guardian and started filling out paperwork to adopt him. But his health continued to decline, and a year after taking in Mr. Diallo, he was admitted to a hospital. This time, it was Mr. Diallo’s turn to take care of the man who had taken him in. He took warm meals to him and visited him often, updating him on his success at school. Mr. Rodriguez still managed to sponsor Mr. Diallo for his green card and help him apply for legal immigration status. Four months after Mr. Rodriguez died, Mr. Diallo learned that his immigration application had been approved. “When he passed away, it was hard,” Mr. Diallo said, shaking his head. “He’d become my father. ” He played a game the day of Mr. Rodriguez’s funeral. And he continued classes. “I had to stay in school,” he said. “I couldn’t give up on something he’d helped me work toward. ” On a cold November morning, Mr. Diallo sat inside Create Young Adult Residences, a transitional housing program serving men 18 to 25, where he has lived since February 2015. Create is affiliated with Catholic Charities Archdiocese of New York, one of eight organizations supported by The New York Times Neediest Cases Fund. Mr. Diallo, now 20, recalls with pride the life he has lived after his mentor’s death. He graduated from high school in June and was accepted to both the College of Staten Island and LaGuardia Community College. It is a far different future from the one he imagined in Ivory Coast, where he spent few years getting a formal education schools were often closed during the wars. He received a $2, 000 scholarship from the National Association for Education and Homeless Children and Youth. The New York Public Library awarded him a laptop for academic excellence, and Catholic Charities used $350 from The New York Times Neediest Cases Fund to pay for his schoolbooks. Financial aid will cover his academic costs for the first two years at both schools. It will not cover his room and board, but he qualifies for an $800 rental subsidy from the city. In addition to working part time as a waiter, bringing in about $600 a month, he plays midfielder for Boca Juniors   affiliated with Argentina’s premier student soccer league. He travels to Long Island three days a week to practice, and has had tryouts with professional soccer clubs across the country, including the San Francisco Deltas and LA Galaxy II. Additional tryouts are scheduled for FC Miami City and Orlando City Soccer Club in January. He has also been invited for a return tryout in Los Angeles later in January but is unable to afford the plane fare. He laughed and shook his head, reflecting on the future, hopeful yet unwilling to wish too much. “If God gets me on a team  —   whatever team  —   this year, and I do well . ..,” he said, his words trailing off. “With agents watching those games, you never know. ” He is waiting to choose a college until he hears back from professional soccer teams, and plans to start classes after tryouts conclude in February, studying business accounting or physical therapy. If he makes a team this year, he said, he plans to continue school in that city. Regardless of where the next few months take him, Mr. Diallo said, he will keep working to become a professional soccer player. “I could do without anything  —   live on the street  —   to play soccer,” he said. “And I’ve done that. I’ve been dreaming about this day since I was born. ”'"}, "time": 1742628319.4751096}