{"duration": 0.06618189811706543, "input_args": {"text": "'Getty - Chip Somodevilla \\nEach Republican presidential candidate had to pledge their support for the eventual GOP nominee when they filed their initial statement of intent to run and be placed on the ballot in the South Carolina primary, no matter what. But it remains unclear of what will happen for candidates who break that rule. \\nWhen a candidate files to be on the ballot in South Carolina, they must write down their name and address before a signing below a paragraph that in part reads: \\n“I hereby affirm that I generally believe in and intend to support the nominees and platform of the Republican Party in the November 8, 2016 general election...” \\nBut a handful of Republicans have opted out of that promise to endorse Donald Trump, including Ohio Governor John Kasich, former Florida Governor Jeb Bush, former New York Governor George Pataki and Sen. Lindsey Graham. In addition, businesswoman Carly Fiorina withdrew her previous endorsement of Trump. \\nAnd if those candidates want to run again, they might face considerable hurdles in the Palmetto state, according to top Republican officials. \\nSouth Carolina Republican Party chairman Matt Moore told Independent Journal Review that there are “no definitive punishments related to South Carolina’s pledge” but that any candidate who refuses to back the nominee “does so at their own political peril,” adding: \\n“The political consequences would be in the minds of the voters. I expect that anyone who runs in 2020 without supporting the nominee in 2016 will find themselves in difficult situation in South Carolina.” \\nHowever, the party could impose restrictions on candidates who violate the pledge, if they want. Moore said that while the South Carolina GOP\\'s executive committee certainly has the authority to impose penalties, they have yet to meet on the subject. \\nMore stern on the prospect of penalizing candidates who do not get on board with Trump was Republican National Committee chairman Reince Priebus, who said last month that the GOP is going to take a second look at how their members can launch presidential bids. \\n“And if they’re thinking they’re going to run again someday, I think that we’re going to evaluate the process,” Priebus said. \"And I don’t think it’s going to be that easy for them.” \\nAs to whether or not the GOP can bar individuals from running on their primary ballots, University of South Carolina associate professor Ben Means told Independent Journal Review that “political parties have a fair amount of discretion to control rights of participation,” so it would not matter all that much that candidates breached the contract. \\nThe South Carolina GOP could alter their rules to block the candidates from running again or they could absolve the disloyal candidates in the event of a catastrophic Trump loss. Either way, an evaluation of ballot access is in store for the Republican Party come November 9th. '"}, "time": 1742564137.2183022}