{"duration": 1.3752062320709229, "input_args": {"text": "'CANNES, France  —   Last year’s Cannes Film Festival was abuzz with the “heel gate” microscandal after a security guard reportedly wouldn’t let women wearing flats onto the red carpet. This year, Julia Roberts strode up the   steps for the premiere of Jodie Foster’s “Money Monster” and revealed that beneath her gown she was barefoot. The gesture seemed to capture the spirit of this year’s festival, where women of substance were much in evidence. After years in which the festival was criticized for favoring male auteurs, this year three female directors have strong films in competition, including Maren Ade, a German whose poignant comedy “Toni Erdmann” is seen as a likely contender for the top prize, the Palme d’Or. (Jane Campion is the only woman to have won that award, in 1993, for “The Piano. ”) Besides Ms. Ade, the other women with films in competition are the British director Andrea Arnold, whose “American Honey,” a road movie starring Shia LaBeouf and the   actress Sasha Lane, has been receiving rave reviews (along with some pans) and the French   Nicole Garcia, whose “From the Land of the Moon” stars Marion Cotillard as a troubled,   Frenchwoman in the 1950s and has received mixed reviews. “It’s great there are three women directors here, but there’s still a lack of women making films,” Ms. Arnold said after a news conference for “American Honey. ” Lizzie Francke, a senior production and development executive at the British Film Institute’s Film Fund, echoed those sentiments. “It’s obvious that this year is a pretty good year,” she said, “but I also still feel it’s not good enough. ” She called Cannes “a venerable old man’s festival, but with a cutting edge. ” Even if Cannes’s selection, like the film industry itself, hardly achieves gender parity, there’s been more conversation this year about the challenges of getting more women behind the camera and in front of it, an issue that has heated up since the American Civil Liberties Union last year called for an investigation into gender discrimination in Hollywood hiring practices. At an event where the luxury consortium Kering gave an award to Susan Sarandon and Geena Davis 25 years after the release of “Thelma and Louise,” Pierre Lescure, president of the festival, said that maybe in a few years there would be a woman in his place and in the place of Thierry Frémaux, the festival’s director. The audience applauded. “I think more and more women starting production companies” would help, Ms. Sarandon said, adding: “Hollywood isn’t political one way or another  —   that’s the good news and the bad news. They just go with the money. ” Ms. Davis, who founded the Geena Davis Institute on Gender in Media, recalled how after “Thelma and Louise” came out in 1991, the film was hailed as groundbreaking there were suggestions it might lead to more films   women. That hasn’t entirely happened. “I think we have to stop saying, ‘Now this will change everything,’” she said. “If you can’t measure the change, it hasn’t happened. ” Ms. Davis said that she advised studios and TV networks to “Make what you’re already going to make,” but “before you cast it, just go through and change a bunch of names to female. ” Ms. Foster, whose “Money Monster” (playing out of competition) is her fourth feature as a director, said that the technological changes of recent years, like the advent of streaming services, had made studio executives and producers far more  . That, she said, led them to tend to take big bets on projects they hope will draw huge audiences rather than investing in smaller films by unknown directors, including women. Before investing millions of dollars, “you’re going to go with the guy who looks like you,” Ms. Foster said at a Kering Women in Motion talk. She said that many scripts written by and for women were just not being produced. “It’s a financial issue, it’s where art and commerce come together and commerce is winning,” she said. “It used to be that the investment was not as large, so the risk was not as large. ” This week at Cannes, We Do It Together, a nonprofit film company started last year by Juliette Binoche and others aimed at making work by women for film and television, announced its first project: “Together Now,” a film of seven short episodes by different directors, including Robin Wright and Catherine Hardwicke, and starring Freida Pinto and Ms. Binoche, among others. At this year’s festival, even the starlets seem to have more edge. Kristen Stewart, called “the queen of Cannes” by Mr. Frémaux because she is starring in two films here, changed into a miniskirt and sneakers for the dinner following the   film last week, Woody Allen’s “Café Society,” in which she plays against the girlish confines of her role. At a news conference, Mr. Allen said he had chosen Ms. Stewart, whose character is caught between those played by Steve Carell and Jesse Eisenberg, because “I needed someone who could play an adorable little secretary from Nebraska with little white socks on and little dresses,” but who could also transform into “a sophisticated beauty in cosmopolitan Manhattan. ” Ms. Stewart, whose range far exceeds adorable, elaborated on Mr. Allen’s description. “The way he describes this lightness and this feminine nature, it does suggest that it’s a little thoughtless,” she said at a lunch with the news media. “I think he has a tendency in interviews to say, ‘It was an idea and I had the idea and I wrote the idea and I hired the girl and she did it,’” Ms. Stewart added, imitating Mr. Allen’s cadences. “But there’s more going on,” she said. (Ms. Stewart also stars in “Personal Shopper,” by the French director Olivier Assayas, which screens in the competition here on Tuesday.) Vanessa Redgrave said that she didn’t envy young women starting out today. “I feel very respectful of them and tender toward them,” Ms. Redgrave said at an event to promote a newly restored version of “Howards End,” the 1992 Merchant and Ivory film set in the early 20th century in which her character doesn’t think women should be allowed to vote. “It’s like a voracious sort of market,” Ms. Redgrave added of the fame machine. “It’s grotesque. ” Carrie Fisher, who grew up in the public eye, said she still found it difficult that women in Hollywood are judged by their looks far more than men are. She was at Cannes for the premiere of “Bright Lights,” a documentary about her and her mother, Debbie Reynolds, directed by Alexis Bloom and Fisher Stevens. “Someone wrote a review that both my mother and I look exhausted,” Ms. Fisher said over tea while her dog sat in the next chair. “And they can say that. They are at liberty to say that,” she added. “In L. A. you’ll find more people saying, ‘You look great,’ not ‘You seem great,’ ‘How are you?’ ‘What are you doing? ’” The only women on most sets are still mainly actresses and hairdressers, she said, adding that that was also the case for the new “Star Wars” movie, which she is now shooting. “I’m a female in it,” Ms. Fisher said just one notch up from deadpan, of her role as General Leia. “An exhausted female. ”'"}, "time": 1742562623.9376287}