{"duration": 0.08261561393737793, "input_args": {"text": "'By Jonas E. Alexis on October 31, 2016 Thomas Friedman of the New York Times: The plan for war in Iraq “was disseminated by a small group of 25 or 30 neoconservatives, almost all of them Jewish, almost all of them intellectuals...\" …by Jonas E. Alexis \\n\\nIf you don’t think that the New World Order and its agents believe in conspiracy theory, or if you don’t think that they are actually scared of Russia and are looking for World War III, think again. Listen to Alex Lockie of Business Insider very carefully here: \\n“Russia now challenges the West in virtually every arena possible, with cyberattacks, nuclear posturing, military invasions of Western-leaning countries, and the intimidation of US allies and neutral states.” [1] \\nThroughout his article, Lockie didn’t even attempt to present rigorous evidence for this bold claim, and we know why. As we have seen over and over again, the New World Order and its agents do not believe in evidence at all. They do not believe in rigorous testing or logical argument, which is (or was) one of the main pillars of the West, going all the way back to Plato. \\nThe New World Order and its agents believe in manipulation, fabrications, hoaxes, and just plain lies. They have a history of doing just that: in World War I, in World War II, in Iraq, in Afghanistan, in Libya, and now in Syria. They still think that they can manipulate the masses at will. \\nLockie cites Jeffrey Lewis of Arms Control Wonk saying, \\n“We’ve seen the failure of democratic institutions in Russia. It’s not the open and free society that we had hoped for at the end of the Cold War, and with that failure comes an insecurity on the part of Moscow’s leaders.” [2] \\nWe all know this is nonsense by now. If the West or at least America believes in democracy, we wouldn’t have the wars in Iraq and Afghanistan because the vast majority of Americans didn’t want them. [3] But a small group of people known as the Neoconservatives decided to advance perpetual wars in the Middle East for Israel. [4] \\nAnd if you think this is conspiracy stuff, take it from flaming Zionist Thomas Friedman of the New York Times . He told Haaretz way back in 2003 that that the plan for war in Iraq “was disseminated by a small group of 25 or 30 neoconservatives, almost all of them Jewish, almost all of them intellectuals (a partial list: Richard Perle, Paul Wolfowitz, Douglas Feith, William Kristol, Elliott Abrams, Charles Krauthammer), people who are mutual friends and cultivate one another and are convinced that political ideas are a major driving force of history. “They believe that the right political idea entails a fusion of morality and force, human rights and grit. The philosophical underpinnings of the Washington neoconservatives are the writings of Machiavelli, Hobbes and Edmund Burke.” [ 5] \\nRead those statements very carefully again. Just 25 or 30 Neoconservatives decided to send America, which had about 290 million people in 2003, to Iraq! And we all know what happened then. There are some people on the lunatic fringe who keep saying that the war was a success, but we can ignore those people because they do not know what they are talking about. YouTube - Veterans Today - \\nPaul Wolfowitz was so aggressive about invading Iraq that one Republican lawmaker declared Wolfowitz “was like a parrot bringing [Iraq] up all the time. It was getting on the President’s nerves.” [6] After one such meeting in Washington, we are told that Colin Powell rolled his eyes, declaring, “Jeez, what a fixation about Iraq.” [7] \\nKenneth R. Weinstein of the Hudson Institute, a Neoconservative think tank, noted that in May of 2003, “we Neoconservatives were hailed as great visionaries.” But when the war turned out to be a disaster, “Now we are embattled, both within the conservative movement and in the battle over postwar planning.” [8] \\nIn any event, we know that Iraq was a disaster. But Alex Lockie does not want to talk about that because that would ruin his career or his ideological weltanschauung . If people know that it was only about 30 people who orchestrated the war in Iraq, then obviously they will realize that we are not living in a democracy at all—at least the kind of democracy that the regime itself is perpetuating. \\nAnd if Lockie wants to talk about democracy, why are we still in Syria? Does he really think that the vast majority of Americans again support that war? What is his assessment on democracy? Does he really think that democracy can work without the moral law and political order? \\nLockie will never address these issues in a logical fashion. He writes, “Democracy provides countries like the US with a stable, established path for power changing hands.” [9] If you usually get your entertainment by reading nonsense and contradiction in the media, perhaps it is time for you to grab your munchies and read Locike’s statement again and chew on it a bit. \\nCan Lockie really tell us that America has been really democratic even for the past seventy years or so? And why is Lockie silent about the so-called Syrian rebels killing civilians? [10] It has been reported that “Over 16,000 Syrians killed by US-backed rebels since February.” [11] Where is Lockie when you really need him? \\nYou see, Lockie hasn’t even made an attempt to answer those issues. Perhaps this is why he is a slave to his own political passion and appetite. Perhaps this is why he has implicitly or indirectly given allegiance to the New World Order.'"}, "time": 1742562901.1426992}