{"duration": 0.02429819107055664, "input_args": {"text": "'A Tom Brady fan and photographer named Abdul Dremali just became an instant Twitter star after giving some very specific advice about what ESPN could do to itself after a network staffer asked the man for permission to use a photo he took at the Boston Marathon. [On April 17, Dremali snapped a photo of a man “motivating the runners” at the Boston Marathon, then posted the image to Twitter.  this guy is at the #BostonMarathon right now motivating the runners. i love boston. pic. twitter.   —   abdul Ὠ (@Advil) April 17, 2017,  It wasn’t long before several media operations asked him for permission to use the photo, one of which was ESPN. But Dremali, whose Twitter page is headed by a series of photos of New England Patriots star quarterback Tom Brady, was not much interested in allowing ESPN to borrow his photo for its own use. In fact, he had some very stark advice about what ESPN could do with itself. i love twitter so much bro pic. twitter.   —   abdul Ὠ (@Advil) April 17, 2017,  Naturally, a lot of other Twitter users found Dremali’s reply to be hilarious. @JackPosobiec God that made me smile! !!  —   Allan Scott (@commonguy123) April 18, 2017, @JackPosobiec @vandives This is frickin awesome! I hate ESPN, they have become nothing more than a Democrat SuperPAC.  —   David McGauley (@DavidUndfsioux) April 18, 2017, @JackPosobiec Oh, my goodness! Best laugh of the day. Good for youAbdul. It looked like a witch hunt to me and I don’t follow football!  —   Deborah Diltz (@DeborahDiltz) April 18, 2017, @JackPosobiec @vdare Awesome ESPN is an   racist, LGBT bathroom loving piece of chit,  —   jimmy campbell (@txjimmy34) April 18, 2017, @Advil *Bows down to greatness* Totally my favorite tweet of all time!  —   Deplorablefor#45 (@vilevillainess) April 18, 2017, @Advil @MistahWoodhouse You’re my hero,  —   Casey (@WitherSpartanIV) April 18, 2017, @Advil this is EVERYTHING!!  —   Brian Drourr Photo (@BrianDrourr) April 18, 2017, @Advil Bro, apparently you owned Twitter yesterday\\u200b after you let @espn have it.  —   Brandon L Thacker (@ThackerbrandonL) April 18, 2017, Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628565.486326}