{"duration": 0.03197121620178223, "input_args": {"text": "'Actor Woody Harrelson is almost as famous for his outspoken advocacy of marijuana as he is for his movie roles, but now, after 30 years of advocacy, Harrelson is swearing off pot. [In a new interview, the Hunger Games star revealed that his pot smoking days are over. Harrelson, 55, told Vulture that he stopped smoking pot a year ago.  “I am a party animal,” the Oscar nominee said. “But on the other hand, I haven’t  …     I’m now extremely moderate, and  …     I actually stopped smoking pot almost a year ago. ” The interviewer noted that he, too, had “a problem” with pot saying that it “messed with his head” and made him “less productive. ” Harrelson agreed to a degree with that characterization, saying, “Yeah, that was a little bit of my issue. Just 30 solid years of just partying too f***ing hard. ” This might shock some of the actor’s   fans. After all, Harrelson has been a longtime fan of pot. So much so that he has publicly supported the marijuana organization NORML (National Organization for the Reform of Marijuana Laws) has served on the organization’s board, and even once applied to open a medical marijuana dispensary in Hawaii. Perhaps realizing he was bucking years of advocacy, Harrelson was quick to add that he is still a supporter of pot. “I don’t have a problem at all with smoking. I think it’s great. I think it’s a great drug, in terms of  …     Even cops say that the side effect is euphoria. Or the   …     what do you call it?  …     The effect of it is euphoria,” he said. “But when you’re doing it all the time, it just becomes   …     Well, you know. I feel like it was keeping me from being emotionally available. I really don’t want this interview to turn into a whole thing about that. ”   Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562049.1308768}