{"duration": 0.06520652770996094, "input_args": {"text": "'Foreign Affairs Confronts Trump’s ‘Populism’   26, 2016 \\nThe Globalization of Rage Why Today’s Extremism Looks Familiar … Militant secessions from a civilization premised on gradual progress under liberal democratic trustees—the kind of civilization that D’Annunzio and his peers denounced as feeble and corrupt—are once again brewing within the West and far beyond it: and as before, they are fueled by a broad, deep, and volatile desire for destruction. –Foreign Affairs \\nThis is the single most important article we’ve read in Foreign Affairs in years. It grows out of the “populism versus globalism” meme we’ve been tracking regularly. \\nWe believed from the beginning that this meme would prove extremely important. The idea was that populism would be contrasted unfavorably to globalism and that this would be developed via directed history. \\nWe tend to think Brexit is an example of this. It still doesn’t make sense that Brexit passed when British electoral facilities are controlled by globalist elites. In other words, Brexit’s passage may have been purposeful. \\nThe idea, for instance, would be to ensure that Brexit has a broad array of negative consequences for the British. Paint Brexit as “populist” and then paint its negative consequences as occurring because the wise precepts of globalism were not adhered to. \\nThis is how elite propaganda works. Create a dialogue and then enforce it with the economic, legislative and military consequences – all of which are controlled by the dialogue-makers. \\nGlobal warming doesn’t exist, or not in fashion represented in the popular media. But global warming has been acted upon economically and legislatively throughout the world. \\nLikewise, “populism versus globalism” is a meme – a rhetorical construct – not a reality. \\nBut there can be little doubt now that those behind the meme intend to make real. We can see the rhetoric heightening. \\nThe consequences of a “populist” Brexit are going to be determinedly negative. If the “populist” Trump is elected in the US, the consequences will likely be similarly disastrous – and blamed on his populism. \\nForeign Affairs is the magazine of the Council on Foreign Relations, which is the elite sister of the elite-controlled British Roundtable. Foreign Affairs magazine enunciates elite banking policies. \\nIn this case, we would do well to pay heed to an emergent meme that will define the next decades. \\nIt is not enough to suggest globalist remedies. An entire argument must be constructed around globalism if it is to be fully implemented. \\nAnd since the preferred device is Hegelian – thesis and antithesis giving way to synthesis – one needs to establish two sides. Globalism is the thesis here. Populism the antithesis. The synthesis will be a more fully emergent globalism. \\nIn the highly charged rhetoric of this Foreign Affairs article, we can see just how vehemently this emergent meme is being pursued. \\nIn reality, today’s malignancies are rooted in distinctly modern reactions to the profound social and economic shifts of recent decades, which have been obscured by the optimistic visions of globalization that took hold in the aftermath of the Cold War. \\nNotice the language. Globalism is optimistic. Its alternative (populism) is “malignant. \\nThen there is this: \\nBehind all these developments lies the fact that globalization—characterized by the mobility of people, capital, and ideas and accelerated by the rapid development of communications and information technology—has weakened traditional forms of authority everywhere, from Europe’s social democracies to the despotic states of the Arab world. \\nIt has also produced an array of unpredictable new international actors that have seized on the sense of alienation and dashed expectations that defines the political mood in many places. \\nThe extremists of ISIS have exploited these changes with devious skill, partly by turning the Internet into a devastatingly effective propaganda tool for global jihad. \\nYou see? It is not enough to characterize populism as malignant. It must be conflated directly with ISIS. Trump, for instance, is not merely misguided. He is part of a larger terrorism. \\nAnd populism is to be conflated with “conspiracy theory” as well … actually a CIA-developed meme. In fact, populism – so the article informs us – is responsible for “lynch mobs and mass shooters.” \\nPopulist and extremist attacks on reasoned debate and evidence-based analysis have made it easier for conspiracy theories and downright lies to spread and gain broad credence. Lynch mobs and mass shooters thrive in a climate where many people think of others only in terms of friends and foes and where sectarian loyalty or nativist hatred override civic bonds. \\nThe article goes on to blame some of today’s disturbing violence and aimlessness on major media. \\nOf course, the article doesn’t tell us that most major media is controlled by a handful of individuals who run them to benefit the goals of the globalist elite. \\nHere’s the duplicitous characterization: \\nThe world seems beset by pervasive panic, which doesn’t quite resemble the centralized fear that emanates from despotic power. Rather, people everywhere find themselves in thrall to the sentiment—generated by the news media and amplified by social media—that anything can happen, anywhere, to anybody, at any time. \\nThe pervasive panic the article discerns is further complicated by the continued failure of globalism, which is disordering people “spiritually.” \\nIn places where globalized capitalism has not fulfilled its promise of opportunity and prosperity, culturally and spiritually disorientated people have become increasingly susceptible to demagoguery and extremism. \\nThe consequences of globalism, should it continue to fail, will include the disenfranchising of the world’s youth. \\nThe inheritance of modern youth will include “racist nationalism” that will remove or reduce “freedom and prosperity.” \\nThe sudden and rapid success of racist nationalists and cultural supremacists ought to make liberals wonder whether the millions of young people awakening around the world to their inheritance—which for even the richest among them includes global warming—will be able to realize the modern promise of freedom and prosperity, or if they are doomed to hurtle, like many Europeans in the past, between a sense of inadequacy and fantasies of revenge. \\nGenerally speaking, populism is to be feared as the worst of all results, should it grip the world more pervasively in its icy clutches. \\nMilitant secessions from a civilization premised on gradual progress under liberal democratic trustees … are once again brewing within the West and far beyond it: and as before, they are fueled by a broad, deep, and volatile desire for destruction. \\nThis is a broad and ringing affirmation of globalism, which as we recently pointed out, is at root a religion. \\nIt is an evil religion however, proposing the gathering together of the world’s population under a single ruler (or group or rulers) who will have near-absolute control over the world’s billions. \\nAll the negatives attributed to populism in this article are actually properties of globalism. But the rhetoric justifies the ascension of globalism and the removal of populism. \\nConclusion: Populism is painted as malignant, exploitative, racist and violent. These are not opinions either. This article is proposing a broad gamut of properties that the wise solons of globalism will have to act against and eventually remove. You may wish to consult the George Guidestones for the human costs involved.'"}, "time": 1742628471.4292018}