{"duration": 0.07732915878295898, "input_args": {"text": "'LONDON  —   At least 350 people have come forward to report abuse at the hands of youth soccer coaches in Britain over the past two weeks, the police said Thursday, deepening a child sexual abuse scandal that has engulfed English soccer. The scandal emerged last month after at least six former professional players publicly said they had been molested as boys in youth programs. The head of the English soccer players’ union last week said at least 20 more former players had come forward, many of them privately. The National Police Chiefs’ Council on Thursday said police forces had received a “significant” amount of calls since those first public revelations, and a children’s charity for victims of abuse said a new telephone help line it had set up had received 860 calls in its first week, 60 of which were referred to the police or to social services. The 350 figure cited by the National Police Chiefs’ Council is based on existing investigations as well as the referrals from the help line, officials said. At that size, the scale of the accusations may be even greater than those involving the British television celebrity Jimmy Savile, who, after his death, was found to have sexually abused 72 people, including children. Referrals made to the police through calls to the soccer charity help line are more than three times as many as those made in the Savile case, according to the charity, the National Society for the Prevention of Cruelty to Children. Peter Wanless, the charity’s chief executive, said the number of soccer players speaking out had caught the entire nation’s attention. “We have had a staggering surge in calls to our football hotline, which reveals the worrying extent of abuse that had been going on within the sport,” he said in a statement. David Eatock, 40, a former Newcastle United player, became the latest to speak out, telling the BBC on Thursday that he had been groomed between 18 and 21 by the coach George Ormond, who was convicted in 2002 of assaulting seven boys. Sixteen police forces across Britain are investigating accusations of past and present sexual abuse in soccer, and several clubs are conducting their own investigations. The London team Chelsea confirmed Tuesday that it had hired a law firm to investigate “an individual employed by the club in the 1970s who is now deceased. ” The Football Association, the body that governs soccer in England, which had stayed largely silent when the initial accusations were made, is conducting its own investigation. It has appointed Kate Gallafent, a lawyer with experience in sexual abuse cases, to oversee it. A number of clubs, including Newcastle United, Manchester City and Leeds United, have said they will help the police with their investigations. The scandal grew out of an interview with Andy Woodward, a former player with the   Crewe Alexandra, that was published by The Guardian on Nov. 16. In the article, Woodward said he had been sexually abused by a former coach, Barry Bennell. Bennell worked as a scout and coach for a number of clubs, including Crewe, across England’s North West during the 1980s. Woodward, now 43, said the abuse began when he was 11 and was invited to stay at Bennell’s house. He said Bennell had silenced him during the years of abuse with threats of further violence and of undermining his prospective soccer career. Woodward said Crewe had failed in its “duty to protect” those children under its care. Four more former players have since said they had been victims of Bennell. This week, Bennell was charged with eight counts of child sexual assault for offenses committed between 1981 and 1985.'"}, "time": 1742562144.6810331}