{"duration": 0.053452253341674805, "input_args": {"text": "'Every now and again, Koen Weijland feels like a professional soccer player. When Weijland, 24, was signed this year by his boyhood club, Ajax, in the Netherlands, he was given the No. 39 jersey. A few weeks ago, at an event in Amsterdam, some of the club’s younger fans recognized him as “that guy from the internet,” and he occasionally spends time at the club’s training center, on the outskirts of the capital, where he is known to some of the Ajax   players and coaching staff. But one notable difference separates Weijland from the club’s other young prodigies: While the players assigned the jersey numbers above and below Weijland’s No. 39 are paid by Ajax to use their feet, he is compensated for using his thumbs. Weijland is a recreational soccer player, but he is an expert in FIFA, the popular EA Sports game. Now, he is also one of a growing number of competitive gamers who, over the past year or so, have been signed by some of soccer’s elite clubs in an attempt to connect with the     market. Manchester City, Paris   Schalke, Sporting Lisbon, Valencia, West Ham United and Wolfsburg are just some of the other clubs that now have gamers representing them. “It’s a dream for every little kid to play for their favorite club when they are a ” Weijland, a   Dutch FIFA champion, said. “But I think, when I was 12 or 13 years old, I knew I wasn’t going to be good enough for that. So it’s amazing that that dream still came true in some way. ” The list of clubs with competitive gamers on their payrolls is expected to grow significantly over the next two or three years, executives at a number of clubs said, with some predicting that it would be feasible for all of Europe’s elite teams to one day have a gamer  —   or multiple gamers  —   involved in tournaments and fan engagement on their behalf. Some have signed players who are experts in games that have nothing to do with soccer, an effort by the clubs to stake out a toehold in the roughly $1 billion   marketplace. “If you are a global football club and you are concerned about missing a generation to people playing, say, League of Legends in their bedroom, go and get them,” said Peter Moore, the chief competition officer at Electronic Arts, which develops the FIFA game under its EA Sports label. “They haven’t had to work as hard in the past, because there’s not been these distractions. ” The growth of competitive   has been anything but an overnight phenomenon, with the market swelling from humble fighting and shooting games in the 1990s, when tournament prizes would be a few hundred dollars, to an industry that generates hundreds of millions of dollars annually. The global championships for games like Dota 2 and League of Legends, whose tournament prize pools are in the millions of dollars, currently see their finales pack arenas worldwide. The willingness of soccer clubs to increase their ties with electronic games like FIFA comes as no surprise, either. Many devotees are introduced to certain clubs and players  —   perhaps even influencing whom they support  —   through the series, and millions of people play it every day. The combination of the two, then, was “the most natural way to dip our toes into   without going into the mainstream games,” said Diego Gigliani, the senior vice president for media and innovation for City Football Group, the holding company that owns Manchester City (and New York City F. C. in Major League Soccer). “We see it as an extension of what we do with EA already. ” This year, Manchester City contracted Kieran Brown, 19, to represent the club at various FIFA tournaments and to act as a brand ambassador. Brown, who is known as Kez, has duties that include live streaming content on the social media service Twitch, creating videos for YouTube and fan engagement  —   meeting with children and teaching FIFA tricks  —   which usually takes place on game days. But while some   clubs have used an organic connection to FIFA as an entry point into the   market  —   or simply as a way to engage more millennials online  —   others have decided to sign players with the bigger, competitive picture in mind. “We started with League of Legends, and, as the second step, we chose FIFA,” said Tim Reichert, the head of   at the Bundesliga club Schalke, which has representatives for both games on its books. “It was much more about being convinced of the growth of   and that market in itself. A pro   decision, not pro any specific title. ” Reichert is an advocate for variety because FIFA  —   despite being the most popular sports title  —   represents only a small percentage of the revenue and audiences generated by other games in the broader   market. (The N. B. A. ’s Philadelphia 76ers are pursuing a similar strategy.) Still, there are obvious rewards to aligning with a  . Next year, FIFA’s showpiece tournament, the FIFA Interactive World Cup, will have an increased prize pool of $1. 3 million, with the winner taking home $200, 000  —   a tenfold jump from the $20, 000 grand prize last year  —   from a final that will be streamed live to a global audience from London. FIFA also will introduce the first Interactive Club World Cup in 2017, a competition specifically for gamers with ties to clubs, allowing them to compete on behalf of the teams they represent. In November, a tournament between some gamers who are already assigned to teams was held in Warsaw. “FIFA needs to keep introducing more incentives  —   more tournaments, leagues and better prizes,” said Márcio Figueiredo, an   director at Sporting Lisbon. “With that and the entry of more clubs, the game will become a truer  . ” It also will become more professional. Weijland, of Ajax, said that through his agent, Digital Enterprises, he was able to make a living from his work with the club and through the game. But most FIFA players tied to clubs have yet to do so through team connections alone. Some are students others hold down   jobs. David Bytheway, a    Englishman signed by the German club Wolfsburg, was the   in the FIFA Interactive World Cup in 2014, and he currently works for a   app in London. When he is not representing Wolfsburg at promotional events or in tournaments, Bytheway practices online with two other gamers  —   one Maltese, the other Canadian  —   and aims to play around six games a day to “keep fresh. ” Competitive online matches, one of the gateways to   tournaments, take place Fridays through Sundays. “Over the weekend, I’ll play as much as I can, get 40 games in, and then on the Monday I won’t play because I think I need a break,” Bytheway said. “Then, when the weekend comes, it starts all over again. ”'"}, "time": 1742628470.622407}