{"duration": 0.15242362022399902, "input_args": {"text": "'by Lambert Strether \\nBy Lambert Strether of Corrente . \\nThe FT’s Izabella Kaminska (“ The autoignition temperature of manual cars is much higher than Fahrenheit 451 “) brings McKinsey’s report on self-driving cars to our attention (“An Integrated Perspective on the Future of Mobility,” PDF ). Bloomberg, writing on the report , put the key fact-like price comparison in the deck: \\nAutonomous taxis one-quarter the price of New York cab ride \\nAnd then quoted the following eye-popping fact-like dollars-and-cents figure: \\nThe self-driving vehicles being pioneered by Tesla Motors Inc., Alphabet Inc.’s Google and others are poised to dramatically lower the cost of taxis, potentially making them cheaper than buses or subways, according to a joint report by Bloomberg New Energy Finance and McKinsey & Co. Having no driver to pay could reduce taxi prices to 67 cents a mile by 2025 , less than a quarter of the cost in Manhattan today, the report found. \\n(The word “could” seems to be doing rather a lot of work in the second sentence.) But how were those figures “found”? On what basis did McKinsey, the “the trusted advisor and counselor to many of the world’s most influential businesses and institutions” , come to its conclusions? \\nAnd here, readers, I went wrong. I thought I would try to understand the business ratios and income statements of today’s taxi industry ( NAICS code 4853 ; income statement from Yellow Cab of Missoula, MT[ 1]) and use those as a baseline to evaluate McKinsey’s analysis. That was a time-consuming mistake, and here is why. \\nLet’s look at the report, starting by having searched the PDF on “67.” Here is the source for Bloomberg’s quote, Exhibit 10: \\nI’ve helpfully highlighted the “67”; interestingly, a PDF search reveals that this is the only place where “67” appears. There is, for example, no table or equation showing the calculations through which McKinsey arrived at that figure.[2] Nevertheless, we look for some explanation, and the best I can find is in the text adjacent to Exhibit 10, on pages 23 and 25. (I’ve pasted a snippet from page 23 in at the top of page 25, and helpfully highlighted some of the text, and footnote 17): \\nNow, the $0.67 figure in Exhibit 10 applies only to the case of an “individual use” self-driving taxi (the chart says “self-driven,” but the caption is correct). That is, Jane Coder calls up a self-driving taxi to get to work, and when she’s done with her commute, the freed-up taxi responds to a call from Joe Coder to go home, and so on. The taxi is not shared. This use case is described in the paragraph marked “[1]”. Here is that paragraph: \\nFor many drivers ride-hailing would nonetheless become the economic alternative. An on-demand, self-driving vehicle could also replace most current shared-mobility business models such as car sharing, carpooling, and ride-hailing: it could drive itself to the next customer, to a designated parking space, or back to the point of origin. \\nDo you see any calculations there — indeed, any numbers at all — that would justify the $0.67 figure? No? (Notice also that “could” and “would” are working hard in this paragraph, too.) \\nWe move on to the paragraph marked [2]: \\nIf a private consumer were open to sharing a ride with another traveler, the economics become even more attractive: on average, using a self-driving, electric, pooled taxi could be 30–60 percent cheaper per mile than a private vehicle, depending on the number of people sharing the ride. By 2025, a private car would cost $0.43/mile, whereas a consumer could use a self-driving, pooled taxi for as little as $0.17/mile–$0.29/mile 17 . \\nHere at least we see claims with numbers in them, but none of them are relevant to the “individual use self-driving taxi” case, and so the $0.67 figure remains a mystery, as yet unexplained. We move on to the paragraph marked [3]: \\nCompared with public transport, it appears that in various US cities public transport remains about as twice as cheap as human-driven taxi pooling with a cost of $0.64/mile in 2015. \\nThe same applies; the $0.67 figure remains inexplicable. But wait! There’s that footnote 17 in the paragraph marked “[2]”: \\nCosts are estimated the total cost of ownership, assuming 70,000 miles driven annually[3], average driver salaries, 10 percent overhead costs and a 10 percent required rate of return on invested capital for the fleet operator. We assume a utilization factor of 50 percent for taxis and 70 percent for pooled cars. This does not take into account a price premium for any additional journey time required to pick up multiple passengers. \\n(I’ve helpfully underlined the weasel words, along with words that make me ask “How do you know that?”) Do you see a source for any of this? No? Why would that be? (Contrast footnote 17, in the left column, to footnotes 18, 19, and 20 in the right column, all of which provide sources. \\nWishing to give McKinsey the benefit of the doubt, I looked for their editorial policies, which I found on page 64, on the About page. In relevant part: \\nSo this really is the best part, isn’t it? \\nThe information contained in this publication is derived from carefully selected sources we believe are reasonable. \\nWell, I should hope so! (“Trusted advisor and counsellor,” et cetera et cetera.) So that’s alright then! Although one could wish that the “reasonable” and “carefully selected” sources were named.[4] \\n* * * \\nSo, I’ve managed to emulate the classic bad New Yorker article; I followed the ornithologists into the swamp, because when they said they heard the call of a rare bird, I believed them. But they didn’t find the bird! So, we still don’t know where McKinsey got its sixty-seven cents ($0.67) a mile figure for its “self-driving taxi” use case. (What the Bloomberg reporter thought they were doing when they repeated it is another question.) And we don’t know know why its “report” didn’t provide an explanation for it. Explanations that occur to me: \\n1. An editorial disaster . Nobody checked footnote 17 to add the sourcing the for sixty-seven cents ($0.67) a mile figure. This strikes me as unlikely, given the level of attention given to the reports design. \\n2. A public relations scam . McKinsey simply made up the sixty-seven cents ($0.67) a mile figure out of whole cloth. This strikes me as unlikely, given the whole “trusted advisor” schtick. \\n3. A bait and switch . The source of the calculations for sixty-seven cents ($0.67) a mile figure is internal and proprietary, and McKinsey won’t reveal anything until you engage them. This strikes me as unlikely, dittoez. \\n‘Tis a puzzlement! \\nNOTES \\n[1] I don’t want to whinge about this, but when I was a sprat, twenty years ago, and I wanted industry ratios and company reports, I’d go down to the Boston Public Library’s Business Branch , display my library card, and get the information for free . Google was awfully good at displaying results from “industry research” firms that demand a fee , but not so good with, er, “free stuff.” Am I looking for stats in all the wrong places? \\n[2] Why 67? Why not 65? Or 70? I’d hate to think McKinsey guilty of spurious precision. \\n[3] New York’s Taxicab Factbook estimates that the average cab travels 70,000 miles per year. \\n[4] There’s also “We do not guarantee its accuracy or completeness and nothing in this document shall be construed to be a representation of such a guarantee,” but I assume Bud from Legal insisted that go in, and I don’t hold it against them. \\nAPPENDIX \\nI like this too. From page 49: \\nAnd the text: \\nWithin the mobility sector itself, an on-demand self-driving taxi could replace most current shared-mobility business models. Adding a self-driving component to car-sharing operations, ridehailing services, and taxi services makes the business models indistinguishable. \\nIndeed it “could”! Exactly in the way the wizards of Unseen University nailing magic broomsticks under Sam Vimes’s horse-drawn coach made it “indistinguishable” from an airborne, supersonic vehicle! 0 0 0 0 0 0'"}, "time": 1742562681.816842}