{"duration": 0.02629566192626953, "input_args": {"text": "'Comments \\nA federal judge in Nevada just dragged the Trump campaign into court to answer for accusations of using minority voter intimidation tactics alongside the RNC. This case is on similar grounds as the national suit, and accuses the Nevada state GOP of violating the surviving provisions of the Ku Klux Klan Act of 1871, seeking to deprive American citizens of their civil rights, in this case, the right to vote. \\nA federal judge Tuesday ordered representatives from the Donald Trump campaign and the Nevada Republican Party to appear at a hearing in his courtroom Wednesday afternoon in a lawsuit filed by Nevada Democrats accusing them of the engaging in voter intimidation tactics. U.S. District Judge Richard Franklin Boulware also ordered the Trump campaign and state party to turn over any training materials they provided to “poll watchers, poll observers, exit pollsters or any other similarly tasked individuals.” \\nAt the hearing, the Trump campaign and the Nevada GOP should be prepared to respond to the motion for a temporary restraining order that the Democrats requested in the lawsuit, the judge’s order said. \\nIn other new, there was an order issued in the national voter intimidation case against the RNC that we’ve been following. A federal judge just ordered the Republican National Committee to turn over their entire geographic targeting plan for poll watching after Democrats filed a lawsuit last week under a 35-year old binding legal agreement to prevent minority voter suppression by the GOP. \\nAt a court hearing this morning, top RNC officials were ordered to testify under oath and reveal all knowledge about poll watching or observation programs to be enacted by RNC volunteers. \\nTrump’s campaign manager, Republican VP candidate Mike Pence, two GOP state party chairs, and longtime wingnut Trump operative Roger Stone all stand accused of violating the agreement by instituting or speaking about illegal “ballot security programs” in recordings and to the media. \\nRepublicans “ballot security” ideas need to be pre-cleared 10 days in advance by Democrats and the federal court according to the 1982 agreement, and nowhere have GOP lawyers asserted that they asked for such clearance to date. Judge John Michael Vazquez ordered : \\nORDERED that Defendant [Republican National Committee] shall also produce to Plaintiff [Democratic National Committee] no later than 5:00 p.m. EST, November 3, 2016, and file on the docket the following: An affidavit or affidavits by a person or persons with personal knowledge setting forth in detail Defendant’s efforts regarding poll watching or poll observation’ in connection with the 2016 Presidential Election. \\nDefendant’s efforts shall apply to those efforts by any employee, agent, or servant of Defendant, including volunteers and independent contractors/vendors. The affiant(s) shall be an agent, servant, or employee of Defendant. The affidavit(s) shall set forth all material terms of any such efforts, including any geographic areas which are being targeted for poll watching or poll observation and the reason(s) those areas are being targeted . Any training materials or advice, whether written, electronic, or verbal, provided to poll watchers or poll observers shall also be provided. \\nDemocrats have requested injunctive relief from the court to stop Republicans from flooding polls in minority areas with “poll watchers” seeking to prevent, challenge or intimidate voters from casting their votes, rather than ensuring the rights of voters to make their choices. \\nJust yesterday, another long list of court ordered disclosures was made public, and it included the Republican party’s response to the Democrats stiff demands for sanctions and contempt of court against the Republican party’s violators. \\nIn the GOP’s response they notably failed to defend the Pennsylvania state GOP chair (who is also a member of the RNC and therefore fully bound by the agreement), who disclosed that he was trying to change state law to allow voters from suburban counties around Philadelphia to flood into polling places in the urban areas where there’s a majority of minority voters. \\nOral arguments in the case are happening tomorrow, and it’s expected that the court will issue a decision in the case. \\nOddly, Republicans are facing these numerous lawsuits because they “won” a court battle over the 1982 consent decree which prevents them from intimidating minority voters, that forced Democrats to sue for state party activities separately from the national party, even though many of those activities are the same and all of the top state party officials are part of the RNC themselves. \\nNow, there are three other states where the Republican state parties are facing legal action by Democrats for ballot security programs, which might violate both the aforementioned Ku Klux Klan Act or the Voting Rights Act or both.'"}, "time": 1742628516.0555081}