{"duration": 0.23446416854858398, "input_args": {"text": "'$18 10 Things Anthony Weiner Did That Were Worse Than Storing Hillary Clinton’s Emails on His Computer Posted on Oct 29, 2016 \\nBy Juan Cole / Informed Comment \\nWaPo is reporting that it was the FBI investigation of Anthony Weiner that caused new emails between Hillary Clinton and Huma Abedin to come to light, which apparently might include forwarded State Department memos or correspondence related to State. \\nNothing produces upchuck in the throat like another headline with the name “Anthony Weiner” in it. But here’s an opportunity for me to reprint a column I once did on the things Weiner has said and done worse than sexting. The FBI was investigating him for sending suggestive messages to an under-aged girl. \\nThe nation is fixated on Trump’s groping and Clinton’s email server (uh, the State Department and the NSA got hacked folks, so it isn’t the case that government servers are secure) and, well, maybe it was fixated for a brief second on Weiner’s sexting. But we don’t seem interested in serious policy questions like Syria and Iraq. Oh, the public got all het up about ISIL in 2014 and demanded something be done, but now it has lost interest. \\nSo here’s an actually important policy issue on which Weiner shaped public opinion and helped make policy. \\nThe real scandal surrounding Anthony Weiner is that he is bigoted against Palestinians and has misused his position in Congress to support punitive policies against them. Americans appear to be bored by policy, titillated by private peccadilloes. But it is the policies that are important. Mahatma Gandhi was once kicked out of a brothel in South Africa. No one judges him by his lapses. Weiner, in contrast to Gandhi, has not worked for peace but has rather given knee-jerk support to the worst policies of the most far right-wing parties in Israel toward Palestinians. A social liberal in American terms, Weiner is so blinded by his allegiance to Israel and so studied in his ignorance of the Middle East that he has played a uniformly sinister role in that aspect of foreign policy. \\nAdvertisement Square, Site wide \\nWeiner: \\n1. Called for Columbia University professor Joseph Massad to be fired for being critical of Israel; Weiner thus spearheaded a new McCarthyism. \\n2. On the Israeli attack, in international waters, on the Mavi Marmara relief ship , Weiner sputtered: “”If you want to instigate a conflict with the Israeli navy it isn’t hard to do. They were offered alternatives. Instead they chose to sail into the teeth of an internationally recognized blockade.” The blockade of Gaza civilians is a breach of international law; it is not internationally recognized and has on the contrary been condemned by almost every nation and human rights organization. \\n3. Alleged that the New York Times is anti-Israel: “Amnesty International in particular, has always had bias against Israel, and frankly I would argue that in many cases, the New York Times has, as well.” \\n4. Alleged that the Palestine Liberation Organization is still listed by the US as a terrorist organization. It was dropped from the list over 2 decades ago. \\n5. Tried to bar the Palestinian delegation to the United Nations from New York. \\n6. Alleged that Mahmoud Abbas, President of the Palestine Authority, is not the head of the PLO. He is. \\n7. Refused to condemn the use by Israel of cluster bombs on the civilian farms of south Lebanon in 2006. \\n8. Alleged that the Israeli army does not occupy the West Bank and that there is no Israeli Army presence in the West Bank. \\n9. Called Israel’s [2009] war on Gaza a “humane” war. 400 children were killed. \\n10. Voted for Iraq War authorization in 2002, before later turning against the war. TAGS:'"}, "time": 1742628574.4613628}