{"duration": 0.13504815101623535, "input_args": {"text": "'You can’t keep a good monster down, especially in Hollywood. After years in storage, the mighty ape with the big teeth and the thing for pale blondes has been dusted off and digitally turbocharged for “Kong: Skull Island. ” Once again, a lot of the noise and action involve guns, monsters and crashing jungle chases, but the most promising moments involve King Kong and the really little lady he unexpectedly meets. In the past, their brief encounter made for some strange moments, none weirder than in the original 1933 film when Kong pauses while undressing his human doll to smell his fingers. It was beauty that killed the beast, or so it has been repeatedly claimed. In 1933 it was Fay Wray’s scantily clad beauty who took the rap for bringing Kong down off the top of the Empire State Building. (Fighter planes with machines guns helped.) By 1976, the   relationship had grown rather more complicated, and Jessica Lange was weepily begging Kong to hold onto her. In the 2005 redo it was Naomi Watts’s turn to shed tears for him. In “Kong: Skull Island,” the big guy has a new look and a new gal pal, Mason Weaver (Brie Larson) who’s somewhat feistier and certainly more sensibly dressed than her predecessors. She points and she shoots, and not just her camera. “Skull Island” pretty much exhumes the same story conceived for the 1933 classic. This time, the adventurers include a group of   scientists run by Bill Randa (John Goodman) who has his glinting eyes on a mysterious, seemingly unexplored island. Mysteries were made for solving, and this island, Randa reasons, may contain all manner of wonders, or perhaps something beyond human imagining. So, with a military unit led by Lt. Col. Preston Packard (Samuel L. Jackson) the scientists ship out, accompanied by Mason, a   war photographer who’s soon trading barbs and looks with the world’s prettiest mercenary, James Conrad (Tom Hiddleston). The filmmakers fold a lot of moody detail into the introductions, including real locations and the fog of war: The story takes place in 1973 and the movie was primarily shot in Vietnam. (It was directed by Jordan   from a script by Dan Gilroy, Max Borenstein and Derek Connolly.) If the sweat, bantering grunts and teeming bars feel borrowed from innumerable other movies, they are also mostly on hand to get the story up and the characters running, which happens once the travelers pierce the thick clouds surrounding Skull Island. There, they meet the enemy and the enemy is  —   surprise  —   us, although there are plenty of digital terrors red in tooth and claw. Over the years, critics have pushed and pulled at “King Kong,” denouncing its representation of the islanders (played by black actors in the 1933 film) and reading it metaphorically through black masculinity and white femininity. Later Kong movies have tried to sidestep criticism by changing the representation of the islanders while leaving beauty and the beast intact. Yet even as “Skull Island” avoids some stereotypes, it embraces others, partly through a struggle that pits a pathological black character against a pair of white saviors. Kong, meanwhile, at times feels sidelined, brought out every so often to wreak havoc and briefly exchange soulful looks with Mason. “Skull Island” has momentum, polish and behemoths that slither and thunder. The sets and creature designs are often beautifully filigreed, but the larger picture remains murky. Backed by government and guns, the scientists prove to be colonialists by another name, an idea that the filmmakers bat around a bit, including in allusions to Joseph Conrad’s novella “Heart of Darkness. ” These references pad “Skull Island,” giving audiences (and critics) something to chew on and help explain the repeated,   nods to “Apocalypse Now,” Francis Ford Coppola’s 1979   retelling of the Conrad novel: the fireball sun, the military helicopters in formation and even a napalm attack. If that weren’t enough, there’s also a Dennis   character right out of “Apocalypse Now,” a loopy, grizzled survivor named Hank Marlow who is played by John C. Reilly in charming crazy mode (the narrator in “Heart of Darkness is also a Marlow). Marlow pops up after Kong makes his star entrance swatting down helicopters and scattering survivors. Far larger than his forebears, Kong looks as big as a mountain here. Supersizing is a default mode of the contemporary blockbuster, but in this case a   Kong may have something to do with his role in an evolving studio franchise featuring monsters (a. k. a. MonsterVerse) that kicked off with the 2014 “Godzilla. ” If all goes according to corporate plan, Kong will be slugging it out with Godzilla soon enough. That doubtless excites studio executives and some fans, but the promise of a return engagement drains much of the pathos from Kong. In many ways “Skull Island” looks and plays like its antecedents, despite the cosmetic tweaks, digital effects and attempts at inclusive casting. Like those earlier films, it too asks the critical question in many such tales  —   “Mirror, mirror on the wall, who’s the most monstrous of them all?”  —   through an ape who, because he’s a close relative, turns our gaze back on ourselves. Kong is the beast we know, the beast we deny, the beast we fear, the beast we kill. Here, though, Kong is no longer the beast we love, the tragic   who, if he didn’t always win the affections of his prisoners, achieved immortality by seducing viewers. “Skull Island” is adept at goosing you it deploys   feints and   frights capably amid its clichés and deaths. Every so often it also pauses and allows Kong and Mason to move you. As each recognizes the other, they bridge the divide, but perhaps because their relationship is more empathetic than romantic, these encounters don’t have the resonance they should. Alas, beauty no longer has her beast, the beast no longer has his beauty and this darkness has no heart even if it will have a sequel.'"}, "time": 1742562314.5777335}