{"duration": 0.07350277900695801, "input_args": {"text": "\"on November 13, 2016 12:43 pm · \\nBefore the leaked tape of Donald Trump describing his propensity to grab women “by the pussy” to Billy Bush, it seemed that the media was ignoring Donald Trump’s glaring faults as a presidential candidate. During the primaries , for example, he received far more positive media coverage than any of his competitors. It turns out there might be a reason for that – Trump was bribing the media – at least that’s the accusation being made by Megyn Kelly of Fox News. \\nIn her memoire “Settle for More,” which will be released this week, Kelly said that Trump likely received the infamous question, in which she asked about the fact that he has called women “fat pigs, dogs, slobs and disgusting animals.” That question set Trump off on one of his Twitter tirades. These are only a portion: \\nThe worst and most controversial of which was this: \\nAs the election progressed, it became more and more apparent that Trump expected that no matter how egregious his behavior, he expected, no, demanded that the media kiss his orange ass. If they didn’t, he would cut off access, but before that, he tried bribery. \\nWhile Kelly couldn’t speak for other members of the media, she alleges that Trump attempted to buy positive coverage by offering free stays at his hotels, with full perks. While the attempt clearly didn’t work on Kelly, she says that with some, their loyalty came cheap, or perhaps not so cheap. \\n“This is actually one of the untold stories of the 2016 campaign: I was not the only journalist to whom Trump offered gifts clearly meant to shape coverage,” Kelly said. He also attempted to woo them with praise, she said, adding, “This is smart, because the media is full of people whose egos need stroking.” \\n“Trump tried to work the refs, and some of the refs responded,” she said. \\nWhen it became obvious that some reporters were “in the tank” for Trump, she alleges in one chapter, “certain TV hosts” would work with the candidate in advance on occasional Trump criticism so they would appear unbiased. She didn’t identify them by name or media outlet. \\nSource: Yahoo \\nKelly also asserts that the day before the debate in which Kelly asked about Trump’s treatment of women, the candidate called Fox News exec. Bill Sammon, who told him about the first question. All we heard about, though, during the election, was that it was Hillary Clinton who was fed a town hall debate question and it was hardly earth shattering. The insider knowledge said that a woman, in the Flint, Michigan debate, would ask a question about the Flint water . \\nWhile bribing journalists isn’t illegal, per say, it is highly unethical. Without the Fourth Estate exposing the underbelly of politicians and of politics, democracy is impossible. \\nFeatured image via Chip Somodevilla/Getty Images Share this Article! Share on Facebook Author: Wendy Gittleson Wendy is one of the luckiest people on the planet. She actually gets to make a living out of two of her greatest passions, writing and politics. When she's not writing, she's hiking with her dogs, riding her bike or cooking a great meal with her friends or loved one. Follow Wendy on Facebook , Twitter or Google Plus . Search\""}, "time": 1742564100.6675725}