{"duration": 0.44347357749938965, "input_args": {"text": "'Copyright Mark Taliano, Global Research, Montreal 2016. \\nNote to Readers: Remember to bookmark this page for future reference. Please Forward Syria’s War for Humanity, by Mark Taliano far and wide. Post it on Facebook. Scroll down for I-BOOK Table of Contents “Syria’s War for Humanity” by Mark Taliano is part of Global Research’s Online Interactive I-Book Series which brings together, in the form of chapters, a collection of Global Research feature articles, including debate and analysis, on a broad theme or subject matter. To consult our Online Interactive I-Book Reader Series, click here. Preface We bring to the attention of our readers Mark Taliano’s I-Book entitled Syria’s War for Humanity . In contrast to most geopolitical analysts of the Middle East, Mark Taliano focusses on what unites humanity with the people of Syria in their struggle against foreign aggression. Author: Mark Taliano Taliano talks and listens to the people of Syria. He reveals the courage and resilience of a Nation and its people in their day to day lives, after more than five years of US-NATO sponsored terrorism and more than two years of US “peacemaking” airstrikes which have largely targeted Syria’s civilian infrastructure. Everybody in Syria knows that Washington is behind the terrorists, that they are financed by the US (at tax payers expense) and its allies, trained and recruited by America’s Middle East partner. Saudi Arabia, Qatar, have been financing and training the ISIS-Daesh, al Nusra terrorists on behalf of the United States. Israel is harboring the terrorists out of the occupied Golan Heights, NATO in liaison with the Turkish high command has since March 2011 been involved in coordinating the recruitment of the jihadist fighters dispatched to Syria. Moreover, the ISIS-Daesh brigades in both Syria and Iraq are integrated by Western special forces and military advisers. While all this is known to the Syrian people, Western public opinion is led to believe that the US is leading a “counter-terrorism campaign” in Syria and Iraq against the Islamic State (ISIS-Daesh), an entity created and supported by US intelligence. Image: Damascus National Museum, M Chossudovsky, 2011 “Everything that we saw in Syria speaks of humanity’s common heritage”, says Mark Taliano. Syria is the cradle of civilization, Mesopotamia, the Land of Two Rivers, where the early civilizations of the fertile crescent took their roots. This is what the Washington Neocons want to destroy. But to reach their objective they need to wage a dirty propaganda campaign which conveys the illusion that America is involved in a “humanitarian” “peace-making” undertaking. The Syrian people know who the real terrorists are. “The Western assault on this country is an assault on our common humanity, and an assault on Syria’s progressive and forward-looking future”, says Taliano. Mark Taliano focusses on the truth as an instrument for building peace and counter-propaganda: “S hould the West’s “regime change” operations succeed, the secular, pluralist government of President Assad will be replaced by its opposite: a barbaric, sectarian regime, and chaos. Yet Western politicians are seemingly propagandized by their own lies. Or perhaps they see no choice but to cravenly follow diktats from above. Humanity’s better nature, however, demands that we all open our eyes, that we learn from history, and that we embrace the rule of international law rather than the diktats of a criminal Empire. Syria and Syrians must be saved, not destroyed.” Currently, my interests lie in digging for political truths in a world that is rushing headlong into war and barbarism, on a bedrock of lies. When I find such truths, their trajectories invariably lead to peace rather than war. So now, my “crusade’ is to help share the truth, to make it broad-based, and to make a positive difference. The dirty war on Syria is such a blatant example of the supremacy of war, deception — and evil — over civilization, and our common humanity, that my current research interests are defined by what does or does not happen there. If Syria wins, we all win. Right now, she is winning.” Mark Taliano refutes the mainstream media. The causes and consequences of the US-led war on Syria, not to mention the extensive war crimes and atrocities committed by the terrorists on behalf the Western military alliance are routinely obfuscated by the media. Taliano is committed to reversing the tide of media disinformation, by reaching out to Western public opinion on behalf of the Syrian people. “Syria’s stand against the Western agencies of death and destruction is a stand for all of humanity against the dark forces that fester beneath our politicians’ empty words and the courtesan media’s toxic lies.” \\nThese twenty-seven chapters of Mark Taliano’s Syria’s War for Humanity provide an overview of life in Syria, the day to day struggle of the Syrian people to protect and sustain their national sovereignty. \\nMichel Chossudovsky, October 30, 2016 * * * Introduction by Mark Taliano I recently traveled to war- torn Syria because I sensed years ago that the official narratives being fed to North Americans across TV screens, in newsprint, and on the internet, were false. The invasion of Libya was based on lies; so was the Iraq war; likewise for Ukraine. All of the 9/11 wars were sold to Western audiences through a sophisticated network of interlocking governing agencies that propagandize both domestic and foreign audiences. But the dirty war on Syria is different. The degree of war propaganda leveled at Syria, and contaminating humanity at this moment, is likely unprecedented. I had already studied and written about Syria for years, so I wasn’t entirely surprised by what I saw. But what I felt was a different story. \\nFirst Impressions When I awoke on the first morning of my visit, and sat at a table on the polished marble floor beside the fountain, it was still and quiet. The walls of the hotel courtyard surrounded me — rows of hard, dark basalt stone block and intricately carved soft brown stone were woven together with alcoves and archways, all radiating ancient artistry. High vaulted windows overlooked the palazzo, with plants flowing from balconies and the railings of the narrow corridors leading to rooms. Above was the pale blue cloudless morning sky. A pigeon lumbered in and perched inside, sheltered by the ancient walls. A native bird, bluish white, swift and silent, swooped in towards the pigeon, and they were both gone, swept away into the Damascene morning. The quiet returned and the pale blue sky became darker and deeper. Syria will find peace again when this is all over. Syria is an ancient land with a proud and forward looking people. To this ancient and holy land we sent mercenaries, and hatred, and bloodshed, and destruction. We sent strange notions of “exceptionalism”, and waves upon waves of lies. As a visitor I felt shame, but Syrians welcomed me as one of them. This is their story. And these are their voices. \\nTestimonies from Syrians \\nIn this video , Dr. Joseph Saddeh, standing in front of desecrated Christian icons in the ancient and holy city of Maaloula, where Aramaic, the language of Jesus, is still spoken, explains that what happened in Syria was not a “revolution”, and that the terrorists want to destroy everything that is good, and that “they want to make us like them or they will kill us.” \\nThe terrorists did invade this ancient and holy place, they did destroy religious icons, and they did kill many people. Terrorist-damaged religious iconography at Maaloula, Syria Former al Nusra Front Headquarters, Maaloula, Syria Syrian soldier Dr. Ali Salem – a veterinarian during times of peace – explained that terrorists include “imports” from about 80 countries, street people, thieves, smugglers (diesel fuel and drugs), and those who were forced to fight under the threat of death or the death of family members. \\nHe said that by now people must understand the truth about what is happening, despite the propaganda that demonizes the Syrian government and its people. The army is the people, he explained, and the government is not a “regime”. When this is over, he said, young people will have to be taught the truth about what happened. Terrorist-destroyed Shrine of Saint Takla, Maaloula, Syria. Listen to the video here. Religious icons were either destroyed or burned. We met soft-spoken, accommodating, Dr. Ali Haidar at at his office. He had earlier explained to Jamal Daoud, leader of the Third International Tour of Peace to Syria , that in 2011, he was offered a large sum of money from Qatar to boycott a “consultation summit” with the government. When he refused the bribe, he received threats, and his son was murdered. The process of national reconciliation, headed by Dr. Haidar, is emblematic of Syrian decision-making processes. The externally-orchestrated war is being resolved internally – by Syrians, for Syrians — and the solutions are often the fruit of a genuine democratic processes, in contrast to the fake democratic processes masquerading as “democracy” in the West, where Western politicians and citizens are heavily propagandized. \\nAll Syrians are paying a horrible price for the sins of the West. Ammar recounted this nightmare: “As everyday morning my sister was going to the university when a bloody Takfiri Salafi Wahhabi suicide bomber blew up bomb car at the bus stop which led to the martyrdom and injury of many civilians and university students who were going to their exams, after 10 minutes another suicide bomber blew up himself at the same place taking advantage of the gathering of people and ambulance teams, usually when a terror attack happens we call all family members and friends to make sure they all are ok but this time no one answered! Then we started looking for her in hospitals … the shock was in the bloody views there; many burned bodies and human body parts were on the ground , there i saw my sister a body without soul …” \\nMadj explained his sentiments: \\n“ I am Syrian… living in Syria in the middle of everything. We have seen horrors. It was never a revolution nor a civil war. The terrorists are sent by your government. They are al Qaeda Jabhat al Nusra Wahhabi Salafists Talibans etc and the extremist jihadists sent by the West, the Saudis, Qatar and Turkey. Your Obama and whoever is behind him or above him are supporting al Qaeda and leading a proxy war on my country. \\nWe thought you are against al Qaeda and now you support them. \\nThe majority here loves Assad. He has never committed a crime against his own people… The chemical attack was staged by the terrorists helped by the USA and the UK, etc. Everyone knows that here. \\nAmerican soldiers and people should not be supporting barbarian al Qaeda terrorists who are killing Christians, Muslims in my country and everyone. \\nEvery massacre is committed by them. We were all happy in Syria: we had free school and university education available for everyone, free healthcare, no GMO, no fluoride, no chemtrails, no Rothschild IMF- controlled bank, state owned central bank which gives 11% interest, we are self-sufficient and have no foreign debt to any country or bank. \\nLife before the crisis was so beautiful here. Now it is hard and horrific in some regions. \\nI do not understand how the good and brave American people can accept to bomb my country which has never harmed them and therefore help the barbarian al Qaeda. These animals slit throats and behead for pleasure… they behead babies and rape young kids. \\nThey are satanic. Our military helped by the millions of civilian militias are winning the battle against al Qaeda. But now the USA wants to bomb the shit out of us so that al Qaeda can get the upper hand. \\nPlease help us American people. They are destroying the cradle of civilization. Stop your government. \\nImpeach that bankster puppet you have as president… support Ron Paul or Rand Paul (as Libertarians they have opposed foreign interventions—Editors) or anyone the like who are true American patriots. but be sure of one.thing…if they attack and I think they will….it will be hell. \\nBe sure that if it were to be a world war, many many will die. Syria can and will defend itself and will sink many US ships. Iran will go to war..Russia and China eventually if it escalates… and all this for what ? For the elites who created al Qaeda through the US government and use it to conduct proxy wars and destabilize countries which do not go along with their new world order agenda !!? \\nAmerican people…you gotta regain control of your once admirable country. Now everyone hates you for the death you bring almost everywhere. \\nAsk the Iraqis…the Afghans…the Pakistanis…the Palestinians…the Syrians…the Macedonians and Serbs…the Libyans…the Somalis…the Yemenis ….all the ones you kill with drones everyday. Stop your wars. Enough wars. Use diplomacy…dialogue…help…not force.” Jad also shared his tragedy. He told me that his brother was kidnapped last year, and that the terrorists tortured him and destroyed his knees. Now he can’t walk. He also told me that his cousin, who was serving in the Syrian Arab Army, lost his leg when Wahhabi suicide bombers attacked his military vehicle, and that another cousin was kidnapped in 2012, and remains in captivity. The tragedies are legion, but all of the Syrians to whom I spoke assured me that they support the government of Bashar Al-Assad. They are unified in the battle against Western terrorists. The sanctions, the terrorists, the death and destruction, are not working. The alternative, a Western-installed Wahhabi stooge government, is not an attractive option. The ongoing dirty war on Syria is particularly odious because the elected President of Syria, Dr. Bashar Al-Assad, and his wife, represent the best of what Syria’s future promises to be. The Assads are well-educated – like all of the Syrians whom I had the pleasure of meeting – and they are moving ancient, holy Syria into a better future than that promised by the uni-polar, “exceptional” imperialists who are trying to destroy Syria with their Wahhabi-inspired terrorists. \\nSyrians have seen the devastation of Iraq, Libya, Afghanistan, and the Ukraine. They refuse to be the next domino. Syria’s future will include the rule of international law, nation-state sovereignty, self-determination, pluralism, respect for all people, and multi-polar geo-political relationships. Syria has strong institutions, strong people, a strong military, strong allies, and a strong government; and she will not be pulled into the abyss of terrorism like the other aforementioned countries. \\nFor this we should all be grateful. \\nWe have just witnessed the pain and hardship that Syria and Syrians are enduring. The next question is, How did the West arrive at the point where otherwise intelligent and morally upright citizens support the illegality and barbarity of their nations’ foreign policies? The simple answer is that the collective mindset of the public has been contaminated by an unprecedented and on-going propaganda campaign that engineers consent for unspeakable crimes that “benefit” transnational elites and impoverish the rest of us. [This is the longstanding nature of US foreign policy, dating back more than a century, even prior to the Civil War, when early imperialist and “Manifest Destiny” believer James Polk seized half of Mexico under trumped-up pretexts and false flags. Meanwhile, the American media have always supported these international crimes, as they do today.—Editors.] The dreadful reality is that the Global War on Terror is actually a global war for terror. The foreign policies of Western nations are increasing the reach of terrorism exponentially, because the West uses these terror brigades as foot soldiers for illegal wars of aggression. In its Syrian campaign, as with its previous Libyan campaign, the West is literally the air force for the terrorists on the ground. This is all well documented with Western sources. US-led NATO is aligned with the Gulf Monarchies, and Israel, to flood Syria with mercenary terrorists, to balkanize and destroy the country, and to remove President Assad, so that it can advance its agenda for a New World Order of conquest under the false banner of the Global War On Terror (GWOT). Through its actions and inactions, its sanctions, its arms dealings, and its pre-planned invasions, the West and the terrorists in Syria are one and the same. We support all the imaginary “moderates”, and every other terrorist organization operating in Syria. Again, the evidence is ample, and well-documented using western sources. US-led NATO is aligned with the Gulf Monarchies, and Israel, to flood Syria with mercenary terrorists, to balkanize and destroy the country, and to remove President Assad, so that it can advance its agenda for a New World Order of conquest under the false banner of the Global War On Terror (GWOT). This on-going project necessarily entails death, destruction, and wide-spread poverty. Neo-con planners hope that the widespread destruction will enable them to control destroyed countries and open them up for predatory and parasitical economic programs — similar to domestic neoliberal economic models that are ravaging domestic economies beneath the lies and diversions. Despotic stooge puppet regimes are easier to control and manipulate than independent sovereign governments that represent the democratic will of their peoples and the rule of international law. Again, this favoured totalitarian style rule is mirrored at home, but more subtly. The notion that we live in democracies is absurd. \\nTentacles of predatory neoliberal capitalism have yet to invade Syria’s famous souks/markets Spices at the Souk F alse flag terrorism is part of the apparatus of deception which serves to advance policies that are contrary to the wishes of those who are deceived.\\nThere’s nothing new about “synthetic terrorism’; it is military doctrine, and examples of its use are legion, but it is a taboo topic and a “conspiracy theory”, so it works. \\nThe Canada Day pressure-cooker bomber plot was a proven false flag (though not acknowledged as such by mainstream media), and it served the apparatus of deception as did other domestic terrorism cases. \\nEven if the Ottawa shooting crisis unfolded exactly as the official narratives described it, the conflation between the shooting and ISIS is surely unfounded, as noted by Senator Mobina Jaffer. \\nBut the accumulated impact of these events, coupled with largely unquestioned official narratives, has the intended effect of creating a consensus of ignorance wherein otherwise intelligent people support illegal warfare, terrorism, and police state legislation. \\nPreeminent Constitutional lawyer Rocco Galati assesses Canada’s C-51 legislation in these words : \\nIt takes all our private information and shares it with all government agencies, including foreign government. For some citizens that becomes an eventuality of torture and/or death when travelling abroad. \\nIt restricts arbitrarily who can travel. \\nFreedom of expression and political criticism with respect to “terrorism and the government’s role” (becomes) a terrorist offence in itself. So words and thoughts become an act of terrorism under this bill. \\nIt allows CSIS to disrupt covertly constitutionally-protected rights of association, expression, and protest. \\nIt does all of this by taking away all and any transparent judicial oversight. \\nHe says that “We’ve entered into the final fascist state.” \\nConsequently, both domestically and abroad, we are living what author Naomi Wolf describes as a “fascist shift” , wherein we unwittingly embrace our own enslavement, global war, and poverty, all for the “benefit” of transnational oligarch classes, and the known catastrophic impacts for humanity. \\nSyria is standing strong against these Western cancers of ignorance and evil. She, and her allies, are swooping down on these globalist interlopers. Her victory will be our victory. \\nOutline of This Book T he purpose of this book is to shed some light on how the propaganda works, and to decode it and other events, so that we can arrive at a better understanding of what is really happening in Syria, and why.\\nThe degree of war propaganda leveled at Syria, and contaminating humanity at this moment is unprecedented. \\nI have yet to meet a single Syrian who would prefer a stooge, Wahhabi dictatorship to the current government. Every single Syrian opposition leader prefers the current government to an imperial -imposed government. The on-going campaign of lies directed at Syria is particularly odious because the elected President of Syria, Dr. Bashar Al-Assad, and his wife, represent the best of what Syria’s future promises to be. \\nThe Assads are well-educated – like all of the Syrians whom I had the pleasure of meeting – and they are moving ancient, holy Syria into a better future than that promised by the uni-polar, “exceptional” imperialists who are trying to destroy Syria with their Wahhabi-inspired terrorists. \\nSyrians have seen the devastation of Iraq, Libya, Afghanistan, and the Ukraine. They refuse to be the next domino. \\nSyrians are unified. Their future will include the rule of international law, nation-state sovereignty, self-determination, pluralism, respect for all people, and multi-polar geo-political relationships. Syria has strong institutions, strong people, a strong military, strong allies, and a strong government; she will not be pulled into the abyss of terrorism like the other aforementioned countries. \\nFor this we should all be grateful. \\nThe compilation of articles in this book decode the propaganda apparatus which creates an engineered consensus that serves the covert agenda of expanding the parasitical economic model called “neoliberalism”. \\nNeoliberalism impoverishes domestic and foreign populations, and enriches a transnational oligarch class. The transnational oligarch class — enriched by “deregulation”, “privatization” schemes, and “free trade” agreements — contaminates the collective mindset of humanity with its foundations, its lobbying, and its undue influence, so its real nature, and its very existence, remains hidden. Rarely will a mainstream publication even use the word “neoliberalism”, which is the economic foundation of the current class system. \\nPart One is the story of Syria as told by Syrians, unfiltered by mainstream media (MSM) propaganda. We see and hear the trauma lived by defiant, heroic Syrians, and we discover that this ancient, holy land will surely survive the current barbarian invasion, and will rise again as a beacon of civilization, hope, and dignity, in contrast to so many of those countries that seek to destroy it. \\nVoices from Syrian citizens are absent from mainstream media stories. Syrians are like you and me. This is what they have to say: \\n“We thought you are against al Qaeda and now you support them.” I Am A Syrian Living in Syria: “It was Never a Revolution nor a Civil War. The Terrorists are sent by your Government” \\nThe externally-orchestrated war is being resolved internally – by Syrians, for Syrians — and the solutions are often the fruit of a genuine democratic processes, in contrast to the fake democratic processes masquerading as “democracy” in the West, where Western politicians and citizens are heavily propagandized. \\nNATO et al. terrorists destroy everything that contradicts their deviant ideology. They seek a “blank slate” that denies and negates the real Syria. \\nSyria insists on being a sovereign nation; it refuses Empire’s head-chopping criminality. \\n“Syria was prosperous, with a growing economy. It had food sovereignty, with a “strategic” stock of millions of tons of high quality wheat , not the “Franken-food” bio-tech variety; it had a strong central bank with no usurious IMF loans ; it had a popular, reformer President; it had a mostly well-educated, secular, pluralist, forward-looking population; and it was the fourth safest country in the world.” \\nPart Two elaborates upon the real story about Syria, and the drivers behind the current dirty war, in which the U.S-led Empire is using terror proxies to advance its predatory reach, contrary to the wishes of the vast majority of Syrians. \\nThe alternative to Syria’s elected government is genocidal despotism and Sharia law. The (non-existent) “moderates” can’t be separated from the “extremists”, because all of the mercenary terrorists share the same goals and the same ideologies. \\nThe predictable result of engineered deception is that domestic Western populations remain deceived and politically passive. The truth is inverted, and large swaths of the population remain deluded. Whereas the West and its allies support all the terrorists invading Syria, domestic populations think that we are fighting terrorism. This is the great fraud of the “Global War On Terror”. \\nThe West uses mercenary terrorist proxies to advance its predatory reach; to destroy foreign countries; and to increase global terrorism exponentially, all for the benefit of the oligarch classes. There is nothing new about this. \\n“The secular governments of Iraq, Libya, and Syria all — prior to Western invasions — opposed terrorist organizations such as al Qaeda.” Dedication \\nThis book is dedicated to the people of Syria, all of whom are on the front lines in the fight against international terrorism. \\nYour blood is being shed for our sins. \\nAcknowledgements \\nI can’t begin to thank everyone who helped me with this book, but here’s a start. \\nThanks to Ken Stone, who inspired me to take the trip to Syria. \\nThanks to Jamal Daoud, and the organizers of the Third International Tour of Peace To Syria, who made this trip possible, despite “external” barriers, thus giving us the chance to see and hear Syria for ourselves. Now we can better share the truth. \\nThanks to my fellow travellers, who are my brothers and sisters in spirit. \\nThanks to Prof. Michel Chossudovsky who helped me publish this book. \\nThanks to Gerry DiSanto, at the Defensive Arts Training Centre (DATC), who encouraged me to write this book. \\nAnd last but not least, thanks to Victoria, who helped me along the way. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS'"}, "time": 1742563159.3949933}