{"duration": 0.08165884017944336, "input_args": {"text": "'WASHINGTON  —   An airport encounter this week between Attorney General Loretta E. Lynch and former President Bill Clinton has welled into a political storm, with Republicans asserting that it compromised the Justice Department’s politically sensitive investigation into Hillary Clinton’s email practices while she was secretary of state. The Obama administration declined to say on Thursday whether the meeting between Ms. Lynch and Mr. Clinton, in Phoenix on Monday night, was appropriate. The press secretary, Josh Earnest, said that the investigation of Mrs. Clinton would be free of political influence and that he would leave it to the attorney general to explain the meeting. Ms. Lynch said the meeting with Mr. Clinton was unplanned, largely social and did not touch on the email investigation. She suggested that he walked uninvited from his plane to her government plane, which were both parked on a tarmac at Phoenix Sky Harbor International Airport. “He did come over and say hello, and speak to my husband and myself, and talk about his grandchildren and his travels and things like that,” Ms. Lynch said at a news conference in Los Angeles on Wednesday, where she was promoting community policing. “That was the extent of that. And no discussions were held into any cases or things like that. ” That did not mollify Republican lawmakers, who said the meeting raised questions about the integrity of the government’s investigation. Since last summer, the F. B. I. has been investigating whether Mrs. Clinton or her aides violated laws on the protection of classified material by using a private email address and  server in the Clintons’ home in Chappaqua, N. Y. The F. B. I. is expected to make a recommendation to the Justice Department in the coming weeks. While some legal experts said they believed criminal indictments in the case were unlikely, the investigation continues to cast a shadow over Mrs. Clinton’s presidential campaign. “In light of the apparent conflicts of interest, I have called repeatedly on Attorney General Lynch to appoint a special counsel to ensure the investigation is as far from politics as possible,” Senator John Cornyn, Republican of Texas and a member of the Judiciary Committee, said in a statement on Thursday. “This incident does nothing to instill confidence in the American people that her department can fully and fairly conduct this investigation, and that’s why a special counsel is needed now more than ever,” he said. Donald J. Trump, the presumptive Republican nominee, seized on the incident, describing it in a radio interview as a “sneak” meeting and saying it exposed the rigged nature of the process. Even some Democrats expressed uneasiness with the appearance the meeting created. “I do agree with you that it doesn’t send the right signal,” Senator Chris Coons, Democrat of Delaware, said in response to a question on CNN’s “New Day” program. Ms. Lynch “has generally shown excellent judgment and strong leadership of the department, and I’m convinced that she’s an independent attorney general. But I do think that this meeting sends the wrong signal, and I don’t think it sends the right signal. I think she should have steered clear, even of a brief, casual, social meeting with the former president. ” At the White House, Mr. Earnest was asked repeatedly about the propriety of the meeting. He defended what he said was Ms. Lynch’s long record of independence as a federal prosecutor. But he stopped short of saying the administration viewed the meeting as appropriate. “I wasn’t there for the meeting,” Mr. Earnest said, “but the attorney general was, and she was asked a direct question about it, and she answered it. I think that is consistent with everybody’s expectations. ”'"}, "time": 1742562012.8976762}