{"duration": 0.038138389587402344, "input_args": {"text": "'North Dakota has become the first state to legalize law enforcement use of armed drones. \\n\\nIn late summer of 2015, a law was passed that allowed weapons such as tear gas, rubber bullets, beanbags, pepper spray, and Tasers to be used by police drones. The original bill aimed to ensure that no weapons at all were allowed on law enforcement drones. Sponsor of the original bill, Republican Rep. Rick Becker claimed he is not happy with how the law turned out. \\n\\nThe intent of the bill was to require police to obtain search warrants using drones to look for evidence. The bill also prohibited weapons aboard drones. In order to get the bill passed and require search warrants, Becker compromised on the weapons issue. \\n\\nWhile some believe this to be a victory for pro-privacy advocates, many view it as a worrisome defeat for those concerned about the militarization of police in America. \\n\\nBecker claimed that he aims to change the law when the House returns in session in two years. \\n\\nAlthough the weapons that are allowed for use by drones are considered less than lethal, they can still be deadly. According to The Guardian , at least 67 people were killed by tasers alone in 2015 and 2016 alone. The use of any weapon, lethal or not, can cause great extensive injuries and death. Rubber bullets, beanbags, and tear gas canisters are known to cause horrible injuries and are often times used on non-violent civilians and protestors. \\n\\nWhile most people are unaware that this bill passed, it could endanger the lives of thousands of protestors and water protectors protesting the North Dakota Access Pipeline. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She graduated The Evergreen State College with an undergraduate degree focusing on Sustainable Design and Environmental Science. Follow her adventures on Instagram.'"}, "time": 1742561801.5669217}