{"duration": 0.07084822654724121, "input_args": {"text": "'In his first remarks since WikiLeaks began releasing thousands of his hacked emails, John D. Podesta, Hillary Clinton’s campaign chairman, said Tuesday that Russian intelligence officials intent on swaying the election to Donald J. Trump had been responsible for the illegal breach into his account. “I’ve been involved in politics for nearly five decades,” Mr. Podesta told reporters aboard the Clinton campaign plane. “This definitely is the first campaign that I’ve been involved with in which I’ve had to tangle with Russian intelligence agencies,” he added, “who seem to be doing everything that they can on behalf of our opponent. ” Without verifying the authenticity of the emails, Mr. Podesta said that he had spoken with the F. B. I. “as a victim” of hacking. The Obama administration, like Mr. Podesta, believes the Russian government has been trying to help Mr. Trump with its hacking, including the theft of emails of the Democratic National Committee this year. Mr. Podesta said Mr. Trump had “essentially adopted lock, stock and barrel” a foreign policy that would favor the interests of President Vladimir V. Putin. Mr. Podesta also cast blame on Julian Assange, the head of WikiLeaks and an avowed critic of Mrs. Clinton. He said WikiLeaks had strategically released the first batch of his emails Friday afternoon to distract attention from the damaging video that had just emerged of Mr. Trump making lewd comments about women. “It wasn’t any coincidence, I think, that within minutes of the ‘Access Hollywood’ tape coming out, they decided that this was their countermove,” Mr. Podesta said. The hacked emails have not done much to help Mr. Trump in the polls, but they have proved to be a persistent distraction. Earlier on Tuesday, some newly released emails suggested that a senior Clinton campaign aide had been in touch with government officials about the release of her State Department emails, exchanges that prompted accusations of collusion from Republicans on Tuesday. The timing of the release of Mrs. Clinton’s State Department emails was critical information for her aides, who were devising strategy on how to respond to any story lines that could emerge. But the communication between the campaign and the Justice Department appeared to have simply been updates on a court case related to the emails, information that was publicly available. Brian Fallon, the campaign’s press secretary, told other campaign aides in May 2015 that he had just received information about a case from someone at the department. “DOJ just filed a briefing saying the gov’t proposes releasing HRC’s cache of   emails in January 2016,” Mr. Fallon wrote. “Get out! ???” replied Cheryl D. Mills, a lawyer and longtime adviser to Mrs. Clinton. The correspondence came months before the F. B. I. which is part of the Justice Department, opened an investigation into Mrs. Clinton’s handling of classified emails at the State Department. In July, the F. B. I. director, James B. Comey, said Mrs. Clinton had been “extremely careless” but recommended no charges, which the Attorney General, Loretta Lynch, accepted. Though the information Mr. Fallon passed on reflected no internal Justice Department thinking, the connection between a senior Clinton aide and the department stoked accusations that the Obama administration had conspired with Mrs. Clinton’s camp. The correspondence released Tuesday showed “a level of collusion which calls into question the entire investigation into her private server,” said Jason Miller, a senior adviser to Mr. Trump’s campaign. Gov. Mike Pence of Indiana, Mr. Trump’s running mate, also brought it up at two events in Iowa. The day after Mr. Fallon’s exchange on the Justice Department’s court filing, he provided additional information to other campaign aides on the case. “DOJ folks inform me there is a status hearing in this case this morning,” he wrote. “So we could have a window into the judge’s thinking about this proposed production schedule as quickly as today. ” Mr. Fallon declined to comment on the exchanges. A Justice Department spokeswoman did not respond to requests for comment.'"}, "time": 1742562084.874284}