{"duration": 0.048041582107543945, "input_args": {"text": "'On Monday, the Seattle Seahawks announced that they signed a quarterback. His name was not Colin Kaepernick. [Instead, the Seahawks signed Austin Davis. You might remember him from a very forgettable half year of play with the Rams, three years ago. He also played two games with the Browns and washed out of the Broncos quarterback competition last year.  Davis will join Trevone Boykin in backing up Russell Wilson. The decision to not sign Kaepernick shouldn’t have come as a surprise given Seahawks head coach Pete Carroll’s comments a week ago after Kaepernick visited the team. At the time, Carroll said: Colin’s been a fantastic football player, and he’s going to continue to be. At this time, we didn’t do anything with it, but we know where he is and who he is and we had a chance to understand him much more so. He’s a starter in this league. And we have a starter. But he’s a starter in this league, and I can’t imagine that someone won’t give him a chance to play. Davis’ career stats are quite underwhelming. In thirteen games and ten starts, Davis has totaled thirteen touchdowns and twelve interceptions. He also hasn’t played a game since 2015 which has caused some, like the Sporting News’ Vinnie Iyer, to call the Seahawks signing of Davis over Kaepernick, “The Fonz on waterskis of Kap’s futile employment search. ” Yet, while no one would dispute that Kaepernick is a better quarterback than Davis, the Seahawks weren’t really looking for a better quarterback than Davis. With a starter like Russell Wilson, a player who has never missed a career start, the Seahawks were in the unique position of actually looking for an Austin Davis. While politics will always enter any discussion involving Kaepernick, the Seahawks likely refused him not because of his social justice politics, but more because of the internal politics of the team. In an article for ESPN the Magazine, Seth Wickersham told of the sometimes awkward and tense relationship between Wilson and his teammates. Specifically, a time when Richard Sherman threw a ball at Wilson during practice and yelled, “You effing suck!” after an interception at practice. Many Seahawks, including Sherman, have voiced support for Kaepernick during his protests . Could those same players rally around and support Kaepernick over Wilson, if he struggles at some point this season? Avoiding that internal strife might very well be the reason why Kaepernick isn’t a Seahawk right now. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742562529.6932197}