{"duration": 0.06084632873535156, "input_args": {"text": "'The European Union (EU) has dramatically increased the size of the “divorce” bill it is demanding the UK pays before leaving the bloc, to 100 billion euros. [The new figure, equivalent £84. 5 billion, reflects stricter demands made by Germany and France, in particular in relation to   farm payments and EU administration fees, according to an analysis by the Financial Times.  European Commission president   Juncker and chief Brexit negotiator Michel Barnier have previously said the UK would be expected to pay around €60 billion (£50. 75 billion). The British Government’s lawyers, however, and a House of Lords committee have said the UK has no legal responsibility to pay the £50 billion bill and the prime minister is opposed to handing over a large amount. David Davis, the Secretary of State for Exiting the EU, reiterated these claims Wednesday morning, as well as implying the escalating demands were merely part of the EU’s negotiating tactics. Speaking on BBC Radio 4’s Today programme Wednesday morning, Mr. Davis said recent comments from his European partners should be “taken with a pinch of salt”. “You have seen in the mixture of gossip and spin there are attempts to shape opinions, try to put across robust points of view,” he said. “This is merely preliminary to negotiations. The simple truth is that this is early manoeuvring. We have to deal with it with equanimity. ” Speaking to ITV Tuesday night, he added: “We’ll not be paying 100 billion. What we’ve got to do is discuss in detail what the rights and obligations are. ” The rising bill reflects a hardening of the EU’s Brexit negotiating stance. According to the Financial Times, the French and Polish governments have pushed for the inclusion of   annual farm payments, whilst the Germans are against granting Britain a share of EU assets. The UK would also be held to guarantees and loans to countries such as Ukraine and Portugal, with Britain being reimbursed as the loans are repaid. Over the period of a decade or more, therefore, the repayments would reduce the net size of the “Brexit bill” to between €55 billion and €75 billion. Mr. Barnier has previously said the UK will not be able to begin discussions on a future trade deal with the bloc, or guarantee the rights of UK citizens in the EU, until the bill is settled.'"}, "time": 1742561663.008227}