{"duration": 0.12236309051513672, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. A New York   News poll shows a tightened presidential race between Hillary Clinton and Donald Trump, two of the most unpopular candidates on record. Mrs. Clinton claims the support of 46 percent of likely voters nationwide, to Mr. Trump’s 44 percent. But differences at the state level suggest Mrs. Clinton still has a strong advantage. The Libertarian and Green Party candidates, Gary Johnson and Jill Stein, remain in the single digits but could have an outsize effect on the outcome. _____ 2. Mrs. Clinton resumed campaigning after a   break to recuperate from pneumonia. “People like me, we’re lucky,” she told an audience at the University of North Carolina in Greensboro. “When I’m under the weather, I can afford to take a few days off. Millions of Americans can’t. ” Mr. Trump unveiled a jobs plan that was short on details, though it did include the pledge to make allies pay the full cost of U. S. military resources used for their defense. Donald Trump Jr. came under fire for invoking Holocaust imagery in complaining about media double standards. If the Republicans did what Democrats were doing, he said, “they’d be warming up the gas chamber. ” _____ 3.  The   National Museum of African American History and Culture opens next week, filling the last museum site on the National Mall. The history begins with slavery in Africa and moves to the Americas, with a welter of piercing objects, like a   lockable neck ring. The collection, which ranges from Harriet Tubman’s missal to Chuck Berry’s red Cadillac, “is a   engrossing,   ” our critic writes. _____ 4. One of our most popular stories today is actually a short video narrated by Shawn Carter, better known as Jay Z. It’s a compelling, speedy recap of the U. S. fight against drugs going back to the Nixon administration, pointing out how   have been disproportionately targeted and penalized. “The war on drugs is an epic fail,” he concludes. _____ 5. The Philippines is struggling through its own devastating war on drugs. Its Senate heard explosive testimony from a   hit man who said that the country’s new president, Rodrigo Duterte, had presided over the extrajudicial killings of about 1, 000 criminals and political opponents over the years he served as mayor of Davao City. The Senate’s televised hearings have already heard that nearly 1, 800 people were killed by police officers and vigilantes in the war on drugs in Mr. Duterte’s first seven weeks as president. _____ 6.  Oliver Stone’s “Snowden” opens nationwide on Friday. Our reviewer calls it “a quiet, crisply drawn portrait of the world’s most celebrated ” and, “by Mr. Stone’s standards, a strikingly sober film”  —   with little in the way of wild conspiracy theories or bravura visuals. Human rights groups are taking advantage of the film’s splash to press President Obama to pardon Mr. Snowden, but lawmakers on the House Intelligence Committee urged Mr. Obama not do so. _____ 7. China’s new class of   is bringing another novelty to the country: the stratospheric divorce settlement. In what appears to be the latest, the Chinese tycoon who holds a controlling stake in Grindr, the gay dating app, has been ordered to transfer some $1. 14 billion in shares of his own company, Beijing Kunlun World Wide Technology, to his wife. _____ 8. Our reporter on the hajj has had to cover her hair and robe herself, despite the heat. Even so, other women on the pilgrimage to Mecca have chastised her for not wearing socks. She relates her struggle with the limits that are Islam’s price of community, including a lesser place for women. “It can feel patronizing, and diminishing of our full humanity,” she writes. “It is why I started to lose faith after a childhood in an observant family and what I still struggle with, at 38, living a life that is secular but guided by Islamic values. ” _____ 9. An N. F. L. official said two Denver Broncos defenders were fined for hitting the Carolina Panthers quarterback Cam Newton on the head in their season opener last week. Newton was hit on the head four times in the game, only one of which drew a penalty against the Broncos. But there were shining moments in the opening week of professional football, like the   34 completions the Kansas City Chiefs’ quarterback, Alex Smith, made against the San Diego Chargers. Tonight, the New York Jets play the Buffalo Bills. (8:25 p. m. Eastern, CBS) _____ 10.  Finally, good news: After years of planning and digitizing, much of the Museum of Modern Art’s sumptuous archives are now available on the museum’s website. “This is like a dream come true for me,” said the archives’ chief, Michelle Elligott, “because I’ve been playing around with this material for 20 years and I know the depth of what’s here. ” _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742562471.9402416}