{"duration": 1.7404053211212158, "input_args": {"text": "'Why Time Magazine’s Joe Klein Is So Wrong About Hillary Clinton Rebutting the absurd claims of my namesake. November 4, 2016 Joseph Klein \\nTime Magazine’s Joe Klein has just penned an article entitled “Why Hillary Clinton Is the Only Choice to Keep America Great.” I feel duty bound to respond to at least the most absurd of the comments made by namesake and author of Primary Colors, the novel based on about Bill Clinton\\'s first presidential campaign in 1992. \\nThe other Joe Klein laments that Hillary has been so “severely damaged in the course of the 30-year battering she’s received at the hands of extremists and the media.” Sorry, but Hillary’s wounds are self-inflicted. Her lies, greed and corruption go back decades and have now reached a crescendo with the dual scandals of her use of a private server for State Department business while she was Secretary of State and of the pay-for-play Clinton Foundation. \\n“There is one part of Trump that is indisputably real: his ego,” the other Joe Klein wrote, as if Hillary were the epitome of humility and grace. \\n“Those who would put Clinton’s failings in the same league as Trump’s depravities are delusional,” declared Klein. I agree with his statement, but for precisely the opposite reason that he advances. Trump did not abuse a public office for personal gain. He did not “hand pick” (Hillary’s word) an ambassador to serve in one of the most dangerous countries in the world and then never respond to his multiple requests for enhanced security, let alone pick up the phone and contact Ambassador Chris Stevens directly. \"The government was not able to save four lives, to keep four lives safe. How can you keep a country safe?\" asked Stevens’ former fiancé in a rhetorical question that Hillary would be unable to answer. Trump did not lie to the families of those slain in Benghazi, as Hillary did. Trump did not put national security at risk by using a private server for government e-mails in order to evade the Freedom of Information Act, as Hillary did. \\nIn short, anyone who thinks that Hillary’s proven record of recklessness, mendacity, and indifference is not more troubling by several orders of magnitude than Trump’s “depravities” is “delusional.” \\nThe other Joe Klein complains that Trump deals in “stereotypes” - “the blacks,” “the Hispanics,” “the Muslims,” “the women” and, yes, even “the veterans.” Yet much of Hillary’s pitch is gender-based. Elect her because she is a woman. And she attacks millions of people who support her opponent with vile epithets – “deplorable,” “racist,” “sexist,” “homophobic,” “xenophobic,” “Islamaphobic,” and – for good measure - “irredeemable.” \\nThe other Joe Klein charges that Trump is “about all that has gone wrong in our society, and nothing of what has gone right.” To paraphrase Bill Clinton, that would depend on what your definitions of “wrong” and “right” are. Is Hillary Clinton really right when she parrots Black Lives Matter’s stereotypical attacks on what she herself has characterized as white “privilege” and “systemic racism” in this country? Is she right when she leaps to conclusions about police “brutality” aimed against African-Americans before the evidence in specific cases is carefully examined? I don’t think so. \\nHillary also represents the political correctness and anti-religious bigotry of the secular left elite that many Americans believe are what truly have gone wrong in our society. At the Women in the World Summit last year, for example, Hillary said that in order to fully secure the reproductive rights of women, “deep-seated cultural codes, religious beliefs and structural biases have to be changed.” Hillary demeaned the sincerely held religious belief in the sanctity of life held by millions of Americans, reminiscent of President Obama’s contemptuous ‘clinging to religion’ quote back in 2008. \\nHillary’s key supporters and top aides have targeted the Catholic Church in particular for their notion of progressive reform. “There needs to be a Catholic Spring, in which Catholics themselves demand the end of a middle ages dictatorship and the beginning of a little democracy and respect for gender equality in the Catholic Church,” wrote Sandy Newman, president of Voices for Progress, in an e-mail to Clinton’s campaign chairman John Podesta. In response, Podesta picked up on the “spring” theme. He wrote, “We created Catholics in Alliance for the Common Good to organize for a moment like this. But I think it lacks the leadership to do so now. Likewise Catholics United. Like most Spring movements, I think this one will have to be bottom up.” \\nWhen Time Magazine’s Joe Klein talks about what is right or wrong in American society, he should get out of his Washington D.C. bubble more often and actually speak with the American people about their day-to-day concerns. Even if Hillary Clinton ends up winning the election, the country will remain divided and she will have no mandate whatsoever to advance her progressive agenda.'"}, "time": 1742562375.3767917}