{"duration": 0.051317691802978516, "input_args": {"text": "'Sunday on NBC’s “Meet The Press,” while discussing the details of President Donald Trump executive order halting access to the United States for immigrants from seven   countries, White House chief of staff Reince Priebus expressed his frustration over host Chuck Todd’s interruptions.  Partial transcript as follows: TODD: One of the in in the order is to include green card holders and that is something that there has been a report that the Department of Homeland Security recommended it not include green card holders. Why did the White House choose to overrule the Department of Homeland Security on that one. PRIEBUS: We didn’t overrule the Department of Homeland Security. As far as green card holders moving forward, it didn’t affect them. If you’re coming in and out identified by the Obama administration as the seven most dangerous in the world in regard to harboring terror firsts and affirmed by congress multiple times then you’re going to be subjected temporarily with more questioning until a better program is put in place over the next several months. this is something that 75% 80% of Americans out there agree with. We don’t want people that are traveling back and forth to one of these seven countries that harbor terrorists to be traveling freely back and forth between the United States and those countries. TODD:  You did say something at the beginning of your answer and it seemed like an aside. This order does not impact any green card holders from these seven countries. PRIEBUS: Of course, it does. if you’re traveling back and forth you’ll be subjected to further screening. Of course. TODD: Are you going to do that to American citizens as well that travel in and out of these seven countries? PRIEBUS: I would suspect it if you’re an American citizen traveling back and forth to Libya you’re likely to be subjected to further questioning when you come to an airport. TODD: Why are you confident that’s constitutional and I’ll ask it this way because green card holders they go through extreme vetting to get the green card, and number two, when they get the green card they’re entitled to all of the protections that citizens do. PRIEBUS: I’m not suggesting that. TODD: I understand that. are you, by having to put an extra hurdle for a green card holder to get into the country how are you confident that doesn’t violate their rights and doesn’t end up making the order unconstitutional. PRIEBUS: First of all, it’s not affecting green card holders. TODD: you keep saying  —   you said it does  —   PRIEBUS: If you would just slow down for a second and listen I could answer your question. &gt, TODD I understand that, but you’ve twice confused me so I’m trying to understand the clarity. PRIEBUS:  It’s because you don’t stop talking, Chuck. I love you, but let me answer the question. If you’re a person  —   this isn’t in regard to the executive order, the executive order doesn’t affect green card holders moving forward. I said that. What I’m suggesting is customs and border patrol, I would suspect within their discretion hey have a person traveling back and forth to Libya or Somalia or Yemen I would suspect within their discretion they might ask a few more questions at JFK or some other airport when someone is coming back and forth within their discretionary authority as a customs and border patrol agent and what I’m saying is that I would suspect that most would agree that that would be a good thing to do. What I’m not suggesting to you that that is in the order moving forward. I’m suggesting that within the discretion of the CBP that those questions would likely be asked. Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742561916.021467}