{"duration": 0.06735110282897949, "input_args": {"text": "'In President Trump’s   world order, Roger J. Stone Jr. the onetime political consultant and   provocateur, has been one of the few constants  —   a loyalist and   “dirty trickster” who nurtured the dream of a presidential run by the     for 30 years. But two months into the Trump presidency, Mr. Stone, known for his pinstripe suits, the Nixon tattoo spanning his shoulder blades and decades of outlandish statements, is under investigation for what would be his dirtiest trick  —   colluding with the Russians to defeat Hillary Clinton and put his friend in the White House. At a hearing of the House Intelligence Committee on Monday, Democrats pressed James B. Comey, director of the F. B. I. for information on Mr. Stone. Asked by Representative Adam B. Schiff of California, a Democrat, if he was familiar with Mr. Stone, Mr. Comey replied tersely, “Generally, yes,” before saying he could not discuss any specific person. Mr. Stone, 64, is the best known of the Trump associates under scrutiny as part of an F. B. I. investigation into Russian interference in the election. John D. Podesta, the Clinton campaign chairman whose hacked emails were released by WikiLeaks, accused him in October of having advance warning of the hacks, which the intelligence community has concluded were orchestrated by Russia. “Trust me, it will soon the Podesta’s time in the barrel,” Mr. Stone had mused on Twitter before Mr. Podesta’s emails were released. When Mr. Schiff asked Mr. Comey at the House hearing how Mr. Stone could have known that Mr. Podesta’s emails were going to be released, the F. B. I. director again refused to answer. “That’s not something I can comment on,” Mr. Comey replied. Mr. Stone has denied advance knowledge of the hacks or any involvement with the Russians. But his public statements have given investigators something to focus on. Before the Podesta emails were released, Mr. Stone said in a speech that he had “communicated with” Julian Assange, the WikiLeaks founder  —   whom he has defended for years  —   and that he had a large trove of material on the Clintons that he would publish shortly before the election. He has acknowledged having communicated over Twitter with the online persona Guccifer 2. 0, who American officials believe is a front for Russian intelligence officials. And there was the Podesta tweet. But Mr. Stone has explanations for each: The timeline of his “benign” contacts with Guccifer 2. 0  —   “who may or not be a Russian asset”  —   disproves claims of collusion his communication with Mr. Assange was through an intermediary and was “perfectly legal” and the Podesta tweet referred to information in an article he wrote that appeared two months later, not any emails. Now under scrutiny by both F. B. I. and Senate investigators, Mr. Stone has hired two lawyers to represent him. But in an interview, Mr. Stone maintained that this was “a scandal with no evidence. ” “There is still not an iota of proof that anyone on the Trump campaign colluded with the Russians,” said Mr. Stone, who met Mr. Trump through their mutual mentor, the   fixer and lawyer Roy M. Cohn. Mr. Stone learned from Mr. Cohn that all press is good press, and to hit back, hard and often, and he is doing just that. His recent book, “The Making of the President 2016,” is part paean to Mr. Trump and part pushback against the claims related to Russia. While promoting the book, Mr. Stone has said he believes his communications were monitored by the government, and he supports Mr. Trump’s contention that there must have been surveillance of him as a candidate. His own writings mirror, and perhaps feed into, Mr. Trump’s belief that there is a broad intelligence community effort to undermine the current White House. He tweeted in protest of “smears” that he wanted to respond to during Monday’s hearing. Few people go as far back with Mr. Trump as Mr. Stone. Over the years he was by Mr. Trump’s side as he toyed with running for president and then, in 2015, finally decided to do it. But he seems to prefer the role of outside adviser in a relationship that has had many ups and downs. It was the role he played in 2016 after he left Mr. Trump’s campaign over what Mr. Stone said was a fight about its direction. Mr. Stone said he decided to leave Mr. Trump maintained that he fired him. As an informal adviser, Mr. Stone supported Mr. Trump’s plan to focus extensively on immigration at the start of the 2016 campaign, and believed that he could tap into a core group of disaffected Republican voters. He encouraged his engagement with conservative online media, such as Newsmax and, later on, Breitbart. He also advised Mr. Trump to attack Mrs. Clinton over how she dealt with women involved in her husband’s extramarital affairs, a line of attack that Mr. Trump embraced. Mr. Trump offered praise for Mr. Stone on the coming Netflix documentary “Get Me Roger Stone. ” These days he will not discuss how frequently he is in touch with Mr. Trump, or whether he has visited the Oval Office since the inauguration  —   which he attended dressed according to what he described as “proper etiquette”: a top hat and morning suit. The White House press secretary, Sean Spicer, told reporters in the briefing room on Monday that Mr. Trump and Mr. Stone speak “from time to time,” and he contended they had not done so recently. To both his allies and critics, Mr. Stone, a native of Connecticut, presents a contradictory portrait. His name inspired anxiety in a generation of New York political operatives. He has embraced theories that Mr. Trump pushed in the campaign about Senator Ted Cruz’s father somehow being tied to the John F. Kennedy assassination. And once a week he   on a radio show hosted by Alex Jones, who has a devoted following of Trump voters along with a raft of conspiracy theories of his own. On Monday, when he devoted most of his show to defending Mr. Stone, Mr. Jones expressed concern that Mr. Stone’s life was in danger  —   a reference to Mr. Stone’s claim that he was recently poisoned with polonium as well as the victim of a “suspicious”    broadside car crash last week. Mr. Stone did not let that keep him from an event in Orlando to promote his book the following day. But Mr. Stone is also a libertarian and strong supporter of gay rights and legalized marijuana who expressed concern in 2016 that Mr. Trump’s campaign team didn’t try harder to get him to disavow the Ku Klux Klan leader, David Duke. While he has long been an outlier in the political world, he got his real start in national politics with the Reagan campaign in 1979. He is renowned among Republican political professionals for using the internet for years before “any mainstream Republicans or activists,” according to Tony Fabrizio, a veteran Republican pollster. And for a time, as a partner in a   Washington lobbying firm, Mr. Stone was a part of the swamp that Mr. Trump now wants to drain. He worked there with his old friend, Paul Manafort, who was Mr. Trump’s campaign chairman. His ties to Russia are now under scrutiny by the F. B. I. but Mr. Manafort denies any suggestion that he colluded with Russian officials or anybody else. But those establishment days seem far in the past. As scrutiny of him has intensified in recent weeks, Mr. Stone has lashed out more aggressively, sending a series of caustic,   messages on Twitter, several of which he deleted a few hours after posting. “Don’t confuse Roger Stone with the character I play,” Mr. Stone said with a chuckle in an interview on Sunday, conceding that he has sometimes sent a “  tweet. ”'"}, "time": 1742628540.533281}