{"duration": 0.08036947250366211, "input_args": {"text": "'In her first international trip in her role as U. S. ambassador to the United Nations, Nikki Haley toured a Jordanian refugee camp Sunday  —   and defended the Trump administration’s policy on the Syrian refugee crisis in the face of its many critics in the UN. [Visiting the Zaatari refugee camp, Haley met with Syrian refugees displaced by the Syrian civil war and reminded reporters of the work the U. S. is doing in the region  —   a role that has been widely ignored as critics instead focus on Trump’s executive order restricting refugees into the country.  “We’re the No. 1 donor here through this crisis, that’s not going to stop,” Haley said in an interview after UN officials briefed her on the camp, according to The Wall Street Journal. Haley visited vocational classes and a supermarket where   are used to charge accounts as a way to cut down on fraud. Outside the camp, she also visited a U. S.  school where Syrian and Jordanian girls can get an education and a border crossing between Jordan and Syria.  One of the reasons we traveled to Jordan is to see firsthand how the Syrian crisis is affecting children. pic. twitter.   —   Nikki Haley (@nikkihaley) May 22, 2017,  pic. twitter.   —   Nikki Haley (@nikkihaley) May 21, 2017,  During the trip, Haley will also visit parts of Turkey and will meet with government and UN officials, as well as heads of NGOs. The trip will focus on the Syrian refugee crisis both countries are on the front line of the crisis and share borders with the imperiled country. The Trump administration has eyed deep cuts to funding for the controversial UN, but Haley sought to combat the narrative that those cuts would hurt those most in need. According to McClatchey, Haley told reporters that the U. S. was “not pulling back” from the crisis and was in fact “engaging more. ”  The Trump administration’s policy on the crisis, particularly President Trump’s executive order on immigration, has attracted the criticism of members of foreign governments, including figures in the United Nations. In an address to the League of Arab States in March, UN   Antonio Guterres said it “breaks my heart to see developed countries closing their borders to refugees fleeing this region, and worse, sometimes invoking religion as a reason to keep them out. ” But Haley has already gained a reputation for standing up to the UN. On multiple occasions, she has blasted the body’s   bias. In March, she demanded a UN report calling Israel an “apartheid state” be withdrawn  —   which it was. In April, when Bolivia requested a   session of the UN Security Council in the wake of a chemical weapons attack in Syria, Haley denied the request. “Any country that chooses to defend the atrocities of the Syrian regime will have to do so in full public view, for all the world to hear,” she said, also blasting the “empty words” of other members of the council. Haley foreshadowed her defense of the U. S. policy in an   last week for The Wall Street Journal. In it, Haley defended the U. S. saying “The U. S. is doing more than anyone. ” Talking about how she was heckled at an international women’s conference in April, she argued that “those who accuse the U. S. of heartlessness in the face of this crisis are wrong. ” “No country has invested more in protecting, housing, feeding and caring for Syrian refugees than the U. S. We have provided nearly $6. 5 billion in emergency assistance for Syria since the start of the crisis. Inside Syria, some four million people benefit from U. S. assistance for essentials like food and shelter every month,” Haley wrote. Haley said she would bring attention to U. S.  food programs on her trip to Turkey and Jordan, including programs that deliver aid to Syrians still trapped in the country. “With American help, Syria’s neighbors have made the difference between life and death for millions of Syrians. The U. S. and the UN will continue to do a great deal of heavy lifting for these desperate people,” she wrote. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY.'"}, "time": 1742564603.6398487}