{"duration": 0.08391714096069336, "input_args": {"text": "'Homeland Security John Kelly will soon decide whether to send home roughly 50, 000 Haitians who have been living in the United States on temporary visas since 2010. [The foreign citizens will be required to go back home if Kelly agrees with an internal recommendation against renewing the Haitians’ temporary visas by their expiration date of July 22, according to USA Today.  The visas, dubbed “Temporary Protected Status,” were granted to the Haitians 2010 by former President Barack Obama, after an earthquake hit the undeveloped island. Since then, Haitians’ TPS status has been extended multiple times by DHS, which also stopped repatriating illegal alien to Haiti in 2010. However, DHS officials began returning Haitian illegal aliens home in 2016, giving Kelly a Democratic precedent to end the TPS extensions. “Removal flights from the United States to Haiti have now resumed,” Obama’s DHS secretary, Jeh Johnson, said in a November 2016 statement. “In the last several weeks ICE has removed over 200 Haitian nationals and plans to significantly expand removal operations in the coming weeks. ” According to USA Today: James McCament, acting director of U. S. Citizenship and Immigration Services, concluded in a letter last week that conditions in Haiti have improved enough to end “temporary protected status” for Haitians, according to a copy of the letter obtained by USA TODAY  …     McCament proposed an extension to January to allow for a “period of orderly transition” but said the program should not be extended beyond then  …     McCament said Haiti has not completely recovered from the earthquake, but enough progress has been made. He said the Obama administration started sending some Haitians home in 2016  …     The U. S. is currently giving protection to those from 13 countries: El Salvador, Guinea, Haiti, Honduras, Liberia, Nepal, Nicaragua, Sierra Leone, Somalia, Sudan, South Sudan, Syria and Yemen, Overall, roughly 300, 000 foreigners are living  —   and many are working  —   in the United States because they have gotten repeated extensions of TPS status. For example, in 2016, Obama extended TPS for 60, 000 Hondurans who got the status in 1998 because of an earthquake in their home country. Many Liberians who were given TPS in 1991 now have a different form of visa which allows them to remain in the United States until November 2017. TPS status for six national groups will expire in 2017. TPS for people from seven additional countries  —   including Somalia and Yemen  —   will expire in 2018. Each year, 4 million Americans turn 18 and enter the workforce, where they face job competition from roughly 1 million new temporary contract workers and 1 million legal immigrants, and from roughly 30 million unemployed   Americans. But business groups want the government to keep importing additional customers and new,   workers. Haitian activists say their home country is still too poor to accept the return of the 50, 000 Haitians. “Haiti is nowhere near ready to have anybody back  —   we just got hit by [Hurricane] Matthew,” said Nadine Dorcena, an aid worker at the Haitian   Center Of Catholic Charities, in Dorchester, Mass.  She continued: To me, in my personal opinion, Haitian people are a group of proud folks. If our country had provided the resources for them, they would stay home. The fact is that there is insecurity, there are no jobs, you have kids done with school and they have no hope of continuing or doing anything for the future, there are no jobs provided  …     [and we] keep getting hit with natural disasters. Democrat legislators and some GOP politicians want the DHS to extend the Haitians’ TPS status, said USA Today: “The recommendation upset Republican and Democratic members of Congress who have pleaded with Kelly to extend the protections  …     ‘Haiti is one of the poorest countries in the world and right now it’s unable to support the roughly 50, 000 Haitians that are currently receiving protected status here in the U. S.,’ Sen. Bill Nelson,  . said Thursday. ”  '"}, "time": 1742563941.4573786}