{"duration": 0.026446819305419922, "input_args": {"text": "'BREAKING: FBI Gets Search Warrant For State Department Emails On Weiner’s Computer (VIDEO) By Michelle Oxman on October 30, 2016 Subscribe \\nOn Sunday afternoon, October 30, 2016, the FBI obtained a search warrant for emails on a laptop owned by Huma Abedin and Anthony Weiner. You’ll remember that Weiner was under investigation for sexting a 15-year-old girl. As it happened, the same laptop also contained emails that Abedin, Clinton’s Chief of Staff at the State Department, forwarded to her personal Yahoo account so she could print them. That’s why FBI agents got Director James Comey’s approval to seek access to the emails, as Comey told Congress (and we reported ) on Thursday, October 28. A Rather Unusual Warrant \\nNow, when is the last time you ever heard about a search warrant being granted? I bet you can’t think of one. That’s because police and prosecutors ask the court to issue warrants in secret. That makes sense, even to those of us who usually err on the side of supporting civil liberties. After all, if you knew the police had a warrant to search your home or your computer, what would you think of doing? \\nWhy do we know about this warrant? Because James Comey told Congress there were new emails “pertinent” to the Clinton investigation. Trump supporters argued that the government must have reviewed the emails and would only have released the information if there was important new evidence. In reality, the FBI couldn’t do so legally. Why? Because the warrant to search the computer for evidence of Weiner’s contact with a 15-year-old girl could not have covered Huma Abedin’s work-related emails from three or more years earlier. There’s a helpful explanation of the legal issues relating to the search warrant in today’s Washington Post. \\nStill, faced with the innuendo and implications of illegality in Comey’s vague letter, Clinton and her supporters insisted that the FBI disclose what it had. Perhaps the FBI didn’t want to admit that it didn’t know what it had. Or maybe the FBI didn’t want to admit that it had gotten its knowledge illegally. Getting a search warrant bought the FBI time, though, and left the whole mess hanging over Clinton’s head as she approaches the last week of the campaign. Violating Policy \\nThere seems to be no doubt that Comey’s letter to Congress violated two long-standing tradition and policies: (1) prohibiting discussion of ongoing investigations; and (2) not taking actions to favor one side or another in elections. Two former Deputy Attorneys General, one Democrat and one Republican,publicly questioned Comey’s fitness to lead the FBI because of it. In addition, others have pointed out that Comey has repeatedly gone beyond established limits in his discussions of the Clinton email investigation. The Known Unknowns \\nWe still don’t know whether any of the emails on that computer contain new information. We don’t know whether Secretary Clinton ever sent emails to Abedin’s personal account on that computer or received emails from Abedin via that account. We don’t know whether classified information was sent or received via this personal computer. We don’t know what any of the emails would tend to show about Clinton’s respect for classified information. After all, it wasn’t Clinton, but Abedin, who forwarded the emails. One Final Question \\nApparently, the FBI agents working on the Weiner case became aware several weeks ago that the computer contained emails that Abedin forwarded to herself while she worked at the State Department. Why did they wait until last Thursday to tell Comey? Surely they anticipated his likely reaction? Did they “play” Comey to manipulate the election results? \\n\\nAbout Michelle Oxman \\nMichelle Oxman is a writer, blogger, wedding officiant, and recovering attorney. She lives just north of Chicago with her husband, son, and two cats. She is interested in human rights, election irregularities, access to health care, race relations, corporate power, and family life.Her personal blog appears at www.thechangeuwish2c.com. She knits for sanity maintenance. Connect'"}, "time": 1742628574.8790116}