{"duration": 0.03171896934509277, "input_args": {"text": "'By wmw_admin on October 28, 2016 Ben Jacobs, Sabrina Siddiqui and Spencer Ackerman — The Guardian Oct 28, 2016 \\nThe FBI is investigating newly discovered emails related to Hillary Clinton’s personal server, its director has announced. \\nThe FBI had announced in July that its investigation into the Democratic presidential candidate’s private email server had concluded with a recommendation of no criminal charges in the matter, although James Comey, the FBI’s director, criticised Clinton as “careless”. \\nBut in a letter sent to members of Congress on Friday, Comey said new emails had been discovered in an “unrelated” case. \\n“In connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation,” Comey wrote. “I am writing to inform you that the investigative team briefed me on this yesterday, and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information as well as to assess their importance to our investigation.” \\nComey added: “Although the FBI cannot yet assess whether or not this material may be significant and I cannot predict how long it will take to complete this additional work, I believe it is important to update your Committees about our efforts in light of my previous testimony.” \\n“The system might not be as rigged as I thought,” remarked Donald Trump at a rally on Friday afternoon. \\nA US security source firmly ruled out that the “unrelated case” Comey referred to in his letter was the investigation into the digital penetration of the Democratic National Committee earlier this year. US intelligence officials have blamed Russia for hacking the DNC and releasing its internal communications online. \\nThe source, who would not speak on the record, said neither that inquiry nor its adjuncts were related to the new investigative developments related to Clinton. Nor is the recent criminal investigation into a National Security Agency contractor accused of hoarding highly classified intelligence data. \\nLater the Associated Press, citing an unnamed official, claimed the newly discovered emails “ did not come from her private server ”. \\nThe letter from Comey comes 11 days before the presidential election and nearly four months after the FBI director announced the bureau would not recommend criminal charges against Clinton for what it dubbed “extremely careless” use of a private email server while secretary of state. The FBI director said then: “Although there is evidence of potential violations of the statutes … our judgment is that no reasonable prosecutor would bring such a case.” \\nIt was not immediately clear if Clinton would address the matter publicly. She ignored shouted questions from reporters waiting on the tarmac about the FBI’s announcement and did not raise the issue after taking the stage in Cedar Rapids, Iowa, sticking with her routine stump speech.'"}, "time": 1742628465.9200318}