{"duration": 0.0582423210144043, "input_args": {"text": "'Rep. Ted Lieu ( ) called Attorney General Jeff Sessions “a racist and a liar” on Sunday after he referred to Hawaii as “an island in the Pacific” in response to a federal judge who issued an order to block President Donald Trump’s temporary visa ban. [Dear ”Attorney General” Sessions: You are a racist and a liar. Actually, just joking. Oh wait, your record shows you are a racist  a liar. https:  .   —   Ted Lieu (@tedlieu) April 23, 2017,   “Dear ‘Attorney General’ Sessions,” Lieu wrote on his Twitter account. “You are a racist and a liar. Actually, just joking. Oh wait, your record shows you are a racist  a liar. ” However, investigations have revealed that allegations of racism and dishonesty pushed by the left to discredit Sessions are part of what has become known as “fake news. ” Prior to that tweet, Lieu attempted to mock Sessions again by reminding the accomplished attorney that “Hawaii is a state  HQ of UNITED STATES Pacific Command:” Dear AG Jeff Sessions: There is a document called the Constitution. Read it. Oh, and Hawaii is a state  HQ of UNITED STATES Pacific Command https:  .   —   Ted Lieu (@tedlieu) April 20, 2017,  Sessions made the comments about Hawaii in an interview with “The Mark Levin Show” last week. “We’ve got cases moving in the very, very liberal Ninth Circuit, who, they’ve been hostile to the order,” Sessions said. “We are confident that the President will prevail on appeal and particularly in the Supreme Court, if not the Ninth Circuit. ” He added, “I really am amazed that a judge sitting on an island in the Pacific can issue an order that stops the President of the United States from what appears to be clearly his statutory and Constitutional power. ” Sessions’ statement was in response to federal Judge Derrick Watson’s order that blocked President Donald Trump’s temporary visa ban on travelers entering the United States from six (formerly seven)   countries. The temporary ban is meant to allow the U. S. government to properly vet individuals listed on it. The countries listed in the initial ban are Iraq, Iran, Syria, Libya, Somalia, Sudan, and Yemen Iraq has since been taken off the list. The U. S. Department of Justice is appealing Judge Watson’s decision. According to the Associated Press, U. S. Justice Department spokesman Ian Prior clarified Sessions’ statements in an email, saying the attorney general was questioning one judge’s ability to block the president’s executive order for the travel ban. “Hawaii is, in fact, an island in the Pacific  —   a beautiful one where the Attorney General’s granddaughter was born,” Prior said. “The point, however, is that there is a problem when a flawed opinion by a single judge can block the President’s lawful exercise of authority to keep the entire country safe. ” In a Sunday interview with ABC’s George Stephanopoulos on “This Week” about why he referred to Hawaii as an “island in the Pacific,” Sessions said, “Nobody has a sense of humor anymore. ” Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742564135.3462172}