{"duration": 0.0931239128112793, "input_args": {"text": "'  Don\\'t Diss The Dark Ages Oct 26, 2016 2:50 PM 0 \\nSubmitted by Charles Hugh-Smith via OfTwoMinds blog, \\nMuch was lost when the Western Roman Empire collapsed, but islands of literacy, learning and security arose despite the constant conflicts and threats of invasion. \\nOnce dissed as The Dark Ages, the Medieval Era is more properly viewed as a successful adaptation to the challenges of the post-Western Roman Empire era. The decline of the Western Roman Empire was the result of a constellation of challenges, including (but not limited to) massive new incursions of powerful Germanic tribes, a widening chasm between the Western and the Eastern Roman Empire (Byzantium), plague, an onerous tax burden on the non-elite classes, weak leadership, the dominance of a self-serving elite (sound familiar?) and last but not least, the expansion of an unproductive rabble in Rome that had to be bribed with increasingly costly Bread and Circuses . \\nIn effect, The Grand Strategy of the Roman Empire ran out of time and money. The Grand Strategy, successful for hundreds of years, relied heavily on persuading \"barbarian\" tribes to join the Roman system for the commercial and security benefits. This process of integration worked because it was backed by the threat of destruction by military force. \\nThe Empire maintained relatively modest military forces given its vast territory, but its road system and fleet enabled relatively rapid concentration of force to counter an invasion. It also maintained extensive fortifications along active borders. \\nAll of this required substantial tax revenues, manpower and effective leadership, not just for fortifications, the army, roads and the fleet, but to maintain the commercial and political benefits offered to \"barbarians\" who chose integration in the Empire. \\nOnce the military threats proliferated and the benefits of Imperial membership eroded, the Grand Strategy was unable to maintain the integrity of the Imperial borders. \\nAs tax revenues and the bureaucracy they supported imploded, security declined, reducing trade and communications. This unvirtuous cycle fed on itself: reduced trade led to reduced tax revenues which led to phantom legions that were still listed on the bureaucratic ledgers but which no longer had any troops. \\nThe collapse of the Western Empire was a process, not an event. Key organizational infrastructures that endured through the Medieval era--for example, the Roman Catholic and Orthodox Christian Churches--gained traction in the waning centuries of the Western Empire. \\nMonasteries offered islands of scholarship and literacy and in many cases offered security via fortifications. \\nAs trade diminished along with secure trade routes, self-reliance became the order of the day outside the borders of the Byzantine and Persian empires. \\nThough political leadership shifted with the latest invasion from the steppes of Eurasia, the two branches of Christendom slowly converted many invading groups or consolidated existing Christian powers into alliances that bound together diverse groups and proto-states. \\nThese alliances were typically contingent and temporary, as today\\'s ally became tomorrow\\'s enemy, or vice versa. Despite the shifting loyalties of constant invasion and warfare, the Byzantine Empire endured and Charlemagne (and others) in Western Europe established the fractured but still effective Holy Roman Empire. \\nMuch was lost when the Western Roman Empire collapsed, but islands of literacy, learning and security arose despite the constant conflicts and threats of invasion. Venice offers one example of a small city securing trade routes with commercial centers that then funded a regional empire. \\nThe tidiness of the old Empire could not be reinstated. The adaptations were as messy and untidy as the challenges that swept in from the steppes and forests. \\nSo please don\\'t diss the Dark Ages. Yes, the Roman baths, coliseums and political /social order fell into disrepair, but new ways of coping emerged that were as contingent and untidy as the era\\'s multiple challenges. \\nNew modes of production and new social /political orders do not arise fully formed. They are pieced together by trial and error and numerous cycles of adaptation, innovation and failure.'"}, "time": 1742561979.1736689}