{"duration": 0.051229238510131836, "input_args": {"text": "\"Thu, 27 Oct 2016 09:10 UTC A new large study presented at the American Neurological Association Annual Meeting has found a strong connection between cholesterol-lowering medications and Parkinson's disease. Contradicting previous claims that statins are protective against PD. In recent years there has been a considerable effort to try to find new applications for statins. Reports have tried to link statins with positive results on a wide range of conditions, such as: Alzheimer's, Parkinson's, Cancer, Multiple Sclerosis and Depression. These claims have been somewhat surprising considering that the brain and nervous system have the highest requirements for cholesterol and low cholesterol levels are associated with cognition problems, increased suicide, and an increased risk for some types of cancer . Many people have suspected that the data is being carefully cherry picked in an attempt to show a false benefit and expand the use of statins into other areas. In the new study, researchers analysed data from the MarketScan Commercial Claims and Encounters database - including information on 30,343,035 persons aged 40 to 65 years. The use of cholesterol-lowering drugs was associated with a significantly higher prevalence of Parkinson's disease. This is not the first time that we have seen an absence of the predicted benefits of statins in real life data. For example, a large study in 2011 collected data from 289 of 290 municipalities in Sweden and found that the predicted benefits of statins had not materialised, despite a dramatic increase in statin use. An important finding of this new study is that all of the cholesterol lowering drugs included were associated with an increased risk of PD. Suggesting that the harms of the drugs could be directly related to the cholesterol-lowering effect. This adds to the mountain of data that now exists to show that having a low level of cholesterol is worse than having a high level. Sources Nilsson, S et al. No connection between the level of exposition to statins in the population and the incidence/ mortality of acute myocardial infarction: An ecological study based on Sweden's municipalities. Journal of Negative Results in BioMedicine 2011, 10:6 Comment: It doesn't come as a surprise:\""}, "time": 1742562254.6946876}