{"duration": 0.09379053115844727, "input_args": {"text": "'AUGUSTA, Ga.  —   The last player to win the Masters while ranked No. 1 in the world was Tiger Woods in 2005. That streak is safe for at least another year after Dustin Johnson withdrew on Thursday because of a lower back injury he sustained in a fall down the stairs of his rental home near the course on Wednesday afternoon. Minutes before he was expected on the first tee to begin his first round, he was still telling fellow competitors he was going to play. Or at least try. “Standing next to the practice putting green, I still was expecting to give it go,” Johnson said after withdrawing. “But even on the putting green, I was taking a few easy swings and my back was so tight. “I was only swinging 80 percent and I couldn’t get through the ball all the way. The backswing was fine but at impact and moving through, it hurt. I knew I wasn’t going to be able to compete. It’s terribly disappointing” On a windy day, Charley Hoffman used nine birdies to surge to the top of the leader board with a    65. He has a   lead over William McGirt, who is playing his first Masters at age 37. Lee Westwood is at   and Phil Mickelson, Sergio Garcia and Justin Rose are part of an   group that is  . Johnson had an extended   session before his tee time just after 2 p. m. He hit dozens of balls on the practice range but also took numerous breaks to go inside at the Augusta National Golf Club to have work done on his back. Nonetheless, about five minutes before his tee time, he began walking toward the first tee and practice putting green. “It’s really too bad  —   it feels like in two days I’ll be fine,” Johnson said, standing alongside the first tee after his withdrawal. Johnson offered a few more details about the mishap at his rented home in the Augusta area. He said his son, Tatum, was on his way back from day care, and he was going to move the car. “I slipped down the stairs, and there were only three stairs,” Johnson said. “It would have been better if it was a full staircase because I might have slid more. Instead, I just kind of stopped and hit. ” He landed on his elbow and lower back. He said the elbow was swollen but did not inhibit his swing. His back remained a problem even after he had medical personnel treat it for hours on Wednesday night. “I was up all night and didn’t really sleep,” said Johnson, last year’s United States Open champion. “It got better, but not really better enough. ” Before the fall, Johnson’s coach, Butch Harmon, who is doing commentary for   Sky Sports, suggested on the air that this Masters was Johnson’s to lose. “He’s probably playing the best he has ever played in his life,” Harmon said. “He absolutely loves this place and finished fourth here last year so has to be the   favorite. But that means nothing once Thursday starts. ” Johnson, 32, who supplanted Jason Day at No. 1 in February, arrived here with victories in his last three starts. He was the pretournament consensus favorite to become the first player since Jimmy Demaret in 1940 to make the Masters his fourth consecutive P. G. A. Tour win. On Tuesday, Johnson was asked about going into the Masters as the favorite. His response foreshadowed this unexpected turn of events. “I’ve got a lot of confidence in my game right now, especially with the way I’ve been playing the last few tournaments,” he said. “But, you know, anything can happen. ” This is the second time in the past six years that an injury kept Johnson from competing in the Masters, which is about a   drive from Columbia, S. C. where he was born. In 2012, Johnson withdrew two days before the first round with a back injury, which he said he got from lifting a Jet Ski. Fred Couples, whose World Golf Hall of Fame career has been disrupted by chronic back issues, said he was disappointed to hear that Johnson hadn’t been able to start. “It’s a bummer,” he said, adding, “But I didn’t fall down any stairs. Maybe that would have helped my back. ” Follow the Masters leader board here. '"}, "time": 1742564617.2979302}