{"duration": 0.0511322021484375, "input_args": {"text": "'By wmw_admin on November 1, 2016 Introduction — Nov 1, 2016 The head of Britain’s MI5 Andrew Parker says: “There will be terrorist attacks in this country. The threat level is severe and that means likely.” To which we can only add: whence this certitude? Or as the correspondent who sent this in noted: “Does he know something we don’t?” In attempting to answer that it should be noted that being the head of Britain’s MI5 Parker would be privy to any plans to launch a ‘terrorist’ false flag. In fact they would require his approval. So when Parker says “there will be terrorist attacks in Britain” he not speculating, particularly when he lists the three main threats to security in the country. Apart from “Islamic inspired terror”, Parker also cites threats from dissident Irish republicans and Russia. That’s the giveaway because the British and other Western intelligence agencies are working hand-in-glove with the same “Islamic inspired” extremists in Syria. Just as they covertly supported various Mujahideens fighting against Russian forces in Afghanistan, Western intelligence together with their allies in the gulf states and Turkey are now aiding militants in an effort to oust Syrian President Assad. So if such groups plan to turn their attention toward the West Andrew Parker would be one of the first to know. In fact such plans would probably require his approval before they went ahead. Ed. Looking every inch the public schoolboy bully, Andrew Parker the current head of M15. Click to enlarge Exclusive: ‘There will be terrorist attacks in Britain,’ says MI5 chief Paul Johnson and Ewen McAskill — Guardian.co.uk Nov 1, 2016 \\nMI5 has its roots in the run-up to the first world war. In 1909, the targets were suspected agents working for German naval intelligence, the focus was on Germans living in Britain. The Daily Mail, as ever, was alert to the danger, advising readers: “If your waiter is German, refuse to be served by him.” \\nIn the 107 years since, there have been 17 director generals of MI5. Until 1993, their identities were a state secret. And even after an emergence of sorts into the public eye, the guiding rule to their life at work was: say as little as possible and what you do say, say discreetly. \\nNone has ever given a newspaper interview. Until now – and to the Guardian, the paper that won a Pulitzer prize for its coverage of the Edward Snowden revelations of 2013 , which so angered the British and US governments, and the intelligence agencies, and prompted fierce debate around the world about mass surveillance. \\nAndrew Parker, the current chief, at the time spoke out forcefully about the damage he said Snowden was doing to the intelligence agencies and the help he was giving to our enemies. So has he changed his mind? Does he now recognise that Snowden was a force for good? \\n“Not at all,” he says. And the Guardian? Can you see why we published the story? “I have no view on that either,” he says, gripping the glass of water in his left hand a little more tightly. \\n“I spoke out at the time about the damage that was done to the work of British and allied intelligence agencies, about having so much about how we operate revealed to our adversaries. Secrecy is not something we need for its own sake. \\n“The Guardian takes a clear interest in the work we do – some of it is well informed, some less so. I am trying to create greater understanding – it matters to us that we have public consent for what we do.” \\nSitting in the office of the president of the Royal Society, where he has just been the surprise guest speaker at its annual diversity conference, Parker, who has made speeches and appeared once on the BBC Today programme, has a worldview that centres on three areas of threat. The first is Islamic-inspired terror, which he calls enduring and generational. \\n“International terrorism in its latest shape, based on twisted ideology, brings terror to our streets and most of the developed world, including North America, Australia and Turkey,” he says. \\n“Currently, the flavour of it is Daesh, or Isil [Islamic State], and we still have the al-Qaida brand. This is something we have to understand: it’s here to stay. It is an enduring threat and it’s at least a generational challenge for us to deal with.” \\nHe says the number of terror plots thwarted in the past three years stands at 12. “That sort of tempo of terrorist plot and attempts is concerning and it’s enduring. Attacks in this country are higher than I have experienced in the rest of my career – and I’ve been working at MI5 for 33 years. The reality is that because of the investment in services like mine, the UK has got good defences. My expectation is that we will find and stop most attempts at terrorism in this country.” \\nHe lets the word “most” sink in before adding: “There will be terrorist attacks in this country. The threat level is severe and that means likely.” \\nThe second area of threat is terrorism in Northern Ireland – from what he calls “dissident republicans of various sorts”. The last terrorist-related death was of a prison officer in March . \\nAnd the third is the covert threat from foreign governments. He is most exercised about Russia, which he says is at work across Europe and in the UK, using military means, propaganda, espionage, subversion and cyber-attacks to achieve its foreign policy aims. “It’s MI5’s job to get in the way of that.” \\nParker says the threat from Russia is real – in part because it is so varied. “We see it in places such as Ukraine and the appalling brutalities in Syria.”'"}, "time": 1742628517.2566733}