{"duration": 0.06891345977783203, "input_args": {"text": "'The Media Lost All of Its Political Power Last Night -- Thank You, Donald Trump! By: John Nolte November 9, 2016 \\nThe morally dark Obama-era is over and utterly and totally repudiated. The Clintons have finally and forever been staked in their mercenary black hearts. Our smug, supremacist overlords in the Elite Establishment of both Parties, these rotting, rent-seeking parasites, are now vanquished. But nothing is grander, nothing is more glorious, nothing is more satisfying, nothing is sweeter, nothing is more validating, nothing is better for America than the death of the mainstream media\\'s political power. \\nThe elite national political media is done as a force, moral or otherwise, in this country. Done. Buried. Exposed. Over. Out. And using a slow-acting poison called hubris, it was death by suicide. So smug. So sure of themselves. So sanctimonious. So snark-filled. So utterly incapable of anything close to self-reflection. \\nThe self-induced poison took effect over a number of years and through five steps. \\nHere they are. \\n1. Pimping for ObamaCare \\nThe national political media didn’t just cheerlead for ObamaCare, they LIED to us. Willfully and with malicious intent, they all lied to us. The outlawing of almost every existing insurance plan was right there in the bill, right there in black and white. But the media didn\\'t care. They wanted to give their Precious Obama a win and in order to do that, they jumped on board the \"You Can Keep Your Insurance\" propaganda express. Worse, those of us who did tell the truth were branded as liars and racists, not only by the pundits but by those godforsaken fact-checkers. \\nThen Utopia met reality. \\nThen the lies were exposed. \\nAnd the result is that up to and including last night, at both the local and national level, ObamaCare has decimated the Democrat Party. But nowhere near as bad as it has decimated the middle class. \\nThe media\\'s role in this is unforgivable and destroyed whatever remained of their moral authority. From here on, they could only get more sweaty, desperate, and dangerous. \\n2. Casting off Every Journalistic Ethic to Destroy Trump \\nOpenly, proudly, and belligerently, in order to hijack a presidential election, we were treated to the Pompous Announcement that Trump was such a threat to humanity, it was now time for journalists throughout the land to cast off every standard that makes journalism journalism, starting with objectivity. \\nEven former good guys like CNN\\'s Jake Tapper morphed into an unrecognizable LyingSnarkVirtueSignalingMachines -- another rotting cog in the Narrative Wheel, a mindless member of a self-deluded, government-worshiping cult that wouldn’t piss on Middle America if we were on fire. \\nProfessional sobriety was cast off because this one was in the bag, baby! And who could miss the historic opportunity to self-righteously point-and-laugh at the hideous rubes as they were finally and forever being buried alive under a Brave New World. \\n3. Grind Donald Trump To Dust \\nWhile there is no question Trump deserved a few of the kitchen sinks hurled his way, never in my 50 years have I seen such a coordinated, desperate, dishonest, and poisonous campaign to disqualify a human being through the dark art of stripping him and his supporters of all their humanity. \\n4. Embracing Confirmation Bias \\nThe longer the general election rolled on, the smaller the bubble of self-delusion became. \\nInconvenient polls were sneered at and Voxsplained away. \\nExit polls could only means ONE thing, even though it was pretty clear they might mean another. \\nMy personal favorite was the late editorials where, based on no counted votes whatsoever, we were trolled with the news that it was Hillary, not Trump, who would emerge victorious with the \"hidden vote!\" Oh, the delicious irony of that. Oh, how lovely it would be to rub that in the rubes\\' faces on Election Night. \\nBy the time the votes were actually being counted, I was about 60% sure Hillary would win. The New York Times, however, was 92% sure. ABCNBCCBSAPBSNPRCNNWashingtonPostPolitico were 100% sure. \\nBut even I understood that state and local polls were more erratic than ever, that Hillary did seem legitimately freaked about the upper Midwest, that the best pollster in the country had Trump up +2, that Trump never lost his fervent base, that the right track/wrong track numbers had been upside down for a decade, that there was still a larger-than-usual number of undecideds, that this thing that was Real might not be enough to win, but it was still Real. \\nNo, no, we were told, it\\'s all smoke and mirrors, all gold-leafed Trump Steaks. Look at Obama\\'s approval ratings! Look at the Hispanic vote! Look at this squirrel and that squirrel and the other squirrel over there. Sit down, son, don’t you understand that I\\'m a data machine? It\\'s science, rube. Don\\'t you Vox, racist? \\nAnd then the worst thing imaginable happened…. \\n5. The Media Lost the Election \\nThe hate, the lies, the removal of the mask of objectivity, the pushing of every single chip into the middle of the table -- that can actually work … IF YOU WIN. \\nBut the media didn’t win. \\nIn the most spectacular fashion, with their pants down and their bare ass hanging out for the world to see, they lost. \\nAnd with that loss went EVERYTHING. \\nAnd now the media is exposed in front of the whole world as a Swaggering Potemkin Bully that no longer has the power to sway public opinion, even when they throw absolutely everything they have at one man, and do so with much of the Republican Party on their side. \\nNot only has the media forever been exposed as brazenly dishonest and laughably out of touch, worse than all that, they are exposed as WEAK, a force no one need ever fear or kowtow to again. \\nWithout that sheen of fear, without that threat of intimidation, like a vanquished bully, so goes all their power. \\nF*** you, mainstream media. \\n-- \\nThe delicious irony of all this is that the last desperate gasp of the political media did actually prove their precious Barack Obama correct about one thing… \\nThe moral arc of history does indeed bend towards justice. \\n\\nFollow John Nolte on Twitter @NolteNC Tags '"}, "time": 1742628523.7056723}