{"duration": 0.12014627456665039, "input_args": {"text": "'MANILA  —   Virgilio Mabag figures there is a good chance that his meth addict brother will become a casualty of President Rodrigo Duterte’s deadly campaign against drugs in the Philippines. “I told him to prepare himself to die,” Mr. Mabag said. But Mr. Mabag, 54, who runs a neighborhood volunteer association in a sprawling Manila slum, still enthusiastically supports Mr. Duterte, saying that his policies will make the country safer and more orderly. “I’m delighted,” said Mr. Mabag, who was wearing a Duterte  . “This is the only time I’ve seen a president like this, who says exactly what he wants to say. ” The rest of the world may have trouble understanding this, but Mr. Duterte still commands ardent support in the Philippines. Since he took office in June promising to kill drug addicts and dealers, about 1, 400 people have been killed by the police in antidrug operations, and hundreds more by vigilantes. His embrace of violence has shocked other countries and brought condemnation from human rights groups. He has compared himself to Hitler (and later apologized) called President Obama a “son of a whore,” and joked after an Australian missionary was raped and killed that “she was so beautiful” he should have been first to rape her. He has lashed out at the pope, despite leading a nation that is overwhelmingly Roman Catholic, and cursed the United Nations and the European Union. No matter. For many Filipinos, Mr. Duterte’s passionate outbursts, however crude and impolitic, are signs of his fearlessness and willingness to act. The weak leadership of previous presidents, they say, led to high rates of violent crime, drug use, woefully inadequate infrastructure and widespread poverty. The first national polls since Mr. Duterte became president came out this week, showing that his outbursts and the mounting body count have barely dented his extraordinary popularity. One poll, conducted in late September, found that 83 percent of Filipinos had “much trust” in him, compared with 84 percent in June, after he was elected but before he took office. The other showed his trust rating falling slightly, to 86 percent in September from 91 percent in July. “His initiatives, and this includes the antidrug campaign, are well received by the people,” said Ramon C. Casiple, executive director of the Institute for Political and Electoral Reform. “They don’t have an impact on the overall perception of his administration or presidency. ” While Mr. Duterte’s antidrug campaign and outrageous statements have received all the attention abroad, he has pushed ahead with an array of progressive social policies that have won him broad support in the Philippines. Lorraine Badoy, a dermatologist and a volunteer at a nongovernmental organization who lives in one of Manila’s gated communities, acknowledges that the president’s outbursts make her cringe. “I just wish he’d shut up sometimes,” she said. But she says she is more enamored of his social policies than she is concerned about the casualties of the antidrug campaign. In Mr. Duterte, she said: “I see something that I have not seen in a long time in the Philippines, which is that he cares. He cares for the small guy, which is very important to me. ” His government has paved the way for indigenous people displaced by mining and logging to return to their ancestral lands, has committed to providing free irrigation to subsistence farmers, has suspended the operations of mining companies that violated environmental protection laws, and has begun a program of free checkups for the 20 million poorest Filipinos. His support has blossomed on social media  —   followers on the most popular   pages number in the millions  —   which his administration has cannily harnessed. Social media catapulted Mr. Duterte to the presidency, says his communications secretary, Martin Andanar, and it remains a bastion of support in the face of what Mr. Andanar considers negative coverage by international and local news media. “It is very important for our team to maintain, and even encourage  —   foster  —   the relationship of the different social media patriots of President Duterte,” he said. “We do it by reaching out to them, they reach out to us. ” Mr. Duterte’s social media team, which Mr. Andanar oversees, selects a weekly message, often tied to the news, and creates posts it hopes will be reposted and widely shared by supporters. He said he recently told followers on social media that “the crime news has been blown out of proportion, and nobody’s listening to our economic policies. ” So even as the value of the Philippine peso began to slip last week, Mr. Duterte’s supporters were arguing that a weakened currency increased the buying power of remittances sent back by Filipinos working overseas. When Mr. Duterte likened himself to Hitler, his supporters rushed to defend him on social media, arguing that the comment was precipitated by a remark by former President Benigno S. Aquino III, who compared Mr. Duterte to Hitler five months earlier. The argument aligned with ones made the same day by administration officials. “It is a matter of record that the reference to Hitler did not originate from the president,” his spokesman Ernesto Abella said in a statement. A   site went further, posting photographs of two Reuters journalists it accused of causing the furor by misrepresenting Mr. Duterte’s words, and calling for their punishment. The post was shared thousands of times on social media and whipped up an untold number of commenters, who created a flurry of threats and insults. Mocha Uson, a blogger with 4. 2 million followers on Facebook, shared the images, adding the caption in Tagalog, “Enemies of change. ” Critics of Mr. Duterte have been threatened with rape and a variety of deaths, including by hanging, drowning and, as one   doctor suggested to Emily Rauhala, who has written about the Philippines for The Washington Post, that she crawl back into her mother’s uterus and suffocate. Mr. Andanar said that the administration did not condone threats of violence on social media. So far, none has been carried out. However, he said, “I cannot blame the Duterte social media patriots when they protect the president and when they do everything that they can to pounce on the enemy. ” Many Duterte supporters say their cause is unfairly portrayed in the mainstream news media. But Melinda Quintos de Jesus, executive director of the Center for Media Freedom, said that threats by   online mobs had intimidated the national news media. The local news media has published some criticism and several reports on specific cases of extrajudicial killings, she said, but the major television stations and newspapers have failed to produce critical analyses of Mr. Duterte’s policies. “They like him, they fear him,” she said. “They basically are afraid to be singled out. ” In The Hague on Thursday, the prosecutor of the International Criminal Court, Fatou Bensouda, issued a blunt warning to the government, saying that the violent   crackdown could become a target of a criminal investigation because   killing fell within the jurisdiction of the court. There are signs, in some quarters at least, that the killings have begun to tarnish Mr. Duterte’s popularity. In a slum in Pasay, a district of greater Manila, on a recent Saturday, Migo Paladio, 24, stood in a narrow alley and watched the crowds from two wakes spill out. They were for men killed by vigilantes on the presumption that they were drug dealers. Mr. Paladio, a technician, said they were not dealers. He said they were among 10 people he knew who had been killed in the last three months in Mr. Duterte’s antidrug campaign. He voted for Mr. Duterte, but he said his support was wavering. “I was wrong about what I thought was going to happen,” he said. “He’s prioritizing the killings too much. And we have six more years of this. ”'"}, "time": 1742564163.4191346}