{"duration": 0.06131482124328613, "input_args": {"text": "'Proof God is on Duterte’s Side! \\nAzzmador October 29, 2016 God gave this man three missions: Kill drug dealers – stop cussing – gas kikes! \\nThese days it’s not very often a nation can say their leader has the approval of the Almighty God himself, but now, the Philippines can claim this distinction. \\nThe Washington Post : \\nPhilippine President Rodrigo Duterte has made a solemn promise: no more swearing. \\nDuterte, who famously cursed the pope and used a slang term that translates as â\\x80\\x9c son of a whore ” while denouncing President Obama, said he was flying back from Japan late Thursday, looking at a vast expanse of sky, listening to his colleagues snore, when he heard a voice say, â\\x80\\x9cIf you donâ\\x80\\x99t stop epithets, I will bring this plane down now.â\\x80\\x9d \\nI know many of you may be skeptical of his claim, but not me. I’ve heard people claim they spoke to God many times in my life, and until now, there was always some personal agenda involved. When I was a kid, I had relatives tell me God wanted me to have a crew cut. Then there were the more famous situations like Oral Roberts saying that if his flock didn’t send him ten million dollars by a specified date, God would kill him, personally. \\nThen you had guys like Ted Haggard. I’m pretty sure God told him it wasn’t a good idea to be snorting meth off the units of male prostitutes while he was the pastor of an evangelical megachurch and spiritual advisor to the likes of George W. Bush, but if so, God’s words went unheeded. \\nNot so with the infamous Flip shitlord. \\nâ\\x80\\x9cAnd I said, â\\x80\\x98Who is this?â\\x80\\x99 So, of course, â\\x80\\x98itâ\\x80\\x99s God,â\\x80\\x99â\\x80\\x9d he told Filipino journalists late Thursday. \\nâ\\x80\\x9cSo, I promise God,â\\x80\\x9d he continued, â\\x80\\x9cNot [to] express slang, cuss words and everything. So you guys hear me right always because [a] promise to God is a promise to the Filipino people.â\\x80\\x9d God’s servant on Earth, Rodrigo Duterte, contemplating the sound of one hand killing all the drug lords. \\nNow there’s a man with his priorities straight. He identifies the speaker, and makes his promise, publicly, to God and his people, that he will obey. Of course, all fascists believe in a natural hierarchy, so his obedience just makes sense. \\nAn important thing to note is, when God speaks, what he doesn’t say is just as important as what he said. He told Duterte, “stop cussing.” Nothing more. \\nThank goodness he did not say “stop killing criminals.” I was pretty sure he wouldn’t, but you never know. What a relief… \\nOf course, not everyone is theologically adept, i.e. the author of the WaPo article. She took to Twitter to make some heretical and thoroughly unfair remarks. Err, to quote @astroehlein , \"Did God mention the death squads?\" https://t.co/QezjfCweEH \\n— Emily Rauhala (@emilyrauhala) October 28, 2016 \\nNo Emily, God did not mention the death squads, and any true believer knows this means he approves of them. \\nWhere in the Holy Bible does it say you’re supposed to allow savage drug kingpins to wage war in your streets, killing innocents by the thousands, just so they can decide who gets to sell poison to your people and in what location? I’ve never read that part. \\nI cannot confirm whether or not Emily Rauhala is a Jew, but she’s WaPo’s “China Correspondent,” and her Twitter timeline reads like someone with a personal vendetta against the fantastic leader of The Philippines. \\nWhatever her problem is, she’d better get a handle on it, because in ten days we’re electing a Great Christian here as well!'"}, "time": 1742564265.5042865}