{"duration": 0.17917346954345703, "input_args": {"text": "'It’s Moosewood’s world. We’re just eating in it. Consider granola: The word used to be a derogatory term. Now it’s a supermarket category worth nearly $2 billion a year. Kombucha was something your art teacher might have made in her basement. The company GT’s Kombucha brews more than a million bottles annually and sells many of them at Walmart and Safeway. And almond milk? You can add it to your drink at 15, 000 Starbucks locations for 60 cents. Just as yoga and meditation have gone mainstream (and let’s not get started on designer Birkenstocks) so have ideas and products surrounding health, wellness and eating that play like a flashback to the early 1970s.   staples of that time  —   the miso, tahini, dates, seeds, turmeric and ginger that were absorbed from other cultures and populated the Moosewood restaurant cookbooks  —   now make appearances at some of the most innovative restaurants in the country, where menus are built around vegetables and heritage grains. Vegetarianism and veganism are on the rise and kale, the bacon of the   moment, is now routinely heaped on salad plates across the land. The hippies may not have won the election, but they are winning the plate. (Or rather, the bowl.) “The counterculture is always ahead of what’s happening in mainstream culture,” said Peter Meehan, the editorial director of Lucky Peach magazine. “It’s as true in any creative field as it is in food. ” Deborah Madison, the author and chef who made vegetarian cooking sophisticated with her 1987 cookbook, “Greens,” has seen this food before: She cooked it in the 1960s and ’70s, as one of “a growing number of people who were trying to cook differently from our parents,” she said. “Our intentions were good,” Ms. Madison continued. “We were using wholesome foods in contrast to our mothers’ new reliance on cake mixes, white flour, TV dinners and that sort of thing. ” The problem, she said, was that her generation didn’t know much about cooking. “What we cooked was very much on the stodgy side,” she said. “Today the same foods are now seen as interesting and delicious and worth eating. We can appreciate their flavors, textures and general possibilities because we  —   that is, the big collective we  —   know so much more about cooking foods of all kinds. ” The current food mood may also be a reaction to the more exhausting aspects of life in the digital era. “It’s a weird mixture of technology and palo santo”  —   iPhones and incense  —   said the chef Gerardo Gonzalez, suggesting that people who live online may be moved to seek out the restorative properties of natural foods. “You’re constantly in this thing that’s not reality, and eating food can be the most real act you can partake in. ” At Lalito, his restaurant in Manhattan, Mr. Gonzalez serves food he describes as “hippie Chicano,” like vegan chicharrones and the brown goddess cucumber salad, with brown mole vinaigrette, mint and candied pepitas, as well as dishes like eggplant topped with tahini, lemon juice and Japanese gomasio seasoning. (The restaurant opened in late 2016 as Lalo it was recently renamed to avoid conflict with a similarly named restaurant.) Growing up with chain restaurants and living with the “mental fog” that comes from regularly eating meat, dairy and starch, said Mr. Gonzalez, 34, has led him and his peers to seek an alternative. “I think people are now more likely to turn to açai bowls than a bacon cheeseburger for their hangover,” he said. “For a lot of people who gravitate toward this lifestyle, it’s not hypocritical. ” As one of the owners of Dimes, a restaurant that opened three years ago in Manhattan, Alissa Wagner is partly responsible for bringing those açai bowls to the Instagram set. Ms. Wagner believes that diners are a lot more knowledgeable about where and how to eat better than they were when she graduated from the Natural Gourmet Institute, a mostly vegetarian cooking school in Manhattan, in 2010. “There was a huge awakening that happened in the last couple of years with the way that New Yorkers approach food,” she said. “The      restaurants that were   became outdated and were overtaken by a much more vibrant and   menu. ” Some of the most anticipated restaurant openings of the past year have had a crunchy vibe. Tartine Manufactory in San Francisco is never without a line for its rustic sourdough bread,   pastries and turmeric kefir. At Destroyer in Culver City, Calif. the chef Jordan Kahn incorporates elements like puffed rice and pickled mushrooms into his precise and visually arresting cooking. For his avocado toast  —   a dish that is the spiritual descendant of the ’70s avocado sandwich, smashed on health bread and topped with a handful of alfalfa sprouts  —   the avocado is confited. Brunch at the “ ” Bad Hunter in Chicago includes   sticky buns and sourdough porridge with walnut butter. In New York,   Vongerichten recently opened abcV, an organic,   restaurant that serves dishes like “stems and sprouts” with sunflower seeds, and traffics in ayurvedic tonics, which have captivated millennials hunting for the next thing after juice. At L’estudio, the   pottery is fired in the cafe’s adjoining ceramics studio. And while the landmark vegan restaurant Angelica Kitchen in Manhattan is closing this week, its legacy is vast  —   veggie burgers and grain bowls, once a menu rarity, can be had at chains like Hillstone and Sweetgreen. (The chef Camille Becerra, who just opened De Maria, which is heavy on bowls, cooked at Angelica Kitchen  —   a formative experience.) Even the elegant French restaurant Le Coucou serves avocado toast at breakfast and brunch, charging $18 for the winkingly named “Le Californien. ” Despite the often extragavant price tag attached to many   staples and the Vitamix required to prepare them, this is food that is easy to make at home, with plenty of cookbooks for guidance. The last several months have seen the release of many   and   cookbooks, including ones from Lucky Peach Martha Stewart Wolfgang Puck the vegan website Thug Kitchen Sarah Britton, of the website My New Roots, whose Instagram feed of bowls and sprouts has over 330, 000 followers and Amanda Chantal Bacon of Moon Juice, a small chain of juice shops that started in Venice, in Los Angeles. In her book and at her shops, Ms. Bacon, a former line cook at Lucques in Los Angeles  —   and the subject of a Twitter storm last summer, after a crystal was stolen from her Silver Lake location  —   spreads the gospel of coconut yogurt, reishi mushroom powder and meditation, while selling $10 Moon Dusted Milks made with brown rice protein, chia seeds and blue spirulina. Her plans for Moon Dust expansion are global. Last week, Ms. Madison released “In My Kitchen: A Collection of New Vegetarian Recipes. ” Her elegant   has given rise to a generation of chefs, cookbook authors and bloggers focused on vegetables and whole foods, like Anna Jones, who wrote the vegetarian cookbook “A Modern Way to Cook. ” (Ms. Madison, like a baby boomer who is both tickled and horrified to see   come back in style, said she always found it “amusing that foods like the   brown rice have come around to being seen as good to eat, and preferable even to white rice. ”) For amateur picklers and   there is a new edition of “Wild Fermentation,” the 2003 manual that helped its author, Sandor Katz, become a heroic figure among cooks who ferment their own foods. Like the    landers and Whole Earth Catalog readers before them, a new generation is once again becoming interested in fermentation, especially    projects, a shift that Mr. Katz attributes to people becoming more critical of the industrial food system and seeking alternatives. “Once you start asking questions about how this food was produced, then fermentation is just part of the answer,” he said. He also cited recent scientific findings on the microbiome and the notion that health may be affected by bacteria and other microbes living in your intestinal tract, which are in turn influenced by what you eat. “People are recognizing that this important biodiversity inside of us has been diminished and are seeking strategies to restore it for immune function, digestion, mental health and everything else,” he said. “So people are seeking out   foods. ” In fact, a   and   business just opened near Mr. Katz’s home in Cannon County, Tenn. population 16, 000. “It’s not just happening in New York, San Francisco and Portland,” he said. (For the record, Mr. Katz bristles at the association of fermentation with hippiedom. “In terms of countercultural movements, I feel like punk is much more resonant,” he said. “The punk movement was all about D. I. Y. and publishing your own zine, and figuring out how to make things yourself and improvise. ”) Mr. Gonzalez has noticed a change in diners’ palates toward flavors that are brighter and more acidic, like those produced by fermentation, as well as earthier and   flavors, like nutritional yeast. “People are starting to realize that these ingredients are a whole new color palette,” he said. This group of Americans has also developed a   tooth and an appreciation of the textures imparted by grains like buckwheat and rye. “I was in a meeting last night where one person suggested making a chocolate cake recipe with fermented cabbage in it,” Ms. Madison said. As with anything counterculture edging toward the mainstream, the threat of   looms. Alice Waters, the Berkeley queen of local and seasonal cooking, applauds the movement away from fast and processed food, but said she was wary of how its language had been appropriated by mainstream brands. “There’s a lot of hijacking going on right now that is very disturbing,” Ms. Waters said. “I mean, they can’t quite take ‘organic,’ but they’re taking everything else. ” At the restaurant level, though, hippie fare has long been “a lifestyle and a brand,” Mr. Gonzalez conceded. “You’re not just selling food,” he said. “You’re giving the promise of a healthier life, or a more enlightened meal. ” Recipe:   Sweet Potatoes With   Sauce Follow NYT Food on Facebook, Instagram, Twitter and Pinterest. Get regular updates from NYT Cooking, with recipe suggestions, cooking tips and shopping advice.'"}, "time": 1742563663.276187}