{"duration": 0.06998801231384277, "input_args": {"text": "'Poll after poll shows Hillary Clinton leading. \\nClinton up by four points. \\nHillary up by six points. \\nClinton leads by 6 points , is the latest headline from The Washington Post . \\nBut these polls – most of them – have huge problems: They’re oversampling Democrats. \\nThis happened a couple of days ago in Arizona , a state that has more Republicans than Democrats, but whose poll had many, many more Democrats polled. \\nThe story for the poll starts out pretending that everything is perfectly legitimate: \\nWith 12 days to go, Hillary Clinton holds a six-point edge over Donald Trump among an electorate fixated on the campaign and nervous about their candidate losing, according to a new Washington Post-ABC News Tracking Poll. \\nThen it shows a graphic showing just how far ahead Hillary is. See? Hillary’s line is in orange and Trump’s is in gray. She must be winning. \\nBut there’s a problem with the poll – like with so many other polls that have come out recently … they’re conveniently asking many more Democrats than Republicans. \\nHere’s a link to their methodology (they have to publish this if they’re going to pretend they’re legitimate). \\nIf you look at page 7, you’ll see exactly who they’re polling. \\nOf the 1,135 people they polled, 36 percent identify as Democrats and just 29 percent as Republicans. \\nThis is bad enough, but they also have 29 percent self-declared “independents” answering the poll. How do independents vote? Gee? Who knows? The pollsters do… \\nNow, they have to justify the fact that there are so many more Democrats than Republicans at the polls (and of course, there are simply not 29 percent of “independents” going to the polls. They’re going to choose a Republican or a Democrat, except for the tiny percent who will choose a third-party candidate. \\nSo here’s the paragraph justifying their methodology: \\nThis survey uses statistical weighting procedures to account for deviations in the survey sample from known population characteristics, which helps correct for differential survey participation and random variation in samples. The overall adult sample is weighted to correct for differential probabilities of selection among individuals who are landline-only, cell phone-only or dual users. Results are also weighted match the demographic makeup of the population by sex, region, age, education and race/ethnicity according to the latest Current Population Survey March Social and Economic Supplement by age, race/ethnicity, sex and education. Party ID was weighted to the average of the most recent Post-ABC surveys. \\nDid you understand that? That’s okay, because they do. And they want you to trust them. \\nThe only poll that counts is the one that you are going to participate in on Nov. 8, and they don’t get to “over sample” or “account for deviations.” They count the votes. \\nSo make sure your vote is counted.'"}, "time": 1742561854.262953}