{"duration": 0.025583982467651367, "input_args": {"text": "'The founder of the Jimmy John’s restaurant chain denied that he is the person that posed naked humping a shark in a photo circulating social media Tuesday. [Jimmy John Liautaud is the latest   figure to deny being the subject of the shocking photo, which started making the rounds on social media Friday, the Daily Mail reported.  Deadspin reported that Florida Gators football coach Jim McElwain also denied that he was the subject of the photo on Monday. The photo has gained a lot of traction on social media, with many users wondering who is the man in the photo. “Who is this man? Please RT, find him  ask him why he did this? Where is the humour in humiliating slaughtered animals?” British wildlife TV presenter Anneka Svenska asked on Twitter Friday. Who is this man? Please RT, find him  ask him why he did this? Where is the humour in humiliating slaughtered animals? @ChrisGPackham pic. twitter.   —   Anneka Svenska (@AnnekaSvenska) May 5, 2017,  At first, internet users suspected McElwain as the man in the photo because his toothy smile looked a lot like the man in the photo. “I don’t know who it is, but it isn’t me,” McElwain said at a press conference Tuesday with his wife by his side. Then, internet users turned their attention to Liautaud, the Jimmy John’s founder, because he has a toothy grin and a penchant for hunting game. According to a 2015 Chicago Tribune article, Liautaud talked about his love of hunting animals from rhinoceroses to elephants and posing with them in photos. “I choose to hunt and I choose to fish,” he said. “Everything I’ve done has been totally legal. And the meat has been eaten, if not by me than by someone I’m with. I don’t hunt big African game anymore. ” A spokesperson for Jimmy John’s however, denied these accusations, saying the man is not Liautaud and is not affiliated with Jimmy John’s. As curiosity about the photo continues to circulate social media, the mystery about the mysterious man’s identity is growing.'"}, "time": 1742563035.7736013}