{"duration": 0.17258143424987793, "input_args": {"text": "'Home This Month Popular Why It’s Absolutely Worth It To Learn Game Why It’s Absolutely Worth It To Learn Game \\nJon enjoys helping others evolve into their best selves on his blog: Masculine Development and recently launched his eBook on 7 Strategies to Develop Your Masculinity. November 12, 2016 Game \\nAfter my previous article , which advocated that men learn game as a form of self-development, I got a good amount of disagreement—most of it was not inaccurate. The majority of ROK readers are becoming less and less interested in learning game, simply because Western women are not as attractive as they once were. \\nThis isn’t to say that we’ve abandoned learning game as a whole; certainly we still want to get laid and eventually find a girl for a relationship. But, nonetheless, there seems to be a large portion of the manosphere which simply doesn’t believe that game is worth it anymore. \\nIn this article, I would like to present a very realistic and objective perspective in regards to learning game. In retrospect, my last article may have been too focused on the positive aspects; I do not wear the rose colored glasses in regards to the game. In fact, it’s quite the opposite. \\nAs a veteran myself, I’m quite aware of the troubles that men can encounter when learning game. I’ve been slapped for making mildly offensive jokes, I’ve had drinks thrown on me, I’ve had guys threaten to slit my throat, and more. Despite this, however, I still believe that it is 100% worth it to learn game. Beginner’s Hell “HOW DARE YOU TRY TO ASK ME MY NAME YOU FUCKING RAPIST!” \\nI believe that the reason why most men don’t feel that game is worth it, is because they experience difficulty getting over a period known as “beginner’s hell.” This is when you’re just starting to shrug off your feminist conditioning , and you haven’t developed the confidence or game that you need to succeed. \\nMost beginners walk around, not really knowing how to talk to women , how to carry themselves, or how to flirt in general. Because of this, women will typically have one of two responses: They pity you and ignore you They lash out and berate you for being a “creep,” or “weird.” \\nOf course, you may get the occasional girl who’s drunk enough to be into you, but these are few and far between. For the most part, the “Beginner’s Hell,” phase of learning game is absolutely horrendous. \\nYou will be sometimes be targeted by club douchebags, who will either confront you or use their superior social intelligence to embarrass you, and on the rare occasion that you do manage to get a girl talking to you, he’ll come over and steal her. You will have women smack you, ignore you, and tell you off—again, it’s called “beginner’s hell,” for a reason. 6’s Who Think They’re 10’s \\nThis initial difficulty in learning game is only compounded by our culture’s general lack of femininity. It is extremely obvious, to anyone with eyes to see, that women in our culture are encouraged to be less and less feminine as time goes on. The once praised virtues of nurturing, empathy, and kindness, have now been replaced by resting bitch face, sociopathy, and social climbing. \\nThis coupled with the fact that women experience an endless supply of beta orbiters, means that they’ve been conditioned to believe they’re highly sought after goddesses, who can use men like tissues without any sort of social repercussions (and in fact, they’re sometimes praised for doing so). \\nThis is, perhaps, one of the biggest obstacles to newbies struggling to learn game. Couple this with severe approach anxiety, a complete lack of masculinity, and a weak body that hasn’t been trained, and it’s very easy to see why most men don’t see that game is worth it. The Turning Point \\nOnce one gets beyond this initial bump, however, most of game is smooth sailing. Once the newbie has learned how to fix his lack of masculinity, how to balance assertiveness with consent , and has improved his game in general, he enters what I call the turning point. \\nThe turning point is essentially that point at which learning game is no longer a struggle, but it’s actually enjoyable. This is due to several key lifestyle and mindset shifts which take place as the newbie gets more and more success, such as: Drawing state from within, rather than from without Being in a state of abundance, rather than scarcity Improving other areas of your life, which creates an upwards spiral \\nIf you’re a newbie struggling to learn game, and you don’t feel like it’s worth it, I fully empathize with your pain—the problem is that when you don’t have much game, of course learning game will be hard, because you get stuck with the bitchy fat girls. \\nWhen you start to develop the three characteristics that I mentioned, however, a cascade of effects starts to take place that catapults your game to the next level. This allows you to pick and choose which hot girls you want, rather than being at the mercy of the ugly 5 who “might” want to come over and hang out. Internal vs. External Drawing Of State “By my age, you realize that bitches ain’t shit, but hoes and tricks.” \\nThe transition from drawing state from outside of you, to drawing state from within you, is literally the difference between a guy that doesn’t pull at all, and a guy that can pull Victoria’s Secret models. \\nLet me explain: women typically draw state from without. This means that their emotions are governed by their environment. This is why they respond so much more to social pressure than men, why they “just want to dance,” when a song they like comes on, and it’s why they’re generally so emotionally volatile. \\nDue to their changing environments, their emotions change rapidly as well. This is why they want men to draw state from within, or in other words, not be affected by their outside environments. This is why women are repulsed by men who care too much about their opinions: it’s indicative of a man who draws state from without. \\nAs a man, drawing state from within has numerous benefits, the most obvious of which being that you’re perpetually in a good mood. Once you learn to make this shift, and learn to be happy regardless of your external circumstances, women will pick up on it like a hawk—they’re very attuned to this type of thing, and you’ll definitely notice a difference in their behavior. \\nThis will get them vying for YOUR attention, which will start to give you tremendous power. This will make game fun, which will lead to even more women in your life, which will begin the start of your upward spiral. The Beginning Of The Upward Spiral \\nOnce you begin to make this simple mindset shift, game will no longer feel like it’s not worth it. You see, game feels like it’s not worth it when you have to put in a huge amount of effort for a below average looking girl, with a horrible personality. But, when you start to get to the point where you can put in a medium amount of effort, for a very gorgeous woman? That’s when game starts to be fun. \\nThis basic mindset shift of learning to not care what your environment is like, and to simply be happy by yourself, will create a chain reaction within your life. First, you’ll start to get much more women much more easily. This will allow you to start a harem, which will keep you in a perpetual state of abundance until you find a girl you want for a relationship. \\nThis state of abundance will amplify your game by about five fold. Women will sense that you’ve got a ton of other women vying for your attention, and they will do the same—it’s like a magnet that just draws them in. Plus, if a girl does or says something that you dislike, you can simply kick her out of your life since you have so many other women. \\nThen, when you start to have so many women in your life, you’ll start to friend zone hot girls for the social benefits , because you simply can’t handle sleeping with all of them. They’ll invite you to parties, and try to hook you up with their friends, and you’ll receive many of the social benefits that they do. Game Is Worth It (It Just Sucks At First) Getting over beginner’s hell is a lot like this. Once you get to the other side, it’s all downhill, though. \\nAs I have made clear, learning game at first is a huge struggle—you will encounter massive cock blocks, a lot of negativity from women, and not to mention you’ll have to deal with all of the white knights, too. But, if you can learn to get over this initial Beginner’s Hell, as I’ve coined it, you will see the other side of reality that most men are shielded from. \\nI realize that it can be very difficult to learn game at first, and can feel like it isn’t worth it, but if you make a decision to put in the effort and learn it, your world will literally be 1000x better than before. If you’re struggling with learning game initially, be sure to maximize your appearance. \\nGet some height increasing soles, read through some of the style articles on ROK, get a good designer haircut, and learn to perfect your appearance, at least as much as you can. Consider taking some martial arts classes to boost your confidence, as well. \\nUltimately, however, if you want to learn game and experience what it’s like to have dozens of hot girls hitting you up, you just have to bite the bullet and go out. Go clubbing, go to bars, go on trips to Las Vegas or Miami. Approach women during the day and approach them during the night—eventually you’ll get over this “Beginner’s Hell,” and will experience an abundance of women in your life.'"}, "time": 1742562278.580148}