{"duration": 0.1566143035888672, "input_args": {"text": "'WASHINGTON  —   Lawmakers say Washington is dithering while a dangerous epidemic threatens American shores. They suggest darkly that the government is playing down the risk to avoid panic. They warn: Don’t wait for it to arrive at the airports and establish a perilous foothold. Fear of the Zika virus today? No, those were Republicans in 2014 as they hammered the Obama administration in the final weeks of the midterm campaign for failing to react quickly and decisively enough to the possible spread of the Ebola virus, which never really became a domestic threat. The politically heated attacks cooled quickly after the election, but the message was credited with helping Republicans sow unease about the administration as they chalked up big wins in Congress. Now it is the   Congress moving slowly on providing money to combat the spread of Zika, alarming some lawmakers who fear that their colleagues do not recognize the potential consequences if the   disease begins to spread in the United States. “There is just a lack of urgency about it,” said Senator Marco Rubio, Republican of Florida, who added that lawmakers could find themselves facing difficult questions about a   congressional Zika response as Election Day looms this fall. “People are going to be asking, ‘Why didn’t you do anything? ’” he said in an interview. “You are going to have to have a pretty good answer, and I am not sure there is going to be one. ” Mr. Rubio has a special interest in the disease, given that the climate and conditions in his state are well known for breeding mosquitoes. He worries that even the smallest of outbreaks could send his state’s economy into a spiral as visitors stay away. “I tell people we are one   infection away from serious damage to our tourism industry,” he said. He has not been alone in clamoring for a federal fix. In February, President Obama asked Congress for more than $1. 8 billion in emergency funds to step up prevention efforts and speed a vaccine for the disease, which has been linked to serious birth defects and other health problems. Last week  —   almost four months later  —   the Senate voted to begin negotiations to try to resolve differences among the House, Senate and White House approaches. Democrats are demanding a resolution by the Fourth of July recess, but there is no guarantee that the funding legislation can be completed by then. “I just think they’re long overdue,” Representative Nancy Pelosi of California, the House Democratic leader, said last week. “An emergency bill could have passed  —   we’re over 100 days since the request. ” She noted that the public health community “could have been well down the road to what needs to be done in terms of prevention, in terms of research and the other aspects of stopping the epidemic. ” The issue is particularly grating at the White House, which came under siege in October 2014 over what Republicans called a lack of preparedness for Ebola. The administration believes it was unfairly maligned for political purposes by Republicans who saw an opening to make voters anxious close to the election. Mr. Obama said recently that he was having difficulty squaring Republicans’ position on Ebola with their much more casual approach to Zika, “given that I have, at least, pretty vivid memories of how concerned people were about Ebola. ” Republicans say there is no need for a furious rush since the administration agreed in April to redirect nearly $590 million, most of it previously allocated for Ebola prevention, to the effort against Zika, easing the pressure to act quickly. Some Democrats now think that move, perhaps wise from a policy and prevention standpoint, may have been a strategic mistake because it let Republicans off the hook. “I think we are fine,” said Senator Jeff Flake, Republican of Arizona, predicting that Republicans had done what they needed to avoid a political backlash. He said that shifting the money had provided public health experts with the resources they needed and that the necessary funds “will be there in the end. ” Negotiators working on a compromise are expected to move toward the $1. 1 billion approved by the Senate as opposed to $622 million allocated by the House. Mr. Rubio and others favor providing the full amount sought initially by the White House. As of last week, the Centers for Disease Control and Prevention had identified nearly 700 Zika infections in the continental United States, though all appeared to have been contracted elsewhere. More than 1, 000 have been counted in Puerto Rico. Public health experts are now preparing for the first case of someone’s being infected by a mosquito in the United States. Mr. Rubio worries that the federal response has fallen too far behind. “I think in some ways we are already too late,” he said. “It takes time to get this implemented. Every day that goes by is wasted. ” As they try to hold on to control of the House and Senate, Republicans should hope that Mr. Rubio is wrong and that the disease does not become a crisis in the United States. If it does, it could be Democratic attacks on Republicans for moving too slowly that go viral.'"}, "time": 1742564567.0786588}