{"duration": 0.03141593933105469, "input_args": {"text": "'The Guardian is Going Friggin Nuts Over Calais \\nAndrew Anglin Daily Stormer October 27, 2016 Where is this innocent little boy supposed to go if he can’t live in a squatter camp and throw rocks through car windshields, The Guardian asks. \\nOkay, so earlier today I already posted a front page story from The Guardian featuring an imagine of a “16-year-old child” who was obviously a man in his forties who was forced out of his home in the Jungle camp in Calais. \\nBut I’ve gotta post more. \\nThey are going absolutely nuts over this. \\nThe rest of the media is too, of course, but The Guardian epitomizes liberal hysteria, so we’ll focus on them. \\nAll of these headlines are from the last 24 hours – the period since the camp was officially closed. I won’t even bother to link them, because who cares. You already know what they’re saying. \\nThree of them are written by the same woman, Lisa O’Carroll. \\nOne has to wonder if she wasn’t one of the women who were using the Calais camp as a sex tourism destination . \\nYou can ask her about it on Twitter. \\n@lisaocarroll \\nThis situation is insane though, holmes. \\nThese people invaded Europe, mostly from Africa. None of them are legitimate “refugees,” or they would claim that status. They are allowed to stay in France indefinitely, where they are clothed and fed, but they want to go to Britain because the welfare system is so good. They set up an illegal squatter base next to the freeway, and used it to break into trucks bound for the UK and to launch random violent attacks on cars – very often just throwing rocks for no reason. \\nThis week, 7 years after it was founded in 2009, they finally closed it and forced out the inhabitants, because basically it had become impossible to safely pass from France to England in a car. And the entire media is saying that the act of closing the camp is nothing short of pure and unadulterated evil. \\nThe way they’re selling it? \\nBy showing pictures of men between the ages of 25 and 45, saying they’re teenagers and calling them “children.” \\nIt’s like something out of an absurdist comedy. But most everything is these days. \\nAnyhow, these women, cucks and kikes are eventually going to get their way. Migrants are already moving back in, as the fires have died down from where they set their own squat on fire when they were asked to leave. \\nMigrants have started moving back into the “Jungle”, hours after French authorities announced they had finished clearing out the Calais camp. \\nThousands of migrants were evacuated as multiple large blazes raged across the sprawling camp in northern France. \\nBy midday, regional prefect Fabienne Buccio had said operations to clear the camp, which began on Monday, had been completed days earlier than planned. \\n“There are no more migrants in the camp,” she told the Associated Press news agency. \\nI said this would happen. Everyone knew it would happen. White Europeans have no will to do what needs to be done, so these animals are simply allowed to do whatever they want. \\nWhat needs to be done is of course race war. \\nThese people need to be rounded up and deported back to Africa, and if they refuse and start fires, they need to be shot. \\nThis situation isn’t complicated or nuanced in any way. \\nBut that won’t happen. \\nBecause Europe is ruled by the coalition of evil: empowered women, cucks and kikes.'"}, "time": 1742628533.2326884}