{"duration": 0.028395891189575195, "input_args": {"text": "'Politico Senior White House Reporter Darren Samuelsohn kicked off Memorial Day 2017 by hawking a hot investigative scoop: Lara Trump, wife to President Donald Trump’s son Eric, supports a beagle adoption advocacy group where one top executive once served time in prison for encouraging activists to torment animal researchers. [Lara Trump’s animal rights partner did 6 y in fed prison 4 harassing  stalking researchers. https:  .  pic. twitter.   —   Darren Samuelsohn (@dsamuelsohn) May 29, 2017,   “Eric Trump’s wife has publicly aligned with a controversial animal rights group,” Samuelsohn writes, “the Beagle Freedom Project, whose leadership includes a felon who served a   sentence in federal prison for harassing and stalking researchers. ” The connection, he asserts, “brings political risk. ” Said felon, Kevin Chase (née Kjonaas) was sentenced in 2006 and released from prison in 2011. And while there is no defending the acts which led to Chase’s conviction, Samuelsohn employs little more than innuendo to link them to BFP. “Lara Trump’s support for the Beagle Freedom Project has alarmed researchers and leaders from the pharmaceutical industry,” Samuelsohn writes, “as well as other animal rights organizations who say studies involving dogs and cats are well regulated by the federal government. ” BFP advocates for state laws forcing animal testing facilities to put research animals up for adoption instead of euthanizing them and performing more tissue tests  —   as well as encouraging individuals to rescue said animals. The group has partnered with celebrities such as Maria Menounos, Whitney Cummings, Corey Feldman, Amy Smart, Sia Furler, and Miley Cyrus in the past. Samuelsohn acknowledges that the only controversial element of BFP is Chase’s criminal history. “The Beagle Freedom Project’s stated goals are more mainstream” than his past groups, the Animal Liberation Front and Stop Huntingdon Animal Cruelty, he writes. He also notes that the org received a $500, 000 contest reward from Microsoft  —   even after critics brought up Chase’s past. Samuelsohn did not answer an email asking if it was his idea or an editor’s assignment to veer from his White House beat to cover the loose association between a   activist and a New     to the President.'"}, "time": 1742628553.152827}