{"duration": 0.04341936111450195, "input_args": {"text": "'It is as iconic an image from the criminal underworld as the Tommy gun or the getaway car, a grim last act for the unfortunate soul whose life is about to end in a new pair of footwear. Cement shoes. One would be   to think of a worse way to die than being fitted, as the saying goes, for cement shoes  —   fate hardening with every passing minute until the time comes to be dumped, feet first, into a watery grave, never to be seen again. Never again  —   that is the whole point, and it is exactly why cement shoes are the unicorn of true crime. Everyone can describe them, but who has seen them? Before Monday, precious few. Which makes the  discovery that morning in Brooklyn of a   corpse all the more remarkable. The body of Peter Martinez, 28, better known on the streets as Petey Crack, had washed up near Manhattan Beach in Brooklyn. At one end, his head was wrapped in duct tape. At the other, where his feet should be, was a   bucket filled with   concrete  —   a mix of cement, sand, gravel and water  —   encasing his legs up to the shins. The police said Mr. Martinez had a long history of arrests. He had been reported missing in February by his girlfriend. It seems that strong currents dragged Mr. Martinez, despite the homemade anchor, to shore, where he was discovered by a college student. There were no arrests in the case as of Wednesday, and the results of an autopsy were not yet complete. How long his body had been in the water was just one of the mysteries the police were sorting through Mr. Martinez’s last outfit  —   gray sweatpants, blue boxer shorts and a black jacket  —   was intact, and his tattoo of the Virgin Mary holding a rose was still visible. Crime historians were mystified, struggling to think of similar cases. “No,” said Thomas Reppetto, an author of books about organized crime. “Not right offhand. ” Mike Dash, a crime writer in London who has written about Mafia killings, said: “I’ve definitely never heard of this happening before. It’s just one of those stories that goes around. I think you’ve got a first there, by the sounds of things. ” There are countless accounts of those shoes over the years. They are there in the opening pages of E. L. Doctorow’s 1989 novel, “Billy Bathgate,” in which a character, barefoot, “delicately, gingerly, placed one foot at a time in the laundry tub in front of him that was filled with wet cement. ” The scene resembles a killing rumored to have happened in the 1930s, but the real body was never found. Countless similar examples exist  —   cement shoes believed to be worn by men never seen again, and therefore, by definition, themselves never seen. And yet the shoes fit snugly on the imagination. At the 1987 trial of John Gotti, a prospective juror was dismissed after relating what a boyfriend had once told her: “If you do anything wrong, I’ll get the Mafia after you. You’ll be wearing cement shoes. ” Making a pair of cement shoes sounds easy enough. A bag of concrete mix, some water and a large bucket would seem to be all one needs for the job. But there is one more important ingredient: time. An amount of uninterrupted time not commonly associated with murderers looking to cover their tracks. How long would cement shoes take to harden? Paul Bartelotti, owner of MB Concrete in Brooklyn, tried to imagine the process. “They could have gotten just a bag and added water,” he said. Not too much  —   the consistency has to be just right. “Like Carvel ice cream. Not, like,  . A little thicker. ” For several hours, the captive could still pull his feet out. “It would take at least, I would say, the better part of the day to not get your feet out,” Mr. Bartelotti said. “Depends on the temperature. ” Concrete hardens quickly in warm temperatures, he said. Mr. Martinez disappeared in February. “It was cold,” Mr. Bartelotti mused. “If you let it sit from 12 hours to a day, the guy wouldn’t be able to get his feet out. ” He considered the situations. “They could make it wet and make the guy stand in it, or put his legs in and pour the cement around it. He could have been dead and they just stuck his feet in. ” Mr. Martinez had survived brushes with death before. He was shot in the leg in 2008. The scar was there on the body that was found on Monday, high enough on the leg to be above the concrete. The circumstances surrounding the shooting are as murky as everything else. The discovery of his remains, the actual sighting of a thing of legend, may be the moment for which Mr. Martinez will be forever known.'"}, "time": 1742628574.8472211}