{"duration": 0.03936576843261719, "input_args": {"text": "'A   official in the Los Angeles County Sheriff’s Department resigned on Sunday after it was revealed that he had shared a series of racist and sexist jokes from his work email account in a previous job with the Burbank Police Department. Sheriff Jim McDonnell of Los Angeles County said in a statement that the official, Tom Angel, his chief of staff, had resigned on Sunday. His resignation came days after The Los Angeles Times first reported on the emails, which the newspaper said were obtained under the state’s open records act. “This incident is one that I find deeply troubling,” Chief McDonnell said. “Despite the Sheriff’s Department’s many recent efforts to fortify public trust and enhance internal and external accountability and transparency, this incident reminds us that we and other law enforcement agencies still have work to do. ” Last Wednesday, The Times published 15 pages of email correspondence that contained jokes about Muslims, Catholics, Latinos,   and women. In one email, Mr. Angel asked a colleague, “How many virgins do Muslims get in heaven?” In another, he forwarded a joke about a student who had done poorly on a biology exam. “I was asked to name two things commonly found in cells. Apparently ‘blacks’ and ‘Mexicans’ were not the correct answers. ” The emails sent by Mr. Angel also criticized “political correctness” and supported the racial profiling of Muslims. They were sent between 2012 and 2013, when he was the No. 2 police official in Burbank, Calif. Chief McDonnell said on Sunday that the department would review its training curriculum and hold meetings with community groups to brainstorm ways to improve its “understanding” and “appreciation” of the racial, ethnic and religious diversity of the area it serves. He also said the department would begin conducting random checks of its employees’ email accounts. “We are only as effective as the relationships, credibility and trust we have with our community,” he said.'"}, "time": 1742564283.529544}