{"duration": 0.11783075332641602, "input_args": {"text": "'Natural Blaze \\nAs the floodwaters receded from Nichols, South Carolina and the surrounding areas, many residents made the emotional journey home to assess what little they had left, a good portion of those people discovering that they had absolutely nothing. Having spent the last several weeks in a shelter operated out of the National Guard Armory in neighboring Mullins (some of those at the shelter are from Mullins also), the shelter residents have been anxious to return home or, at the very least, to return to a home at all. \\nAfter the cleanup has begun and the issue morphed into getting the victims out the shelters, many people thought that the cavalry finally arrived when FEMA announced it was coming to town to “assess” the damages and the need of the community for aid. Unfortunately for those who don’t fully understand the nature of such organizations, FEMA has been anything but a cavalry. \\nIn fact, despite an annual budget of nearly $14 billion a year , FEMA has done virtually nothing other than “assess” damages. The agency did not come with water, sandbags, food, blankets or anything else necessary for flood victims. All it brought was an expensive van and lots of paperwork. \\nSo what does FEMA actually do besides assess? And why on earth would it need $14 billion to assess anything? The answer? Besides creating the blueprint to use a natural disaster, military conflict, economic collapse, and social unrest as justification to set up domestic internment camps alongside the Department of Homeland Security, FEMA acts as a facilitator for loans and “loan assistance” to victims who have lost their homes and their livelihood. Instead of providing “trailers” (preferably free of toxic chemicals) to victims, FEMA is instead focused on providing “low interest” loans through the Small Business Administration . \\nWhile no one is arguing that loan assistance program is the problem, many would rightly wonder why, if this is all FEMA will do in an actual emergency, is there an annual budget of $14 billion? \\nFor many people, FEMA is just another in a long line of useless and overrated organizations reaping the benefits of the disaster relief industrial complex. The Red Cross, for instance, is notorious for sucking up large sums of money and disappearing, leaving only a fragile house or two behind them to prove that they did, technically speaking, build homes for disaster victims . In Mullins, for instance, where the organization ran the shelter for the Hurricane Matthews victims, the Red Cross was seen as a hindrance as much as it was a help. While the organization’s help in running the shelter was appreciated, it was reported by an overwhelming numbers of people in the Mullins area who attempted to bring food and supplies to the victims that the Red Cross rudely refused their assistance. In fact any and all hot food brought by members of the community was actually turned away. Likewise, supplies donated by citizens and people of the surrounding areas were taken in but not actually distributed, instead being shipped to other locations. The Red Cross, in Mullins, actively prevented the community from coming to aid their friends and neighbors. \\nPredictably, after the media cameras were gone and the words “Hurricane Matthew” fell from the headlines, the Red Cross decided to close the last remaining shelter, which was still housing over 80 people at the time. The shelter victims were given only a matter of a few days prior knowledge that they were about to be homeless in the traditional manner, i.e., that they would soon be sleeping on the street. Oh, and they were directed to FEMA to apply for their low interest loans. \\nAs is typical with the Red Cross and many organizations like it, when the glory of being the “selfless” disaster relief organization faded, so did its interest in the people it was allegedly there to assist. \\nAs WPDE TV 15 reported , \\nAfter Hurricane Matthew, the Red Cross opened 95 shelters statewide and 24 in our area. Now, there is only one left open, the National Guard Armory in Mullins. \\nAs of Monday night, this shelter still has more than 70 people staying there. However, they plan on closing it Thursday at 3 p.m. \\nAll the people staying at the shelter were evacuated from Nichols after the Little Pee Dee River and Lumber River flooded the town. \\n“We don’t have a home to go to. That’s what I’m telling Red Cross. What are you all going to do with us when you close Thursday? We have a shelter full of people that they don’t have a home,” said Margaret Tart, who’s staying at the shelter and lived in Nichols. She continued. “How can you close a shelter and put us out?” \\nAfter outcry from citizens in Mullins and the subsequent negative attention in the local press, however, the Red Cross reversed its decision to close the shelters. WPDE reported the next day , \\nAbout 70 people were still staying there as of Monday night and all had been evacuated from Nichols after the Little Pee Dee River and Lumber River flooded the town. \\nShelter officials were planning to close it as of 3 p.m. on Thursday, but Palm said that decision has changed. \\n“We reached an accommodation with our partners and they decided…that they could keep the shelter open as long as was needed there,” he said. \\nThe disaster response from the Red Cross and FEMA should serve as a lesson not only to Marion County citizens but to every single American. When disaster strikes, you cannot depend on multi-million dollar “relief” organizations nor can you depend upon FEMA or any other government agency. While we argue that FEMA should be redirected to act as what it was allegedly created to be-a crisis management organization that provides material and logistical support to relief, rescue, and rebuilding operations. \\nIn the meantime and, unfortunately, in the real world, communities must accept the fact that they are on their own when it comes to disasters. Stronger connections within the community must be built and maintained and the people of both rural and urban areas must begin to make plans and preparations to act for themselves and their neighbors when outside agencies and organizations are not there for them. \\nBut back to that giant FEMA budget . . . .'"}, "time": 1742562198.2248163}