{"duration": 0.04486894607543945, "input_args": {"text": "'by David Gutierrez \\nThe financial outlook for Whole Foods Market continues to look grim, as consumers seeking natural and organic products continue to take their business elsewhere. \\nAs far back as 2014, then-CEO John Mackey admitted that the company was hurting due to an explosion in the number of stores selling organic groceries. \\n“The growing demand for fresh, healthy foods , the offering of natural and organic products is expanding everywhere [in] new stores, existing stores and online,” Mackey said. \\nThe company has also been hit by several recent scandals, including allegations of price-gouging, and more recently, of colluding with Monsanto to ensure the passage of a bill that bans the labeling of foods made with genetically modified organisms ( GMOs ). Company profits tanking \\nWhole Foods was in a vulnerable financial position even before the recent scandals erupted. Organic and natural food sales have exploded in the United States in the past decade, largely due to the entry of new players into the organic grocery market. This broke what had been an all but de facto monopoly for Whole Foods. \\nOrganic food sales were $11 billion in 2004. By 2014, they had more than tripled. The combined organic and “natural” foods market had grown to $48 billion by 2012 – from just $6 billion in 1998. \\nA watershed moment for organic foods availability – and perhaps the beginning of the end for Whole Foods – came when Walmart entered the market in 2014, introducing a store-brand organics line priced 25 percent lower than its other organic products. \\nThen, last year, New York regulators accused Whole Foods of price gouging and cheating customers with false weights and measures. The company settled the charges, but the scandal only increased its image as an overpriced store that eats up your “Whole Paycheck.” \\nThe company’s same-store sales have fallen every quarter for the past year, with another 2.1 percent drop expected for this quarter. Overall company earnings are predicted to fall both this year and next year. And the company’s stock has tanked, falling in 2014 and 2015 to a current level of 50 percent below the 2013 high. This year, the stock has fallen more than 10 percent more. \\nThese factors left the company in a vulnerable position when food prices as a whole fell, causing an across-the-board drop in profits for all grocery stores. Are consumers rejecting ‘organic traitors?’ \\nA factor overlooked by many financial analysts, but potentially significant for the Whole Foods customer base, is the company’s collusion in the recent passage of the Denying Americans the Right to Know (DARK) Act 2.0. Posing as a GMO labeling bill, the DARK Act 2.0 actually banned all GMO labeling initiatives passed by state or local governments. Within two years, the government is now supposed to roll out a completely voluntary labeling initiative that requires consumers to call a 1-800 number or use a smartphone to scan a QR code for GMO ingredient information. \\nTo top it off, the bill defines “GMO” so narrowly, that 95 percent of GMO products currently on the market are allowed to be labeled as non-GMO – including products made with corn or soy with the Bt or Roundup Ready traits. \\nWhere does Whole Foods come in? According to the Center for Food Safety and small organic farmers groups, the DARK Act 2.0 would never have passed if major organic foods companies – including Whole Foods – had not lent their support to the bill, joining forces with Monsanto and the Grocery Manufacturers Association. \\nOther major “organic traitors” include UNFI (the country’s largest organic and natural foods wholesaler) and the Organic Trade Association, which represents companies such as Organic Valley, White Wave and Smuckers. \\nNinety percent of U.S. residents support mandatory labeling of GMO foods. \\nSources:'"}, "time": 1742628543.4076254}