{"duration": 0.031462669372558594, "input_args": {"text": "'Ron Paul has never been a man to keep his opinions under wraps to spare the feelings or the reputations of others. Since he has retired from Congress he has embarked on a number of strongly worded tirades against those he perceives to be manipulating American democracy. \\nVia UsualRoutine \\n\\nTherefore it should not come as a surprise to anyone that Paul has a lot to say about the current presidential election. As well as calling Donald Trump and authoritarian and claiming that Hillary Clinton could have easily run on a Republican ticket, Paul has also made some sensational allegations about election rigging.\\nScroll Down For Video Below The allegations were made in the course of Paul’s web show, called the Liberty Report which was focusing on the Department of Homeland Security’s decision to take a more active role in the election. Secretary Jeh Johnson said he was “considering whether elections should be classified as ‘critical infrastructure, ’ affording them the same kinds of enhanced protections that the banking system and the electrical grid receive.”\\nThis move was prompted by the hacking of sensitive emails from members of the Democrat Party. While the government and the mass media have been quick to lay the blame on Russia they have yet to offer substantive evidence to support these claims. Nonetheless, the implication that a foreign government could substantially influence the American democratic process has opened up the possibility that managing the election should be a matter for the security services.\\nPaul said that the idea that Homeland Security could be charged with protecting the electoral process was frankly risible. He cited their previous history of incompetence and failed objectives. Moreover, he said that it was entirely possible that people within the Department of Homeland Security could use their new power to manipulate the electoral process and seize power for themselves. According to Paul, “They may have false flags and they may do a lot of things, but no matter how an emergency comes up, they’re going to make use of it. And the use of it isn’t to say ‘Hey, how are we going to protect the American people?’\\nAre they worrying, when they talk about doing something about rigged elections, [that] the votes are counted? No, they’re making sure that the votes aren’t counted and they’re irrelevant and the government has all this power.” This should not be seen as merely idle speculation, Paul warned his viewers, as there is already systemic election rigging in the United States. “The elections don’t matter. This is a ritual that we go through, ” he said. What really matters, according to Paul was some kind of hidden powerful cabal who were much more influential than the ‘will of the people.’\\nDespite all of this, Paul says that there is a great deal to be optimistic about. He said that if enough people became aware of the fractured nature of American democracy then there could be important changes in economic philosophy and the protection of civil liberties both at home and abroad. This kind of attitudinal shift could rob the ‘deep state’ of its power and mean that the American people would be safer and richer.\\n'"}, "time": 1742628583.5490677}