{"duration": 0.0737454891204834, "input_args": {"text": "'What is going on with WikiLeaks?   Defend Democracy \\nWikiLeaks director and founder of the Centre for Investigative Journalism Gavin MacFadyen has died at age 76. The cause of death is yet unknown. His ‘fellows in arms’ have flocked online to post their farewells, including WikiLeaks co-founder Julian Assange. \\n“ We are extremely sad to announce the death of Gavin MacFadyen, CIJ’s Founder, Director and its leading light ,” the Centre for Investigative Journalism team wrote on its Twitter. \\nMacFadyen was a pioneering investigative journalist and filmmaker, who back in 2003 founded the Centre for Investigative Journalism (CIJ), an organization that helped break several major stories and has trained a number of prominent journalists. \\nGavin Macfadyen was mentor to Assange (and his closest friend in London), to WikiLeaks’ Sarah Harrison, Joseph Farrell and many others. \\n— WikiLeaks (@wikileaks) 4:03 AM – 23 Oct 2016 \\nHe was a mentor and friend to famous whistleblower and co-founder of WikiLeaks Julian Assange, as well as the director of the publication. Paying tribute to their head, WikiLeaks published a post on the group’s Twitter account saying MacFadyen “ now takes his fists and his fight to battle God .” \\nThe post is signed “ JA ,” indicating that the phrase belongs directly to Julian Assange, with WikiLeaks claiming that, despite the whistleblower being deprived of internet access in his suite in the Ecuadorian embassy for a week now, he has been able to contact them and is “ still in full command. ” \\nThe CIJ team also published an address from MacFadyen’s wife and member of Julian Assange’s Defense Fund, Susan Benn, who described her husband as a “ larger-than-life person, ” with gratitude and respect. \\n“ He was the model of what a journalist should be… He spearheaded the creation of a journalistic landscape which has irrevocably lifted the bar for ethical and hard-hitting reporting. Gavin worked tirelessly to hold power to account. \\n“His life and how he lived it were completely in sync with the principles that he held dear and practiced as a journalist and educator – to comfort the afflicted and afflict the comfortable, ” Benn wrote . \\nRecounting her husband’s achievements, she said he had produced and directed more than 50 investigative documentaries covering diverse and multiple countries and problems. She also noted that he had been banned from apartheid South Africa and the Soviet Union for his investigative work, and was also attacked by British Neo-Nazis. \\nIn his professional career, MacFadyen shed light on topics like child labor, pollution, the torture of political prisoners, neo-Nazis in Britain, UK industrial accidents, Contra murders in Nicaragua, the CIA, maritime piracy, election fraud in South America, South African mines, as well as many others. He worked on investigative television programs for PBS’s Frontline, Granada Television’s World in Action, the BBC’s Fine Cut, Panorama, The Money Programme, and 24 Hours, as well as Channel 4’s Dispatches. \\nThe cause of MacFadyen’s death has not yet been made public. In the original post from his wife Susan, she wrote that he had died from “ a short illness, ” but that line has now been removed. \\nDid you know: Gavin Macfadyen was arrested with Bernie Sanders, was a body double for Nick Nolte & was banned from South Africa & the USSR? \\n— WikiLeaks (@wikileaks) 4:20 AM – 23 Oct 2016 \\nTwitter has been full of tributes from his colleagues and like-minded people. Even the hacktivist organization Anonymous has spoken out. Gavin MacFadyen, always kind & supportive of young journalists & filmmakers. Can never forget your booming laugh. Thank you my friend. \\nEarlier this year, MacFadyen gave an interview to RT’s Going Underground program to talk about the publication of leaks related to US presidential candidate Hillary Clinton, the most recent of which have been emails from the account of her aid, John Podesta. The barrage of sometimes shocking revelations has proven to be a bit of a thorn in the side for Clinton’s election campaign. In the interview, he said that the documents released so far are merely a drop in the ocean of the information WikiLeaks is receiving, and was hopeful that while “ there’s only one known Snowden, ” there may be other whistleblowers who will keep shedding light on injustice and other major global pain points.'"}, "time": 1742562303.1055448}