{"duration": 0.15514612197875977, "input_args": {"text": "'Written by Michael Scheuer   Although Obama’s effort to help Hillary Clinton’s campaign by taking Mosul on the eve of the election failed, there is a good chance that Mosul will fall to the heterogeneous coalition that is attacking it. Be that event in six weeks, six months, or a year, the United States and its allies will rejoice over the event as if it is the death knell of the Islamic State (IS). They will be wrong to do so, showing again how deeply ignorant they are of the Islamist enemy and the religious war it is waging against them. IS has lost in Palmyra, Anbar, Ramadi, and other territories, and yet its troops are putting up their hardest fight yet in Mosul. Why? Two reasons: (a) IS leaders prematurely declared the caliphate, ignoring Osama bin Laden’s guidance that the lasting re-creation of caliphate was impossible until the United States was driven from the Arab World; if he was alive, he would probably add Russia to that guidance; and (b) because in the minds of IS leaders, fighters, and their supporters, everything, good or bad, comes from Allah; victory is from Allah, and defeat is a trial sent by Allah to test His followers’ faith and perseverance. While far from irrelevant, IS’s defeats in 2016, in Islamist minds, are in part a consequence of a IS leadership mistakes, but overwhelmingly because Allah did not grant them victory at this time. The stubborn defense of Mosul and other places in Syria and Iraq, as well as the not infrequent, often unexpected IS offensive actions occurring in tandem, are mujahedin operations meant to prove to Allah that they are working through His test and trying to prove that they are fighting His fight and are worthy of His assistance. This is not a new phenomenon. Between 1979 and 1991, the Afghan Islamists were constantly beaten up, tactically defeated, and generally beleaguered by the Red Army and Air Force, but they stayed in the field, fought the Soviets and their Afghan allies, and Allah ultimately gave them victory. More recently, the West and its African allies have twice dealt the Somali Islamists heavy blows and declared victory. Today, however, Al-Shabaab remains in the field and is advancing, and a nascent Islamic State outfit has joined the war. Faced with an enemy that thinks in this manner, victory for the United States, Russia, and their respective allies requires nothing less than as a complete annihilation of the mujahedin and their supporters as is militarily possible. As noted here previously, the loss of the cities that IS held or holds in Syria and Iraq is a blow to the organization’s prestige, and is costly in financial and manpower terms. It does not destroy the eternal goal of recreating the caliphate, or the IS organization. Indeed, in the counter-intuitive ways of insurgent warfare – where losses are often wins — those defeats will make IS stronger, more elusive, and more appealing to young Muslims. The latter due to its fierce resistance against what is irrefutably the strongest Crusader force that has ever taken the field against Islam. Without the cities, IS will no longer need to supply food, electricity, water, roads, health, education, and social services, or law-and-order for urban populations, all of which are expensive and manpower-intensive. Shed of this burden, IS forces will be reapplied. Much of IS’s remaining force will return to what they do best, which is to base in remote areas of Syria and Iraq and conduct a patient insurgent campaign, which will be fought by small groups, in a hit-and-run manner, and will be punctuated by ambushes, IEDs, and car-bombs in urban areas. IS’s loss of the cities and return to its main fighting skills will coincide with a gradual recognition on the part of the US-Russia-Iran-NATO coalition that its string of urban victories have yielded a catastrophic result. In the space of a year, for example, the coalition will have lost the only kind of targets in which it has prevailed against Islamists since 2001 – cities – and will then confront an enemy that requires quite large numbers of infantrymen for use in undertaking the long, bloody, costly, and usually unsuccessful counter-insurgency campaign needed to have any chance of annihilating IS and the other Islamist fighting groups. Oh yes, the Western members coalition also will have to pay through the nose – given that Syria, Russia, and Iraq do not have a pot to piss in – to rebuild the urban areas and infrastructure its air forces and IS have destroyed. They also will have to feed the hundreds of thousands who have lost their homes and jobs; who largely blame the current coalition’s Westerners, Russians, and Shias for their dire predicament; and who hold an enduring hatred for the US government for invading Iraq in 2003. An Islamist insurgency being waged from Damascus eastward to the Iranian border, however, will be only one part of the catastrophe which will be delivered by the coalition’s successful campaign to drive IS from the cities. As noted, IS will return to its strongest military skill, and it also will return to kind of warfare that requires less manpower. IS leaders, therefore, will be free to redeploy their fighters to areas of its choosing, and, as the history of the last 20 years has shown, the arrival of even a few veteran mujahedin can make a notable difference to the quality and lethality of local jihadi operations. The European governments are already in a public and cowardly tizzy about IS’s foreign fighters returning to their home countries. Some will certainly return to Europe and stage attacks, but they will only serve as icing on the Islamists’ cake. The Europeans have already sealed their well-deserved fate by letting in a tidal wave of Arab refugees – in the name “Merkelism”, which is an insane, Western civilization-destroying brand of humanitarianism – in whose ranks were untold numbers of mujahedin in the guise of innocent refuge seekers. Indeed, the greatest threat posed by IS fighters returning home probably lies not in Europe, but in Indonesia, the Philippines, Malaysia, Jordan, India, and western China, where the ample local supplies of would-be Salafi mujahedin are in dire need of military trainers, combat-experienced leaders, explosives experts, and talented organization-builders and logisticians. The real rub for the victorious US-Russia-NATO-Shia coalition will come when IS leaders deploy – as they now are – fighters to countries where other jihad struggles are ongoing. IS fighters from Syria and Iraq, for example, have been and will be sent to Afghanistan, among them Pakistanis and Afghans going home with significant combat experience and organizational and leadership abilities. This move will strengthen IS’s foothold in Afghanistan, and begin to pave the way for the priority IS goal of entering Central Asia and opening another front against Russia. Other IS fighters will be deployed to Gaza to strengthen the growing Salafi movement, as well as to be filtered by HAMAS’s military wing into the Sinai Peninsula to fight the Egyptian military and attack Israel. IS fighters also will be sent to assist the growth of Salafi organizations and military capabilities in the Tripoli region of northern Lebanon. IS leaders will continue deploying fighters, munitions, and explosives into Iran, and will surely move some troops to Yemen, either to fight there or to move across the Red Sea to serve in Somalia and East Africa, to reinforce IS fighters in Libya and the rest of North Africa, and to join IS-allies in Mali, where the regional Islamist tide again appears to be rising. In this religious war, US and NATO “victories” – such as the deposing of Saddam, killing Osama bin Laden and Muammar Gadhafi, and backing the coup that overthrew Muhammad Morsi — have very often led to more, rather than less war, as well as to sky-rocketing expenditures by that effete gang of war-without-killing bankrupts. The retaking of the Syrian and Iraq cities from IS seems likely to yield the same kind of result, only this time perhaps on a much broader international scale. In view of the foregoing budding reality, and the long string of disasters that have preceded it, there never has been a better time for the US national government to make a clearly America-First decision to complete the Mosul operation and then withdraw all US troops, aircraft, and private contractors from Syria and Iraq. That action will let the nations from Europe, the Levant, and the Arab Peninsula who have what America has not — genuine life-and-death national interests in the ultimate outcome there – continue the war until they are successful or until they perish. While that melodrama plays out, Americans can work on defending US interests, in all of their dimensions, in the place it matters most, in North America. That is, after all, the clearest and most important of all the constitutional responsibilities assigned to the US national government, as well as the one that won Mr. Trump the recent election. Reprinted with permission from Non-Intervention.com. Related'"}, "time": 1742563664.083862}