{"duration": 0.03812098503112793, "input_args": {"text": "'Speaker of the House Paul Ryan ( ) turned his attention to tax reform Tuesday as he addressed a meeting of the National Association of Manufacturers (NAM). [“We are going to fix this nation’s tax code once and for all,” the speaker said to the NAM’s Manufacturing Summit in Washington, DC.  After describing with dismay the complexities and uncertainties of the current tax code, Ryan launched into some specifics of his plan for reform. “First, we will eliminate harmful taxes including the death tax and the alternative minimum tax,” he said. “Next, we will clear out special interest   and expensive deductions,” Ryan continued, explaining that the home mortgage, retirement, and charitable giving deductions would not be on the chopping block. Seven current individual tax brackets would be reduced to three, with the savings from discontinued deductions and streamlining allowing lower tax rates. Ryan promised a “postcard sized” income tax form would be possible under the plan. America’s 35 percent corporate tax rate came into Ryan’s crosshairs, which he compared to Canada’s 15 percent. Ryan partly blamed this tax rate, along with high individual rates for businesses that filed that way, for widespread offshoring of American jobs. “We cannot accept a system that perpetuates the drain of American businesses overseas,” he said. The solution, according to Ryan, is a move to a “territorial system” that allows American companies to move cash from overseas into the country without being taxed. This promise smacked of similarity to the Border Adjustment Tax concept that has caused controversy in earlier Republican tax reform proposals under Ryan’s speakership. Shortly before taking office, President Donald Trump expressed his objections to the concept to the Wall Street Journal. In setting the stage, Ryan touted as legislative successes his caucus’s use of the Congressional Review act, more than a dozen times, to roll back administrative state regulations, before promoting the American Health Care Act (AHCA) the one major bill passed by House Republicans during President Trump’s administration. The AHCA faces an unclear fate in the Senate. Ryan had made clear in the past he was waiting for the House to pass a healthcare bill before moving on taxes. With the House having done so last month, Ryan appeared to be moving forward with plans to introduce tax legislation regardless of how that bill, the AHCA, fares in the Senate. Shortly after the AHCA’s passage, Ryan spoke to New York City’s AM 970 about tax reform prospects, saying, “We are convinced that we can get this done in 2017 so that the economy can really start to take off.   …     All the planets are aligned, meaning you have the House, the Senate and the White House all working on this plan together. ” At the start of the month, House Freedom Caucus chair Mark Meadows told a crowd at the conservative Heritage Institute that he would push for Congress’s August recess to be canceled if a tax bill has not been passed by then. Speaker Ryan seemed to echo that sentiment Tuesday, saying tax reform would move “full speed ahead” but set a later deadline of the end of the year: You will hear that tax reform is coming along. You will hear that it is dead. Then you will hear it is back on track. Then you will hear it is on life support. Sometimes you will hear all of this in the same week, the same day, or heck, even the same hour. Do not be surprised by any of it. But I am here to tell you: We are going to get this done in 2017. We need to get this done in 2017. We cannot let this     moment slip by. Ryan promised that any bill his Caucus introduces will insist on changes to the tax code.'"}, "time": 1742628571.670524}