{"duration": 0.0454559326171875, "input_args": {"text": "'Police fear Salman Abedi may have armed more Islamists before carrying out his deadly attack in Manchester, after discovering a “working bomb factory” at his address. [The Telegraph reports police “discovered a working bomb factory with a huge stash of explosive chemicals and other components”.  A security source who spoke to the newspaper offered a warning:”The worry is there was enough to build two or three bombs and we can’t rule that out. ” It is believed the Manchester Arena bomb was assembled by Abedi himself, with David Videcette, a former Metropolitan Police constable who participating in the   investigations, saying he probably learned his deadly craft overseas. “This is not something you can just put together by reading a book or watching a YouTube video,” he said. “[Abedi] will have spent time at a camp somewhere, possibly in Libya, being shown how to do it. “But once you have the skills and the materials, assembling the device itself can be done fairly quickly. ” Islamist groups gained rapidly in power and influence in Libya after a   military intervention, led by former Prime Minister David Cameron and former President Barack Obama, toppled Colonel Muammar Gadaffi. Abedi’s father Ramadan, a Libyan migrant granted refugee status in Britain, returned to his native country shortly before Gaddafi’s death. He has since been connected to the Libyan Islamic Fighting Group (LIFG) a jihadist organisation linked to   and proscribed by the U. S. The British Government has not implemented or pursued a ban on travel to and from countries like Libya, meaning Abedi was free to visit Ramadan there prior to carrying out his attack. Ramadan now been detained, along with Abedi’s younger brother Hashem, by the Special Deterrence Force  —   a   militia which is itself described as a hardline Salafist organisation. He had been an administrative manager in Tripoli’s security forces. Abedi’s sister, also in Libya, declared that her brother “did what he did in revenge, and in love for Islam“.'"}, "time": 1742563286.4753387}