{"duration": 0.08429884910583496, "input_args": {"text": "'Vanessa Bayer of “Saturday Night Live” doesn’t get home until around 5 a. m. following the show’s weekly live performance and  . “A lot of the time I’ll go to sleep with all of my makeup on,” Ms. Bayer said. The    comedian and actress, who played Amy Schumer’s sidekick in the movie “Trainwreck” last summer, grew up in Cleveland and discovered the meaning of “comic relief” while battling leukemia as a teenager. “I don’t know if it made me funnier, but it was so amazing, how it made everything be O. K.,” she said. Ms. Bayer lives in a   apartment in a West Village   by herself. “But I just realized there’s a part of my floor that squeaks,” she said, “so it’s kind of like I have a cute pet. ” SOFA BOUND I try to get up by 3. I put a sweatshirt on over my PJs and I go down my stairs. It’s like a loft where I live my bedroom is upstairs. My TV is in an entertainment center. You have to open the doors for the remote to work, so I open those and then I sit down on my couch. I’ll forget my slippers upstairs and I’ll be like, “Ugh! I have to go upstairs to get them. ” It’s like eight stairs. But stairs are stairs. THAT MAKEUP I’ll wash my face because I start to feel like my eyes are stuck together. It’s so much makeup from the show. I usually don’t shower. There’s just no reason. ‘TOASTED!’ I order food from my couch and I don’t leave my couch again until it comes. I’ll order a bagel. I’ll get really mad because they will forget to toast it. It didn’t happen when I lived further east, near NYU. Those people were really on it. I’d say it takes me a good 10 minutes to get over it. I’ll have a savory or sesame bagel. Sometimes I’ll get a raisin bagel with raisin walnut cream cheese and they’ll use a knife they cut an onion bagel with and then there’s a whole section of the bagel I can’t eat. I usually order coffee with the bagel. My coffee maker isn’t the best, so I like ordering it in. Sometimes the coffee will have spilled onto the bagel, and then of course, you know how upsetting that is. UNREALITY TELEVISION I’ll sit and I’ll watch TV while I’m eating my bagel. It’s stuff I have  . “Real Housewives,” stuff on Bravo. I also weirdly watch “General Hospital. ” I used to watch it and then I stopped and now I’ve started watching it again. They have a lot of supernatural stuff. I truly love it, but the level of believability is very low. It’s very refreshing.  PRIORITIES I joined Twitter two years ago. I was late to it. So I am still really into it. I’ll make a tweet. Wait, is that what you say? Post a tweet? I’ll post a tweet and then I’ll call my brother and say, “Hey, did you see my tweet?” I won’t talk on the phone too much. It’s usually fun to talk to my parents. I mean, it’s always fun! I don’t want to burn my parents. But I don’t pick up the phone much on Sundays. I like texting with friends, but I find if I am watching TV, I have to focus on the show. CHECKING THE FRIDGE My fridge is usually pretty empty. If I can get it together to order FreshDirect, I will have some fruit and yogurt in the fridge. But there isn’t a ton of stuff you would cook with. I feel like my parents are going to be very proud of me when they read this. NOISES OFF I usually meditate twice a day, Transcendental Meditation. For some reason, I always forget to meditate on Sunday, because it’s such a weird day, and I’ll remember at 5 and meditate for 20 minutes. And it’s great, because I’ll feel like I’m getting something done. Even though I am sitting on the couch. DELIVERY At 7 or 8 I decide to order dinner. I try and eat kind of healthy on Sunday nights, to balance out the bagel. Some kind of salad, or sushi sometimes. At dinner, I’ll switch to HBO. I can stay up watching TV so late. The problem is I don’t get tired early because of staying up so late. I might order a snack, popcorn, at 11. Sometimes I’ll order in three times on Sundays. People think New York is crazy and busy, but it’s actually a great place for lazy people to live. You can order microwaveable popcorn! I’ll order, like, those bags of it. But there’s a minimum, so then I’ll order laundry detergent. I wonder sometimes what the doormen think of me.'"}, "time": 1742562287.0014691}