{"duration": 0.10047006607055664, "input_args": {"text": "'Hollywood celebrities reacted with shock and anger Tuesday following the White House’s announcement that President Donald Trump fired FBI Director James Comey. [Comey, who was appointed director of the agency by former president Obama in 2013, was fired after an evaluation conducted by Attorney General Jeff Sessions and Deputy Attorney General Rod Borenstein. In his letter to Trump, Sessions wrote that “a fresh start is needed at the leadership of the FBI. ”  “It is essential that we find new leadership for the FBI that restores public trust and confidence in its vital law enforcement mission,” Trump himself wrote in a letter to Comey released Tuesday. But leftist celebrities  —   including longtime Trump critics Rosie O’Donnell, Michael Moore, Chelsea Handler and Joss Whedon  —   were up in arms over Tuesday’s announcement. “Trump might just as well have said: ‘Lock me up,’” wrote actor and filmmaker Rob Reiner. “Last gasp of a dying man. GOP stop being unpatriotic pussies. ” “RESIGN YOU PATHETIC MORONIC SPOILED RICH PRICK,” added O’Donnell. Below, find a sampling of Hollywood’s reaction to Comey’s firing. Warning: some tweets contain strong language. TRUMP FIRES COMEY! ABSOLUTE OBSTRUCTION OF JUSTICE! ABSOLUTE EVIL! ? 8^¥  —   Jim Carrey (@JimCarrey) May 9, 2017,  TRUMP SAYS 1 OF THE REASONS HE FIRED FBI DIRECTOR COMEY IS BECAUSE OF WHAT HE DID 2HILLARY CLINTON. GOD, HE IS A A GUTLESS, LYING, TRAITOR ‼️  —   Cher (@cher) May 9, 2017,  No spin   keep it simple   just fired the guy investigating him. Facts so inconvenient i know. We must Impeach this clown NOW,  —   John Cusack (@johncusack) May 9, 2017,  @realDonaldTrump RESIGN YOU PATHETIC MORONIC SPOILED RICH PRICK,  —   ROSIE (@Rosie) May 9, 2017,  WALK OUT COME ON  —   WALK UR AMERICAN ASS OUT OF HIS CRIMINALLY CONTROLLED WHITE HOUSE  —   TURN UR BACK ON TRUMP #SICKtrump https:  .   —   ROSIE (@Rosie) May 9, 2017,  #COMEY This is absolutely OUTRAGEOUS! !! The Head of an IMPARTIAL agcy was FIRED bc he was uncovering corruption in the WH! #🔥🔥🔥🔥🔥🔥🔥🔥🔥  —   Debra Messing (@DebraMessing) May 9, 2017,  Impeach him,  —   John Legend (@johnlegend) May 9, 2017,  COMEY FIRED! Dirty, corrupt things afoot. The truth will all come out. The unraveling continues  …     Hold the election over. Dirty. Corrupt.  —   Michael Moore (@MMFlint) May 9, 2017,  We don’t need a special prosecutor. We need an Auror. @jk_rowling,  —   Joss Whedon (@joss) May 9, 2017,  Trump might just as well have said: ”Lock me up” Last gasp of a dying man. GOP stop being unpatriotic pussies. #SpecialProsecutor,  —   Rob Reiner (@robreiner) May 9, 2017,  Donald Trump definitely has syphillis!! Who would act like this? Nixon must have had syphillis too! @MitchMcConnell you better wake up,  —   Chelsea Handler (@chelseahandler) May 9, 2017,  PLEASE WAKE UP THIS IS CRAY YALL https:  .   —   Sarah Silverman (@SarahKSilverman) May 9, 2017,  And to any of you who are okay with this, please let me know how cool you’d be if Hillary were President  did this as he investigated her.  —   Josh Gad (@joshgad) May 9, 2017,  Orange Shady is gonna make sure we never get to the bottom of this madness! ”Nixon The Sequel”. Remember the firing of Archibald Cox?! Hmmmm https:  .   —   Arsenio Hall (@ArsenioHall) May 9, 2017,  It may be reasonable to presume that any Republican who doesn’t support a special prosecutor is compromised by or complicit in #russiagate,  —   Wil Wheaton (@wilw) May 9, 2017,  I do. And he’s not totally wrong. Comey has been a hot mess. But as Lao Tzu said, In Action Watch The Timing. It’s suspect af. #resist https:  .   —   Don Cheadle (@DonCheadle) May 9, 2017,  It’s your move, @GOP. Who will step up and be the hero?  —   Alyssa Milano (@Alyssa_Milano) May 9, 2017,  Welp Comey is gone good thing the entire rest of the FBI isn’t suspicious of Trump nope looks like the whole thing has blown over now. 🙄  —   josh groban (@joshgroban) May 9, 2017,  When the President fires the man investigating him, and Congress and the Justice Dept won’t act, we have a full blown constitutional crisis.  —   George Takei (@GeorgeTakei) May 9, 2017,  Trump thinks he’s still on Celebrity Apprentice!  Wow! #Trump #Comey #comeyfired,  —   Kevin Nealon (@kevin_nealon) May 9, 2017,  Trump fires Comey ”because he wasn’t fair to Hillary. ”Are there even any Republicans buying this BS? Nyet. #IndependentInvestigation,  —   Adam McKay (@GhostPanther) May 9, 2017,    Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562127.1822126}