{"duration": 0.10422396659851074, "input_args": {"text": "'Reafirmación testicular de un Real Madrid que se encima de sus posibilidades RESUMEN DE LA JORNADA 12 DE LA LIGA SANTANDER 2016-2017 Resumen de la jornada Betis 2-0 Las Palmas \\nLa ganadería bética engranó un trabajado debut de Victor Sánchez en el banquillo de la Maestranza. Más de cuatro cuartos de entrada para ver a unos toros (metáfora de jugadores) de encaste muy cuajados que embistieron (metáfora de jugar) con nobleza (metáfora de nobleza) y gran calidad (futbolística). Poco pudieron hacer los diestros palmeños que en todo momento se vieron desbordados por los astados (metáfora de los jugadores). Ovación y vuelta al ruedo (liga Santander). Atlético 0-3 Real Madrid \\nUn Cristiano (Ronaldo) resucitado se apareció a los hijos de Simenone y les dijo: “Juntaos y os declararé lo que os ha de acontecer en los días venideros. Yahvé maldice vuestro furor, que fue fiero, y vuestra ira, que fue dura y por eso seréis envilecidos con tres goles (de falta, de penalti y al contragolpe)”. \\nDicho lo cual lo cumplió y los albinos ya sacan cuatro puntos al segundo. Barcelona 0-0 Málaga \\nUn Málaga impertinente consiguió dejar mudo a un Barcelona desmessiado y ansuarezuado ante la mirada de un Luis Enrique que no supo en ningún momento romper un marcador inamovible. A destacar la actuación de un gran Kameni bajo unos grandes palos evitando unos goles que nunca llegaron a una portería. Como declaró uno de los jugadores malquitas al terminar el partido, “Uno más uno es dos, pero unos nacen y otros se hacen”. Athletic 1-0 Villarreal \\nEl partido se abrió con una ensalada de bacalao con pimientos, a la que siguieron unas patatas a la riojana, perdiz estofada y un chuletón de buey de un kilo, a compartir entre dos. Cuando el partido se empezaba a poner interesante, se cerró el telón del primer acto y a la vuelta de los vestidores la pelota volvió a la nevera. Sólo un error podía matar el cero del tablero. Casi quedó señalado Bruno, que perdió una pelota tonta y el remate rojiblanco terminó en la red. El partido quedó empachado. \\nDe postre una estupenda panchineta de hojaldre. Uno a cero y a vomitar al baño. Alavés 0-1 Espanyol \\nGerard Moreno falló un penalti para los pericos poco minutos antes del final, lo cual sumió al delantero guacamayo en un estado de depresión del que parecía imposible salir. Por fortuna para los loros de Madagascar, en la grada se encontraba Paulo Coelho, que gritó a Moreno: “¡Todas las batallas de la vida sirven para enseñarnos algo, inclusive aquellas que perdemos!”. \\nSegundos después, el delantero tucán lograba el gol de la victoria. Eibar 1-0 Celta \\nEl centrocampista eibarita, Fran Rico, furioso al ser anunciado por megafonía como Pan Rico, fue el autor del único tanto que subió al marcador. Ni las migas dejó en el campo. \\nCon espacios y la convicción de las cosas bien hechas, el Eibar pudo haber marcado más tantos pero se conformó con ser un equipo muy señor y tendió la mano al Celta. Valencia 1-1 Granada \\nGranada, tierra soñada por mí, mi cantar se vuelve gitano cuando es para ti, pero sin embargo Valencia es la tierra de las flores, de la luz y del amor, ambas cantadas por Plácido Domingo. Tablas, pues. Sporting 1-3 Real Sociedad \\nLos hombres de Eusebio fueron muy superiores a los hombres de Abelardo y bastante más que los hombres de Paco. Partido muy viril. De hombre a hombre, mirando a los ojos. Lástima que en la segunda parte del encuentro los jugadores de ambos equipos se centraran más en escupir sobre el césped que en perseguir el balón. Deportivo 2-3 Sevilla \\nPartido demenciado que acabó con la milagrosa victoria del conjunto hispalense gracias a la intercesión de la Virgen de la Macarena que, con su halo, marcó el camino del gol a Z’Nonzi, Vitolo y Mercado entre saetas y gritos de guapa. \\nEl Deportivo sacó a Santiago Apóstol en la segunda parte pero no sirvió de nada ante la eficacia goleadora de la madre de Dios. Leganés 0-0 Osasuna \\nLa mujer del portero leganita ha pasado el fin de semana fuera por cuestiones de trabajo y él no tenía a nadie con quien dejar a los niños, con lo que el partido se celebrará esta noche, que esta noche sí, sin problema, ya se queda ella, a las 20:45 en el Estadio Municipal de Butarque nos vemos. La salida de la publicidad de los apartamentos no, la otra. Acordaos de traer la pelota, aunque creo que allí alguna tendrán pero mejor llevar una nosotros que luego nunca se sabe.'"}, "time": 1742562133.1938326}