{"duration": 0.1250135898590088, "input_args": {"text": "'For more than half an hour 38 respectable, law‐abiding cit izens in Queens watched a killer stalk and stab a woman in three separate attacks in Kew Gardens. Twice the sound of their voices and the sudden glow of their bedroom Iights interrupted him and frightened him off. Each time he returned, sought her out and stabbed her again. Not one person telephoned ‐ the po lice during the assault one wit ness called after the woman was dead.’ ”That was two weeks ago to day. But Assistant Chief In spector Frederick M. Lussen, in charge of the borough’s detec tives and a veteran of 25 years of homicide investigations, is still shocked.” ’He can give a matter‐of‐fact recitation of many murders. But the Kew Gardens slaying baffles him‐not because it is a murder, but because the “good people” failed to call the police. “As we have reconstructed the crime,” he said, “the assail ant had three chances to kill this woman during a 35‐minute period. He returned twice to complete the job. If we had been called when he first at tacked, the woman might not be dead now. ” This is what the police say happened beginnang at 3:20 A. M. in the staid, middle‐cIass, tree‐lined Austin Street area: Twenty‐eight‐year‐o1d Cath erine Genovese, who was called Kitty by almost everyone in the neighborhood, was returning She turned off the lights of her car, locked the door and started to walk the 100 feet to the entrance of her apartment at 82‐70 Austin Street, which is in a Tudor building, with stores on the first floor and apartments on the second. The entrance to the apart ment is in the rear of the   ing because the front is rented to retail stores. At night the quiet neighborhood is shrouded in the slumbering darkness that marks most residential areas. Miss Genovese noticed a man at the far end of the lot, near a seven‐story apartment house at 82‐40 Austin Street. She halted. Then, nervously, she headed up Austin Street to ward Lefferts Boulevard, where there is a call box to the 102d police Precinct in nearby Rich mond Hill. ‘He Stabbed Me!’ She got as far as a street light in front of a bookstore before the man grabbed her. she screamed. Lights went on in the 10‐story apartment house at 82‐67. Austin Street, which faces the bookstore. Windows slid open and voices punctured the early‐morning stillness. Miss Genovese screamed: oh, my God, he stabbed me! Please help me! Please help me !” From one of the upper win down in the apartment house, a man called down: “Let that girl alone !” The assailant looked up at him, shrugged and walked down Austin Street toward a white sedan parked a short distance away. Miss Genovese struggled to her feet. Lights went out. The killer returned to Miss Genovese, now trying to make her way around the side of the building by the parking lot to get to her apart ment. The assailant stabbed her again.’ ”“I’m dying!” she shrieked. “I’m dying!” She shrieked. “I’m dying! ”” ’A City Bus Passed Windows were opened again, and lights went on in many apartments. The assailant got into his car and drove away. Miss Genovese staggered to her feet. A city bus, Q‐10, the Lef ferts Boulevard line to Ken nedy International Airport, passed. It was 3:35 A. M.’ ”The assailant returned. By then, Miss Genovese had crawled to the back of the building, where the freshly painted brown doors to the apartment house held out hope of safety. The killer tried the first door she wasn’t there. At the second ‐ door, 82‐62 Austin Street, he saw her slumped on the floor at the foot of the stairs. He stabbed her a third time —  fatally.” ’It was 3:50 by the time the police received their first call, from a man who was a neighbor of Miss Genovese. In two min utes they were at the scene. The neighbor, a 70‐year‐old woman and another woman were the only persons on the street. No bady else came forward. The man explained that he had called the police after much celiberation. He had phoned a friend in Nassau County for advice and then he had crossed the roof of the building to the apartment of the elderly wo man to get her to make the call.’ ”“I didn’t want to get in volved,” he sheepishly told the police.” ’Suspect Is Arrested Six days later, the police ar rested Winston Moseley, a 29 year‐old   op erator, and charged him with the homicide. Moseley had no previous record. He is married, has two children and owns a home at 133‐19 Sutter Avenue, south ozone Park, Queens. On wednesday, a court committed him to Kings County Hospital for psychiatric observation. When questioned by the po lice, Moseley also said that he had slain Mrs. Annie May John son, 24, of 146‐12 133d Avenue, Jamaica, on Feb. 29 and Bar bara Kralik, 15, of 174‐17 140th Avenue, Springfield Gardens, last July. In the Kralik case, the police are holding Alvin L. Mitchel1, who is said to have confessed that slaying. The police stressed how sim‐ ple it would have been to have gotten in touch with them. “A phone call,” said one of the de tectives, “would have done it. ” The police may be reached by dialing . “O” for operator or SPring  .’ ”The question of whether the witnesses can be held legally responsible in any way for fail ure to report the crime was put to the Police Department’s legai bureau. There, a spokesman said :” ’“There is no legal responsibil‐ity with few exceptions, for any citizen to report a crime. ” Statutes Explained Under the statutes of the city, he said, a witness to a suspicibus or violent death must report it to the medical examiner. Under state law, a witness cannot withhold infor mation in a kidnapping.’ ”Today witnesses from the neighborhood, which is made up   homes in the $35, 000 to $60, 000 range with the exception of the two apartment. houses near the railroad sta tion, find it difficult to explain why they didn’t call the police.” ’Lieut Bernard Jacobs, who handled the investigation by the, detectives, said: “It is one of the better neigh borhoods. There are few re ports of crimes. You only get’ ”Path of Victim: Stabber’s Third Attack Was Fatal” ’The police said most persons had told them they had been afraid to call, but had given meaningless answers when asked what they had feared. “We can understand the reti cence of people to become in volved in an area of violence,” Lieutenant Jacobs said, “but where they are in their homes, near phones, why should they be afraid to call the police?” He said his men were able to piece together what happened  —  and capture the suspect‐be cause the residents furnished all the information when detec tives rang doorbells during the days following the slaying.’ ”“But why didn’t someone call us that night ?” he asked un believingly.” ’Witnesses —  some of them un able to believe what they had allowed to happen —  told a re porter why.’ ”A housewife, knowingly if quite casual, said, “We thought it was a lover’s quarrel. ” A husband and wife both said, “Frankly, we were afraid. ” They seemed aware of the fact that events might have been” ’One couple, now willing to talk about that night, said they heard the first screams. The husband looked thoughtfully at the bookstore where the killer first grabbed Miss Genovese. “We went to the window to see what was happening,” he said, “but the light from our bedroom made it difficult to see the street. ” The wife, still ap prehensive, added: “I put out the light and we were able to see better. ”’ ”Asked why they hadn’t called the police, she shrugged and re plied: “I don’t know. ”” ”A man peeked out from a slight opening in the doorway to his apartment and rattled off an account of the killer’s second attack. Why hadn’t he called the police at the time? “I was tired,” he said without emotion. “I went back to bed. ”” ’It was 4:25 A. M. when the ambulance arrived for the body of Miss Genovese. It drove off. “Then,” a solemn police detec tive said, “the people came out. ” This article can be viewed in its original form.  Please send questions and feedback to archive_feedback@nytimes. com'"}, "time": 1742561929.4974248}