{"duration": 0.09993815422058105, "input_args": {"text": "'Leave a reply \\nSelwyn Duke – Sex crimes with children, child exploitation, money laundering, perjury, and pay to play, reads the partial list of crimes that, say New York City Police Department sources, could “put Hillary and her crew away for life.”Shocking evidence of such criminality has been found on ex-congressman Anthony Weiner’s laptop computer, say the sources, which was seized from him by NYC officials investigating his allegedly having sent sexually explicit texts to a 15-year-old girl. Moreover, Hillary Clinton’s “crew” supposedly includes not just close aide and confidante Huma Abedin and her husband, Weiner, but other aides and insiders — and even members of Congress. Reports True Pundit : \\nNYPD sources said these new emails include evidence linking Clinton herself and associates to: • Money laundering • Sex crimes with minors (children) • Perjury • Pay to play through Clinton Foundation • Obstruction of justice • Other felony crimes \\nNYPD detectives and a [sic] NYPD Chief, the department’s highest rank under Commissioner, said openly that if the FBI and Justice Department fail to garner timely indictments against Clinton and co- conspirators, NYPD will go public with the damaging emails now in the hands of FBI Director James Comey and many FBI field offices. \\n“What’s in the emails is staggering and as a father, it turned my stomach,” the NYPD Chief said. “There is not going to be any Houdini-like escape from what we found. We have copies of everything. We will ship them to Wikileaks or I will personally hold my own press conference if it comes to that.” \\nThese revelations would explain why Director Comey reopened the investigation into Clinton’s mishandling of classified information, a move that shook the political world and caused Comey to come under fire. As the NYPD chief put it, the new e-mails contents truly are “alarming.” \\nTrue Pundit also reports FBI sources as stating that Abedin and Weiner are both trying to cut immunity deals with federal officials and that, if they didn’t cooperate, they’d face long prison sentences. Abedin’s turning state’s evidence would no doubt be devastating for Clinton, as the two women have for years been joined at the hip. Abedin has at times been like Clinton’s shadow, has been called her “body woman,” and has even been rumored to be Clinton’s lesbian lover. So Abedin likely knows where, as is said, the bodies are buried. \\nOf particular note, the new e-mails allegedly contain information revealing that Hillary, Bill Clinton, Weiner, and numerous congressmen took trips to convicted billionaire pedophile Jeffrey Epstein’s private island, where he is said to pimp out underage minors of both sexes to prominent people. The trips were taken aboard Epstein’s Boeing 747, dubbed the “Lolita Express”; the pedophile’s island, in the US Virgin Islands, has been called “ Sex Slave Island .” \\nThese revelations would also explain why Clinton used powerful software called BleachBit to scrub damning information from her private server. According to BleachBit’s website, its program gives criminals and others the ability to “shred files to hide their contents and prevent data recovery.” \\nYet it can’t scrub bumbling perverts from your personal life, and Weiner’s laptop also contains incriminating e-mails revealing the mishandling of classified information by Abedin and Clinton, say the sources. Both women “sent and received thousands of classified and top secret documents to personal email accounts,” and this information could have been “accessed, printed, discussed, leaked, or distributed by untold numbers … of unknown individuals,” writes True Pundit . \\nConsequently, FBI sources say the new Clinton investigation has been broadened and now includes matters such as how, informs True Pundit : • Abedin forwarded classified and top secret State Department emails to Weiner’s email • Abedin stored emails, containing government secrets, in a special folder shared with Weiner warehousing over 500,000 archived State Department emails. • Weiner had access to these classified and top secret documents without proper security clearance to view the records • Abedin also used a personal yahoo address and her Clintonemail.com address to send/receive/store classified and top secret documents • [a] private consultant managed Weiner’s site for the last six years, including three years when Clinton was secretary of state, and therefore, had full access to all emails as the domain’s listed registrant and administrator via Whois email contacts. \\nThis story just adds more intrigue to a presidential campaign that is truly unprecedented, with a torrent of WikiLeaks and Project Veritas revelations and now Clinton’s Weiner woes. From vote fraud to inciting violence to child sex abuse to pay-for-play to perjury, it’s becoming clear to many that the Democratic Party — and the Clintons in particular — are essentially a criminal syndicate. \\nAs former assistant FBI director James Kallstrom said in a Sunday interview, “The Clintons, that’s a crime family, basically. It’s like organized crime. I mean the Clinton Foundation is a cesspool…. God forbid we put someone like that [Clinton] in the White House.” And now we know better why, as I wrote Sunday, this “appears standard FBI sentiment. I personally know of an ex-agent — someone with knowledge of Clinton ‘crime family’ dealings — who I’m told is having trouble sleeping at night due to the prospect of a Clinton presidency.” \\nAll these revelations raise important questions: How could Hillary Clinton and her cohorts have bumbled so badly that they appear a cross between Inspector Clouseau and Boss Tweed ? \\nAnd if Clinton is so careless with her own personal survival, how can she be trusted with national survival? \\nPart of the explanation is general incompetence, yet there’s another factor: Both Clintons have engaged in continual criminality over the decades — and have been allowed to skate at every turn. This lack of accountability has led to complacency and ever-increasing brazenness, just as with a child never punished for wrongdoing. \\nSo, finally, perhaps, Clinton corruption has reached critical mass. And with Donald Trump ahead 10 points (according to one respected poll) among the 88 percent of voters who have definitely made up their minds, maybe, come late Tuesday evening, some tossing and turning FBI agents will finally be able to enjoy a good night’s rest. SF Source The New American Nov. 2016 Share this:'"}, "time": 1742563267.5050344}