{"duration": 0.053893089294433594, "input_args": {"text": "'November 7, 2016 \\nToday the world awaits the results of a record-breaking American vote against the worst Not President of the United States (NPOTUS) in history, instead electing by default someone it is already ashamed of. In the past twenty-four hours, the two front-runners have finally ceased in their last-ditch attempts to sway swing voters to detest them less than the other contemptible candidate. \\nThe UK has recently emerged from a similar vote on the basis of limited information on two outcomes where the consequences were indeterminate and the candidates literally lied for Britain. Most voters voted for the thing they least understood because the consequences of the other thing sounded dire. The politicians then found themselves in the invidious position of defending and implementing the thing they really didn’t vote for, or would not have given an ounce of integrity. \\nSympathetic British voters have been sending advice and best wishes to their American counterparts via social media. Tristram Hopgood, a civil servant from Winchester gave the least-twattish words of advice: \\n“Ideally, one would avoid having a massive, bungling-man child with ridiculous yellow hair and no concept of poverty or morality anywhere near the process. If this is unavoidable, at least never allow him to act unsupervised and offer him a pretend steering-wheel on the family car and hope he is delighted with that. \\nIf you end up voting in a scary female super-villain who makes her shoes and cloak from the skins of puppies, it is best to dig a big hole and hide in it until the financial melt-down blows over. It should be noted that the lady in question is likely to show an unhealthy interest in all things nuclear within twenty-four hours of gaining office, so best dig that hole good and deep.” \\nMedia outlets world-wide have had an unexpectedly easy time of it preparing the front pages for the next day, with headlines reading: “America, what HAVE you done?”, regardless of the outcome.   Squudge   Squudge   World News 0'"}, "time": 1742562030.1010072}