{"duration": 0.178361177444458, "input_args": {"text": "'I would like to briefly sum up the message from the thought leaders of conservatism in this election cycle. \\nThis is their basic thesis: \\nThe problem with conservatism today is all these people who are wrong and stupid and horrible about everything. \\nThey usually don’t put it so bluntly. They frame it in terms of some people being fossils, or some people being opportunistic, or some people being narrow-minded, or one-dimensional in their thinking, or one thing or another that’s a tad more inventive than “wrong, stupid, and horrible.” But not much more inventive, really, when you get right down to it. \\nIt’s time to declare all stop, because this isn’t helping anything. \\nDavid Brooks, who tries hard to speak without brutality, has produced the latest such meditation. I don’t want to pick on him. But he’s written an op-ed that seems to encapsulate a lot of what’s wrong with the current conservative discourse, starting with a passage like this: \\nThis is a sad story [about the state of conservatism]. But I confess I’m insanely optimistic about a conservative rebound. That’s because of an observation the writer Yuval Levin once made: That while most of the crazy progressives are young, most of the crazy conservatives are old. Conservatism is now being led astray by its seniors, but its young people are pretty great. It’s hard to find a young evangelical who likes Donald Trump. Most young conservatives are comfortable with ethnic diversity and are weary of the Fox News media-politico complex. Conservatism’s best ideas are coming from youngish reformicons who have crafted an ambitious governing agenda (completely ignored by Trump). \\nWe could pick this apart in a number of ways, but just start with the fact that it’s an exercise in contingent, situational innuendo about other conservatives. \\nOlder conservatives, apparently, are not “comfortable with ethnic diversity,” and are barkingly enthusiastic about “the Fox News media-politico complex.” My goodness, they sound awful. But what does that even mean? How do you distinguish between the implied states of being here? By what criteria? And what difference does it make, to the meaning and purposes of conservatism? \\nIt’s as if Barack Obama appeared on the scene, and a mere eight years later, no one can remember what it was like to talk about conservatism without talking about other conserva tives as if we’re all snotty gossip reporters. Heck, the folks at TMZ give their celebrity targets more mercy and benefit of the doubt. \\nWe can’t cover everything in one post. I want to look at just one aspect of the conservative dialogue, one that isn’t about the “Trump test,” or the “Fox News” test (who knew?), or the “ethnic diversity” test, or the “my Christianity is more righteous than yours” test, or any other test I see being applied out there. \\nHere’s the topic: the loss of moral touchstones in our culture due to the breakdown induced by cultural Marxism. \\nIf we want to know why conservatives can’t talk to each other today, I’d suggest we start with that. \\nThe Berkeley test \\nMany readers will have their own ideas of how to frame this with examples. I’m going to use this one . \\nA mob of young people, who have been encouraged for years to believe very destructive things about their world, comes together at Berkeley. The mob’s purpose: to block white students from making their way to their classes. \\nHere, in the next sentence, is the result of the breakdown induced by cultural Marxism. Conservatives, for the most part, can’t really think what to do about this. \\nConservatives have a good-hearted desire for a positive outcome. But this thing at Berkeley is a tough problem; it’s a real problem; it’s a perennial type of human problem (albeit with modern refinements) – and conservatives today are often too muddleheaded in their thinking to navigate this form of whitewater in human dynamics. \\nThe progressive left isn’t even in this discussion, because it sees no need to defend any rights for the white students in the case. \\nIt’s conservatives who have been stymied and silenced by the application of cultural Marxism. As little as 20 years ago, I think a lot more conservatives could have made a cogent case for what to do, based on core moral principles. Today, too many conservatives wander in a fog of doubt about those principles – and so they criticize each other instead, over irrelevancies like weariness vs. enthusiasm for Fox News. \\nI propose the following as the conservative response to the event at Berkeley. Detain and identify everyone involved in blocking students’ passage to class – classes those students or the taxpayer, or both, are paying good money for them to attend. Stand up, as the school administration, and inform the miscreants that this won’t happen again, and if it does, they’ll be expelled. Put the campus police behind this policy. Follow through as necessary to stop the tortious interference with paying customers’ access to the service they are paying for. Expel students who don’t obey the rules. Penalize faculty who abet them and lead them astray. \\nConservatives who think we can have a working society without such impartial enforcement need only look around them to realize that we can’t. The evidence is staring us in the face, that there is no such condition as one in which we can deconstruct the rules of respect and decency through endless, unresolved, resentment-based “dialogue,” and yet also be able to function. \\n“We” can’t function at all, when that so-called “dialogue” rules us. The “dialogue” serves to paralyze people who want good and positive things, and to leave only the people with destructive goals free to act. \\nReclaiming some core moral ideas \\nThere’s a beating heart of society that badly needs reclaiming, and it’s the function of moral authority and common expectations. Conservatives once thought systematically about that very issue, because they understood that one way or another, we are under authority. At Berkeley, students are under the de jure authority of the administration – or they are under the de facto authority of a mob. \\nBut on the “de jure” side, there should be a conservative alternative to what the progressive left wants to do with authority. The left wants to use government’s enforcement authority to dictate common expectations to everyone, about everything. That’s the progressive left in a nutshell. \\nWhat I outlined above, for the Berkeley situation, is a conservative concept for the use of authority to enforce some minimum common expectations, in the interest of impartiality, equality of treatment, and rightful use of services lawfully obtained. It’s a decentralized concept too, with authority being wielded by the institution, and only implicitly backed by the government – but without the government being directly involved. \\nThat conceptual outline ought to be a recognized alternative to what is actually being done at Berkeley. But how many conservatives could really make the case for it today? How many conservatives can look at the Berkeley situation and do something besides shake their heads over how stupid everything has gotten? \\nConservatism itself is paralyzed by the nervous moral fear induced in people by cultural Marxism – which has been meant from the beginning to undermine moral confidence at the most basic level. Conservatism’s problem isn’t Donald Trump. Conservatism’s problem is that Donald Trump isn’t paralyzed by the guilt-mongering of cultural Marxism – but conservatism is . \\nThe answer is not for conservatism to insist that nothing move out there, until we decide what forms of paralysis will continue to suit us. The answer is that conservatives must fearlessly reclaim the necessary social concepts of authority and common expectations, and start producing results. \\nThe reality of 2016 \\nPeople know today that conservatives couldn’t handle the situation at Berkeley the way it should be handled. Conservatives would be afraid to. People also know that progressives won’t handle it properly. Progressives don’t want to. \\nBut oddly enough, weird old Donald Trump probably would handle it the right way. He’d recognize clearly the principle of lawful access to the service you’ve paid for. And he wouldn’t fear to enforce that principle, even though there’d be some caterwauling from the mob. \\nPeople get that. \\nConservatives won’t make headway by being angry or alarmed that Trump seems to be walking off with the “effectiveness” rep. Sure, he probably has a lot of wrong thoughts in his head on the general topic of authority. Most people do. \\nBut the cost of remaining paralyzed by that concern is going up by the hour. Somebody’s got to take order to this problem. The people can’t afford to wait for conservatives to shake off the fear, and start acting again like what we believe in ought to be enforced. \\nWhat do conservatives believe in? Litmus tests involving Fox News, and the excitement of an “ambitious governing agenda”? Other equally situational, buzz-thought-sounding checklists? If so, we are in a box, right where cultural Marxism wants us. \\nI submit that that, and not intransigent personalities, is our problem. There’s a vacuum where our moral philosophy should be. We offer no alternative to the left’s grand vision for government, and the mob’s destructive rule by default. That’s not because of Donald Trump. It’s because we fear to engage with the reality that for human social life, there must be authority and common expectations. \\nOur ears hear the wrong thing in those words. Cultural Marxism has taught us, as it has everyone else, to hear inferences like “Hitler” and “fascism.” \\nBut in fact, authority and common expectations, wielded accountably and from the right elements of society (like the family, parents, and faith, as well as the thoughtful consent of individuals), are necessary for liberty, prosperity, and hope . \\nAnd only conservatives will think systematically about how to both limit authority, and use it beneficially. \\nDon’t complain about Donald Trump if your contribution to conservatism is to fuss about the other conservatives who annoy you. The conservatives who disagree with you haven’t lost their way, in a static situation frozen back in 1955, because of something that’s wrong with them. There is no static situation. Given that reality, they’re just doing the best they can. \\nOur entire civilization is in a great crisis, one that has been creeping up on us for decades. And that crisis is laying bare flaws in our conservative thinking that we have left unattended for too long. The flaws aren’t about failing to accept cultural Marxism and its prejudicial tropes (like “ethnic diversity,” used as a bell-ringer for implied guilt). The flaws are about failing to reject and defeat cultural Marxism. Its proper end is on the ash heap of history. Yet conservatives are paralyzed by being in thrall to it. We fix that, or we perish. 0 shares'"}, "time": 1742564056.3105829}