{"duration": 0.07999086380004883, "input_args": {"text": "'(4) Representative democracy \\n(5) Overt minority dictatorship \\nThe present society oscillates between (4) and (5), i.e. between overt minority rule and covert minority rule camouflaged by a façade of token democracy. A liberated society would eliminate (4) and (5) and would progressively reduce the need for (2) and (3). . . . \\nIn representative democracy people abdicate their power to elected officials. The candidates’ stated policies are limited to a few vague generalities, and once they are elected there is little control over their actual decisions on hundreds of issues — apart from the feeble threat of changing one’s vote, a few years later, to some equally uncontrollable rival politician. \\nRepresentatives are dependent on the wealthy for bribes and campaign contributions; they are subordinate to the owners of the mass media, who decide which issues get the publicity; and they are almost as ignorant and powerless as the general public regarding many important matters that are determined by unelected bureaucrats and independent secret agencies. \\nOvert dictators may sometimes be overthrown, but the real rulers in “democratic” regimes, the tiny minority who own or control virtually everything, are never voted in and never voted out. Most people don’t even know who they are. . . . \\nIn itself, voting is of no great significance one way or the other (those who make a big deal about refusing to vote are only revealing their own fetishism). The problem is that it tends to lull people into relying on others to act for them, distracting them from more significant possibilities. A few people who take some creative initiative (think of the first civil rights sit-ins) may ultimately have a far greater effect than if they had put their energy into campaigning for lesser-evil politicians. At best, legislators rarely do more than what they have been forced to do by popular movements. \\nA conservative regime under pressure from independent radical movements often concedes more than a liberal regime that knows it can count on radical support. (The Vietnam war, for example, was not ended by electing antiwar politicians, but because there was so much pressure from so many different directions that the prowar president Nixon was forced to withdraw.) If people invariably rally to lesser evils, all the rulers have to do in any situation that threatens their power is to conjure up a threat of some greater evil. \\nEven in the rare case when a “radical” politician has a realistic chance of winning an election, all the tedious campaign efforts of thousands of people may go down the drain in one day because of some trivial scandal discovered in his (or her) personal life, or because he inadvertently says something intelligent. If he manages to avoid these pitfalls and it looks like he might win, he tends to evade controversial issues for fear of antagonizing swing voters. If he actually gets elected he is almost never in a position to implement the reforms he has promised, except perhaps after years of wheeling and dealing with his new colleagues; which gives him a good excuse to see his first priority as making whatever compromises are necessary to keep himself in office indefinitely. \\nHobnobbing with the rich and powerful, he develops new interests and new tastes, which he justifies by telling himself that he deserves a few perks after all his years of working for good causes. Worst of all, if he does eventually manage to get a few “progressive” measures passed, this exceptional and usually trivial success is held up as evidence of the value of relying on electoral politics, luring many more people into wasting their energy on similar campaigns to come. \\nAs one of the May 1968 graffiti put it, “It’s painful to submit to our bosses; it’s even more stupid to choose them!”'"}, "time": 1742561775.9413536}