{"duration": 0.1695711612701416, "input_args": {"text": "'Home | World | Rubber Band Politics: How the Left Enables the Right Rubber Band Politics: How the Left Enables the Right By Baron Von Schlitz 13/11/2016 11:32:09 \\nWASHINGTON D.C. – USA – The rise if the right is a direct result of the left, as the rubber band is pulled so far, it must eventually snap back. \\n\\n\\nPull a rubber band to its very limit, and it eventually snaps back. \\nThe government of America went too far to the left, the socialist pseudo Marxist strains of Obama thus enabled Trump’s win. No one could tolerate another four years of socialism especially under a ball breaker staunch feminist like Hillary Clinton. \\nThe natural state of human existence is a moderate conservative attitude, one of family and of conserving traditional values, the socialists wish to destroy the family, to destroy culture through mass migration at speed, to effectively destroy all traditions and norms as much as possible. \\nThis is why we are seeing a mass movement now to the right, people are fed up of the homosexualisation of everything, of the bending of all tradition, the PC, the emasculation of the male, and the dominance of transexualisation, the forcing of cultural racial integration. \\nPresident Obama wanted the U.S. military to become a bath house full of homos and transsexuals, which in effect emasculated the army. Soldiers cowering behind walls more worried about their nails or make up, whilst real soldiers came over the top with their Russian grimaces, eager to bury their bayonets deep into the homosexualised American ninnies, trembling with fear, and pissing in their knickers. \\nPeople want armies that can fight effectively, they don’t want Obama’s faggot army, they want real men who can do the job, and do not need to be mollycoddled at every turn. \\nBy pulling the rubber band so far, Obama and his ilk is responsible for bringing forth the right, they shamelessly were instrumental in the resurgence of the extreme right wing, as it moves to rebalance the vast move to the left. \\nIn Europe we are now seeing the cowering socialists doomed to years of purgatory, as the people rise up and remove them from office. Feminism has had its day as it is consigned to the dustbin, to be retrieved eventually when people have had enough of the right. \\nThis sort of rubber band politics, is one of extremes, pull, snap, pull, snap, and on it goes. People do not necessarily vote for the best candidate but simply because they’ve had enough of a certain regime or political ideology that has been prevalent for a long time. \\nYes, there is a sense of relief when the politically correct socialists are given the boot, because you can say what you want again, it is a real relief. Socialists claim to be progressives, however they inhibit free speech, how is this progress? The right on the other hand allow things to be said, but this in turn can in the future be taken to the extreme as well, as we have seen throughout history. \\nOne faction enables the other and work as a well oiled machine, and this is the mechanism that moves agendas quickly for the Controllers, who of course deal on both sides at the same time. Whichever side wins, they always win, and many voters are of course blind to such things. This is good, the voters must be ignorant to the fact that they are mere pawns in a bigger game. \\nThe core infrastructure does not give a flying fuck who wins an election, could be red, blue or yellow, they simply give instructions to the victor and the deal is done. How many times have you seen a government come in to power, and adopt the rulings of the previous government. We see this in Britain, where Labour increased CCTV surveillance by the million, then the Conservatives came into power, instead of reducing surveillance, they carried on with it, and adopted it fully, despite bad mouthing it when they were in opposition. \\nEuropeans of the right will bring racial intolerance, which is a natural human emotion and a reaction to the invasive qualities of sudden mass migration. Where the boulevards of Paris once were adorned with cafes, and sojourning Parisians, they are now replete with Africans on messy mattresses and tents, the once beautiful pavements adorned not with Art Deco lampposts but excrement and piss. This migrant influx is a direct result of the laissez faire attitude of the EU socialist elite who turned a blind eye to their utopian Schengen dream which turned out to be a road from the world’s poverty stricken zones to the West. \\nLeftists should prepare themselves to an approximate thirty or forty years in the wilderness, and they have only themselves to blame. It is obviously impossible for leftists to be moderate, and this is their own undoing. Yes, but you say, what about Blair and Cameron? Well, these were socialists with a centrist marginal conservative attitude, especially when it came to finance. Their sole purpose was economical staying-in power politics and nothing else. \\nDonald Trump, and Farage are a movement, and France will be the next focus. Once France is repatriated from the socialists, Germany will once again regain it’s pride in the Fatherland. Italy will follow as will the rest of the European nations. Schengen will be scrapped, as it is the road to self-destruction, and people hold a natural will to survive and not to die. \\nThe right is the correct way for human national survival, the socialist does not care for national survival, family or traditional human values, it seeks to destroy all of these in as fast a time as possible. Socialists seek to subvert human existence into a perverted bastardised form of malevolence they call progress. Human societal and political progress must be allowed to slowly evolve and not be pushed by socialist control freakery. \\nWhether you are left or right of the political spectrum, in the end does not matter of course. These are all created constructs to keep the machine moving. Having elections every four years prevents civil unrest and rioting. That is the only reason for the so-called democracies that the West claims rule the globe. \\nWe all live in a democracy where if you go out into the street to protest, the militarised police will beat your teeth into the gutter with their truncheons and trample over you with their boots. \\nWithout one there can be no other, the left needs the right and so forth, to play off each other. Without sickness, the doctor would be out of a job, and without crime, the policeman would be unemployed.'"}, "time": 1742563884.2567017}