{"duration": 0.04903459548950195, "input_args": {"text": "'Geert Wilders, leader of the Party for Freedom (PVV) that is just 11 days away from potentially winning the Dutch general election has hit out at   “hate preachers” who have used their religious influence to call on their followers to vote for the   ‘Denk’ (Think) party. [After the messages from a number of “notorious hate preachers” became public on Friday, Mr. Wilders took to Twitter to slam their intervention in the Dutch election process. Retweeting a scan of an article in Dutch newspaper De Telegraaf, Mr Wilders wrote: “Can those imams of hate, and Denk too, not bugger off for Allah’s sake to some Muslim country? ”.  Kunnen die haatimams niet samen met Denk omwille van Allah optiefen naar een of ander islamitisch land? https:  .   —   Geert Wilders (@geertwilderspvv) March 4, 2017,  Political party Denk, which presently two members of parliament  —   Turkish origin Tunahan Kuzu and Selçuk Öztürk  —   is the first by migrants, for migrants political party in Europe. The party’s policies include the wholesale renaming of streets to erase the Netherland’s colonial history, the establishment of a   strong ‘  police’ and the establishment of a hate criminal register, similar to a sex offender’s register. Similar plans have been recently mooted in the United Kingdom. Although the party has been accused of being a mouthpiece in the Netherlands for the Turkish government, they hope to gather growing support from the estimated one million migrants living in the European country, out of a total population of just 17 million. The latest controversy surrounding the party comes after “infamous hate preachers” including imams Fawaz Jneid and Suhayb Salam calling on their worshippers to vote for the party. De Telegraaf reports imam Salam, who has seen a number of his congregation travel to Syria to wage jihad, favours Denk because they campaign for Muslim rights. He is reported to have said: “It is important that we [come together] for this party, and to warn against the current ruling parties, who have made it very difficult for Muslims in recent years  …     Take your parents and friends to the polls, for the sake of Allah”. Hate preacher Fawaz Jneid who came into the public eye after the assassination of filmmaker Theo van Gogh  —   a man he had preached against  —   said of Denk that because there aren’t enough Muslims in the Netherlands, it was important for them to come together and vote as a bloc for a single party, in a Facebook video for his followers. According to present projections and polls Mr Wilders’ PVV is expected to achieve 25 seats in the Dutch parliament, and so become the largest party. Denk is on course to keep their two with no gains.  '"}, "time": 1742561932.0020404}