{"duration": 0.03549766540527344, "input_args": {"text": "'Google News has added a special “executive orders” section to its users’ feeds, focusing on articles about executive orders issued by President Trump. [The section has caused backlash from some users online who claim it to be “inappropriate” and  .   “Why did Google add ‘Executive Orders’ to my news feed? My feed is personalized. I will add what I want to add,” complained one user in a post to Google’s product forums. “It is unacceptable for Google to push crap I did not request into my personal feed. ” “It was added to mine also,” added another. “Suddenly Google cares about executive overreach? Stop forcing your agenda on me. I get plenty enough Trump news already. ” One user called the section “Weird, inappropriate, and even a little creepy,” while another complained: “This is so inappropriate, and google’s response has been pathetic. ” Google News feeds typically feature sections under popular categories such as entertainment, science, and technology, but “Executive Orders” appears to be new, with the URL for the section designated “  ”. In June, Wikileaks founder and editor Julian Assange claimed Google was “directly engaged in Hillary Clinton’s campaign,” while leaked emails showed Eric Schmidt, the executive chairman of Google’s   Alphabet, had been sending campaign plans to Clinton’s team as far back as 2014. “We should understand that Google  …     is intensely aligned with U. S. exceptionalism,” claimed Assange. “Personally at the top aligned with Hillary Clinton’s election campaign and almost certainly once Hillary Clinton becomes president, those people in Google, like Jared Cohen, will be placed into positions around the new Clinton presidency. ” Google has not responded to a request for comment at the time of this publication. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742564118.8796482}