{"duration": 0.06240653991699219, "input_args": {"text": "'LOS ANGELES  —   “Don’t Breathe” became the latest in a string of hit horror movies over the weekend, while the indie romance “Southside With You” bested the boxing drama “Hands of Stone. ” Between    activities and vacations,    August can be a time for studios to offload dreck. (See: “ . ” Or don’t.) But “Don’t Breathe,” released by Sony Pictures Entertainment, received reviews from top critics that were 94 percent positive, according to Rotten Tomatoes, expanding the movie’s appeal beyond the core horror crowd. “Don’t Breathe,” from the Uruguayan   Fede Alvarez, took in about $26. 1 million at North American cinemas. With a    sales effort that started in March, “we really treated this film as an experience that you needed to see on the big screen,” Josh Greenstein, Sony’s president of worldwide marketing and distribution, said by phone on Sunday. Mr. Greenstein noted that Sony has now turned three   summer films into moneymakers, with “The Shallows,” a horror movie, and the animated “Sausage Party” as the other two. (Sony’s   “Ghostbusters,” on the other hand, not so much.) “Don’t Breathe,” which cost about $9. 8 million to make, pushed “Suicide Squad” (Warner Bros.) into second place, ending that supervillain film’s   run at No. 1. “Suicide Squad” took in about $12. 1 million over the weekend, for a new domestic total of $282. 9 million, according to comScore, which compiles box office data. Worldwide, “Suicide Squad” has now taken in $636 million, according to Warner. The only other new   movie in the United States over the weekend was “Mechanic: Resurrection” (Lionsgate) which collected an estimated $7. 5 million. While the sequel took in 34 percent less than its series predecessor did over its first three days in theaters in 2011, Lionsgate spent only about $9 million to acquire certain rights to the movie, which was produced by Millennium Films for a reported $40 million. Arriving in roughly 810 theaters apiece were “Southside With You,” which imagines Barack and Michelle Obama’s first date in 1989, and “Hands of Stone,” about the Panamanian fighter Roberto Duran and his trainer Ray Arcel. Costing a reported $1. 5 million to make and starring two relatively unknown actors, Parker Sawyers and Tika Sumpter, “Southside With You” (Roadside Attractions and Miramax) sold $3 million in tickets. On the other hand, “Hands of Stone,” starring Robert De Niro and Édgar Ramírez, collected $1. 7 million it was released by the Weinstein Company and financed by an outside group for an estimated $20 million. “For this kind of movie, a true story that is also a relatively unknown story, you’ve got to give audiences time to find it  —   to let word of mouth kick in  —   and we think that is happening here,” David Glasser, Weinstein’s president, said by phone, noting that “Hands of Stone” received an A grade from ticket buyers in CinemaScore exit polls. Mr. Glasser said plans are for the film to move into wide release starting Wednesday.'"}, "time": 1742563859.7025173}