{"duration": 0.11339902877807617, "input_args": {"text": "'Democrat Sen. Al Franken said, “We should look at that” when asked during a Tuesday CBS This Morning interview if Senior Adviser to the President Jared Kushner’s security clearance should be revoked. [“This is a pretty bad breach,” added Franken. “These guys, this, the Administration, they’re not acting like people who have nothing to hide,” he claimed in the interview. He said they have a special prosecutor and House and Senate intelligence committees looking into the matter. “We have to see where the facts lead us, of course,” said Franken, who agreed when the host said, “But we don’t know yet?”  Franken said that Kushner didn’t disclose some of his contacts with Russians during the initial process of obtaining White House security clearance. The senator claimed that this is “against the law. ” Last Friday the Washington Post reported the claim of Russian Ambassador Sergey Kislyak that Kushner sought a secret communications channel between the Trump transition team and the Kremlin. The Post report stated that U. S. officials reviewed intercepted communications from December 1 or 2 at Trump Tower and that those communications included an offer from Kushner to Kislyak to set up a secret communications channel between the transition team and the Kremlin. The report also cited unnamed officials that said the U. S. was not surveilling the meeting or those involved. The report added that Russia sometimes feeds false information “as a way of sowing misinformation and confusion among U. S. analysts. ” In a Tuesday morning interview with Fox News, Counselor to the President Kellyanne Conway cited weekend comments from Homeland Security Secretary John Kelly and National Security Advisor Gen. H. R. McMaster in which each expressed a lack of concern about the issue and, Conway stated, “backchannels like this are the regular course of business. ” Recently the Department of Justice appointed former FBI Director Robert Mueller as special counsel on the investigation into Russian interference in the 2016 presidential election. Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742562887.6104472}