{"duration": 0.07932758331298828, "input_args": {"text": "'Posted on November 11, 2016 by Charles Hugh Smith \\nThough I am just another powerless peon, I’d like to offer seven suggestions to President-Elect Trump and his transition team: \\n1. Make sure your administration is as diverse as America. No single act will give your enemies more ammo than populating your cabinet and administration with the Usual Suspects: Caucasian elites from Ivy League universities. These privileged “experts” have bankrupted the nation financially, morally and spiritually while enriching themselves and their privileged cronies. \\nPopulate your cabinet and administration with entrepreneurially minded, honest, hard working, forward-looking people who just happen to be African-American, Hispanic-American, Asian-American, female, gay, mixed-race, etc. \\nHaving a cabinet that reflects the diversity of America (or just the diversity of New York City or Los Angeles County, for goodness sakes) will send a powerful message not just to the nation but to the world: America’s diversity is America’s strength. \\nIf you want an example of how to do this, follow in the footsteps of the U.S. military. Yes, it’s imperfect, but for a large-scale voluntary institution, it’s done a lot better than most to promote a diverse spectrum of Americans. \\n2. Wage total war on regulatory capture and bureaucratic fiefdoms. Everyone knows federal regulations are completely out of control on several fronts. Yes, there is a need for regulations to protect the nation’s air, water and resources from despoliation, its labor force from exploitation, its food supply from unhealthy additives and foreign-sourced toxic products, and so on. These safeguard regulations should be rigorously enforced. \\nBut K Street lobbyists and the Corporatocracy they represent have mastered the art of regulatory capture : digging regulatory moats so deep and so wide that competition cannot possibly afford to meet the regulatory burdens imposed by the central state. \\nThis is how we’ve ended up with a high-cost, ineffective, inefficient state-cartel economy. \\nThe only way to tackle this issue is retire/sunset ALL federal regulations every few years, and require a constant streamlining to limit the number of regulations, lower the cost of compliance and ensure regulations are clearly composed in plain English. \\nThe only way to root out corruption, collusion and regulatory capture is to require total transparency and open competition in all government functions. \\n3. Accredit the student, not the school/college. America’s education system is unaffordable and failing for one simple reason: we accredit the school/college, not the student’s knowledge/skill. The inevitable result of this is a cartel of self-serving fiefdoms with soaring costs which routinely graduates students who have learned essentially zero of productive value in the emerging economy. \\nI have described this in my book The Nearly Free University and the Emerging Economy: The Revolution in Higher Education . \\nBy accrediting the student’s knowledge/skill, we would be testing and accrediting what actually matters. By eliminating the central-planning accreditation racket of schools/colleges, we would take away the power of this cartel to relentlessly strip-mine taxpayers and students while providing ineffectual near-zero-market-value education. \\nThe only way to make America great again is to increase productivity via distributing higher level skills across the entire populace. The current education complex has failed and the only way to truly reform it is to accredit the student, not the school/college. \\n4. Promote decentralized, bottoms-up localized solutions rather than top-down centralized programs. As I discussed in Now That the Presidential-Election Side Show Is Finally Ending…. , the current mode of production is a legacy of World War II, when the federal government took complete centralized control of the U.S. economy and society. \\nThe war’s success led to the fatal assumption that the solution to every problem was to aggregate more power in centralized bureaucracies. \\nWhat worked in the cartel-state economy of 1945 is now failing, with catastrophic consequences. Decentralized transparent networks that share a wealth of solutions and offer localized participation are not only more cost-effective, they enable the blossoming of 10,000 solutions rather than smother the economy with a bloated centralized system that imposes crushing costs on the nation (think ObamaCare, which burdens healthcare with thousands of pages of costly regulatory requirements) while squelching local solutions. \\nAmerica is an increasingly diverse nation. What sort of insanity is it to reckon that one centralized bureaucracy can come up a single system that works well for every community and household? \\nReplace the mindset that the “solution” must be a centralized, top-down, bloated, unaffordable bureaucracy with the understanding that centralized, top-down, bloated, unaffordable bureaucracies are the problem, not the solution. \\n5. Lower the corporate income tax rate to a flat 5% for all domestic corporations. An incredible amount of precious capital is squandered on tax avoidance schemes, and incredible sums of precious capital are being held overseas to avoid the absurdly perverse 35% U.S. corporate tax rate. \\nThis perverse set of incentives costs the nation, not just corporations. To those who wish to impose high taxes on all those evil greedy corporations–you can’t do it. There will always be loopholes overseas. \\nMake it difficult to make a profit and do business here, and business and profits will go elsewhere–and so will the jobs. Not liking this reality won’t change it. \\n6. Increase the security of America’s work force and households by encouraging entrepreneurism and food/ energy/ manufacturing security in the local community economy. It’s essential that you hire people who understand the Digital-Industrial Revolution that is remaking the global economy, whether we like it or not. We all have daily experience of how this new mode of production is disrupting one sector of the old mode of production after another. \\nWe as a nation have to learn to do more with less –more productivity, more community-based security, more wealth that is earned by skilled labor and entrepreneurism, more broadly distributed ownership of wealth-producing assets, while consuming less energy and less capital and reducing the cost burdens imposed by self-serving fiefdoms, pay-to-play corruption/collusion and centralized sclerosis. \\nI lay out how to do this systemically in my book A Radically Beneficial World: Automation, Technology and Creating Jobs for All and on an individual/household basis in Get a Job, Build a Real Career and Defy a Bewildering Economy . \\n7. Dismantle the corrosive sense of entitlement that has infected the nation. Obsessing over illusory “rights” and “what we were promised” leads to a politics of resentment and a corollary obsession with get-rich-quick schemes and avoiding the dirty work of actually building wealth rather than skimming and scamming asset bubbles. \\nThe way to dismantle the dead-end ideology of entitlement is to promote earning, not getting, and learning real, practical, marketable skills that have value in the emerging economy. \\nNobody owes anyone anything but the right to pursue happiness and the civil liberties stated in the Bill of Rights. To survive, much less prosper, we need a society and economy based on accountability and the willingness to do the dirty work, the nitty-gritty work, of making sure goods and services actually work, and to reward those doing the hard work with security and opportunities to take ownership of the engines of wealth creation. \\nPresident-Elect Trump, more policy tweaks, more promises of more government free money and more symbolic gestures won’t fix anything. You must dig out the rot in our system of governance, destroy needless and burdensome state-cartel-imposed costs and encourage transparency, competition, accountability and locally based community-economy solutions. \\nThanks to Chad D. and Cindy F. for suggesting that I draw up a list of recommendations for the President-Elect. This entry was posted in General and tagged President-Elect Trump . Bookmark the permalink . ← Veterans Day is typical .01% rogue state inversion to ‘honor’ duped military ‘serving’ forever lie-started illegal Wars of Aggression. Truly thank Veterans by demanding arrests of US ‘leaders’ who treasoned them to attack, invade, occupy victims of Empire jrrrr \\nActually diversity is meaningless, as every problem, experienced by every human being on the planet, is resolved by “accurate thought,” not a diversity of either physical differences or opinions. tom \\nI think we all understand that diversity, in this situation, would be mostly a cosmetic measure to reduce discontent among the governed. While ability is certainly the most important criterion, if able people from diverse backgrounds can be found, so much the better. Scoot Wad \\nYeah more diversity, yay. I have a feeling that Jewish Americans will be heavily overrepresented as usual, and likely referred to as white as usual when it suits their purpose. Maybe we can even have a foreign national Indian on the cabinet to represent all the high paying tech jobs those guest workers take from Americans like we have all of the dual Israelis in our government making decisions now. tom \\n“Nobody owes anyone anything but the right to pursue happiness and the civil liberties stated in the Bill of Rights”. \\nAnd the right to enjoy pensions and other benefits that have been paid for in full up front. Those are debts, plain and simple, and Uncle Sam is no more entitled to dodge his debts than anyone else. diogenes \\nIn the phrase “life, liberty and the pursuit of happiness” the word “life” means “livelihood,” ACCESS TO LIVELIEHOOD, not access to LIES. diogenes \\ndecrease the corporate tax rate \\nsigned'"}, "time": 1742628492.992239}