{"duration": 0.043317556381225586, "input_args": {"text": "'Swedish police revealed Sunday the Uzbekistan citizen suspected of driving a stolen lorry into crowds killing four on Friday was a rejected asylum seeker who was wanted for deportation. [The    man was due to be expelled from Sweden, reports the country’s   newspaper AftonBladet. Police commander Jonas Hysing told the paper “we do not know where they are, so we can not enforce expulsion” speaking of the many migrants who should be deported from the country but the government keeps no records of their whereabouts.  The officer also confirmed police were aware that the suspect had expressed an interest and sympathy for the Islamic State online. According to the report, the man applied for a residence permit in 2014, and that it took until 2016 for it to be rejected, with the Asylum board ruling he should be deported. Officers called at his registered address in February 2017 but found he didn’t live there. Two months later it is believed the suspect stole a delivery lorry and drove through crowds and then into a department store in Stockholm, killing four and injuring 15. One of those identified as having died in the attack was a British citizen. Another was Belgian, and two more were Swedish citizens. No identities other than nationalities have yet been made public. Breitbart London reports Sunday that the suspect travelled to Sweden to make money in the construction trade. A source said of the man “He just wanted to make money, that’s why he was in Sweden and worked as a construction worker. His wife and children still live abroad”. This is not the first time in recent history that a rejected asylum seeker due to be deported by the Swedish government has gone on to launch an attack against citizens in the country. Breitbart London reported on the Ikea attack in August 2015 where Eritrean migrant Abraham Ukbagabir took a packet of knives in the shop’s kitchenware department and stabbed two shoppers to death before attempting to kill himself. He later told investigators he struck because he wanted “revenge” against Sweden for having his asylum application rejected. Despite having been so keen to stay in Sweden in 2015, the killer has since complained he doesn’t like Swedish prisons and wants to be transferred to one in Eritrea.'"}, "time": 1742563274.2690222}