{"duration": 0.061255455017089844, "input_args": {"text": "'Comments \\n  has filed a federal complaint against FBI Director James Comey for the inappropriate partisan use of his official position as the leader our nation’s top federal law enforcement agency. Yesterday, FBI Comey issued a vaguely worded memo to Congressional Republicans about an email loosely linked toHillary Clinton, which House Republican Jason Chaffetz quickly used to punk the media on Twitter, leading to a swirl of false stories about Clinton and emails — most of which required corrections. \\nThe Department of Justice’s Office of Special Counsel is in charge of enforcing Hatch Act violations when federal employees like FBI Director Comey abuse their offices for political reasons. That’s where DCAT sent their harshly worded complaint: “This is an election year, and we are just 11 days away from the date that the American public votes to choose the next President of the United States, I am writing to ask that an investigation be opened into Director Comey for any potential violations of the Hatch Act. The timing of this announcement, accompanied by the vague facts of the investigation, seems as if Director Comey was making a political move, and not a professional one.” [text of complaint]   filed a complaint with the Department of Justice Office of Professional Responsibility on Friday against FBI Director James Comey for interfering in the Presidential election, following the FBI’s decision to open up an investigation into Secretary Clinton’s emails this close to Election Day. Federal employees are forbidden from participating in political activities under the Hatch Act. “It is absolutely absurd that FBI Director Comey would support Donald Trump like this with only 11 days to go before the election,” said Scott Dworkin, Senior Advisor to the Democratic Coalition Against Trump. “ It is an obvious attack from a lifelong Republican who used to serve in the Bush White House, just to undermine her campaign. Comey needs to focus on stopping terrorists and protecting America, not investigating our soon to be President-Elect Hillary Clinton.” Most federal employees are prohibited from engaging in partisan electioneering under federal law by “ An Act to Prevent Pernicious Political Activities,” otherwise known as the Hatch Act. It makes very narrow exceptions for partisan campaigning by the President, Vice President and a few designated high-ranking members of the Executive Branch of government. The FBI’s Director is not one of those exempt positions, and former Bush appointee James Comey’s vaguely worded memo to Congress reeks of partisan political interference to help fellow desperate Republicans at the end of a hotly contested general election.'"}, "time": 1742561836.6772873}