{"duration": 0.18686628341674805, "input_args": {"text": "'For the past 18 months, pregnant women have lived in fear as Zika, a virus they had never heard of, spread throughout much of the world leaving behind thousands of babies born with underdeveloped brains and other birth defects. Medical researchers are aggressively trying to develop a vaccine or treatment that is effective in stopping the virus or protecting fetuses in wombs if their mother gets Zika. The good news announced this week is that scientists have had encouraging results.\\nClinical Trials of a Vaccine The first of five clinical trials in humans to test the safety and effectiveness of a Zika vaccine began, according to a National Institutes of Health (NIH) announcement Monday. Called the Zika Purified Inactivated Virus (ZPIV), the vaccine was developed using inactivated virus particles. The basic shell of the particles is intact to the particles evoke a response from the recipient’s immune system creating more antibodies. This technology and approach was successfully used in developing a vaccine for Japanese encephalitis.\\nThe NIH trial involves 75 people between the ages of 18 and 49 who have not had any sort of flavivirus. (Zika is a flavivirus. So are dengue, Japanese encephalitis and West Nile.) Participants will be randomly split into three groups. The first will receive two injections of either the test vaccine or a placebo 28 days apart. The other two groups will get the Japanese encephalitis vaccine or a yellow fever vaccine prior to receiving the two-dose ZPIV vaccine. A subgroup of 30 participants will receive the two-dose a third dose of the vaccine being tested a year later.\\nThe NIH announced that four other trials involving the ZPIV investigational vaccine within months. These vaccine studies are being fast-tracked, but it will take a few years to know the results.\\nAntibody Tests While the NIH research deals with a vaccine against the virus, other research has been under way to protect fetuses from the virus. An antibody that prevents a fetus from becoming infected with the virus has been identified and tested in mice. It also prevents damage to the placenta. Lastly, the antibody appears to provide protection against the virus for adult mice. The research conducted by teams from the medical schools at Washington University in St. Louis, Mo., and Vanderbilt University in Nashville, Tenn., was published Monday in “Nature.”\\nThe research study in mice may not translate directly to humans. However, it suggests that scientists are on the right track studying antibodies from former Zika patients as a solution. The researchers actually screened 29 anti-Zika antibodies they gathered from people who recovered from the disease. One of them efficiently counteracted the five strains of the virus circulating worldwide in the lab tests. The antibodies identified “represent the first medical intervention that prevents Zika infection and damage to fetuses,” according to co-author James Crowe Jr., MD, of Vanderbilt.\\nTo test the antibody in live animals, the scientists gave it to pregnant mice either the day before or after being infected with Zika. In both instances, the antibodies successfully reduced the virus levels in the pregnant mice and their fetuses. They compared the results with those of pregnant mice infected with the disease but not given the antibody.\\nThe placentas seemed normal in the mice treated with the antibody, showing they were protected from the disease. In the untreated virus-infected mice, however, there was noticeable placental damage. “The anti-Zika antibodies are able to keep the fetus safe from harm by blocking the virus from crossing the placenta,” noted co-author Indira Mysorekar, PhD, a Washington University associate professor of obstetrics and gynecology.\\nWritten and Edited by Dyanne Weiss\\nSources:\\nNature: Neutralizing human antibodies prevent Zika virus replication and fetal disease in mice\\nWashington University School of Medicine: Antibody protects developing fetus from Zika virus, mouse study shows\\nNational Institutes of Health: Testing of Investigational inactivated Zika vaccine in humans begins\\nTIME: Zika Vaccines Are Growing More Promising\\nPhoto courtesy of NIH: National Institute of Allergy and Infectious Diseases – Creative Commons license microcephaly , Vaccine , Zika'"}, "time": 1742563922.0612636}