{"duration": 0.06134438514709473, "input_args": {"text": "'Email Print Pre-election “results” conditioning public to accept rigged Hillary “victory” A NBC station was caught posting election results showing a Hillary Clinton victory days before the election, fueling concerns that the mainstream media is conditioning the public to accept a rigged election favoring Hillary. Political activists discovered a hidden web site for WRCB out of Chattanooga, Tenn. showing election results with Hillary Clinton securing 343 electoral votes and 42% of the popular vote. The web site originated from the FTP server of WorldNow, a media software company that provides real-time data – such as election results – and other media assets to local news stations. The activist who found the page pointed out that the results align well with the “fractional vote” method used by voting machines to rig elections to a predetermined outcome. “On election day, you will see the same percentages overall, with only the numbers that claim to equal them different,” the activist reported. “The difference in total votes shown on the station pages, with the same overall final percentages proves the election theft is automated to hit desired percentages, no one has to lift a finger during the election itself to accomplish the steal.” Election fraud expert Bev Harris was the first to uncover this method, which is also known as “vote shaving.” “You need to have votes counted as fractions,” Harris said on The Alex Jones Show Monday. “You need the votes to be counted with decimal places, like you count money.” “If a vote is a dollar, you also need to have cents with it. That will not show. It’s hidden.” Vote shaving works by treating votes as decimals rather than whole numbers, which allows the machines to allocate the remaining fractional percentages elsewhere to sway election outcomes. “There’s this one central computer, which at the end of the day, all the votes come to it,” Harris pointed out. “That’s where you take it. You don’t run around to 5,000 different precincts. You wait until the votes come to you, and then you have your way with them.” And, interestingly, it appears the majority of the local news stations get their election results from the same software company. Skeptics suggested the WorldNow page was part of a code test to ensure the software would post the actual results, but surprisingly, the data on the page was typed in – with no apparent code tabulating anything. And it’s revealing that, more often than not, when the mainstream media “tests” election result software, it shows the establishment candidate winning the election. At the very least, the results page shows obvious media bias towards Hillary, and it follows a pattern by the mainstream media to claim Hillary has already won the election weeks before Nov. 8 in an attempt to suppress voter enthusiasm for Trump, which is one of his major advantages. This discovery comes amid Project Veritas’ damning videos exposing Democrat operatives discussing how they’ve been rigging elections for the last 50 years, as well as Wikileaks’ relentless data dumping of John Podesta’s emails revealing more collusion and corruption between the Clinton campaign and the mainstream media. WRCB could not be immediately reached for comment. \\nIf you haven’t checked out and liked our Facebook page, please go here and do so. Leave a comment... '"}, "time": 1742563360.4715004}