{"duration": 0.11096572875976562, "input_args": {"text": "'MELBOURNE, Fla.  —   Never let it be said that President Trump waits until the last minute. With just 1, 354 days until the next presidential election, Mr. Trump kicked off his   campaign here on Saturday with a boisterous,        rally that lacked only an opponent for him to run against. Gathering thousands of cheering supporters inside an airport hangar, Mr. Trump put aside the stress of Washington governing and returned to the campaign trail, where he reprised many of his   themes and lines from last year and drank in the adulation of the crowd. Buoyant and energized, he invited one fan onto the stage for a hug and even briefly turned over the microphone. “You’re all part of this incredible movement, this movement that we talk about so much, that’s been written about on the cover of every magazine all over the world,” Mr. Trump said in this Space Coast town 115 miles north of his    getaway. “It’s a moment that’s just sweeping, it’s sweeping across our country. It’s sweeping, frankly, across the globe. ” “People want to take back control of their countries,” he added, “and they want to take back control of their lives. ” With no Democratic challengers on the horizon  —   or anywhere near it  —   only a month after he took office, Mr. Trump focused instead on another favorite target, the news media, blaming journalists for any perception that his opening days in office have been less than smooth. “They have their own agenda, and their agenda is not your agenda,” he told the appreciative audience. “They could not defeat us in the primaries, and they could not defeat us in the general election, and we will continue to expose them for what they are, and most important, we will continue to win, win, win. ” He also assailed the appeals court judges who blocked his temporary travel ban, reading from a law granting the president wide discretion in setting immigration rules and chastising the court for not addressing it. He slammed Democrats for opposing his cabinet nominations vowed again to “drain the swamp” of Washington and promoted his   plans for overhauling the tax code, repealing and replacing the Affordable Care Act, and building roads and bridges. “This will be change for the ages, change like never before, to pursue real peace, real stability and real prosperity,” he said. “We want to secure our borders and protect our workers, to rebuild our military and our infrastructure, to fix our schools and restore safety to our neighborhoods. ” He boasted about the soaring stock market and said a new spirit was evident in the country. “It’s going to be a new day in America,” he said. “You’re going to be proud again. Jobs are already starting to pour back in. ” For anyone who has missed the buzz of the campaign trail, including, almost certainly, the victorious candidate, it was a blast from the    past. Vendors sold the signature “Make America Great Again” red baseball caps. Supporters cheerfully chanted “CNN sucks” and “drain the swamp. ” Familiar rally songs by Elton John, the Rolling Stones and other artists were blasted over the loudspeakers. Mr. Trump talked about winning and assured the crowd that they could “believe me. ” This time, though, he came with an extra prop  —   Air Force One. The power and prestige of the presidency is unmatched, and when the    plane rolled up next to the hangar to the theme song from the Harrison Ford movie “Air Force One,” the crowd, estimated by the local police to have numbered about 9, 000, exploded. The president and Melania Trump  —   who later introduced her husband with the Lord’s Prayer  —   emerged from the plane to Lee Greenwood’s “God Bless the U. S. A. ” Never mind that an administration official had told The Washington Post two days earlier that Air Force One would not be “used in the background as a prop. ” Mr. Trump was hardly the first president to do so. The difference is that most presidents are eager to appear to remain above politics for as long as possible. Mr. Trump, by contrast, filed his   papers on Inauguration Day. Asked by reporters on Air Force One as he flew here whether it was a little early to get back into campaign mode, he said: “Life is a campaign. Making our country great again is a campaign. For me, it’s a campaign to make America great again is absolutely a campaign. ” The fan Mr. Trump called onstage was Gene Huber, 47, of Boynton Beach, Fla. He was sitting directly in front of Mr. Trump, who said he had seen Mr. Huber speaking in support of him on television. At Mr. Trump’s invitation, Mr. Huber spoke at the lectern for about 40 seconds. In an interview on Saturday night, Mr. Huber, who grew up in Lake Ronkonkoma, on Long Island, said when Mr. Trump called him to the stage, “I was like, ‘Holy mackerel, this is happening. ’” Mr. Huber, a Republican who arrived for the rally at 4 a. m. said of Mr. Trump, “Everything he says, I know he’s going to do. ” It was clearly an energizing moment for a president who has shaken up Washington with a flurry of action on his campaign promises while absorbing significant setbacks. For all the enthusiasm in the hangar, Mr. Trump is struggling to win over the wider public. As of Friday, the Gallup poll put his approval rating at 38 percent, the lowest of any modern president so early in his tenure. Near the hangar, protesters yelled slogans and waved signs. At the end of his speech, Mr. Trump was clearly reading from prepared text as he talked about unity. “Let us move past the differences of party and find a new loyalty rooted deeply in our country,” he said. But he was at his most animated when in competitive mode. “We’re going to start winning again,” he said. “Believe me. ”'"}, "time": 1742562106.455723}