{"duration": 0.032689571380615234, "input_args": {"text": "\"Share on Twitter \\nIt's been just over one month since José Fernández and two of his friends, Emilio Jesus Macias and Eduardo Rivero, passed away in a boating accident during the early morning hours of September 25th. \\nAccording to reports , Fernández's boat was traveling at high speeds when it hit a jetty. Image Credit: Manny Hernandez/Getty Images \\nWhile initial reports indicated that alcohol was not a factor in the crash, it is now believed that the men were drinking the night of the accident. \\nAs the Miami Herald reports, the search warrant affidavit suggests that the diver could smell a “heavy” alcohol odor on Fernández and his friends. \\nThe last known picture taken of Fernández the night he died was outside the dockside bar American Social. Managers of the bar confirmed that Fernández and his two friends were there, but it's unknown if the men were drinking. \\nThe affidavit says that the driver of the vessel was driving with “recklessness” that was “exacerbated by the consumption of alcohol,” according to the Herald. And while toxicology reports have been completed, the report has not yet been released by investigators. Breaking: Jose Fernandez, companions had strong odor of alcohol after fatal crash https://t.co/KLmreMpv3n pic.twitter.com/BfcpBaXmAv — Miami Herald (@MiamiHerald) October 26, 2016 \\nThe Florida Fish and Wildlife Conservation Commission (FWC) says that it found a receipt for alcohol in one of the victims' pockets that was stamped the same date as the accident. The Miami Herald reported that the affidavit also states that the associate medical examiner who conducted the autopsies shows that all three men had water in the lungs and trauma consistent with a boat crash. \\nThe exact cause of death, however, was not mentioned. \\nIt also hasn't yet been confirmed who was driving the boat. Speaking with the Miami Herald, FWC spokesperson Lorenzo Veloz, says that he had been on Fernández’s boat “several times, but that Fernández had not been captain;” it's unknown how much experience Fernandez had captaining the boat. \\nThe affidavit states that the crimes being investigating are Boating Homicide While Intoxicated and Vessel Homicide. However, because all three men who were on the boat are deceased, it is unclear against whom charges could be brought. It is also unclear whether civil charges will be brought. \\nFernández's ashes have since been spread at sea, his favorite place to be: #JoseFernandez 's ashes scattered at site of boat accident. His mother says he wanted to be laid to rest at sea. #Fox35 pic.twitter.com/BU5MXWHJLk — LuAnne Sorrell (@luannesorrell) October 4, 2016 \\nHopefully, now that more information regarding the accident has been made available, the families, friends, and fans of the men on the boat can start finding closure. \\nAccording to the United States Coast Guard's recreational boating statistics , in 2014 there were over 4,000 boating accidents. Over 11 percent of those accidents occurred in Florida, and alcohol was the reason behind over 250 of the accidents. \\nFernández was seen as the future of major league baseball. At just 24 years old, Fernández had 76 career starts during his three years with the Miami Marlins, striking out over 500 of his opponents. He was well on his way to becoming one of the greats. \\nHe was also expecting a child with his girlfriend, Maria Arias: A photo posted by Jose Fernandez (@jofez16) on Sep 19, 2016 at 8:23pm PDT \\nHis legacy will live on through their unborn daughter , Penelope. \""}, "time": 1742628567.095216}