{"duration": 0.13840913772583008, "input_args": {"text": "'WASHINGTON  —   President Trump’s proposal on Thursday for deep cuts to the budgets of a broad part of the federal bureaucracy was billed as a   and necessary corrective to the growth of the government’s power. But even members of his own party questioned some of the cuts  —   and what was not being cut. The harshest criticism of Mr. Trump’s budget came from Democrats and liberal organizations. But in a city where many federal programs enjoy longstanding bipartisan support, some Republicans also assailed the president’s judgment. “While we have a responsibility to reduce our federal deficit, I am disappointed that many of the reductions and eliminations proposed in the president’s skinny budget are draconian, careless and counterproductive,” said Representative Harold Rogers, Republican of Kentucky and a former chairman of the House Appropriations Committee. “We will certainly review this budget proposal, but Congress ultimately has the power of the purse. ” The spending plan’s bottom line is roughly the same as in President Barack Obama’s last budget request, but it marks Mr. Trump’s first major attempt to dismantle what his aides dismissively call the “administrative state. ” The $1. 1 trillion spending plan envisions deep cuts to many government programs while leaving entitlement programs like Social Security untouched. It increases spending on the military and border security. Mr. Trump was elected on a promise to wage war against what he has frequently mocked as a bloated and ineffective federal work force, and he is betting that his first budget will help consolidate support by calling for a significant shift of resources away from established programs that aid the poor, the environment, foreigners and the arts. To those who object to deep cuts in those programs, Mick Mulvaney, the president’s budget director, had a blunt message on Thursday: What did you expect? He said that   programs had failed to help children in schools, that housing programs were “not well run,” that government health research had suffered “mission creep” and that grants to local communities “don’t do any good. ” Mr. Mulvaney waved aside questions about cuts to the United Nations, saying that they “should come as a surprise to no one who watched the campaign. ” And he said that the president made no apologies for eliminating the government’s efforts to curb climate change. “We’re not spending money on that anymore,” Mr. Mulvaney told reporters at the White House. “We consider that a waste of your money to go out and do that. ” The approach is a risky gamble for Mr. Trump, whose victory in November came in part by assembling a coalition that included   workers who rely on many of the programs that he now proposes to slash. For now, the president and his advisers appear willing to take that risk by casting the administration as better caretakers of taxpayers’ money. “We are trying to focus on both recipients of the money and the folks who give us the money in the first place,” Mr. Mulvaney said. If the president gets his way, funding for the environment, diplomacy, housing, health services and the arts will be cut 20 to 30 percent. In 19 cases, funding will be eliminated, including for the Appalachian Regional Commission, the Neighborhood Reinvestment Corporation and the Corporation for Public Broadcasting. Military spending would increase by $54 billion, a 10 percent rise, in 2018, in addition to a $30 billion increase in the current year. White House officials said steep cuts at the State Department and increases in the military budget would refocus the United States away from helping other nations, sending a message that Mr. Trump intends to make greater use of “hard power” around the globe. They also said the president’s budget would increase resources for military veterans. Military supporters praised Mr. Trump for beginning what they believe is a needed rebuilding of the armed forces, though several key lawmakers said that even his proposed increase would not be enough for a military that they say is too small and unprepared to meet modern threats. Conservatives hailed his vision as an antidote to decades of bureaucratic growth even as they predicted fierce resistance from the interest groups and lawmakers with deep links to the affected agencies and the beneficiaries of the programs that will see their budgets slashed. “That sound you hear from Washington, D. C. this morning is the weeping and gnashing of teeth from bureaucrats and politicians who have built the federal government into an industry on the backs of taxpayers,” said David McIntosh, the president of the Club for Growth, a conservative   advocacy group. Reaction to Mr. Trump’s budget proposal came in a flurry of angry statements on Thursday morning as various other groups began preparing their lobbying campaigns to block the president’s plan in Congress. Christine Owens, the executive director of the National Employment Law Project, called the proposed cuts to the Labor Department a “draconian” budget that “is virtually a complete breach of faith with America’s workers. ” Amnesty International called the cuts to foreign aid “shameful” and predicted “global consequences. ” The Union of Concerned Scientists said cuts to scientific programs were “antiquated ideas and misguided science, which will hurt our economy, kill jobs, make us less safe. ” The American Library Association said that eliminating federal funds for libraries was “counterproductive and shortsighted. ” Randi Weingarten, the president of the American Federation of Teachers, said, “This budget takes a meat cleaver to public education. ” Environmental activists criticized Mr. Trump’s priorities. Michael Brune, the executive director of the Sierra Club, said that “the only thing that matters in his America is corporate polluters’ profits and Wall Street billionaires. ” “If Trump refuses to be serious about protecting our health and climate, or our publicly owned lands, then Congress must act, do its job and reject this rigged budget,” Mr. Brune said. For Mr. Trump, the complaints from nearly all quarters may serve to amplify his image as an outsider who is not beholden to the special interests in Washington. That could help the White House pressure Republican lawmakers to embrace his vision for a spending plan. But the early reaction from members of his party on Capitol Hill was muted at best, reflecting in part the discomfort among many of the party’s leaders with a budget that makes no progress on tackling the growth of entitlements. Senator Rob Portman, Republican of Ohio, criticized Mr. Trump’s decision to cut $300 million from a program that aims to protect Lake Erie. “I have long championed this program,” Mr. Portman said, “and I’m committed to continuing to do everything I can to protect and preserve Lake Erie, including preserving this critical program and its funding. ” Speaker Paul D. Ryan, who has long asserted a need to overhaul entitlement programs as a means to fiscal discipline for the federal government, told reporters that he was “encouraged” by the proposed increases in military spending but said little else about the contents of the budget blueprint. Earlier in the day, Mr. Ryan issued a statement saying he was “determined to work with the administration to shrink the size of government, grow our economy, secure our borders and ensure our troops have the tools necessary to complete their missions. ” He did not address any of the proposed cuts. Senator Mike Lee, Republican of Utah, called Mr. Trump’s budget proposal “a solid step toward addressing the gross overspending that is driving our national debt. ” He said the president should be “commended” for making some tough calls. He did not pledge to support Mr. Trump’s spending plan, however, adding that he looked forward to working with his congressional colleagues “to craft and pass a balanced, fiscally sound budget in the coming months. ”'"}, "time": 1742563757.6061633}