{"duration": 0.0903024673461914, "input_args": {"text": "'Vin Scully will conclude his   run as the voice of the Dodgers on Oct. 2 in a game against the Giants at ATT Park in San Francisco. But it should be more than a local event for Scully’s fans in the Los Angeles area. When baseball’s greatest announcer retires, it is a national occasion. It will be up to to TBS, Major League Baseball’s partner for Sunday afternoon broadcasts, to bring the last of Scully to the rest of the country. TBS is not saying what it will do, and the network will not decide which matchup to televise until seven to 10 days beforehand. Simulcasting the   game should be the easy choice. Not only is Scully leaving, but the game may very well have playoff implications. But it is not the only viable possibility for TBS. David Ortiz, the Boston Red Sox’ designated hitter, is retiring after the season, and the   race in the American League East could be decided that day. TBS may see still other possibilities: All games on the final day of the regular season start a little after 3 p. m. Eastern, so the   and   games might entice the network. TBS produces all its games and is not accustomed to picking up a local simulcast. But this is an unusual occasion, and the necessary permissions from Major League Baseball and SportsNet LA, the Dodgers’ network, would most likely be granted quickly. Assuming approval was given, TBS could carry the Scully game and cut to Boston whenever Ortiz was batting. If TBS takes the Ortiz broadcast, one of baseball’s other national partners ought to get the O. K. to pick up the Scully game. But ESPN will be showing W. N. B. A. playoff games, ESPN2 has a college football special and an edition of “E:60” scheduled, and FS1 has committed to an N. H. R. A. race. If neither can, or wants to, get out of its commitment, MLB Network should abandon its plan to cut among the 15 games being played and give viewers a final three hours or so with Scully. What would be more appropriate for an   channel than to change its plans for Scully? When Ernie Harwell retired in 2002 after 42 years as the voice of the Detroit Tigers, his farewell game from Toronto was televised in the two teams’ local markets, even though his finale was, like Scully’s, worthy of a national platform. Harwell is in the baseball announcing pantheon with Scully, Red Barber, Mel Allen and a few others. Harwell was 84 at the time, four years younger than Scully is today, and knew he could continue. His vigor, joy and stamina were evident that day as he greeted players and fans, signed autographs and ran up the steps of the visitors’ dugout. But Harwell told me that the time was right. “I could go on for another four or five years,” he said. “I have the enthusiasm and the health. But you have to draw the line. No second guesses. I don’t want to be one of the guys who comes back four or five times. ” In his final signoff, Harwell told his listeners: “Thank you for sneaking your transistor under the pillow as you grew up loving the Tigers. God has a new adventure for me. ” He died almost eight years later, at 92. In a recent interview on TBS with Cal Ripken Jr. Scully said: “I’m not saying goodbye as much as I’m celebrating Thanksgiving. I’m so fortunate to be doing this since I’ve been a very young fellow. I have nothing to be sad about. ” Many of his fans have been aggrieved since 2014 by their inability to watch him on SportsNet LA, which has been blacked out in a majority of the team’s home market because of a pricing dispute. Many knew that Scully would not be broadcasting much longer and wanted to hear him narrate Dodgers games until his final out. And they could have reasonably believed that they would miss his parting words. But on Friday, Charter Communications, which assumed the onerous SportsNet LA contract when it acquired Time Warner Cable this year, announced that Scully’s final six games (Sept. 23 to 25 and Sept. 30 to Oct. 2) would be simulcast on KTLA, a local broadcast station. It is a gesture that recognizes Scully’s importance, but it comes after too much time without him has passed for his fans. It is possible that Scully’s Oct. 2 game will not be his last. If the Dodgers play in the postseason, Scully could be on the local radio call. “We’ll let him do what’s most comfortable,” said Erik Braverman, the Dodgers’ vice president for marketing and broadcasting. “If he says he wants to do postseason, he’ll do postseason. ”'"}, "time": 1742561835.9683645}