{"duration": 0.07056260108947754, "input_args": {"text": "'Actor James Woods had a message for Planned Parenthood president and CEO Cecile Richards after she tweeted a Mother’s Day message of her own. [Richards, who testified before Congress that “abortion is health care,” tweeted Sunday:  Nothing says ”I love you, Mom!” like standing up for the right of mothers everywhere to get the care they need. https:  .   —   Cecile Richards (@CecileRichards) May 14, 2017,  Woods, a practicing Roman Catholic and conservative, responded to Richards: Hard to say ”I love you, Mom” from a medical waste dumpster  …     #DefundPP https:  .   —   James Woods (@RealJamesWoods) May 15, 2017,  And, as it turns out, many tweeted in response to Woods’s slam against the nation’s largest abortion vendor: @RealJamesWoods Her sentiment might mean something if PP actually provided healthcare for women, other than abortions. Which isn’t healthcare at all.  —   Sherry (@staylorwrite4) May 15, 2017,  @Nimz105 @staylorwrite4 Outstanding.  Like selling aborted baby parts like a chop shop. We’ve seen the hidden cameras revealing the truth. Can’t change facts.  —   John Porter (@John_Porter601) May 15, 2017,  @Nimz105 @staylorwrite4 I would love to visit your local PP Abortion factory. Can I bring state medical inspectors? Auditors? It would be a blast!  —   Josey Wales (@josephwales911) May 15, 2017,  Late last week, the Kardashian sisters also visited Planned Parenthood’s clinic in West Los Angeles: My sisters  I visited Planned Parenthood  learned so much! They are such an amazing place that provides so much to so many! #istandwithpp pic. twitter.   —   Kim Kardashian West (@KimKardashian) May 13, 2017,    organization Live Action has produced a video that utilizes Planned Parenthood’s annual reports to show the actual decline in its healthcare services, while abortions have increased. “Over the last six years, Planned Parenthood’s annual clientele has dropped half a million clients,” Live Action reports in the video. “And over the last ten years reported, Planned Parenthood has shut down over 200 facilities. ” The video adds that over the last ten years, Planned Parenthood’s annual breast exams have declined 60 percent, leaving the group with less than two percent of breast exams performed in the United States. Additionally, the group’s annual Pap tests have decreased 77 percent, resulting in a current market share of less than one percent of these procedures. Similarly, Planned Parenthood’s annual cancer screenings have reportedly decreased 68 percent, an outcome that leaves the group with less than two percent of U. S. cancer screenings performed for women. “However, Planned Parenthood’s annual abortions have increased 27 percent,” observes Live Action, noting the group performs 34. 9 percent of abortions in the nation. Despite the stark decline in services other than abortions, Planned Parenthood’s government funding has more than doubled, from $272 million to $553 million, with the group claiming taxpayer funding is not used to pay for abortions. Maybe not so safe for the future generation  …     pic. twitter.   —   James Woods (@RealJamesWoods) April 17, 2017, '"}, "time": 1742563923.4574907}