{"duration": 0.17524123191833496, "input_args": {"text": "'Hillary Indicted-Paul Ryan to be President-Here’s How \\n\\nI have written three times that Paul Ryan will be President. The globalists are split but Plan B has been initiated. Paul Ryan has been in the hip pocket of the globalists all along. He supports a border-less America and is a fervent supporter of the Free Trade Agreements. He is a wannabe member of the criminal elite. He is, and has always been the Plan B for the Global Elite. Paul Ryan filed paperwork to run for President in January of 2016 Paul Ryan released the Trump locker-room tapes in act of Benedict Arnold type of betrayal. With 10 days left to the general election, she will not be indicted before the election. Even if her popular support goes south, she will still win because of the tampering with the electoral college by the Soros and the Clinton Foundation. Soros has his voting machines in 16 states, some of them are key battleground states. Hillary will win even if she only gets 20% of the vote and that is where this is headed. Ever die-hard Democrats can no longer stay of the good ship Witchcraft. Hillary will never board Air Force One, maybe Broomstick One, but not Air Force One. She will be elected but indicted before the inauguration. Kaine, the Democratic VP candidate and Hillary will be knocked out of contention when Hillary is indicted. AND WHO IS NEXT IN THE LINE OF SUCCESSION? IT IS THE SPEAKER OF THE HOUSE, PAUL “RAT” RYAN. THAT’S WHO. I HATE TO SAY I TOLD YOU SO, BUT I HAVE BEEN SAYING SINCE APRIL THAT PAUL RYAN WOULD BECOME PRESIDENT. \\nWhat Do the Globalists Gain by Following this Course of Action? \\nIf Paul Ryan ascends to the Presidency, it will be business as usual for the criminal elite. The TPP will pass and they will get their war with Russia. Further, America will be on the path of destruction courtesy of this elite wannabe, Paul Ryan \\nPerhaps the biggest advantage that the globalists will enjoy will the fact that they can minimize resistance. Let’s face it, that when it comes to politics and current events, half of the country is dumber than a box of rocks. These people will see this as a victory over the unpopular Clinton. However, at the end of the day, Clinton or Ryan, it does not make a bit of difference!!! \\nI just got word that the Clinton Foundation is under IRS investigation as well. Look for the Clinton empire to launch a series of false flag attacks now that they realize that the end is coming for this modern day version of Bonnie and Clyde. \\nSupporting documentation follows? This Has Been a Set Up Since the Beginning: Paul Ryan Is Responsible for the Release of the Trump Tape \\nAlex Jones made a very compelling case that Paul Ryan’s top aide, Dan Senor, was behind the leaking of the Bush tape in which Trump is heard to make several lewd remarks about women. \\nFrom Info Wars : \\n“That’s the story swirling around the Internet after Senor’s wife, former NBC reporter Campbell Brown, appeared to confirm the claim. \\nBrown quoted a tweet that said, “Rumblings that Campbell Brown and Dan Senor are behind the Trump tape leak,” and then responded, “Yep. Still having fun after all these years. Key to a happy marriage.” \\nA similar story released by WND confirms Info Wars claim that Dan Senor leaked the Trump tape in an obvious attempt to sink the Trump campaign. \\nAfter reviewing the Info Wars, WND and other similar claims, there is little doubt that Paul Ryan deliberately sabotaged Donald Trump’s campaign. But why? Why would a prominent Republican sabotage the campaign of the Republican nominee? Well, it is for the same reason that anyone engages in treason, for personal profit. Paul Ryan Is Aligned With Clinton and Obama, Making Him a Globalist Favorite \\nPaul Ryan has doing his best to help Hillary Clinton defeat Donald Trump. In fact, with encouragement from Ryan, through his very shallow endorsement of Donald Trump. It is becoming a distinct possibility that Trump may not be the nominee when the election finally takes place. \\nThere is no way that the establishment and their minions can afford to have a Trump Presidency. This means that in order to dump Trump, the globalists must create a world where up is down and down is up, white is black and black is white. To some degree, the “tape” has accomplished this. \\nPaul Ryan, much to the detriment of the American people, is where is he is at today because he was willing to ignore the following as if they did not exist: The free trade agreements which have caused the loss of millions of American jobs so that manufacturers could send millions of jobs offshore to cheap foreign labor markets and then turn around and ship these products back into the United States tax free. Trump has pledged to stop this. Ignore the illegal alien crisis which continues to undercut the wages of the working class, thus leading to much lower salaries and higher unemployment for American workers. Support Obamacare and its provision which forces employers to purchase Obamacare medical insurance for its full time employees. This has greatly added to the demise of small businesses. The undermining of American national security through the admission of UNSCREENED Muslims to America. Supporting former Secretary of State Hillary Clinton led State Department policy which protects certain Mosques and Muslims with extreme terrorist ties such as what we saw with Omar Mateen. Ryan is complicit in allowing the same chaos that is destroying Europe with UNSCREENED Muslim immigration, to come to America and destroy this country. His failure to oppose should be construed as tacit support. This attitude has given rise to the attitude that it is acceptable for these Refugee/Resettlement immigrants to support Sharia Law over our Constitutional law. \\nTrump is on the record as opposing each and everyone of the above policies which are destroying America. Most Americans support Trump in this endeavor of putting America first and Making America Great Again ! However, most of Congress is on the take and avail themselves to what should be illegal bribery through corporate campaign contributions. In order to keep the gravy train rolling, politicians, like Paul Ryan, are willing forsake their Constitutional oath and oppose Trump’s pro-Constitutional stand on these issues. In fact, Ryan is of such low moral character that he is even willing to destroy the GOP in order to preserve the criminal status quo, while he receives blood money from the corporations, as evidenced by his release of the Trump tape. The Silver Bullet \\nHere is the proof that Ryan is eligible to run for President. \\n\\nFrom the Federal Election Commission website: \\nFEC FORM 1'"}, "time": 1742628538.9063158}