{"duration": 0.11311912536621094, "input_args": {"text": "'During a March 10, 2015 press conference meant to address the growing controversy surrounding her private email server, Hillary Clinton famously claimed the emails she deleted were “within the scope of my personal privacy”  —   including messages about her yoga routines, family vacations and her daughter Chelsea’s wedding. [On Thursday, the State Department released 371 emails from the batch of about 15, 000 that were reportedly uncovered during an FBI investigation of Clinton’s server.  Among the newly released correspondence was a message about Clinton’s yoga, with the email in question also involving the transmission of a secure document.  The message citing yoga, dated February 12, 2010, was sent to Clinton by her top aide Huma Abedin. Typed in lower case letters, the email stated: “i am going to have the secure document from jake faxed to the house while you do yoga. also, i am getting (redacted) tomorrow in case we land sunday and have to go straight to work right now she is coming at 1 pm. ” Clinton responded, “Ok. Pls have secure stuff faxed to justin. ” “Yes, I connected with him,” Abedin replied. Below is a screenshot grab of the email: Clinton was known to have had a secure fax machine at her house. The newly released email was not necessarily deleted by Clinton. The Hill reported on the most recent batch of released emails from the 15, 000 uncovered by the FBI: Many of the documents  —   consisting of about 1, 031 pages  —   are “near duplicates” of documents Clinton provided to the State Department in 2014 and have already been made public, according to the agency.   …    Clinton deleted about 30, 000 emails from the private server she used while secretary of State, saying they were not   before turning over thousands more to the government. But during its examination, the FBI recovered some additional emails that could be relevant to the FOIA lawsuit. A preliminary review of the 15, 000 emails revealed that about 60 percent were of a purely personal nature. Around 37 percent  —   or 5, 600 documents  —   were deemed   but of those, a “substantial number” were exact duplicates of the 30, 000 emails that Clinton turned over to the agency in December 2014, according to State Department lawyers. This is not the first Clinton email to be made public that involves yoga. A September 3, 2009 email posted on WikiLeaks was titled “Yoga” and contained a list of times  —    seemingly for yoga classes. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. With research by Joshua Klein.'"}, "time": 1742563734.701728}