{"duration": 0.17476177215576172, "input_args": {"text": "'Let’s see. Last thing she remembered was their beautiful bodies grinding up in that club. Drunk  —   as she sang in 2013 of a gritty tryst with her husband  —   in love. Oh well. On Saturday night, Beyoncé walked the streets of a soundstage with a baseball bat, treating parked cars and police surveillance cameras like piñatas, “jealous and crazy,” but in an elaborate   dress fit for Fat Tuesday. It didn’t feel any more disjunctive than seeing Suzanne Lenglen rush the net in a   dress in say, 1916. Except the woman at this net also has a bone to pick with her spouse, Jay Z. This was “Lemonade,” a “visual album” and array of salvos, which tells the story of woman in a marriage she didn’t know was bad, until, of course, she knew. Beyoncé, and HBO, were shrewd about keeping a lid on what this thing was going to be. Based on the only available image  —   someone in cornrows, face disguised by a big fur coat  —   I assumed drag queen prison drama. But it was bolder and deeper and more uncomfortable than anything I could have predicted. “Lemonade” is less a dramatization than a daydream, infused with black magic, embracing  —   if only notionally  —   African tribalism, science fiction, menstruation and witchcraft. The music’s emotional odyssey is conjugal. (The song chapters are presented as stages  —   “intuition,” “denial,” “forgiveness,” “hope,” etc.) Most of the corresponding images commune with the psyche and with history. The Deep South  —   New Orleans, mostly  —   occupies the landscape. Throughout, black women are standing, sitting, phalanxed on the porches of what feel like plantations and antiquated houses, rich with pain. The cameras get in close on beautiful faces that lack pigment, that bear scars, burns and sorrow. The mothers of slain young men exude regal stoicism, holding photographs of their sons. Visually, “Lemonade” invokes a lot  —   Madonna’s “La Isla Bonita,” “Carrie,” “Beasts of the Southern Wild” and the   at the end of Michael Jackson’s “Black or White. ” But what its   spiritualism calls to mind is “Daughters of the Dust,” Julie Dash’s landmark tone poem from 1991, loosely  —   very loosely  —   about three generations, descended from slavery, and their migration north in 1902. The juicy immediacy of “Lemonade” is what this one man did to this one woman. Not far in, Beyoncé looks tearfully into the camera and, with her own song playing around her (“I pray you catch me,” she sings to a higher power) lets herself fall from a roof. The street below becomes a body of water. It complements the submerged churning all over the soundtrack. It has the effect of a leviathan astir. That interlude with a baseball bat begins with Beyoncé, in that yellow dress, throwing open the enormous doors of an old,   building and a deluge pouring out. “Are you cheating on me?” she asks in the running offscreen narration that’s credited to the young   poet Warsan Shire. It’s like something out of Toni Morrison. The water on her rage just broke. “Ring the alarm,” Beyoncé once sang of being   before enumerating the stuff of hers this other woman would never touch. On a different occasion, she sang: “To the left, to the left. Everything you own in the box to the left. ” That all feels pedestrian now. Beyoncé’s prized possessions here are her trust, love and dignity. But she’s daring to think beyond herself. The heavy hangover of the piece involves what lots of men have done to lots of women, black women in particular. Between songs, we hear Malcolm X intone that no one has had it rougher than they have. Think about what it takes to make lemonade. You have to split open a lot of citrus, remove the seeds, strain for pulp and add a lot of sugar. It’s a process. Black women are good at lemonade. I watched this thing in a state of exhilarated shock. At first, I thought: How is this not a work of pretentious  ? How isn’t this the mistake of the year? This is a woman who, in 2011, seemed incapable of gauging both the marketplace and what it wanted from her. She couldn’t choose a good single from her uniformly superb album “4. ” The surprise release of “Beyoncé,” at the end of 2013, was a major course correction. It cratered the Internet in a way that seemed to unify a   pop universe. Carnal, reflective, almost platitude free: It was the best and most creatively adventurous of her albums. The arrival of that record, the debut of a video for “Formation” last Super Bowl eve and the premiere of “Lemonade” have put her atop the      complex in a way that rivals Madonna, Janet and Michael Jackson. “Lemonade” has all of the formal coherence that kept “Formation” from being as good a video as it was a cultural bombshell. Its seven credited directors  —   Jonas Akerlund, Kahlil Joseph, Melina Matsoukas, Dikayl Rimmasch, Mark Romanek, Todd Tourso and Beyoncé  —   give this project texture, mystery and life. Restraint, too. The only memorable dancing is by the world’s greatest living female athlete: Serena Williams, a tennis player. And all of that opacity  —   the sense from her previous special that no matter how much Beyoncé talks, she isn’t telling you anything? That doesn’t exist here. Feelings gush like water. The piece opens with Beyoncé kneeling on a stage, a curtain behind her. She’s getting out in front of the drama. Her so doing puts everybody in a compromising position. Beyoncé and Jay Z have made room for a different third party: us. Last week, HBO showed “Confirmation,” which   a different fight between a black woman and a black man. In one corner, Anita Hill in the other, Clarence Thomas. It was never a fair fight. He manages to wrest all the power from her side of the story. “Lemonade” feels like a cultural rebuke on behalf of lots of aching women, whether they’re standing on that plantation porch, watching from their living rooms, or running for president. The queasiest part of “Drunk in Love” comes when Jay Z raps, “Eat the cake, Anna Mae,” invoking a diner scene from “What’s Love Got to Do With It” when Ike (using Tina’s birth name) shoves dessert in her face. Is “Lemonade” a rebuke of that, too? Why not? Any wife who outs her husband on an album and in an hourlong video as a cheater, then makes him release that album on his streaming platform  —   exclusively  —   is having her cake and making him eat it, too. That feels only partially triumphant since we’re left in a moral murk. He might be paying for his sins. But we’re still paying him.'"}, "time": 1742562292.8660524}