{"duration": 0.03816580772399902, "input_args": {"text": "'The CEO of outdoor clothing giant Patagonia is burnishing her   bona fides again, this time saying she intends to pledge her entire company to the “resistance” of President Donald Trump. [Patagonia CEO Rose Marcario recently attacked President Trump for his statements about rolling back President Obama’s unusually aggressive campaign of confiscating millions of acres of state lands and claiming them as “national monuments. ”  “We have to fight like hell to keep every inch of public land,” Marcario said in a May article at Huffpost. “I don’t have a lot of faith in politics and politicians right now. ” In an effort to prevent citizens from retaking possession of their state lands, one of her immediate actions will be to sue the Trump administration for its efforts to scale back Obama’s unprecedented land grab. “A president does not have the authority to rescind a national monument,” Marcario said in an April 26 statement after Trump announced his national monuments order. “An attempt to change the boundaries ignores the review process of cultural and historical characteristics and the public input. ” In particular, the Trump administration is preparing to revisit Obama’s order to create the Bears Ears National Monument. In April, Trump issued an executive order requiring the Department of the Interior to review Obama’s actions on national monuments. Ordering Interior Secretary Ray Zinke to review Obama’s policies in April, President Trump called Obama’s move an “egregious abuse of federal power. ” Many state governments fully agree with Trump’s assessment and were furious when Obama swooped in from Washington and stole away millions of acres of land from state control to create new national monuments and parks. A poll of residents of Utah, for instance, showed that 60 percent opposed Obama’s land grab, while only 33 percent supported it. Along with the possible lawsuit, Marcario said Patagonia would use its profits to back   candidates in states throughout the West. This is far from the first time the sportswear company pledged its profits to political matters. Last year, the   company spent over $1 million for a     campaign to defeat Donald Trump and Republicans. But, despite its acclaimed   activism, Patagonia has a troubled history of its own, having been tied to human trafficking and child labor in its supply chain. Follow Warner Todd Huston on Twitter @warnerthuston, or email the author at igcolonel@hotmail. com.'"}, "time": 1742562099.1162765}