{"duration": 0.04793119430541992, "input_args": {"text": "'Donald J. Trump left little doubt on Monday that he intends to run on the same proposals on immigration and terrorism that animated his primary campaign, using his first speech after the massacre in Orlando, Fla. to propose sweeping measures against Muslims that pay little heed to American traditions of pluralism. Without distinguishing between mainstream Muslims and Islamist terrorists, Mr. Trump suggested that all Muslim immigrants posed potential threats to America’s security and called for a ban on migrants from any part of the world with “a proven history of terrorism” against the United States or its allies. He also insinuated that American Muslims were all but complicit in acts of domestic terrorism for failing to report attacks in advance, asserting without evidence that they had warnings of shootings like the one in Orlando. Mr. Trump’s speech, delivered at St. Anselm College in Manchester, N. H. represented an extraordinary break from the longstanding rhetorical norms of American presidential nominees. But if his language more closely resembled a European nationalist’s than a mainstream Republican’s, he was wagering that voters are stirred more by their fears of Islamic terrorism than any concerns they may have about his flouting traditions of tolerance and respect for religious diversity. Mr. Trump, who drew criticism last fall, including a sharp rebuke from House Speaker Paul D. Ryan, for first suggesting a constitutionally questionable ban on Muslim immigration, on Monday described Islamic extremism as a pervasive global menace that was penetrating the United States through unchecked immigration. Citing the Boston Marathon bombing in 2013 by two men with ties to Chechnya and instances of radicalization in Minnesota’s Somali immigrant community, Mr. Trump painted a bleak portrait of the country as under siege from within and abroad. “They’re trying to take over our children and convince them how wonderful ISIS is and how wonderful Islam is,” Mr. Trump said, referring to the Islamic State. “And we don’t know what’s happening. ” He accused American Muslims of failing to “turn in the people who they know are bad,” effectively blaming other Muslims for the shooting in Orlando and the attack last year in San Bernardino, Calif. that was carried out by a married couple inspired by the Islamic State. “They didn’t turn them in,” Mr. Trump said, “and we had death and destruction. ” Mr. Trump carefully read his remarks from a teleprompter and offered more detail than his stump speeches generally contain, but his speech was still rife with the sort of misstatements and exaggerations that have typified his campaign. He repeatedly stretched the facts, for example, in describing the United States as overrun by dangerous migrants. He claimed the country has an “immigration system which does not permit us to know who we let into our country,” brushing aside the entire customs and immigration enforcement infrastructure. And he asserted that there was a “tremendous flow” of Syrian refugees, when just 2, 805 of them were admitted into the country from October to May, fewer than   of the 10, 000 Syrians President Obama said the United States would accept this fiscal year. Mr. Trump described the gunman in the Orlando shooting as “an Afghan,” though he was born an American citizen in New York City to parents who had emigrated from Afghanistan to the United States over three decades ago. Mr. Trump assailed the presumptive Democratic nominee, Hillary Clinton, accusing her of favoring immigration policies that would invite a flood of potential jihadists to the United States, which he warned could be “a better, bigger, more horrible version than the legendary Trojan Horse ever was. ” Mrs. Clinton, speaking in Cleveland earlier in the day, argued that engaging in “inflammatory,   rhetoric” made the country less safe. Delivering the sort of conventional speech that most presidential contenders would offer in the wake of tragedy, she did not mention Mr. Trump. But, while saying the “murder of innocent people breaks our hearts, tears at our sense of security and makes us furious,” she described proposals to ban Muslim immigration as offensive and counterproductive. “America is strongest when we all believe we have a stake in our country and our future,” she said, calling to mind the bipartisan spirit that took hold after the Sept. 11, 2001, terrorist attacks, when she was a senator from New York. Mrs. Clinton has sought to present herself as the default choice of mainstream voters, including Republicans disturbed by Mr. Trump, and on Monday she stressed the importance of building relationships between law enforcement agencies and American Muslims. “Our open, diverse society is an asset in the struggle against terrorism, not a liability,” Mrs. Clinton said. As Mrs. Clinton reached for the mantle of statesmanship, Mr. Trump’s speech amounted to a rejection of the conventional wisdom that he must remake himself for the November election as a more sober figure and discard the volcanic tone and ethnic and racial provocation that marked his primary campaign. Yet Mr. Trump has showed little interest in assuaging those concerns. He used the hours after the Orlando massacre to claim prescience about the attack and to demand Mr. Obama’s resignation. Then, in a television interview on Monday morning, Mr. Trump darkly suggested that the president was sympathetic to Islamic terrorists. “We’re led by a man that either is not tough, not smart, or he’s got something else in mind,” Mr. Trump said. “There is something going on. ” Some Republicans said Mr. Trump’s determination to play to his   base was undermining his standing as a general election candidate. “He has to do what Reagan had to do. Reagan eventually had to make a sale that he was not a risk,” said Thomas M. Davis III, a former Republican congressman, recalling the 1980 election. “There is time, but the way he’s going about it now doesn’t do it at all. It keeps him in the hunt, but it doesn’t get him elected. ” John F. Lehman, a former Navy secretary and an adviser to John McCain’s and Mitt Romney’s presidential campaigns, said he anticipated that Mr. Trump’s standing would improve after the Orlando attack. But he said Mr. Trump’s Muslim ban went “too far” and questioned whether he had made any effort to learn about national security. Mr. Trump’s remarks may come as an acute disappointment to Republican leaders in Washington who have spent the days since he claimed the party’s nomination pleading with him to button down his campaign, only to see him intensify its racial tenor. It is enough to convince senior Republicans that talk of an eventual pivot is folly  —   that he is unwilling or incapable of being reined in. “Everybody says, ‘Look, he’s so civilized, he eats with a knife and fork,’” said Mike Murphy, a former top adviser to Jeb Bush. “And then an hour later, he takes the fork and stabs somebody in the eye with it. ”'"}, "time": 1742628549.95163}