{"duration": 0.08578777313232422, "input_args": {"text": "'Admiral Mike Mullen served the United States with the greatest distinction, serving as Chairman of the Joint Chiefs of Staff under Presidents George W. Bush and Barack Obama. [His attack in Monday’s New York Times on White House adviser (and former Breitbart News chair) Steve Bannon, however, does a disservice to the public policy debate about national security strategy.  Adm. Mullen objects to Bannon’s appointment to the National Security Council (NSC). He admits, however, that President Bush’s NSC “was arranged similarly to Mr. Trump’s,” albeit with the exclusion of political guru Karl Rove. He also admits President Obama included his own political adviser, David Axelrod, in NSC meetings  —   even though Axelrod had no military or foreign policy experience whatsoever (and close ties to the   left and Chicago’s corrupt Democratic machine). In addition, Adm. Mullen complains about “Mr. Bannon’s troubling public positions. ” Adm.  does not list which positions he means  —   hoping, perhaps, that the false innuendos of mainstream media attacks will fill in the blanks for the Times‘ readers. USA Today recently reviewed hundreds of hours of Bannon’s radio commentaries and found none of the racism, antisemitism or “white nationalism” that the Times, among others, falsely ascribed to him. All it found was that Bannon worried about the threats posed by Islam and China. Those are threats most Americans also take seriously  —   and which, presumably, Adm. Mullen did as well. Where Adm. Mullen’s argument really begins to take on water is when he worries that Bannon’s presence would disrupt what is supposed to be a “nonpartisan” institution. It is hard to imagine a more partisan security apparatus than that which emerged on Adm. Mullen’s watch, when the military undertook   changes such as the end of “Don’t Ask, Don’t Tell. ” And though generals asked for more troops in Afghanistan, the president gave them less than they needed  —   along with a   timeline that ended, conveniently, in time Obama’s  . And the disastrous 2011 pullout from Iraq flew in the face of Adm. Mullen’s own recommendation to Congress, in 2007, that success required a   commitment there. Bannon’s official job title is not political adviser, but “Chief Strategist. ” That undoubtedly involves some political advice, but it also points to a role in maintaining the coherence of Trump administration policies. That is crucial in a White House led by a political outsider with a   mandate for change. Bannon’s own naval experience, and his immersion in history and foreign policy, qualify him for the role. And speaking as his former colleague at Breitbart News, I can testify to his   in moments of crisis. I feel more secure knowing Steve is advising our president  —   and I believe others should, as well. In a “disruptive” presidency, he is a stabilizing influence, as he was on the campaign trail. President Trump seems to agree. Adm. Mullen says he worries about “a blurring of presidential responsibilities  —   Republican Party leader and commander in chief. ” But the Constitution recognizes no such distinction, and the time for worrying about that began in January 2009, when for the first time, the U. S. military was led by a    who placed his own political fortunes ahead of the safety and security of the American people. The morning after the Benghazi attacks in 2012, for example, President Obama flew to Las Vegas for a political fundraiser. None of his predecessors  —   not even President Jimmy Carter  —   would have done that. President Trump, like his predecessors, deserves to choose his team, and a leader of Adm. Mullen’s stature should not lend his name to partisan and evidently misinformed attacks. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628300.1192584}