{"duration": 0.01758861541748047, "input_args": {"text": "'Angela Merkel warned Germans should not take freedom for granted, in a speech aimed at countering a rising tide of populism on Friday night. [Speaking at a party conference in Saarlouis, the chancellor called on Germans to show respect for other people’s opinions, but said right wing groups opposed to mass migration have no right to “exclude” anyone from the benefit of belonging to the nation.  Putting a twist on “We are the people” a chant popular with   movement PEGIDA, Merkel said “All of us, we are all the people”. The chancellor, under whose rule German police have raided homes and made hundreds of arrests for online posts critical of mass migration, urged people to back values of ‘freedom and democracy’. Merkel said freedom of speech and religion, freedom of the press and freedom of travel are “not gifts that you don’t have to work for”. “Sometimes you have to make it clear that you are in favour of freedom” she added, warning, “I am convinced that we are again living in such a time”. Looking ahead to the general election due to be held in Germany later this year, Merkel said the notion of  “prosperity for all” will be central to her campaign. “We want as many people as possible in Germany to be able to have a job with fair pay” Merkel said, and underlined that companies should operate in such a way that they “invest in Germany and not elsewhere. ” Since the chancellor opened Germany’s borders in 2015 to nearly two million migrants, most of whom are from the Middle East and Africa, the populist and Euroskeptic Alternative for Germany has eroded support for Merkel’s   Christian Democratic Union (CDU) party. Public anger at the decision to house the influx of newcomers at taxpayers expense triggered a crackdown on ‘hate speech’ with the state using an organisation run by a former Stasi agent to patrol Facebook in  bid to stamp out “xenophobic” comments.'"}, "time": 1742628598.3080728}