{"duration": 0.0643315315246582, "input_args": {"text": "\"West Shamelessly Whitewashing Terrorist Counterattack on Aleppo \\nThey're just your friendly neighborhood head-choppers being victimized by Russia Originally appeared at New Eastern Outlook \\nMilitants led by designated terrorist organisation, Jabhat Al Nusra, now obliquely referred to by the Western media as “Jabhat Fateh al-Sham,” has spearheaded another attempt to disrupt security operations against militants trapped in Syria’s norther city of Aleppo. \\nDespite what is clearly a terrorist assault employing indiscriminate artillery fire provided by Grad rocket systems on an urban center and the use of suicide bombings employing vehicle-borne improvised explosive devices (VBIED), Western media organisations are attempting to depict the assault as a “rebel counter-attack” meant to “break” what it is depicting as a “siege” by Syria’s own military forces. \\nReuters in their article, “ Syrian rebels launch Aleppo counter-attack to break siege ,” would claim: \\nIt is particularly interesting to see Reuters attempt to depict the assault as a “rebel” operation, despite being unable to name a single “rebel” group, and admitting the leading role designated foreign terrorist organisation Jabhat Al Nusra is playing as well as the use of clearly terrorist tactics being employed. \\nReuters continues by admitting much further down in its article that: \\nFateh al-Sham played a big part in a rebel attack in July that managed to break the government siege on eastern Aleppo for several weeks before it was reimposed. \\nAbu Youssef al-Mouhajir, an official from the powerful Ahrar al-Sham Islamist group, said the extent of cooperation between the different rebel factions was unusual, and that the largest axis of attack was on the western edge of the city. \\nReuters is all but admitting that even the so-called “rebels” it attempts to credit the assault with are operating not under the banner of the “Free Syrian Army,” but ultimately under the banner of Jabhat Al Nusra, quite literally Al Qaeda in Syria. \\nReuters concedes that this “complicates” US foreign policy in Syria, claiming that heavier weapons cannot be passed on to “rebels” in fear that they would immediately fall into the hands of terrorist groups “rebels” are clearly operating under. Reuters, however, never explains why any weapons at all would be provided to “rebel” groups so clearly and transparently in league with Jabhat Al Nusra in the first place. \\nFinally, Reuters claims: \\nGrad rockets were launched at Aleppo’s Nairab air base before the assault began said Zakaria Malahiji, head of the political office of the Aleppo-based Fastaqim rebel group, adding that it was going to be “a big battle”. \\nThe Observatory also said that Grad surface-to-surface rockets had struck locations around the Hmeimim air base, near Latakia. \\nGrad rockets are an effective weapon in combat on open terrain. In the confined urban environment of Aleppo, they are an indiscriminate weapon the West, its media and its human rights advocates have little trouble pointing out their use constitutes a war crime, but only when used by forces of nations the West seeks to undermine and ultimately overthrow. No mention of their indiscriminate, inappropriate nature when used in urban environments is made when used by forces backed by Western interests. \\nAlso, Reuters’ inadvertently mentions the “rebel” group Fastaqim in the closing paragraphs of its report, a faction operating under the Aleppo-based Fatah Halab (Aleppo Conquest) coalition. It was revealed by the West’s own rights advocacy group, Amnesty International, in a post titled, “ Syria: armed opposition group committing war crimes in Aleppo – new evidence ,” that: \\nThe Aleppo Conquest armed groups may have used chemical weapons, as well as ‘hell cannon’ gas canister munitions. \\nArmed groups surrounding the predominantly Kurdish Sheikh Maqsoud district of Aleppo city have repeatedly carried out indiscriminate attacks – possibly including with chemical weapons – that have struck civilian homes, markets and mosques, killing and injuring civilians, and have displayed a shameful disregard for human life, said Amnesty International today. \\nIndeed, even groups described as “rebels” by the Western media, are guilty of serial offences that clearly make them terrorists, not “rebels.” The fact that this information is omitted from Reuters’ reports and the nature of these groups’ relationship with Al Qaeda affiliates made as intentionally nebulous as possible, reveals a common theme that has run through Western coverage of the Syrian conflict since it began; a concerted effort to conceal the true terroristic nature of so-called “rebels” in a bid to legitimize the illegitimate, and defend the indefensible.\""}, "time": 1742562255.9127107}