{"duration": 1.6628625392913818, "input_args": {"text": "'\\nNASA is preparing for the big one, as many astronomists have found several major rocks that will be headed straight for earth in the next 10-15 years and beyond.\\nThe threat of a destructive asteroid event encroaching upon our life has become an increasing concern, and it is gaining serious attention. In the long run, it is an inevitability.\\nThough major asteroids big enough to wipe out life across the entire planet are rare, scientists believe they have taken place and reset entire epochs. Moreover, smaller asteroids, comets or meteors can all do major damage, even if they aren’t record breaking hunks of space rock.\\nvia the UK Metro :\\nWhen American government representatives asked NASA head Charles Boden what the best response to a large asteroid headed for New York City would be, his answer was simple: ‘Pray.’\\nBut what would happen if a smaller asteroid hit Los Angeles?\\nDescribing the scenario as a ‘not if – but when,’ NASA recently simulated what would happen if a 300 to 800ft asteroid approached Los Angeles with an 100% chance of impact. \\n‘It’s not a matter of if – but when – we will deal with such a situation,’ said Thomas Zurbuchen, Associate Administrator for NASA’s Science Mission Directorate in Washington. \\n‘But unlike any other time in our history, we now have the ability to respond to an impact threat through continued observations, predictions, response planning and mitigation.’ \\nWhat will it mean for civilization as we know it? There is a definite threat of an existential crisis that would change the planet over night – though the chances are extremely low, there is still a chance.\\nHow much warning would we have? We could have as little as three days warning of an asteroid which would blast London with the power of a hydrogen bomb. \\nAnd it’s possible that we might have no warning at all – at least with a smaller asteroid capable of shattering windows across the city. \\n[…]\\nBigger asteroids could cause nearly unimaginable damage – wiping out many species and plunging Earth into a bleak winter lasting for years – although the larger an asteroid is, the more warning we would have of its approach. \\n‘The high degree of initial uncertainty coupled with the relatively long impact warning time made this scenario unique and especially challenging for emergency managers,’ said FEMA National Response Coordination Branch Chief Leviticus A. Lewis. \\nOn the other hand, really big asteroid are routinely monitored and there are several known ‘big ones’ that will approach in the next decade or so… and while they might be headed for the planet, space agencies aren’t planning to take it lying down, instead, they have a plan to exploit it as a major opportunity, born perhaps, out of an unavoidable risk they hope to mitigate.\\nNow that researchers are getting good at spotting these objects and tracking their path, scientists are beginning to formulate workable strategies for knocking any incoming asteroids off their trajectories and even ‘catching’ them in Earth’s orbit to mine and exploit.\\nThis man on stage at a Ted Talk explains what is at stake:\\nPhil Plait: How to defend Earth from asteroids \\n\\nYes, asteroid defense is now a major enterprise, and somewhere in the shadows a team is gearing up to outdo the casts of Armageddon and Deep Impact combined.\\nWhen asteroids do hit, the damage they can do is unimaginably catastrophic – and can easily dwarf the power of a nuclear detonation, depending upon the size of the incoming rock.\\nBut what is perhaps worse than a rock that could pack the punch of “3 billion nukes” is one that is just big enough to destroy a major area, but too small for NASA or other groups to track effectively. In fact, the latter scenario happens all the time – not long ago, a big enough meteor hit and NASA had no idea until it was too late.\\nWill they catch the one that counts? And will anyone be ready if they don’t?\\nRead more: \\nNASA Plan to Protect Planet Hopes “Nuclear Blast Could Nudge Large Asteroid Off Course” \\nImpact? Asteroid With Destructive “Power of 3 Billion Nukes” Narrowly Misses Earth \\nWhy Has NASA Announced That A Meteor Is NOT Going To Hit The Earth In September? \\nShadow Government Bunkers: Security Heightened at Underground Storage Facilities \\nNASA Missed The Huge Meteor That Just Hit Earth: “Definitely Not Something You See Every Day” '"}, "time": 1742563846.1549096}