{"duration": 0.08003807067871094, "input_args": {"text": "'Argentina president Cristina Fernández de Kirchner had her thyroid gland removed, but test results showed she did not have cancer. Image source . \\nby Paul Fassa Health Impact News \\nSuppose you went to a doctor for low energy and a raspy throat. You vaguely suspect your thyroid is weak, maybe hypothyroidism. But after a series of tests, tiny nodules were found on your throat and the doctor determined you needed to have your thyroid removed, a thyroidectomy, to determine whether or not the nodules are cancerous. \\nThen you are told not to worry, there are medicines that will be prescribed to replace the missing thyroid’s hormone production. You would have to take them for the rest of your life. You figure anything is better than dying from cancer spreading from the thyroid to elsewhere or undergoing chemotherapy, so you go for it. Nipping it in the bud, they say. \\nThen after the procedure, you discover that those nodules weren’t cancerous and there was no threat of cancer. You’ll have to take those synthetic pharmaceutical drugs forever, but at least you know you’re cancer free now. \\nAfter several months of taking those drugs, you discover your complaints and symptoms prior to the surgical procedure have been worsening. \\nThis unfortunate medical procedure is harming people far too often, leading some doctors to declare it needs to stop. Real Life Examples of Those Possible Scenarios \\nThe first part of my fictitious question was international news in 2011 . That’s when Argentine President Cristina Fernández de Kirchner underwent a thyroidectomy to preclude the possibility of cancer that could spread into her neck’s lymph glands and brain. \\nThe biopsy of El Presidente’s thyroid tissues proved the earlier detected nodules were not cancerous at all. Despite cover-up controversy and corruption surrounding Cristina’s tenure as Argentina’s president, she had many adoring fans who breathed a sigh of relief. The song lyric “don’t cry for me Argentina” was evoked with that discovery. \\nOf course, there was no follow-up on how Cristina fared with her daily dose of synthetic thyroid hormones. But a less prominent case concerning a patient of Dr. Jeffrey Dach (pronounced dash) a holistic M.D. in South Florida, provides a perfect example of what to expect after partial or total thyroidectomies used for biopsies. Here is Dr. Dach’s explanation: \\nThe surgery had disturbed her recurrent laryngeal nerve leaving her with a chronic hoarseness, cough and voice change. The surgery also removed the parathyroid glands leaving her at risk for osteoporosis. The radioactive iodine treatment caused salivary gland damage, leaving her with a chronic dry mouth and bad taste. \\nI explained to Lisa that her symptoms of hypothyroidism were due to the small dose of Synthroid, … which contains only T4, does not completely replace the function of her missing thyroid gland. A natural thyroid medication made from desiccated porcine thyroid gland containing T3, T4 and Calcitonin is a far better alternative. Lisa was switched over to her natural thyroid medication, … and 3 weeks later called the office to report a dramatic improvement with relief of chronic fatigue and improved energy levels. \\nDr. Dach mentioned that 36 year old Lisa’s procedures were done “just to make sure.” At first, her doctor perceived a small lump in her neck by touch (palpating) and recommended a thyroid ultrasound, which imaged a 9 mm nodule or lump on her thyroid. Then an ultrasound guided needle biopsy was ordered that determined “papillary carcinoma of the thyroid.” \\nApproximate total cost of the procedures was over $20,000 not including her lifetime prescription of synthetic pharmaceutical thyroid hormones needed once her thyroid gland was removed. This life of pharmaceutical hormones is demanded for even partial thyroidectomies that are impaired from optimum operations. A Few Practitioners Argue Against this Aggressive Diagnostic Procedure \\nAlmost all thyroid cancers found with ultrasound scanning and needle biopsy are the small occult (almost invisible) papillary carcinoma , or OPC, a relatively benign tumor with a 30 year survival rate of 95 percent without treatment. \\nA 1985 Finnish study of autopsies from deaths unrelated to thyroid issues or cancers determined what a few have suspected all along, that people live with OPCs and die from other causes without thyroid cancer diagnosis’. From that study: \\nApparently the great majority of the tumors remain small and circumscribed and even from those few tumors that grow larger and become invasive OPCs only a minimal proportion will ever become a clinical carcinoma. … OPC can be regarded as a normal finding which should not be treated when incidentally found. In order to avoid unnecessary operations [emphasis added] it is suggested that incidentally found small OPCs (less than 5 mm in diameter) were called occult papillary tumor instead of carcinoma. (Abstract source) \\nWhether the programmed fear of death from cancer motivates aggressively attacking OPCs or simply cancer treatments’ high profits, most likely some combination of both, there are those within mainstream medicine who have expressed disdain over the current OPC approach. \\nRadiologist John J. Cronan, M.D., posed this question in his editorial published in the June 2008 issue of Radiology, “ Thyroid Nodules: Is It Time to Turn Off the US Machines? ” \\nFrom the patient perspective, we have hung the psychologic stigma of cancer on these patients and the dependency for daily thyroid supplementation …We accept all these consequences to control a cancer with a 99% 10-year survival. … Realizing the outcome of screening the thyroid, it well might be better to turn off the US machines. In summary, we need to develop an evidence-based strategy that will permit us to escape this flood of nodules. (Source) \\nIn a 2007 JAMA ( Journal of American Medical Association ) article, neck surgeon Dr. Keith Keller, M.D., a veteran of 1,000 thyroid sugeries over his 28 year career, made this claim: \\nI do not believe that this [thyroid cancer] epidemic is real. It is due to improved diagnostic scrutiny, ultrasonography, and other imaging studies and the increasing use of ultrasound-guided FNAB. We may be diagnosing and treating cancers that have no clinical significance. (Emphasis added) \\nWe have embarked on a quixotic quest to rid our patients of microscopic and probably clinically unimportant thyroid cancer. We need to refocus our efforts, not to detect more occult disease, but to identify and cure those few patients whose disease is likely to shorten their lives. \\nWe need to improve our accuracy in the evaluation of the indeterminate thyroid nodule. We are performing far too many unnecessary thyroidectomies. [Emphasis added] (Source) Safeguarding Against Thyroidectomies and the Resultant Synthetic Hormones \\nThe reason behind this is all the diagnostic studies Dr. Keller mentioned are inconclusive for diagnosing truly malignant thyroid cancer that could spread into lymph glands and other areas. The only reason for partial or total thyroidectomies is to determine whether the nodules are not cancerous. \\nA minority of courageous mainstream M.D.s have suggested a wait-and-see policy before proceeding to the stage of using a thyroidectomy to determine cancer. The nodules are usually benign after all. \\nSome think over 1 mm is time to cut into the thyroid, most of those concerned consider over 5 mm as the time to surgically probe, while Dr. Yasuhiro Ito of Japan recommends extending the wait-and-see approach to 10 mm. That would have spared Lisa all the suffering from which Dr. Dach rescued her. \\nPatient advocate and author of several books on thyroid and hormonal issues, Mary Shomon, thinks the latest extension of testing for thyroid cancer might eliminate a lot of unnecessary thyroid removals. \\nThe Afirma Thyroid FNA Analysis extends the ultrasound guided FNA (Fine Needle Aspiration) with a series of tests to confirm or rule out malignancy. Currently lab facilities are limited and many doctors may not know of this extended procedure. \\nThe procedure runs around $3500, considerably less than the 15 to 20,000 dollars dolled out for the surgical biopsy that usually renders one’s thyroid gland useless or no longer there and puts one on a lifetime prescription of synthetic hormone drugs. \\nAn easy way to safeguard yourself from thyroid problems is by supplementing iodine heavily, much more than the FDA recommended dosage of 150 mcg to 300 mcg daily. One should boldly move into the milligrams per dose range, even over 12.5 mg daily to compensate for iodine deficiency. (Source) \\nIt’s also very important to avoid fluoridated and chlorinated water as well as most commercial pastries and breads commonly made with bromide or sodas that are brominated. All of these compounds block your thyroid’s ability to absorb the iodine fuel it needs. \\nIf you or a loved one unfortunately undergoes a thyroidectomy to lose that gland’s hormonal activity, at least get off the synthetic hormones and use naturally animal derived desiccated hormones (bovine or porcine) such as Armour. \\nA friend of ours lost her life one year after a thyroidectomy that she stubbornly pursued. Her loss of life was not from cancer, it was from complications of the procedure and her forced use of synthetic thyroid hormones. \\nSources :'"}, "time": 1742628598.8789902}