{"duration": 0.23589158058166504, "input_args": {"text": "'On this weekend’s broadcast of “Fox News Sunday,” host Chris Wallace had a heated exchange with Jay Sekulow, who is member of President Donald Trump’s legal team.  Partial transcript as follows: WALLACE: I want to ask you a direct question, does the president think that Rod Rosenstein has done anything wrong? SEKULOW: The president has never said anything about Rod Rosenstein doing anything wrong. Here’s what  —   what is the legal situation here. There is a constitutional issue when you have this scenario. The president made a determination based on consult of advice. He decided ultimately. He’s the commander in chief. He gets to make that decision that James Comey had a go. That was coming, by the way, from groups right, left, and center over the last year. You  —   you and I know that. So there had been concern about James Comey. It was put forward in a memorandum  —   that’s what the president’s referencing  —   from the deputy attorney general and the attorney general requesting the removal of James Comey as the FBI director. And, ultimately, that’s the president’s determination. So here’s the constitutional threshold question, Chris. The president takes action based on numerous events, including recommendations from his attorney general and the deputy attorney general’s office. He takes the action that they also, by the way, recommended. And now he’s being investigated by the Department of Justice because the special counsel under the special counsel relations reports still to the Department of Justice. Not an independent counsel. So he’s being investigated for taking the action that the attorney general and deputy attorney general recommended him to take by the agency who recommended the termination. So that’s the constitutional threshold question here. That’s why, as I said, no investigation  —   WALLACE: Well, I  —   what  —   what  —   what’s the question (INAUDIBLE). I mean you  —   you stated  —   you stated some facts. First of all, you’ve now said that he is getting investigated after saying that you didn’t. SEKULOW: No. WALLACE: You  —   you just, sir, that he’s being  —   SEKULOW: No, he’s not being investigated! WALLACE: You just said that he’s being investigated. SEKULOW: No, Chris, I said that the  —   any  —   let me be crystal clear so you  —   you completely understand. We have not received nor are we aware of any investigation of the president of the United States, period. WALLACE: Sir, you just said two times that he’s being investigated. SEKULOW: No. The context of the tweet, I just gave you the legal theory, Chris, of how the Constitution works. If, in fact, it was correct that the president was being investigated, he would be investigating for taking action that an agency told him to take. So that is protected under the Constitution as his article one power. That’s all I said. So I appreciate you trying to rephrase it, but I’m just being really direct with you, Chris. This is  —   let me be  —   WALLACE: No, I  —   I  —   sir, I didn’t rephrase it. The tape will speak  —   Jay, the tape will speak for itself. You said he is being investigated. And it’s not that big  —   SEKULOW: Chris, he is  —   just  —   no, Chris  —   that’s (INAUDIBLE) unfair, Chris. WALLACE: Wait a minute  —   wait a minute. Jay, and it’s not  —   Jay, it’s not just being investigated for firing Comey. There’s also the question of what he said to Comey when Comey was still the FBI director. So there’s more than just the fact that he fired Comey. SEKULOW: He  —   Chirrs, let me be clear, you asked me a question about what the president’s tweet was regarding the deputy attorney general of the United States. That’s what you asked me. And I responded to what that legal theory would be. So I do not appreciate you putting words in my mouth when I’ve been crystal clear that the president is not and has not been under investigation. I don’t think I can be any clearer than that. WALLACE: Well, you don’t know that he’s not under investigation again, sir. I mean you might  —   SEKULOW: You know, I can’t read the mind  —   you’re right, Chris, I can’t read the minds of the special prosecutor. WALLACE: Well, then, good, OK, so we’re in agreement, you don’t know whether he’s under  —   you don’t know whether he’s under investigation. SEKULOW: But I have not been notified. No one has been notified that he is. WALLACE: You don’t know whether he’s under investigation or not. SEKULOW: Chris, I  —   WALLACE: The question I’m asking you is, does he think that Rod Rosenstein  —   it’s a very simple question  —   does he think that Rod Rosenstein did anything wrong? SEKULOW: The president has not expressed any opinion about Rod Rosenstein. WALLACE: Does he think that Robert Mueller has done anything wrong? SEKULOW: First of all, he has not said anything about Robert Mueller. And, Chris, let me say something here. You’re asking me if I had a conversation, which I have not had, about Robert Mueller with the president of the United States on  —   or anyone else for that matter. I can’t discuss that and would that with you. Unlike James Comey, who leaks information to the press, I actually respect the   privilege. Apparently, he did not. WALLACE: Does the President believe  —   well, you’re speaking for his legal team, so you’re out here to represent him and tell us what the president’s belief is, is that correct? SEKULOW: No, I’m out here to tell you what the facts are and the legal issues are. I’m not to tell you what the beliefs are. I’m not the client’s conscience I’m his lawyer. WALLACE: I understand that and the  —   and the client  —   have you spoken the  —   have you spoken to the president at all? SEKULOW: Yes, but I’m not going to discuss those conversations with you. Those are privileged under the   privilege. WALLACE: Well, I assume that if he asked you to say something, for instance, Marc Kasowitz said all kinds of things about  —   after Comey’s testimony. I assumed he was speaking for the president, SEKULOW: Marc Kasowitz made a general statement to the press after the testimony of James Comey. That’s what that was about. This  —   you’re asking me now questions about what people are thinking in their minds, which I don’t read minds, and you’re asking me also what I may or may not have had a conversation with the president about and you understand this. I respect the   privilege, unlike James Comey. WALLACE: Does  —   SEKULOW: I want to be real clear on that too. I’m not going to give you conversations I’ve had with  —   have or have not had with the president of the United States. So when I’ve had conversations with the president of the United States  —   WALLACE: Well, I  —   your  —   SEKULOW: As his lawyer, it’s privileged, period. WALLACE: Does the president think that Rosenstein, because you talked about this constitutional theory that he took action, that’s on the advice  —   SEKULOW: Yes. WALLACE: Although he says he didn’t take it on the advice of Rosenstein, does he think that Rosenstein should recuse himself, and is healing the groundwork to fire Rosenstein and Mueller? SEKULOW: I’ve had no conversations, and I’ve heard nothing without that at all. Nothing. I think this  —   Chris, this points out  —   let me tell you one thing quickly about the constitutional theory, as you called it. It’s actually called the Constitution. You know, the president has certain (INAUDIBLE) authority under the Constitution. It’s  —   WALLACE: Well, you called it the constitutional theory, sir. SEKULOW: Yes, it is a constitutional theory based on the Constitution. WALLACE: I understand that. SEKULOW: Not  . It’s the constitutional theory. It’s part of the Constitution. The president has inherent authority. Here’s what you’re trying to  —   here’s what you’re trying to do, Chris, and I appreciate that you’re  —   you’re trying to push back. WALLACE: Well, now you’re reading minds again. Now you’re reading minds again. SEKULOW: No, Chris, I deal with fact and law. You were asking me to read people’s minds. That I don’t do. WALLACE: Well, don’t tell me what I’m trying to  —   well, don’t tell me what I’m trying to do because you don’t know what I’m trying to do. What I’m trying to get is a straight answer out of you. Let me ask you this  —   SEKULOW: Yes, well  —   sure. WALLACE: As a matter of law, does the President think that he can be indicted under the Constitution? SEKULOW: The president  —   I haven’t had that conversation with the president, but the president can’t be indicted under the Constitution of the activity alleged in something like this. Of course not. WALLACE: Why is that? SEKULOW: Because there’s not an investigation. And there’s  —   there’s no investigation against the president. WALLACE: Well, you don’t know whether there’s an investigation. Oh, boy, this is weird. You  —   you don’t know that there’s  —   whether there’s an investigation. You just told us that. SEKULOW: Chris, you’re asking me to speculate  —   so then what you’re asking me to do is to speculate on  —   WALLACE: And it would matter. I’m asking you as a matter of law, not whether there’s an investigation. Does the president think he can be indicted as president? SEKULOW: For  —   for  —   WALLACE: That’s a constitutional issue, isn’t it? SEKULOW: For obstruction of justice? No, the Constitution’s  —   WALLACE: No, for any of it. SEKULOW: Now, Chris, you know, let’s  —   let’s be realistic here. You know what the  —   the answer is. Can the president be indicted for obstruction? You know what the position has been at the Department of Justice since the 1970s and again stated in 2000. That’s not what President  —   that’s now how you engage a president. There’s a political process if somebody did something wrong. You’re talking about  —   you’re conflating a constitutional process, criminal law, with an issue of political consequence. So I am his lawyer. I’m not his political advisor. WALLACE: Senator Dianne Feinstein, a top Democrat on the Senate Judiciary Committee, responded to the president’s tweet this week with this statement. “The message the president is sending through his tweets is that he believes the rule of law doesn’t apply to him and that anyone who thinks otherwise will be fired. ” Is she wrong, sir? SEKULOW: Yes, she’s wrong. First of all, Dianne Feinstein also called for an investigation of James Comey and Loretta Lynch for that whole episode regarding her engagement and calling it a, quote, “matter,” not an “investigation. ” But with regard to this particular issue, I mean the tweet  —   there’s nothing illegal or inappropriate about the tweet. If the tweet came on the heels of a Washington Post story that had five anonymous sources and didn’t even identify the agency from which those sources came from, and that’s what he tweet in response to. It’s that simple, period. WALLACE: Final question, the president just  —   just added John Dowd, a   Washington lawyer, to his legal team. Should we expect him to hire other criminal lawyers? And, in a sense, is he preparing for a potential legal battle here? SEKULOW: Look, I mean John Dowd is  —   is a legal legend, you know that, in  —   in  —   in the  —   in Washington, D. C. and the president is doing the appropriate thing by hiring lawyers necessary, if there was to be an investigation, if there were to be an investigation, you have the lawyers in place. We’ve got a great legal team led by Marc Kasowitz. We’ve got John Dowd on the team. This is a solid team. Contrary to some of the press reports, a deep team, if necessary. WALLACE: Do you think  —   I  —   I  —   I misspoke. I’m going to ask one more question. Because I’m not allowed to ask you what the president thinks, do you think that he should stop  —   SEKULOW: Of course. WALLACE: Do you think he should stop tweeting about this case? SEKULOW: Look, I  —   here’s the thing on that. You know, people have been asking me that. Look, the president has changed the way in which engagement goes in  —   I mean you’ve got great ratings, no doubt about it, Chris. But let’s face it, the president speaks to 107 million people through his social media platforms. He revolutionized the election process by utilizing media in a different way. So I  —   I think, look, the president knows the effectiveness of social media. He’s been very effective at it. Again, I’m his lawyer, I deal with the issues. Nothing that he’s tweeted is causing me any issues whatsoever at this point. Nothing. WALLACE: Jay, thank you. Thanks for coming in. SEKULOW: Thanks, Chris. WALLACE: It’s always  —   it’s always interesting to talk to you. Please, come back, and we’ll  —   SEKULOW: Thanks, Chris. WALLACE: We’ll continue it and maybe this time we’ll get on this  —   you know what, be here in studio and we can stay on the same wavelength. SEKULOW: There we go. WALLACE: All right, sir  —   SEKULOW: Happy Father’s Day. WALLACE: Happy Father’s Day to you too, sir. Follow Pam Key on Twitter @pamkeyNEN '"}, "time": 1742562110.9524305}