{"duration": 0.15639901161193848, "input_args": {"text": "'REGGIO CALABRIA, Italy  —   Fighting the mafia at the very toe of Italy, Roberto Di Bella has seen a lot: children as young as 11 or 12 serving as lookouts during murders, attending drug deals and mob strategy sessions, or learning how to handle a Kalashnikov assault rifle. But it was the day he charged the younger brother of a minor he had jailed years before that he decided to take a drastic step: separating children from their mob families and moving them to a different part of Italy to break a generational cycle of criminality. “I am not taking them away for nothing,” said Mr. Di Bella, a    magistrate, president of the Reggio Calabria minors’ court. “Sons follow their fathers,” he said. “But the state can’t allow that children are educated to be criminals. ” Since he began taking children away from parents convicted of mob association in 2012, Mr. Di Bella has separated about 40 boys and girls, ages 12 to 16, from their families, in an approach that has proved as controversial as it has been effective. About a quarter of the time, mothers looking to flee the mafia’s tentacles go with them. The rest of the children are put into foster care, but Mr. Di Bella said that none of the children he had separated from their families had since committed a crime. The Justice Ministry in Italy has just codified statutes so that Mr. Di Bella’s innovation, so far limited to his corner of Calabria, can be applied to fight mafias nationwide. Some are appalled by the strategy in a country where family bonds are so cherished. Critics have called it a “  method” that overlooks the environmental factors that have made Calabria one of Italy’s poorest and most violent regions. “If Calabria stays Italy’s most underdeveloped region, it’ll keep having the most potent mafia,” said Isaia Sales, an expert and author of books on criminal organizations. “Regardless of the families. ” Even Mr. Di Bella admits to losing more than an occasional night’s sleep over taking children away from their parents. Still, he says, since he started separating the children, fathers have written to him to thank him for it. Children have told him they feel liberated. Mothers ask if he will do it for their children. The success of the approach says everything about the bonds that have made the ’Ndrangheta (pronounced    ) a strictly   business, one of Italy’s hardest mafia networks to penetrate. From its base in the south, the ’Ndrangheta has infiltrated communities even in Northern Italy and abroad, becoming one of the most powerful criminal syndications in the world, spanning Italy to South America and Australia. Specialized in international drug and weapons smuggling, it is the No. 1 cocaine supplier into Europe. The methods that keep the network tightly knit and functioning are both intimate and brutal, and for those caught up in the ’Ndrangheta’s web, difficult to escape. “We hear things that are much worse than Gomorrah,” Mr. Di Bella said, referring to an   book and movie that recounted gruesome lives inside another of Italy’s notorious mob networks, the Neapolitan Camorra. Mr. Di Bella and others are convinced that severing familial links is not only one of the most effective ways to defeat the ’Ndrangheta, but that it also restores to the children of the mob families the possibility of a normal life. Some minors end up in the program after committing the   symptomatic crimes, like gang violence or setting police cars on fire. Others become   mafiosos at a young age. The Reggio Calabria juvenile court has sentenced about 100 minors for mafia association and 50 for murder or attempted murder since the 1990s. Teenagers who come from ’Ndrangheta families have access to unlimited, if illicit, wealth, walk around with Rolex watches on their wrists, and are encouraged to neglect their education and spend time only within the family circle. “Emotionally, they are very alone,” said Enrico Interdonato, a    psychologist who has volunteered to work with Mr. Di Bella. “My job is mostly to relate to them humanly. ” “We don’t want to change anyone,” he added. “But we can help them be free to build their own conscience. ” After the children are moved to a different Italian region, the authorities can try to create the conditions for an ordinary childhood. In the last two years, mothers have started to turn to Mr. Di Bella, in the hope of saving their children from an inescapable destiny of death or prison, and sometimes to escape mafia ties themselves. Psychologists and social workers work with the children constantly. After they turn 18, the children can then choose whether to go back to Calabria. Most stay in touch with the judges and their social workers even after the program ends. But authorities can remove a child only if they can prove that he or she is physically or psychologically endangered by their families’ mafioso behavior. Separating a child from his or her family is always a wrenching decision, and one Mr. Di Bella does not take lightly. In one case, Mr. Di Bella considered revoking the decision for a    girl whose parents were both in jail for mafia association. “Her departure was so excruciating that even the policeman who accompanied her cried,” Mr. Di Bella recalled at a recent afternoon in his guarded office. “But a few days later, she called me and thanked me,” he said. The girl told him that she was finally free to be herself. She was no longer “the daughter of,” he recounted. One father, under a strict prison regime, wrote to Mr. Di Bella to thank him for the “chance you gave to my children to live in a taintless environment and to live in legality,” he said in a letter. “I am proud to grant my children a different future,” he wrote. Mr. Di Bella says he sees the project as the “future of the fight against mafias. ” But he is the first to admit that it is embryonic and underfunded. “We need specialists,” he said referring to psychologists, host families and specialized judges. “We need norms, funds and training, so that we can enlarge the scope of this project. ” After years of work with Mr. Di Bella and other prosecutors, the Justice Ministry is now ready to standardize the procedure, so that it can be applied first regionally, then nationally. “We try to start a process to provide them education and psychological help to show them that a different world is possible,” Francesco Cascini, director of the department for juvenile justice at Italy’s Ministry of Justice, said. “But we need funds for that. ” In the Reggio Calabria province, 81 towns out of 83 do not have a social worker, a significant hurdle to the process, he said. But talk of expansion alarms some. Critics say that context is more crucial than the family in the fight against the mafia, and consider the project as an admission of inability of the state to change the social and economic environment of Calabria. Mr. Sales, the author, argues that in the 19th century Italy’s Southern cities were not much different from Paris or London, overrun with poor people who were trying to survive through crime. In Northern Europe, though, the economic and social context improved, he said. “It’s a defeat to me,” Mr. Sales said of the program. “Because it implies not believing that the context can be cleaned up. ” But those like Mr. Interdonato, the psychologist who collaborates with Mr. Di Bella, are of a different mind. He recalled his experience working with a    boy who came from a ’Ndrangheta family who had been relocated. “The first message is, ‘No one knows you here, just live,” he said. “Then we start showing them how being honest doesn’t imply being a loser. ” Mr. Di Bella and others say their mission is to give the young people freedom, against long odds. “We are a bit like David against Goliath,” Mr. Di Bella said. “But the ’Ndrangheta infiltrates our community, and we try to infiltrate them culturally, making their children free to choose. ”'"}, "time": 1742564014.2091873}