{"duration": 0.09048223495483398, "input_args": {"text": "'Leave a reply \\nDylan Harper – The human aura is an electromagnetic field that emits from any living thing. It is comprised of many layers, with each aura layer having its own function or role. An aura is not separate from the physical body but is an extension of it in different composition. \\nTo compare, the characteristics of planet Earth include physical and atmospheric layers. The attributes of each layer are different in likeness, appearance and function; each is an interconnected part incorporating the entity as entirely complete. \\nContinuing to use the Earth as a working example of how the human aura serves to function, its layers interactively exchange information with each other. The layers serve as a system of feedback and can indicate states of health, patterns of activity, stagnancy and warn of forthcoming ailments or disease. \\nAs the Earth becomes more densely polluted, sections of its atmosphere will suggest the presence of ailment. By observing patterns of the wind, temperature, air flow and pressure, it allows for accurate predictions of stormy weather between different zones. Our awareness or neglect of this system of feedback can mean the difference between preventive maintenance and a result that is costly in damage. All of this information can be detected through observation of atmospheric changes. \\nHuman auras are similar – the aura layers relay specific feedback between our physical body and its functioning systems, our mental and emotional states of being, and they exchange information with other auras that we interact with. \\nUsing the aura as a more direct way to gauge health has been snubbed in the past because auras were not readily seen or were still thought of by many as mythical apparitions. \\nHowever, present technology now has the capability to detect and record the human energy field, and the existence of auras is becoming more widely accepted as an authentic physiological marvel. \\nDocumented research on the physics of the aura phenomenon has been ongoing since as early as the year 1777. Modern notable research carried out by Dr. Seymon Kirlian in 1939, for which Kirlian Photography has been coined, openly made the controversial claims of their existence, exhibiting photographic ‘proof’ of auras through his technique of electrophotography. \\nMore studies were done to further advance our knowledge about what the presence of this energy field means, how it functions and how to analyze what it does. United States scientist, Dr. Thelma Moss, author of The Body Electric, led UCLA’s parapsychology laboratory during the 1970’s to study Kirlian Photography in an effort to document and explain the aura images that are present in an electrophotograph. \\nAt present, Dr. Konstantin Korotkov at the Russian University, St. Petersburg State Technical University of Informational Technologies, Mechanics and Optics, uses a process called GDV (Gas Discharge Visualization), a development in aura detection technology based on the Kirlian Effect. \\n“We are developing the idea that our consciousness is part of the material world and that with our consciousness we can directly influence our world,” said Dr. Konstantin Korotkov, a professor of physics at St. Petersburg State Technical University. \\nTo bridge our understanding of the unseen world of energy, scientific experiments are being carried out using a technique called bioelectrophotography. The assumption is that we are constantly emitting energy. Bioelectrophotography aims to capture these energy fields seen as a light around the body — or what some people would call your aura. \\nIn 1999 the Russian Academy of Science approved Korotkov’s methods and use of GDV techniques and equipment for use in hospitals and athletic training programs as a means of detecting stress in the body to apply preventative measures. SF Source Dreamcatcher Reality Nov. 2016 Share this:'"}, "time": 1742563417.7040331}