{"duration": 0.07330131530761719, "input_args": {"text": "'Following the recent media firestorm around former Breitbart Senior Editor MILO, people have begun scrutinizing past similar comments and actions of liberal celebrities. [In the wake of MILO’s departure from Breitbart News, a number of instances have come to light where those on the left have discussed or joked openly about pedophilia. Unlike in MILO’s case, the media has been largely silent in response.  1: George Takei, In a 2006 interview on The Howard Stern Show, actor George Takei spoke about being molested by an    camp counselor as a    at summer camp. In the excerpt, what many seem to find most shocking about Takei’s comments is that he insists he wasn’t molested because he found the perpetrator “attractive. ” At 2:20 mark @GeorgeTakei promotes pedophilia with 13 year old boys to Howard Stern. #tcot #Milohttps:  .   —   John Cardillo (@johncardillo) February 21, 2017,  George Takei Amazing how this doesn’t trend.  No liberal outrage!  Nothing from #pizzahut or #tacobell,  —   gab.  🐸 (@HillaryNo1sPres) February 22, 2017,  2: Bill Maher, HBO host and comedian Bill Maher can be seen in a clip from 1998 on Maher’s previous TV show Politically Incorrect defending an adult teacher who had sexual relations with her    student. “Basically, they’re having a family and they’re keeping the mother in jail because she won’t conform to the perfect American family,” he says. Later in the clip, Maher asks, “How can a woman rape a man?” if bill maher thinks sunlight is the best disinfectant then here’s him saying the same shit as milo, that it’s ok for adults to fuck kids pic. twitter.   —   warrior cop (@wyatt_privilege) February 22, 2017,  In 2016 Maher once again defended the relationship between an adult and a minor when he called out “social justice warriors” for attacking a relationship between singer David Bowie and    Lori Mattix. “If there’s a victim here, it’s the guy who had to fuck Lori Mattix next,” said Maher. “How do you follow David Bowie in a kimono?” 3: Roman Polanksi, Roman Polanski, the acclaimed liberal director of films such as Rosemary’s Baby and Chinatown, pled guilty to engaging in unlawful sexual intercourse with a minor after being accused of drugging and raping   old Samantha Geimer in 1977. Polanski fled the United States before he could be sentenced and has been living in France ever since. Since then Hollywood celebrities such as Meryl Streep have openly defended Polanski, with Streep stating that she’s “very sorry that he’s in jail” and Polanski receiving a standing ovation from Hollywood stars following his Oscar win in absentia for Best Director for The Pianist.  4: Lena Dunham, Lena Dunham, writer and star of HBO TV show Girls, wrote in her memoir Not That Kind Of Girl of inappropriate sexual activity with her younger sister.  Dunham writes in her autobiography of “casually masturbating” while in bed next to her younger sister and bribing her with “three pieces of candy if I could kiss her on the lips for five seconds  …     anything a sexual predator might do to woo a small suburban girl I was trying. ” Dunham also spoke of touching her sister’s genitals, saying, “Grace was sitting up, babbling and smiling, and I leaned down between her legs and carefully spread open her vagina. She didn’t resist,” Dunham wrote. “This was within the spectrum of things I did,” she added. Dunham also admitted to sharing the same bed with Grace until she was seventeen, and that sometimes she “slipped my hand into my underwear to figure some stuff out” while sleeping next to her. Rather than experiencing outrage and anger from fans and the media for these actions, Dunham was instead invited to speak at the Democratic National Convention on the topic of women’s rights. At the DNC, Dunham introduced herself saying: “I am a   feminist, sexual assault survivor with a chronic reproductive illness. ”'"}, "time": 1742563309.231917}