{"duration": 0.020613670349121094, "input_args": {"text": "'Places Most Unsettled by Rapid Demographic Change Are Drawn to Donald Trump Janet Adamy and Paul Overberg, Wall Street Journal, November 1, 2016 \\nSmall towns in the Midwest have diversified more quickly than almost any part of the U.S. since the start of an immigration wave at the beginning of this century. The resulting cultural changes appear to be moving the political needle. \\nA Wall Street Journal analysis of census data shows that counties in a distinct cluster of Midwestern states–Iowa, Indiana, Wisconsin, Illinois and Minnesota–saw among the fastest influxes of nonwhite residents of anywhere in the U.S. between 2000 and 2015. Hundreds of cities long dominated by white residents got a burst of Latino newcomers who migrated from Central America or uprooted from California and Texas. \\nThat shift helps explain the emergence of Republican presidential nominee Donald J. Trump as a political force, and signals that tensions over immigration will likely outlive his candidacy. Among GOP voters in this year’s presidential primaries, counties that diversified rapidly were more likely to vote for the New York businessman, the Journal’s analysis shows. \\n{snip} \\nThe Journal identified the epicenter of this shift using the diversity index, a tool often used by social scientists and economists. It measures the chance that any two people in a county will have a different race or ethnicity. In 244 counties, that diversity index at least doubled between 2000 and 2015, and more than half those counties were in the cluster of five Midwestern states. The analysis excludes tiny counties that produce numeric aberrations. \\n{snip} \\nMr. Trump won about 71% of sizable counties nationwide during the Republican presidential primaries. He took 73% of those where diversity at least doubled since 2000, and 80% of those where the diversity index rose at least 150%, the Journal’s analysis found. \\n{snip}'"}, "time": 1742628428.9321947}