{"duration": 0.08195734024047852, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. The declassified version of the intelligence report on Russian hacking ordered by President Obama found that Russia’s leader, Vladimir V. Putin, “ordered an influence campaign” to sway the 2016 election. He turned from seeking to “denigrate” Hillary Clinton to developing “a clear preference” for Donald J. Trump, the report states. Mr. Trump was briefed on the report’s contents by the nation’s top intelligence and law enforcement officials. Afterward, the   acknowledged the possibility that Russia had hacked a variety of targets, but asserted that the hacking had not affected the outcome of the election. _____ 2. At least five people were killed and eight wounded in a shooting at Fort   International Airport in Florida. The gunman targeted people in the baggage claim area of a terminal used by Delta and Air Canada, and was quickly taken into custody. Senator Bill Nelson identified him as Esteban Santiago and said he was carrying a military identification. _____ 3.   Trump acknowledged that Mexico will not be paying for a wall at the border, at least now. Mr. Trump said the wall could be built faster with U. S. taxpayer money  —   but he still insisted that Mexico would ultimately reimburse the United States, probably through a renegotiated trade agreement. _____ 4. The last jobs report of the Obama administration showed tepid job growth but also a    rise in wages. Our economics reporter says that for all of Mr. Trump’s attacks on President Obama’s economic policies, he will inherit an economy that is fundamentally solid, with consumer sentiment, corporate profits and the stock markets up. _____ 5. Much of the southeastern U. S. is bracing for harsh winter storms. Many schools and government offices in Arkansas and Oklahoma were closed on Friday. A state of emergency was declared in Alabama, North Carolina and northern Georgia, including Atlanta, above. _____ 6. Russia ordered its aircraft carrier to return home from the Syrian coast, part of a general drawdown of its forces involved in the conflict. The    carrier was sent on its first combat mission last fall to mount airstrikes in support of forces loyal to President Bashar  . _____ 7. A second prison riot in a week in Brazil left at least 33 inmates dead. Local news agencies reported a gruesome scene, including decapitations, days after 56 people were killed in another riot. Officials say the violence is linked to an intensifying war among drug gangs for control of Brazil’s cocaine trade. _____ 8. Here in the U. S. opioids  —   both heroin and prescription painkillers  —   have killed more than 33, 000 people since 2015. Public health officials say it is the worst drug crisis in American history. We sent a team of reporters around the country to examine how communities are searching for solutions. We also asked readers how opioid abuse has affected them. One man wrote in from Tucson, Ariz. about his son, who became addicted to OxyContin and then heroin. “Every time he lied to me about getting clean, I would believe him and try to help him out,” he wrote. “Now I just hope his bottom is not his death. ” _____ 9. Would Hillary Clinton run for mayor of New York? While the answer is almost certainly no, that’s not stopping political buffs  —   on the right and the left  —   from discussing the question. The Clintons live in the suburbs north of the city, but Mrs. Clinton would need only to move inside the city limits by Election Day to qualify for the job (which, again, there are no signs she wants). _____ 10. Finally, the holidays are behind us. “I think we’re alone now,” writes our food editor, Sam Sifton. “Let’s cook for ourselves. ” Here are his suggestions for what to cook this weekend, including pasta with caramelized cabbage, anchovies and bread crumbs. Bon appétit. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561899.5942452}