{"duration": 0.050573110580444336, "input_args": {"text": "'  Donald Trump says construction of the U. S.  border wall will begin immediately after he takes office Jan. 20. [“On the ‘fence’ —  it’s not a fence. It’s a wall. You just misreported it. We’re going to build a wall,” Trump said during a Wednesday press conference at Trump Tower in New York City.  “I could wait about a year and a half until we finish our negotiations with Mexico, which will start immediately after we get into office. But I don’t want to wait. Mike Pence is leading an effort to get final approvals through various agencies and through Congress for the wall to begin. ” “I don’t feel like waiting a year or year and a half. We’re going to start building,” Trump added. “Mexico, in some form, and there are many different forms, will reimburse us. And they will reimburse us for the cost of the wall,” he continued. “That will happen, whether it’s a tax or whether it’s a payment. Probably less likely that it’s a payment. But it will happen. ” “So remember this: I would say, ‘We’re going to build a wall.’ And people would go crazy. And then I would say, ‘Who’s going to pay for the wall?’ And people would all scream out —  25, 000, 30, 000 people ’cause nobody has ever had crowds like Trump has had, you know that. You don’t like to report that  …     But I said, ‘Who’s going to pay for that wall?’ And they will scream out: ‘Mexico,’” Trump said. “I want to get the wall started,” he said. “I don’t want to wait about a year and a half until I make my deal with Mexico. ” The government of Mexico is “terrific,” Trump said, adding he doesn’t “blame them for taking advantage of the United States. I wish our politicians were so smart. Mexico has taken advantage of the United States. ” Last April, Trump issued a memo explaining to Mexico he would tax remittances flowing out of the U. S. economy —  or the Mexican government could issue a   payment of up to $10 billion for the wall. “Mexico has taken advantage of us in another way as well: gangs, drug traffickers, and cartels have freely exploited our open borders and committed vast numbers of crimes inside the United States,” he wrote. “The United States has borne the extraordinary daily cost of this criminal activity, including the cost of trials and incarcerations. Not to mention the even greater human cost. ” “We have the moral high ground here and all the leverage,” Trump said. Mexicans send roughly $20 billion in remittances back to Mexico every year, according to the World Bank, much of it from the U. S. American taxpayers are also forced to pay for the welfare and schooling of millions of Mexican citizens and their children while enduring the costs of crime (gang activity, drug trafficking) and stagnant wages that unchecked immigration brings while this money is taken out of the U. S. economy every year. After Trump’s election, remittances from Mexicans soared to $2. 4 billion in a single month as immigrant workers and illegal aliens scrambled to send American cash back home. In December, Trump transition team officials also demanded Obama’s Department of Homeland Security report on “all assets available for border wall and barrier construction,” along with aerial surveillance, according to Reuters.'"}, "time": 1742561999.02209}