{"duration": 0.08429193496704102, "input_args": {"text": "'NTEB Ads Privacy Policy Pope Francis Signs Joint Statement With Lutheran World Federation Church For ‘Full Unity’ The Joint Declaration was signed during the ecumenical prayer service held in Lund’s Lutheran Cathedral on the first day of the Pope’s visit to Sweden. by Geoffrey Grider October 31, 2016 Pope Francis and Bishop Mounib Younan, President of the Lutheran World Federation signed a Joint Statement on Monday in which Catholics and Lutherans pledged to pursue their dialogue in order to remove the remaining obstacles that hinder them from reaching full unity. \\n“And I heard another voice from heaven, saying, Come out of her, my people, that ye be not partakers of her sins, and that ye receive not of her plagues.” Revelation 18:4 (KJV) \\nEDITOR’S NOTE: On October 31, 1517, Martin Luther nailed his 95 Theses to the castle church door in Wittenberg, Germany, thus sparking the release of the captive Christian church from the Roman Whore of Babylon, the Catholic Vatican Church system. Exactly 499 years later – today – Pope Francis undid Martin Luther’s work and ensnares an all too willing Lutheran Church with the concordat you can read below. This is exactly what the book of Revelation warns us about, and it is both sad and sickening to see so many Christian denominations so eager and willing to bow before the Roman pope. \\nThey also stressed their commitment to common witness on behalf of the poor, the needy and the victims of injustice. The Declaration was signed during the ecumenical prayer service held in Lund’s Lutheran Cathedral on the first day of the Pope’s visit to Sweden. \\nPlease find below the full text of the Statement: JOINT STATEMENT \\non the occasion of the Joint Catholic-Lutheran Commemoration of the Reformation \\nLund, 31 October 2016 \\n«Abide in me as I abide in you. Just as the branch cannot bear fruit by itself unless it abides in the vine, neither can you unless you abide in me» (John 15:4). With thankful hearts \\nWith this Joint Statement , we express joyful gratitude to God for this moment of common prayer in the Cathedral of Lund, as we begin the year commemorating the five hundredth anniversary of the Reformation. Fifty years of sustained and fruitful ecumenical dialogue between Catholics and Lutherans have helped us to overcome many differences, and have deepened our mutual understanding and trust. At the same time, we have drawn closer to one another through joint service to our neighbours – often in circumstances of suffering and persecution. Through dialogue and shared witness we are no longer strangers. Rather, we have learned that what unites us is greater than what divides us. Moving from conflict to communion \\nWhile we are profoundly thankful for the spiritual and theological gifts received through the Reformation, we also confess and lament before Christ that Lutherans and Catholics have wounded the visible unity of the Church. Theological differences were accompanied by prejudice and conflicts, and religion was instrumentalized for political ends. Our common faith in Jesus Christ and our baptism demand of us a daily conversion, by which we cast off the historical disagreements and conflicts that impede the ministry of reconciliation. While the past cannot be changed, what is remembered and how it is remembered can be transformed. We pray for the healing of our wounds and of the memories that cloud our view of one another. We emphatically reject all hatred and violence, past and present, especially that expressed in the name of religion. Today, we hear God’s command to set aside all conflict. We recognize that we are freed by grace to move towards the communion to which God continually calls us. Our commitment to common witness \\nAs we move beyond those episodes in history that burden us, we pledge to witness together to God’s merciful grace, made visible in the crucified and risen Christ. Aware that the way we relate to one another shapes our witness to the Gospel, we commit ourselves to further growth in communion rooted in Baptism, as we seek to remove the remaining obstacles that hinder us from attaining full unity. Christ desires that we be one, so that the world may believe (cf. John 17:21). Pope Francis has been working on this partnership for a long time: \\nMany members of our communities yearn to receive the Eucharist at one table, as the concrete expression of full unity. We experience the pain of those who share their whole lives, but cannot share God’s redeeming presence at the Eucharistic table. We acknowledge our joint pastoral responsibility to respond to the spiritual thirst and hunger of our people to be one in Christ. We long for this wound in the Body of Christ to be healed. This is the goal of our ecumenical endeavours, which we wish to advance, also by renewing our commitment to theological dialogue. \\n“And the woman was arrayed in purple and scarlet colour, and decked with gold and precious stones and pearls, having a golden cup in her hand full of abominations and filthiness of her fornication: And upon her forehead was a name written, MYSTERY, BABYLON THE GREAT, THE MOTHER OF HARLOTS AND ABOMINATIONS OF THE EARTH.” Revelation 17:4,5 (KJV) \\nWe pray to God that Catholics and Lutherans will be able to witness together to the Gospel of Jesus Christ, inviting humanity to hear and receive the good news of God’s redeeming action. We pray to God for inspiration, encouragement and strength so that we may stand together in service, upholding human dignity and rights, especially for the poor, working for justice, and rejecting all forms of violence. God summons us to be close to all those who yearn for dignity, justice, peace and reconciliation. Today in particular, we raise our voices for an end to the violence and extremism which affect so many countries and communities, and countless sisters and brothers in Christ. We urge Lutherans and Catholics to work together to welcome the stranger, to come to the aid of those forced to flee because of war and persecution, and to defend the rights of refugees and those who seek asylum. Pope Francis wants to absorb all of the Christianity, not just the Lutherans: \\nMore than ever before , we realize that our joint service in this world must extend to God’s creation, which suffers exploitation and the effects of insatiable greed. We recognize the right of future generations to enjoy God’s world in all its potential and beauty. We pray for a change of hearts and minds that leads to a loving and responsible way to care for creation. One in Christ \\nOn this auspicious occasion , we express our gratitude to our brothers and sisters representing the various Christian World Communions and Fellowships who are present and join us in prayer. As we recommit ourselves to move from conflict to communion, we do so as part of the one Body of Christ, into which we are incorporated through Baptism. We invite our ecumenical partners to remind us of our commitments and to encourage us. We ask them to continue to pray for us, to walk with us, to support us in living out the prayerful commitments we express today. Calling upon Catholics and Lutherans worldwide \\nWe call upon all Lutheran and Catholic parishes and communities to be bold and creative, joyful and hopeful in their commitment to continue the great journey ahead of us. Rather than conflicts of the past, God’s gift of unity among us shall guide cooperation and deepen our solidarity. By drawing close in faith to Christ, by praying together, by listening to one another, by living Christ’s love in our relationships, we, Catholics and Lutherans, open ourselves to the power of the Triune God. Rooted in Christ and witnessing to him, we renew our determination to be faithful heralds of God’s boundless love for all humanity. source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742628400.8302271}