{"duration": 0.3288092613220215, "input_args": {"text": "'Senator Ted Cruz said on Friday that he would vote for Donald J. Trump for president, two months after Mr. Cruz pointedly declined to endorse his former rival in a speech at the Republican National Convention. “After many months of careful consideration, of prayer and searching my own conscience, I have decided that on Election Day, I will vote for the Republican nominee, Donald Trump,” Mr. Cruz wrote in a statement on Facebook. For Mr. Cruz, who has fashioned himself as the unbending conscience of modern conservatism, the decision to endorse Mr. Trump is the latest remarkable gamble in a career defined by them, placing him in the corner of an ideologically elastic candidate who savaged Mr. Cruz  —   and, often, the senator’s family  —   at every turn during the nominating contest. But Mr. Trump’s rise in the polls, combined with a handful of political overtures from Mr. Trump and his team in recent days, left Mr. Cruz effectively boxed in, raising the possibility that a narrow Trump defeat could be laid at his feet. In his statement, Mr. Cruz said he had based his decision on two factors: a prior pledge to support the Republican nominee  —   which Mr. Cruz said in July had been “abrogated” by Mr. Trump’s personal attacks on him  —   and his desire to defeat Hillary Clinton, the Democratic nominee. “If Clinton wins, we know  —   with 100 percent certainty  —   that she would deliver on her   promises, with devastating results for our country,” Mr. Cruz said. “My conscience tells me I must do whatever I can to stop that. ” But Mr. Cruz’s statement went beyond the perfunctory, praising the policy aims and recent campaign promises of a man he once called a “pathological liar. ” Mr. Cruz did not address the personal attacks that Mr. Trump had leveled  —   always without hesitation, often without evidence  —   against the Texas senator and his family during the nominating fight. Among other slights, Mr. Trump questioned Mr. Cruz’s eligibility for the presidency, citing his birth in Canada seemed to disparage the appearance of Mr. Cruz’s wife, Heidi, in a Twitter post and insinuated that Mr. Cruz’s father, Rafael, was involved in the assassination of President John F. Kennedy. Then there was the   nickname: “Lyin’ Ted. ” In recent weeks, several former aides and allies to Mr. Cruz had urged him not to publicly back Mr. Trump, on both principled and pragmatic grounds. Such support could be seen as jeopardizing Mr. Cruz’s professed reputation for conservative ideological purity, given Mr. Trump’s   political views, which Mr. Cruz delighted in highlighting during his presidential campaign. And by voicing his support so late in the campaign, the senator also risks feeding a perception, rampant among Senate colleagues, that he is a cynical political operator, mindful only of his own interests. At his convention speech in July, Mr. Cruz urged Republicans to “vote your conscience,” leaving the stage in Cleveland to cascading boos. The next morning, as delegates from his home state jeered him at a breakfast, Mr. Cruz said he refused to fall in line like a “servile puppy dog. ” Mr. Trump, for his part, said this summer that he would not accept Mr. Cruz’s endorsement anyway. On Friday, Mr. Trump said he was “greatly honored” to have the backing of a “tough and brilliant opponent. ” As news of Mr. Cruz’s plans surfaced, first on Politico, some Cruz allies wasted no time registering their displeasure. “I’m just trying to get this Cruz sticker off my car,” Rick Tyler, the senator’s campaign spokesman, said shortly after the endorsement was announced. “I don’t want anybody to get the wrong idea and think I’m a Trump supporter. ” Steve Deace, a prominent Iowa conservative radio host who had supported Mr. Cruz, called the senator’s decision “the worst political miscalculation of my lifetime. ” Voters’ responses were often no kinder. “I am ashamed to have supported you,” one man wrote. “Conservatism is dead,” said another. While Mr. Cruz is widely expected to pursue the presidency again, he faces a 2018 Senate   campaign first. In recent days, signs of a tentative peace between the Cruz and Trump camps had begun to surface. On Wednesday, Mr. Trump’s campaign issued a news release that was supportive of Mr. Cruz’s latest Senate venture: his opposition to the federal government’s plan to end its oversight of the internet’s master directory of website addresses. Mr. Trump also included a close Cruz ally, Senator Mike Lee of Utah, on a list of prospective Supreme Court nominees, which Mr. Cruz praised in his statement. Mr. Trump also now employs some members of the Cruz orbit: Jason Miller, who was a top adviser to the senator’s campaign, and Kellyanne Conway, who ran a   “super PAC” before becoming Mr. Trump’s campaign manager. “Hell froze over today,” Ms. Conway wrote on Twitter after the endorsement, “and it feels like heaven. ” Longtime Cruz supporters could be forgiven for experiencing whiplash. On Friday, Mr. Cruz cheered Mr. Trump’s vow to nominate justices “in the mold” of Justice Antonin Scalia, who died in February. In the primaries, he regularly disparaged Mr. Trump’s judgment on judicial matters, holding forth on a “radical   extremist” federal judge who happens to be Mr. Trump’s sister, Maryanne Trump Barry. On Friday, Mr. Cruz named Mr. Trump’s immigration policy as a bright spot. In the primaries, he attacked Mr. Trump’s proposals as “amnesty. ” On Friday, Mr. Cruz cited “national security” as a reason to to back Mr. Trump. In the primaries, the senator described Mr. Trump as so unsteady that he might even use nuclear weapons against a friendly country like Denmark on a whim. Though Mr. Cruz spoke warmly of Mr. Trump early in the primary season, telling donors he planned to “bearhug” him in the hopes of winning his supporters if Mr. Trump faded, he let fly a blistering critique of Mr. Trump’s personal and political integrity just before leaving the race. “I’m going to do something I haven’t done for the entire campaign,” Mr. Cruz told reporters in Evansville, Ind. hours before decisively losing the state’s primary in May. “I’m going to tell you what I really think of Donald Trump. ” He went on to call Mr. Trump “a pathological liar” “utterly amoral” “a serial philanderer” and “a narcissist at a level I don’t think this country has ever seen. ” If voters did not stop him, Mr. Cruz said, “this country could well plunge into the abyss. ”'"}, "time": 1742628578.5792592}