{"duration": 0.06514310836791992, "input_args": {"text": "'Breaking: Hillary Admits Guilt With 10 Revealing Words Most People Missed Posted on October 30, 2016 by Alisha Rich in Politics Share This \\nHillary Clinton held a short press conference to address the American people after the news about the FBI reopening its investigation on her secret email server went public. In her short and quick statement, she carefully explained that the American people have nothing to worry about. However, without even realizing it, she incriminated herself by admitting her guilt with just ten revealing words that most people missed. \\nJust when Hillary Clinton thought she was in the clear and free from any further questions regarding her criminal behavior, the FBI found more evidence and reopened their investigation on her secret e-mail server. Instead of preparing for the upcoming election and sealing in as many last votes as she can, Hillary’s been forced to redirect some of her attention on covering up her own lies. \\nDuring her press conference to address the public, she desperately tried to convince us all that there’s nothing to be worried about. An unidentified reporter asked, “What would you say to a voter who right now will be seeing you and hearing what you’re saying, saying I didn’t trust her before. I don’t trust her anymore right now. And they’re heading to the ballot box tomorrow.” \\nHillary’s response to this question proved her guilt with it all – and nearly everyone missed it. “You know, I think people a long time ago made up their minds about the e-mails. I think that’s factored into what people think and now they are choosing a president,” Hillary began, according to The Gateway Pundit . \\nHowever, her next ten words are what incriminates her. “I would urge everybody to get out and vote early,” Hillary said. \\nIn other words, it must be worse than we thought, and she needs her supporters to go out and vote before the investigation reveals her criminal behavior. She doesn’t want the FBI to release more information and sway her supporters to vote elsewhere, ruining her chance to be president. She’s guilty and desperate for votes. The only way she can secure those voters is if she convinces her mindless sheep to vote early before all of her dirty deeds become known. \\nIf I were Donald Trump, I’d be doing a happy dance. The real Hillary Clinton is about to be exposed, and it’s all happening mere days before the election.'"}, "time": 1742561864.3929389}