{"duration": 0.12596893310546875, "input_args": {"text": "'Ciencia y Tecnología WhatsApp admite que comprime las fotos de penes que se mandan a través de su sistema \"ME DA IGUAL SI TRAFICAN CON MIS DATOS O ESPÍAN MIS CONVERSACIONES PERO LA POLLA QUE NO ME LA RETOQUEN\", PROTESTA UNO DE LOS AFECTADOS Whatsapp \\nEl servicio de mensajería instantánea WhatsApp ha reconocido hoy que las fotografías de penes que mandan sus usuarios pueden llegar al destinatario “con una ligera compresión que en algunos casos ha llegado a recortar hasta cinco centímetros”. La compañía argumenta que comprimir las fotografías permite que el servicio sea más ágil y se disculpa por los malentendidos que haya podido ocasionar. \\n“Te pasas dos horas buscando el ángulo correcto, intentando captar el perfil bueno, esperando que esté en su máximo esplendor, y luego resulta que la ‘fotopolla’ que has mandado no se ve tal cual sino más pequeña. Es una vergüenza y ahora entiendo por qué algunas chicas no mostraban el debido entusiasmo”, se queja un usuario que ahora planea pasarse a Telegram “siempre que me aseguren que mi polla llega en alta definición”. \\nOtros consideran que la compresión de estas imágenes responde al interés de WhatsApp en acabar con el uso de su servicio para fines eróticos. “Nos quitan al negro de WhatsApp, nos recortan centímetros… esta es la verdadera manipulación de la información en plena era digital”, lamenta otra de las usuarias, precisando que “por era digital me refiero al hábito creciente de masturbarse con fotos de este tipo que nos manda la gente por privado”. \\n“A mí me da igual que trafiquen con mis datos personales, me da igual si cifran o no mis conversaciones, pero la polla que no me la retoquen porque los llevo ante el Tribunal de la Haya”, protestaba otro afectado esta mañana.'"}, "time": 1742564126.1307218}