{"duration": 0.046468257904052734, "input_args": {"text": "'Students from Cornell University hosted a protest to demand that the college provide funding to illegal immigrants. [About 250 students and faculty members attended the protest, which was organized by the Cornell Coalition for Inclusive Democracy, Heat Street reported.  “No ban, no wall. Sanctuary for all,” protesters chanted. The protesters want the upstate New York school to provide illegal immigrants, including those not protected by DACA (Deferred Action for Childhood Arrivals) with special funding. “Our endangered community members still lack explicit assurance that the institution that took them in will protect them,” Professor Russell Rickford told the Cornell Sun. “That’s shameful. ” The group also wants Cornell to provide   housing for immigrant students who have been warned not to travel overseas, and fight for legislation that protects illegal immigrants. They also want campus police not to release information about illegal immigrant students to immigration agents unless it is absolutely necessary. “State explicitly that CUPD will join the Tompkins County Sheriff and Ithaca Police Department in declining to honor civil immigration detainer requests (which is not legally required!) from a federal agent unless accompanied by a judicial warrant,” the demand read. One illegal immigrant student spoke about her struggle to obtain financial aid. “I had to sacrifice meals. I had to sacrifice having the right books. I had to do everything to thrive at this school,” Julia Montejo said. “Now that Cornell’s caught up, which is a little late for many people, Cornell is refusing to explicitly state that CUPD will not cooperate with ICE. ” Another professor told the crowd that the students would “always be in a minority” in terms of what they were fighting for. “You will always be in a minority. But, the truth is, we look back on those periods now as periods of grave injustice, where time has turned against what was done. And you don’t need the majority what you need is a very dedicated, involved minority,” Professor Joe Margulies said.  '"}, "time": 1742563575.6560094}