{"duration": 0.1263747215270996, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Mayhem in the heart of London. A lone assailant plowed a vehicle into pedestrians on the Westminster Bridge, killing two and injuring 40 others, before crashing into a railing. One of the injured later died at a hospital. He then left the vehicle and fatally stabbed a police officer outside Parliament, before he was shot and killed. The police are investigating it as a terrorist attack. The attacker’s identity has not been released, but Scotland Yard officials said they believed they knew who he was. Here’s a quick rundown of what we know  —   and what we don’t know  —   about the chaotic episode, which came on the anniversary of the Brussels Airport and subway attack. _____ 2. Republican governors are rebelling against the deep cuts to domestic programs in President Trump’s proposed budget. They’re most concerned about cuts to job training and economic revitalization programs, and to grants from the Department of Housing and Urban Development. The budget also calls for a $54 billion increase in military spending, though the U. S. already spends far more than any other country on defense. Here’s a breakdown of the military’s current size, equipment and funding. Above, Joseph Dunford, chairman of the Joint Chiefs of Staff, testified about the budget before a Senate subcommittee. _____ 3. House Republicans face an excruciating choice tomorrow. A yea vote on the bill to repeal and replace the Affordable Care Act risks havoc for voters in their districts. Voting nay risks the vengeance of the president. We’re keeping tabs on the expected votes here. If the bill goes to the Senate, negotiations could last months. _____ 4. The confirmation hearing for Judge Neil Gorsuch, Mr. Trump’s nominee for the Supreme Court, continued on Capitol Hill. Republicans lobbed softball questions on topics like mutton busting and Horse v. Duck, but Democrats grilled him  —   to little avail  —   about issues like his role in approving harsh interrogation techniques as a lawyer for President George W. Bush. “You have been very much able to avoid any specificity like no one I have seen before,” Senator Dianne Feinstein told him. _____ 5. The Republican chairman of the House Intelligence Committee suggested that U. S. intelligence agencies monitoring foreign officials may have “incidentally” picked up communications of Trump transition team members. The statement by Representative Devin Nunes of California, above, by no means indicates that Mr. Trump himself was under direct surveillance. But the White House spokesman, Sean Spicer, seized on it as “startling information,” and Mr. Trump said he felt “somewhat” vindicated. Social science research suggests that Mr. Trump’s insistence that he was wiretapped, despite the lack of evidence, is part of a pattern that plays well in a highly partisan environment. _____  6. An airstrike by the   coalition against the Islamic State killed 30 civilians in a rural area of northern Syria, according to local reports. It was the second time in a week that Syrians accused the U. S. of killing civilians with airstrikes, raising concerns that the military has become less careful, or less selective, in its targeting under Mr. Trump. Above, burning tires to disrupt warplanes in Aleppo Province. _____  7. “I can’t imagine something that was more of a nightmare. ” So says a lawyer for an Army veteran, Elliott Williams, who died in an Oklahoma jail cell in 2011. A jury awarded his family $10. 5 million this week. Immobilized by a broken neck, Mr. Williams, 37, spent his last days lying on the floor of his cell, unable to reach the food and water placed nearby by guards who did not believe his claim that he was injured. The cell’s video monitor captured 51 hours of his suffering and death. _____ 8. Spurred by the presidential election, more women are running for local elected office, from school boards to town councils to state legislatures, including Lacey Rzeszowski, above. “It’s happening all around the country,“ said an expert. “Women are looking for a way to have a voice. ” In related news, a consumer research group says sales of art supplies were up in January, thanks to protest signs. _____ 9. A scholarly sting operation is shedding light on sketchy academic journals. A fake applicant whose name meant “fraudster” in Polish applied to 360 “ ” journals, listing fake degrees and publications, asking to be an editor.   of them accepted her  —   and four made her editor in chief. _____ 10. Lovelorn men in India are trying a new strategy: calling numbers at random until they hear a woman’s voice. Intentionally dialing wrong numbers is a   way to find romance, but it’s a popular move in places where traditional gender segregation has collided   with cheap new technologies. Reports of phone stalking and harassment have increased  —   a police call center above logs such complaints. But an unknown number of phone Romeos end up in successful “  relationships. ” _____ 11. Finally, on TV tonight, the new drama “Shots Fired” follows the spring premiere of “Empire” on Fox. Our critic says “Shots Fired,” above, about police shootings in a North Carolina town, shows “a broad curiosity, one that hears every character out but doesn’t confuse empathy with  . ” And Jimmy Kimmel asked Dave Chappelle why, after 13 years, he decided to release not just one new comedy special, but two. Mr. Chappelle: “Money. ” Have a great night. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742562303.988418}