{"duration": 0.093719482421875, "input_args": {"text": "\"Syrian War Report – November 2, 2016: ISIS and Al-Nusra Attempt to Cut Off Govt Supply Line to Aleppo ‹ › South Front Analysis & Intelligence is a public analytical project maintained by an independent team of experts from the four corners of the Earth focusing on international relations issues and crises. They focus on analysis and intelligence of the ongoing crises and the biggest stories from around the world: Ukraine, the war in Middle East, Central Asia issues, protest movements in the Balkans, migration crises, and others. In addition, they provide military operations analysis, the military posture of major world powers, and other important data influencing the growth of tensions between countries and nations. We try to dig out the truth on issues which are barely covered by governments and mainstream media. China’s Growing Amphibious Capabilities (Part 1) By South Front on November 3, 2016 …from SouthFront \\nThis is the first part of the military analysis of China’s amphibious capabilities and their influence on the balance of power in the Asia-Pacific region. The second part of the analysis will be released next week. \\nThe Chinese government has achieved a great deal in terms of modernizing and increasing the capabilities of its armed forces in the past two decades and they are quickly obtaining parity with their counterparts in the West. China has made great strides along the long road to rebuild its military, so that it can compete and excel in the modern battlespace. Much has been written about the fledgling PLAN aircraft carrier program. With one conventional aircraft carrier in service, the Liaoning , and a second carrier being built, China has obviously made the commitment to acquire at least a small aircraft carrier strike capability. \\nAnother important development, perhaps less sensational and headline catching than aircraft carriers, is the growth and modernization of the amphibious capabilities of both the PLA and PLAN. Chinese military strategists realize that naval power, including naval aviation, can project power and can also provide China with the more subtle, yet very effective means of naval power presence in the region. The presence of Chinese naval power in the region can be leveraged to influence advantage in political struggles with its neighbors. Neither naval presence, nor naval power and naval air power can take (or retake) and hold ground, and thus China has decided that a modern and capable amphibious force of sufficient size is a necessary component of its overall maritime strategy. It is significant that this force has doubled in size over the past five years and has been equipped with new, high-tech weaponry and the beginnings of a viable sealift component that can carry it to battle. \\nThe beginnings of the Chinese interest in amphibious warfare dates back to the Korean War and the Peoples Republic of China’s efforts to defeat the Kuomintang in the 1950s. In 1953, the PLA established the PLA Marine Corps (PLAMC). Although comprising of two brigades of approximately 6,000 officers and men, the PLAMC have undergone a continuous transformation since the Taiwan Strait Crises of the 1990s. The force has been equipped with China’s most modern and capable small arms and equipment, and utilizes the new generation of ZBD05/ZBD2000 amphibious assault vehicles. In some ways modeled on the USMC, the PLAMC marines are highly trained in all forms of modern warfighting. They are considered a vital component of China’s rapid reaction forces, and are thus highly mobile and kept on a heightened state of readiness. \\nThe current force structure of the PLAMC is of two brigades, the 1 st Marine Brigade and 164 th Marine Brigade. Each brigade consists of one armored regiment and two marine battalions and various support elements. The PLAMC relies on the high speed of its ZBD05/2000 series vehicles to carry them from offshore amphibious platforms such as the Type 071 LPD. The ZBD05 is the world’s fastest armored amphibious assault vehicle, capable of a top speed of 45kph (27mph) in the water. In addition, PLA marines are skilled in air assault operations, small boat assaults and underwater diving operations. \\nAlthough the PLAMC represents a very potent amphibious assault and rapid reaction force, the Chinese political and military leadership realized years ago, that the force is too small to respond to multiple threats across the full scope of China’s maritime boundaries, nor large enough to mount a successful invasion of Taiwan. A viable power projection capability in the form of amphibious assault and air assault forces is seen as essential in protecting the nation’s interests in Africa, the Indian Ocean, South China Sea and East China Sea, especially as it is confronted by U.S. attempts to contain it. \\nStarting in 2014, the Chinese high command decided to expand the two established Amphibious Mechanized Infantry Divisions (AMID) to four. The 1 st and 86 th AMIDs are based in the Nanjing Military Region (Eastern Command), and the 123 rd and 124 th AMIDs are based in the Guangzhou Military Region (Southern Command). Each division is comparable to a mechanized infantry division in size and establishment. The expansion of the AMIDs gives the PLA a greater amphibious capability that might be required in the near future in deterring regional challenges to Chinese territorial claims in both the South and East China Seas, and providing a viable response to violations of its territorial integrity. \\nNone of China’s potential adversaries in the region, other than the United States Navy, have a comparable amphibious warfare force. When combined with the PLAMC, the AMIDS give Chinese diplomacy a very robust practical demonstration of force. Regularly held amphibious exercises showcasing the growing aptitude of these forces only reinforce this reality. Perhaps the most obvious challenges facing the marines and AMIDs, and a major shortcoming that is in the process of remedy, is the lack of heavy sealift capability to transport these units over long sea voyages and within striking range of their theoretical targets. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by South Front on November 3, 2016, With 6 Reads Filed under World . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742563148.505262}