{"duration": 0.047449588775634766, "input_args": {"text": "'Home / BREAKING NEWS / Report: FBI to Move to “Likely Indictment” Of Clinton Foundation Report: FBI to Move to “Likely Indictment” Of Clinton Foundation Claire Bernish November 3, 2016 1 Comment \\nA new report says the FBI investigation of the Clinton Foundation has taken a “very high priority” after dragging on for over a year in its White Collar Crime Division, and a preponderance of evidence means a forthcoming indictment is “likely.” \\nTwo unnamed, separate sources with “intimate knowledge” of the investigation told FOX News ’ Bret Baier the FBI is “actively and aggressively pursuing this case” — even re-interviewing key people for the third time. \\nIronically, one of the anonymous sources told Baier the investigation has benefited from ongoing publications by Wikileaks of Hillary Clinton campaign chair John Podesta’s emails, in that “There is an avalanche of new information coming in every day.” \\nTaken in conjunction with the rapidly approaching presidential election on November 8, it appears Julian Assange’s ‘October Surprise’ could have lasting implications beyond lifting the veil from behind-the-scenes wrangling by Clinton campaign insiders, corporate media, and Democratic National Committee. \\nHowever, even before Wikileaks began publishing the Podesta Files, unnamed law enforcement sources told FOX News , the bureau had collected “a great deal of evidence.” \\n“FBI agents have interviewed and re-interviewed multiple people on the foundation case,” FOX reports, “which is looking into possible pay for play interaction between then-Secretary of State Hillary Clinton and the Clinton Foundation.” \\nIndeed, an indictment on the pay-for-play scandal appears likely, “barring some obstruction in some way” from the Department of Justice. \\nReal Clear Politics summarized major points of Baier’s revealing report, noting the FBI’s investigation is “far more expansive than anybody has reported so far.” \\nIn fact, although previous revelations the FBI had made special “side agreements” to “destroy” the laptops of Clinton aides Cheryl Mills and Heather Samuelson — which prompted scathing criticism and doubts about possible purposeful decimation of evidence — Real Clear Politics notes those computers “have not been destroyed, and agents are currently combing through them.” \\nBaier reports, “As a result of the limited immunity deals to top aides, including Cheryl Mills and Heather Samuelson, the Justice Department had tentatively agreed that the FBI would destroy those laptops after a narrow review. We are told definitively that has not happened. Those devices are currently in the FBI field office here in Washington, D.C. and are being exploited. \\n“The source points out that any immunity deal is null and void if any subject lied at any point in the investigation.” \\nFurther, elaborating suspicions about aide Huma Abedin’s now-estranged husband’s laptop causing the FBI to relaunch its investigation, Real Clear Politics notes, “Agents have found emails believed to have originated on Hillary Clinton’s secret server on Anthony Weiner’s laptop. They say the emails are not duplicates and could potentially be classified in nature.” \\nWhile Baier’s sources, being unnamed, are impossible to verify, the FOX report comes on the heels of reporting by the Wall Street Journal — also citing unnamed sources “familiar” with the same investigation — which states, “Secret recordings of a suspect talking about the Clinton Foundation fueled an internal battle between FBI agents who wanted to pursue the case and corruption prosecutors who viewed the statements as worthless hearsay.” \\nThose sources, paraphrased by the WSJ , explained, “Agents, using informants and recordings from unrelated corruption investigations, thought they had found enough material to merit aggressively pursuing the investigation into the foundation that started in summer 2015 based on claims made in a book by a conservative author called ‘Clinton Cash: The Untold Story of How and Why Foreign Governments and Businesses Helped Make Bill and Hillary Rich.’” \\nInter- and intra-agency disputes over the strength of evidence surrounding the pay-to-play allegations against the Clinton Foundation left senior officials at both the FBI and DOJ at odds with lower-ranking investigators, who felt that — in combination with ‘Clinton Cash’ and the aforementioned recordings — promising leads deserved to be pursued. \\nInternal discord spilled into the public arena recently when FBI Director James Comey took the highly anomalous step of publicly announcing the investigation had been re-started — sparking condemnation by President Obama, politicians, and other officials about potentially influencing the looming election. \\nPartly fueling the internal squabble over investigating the foundation are those who blame Comey’s second-in-command, “deputy director Andrew McCabe, claiming he sought to stop agents from pursuing the case this summer. His defenders deny that, and say it was the Justice Department that kept pushing back on the investigation,” the WSJ reports. \\nWhile FBI agents continued making headway in an informal probe to decide whether a full investigation was warranted, official in the Justice Department began objecting to their actions, under the premise the evidence was flimsy at best — despite further statements from informants and additional information beyond what had been presented in “Clinton Cash.” \\nAs the WSJ describes: \\n“FBI investigators grew increasingly frustrated with resistance from the corruption prosecutors, and some executives at the bureau itself, to keep pursuing the case. \\n“As prosecutors rebuffed their requests to proceed more overtly, those Justice Department officials became more annoyed that the investigators didn’t seem to understand or care about the instructions issued by their own bosses and prosecutors to act discreetly.” \\nFriction between the DOJ and FBI reached a pivotal point when a ‘senior Justice Department official’ summoned McCabe to a meeting over the perception agents had rebuffed instructions from superiors not to pursue the investigation further. \\n“Are you telling me that I need to shut down a validly predicated investigation?” the WSJ quoted McCabe asking the official. \\n“Of course not,” the DOJ official is said to have replied. \\nWhether or not quashing a deeper investigation into the Clinton Foundation had, in actuality, been the Justice Department’s intent may never be clear — but given the overlapping dates of this bickering and the FOX News report of the yearlong probe, it would seem the Clintons are still very much treading water. Share'"}, "time": 1742628588.3600395}