{"duration": 0.012515068054199219, "input_args": {"text": "' \\nRepublican presidential nominee Donald Trump has reached a financial accomplishment that no other GOP candidate has before.\\nHe has amassed the largest small-donor fundraising pack that has ever been seen in the Republican Party.\\nZac Moffatt, an online fundraising expert, said that only those most committed to the candidate will typically donate.\\n \\nRelated Stories Newt Gingrich Defends Donald Trump Against ‘Sexual Predator’ Accusations Donald Trump’s Star On Hollywood Walk Of Fame Vandalized Independent Voters Push Trump To The Front In Florida And Ohio “The people who donate are your core believers,” said Moffatt, who was digital director for Mitt Romney’s 2012 campaign.\\nRomney and Sen. John McCain, the 2008 GOP nominee, each raised more overall in their respective campaigns than Trump has in total contributions.\\nHowever, Trump’s campaign has topped both of the former nominees in small individual contributions, defined as $200 or less.\\n \\nIn this category, Trump has raised more than $78.6 million thus far, based on data from the Federal Election Commission.\\nIn comparison, McCain raised $65.5 million and Romney raised $44.8 million by this point in their election races.\\nWhile McCain and Romney had significant income contributions from other sources, Trump’s small-donor income makes up 58 percent of his overall funds.\\nAccording to OpenSecrets.org, small donations are a key category because for those below $200 mark the campaigns aren’t legally required to register personal information on the donor, whereas if the donation exceeds $200 the campaign must give the donor’s name, occupation, employer and ZIP code.\\n \\nTrending Stories Frustrated With Media Bias, Trump Campaign Takes Its Case Directly To Voters With Nightly Show On Facebook Independent Voters Push Trump To The Front In Florida And Ohio RNC Official Takes CNN Host To Task For Claiming There Is No Media Bias “You could make an argument that he is the best candidate to refresh the RNC’s online fundraising database because of the different kind of donor that he’s gotten,” said Vincent Harris, a GOP digital strategist who did private digital work for Trump’s campaign.\\nAs of Oct. 19, the Trump campaign ceased all events meant to raise money for the party’s get-out-the-vote effort, electing instead to have Trump focus on getting across his final message to voters.\\n“We’ve kind of wound down,” said Steven Mnuchin, Trump’s national finance chairman. “But the online fundraising continues to be strong.”\\n“We have minimized his fundraising schedule over the last month to emphasize his focus on political [events],” Mnuchin continued. “Unlike [Democratic nominee] Hillary [Clinton], who has been fundraising and not out and about, he has constantly been out and about.”\\nThis decision has been questioned by some given that Clinton’s campaign has raised $445.4 million, according to OpenSecrets, which is $226.6 million more than the $218.8 million Trump has raised.\\nClinton has 41 events lined up before Nov. 4.\\nWhat do you think?'"}, "time": 1742628561.4014585}