{"duration": 0.06972265243530273, "input_args": {"text": "\"Email \\nIt has become increasingly apparent that the Obama administration looks upon the First Amendment protections of religious liberty as meaningless — if it contradicts its liberal social agenda. \\nThis is demonstrated in a recent mandate from the federal Department of Health and Human Services (HHS) that physicians and other healthcare workers must perform surgeries to “alter” people's gender. Objections raised on the grounds that the physician views the surgery as harmful to the patient’s mental health, or that the surgeon has religious or ethical objections, do not matter. If surgeons refuse, they can face fines or even the loss of their jobs. \\nThe mandate includes surgeries on children. \\nThousands of healthcare providers and eight states are now challenging the validity of the federal rule. \\nObviously, Congress has never passed any such law, but HHS is exercising what is sometimes called “administrative law,” in which federal bureaucrats simply develop rules that implement a law — all according to the interpretation of the bureaucrats, of course. In this instance, the rule is said to apply to all private doctors, healthcare providers, and health insurance plans that accept federal funding, but it does not provide a religious exemption for medical personnel who find “sex-change operations” contrary to their religious beliefs. \\nIt is estimated that the rule will impact almost one million physicians and most hospitals in the United States — because almost every hospital receives some federal funds. (This is yet another example of how the federal government can use the threat of withholding federal monies to force compliance.) \\nThe transgender mandate’s legal “justification” is similar to that used in May when the Departments of Education and Justice ordered public schools and universities to allow transgender students to use the restroom and locker room they “identify” with, rather than the one that conforms to their biological sex. As in the present case, the Obama Education Department and Justice Department intend to get their way by threatening the loss of federal funds. \\nTo accomplish the order, the Obama administration simply redefined the meaning of the word “sex.” In an HHS rule that persons cannot be discriminated against because of their “sex,” the Obama administration claims that “sex” really means “gender.” And it argues that “gender” can be male, female, neither, or some combination thereof, which may be different from an individual’s sex at birth. In other words, when the doctor tells the baby’s parents, “It’s a boy,” or “It’s a girl,” perhaps they need to add “for the time being.” \\nUsing this reasoning, HHS is insisting that it is “sex discrimination” to refuse to perform a gender transition procedure. The healthcare professionals and states that have challenged the rule argue that the HHS regulation violates the U.S. Constitution and federal laws. \\nThe legal motion made by those seeking to overturn the rule states, “Thus, with a single stroke of the pen, HHS has created massive new liability for thousands of doctors unless they cast aside their convictions and perform procedures that can be deeply harmful to their patients.” About four dozen members of the U.S. House of Representatives sent a letter in October to HHS Secretary Sylvia Burwell expressing their outrage about the regulation and asking her a dozen questions about the rule. \\nSuch a procedure is particularly irresponsible when performed upon children, if two recent studies on this subject are correct. According to the studies, as much as 94 percent of children who report “gender dysphoria” grow out of that discomfort. Gender dysphoria is defined as a discomfort a person may feel in regard to his or her biological sex. This means that in almost every case, the person eventually will accept his or her biological sex; however, if surgery has already been performed, the person is left in a tragic situation, all to conform to a radical social agenda. \\nIn Wichita Falls, Texas, federal judge Reed O'Connor issued an injunction on October 18 against the Obama administration’s transgender directive to schools. This ruling has encouraged a Christian association of more than 10,000 physicians and a Roman Catholic hospital system to ask the federal court in Wichita Falls to issue a similar injunction to block enforcement of the HHS regulation. Eight states have joined in the motion. \\nThe motion states that the rule “forces doctors and hospitals to perform controversial and potentially harmful medical procedures that purport to permanently alter an individual’s sex — even when doing so would violate a doctor’s religious beliefs and medical judgment, and even when the government’s own programs exclude the procedures as potentially harmful.”  \""}, "time": 1742564026.255719}