{"duration": 0.15329790115356445, "input_args": {"text": "'MILWAUKEE  —   Four barbers and a firefighter were pondering their future under a Trump presidency at the Upper Cutz barbershop last week. “We got to figure this out,” said Cedric Fleming, one of the barbers. “We got a gangster in the chair now,” he said, referring to   Donald J. Trump. They admitted that they could not complain too much: Only two of them had voted. But there were no regrets. “I don’t feel bad,” Mr. Fleming said, trimming a mustache. “Milwaukee is tired. Both of them were terrible. They never do anything for us anyway. ” As Democrats pick through the wreckage of the campaign, one lesson is clear: The election was notable as much for the people who did not show up, as for those who did. Nationally, about half of eligible voters did not cast ballots. Wisconsin, a state that Hillary Clinton had assumed she would win, historically boasts one of the nation’s highest rates of voter participation this year’s 68. 3 percent turnout was the fifth best among the 50 states. But by local standards, it was a disappointment, the lowest turnout in 16 years. And those   were important. Mr. Trump won the state by just 27, 000 voters. Milwaukee’s   neighborhoods offer one explanation for the turnout figures. Of the city’s 15 council districts, the decline in turnout from 2012 to 2016 in the five poorest was consistently much greater than the drop seen in more prosperous areas  —   accounting for half of the overall decline in turnout citywide. The biggest drop was here in District 15, a stretch of fading wooden homes, sandwich shops and   restaurants that is 84 percent black. In this district, voter turnout declined by 19. 5 percent from 2012 figures, according to Neil Albrecht, executive director of the City of Milwaukee Election Commission. It is home to some of Milwaukee’s poorest residents and, according to a 2016 documentary, “Milwaukee 53206,” has one of the nation’s highest   incarceration rates. At Upper Cutz, a bustling barbershop in a   wooden house, talk of politics inevitably comes back to one man: Barack Obama. Mr. Obama’s elections infused many here with a feeling of connection to national politics they had never before experienced. But their lives have not gotten appreciably better, and sourness has set in. “We went to the beach,” said Maanaan Sabir, 38, owner of the Juice Kitchen, a brightly painted shop a few blocks down West North Avenue, using a metaphor to describe the emotion after Mr. Obama’s election. “And then eight years happened. ” All four barbers had voted for Mr. Obama. But only two could muster the enthusiasm to vote this time. And even then, it was a sort of protest. One wrote in Mrs. Clinton’s Democratic opponent, Senator Bernie Sanders of Vermont. The other wrote in himself. “I’m so numb,” said Jahn Toney, 45, who had written in Mr. Sanders. He said no president in his lifetime had done anything to improve the lives of black people, including Mr. Obama, whom he voted for twice. “It’s like I should have known this would happen. We’re worse off than before. ” But Mr. Obama did do something important: “He did give black people something to aspire to. That’s a lot. I’m happy my son was able to see a black president. ” Mr. Fleming, 47, who has been trimming hair, beards and mustaches for 30 years, had hoped his small business would get easier to run. But it hasn’t. “Give us loans, or a 401( k),” he said, trimming the mustache of Steve Stricklin, a firefighter from the neighborhood. His biggest issue was health insurance. Mr. Fleming lost his coverage after his divorce three years ago and has struggled to find a policy he could afford. He finally found one, which starts Monday but costs too much at $300 a month. “Ain’t none of this been working,” he said. He did not vote. Mr. Albrecht, of the election commission, said other factors contributed to the decline in turnout. This was the first general election under new state laws that required voters to produce an approved photo ID card, and that stiffened the requirements for new voters to prove their residence. This was particularly onerous for the poor, who move often. Mr. Albrecht said he believed this change had cost several thousand people in the city their vote. “To me that’s very significant,” he said. “It takes away from the fairness and integrity of the election. ” Although two federal district courts had ruled that the photo ID law discriminated against   who disproportionately lack the approved IDs, the law was applied on Election Day after an appeals court stayed one of the decisions. Gov. Scott Walker, a Republican who backed the laws, has said they have no impact on voter participation, and Mr. Albrecht allowed that their effect on Milwaukee’s turnout would not have erased Mr. Trump’s victory in the state. Perhaps the biggest drags on voter turnout in Milwaukee, as in the rest of the country, were the candidates themselves. To some, it was like having to choose between broccoli and liver. “I felt cornered,” said Ian Pfeiffer, 25, who works the grill at Jake’s Delicatessen and says he did not vote. “We were stuck between Trump and Hillary. They really left us with no choice. ” Mr. Pfeiffer’s grandmother, an avid supporter of Mrs. Clinton, spent months trying to convince him to vote for her. But he could not get over his revulsion at what he saw as trust issues related to the Clinton Foundation. (Mr. Pfeiffer’s grandfather pushed him toward Mr. Trump, but he found him even less appealing.) He thought Oprah Winfrey would be a good candidate. “Hey, would you vote for Oprah Winfrey?” he said in a loud voice to a line of customers. “Yeah, I’d vote for her,” said Erin Miles, 41, a financial services worker waiting for her sandwich. “She has a level head and   skills. ” Few of the men and women interviewed on West North Street last week had voted for Mr. Trump, though many said they admired him. (He spoke his mind. He was rich.) “If I would have voted, I would have voted for him,” said Andre Frierson, 40, a security guard working the evening shift at Jake’s. “From a business perspective, I loved him. ” As for Mrs. Clinton, “other countries probably wouldn’t have respected us because we had a woman running the country,” he said. One exception was Justin Babar, who said he voted for Mr. Trump as a protest against Mrs. Clinton. He blamed her husband’s policies for putting him in prison for 20 years. As for the claims of racism that have dogged Mr. Trump, Mr. Babar wasn’t so worried. “It’s better than smiling to my face but going behind closed doors and voting against our kids,” he said. Tarvus Hawthorne, 45, a program coordinator at a local nonprofit, agreed. “He was real, unlike a lot of liberal Democrats who are just as racist” but keep it hidden, he said, his jaw slathered with shaving cream. “You can reason with them all day long, but they think they know it all. They want to have control. That they know what’s best for ‘those people. ’” Still, he voted for Mrs. Clinton, as did many others here. Upper Cutz gets busier as the day wears on. Children come in after school. Danielle Rogers, Mr. Toney’s sister, stopped by the barbershop for a visit. Everybody agreed they would miss Mr. Obama. Ms. Rogers said Mr. Obama had aged a lot. “It’s like having a bunch of bad kids,” she said. “He’s probably saying: ‘I’m done. Take them back to their mama’s house. ’” Mr. Fleming was trying to imagine Mr. Trump as president. “The White House is going to be the penthouse!” he said, adding that Mr. Trump would be like Al Pacino in “Scarface,” with parties in the mansion and exotic animals roaming around the grounds. “If he comes home and finds his wife cheating on him, he could just say, ‘Let’s go to war! ’” They were laughing. But they were also worried. “He’s going to mess with us on some racist level,” said Otis Jackson, 45, a barber who did not vote. “He’s already appointed a known racist,” he said, referring to Stephen K. Bannon, Mr. Trump’s chief strategist and the former head of Breitbart News, which has been denounced as a white nationalist hate site. With so many people sitting in his chair over the years, Mr. Fleming has developed a keen sense of where society is headed. But now he is stumped. “This was a weird election,” he said, holding a set of clippers and looking pensive. “You can’t tell what’s on people’s minds. There are less cars out there. No one wants to come out. No one knows what comes next. ” He added, “Hell, Trump doesn’t even know. ”'"}, "time": 1742563787.2513745}