{"duration": 0.10262942314147949, "input_args": {"text": "'Scott Pelley, host of CBS News’ 60 Minutes, embarrassed himself in a Sunday segment about “fake news”  —   despite having the final cut on a hostile interview with a   activist. [Mike Cernovich  —   a lawyer, independent    and a dominant voice on Twitter  —   built up significant buzz for 60 Minutes by revealing on Thursday he had granted Pelley a   interview. In the hours before the live broadcast, Cernovich anticipated that the   conversation would be “selectively edited” and   published a partial transcript.  That concern is based on a long history of network news programs using misleading or downright comical editing to put conservatives in the worst possible light. As the segment aired, Pelley’s opening statement made it clear this story was a smear job: In this last election, the nation was assaulted by impostors masquerading as reporters. They poisoned the conversation with lies on the left and on the right. Many did it to influence the outcome  —   others just to make a buck. The president uses the term “fake news” to discredit responsible reporting that he doesn’t like. But we’re going to show you how con artists insert truly fake news into the national conversation with fraudulent software that scams your social media account. The stories are fake, but the consequences are real. [emphasis added] Later on, Pelley introduced Cernovich with   depicting him, rather unsubtly, like a little boy hunched over his laptop  —   calling him “a magnet for readers with a taste for stories with no basis in fact”: Even with this   setup, Pelley ended up humiliating himself  —   not his target. Watch the key exchange: That story got so much traction, it had to be denied not only by Clinton’s doctor, but by the National Parkinson’s Foundation. ( ) pic. twitter.   —   60 Minutes (@60Minutes) March 27, 2017,  Pelley brought up an article on Cernovich’s website where a physician, who later outed himself as Orlando anesthesiologist Dr. Ted Noel, argued that an explanation for Clinton’s bizarre physical tics could be Parkinson’s disease. While confronting Cernovich about the oversold headline (“Hillary Clinton Has Parkinson’s Disease, Physician Confirms”) Pelley exposed his own credulous belief in an unproven claim: Cernovich: She had a seizure and froze up walking into her motorcade that day [September 11, 2016]. Pelley: Well, she had pneumonia. I mean —   Cernovich: How do you know? Who told you that? Pelley: Well, the campaign told us that. Cernovich: Why would you trust the campaign? Pelley: The point is you didn’t talk to anybody who’d ever examined Hillary Clinton. Cernovich: I don’t take anything Hillary Clinton is gonna say at all as true. I’m not gonna take her on her word. The media says we’re not gonna take Donald Trump on his word. And that’s why we are in these different universes. Pelley has no answer for those six words  —   “Why would you trust the campaign”  —   as his entire profession goes berserk with   fact checks for every tweet from President Trump. Pelley also seems to forget the fakery that Clinton World attempted hours before its pneumonia statement  —   with the candidate smiling and waving outside her daughter’s apartment, greeting a little girl, and assuring reporters everything was  . Clinton just left her daughters apartment. When asked how she was feeling, Clinton said, ”Great. I’m feeling great.”  —   Dan Merica (@danmericaCNN) September 11, 2016,  Cernovich’s followers  —   and even some of his biggest detractors  —   declared the interview a loss for Pelley:   …    and you can see it in the exact moment Cernovich flipped the interview on Pelley pic. twitter.   —   Matt Pearce (@mattdpearce) March 27, 2017,  @mattdpearce pelley was surprisingly unprepared,  —   Will Sommer (@willsommer) March 27, 2017,  Cernovich is a crazy person and a con man but Pelley walked right into that buzzsaw.  —   Stephen Miller (@redsteeze) March 27, 2017,  shamefully stupid piece connecting cernovich to people who buy twitter bots,  —   noah kulwin (@nkulw) March 27, 2017,  @occhipig Pelley’s response sucked but he’s responding to an item WITH NO BASIS IN FACT. But I’m honestly not here to convince you.  —   Richard Deitsch (@richarddeitsch) March 27, 2017,  Charlie Warzel of BuzzFeed said Pelley “didn’t do his homework on Cernovich  …     And it showed, despite the fact that CBS got to edit down the video [emphasis added]. ” Cernovich has since published another partial transcript of his conversation with Pelley and called for CBS to release the full video, crediting his appearance with bumping the show’s recent average of 10. 8 million viewers to somewhere between 14 and 16 million viewers.'"}, "time": 1742561841.9337583}