{"duration": 0.1112816333770752, "input_args": {"text": "\"Citizen journalism with a punch Clinton Suggested US Should Rig a Foreign Election — But Don't Expect the Media to Care Originally appeared at RT \\nHillary Clinton has spent a disproportionate amount of time lately complaining — without evidence — about “the Russians” interfering with the US election. But it turns out that interfering in foreign elections is totally fine if you’re the United States. \\nClinton has used this notion of Russian interference as a non-stop talking point throughout her campaign. Any and all scandals she has faced have been blamed on Moscow, and she has used alleged Russian involvement as a convenient distraction. Her supporters have enthusiastically adopted the talking point. In light of the FBI’s decision to reopen the investigation into her use of a private email server, one congressman actually suggested that Russia may be behind the FBI’s decision. Yes, Russia has now infiltrated the FBI, which is working with Vladimir Putin to elect Trump and destroy Hillary. It’s all a massive conspiracy. \\nSo, you would think given her apparent distaste for other countries supposedly meddling in the American electoral process, that Clinton wouldn’t have been caught on tape suggesting very candidly to a group of journalists that the US should have rigged a foreign election. \\nBut she was. The tape is from a 2006 meeting Clinton held with the editorial board of the Jewish Press when she was running for re-election as senator for New York. Here is the quote in full, so there can be no accusations of taking it out of context: \\n“I do not think we should have pushed for an election in the Palestinian territories. I think that was a big mistake — and if we were going to push for an election, then we should have made sure that we did something to determine who was going to win.” \\nThat’s right. Clinton suggested the US should have made sure the outcome of a Palestinian election went in its favor. She was referring to the 2006 election for the second Palestinian Legislative Council, which saw the US-favored Fatah lose to Hamas (45 seats to 74 seats). \\nThis is one of those stories that will be largely ignored or played down by the American media, which favor Hillary Clinton over Donald Trump, and see it as their duty to get her elected. If Trump had made the same remarks, we would never hear the end of it. No doubt, some will try to water down the comment and imply that Clinton didn’t really mean what she said. But there is frankly no other way to interpret her words. This is Hillary Clinton casually suggesting that the US should have rigged a foreign election in its favor. \\nHow else can you “determine” the outcome of an election before it happens? How else can you be “sure” who is going to win in advance? All the polling data in the world could end up being wrong — so unless you do something unsavory to fully ensure the outcome, then there’s no way you can be “sure” of anything. But don’t hold your breath waiting for journalists to push Clinton on what exactly she had in mind when she said the US should have done “something” about it. \\nEli Chomsky, the journalist that released the tape, told the Observer that in the 2006 meeting with Clinton, he was surprised that “anyone could support the idea — offered by a national political leader, no less — that the US should be in the business of fixing foreign elections.” Chomsky’s bosses at the Jewish Press at the time felt the comments were not “newsworthy,” and so they weren’t published. In reality, he admitted, they simply didn’t want to offend Clinton should they need her “down the road.” Convinced it was in fact newsworthy, Chomsky held on to the tape for 10 years. \\nClinton’s casual suggestion to influence an election in the US’ favor takes on more significance in light of the revelations that her campaign was working with the ‘neutral’ Democratic National Committee (DNC) to ensure she won the presidential nomination over Bernie Sanders. \\nStrangely enough, as the Observer also noted, in answering a question about the US talking to its enemies, the Clinton of 2006 sounded more like the Donald Trump of 2016. Asked if it was “worth talking to Syria,” she said that she didn’t see how it could hurt to talk to your adversaries, citing the fact that the US and the Soviet Union never stopped talking to each other. She continued: “But if you say, ‘they’re evil, we’re good, [and] we’re never dealing with them,’ I think you give up a lot of the tools that you need to have in order to defeat them…” \\nThis is particularly odd because Clinton in recent years has been one of the biggest cheerleaders of the ‘Russia is evil and America is good’ ideology. But again, don’t expect Clinton to be questioned rigorously on any of this. American journalists only have 10 days left to get her elected. They’re not going to bother worrying about irrelevancies like the fact that she’s evidently totally fine with foreign election rigging. \\nYou really couldn’t make this stuff up. Clinton spends months pretending to be outraged over Russia interfering in the US election (with no solid evidence), and then audio emerges of her unequivocally suggesting Washington should have rigged a Palestinian election. The level of hypocrisy and irony here is hard to fathom. \\nNo doubt, one person who will enthusiastically pick the story up is Clinton’s opponent Donald Trump, who has been suggesting for months that she will somehow manage to rig the presidential election against him. \\nClinton herself will probably find a way to pin the release of the tape on the Russians.\""}, "time": 1742564198.0749424}