{"duration": 0.13041353225708008, "input_args": {"text": "\"From Sprott’s Thoughts : \\nThe yellow metal advanced mightily in the first six months of this year and then held those gains for the next three, so it was not a surprise to see it give up some ground in October. \\nThe correction is providing an opportunity to enter stocks that we thought got away. The question is precisely when to make those moves. \\nThat’s both tough and easy. It’s tough – impossible actually – to know exactly when and how this correction will bottom. It is much easier to look at historic patterns and overlay significant pending events to estimate likely time frames. \\nLooking ahead from here, there are a couple pertinent patterns. Gold’s strength declines in the final months of the year. September is almost always good and October often is as well, though the tenth month starts with a weeklong holiday in China that creates an opportunity for gold shorters to hammer the price while Chinese traders, who would usually counter such a push, are away. Shorters used that opportunity this year: gold started to fall the first trading days of the month, precisely when China was on vacation. Had Chinese traders been at their desks, I imagine the fall would have been less. The Indian wedding season runs from October through December, after the monsoons are over and before the heat really ramps up. You have undoubtedly heard about the importance of Indian weddings to gold demand, but it’s a topic worth repeating. A large percentage of the money spent on an Indian wedding goes into gold, which adds up to a lot in a nation as populous as India. And the season could be especially good this year because the monsoons were fantastic, which means Indian farmers are not stressing about a third year of drought. Indian farmers make up about a third of the country’s gold demand. Broadly speaking, 2016 has seen two kinds of gold investors: short-term speculators and long term value hunters. The first group moved into gold as it gained and many of them likely ditched in the drop. The second group probably took some money off the table during the year but left core positions intact, guided by the belief that the run is just getting going. As we approach the end of the year, these two groups have different concerns: Short term specs: Want to book gains. If they didn’t sell already, they will sell once the sector strengthens some. That being said, if the public narrative turns pro-gold again this group will buy back in, which is possible if 2017 starts the way 2016 started. Long term value hunters: Want to position in stocks offering the best leverage to gold and/or exploration opportunity, while also managing capital. On that second point, I expect to see some tax gain selling before the end of the year. I know, after five bad years that concept may seem foregin – but investors booked a lot of tax losses in the bear market and many will look to lock in some gains against which they can apply those losses, especially in jurisdictions where tax losses expire. More generally, why not lock in some tax-free gains and then re-enter on a down day? The December Fed meeting is very significant for gold. If things continue the way they are now, expect a rate hike. Gold will sell down in advance of and right after that event – but remember, gold’s early 2016 rally got going only a few weeks after the last rate hike. Corrections are rarely V-shaped. Instead, they often look more like a W. The gold price decline we just went through is likely the first low point in the pattern. The forces outlined above could create a small lift over the next few months (Indian buying on the gold side, value hunter buying on the equities side) that leads into a second low (selling by specs who aren’t already out, tax gain selling by long terms players, apprehension around the Fed meeting), all of which sets up for the W to wrap up in a January rally. \\nJordan Roy-Byrne of TheDailyGold.com demonstrated this pattern fantastically: \\nThe chart uses the HUI Index as a proxy for gold stocks and compares today with corrections in 2001, 2002, and 2006. Each followed a very strong advance, like we just experienced. \\nThe corrections in 2001 and 2006 show the W pattern, though the 2001 W is pretty flat. In 2002 the correction followed a W pattern until falling for a third time. \\nHistory doesn’t repeat, but it does rhyme. The rhyming pattern to note is that corrections don’t have flat bottoms; they oscillate, often twice but potentially thrice (or otherwise). Be aware such oscillations are pending and try to time your buys accordingly. \\nThe durations are also interesting – the 2001 and 2006 corrections lasted 5 months, which takes us from early August (when HUI peaked) through to early January- right on schedule. \\nOf course when it comes to gold, the metal itself is only part of the equation. Also important are the US dollar and rates. \\nThe dollar was the main culprit behind gold’s October slide. The US Dollar Index gained 2.6% in the first two weeks of the month, a significant move largely because it broke above the highpoint of the band in which the greenback had been trading since the spring. \\nWhy the rise? Largely because the pound has been getting hammered since Theresa May started talking about Brexit realities: timelines for negotiations and her preference for a “hard Brexit” to speed things along. When one currency declines another has to rise, and so it was with the pound and the dollar. \\nAs for rates, US data continues to be middling. The market hoped for some clarity on inflation with the release of the September Consumer Price Index, but the numbers were nonchalant. Headline consumer inflation rose 0.3% month-over-month as expected, but core inflation rose just 0.1%, which was less than expected. \\nExpectations aside, it is notable that the core rate has now stayed above 2% year-over-year for eleven months. Stronger oil prices should add to headline inflation going forward, so inflation has met the Fed’s target. \\nInflation, however, is one of three targets the Fed says need to be met for a rate hike. The other two are unemployment below 5%, which has been essentially the case for some time now, and GDP growth of at least 2%, which is looking less and less likely with each passing day. \\nI’m not sure the GDP miss matters. What is really on the line right now is Federal Reserve credibility. And if that sounds familiar, it’s because we had this exact conversation around this time last year, leading up to the December meeting where Yellen and Co. did raise rates. \\nThe situation was strikingly similar. The dollar was very strong, having retained its big 2014 move to stay above 93 all through 2015. That greenback strength was all but preventing inflation and hurting US corporations. Raising rates supports the dollar, which had Yellen in a difficult position. But after talking about hikes for so long, the Fed had to move. \\nA year later, the same thing. Dollar strength is hurting earnings for multinational US companies, hampering inflation, and slowing GDP growth, but Yellen has a credibility problem and so a rate hike is likely. \\nSo oscillations until December because of seasonal pressures and rate hike expectations…and then, if historic patterns around W-shaped corrections and gold’s reaction to rate hikes persist, we could be looking at a strong start to 2017. \\nThat means this fall may be the time for patience and using patterns to position your portfolio for gold’s next leg up. \\nThis entry was posted in Gold News and tagged gold update , Sprott's Thoughts . Bookmark the permalink . Post navigation\""}, "time": 1742562976.5220835}