{"duration": 0.02486872673034668, "input_args": {"text": "'BERLIN (AP)  —   Germany’s foreign minister says there may now be a chance of a “soft” British exit from the European Union that keeps the U. K. in the bloc’s single market, but is warning that Britain couldn’t pick and choose its conditions. [Brexit negotiations start on Monday, with question marks over Britain’s approach after Prime Minister Theresa May lost her parliamentary majority in an election meant to strengthen her hand in the talks.  German Foreign Minister Sigmar Gabriel told Sunday’s Welt am Sonntag newspaper that “maybe there is now a chance to achieve a   ‘soft Brexit. ’” But he said staying in the single market would require Britain to accept EU workers’ freedom of movement. It also would have to accept the jurisdiction of the European Court of Justice, “or at least a joint court that is staffed by Europeans and Britons” and in principle follows the ECJ’s rulings, Gabriel said. For many Brexit advocates, those conditions would be impossible to accept as last year’s referendum campaign focused on getting back control over laws and immigration from the EU. Gabriel said “it would naturally be best if Britain didn’t leave at all. ” “It doesn’t look like that at the moment,” he added. “But we want to keep the door open for the British. ” The   Social Democrat strongly criticized May’s Conservatives, saying that they “played with the emotions of citizens in Britain, told fake news about Europe and left people unclear about what consequences this would all have. ” Referring to the “difficult, even impossible situation” created by the indecisive election, he added: “here, those who created such chaos would have long since gone. ” “We will negotiate fairly,” Gabriel was quoted as saying. “And fair means that we want to keep the British as close as possible to the EU  —   but never at the price that we divide the remaining 27 EU states. ”'"}, "time": 1742561865.2059333}