{"duration": 0.13909459114074707, "input_args": {"text": "'Earlier this year, it was reported that the Clintons have been involved in selling Uranium ore to the Russians for millions of dollars , which later was sold to Iran , and part of that discovery was tied to the imprisonment of Dwight and Steve Hammond, two ranchers from Oregon who were accused of terrorism , even though they only were doing what the Bureau of Land Management has been doing without consequence . Now, GOP presidential candidate Donald Trump is making the Clintons\\' dealings with the Russians over Uranium a big issue heading into next week\\'s election. It\\'s also renewing interest in documents the were discovered earlier this year when Ammon Bundy and several other patriots occupied the Malheur Wildlife Reserve in Oregon and were subsequently arrested, for which they were recently acquitted on all charges . \\nReporter Pete Santilli , who was at Malheur and had all charges dismissed against him in September said , \"Before being arrested I was researching and reporting on the connection between Malheur, Hillary Clinton , and Uranium One. I was arrested the day after I released the [ Hammond Legal Files ] and at that point my investigation was effectively stopped; now that Donald Trump has brought the issue back into the spotlight, I thought we should take another look.\" \\nDeb Jordan reports for Guerilla Media Network: \\nThe Hammond Legal File, is a 682 page legal history of the Hammond family\\'s decades\\' long fight over land rights with the BLM and Department of Fish and Wildlife in Harney County, Oregon. Nestled in the pages was a letter that Santilli dubbed, \"The Mineral Letter\" and has never been seen until now. \\nThe letter was addressed to Chad Karges, head of \"The Department of Fish and Wildlife\" whose office is located at the Refuge. While the letter did not reveal a clear connection between Malheur and Uranium One, we did find it revealed that as of 2012 the mineral rights – surrounding and inside the property itself, belonged to 2 private investment firms. That information coupled with Uranium One\\'s Facebook post does open the door for possibility. \\n\\nThe letter is of great interest because just a short time before it was written to Karges, it was being widely reported that Oregon Energy llc [a subsidiary of Uranium One] was poised to start mining for Uranium in Oregon. \\nBob Robertson, the Attorney from Medford Oregon who wrote to Karges in July of 2012, and is also the administrator of Mountain Star Investments LLC, one of the principal mineral rights owners on the refuge, explains in the letter; The joint venture owns a total interest of 22,000 acres of mining reservations around and inside the Refuge including the parcel the Refuge Headquarters sits on. \\nIF YOU WOULD LIKE TO HELP SUPPORT PETE SANTILLI & DEB JORDAN PLEASE CLICK \\nJames M. Lemons is the owner of multiple companies in Texas and also owns the other investment company mentioned in the letter, JM&L Investment LTD. Among his holdings is a company called Fellowship of The Metroplex, a string of bankrupt churches throughout Texas and other Western States. This does not fit the profile of a man who supposedly owns 22,ooo acres of mineral rights, that includes the Malheur Refuge headquarters. \\nThe problem with Lemons is, he seems to own shell companies that really don\\'t produce anything. One researcher for this article claimed; \"This is not uncommon in cases like these, and it is highly probable James M. Lemons is not even a real person.\" \\nBob Robertson claims in the letter that Mountain Star Investments LLC was a company in 2012, but the information on the web says the company was not formed until 2014. It is listed only as an investment company. \\nSince both companies leave much to the imagination, I will leave this section open for updates as obviously more research needs to be done. Is there a connection to Uranium One? That questions yet to be fully answered. \\nThis gets to the heart of why the Hammond land was at stake in the Oregon fiasco. As I reported in January , the Hammond\\'s Ranch is rich in Uranium and other minerals. In fact, it\\'s worth billions! \\nSantilli says that the central government continues to refuse to admit that the BLM\\'s illegal land grab is all about Uranium. \\nIf this is not enough information to point out the Uranium-rich area of Oregon, then have a look at the BLM\\'s own website where they document the following: \\nUranium on BLM-Administered Lands in OR/WA \\nIn September 2011, a representative from Oregon Energy, L.L.C. (formally Uranium One), met with local citizens, and county and state officials, to discuss the possibility of opening a uranium oxide (\"yellowcake\") mine in southern Malheur County in southeastern Oregon. Oregon Energy is interested in developing a 17-Claim parcel of land known as the Aurora Project through an open pit mining method. Besides the mine, there would be a mill for processing. The claim area occupies about 450 acres and is also referred to as the \"New U\" uranium claims. \\nOn May 7, 2012, Oregon Energy LLC made a presentation to the BLM outlining its plans for development for the mine. \\nThe Vale District has agreed to work with Oregon Department of Fish and Wildlife on mitigation for the \"New U\" uranium claims, which are located in core sage grouse habitat. Although the lands encompassing the claims have been designated core, the area is frequented by rockhounds and hunters, and has a crisscrossing of off-highway vehicle (OHV) roads and other significant land disturbance from the defunct Bretz Mercury Mine, abandoned in the 1960s. \\nHowever, by the fall of 2012 the company said that it was putting its plans for the mine on hold until the uncertainty surrounding sage grouse issues was resolved. \\nYes, the BLM is an illegal, anti-American entity that believes it has an authority superior to the US Constitution , but it has no power at all. It has been established in opposition to the Constitution, and we were warned about these goons long ago by Ron Paul . \\nWhile many have laughed at scoffed at Dr. Paul, he has proven to be right over and over in what he warned us about. When are people going to wake up to the truth? \\nThe email scandals of Hillary Clinton should be enough to have had her arrested, yet she is still on the ballot. This sale of Uranium to America\\'s enemies is treason. It doesn\\'t get any more in your face than that, but the fact that she is still on the ballot for the highest office in the land speaks volumes to the corruption that is in DC and what the American people tolerate. Don\\'t forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here . shares'"}, "time": 1742561958.9979265}