{"duration": 0.052486419677734375, "input_args": {"text": "'Jon Rappoport \\nIf you wanted to buy a product, and the main source of research on the product was the company selling it, would you automatically assume the product was safe and effective? \\nBut you see, that’s the just the beginning of the problem. Suppose the company’s research was cited thousands of times in the press, as the authoritative standard of proof—and anyone who disputed that research was labeled a conspiracy theorist and a quack and a danger to the community and an anti-science lunatic. \\nWould you begin to suspect the company had some awesome media connections? Would you suspect some very powerful people were backing the company? \\nThis is exactly the situation with the US Centers for Disease Control (CDC). Read these two quotes: \\nThe government’s Vaccine for Children Program (a CDC organization) purchases vaccines for about 50 percent of children in the U.S.” (The Atlantic, February 10, 2015) \\n“The CDC currently spends over $4 billion purchasing vaccines [annually] from drug makers…” (Health Impact News, October 24, 2016) \\nHowever, the CDC is also the gold standard for research on the safety and efficacy of vaccines. It turns out an unending stream of studies on these subjects. And the results of those studies are dutifully reported in the mainstream press. \\nDo you think, under any circumstances, the CDC would publish data showing vaccines are ineffective and dangerous? They’d be cutting their own throats. \\n“Well, we spend $4 billion a year buying vaccines from drug companies, but guess what? These vaccines are often dangerous…” \\nEvery time you read about a CDC study on vaccines, keep this obvious conflict of interest in mind. \\nWhen, in 2014, William Thompson, a long-time CDC researcher, publicly admitted he and his colleagues had buried data that would have shown the MMR vaccine increases the risk of autism, he was throwing a stick of dynamite into the whole CDC operation. He was also saying, in recorded phone conversations, that the CDC was lying about vaccine safety in other studies. \\nThis is why major media refused to cover or investigate Thompson’s claims. This is why they spread a blanket of silence over his revelations. \\nThompson was threatening a $ 4-billion-a-year enterprise. \\nThe CDC is both a PR agency for, and a buyer from, Big Pharma. \\n\\nSpeaking of PR, would you like to see an example of how the CDC promotes the yearly flu vaccine by lying egregiously about flu deaths in the United States? \\nIn December of 2005, the British Medical Journal (online) published a shocking report by Peter Doshi, which created tremors through the halls of the Centers for Disease Control (CDC), where “the experts” used to tell the press that 36,000 people in the US die every year from the flu. \\nHere is a quote from Doshi’s report, “Are US flu death figures more PR than science?” (BMJ 2005; 331:1412): \\n“[According to CDC statistics], ‘influenza and pneumonia’ took 62,034 lives in 2001—61,777 of which were attributable to pneumonia and 257 to flu, and in only 18 cases was the flu virus positively identified.” \\nBoom. \\nYou see, the CDC has created one overall category that combines both flu and pneumonia deaths. Why do they do this? Because they disingenuously assume that the pneumonia deaths are complications stemming from the flu. \\nThis is an absurd assumption. Pneumonia has a number of causes. \\nBut even worse, in all the flu and pneumonia deaths, only 18 revealed the presence of an influenza virus. \\nTherefore, the CDC could not say, with assurance, that more than 18 people died of influenza in 2001. Not 36,000 deaths. 18 deaths. \\nDoshi continued his assessment of published CDC flu-death statistics: “Between 1979 and 2001, [CDC] data show an average of 1348 [flu] deaths per year (range 257 to 3006).” These figures refer to flu separated out from pneumonia. \\nThis death toll is obviously far lower than the parroted 36,000 figure. \\nHowever, when you add the sensible condition that lab tests have to actually find the flu virus in patients, the numbers of flu deaths plummet even further. \\nIn other words, it’s all promotion and hype. \\n“Well, uh, we say that 36,000 people die from the flu every year in the US. But actually, it’s closer to 20. However, we can’t admit that, because if we did, we’d be exposing our gigantic psyop. The whole campaign to scare people into getting a flu shot would have about the same effect as warning people to carry iron umbrellas, in case toasters fall out of upper-story windows…and, by the way, we’d be put in prison for fraud.” \\nThe CDC must turn out a steady stream of outrageous lies about the need for vaccines. If they didn’t, they’d have no way to justify the billions of dollars they spend every year buying the vaccines from drug companies. \\nSince the sold-out major media won’t connect these dots, I and others need to. \\nJon Rappoport \\nThe author of three explosive collections, THE MATRIX REVEALED , EXIT FROM THE MATRIX , and POWER OUTSIDE THE MATRIX , Jon was a candidate for a US Congressional seat in the 29 th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here .'"}, "time": 1742628580.1916604}