{"duration": 0.0821375846862793, "input_args": {"text": "'ISTANBUL  —   As a rebel faction of Turkey’s military began a violent attempt to topple the elected government, the country’s top officer, Gen. Hulusi Akar, was held at gunpoint in his office in the capital and told for the first time about what was happening. “Sir, the operation is starting,” a   officer said, according to General Akar in testimony that was leaked to the Turkish news media and verified by a senior Turkish official as authentic. “We will round up people, battalions. Brigades are on their way. You will see a bit later. ” General Akar replied: “What the hell are you saying? What operation? Are you a maniac? Never!” The plotters hoped to secure General Akar’s participation in the conspiracy, but his refusal was decisive in ensuring this coup attempt would fail  —   unlike those in Turkey in 1971 and 1980, which were supported up and down the chain of command. Now, as President Recep Tayyip Erdogan wages a widespread purge, jailing and suspending tens of thousands of state employees, the military, which has long served as a unifying force for the country, is deeply divided, diminished and discredited. Nearly half of the top generals and admirals have been jailed or dismissed and thousands of foot soldiers charged. More than 1, 500 officers were dishonorably discharged this week in advance of a meeting of the Supreme Military Council in Ankara on Thursday, where leaders were expected to consider a broader restructuring of the military. Late Thursday night, Mr. Erdogan’s spokesman, Ibrahim Kalin, spoke only briefly, saying that several top generals, including General Akar, would keep their jobs. Meanwhile, images on social media of conscripts’ being slapped and taunted have shocked a country that venerates the common soldier, as have allegations by Amnesty International that military detainees have been tortured. “With its main pillar, the military, broken, the Turkish state will no longer be able to check a divided society or effectively counter security threats,” said Halil Karaveli, a senior fellow at the Central   Institute and Silk Road Studies Program. That is a blow, not only to the country, but also to NATO, of which Turkey is a member. The Turkish military is a crucial ally in fighting terrorism, reining in the Islamic State, and in controlling the migrant tide that has overwhelmed Europe. Chaos within the military symbolizes not only its waning power in the country  —   and the rise of the police, which Mr. Erdogan built up as a bulwark to the military  —   but also its diminished reliability as a partner to the West. But it is perhaps the psychological blow that is greatest for a nation that is so badly splintered. Religious and secular, rich and poor, every man served in the Turkish military, and to all, the urban elite and pious poor, it was a symbol of Turkish identity. Alp Konak, who works at a hotel in Istanbul, explained how even within his family, the military was able to bridge differences between brothers. He said he was liberal, but his brother was very religious. “But the time we all got really close and came together was after we completed our military service, because we were all doing it for the future of our country,” he said. “We all believed in it. ” Now, both supporters and opponents of Turkey’s divisive president, Mr. Erdogan, feel deceived. They thought the military had been depoliticized, stripped of those who would undermine democracy to wield the power of force. But they were wrong. “That is what is so devastating about the coup attempt, the treachery involved,” said Soner Sencan, 31, a hairdresser in Istanbul, who said his closest friends were ones he met in the military. “Now no one will trust each other, and the most powerful, unified force of this country is broken. ” Within the diminished military ranks, the officer corps is badly split, and among the rank and file and their families, there is a sense of betrayal. Many soldiers seem to have been dragged into the plot by being told they were conducting an exercise. “These kids did not know anything,” said Nazli Tanburaci Altac, a lawyer in Ankara, the capital, who is representing conscripts who were detained. Speaking of her clients, she said: “The only thing they say is, ‘Those we considered as brothers, fathers, threw us in to the fire and went away. They told us there was an exercise.’ ” The Turkish military, the second largest in NATO, has a budget of roughly $20 billion a year and an army of more than 500, 000 soldiers. The authorities said this week that 1. 5 percent of the army, or about 8, 600 soldiers, participated in the coup attempt, although it was not clear how many willingly took part. The failed coup upended a central assumption about Turkey, one hailed as among Mr. Erdogan’s prime accomplishments: that the days of coups were over. Through a series of sensational trials, based partly on fabricated evidence, many secular military officers were jailed in recent years on charges of plotting a coup. But this effort to secure civilian control over the military backfired, analysts say. Secular officers were pushed from the armed forces and replaced by Islamists connected to Fethullah Gulen, a Muslim cleric in exile in Pennsylvania who the government has said was the mastermind of the coup attempt. At the time, Mr. Gulen was seen as an ally of Mr. Erdogan. The Turkish authorities have started to name commanders suspected of leading this month’s coup attempt, and many of them were officers who rose in the ranks to replace jailed secular officers, according to an analysis by Kadri Gursel, a Turkish journalist. Ismail Hakki Pekin, who served as the head of military intelligence until 2011, said the secular, nationalist officers had long tried to keep Gulenists out of the military, but that their ability to do so waned after Mr. Erdogan came to power. “We knew that the Fethullah Gulen organization was trying to access the military,” he said. “Although we tried to convince people that the Gulenists were causing trouble in state institutions, we weren’t able to convince anyone. ” Mr. Pekin does not oppose the purging now of suspected Gulenists from the armed forces, but he worries about who will replace them. Many leaders in Turkey’s staunchly secular military are concerned that Mr. Erdogan will fill the vacancies with religious allies  —   Islamists he can rely on, as opposed to the Gulenists. “This was a big trauma,” he said, referring to the failed coup. “And I hope we won’t sow the seeds of bigger traumas in the future. ” For now, the question is how Turkey’s military moves forward, with so many threats to the nation’s security. One of the generals arrested, Gen. Adem Huduti, the commander of Turkey’s Second Army, was leading the fight against Kurdish militants in the southeast, for example, and was also responsible for security at the border with Syria. “What in fact amounts to the collapse of the state is above all an invitation to Kurdish separatism,” Mr. Karaveli of the Central   Institute said. “The Kurds are going to have less reason to fear a state whose military is killing each other. ” American officials say they have not yet seen a weakening of Turkey’s resolve or ability to remain an active partner in the fight against the Islamic State, but they worry about aftershocks of the failed coup. The commander of American forces in the Middle East, Gen. Joseph L. Votel, the head of the United States Central Command, said on Thursday that many senior Turkish officers whom the United States deals with on counterterrorism were now in limbo, and some were in jail. “I’m particularly concerned about those relationships,” he said in an interview. And yet, Mr. Erdogan is likely to once again move aggressively to permanently depoliticize the military. In the wake of the coup attempt, the government has moved to bring the gendarmerie, a   police force, which participated in the plot, and the Coast Guard, under the control of the Interior Ministry, not the military. Some secular former officers, who had been banished in recent years after the trials, have already been brought back. But whatever happens, the overall institution will be deeply damaged for some time. “Now the army is a tarnished force,” said Hulya Kocaoglu, 55, an administrative assistant in Istanbul whose sons have served. “How do you know who is good and bad? Now, you fear that when your child goes, they could get involved with the wrong crowd and be brainwashed or sacrificed. ”'"}, "time": 1742628574.6486573}