{"duration": 0.06152820587158203, "input_args": {"text": "\"Bundy Brothers Acquitted For Takeover Of Oregon Wildlife Refuge (DETAILS) By Kay Smythe   \\nA group of anti-government protesters, led by brothers Ammon and Ryan Bundy have been acquitted of federal conspiracy and weapons charges. This comes after almost a year since the group staged an armed takeover of a federal wildlife sanctuary in Oregon last winter. \\nAll seven defendants were acquitted by a Federal District Court. Swayed Jury \\nThe decision came as a surprise to government prosecutors, who had argued that the group used force and threats of violence to occupy the reserve. Despite this, the jury was taken by the group’s protest of government overreach. They also believed the group posed no threat to the public. \\nRyan Bundy’s wife, Angela Bundy , said this following the court’s decision: “I knew that what my husband was doing was right, but I was nervous because the judge was controlling the narrative. But they saw the truth. I am just so grateful they saw it.” What Happened? \\nThe original crime of the group consisted of occupying a remote wildlife reserve in the south-east of Oregon. The group held the Malheur National Wildlife Refuge headquarters for nearly six weeks in 2015. \\nAs a group, the defendants never denied their occupation. However, their lawyers argued that the prosecutors had failed to prove that they had committed any crimes. \\nTheir lawyers also stated that the Bundy brothers and five friends did not engage in an illegal conspiracy to keep federal workers from doing their jobs. \\nDespite this, all members of the group were charged with conspiracy to impede federal employees from discharging their duties. They also faced federal weapons charges. Cleared Of All Crimes Except For One \\nThough the acquittals were unanimous, Ryan Bundy has still been charged with theft. He removed cameras around the refuge, which are government property. \\nOregon’s governor, Kate Brown , has said she is disappointed in the court’s decision. Said said: “The occupation of the Malheur Reserve did not reflect the Oregon way of respectfully working together to resolve differences.” Religious Beliefs \\nAmmon Bundy testified in his defense for three days. He claimed the takeover was spontaneous and informed by religious beliefs. Many of the protesters that joined the brothers and their group also had a distrust of government. \\nMost of those involved have reportedly been very outspoken on their apprehensions of federal government. Many of them left their jobs and homes to join the protest. \\nDespite the verdict, the Judge moved to keep the brothers in federal custody as a result of pending charges in Nevada. About Kay Smythe \\nKay Smythe is a freelance writer, social geographer, and senior writer at Anthony Gilardi's HIPPO LIFE. She was first published by Guardian Travel in the mid-2000s, which earned her the editorship at her college newspaper in 2010. From there, Smythe was opinion and news editor with The Tab, whilst maintaining a blog with Huffington Post. Her works featured interviews with Oscar and Emmy nominated actors. In early 2016, Smythe was awarded an O1 VISA. She lives and works in Venice, California, and loves it. Connect\""}, "time": 1742628390.4674413}