{"duration": 0.04879879951477051, "input_args": {"text": "'President Donald Trump made a dramatic display of executive power at the Environmental Protection Agency, as he signed an executive order to begin ratcheting back the   EPA regulations. [“My administration is putting an end to the war on coal,” Trump said in a speech prior to signing the executive order. Trump was joined by Environmental Protection Agency administrator Scott Pruitt, Secretary of Energy Rick Perry, and Secretary of the Interior Ryan Zinke.  “Our nation can’t run on pixie dust and hope,” Zinke said during his speech. “The last eight years showed that. ” Vice President Mike Pence was also present for the event. “President Trump digs coal,” Pence said as he introduced Trump. “The war on coal is over. ” Several coal miners were also present at the event, and at one point Trump left the podium in the middle of his speech to shake all of their hands. “We’re with you 100%,” he said, recalling his campaign promise to put them back to work. Trump said that his executive order was focused on giving power back to the states and back to the people to restore American energy jobs. “We’re going to have safety, we’re going to have clean water, we’re going to have clean air, but so many are unnecessary and so many are job killing, we’re getting rid of the bad ones,” he said. Despite his focus on coal miners, Trump also praised EPA employees. “You’re doing important work to protect our health and public resources, so important,” he said. Trump also recognized Sen. Shelley Moore Capito ( ) who joined the event. After signing the executive order, Trump reached back with one of the signature pens and gave it to the miners. “Only a miner, c’mon fellas you split it up,” he said, as the crowd laughed. After signing executive order at the EPA, Trump double taps the desk pic. twitter.   —   Charlie Spiering (@charliespiering) March 28, 2017, '"}, "time": 1742562199.1257017}