{"duration": 0.05304908752441406, "input_args": {"text": "'TEL AVIV  —   U. S. Ambassador to the United Nations Nikki Haley received a standing ovation at the General Assembly on Wednesday after pledging to defend Israel against the Boycott, Divestment and Sanctions (BDS) movement, saying it was a modern day incarnation of an “ancient hatred. ”[“Know that the United States has Israel’s back, and know that you now have a fighter and a friend in the UN to help you,” Haley told some 2, 000 people at Wednesday’s “Ambassadors Against BDS” conference in New York City.  “The effort to delegitimize the state of Israel being waged on college campuses and the   obsession at the UN are one and the same.  They both seek to deny Israel’s right to exist. They are both efforts to intimidate her friends and embolden her enemies. They are both extensions of an ancient hatred,” she added. Haley slammed the boycott movement for its complete disregard for truth or history, and for ignoring the human rights violations by countries such as Syria, North Korea and Iran. “It makes absolutely no sense and has no connection to any reasonable definition of justice,” she said. Haley said she felt “privileged” to have passed the U. S.’ first   bill in 2015 when she was governor of South Carolina. “In our state we said we will not use taxpayers’ funds to do business with any company that discriminates on the basis of race, color, religion, gender or national origin,” said Haley. “And make no mistake, that is exactly what the BDS movement does. ” “What a tragic irony that today I am once again engaged in a fight against those who seek to harm Israel, but this time as the US ambassador to the United Nations,” she said. Israel’s Ambassador to the UN Danny Danon thanked Haley for her efforts in combating the movement, which he called “pure antisemitism. ” “By associating these vile acts with legitimate political movements, we run the risk of legitimizing the illegitimate,” Danon said. “Those who topple Jewish tombstones in the dark of night and those who seek to delegitimize the Jewish state are not members of any political group. ” “We cannot rest for even a moment,” he said. “The BDS movement is still active and still strong. The real danger of BDS is not in their numbers, it is in their ability to cower us into silence. “Silence is weakness, silence is defeat,” Danon said. “We are all here to say we cannot, we will not, be silent. ” On Monday, Haley told the annual AIPAC policy conference, “The days of   are over. For anyone who says you can’t get anything done at the UN, they need to know there is a new sheriff in town. ” The   conference hosted by the Israeli Mission to the UN in partnership with several   groups including the World Jewish Congress, the Zionist Organization of America, Israel Bonds, StandwithUs, CAMERA, B’nai B’rith International, Maccabee Task Force, Hillel International, Students Supporting Israel, Hasbara Fellowships, the Jewish Agency for Israel, and the Simon Wiesenthal Center.'"}, "time": 1742563758.6544201}