{"duration": 0.1289043426513672, "input_args": {"text": "'WASHINGTON  —   The Supreme Court on Monday seemed sharply divided during an extended argument over a challenge to President Obama’s plan that would shield millions of undocumented immigrants from deportation and allow them to work in the country legally. A   deadlock seemed a real possibility, one that would leave in place an appeals court ruling that blocks the plan and deny Mr. Obama the chance to revive it while he remains in office. A tie vote would set no Supreme Court precedent and therefore would allow a renewed challenge to the plan once the court is back at full strength. Chief Justice John G. Roberts Jr. ’s questions were deeply skeptical of the administration’s position. They appeared to signal that he would not join the court’s four more liberal members in dismissing the case on the ground that the challengers had not suffered injuries giving them standing to sue. A ruling based on standing would be a victory for the administration. The case, brought by Texas and 25 other states, could still produce a significant ruling on presidential power and immigration policy in the midst of an election campaign in which both issues have been prominent. A loss for Mr. Obama would vindicate Republican accusations that he has acted lawlessly in exceeding the limits of presidential power and has not done enough to secure the nation’s borders. A victory for him would uphold one of the central legacies of his presidency and affect the lives of countless immigrants. Solicitor General Donald B. Verrilli Jr. the government’s top appellate lawyer, opened the arguments with a vigorous defense of Mr. Obama’s authority to set priorities for immigration enforcement. He was quickly challenged by Chief Justice Roberts. “Could the president grant deferred removal to every unlawfully present alien in the United States right now?” the chief justice asked skeptically. Mr. Verrilli said there were statutory constraints that would prevent the president from doing so. Mr. Verrilli also argued that Texas had not suffered the sort of direct and concrete injury that gave it standing to sue. The chief justice said the administration had given Texas an impossible choice, “a real  . ” Texas says it has standing to sue because it would be costly for the state to give driver’s licenses to immigrants affected by the federal policy. Mr. Verrilli said the state could simply change its law to deny driver’s licenses to the immigrants. “You would sue them instantly,” Chief Justice Roberts responded, meaning that the federal government would file a lawsuit challenging Texas’ unequal treatment of immigrants affected by the program. Mr. Verrilli said that was probably so but that such a suit might not succeed. The answer did not seem to satisfy Chief Justice Roberts, who suggested that the choice between incurring a budget shortfall and facing a lawsuit from the federal government was enough to establish standing. Justice Anthony M. Kennedy, on the other hand, twice suggested that Texas could have filed a different kind of lawsuit, one in which its standing would not be in question. Justice Sonia Sotomayor said that “nearly 11 million unauthorized aliens are here in the shadows. ” “They’re here whether we want them or not,” she said. But Justice Kennedy questioned whether the president can defer deportations for millions of people without specific congressional authorization. “It’s as if the president is defining the policy and the Congress is executing it,” Justice Kennedy said. “That’s just upside down. ” The case, United States v. Texas, No.   concerns a program intended to allow more than four million unauthorized immigrants who are the parents of citizens or of lawful permanent residents to apply for a program sparing them from deportation and providing them work permits. The program, announced in November 2014, was called Deferred Action for Parents of Americans and Lawful Permanent Residents, or DAPA. Mr. Verrilli told the justices that it addressed “a pressing humanitarian concern in avoiding the breakup of families that contain U. S. citizen children. ” Justice Samuel A. Alito Jr. asked if the president could simply open the nation’s borders. Mr. Verrilli said that was “a million miles from where we are now. ” That comment prompted Justice Kennedy to jump in. “Well, it’s four million people from where we are now,” he said, referring to the number of immigrants affected by Mr. Obama’s plan. “What we’re doing is defining the limits of discretion,” Justice Kennedy said of the court’s role in determining the lawfulness of the plan. “And it seems to me that that is a legislative, not an executive act. ” Scott A. Keller, Texas’ solicitor general, said Mr. Obama’s plan was unprecedented and unlawful. He faced skeptical questions from the court’s more liberal members about whether his state had standing. Justice Sotomayor wondered why it would cost more to issue more driver’s licenses. “Why can’t you just let people wait on line?” she asked. A different line, for one of the coveted red tickets that allow members of the public into the Supreme Court for the oral arguments, stretched around the block on Monday. Some people had been camping in front of the court since Friday night, eager for a chance to witness history. Groups of young people walked up and down the sidewalk holding banners and chanting mantras like “Sí se puede,” Spanish for “Yes we can. ” Thomas Pittman, a retired firefighter and a deacon at Shiloh Baptist Church in Trenton, said he was interested in the effects the case might have on the presidential race. “I think it’s going to have a major impact on the election, due to the fact that Trump wants to deport people and close our borders down,” he said, referring to the Republican   Donald J. Trump. Mr. Obama has said he took action after years of frustration with Republicans in Congress who had repeatedly refused to support bipartisan Senate legislation to update immigration laws. A coalition of 26 states, led by Texas, promptly challenged the plan, accusing the president of ignoring administrative procedures for changing rules and of abusing the power of his office by sidestepping Congress. If the Supreme Court upholds Mr. Obama’s actions, the White House has vowed to move quickly to set up the program and begin enrolling immigrants before his successor takes over early next year. Democratic presidential candidates have said they would continue the program, but most of the Republicans in the race have vowed to dismantle it and redouble immigration enforcement. Mr. Keller, Texas’ lawyer, acknowledged that the president has wide authority over whom to deport. “In this case,” he said, “given that they are removing 400, 000 people a year, we admit that they could do forbearance from removal. But what they can’t do is grant authorization to be in the country. ” He said the states’ quarrel was with what he called a blanket grant of “lawful presence” to millions of immigrants, entitling them to various benefits. Mr. Verrilli, the administration’s lawyer, said the term “lawful presence” had been misunderstood. Chief Justice Roberts asked him whether he was slicing things a little too fine. “Lawfully present does not mean you’re legally present?” the chief justice asked. “Correct,” Mr. Verrilli responded. Justice Alito said that response was mystifying. “I’m just talking about the English language,” he said. “I just don’t understand it. ” But Justice Elena Kagan said the term “lawful presence” was a red herring, suggesting that the administration could “have done the exact same thing without using that phrase. ”'"}, "time": 1742562001.1694884}