{"duration": 0.0402219295501709, "input_args": {"text": "'TEL AVIV  —   Prime Minister Benjamin Netanyahu thanked the U. S. House of Representatives on Friday for disavowing the UN Security Council’s resolution condemning Israeli settlement activity as a “flagrant violation of international law. ”[“After the outrageous   resolution at the UN, the U. S. House of Representatives voted yesterday resoundingly to support Israel and reject this   resolution,” Netanyahu said.  “I want to thank the U. S. House of Representatives, which reflects the tremendous support Israel enjoys among the American people. They voted to either repeal the resolution at the UN or change it  —   and that’s exactly what we intend to do. ” “Democrats and Republicans alike know that the Western Wall isn’t occupied territory,” he added. A similar measure is expected from the Senate this week. House Resolution 11 called on the U. S.  —   which abstained from the Security Council vote  —   to “oppose and veto future United Nations Security Council resolutions that seek to impose solutions to final status issues, or are   and  . ” “The passage of United Nations Security Council Resolution 2334 undermined the longstanding position of the United States to oppose and veto United Nations Security Council resolutions that seek to impose solutions to final status issues, or are   and   reversing decades of bipartisan agreement,” the resolution continues, in reference to President Barack Obama’s decision to abstain from the vote. The resolution echoes Israel’s view that the UN vote will make peace even more elusive, saying it “undermines the prospect of Israelis and Palestinians resuming productive, direct negotiations, contributes to the politically motivated acts of boycott, divestment from and sanctions against Israel and represents a concerted effort to extract concessions from Israel outside of direct negotiations. ” House Speaker Paul Ryan urged the entire House to support the resolution. “I am stunned  —   I am stunned at what happened last month,” Ryan said in a statement on the floor. “This government, our government, abandoned our ally Israel when she needed us the most. ” State Department spokesman John Kirby said over the weekend that the Obama administration’s decision to abstain from the vote “was about preserving the   solution, which we continue to believe is the only way to ensure Israel’s future as a Jewish and a democratic state  —   living    in peace and security with a viable and independent Palestinian state. ” However, many Republicans have expressed the view that the   solution is no longer viable. “The   solution has run its course,” said Rep. Steve King ( ) who is a close confidant of the incoming Trump administration. Israel is concerned that Obama may seek more resolutions defining parameters for a peace framework at the UNSC during his final days in office. However, the president’s foreign policy adviser, Ben Rhodes, has denied this and said the administration intends to use its veto. Meanwhile, Israel announced on Friday that it was cutting funding as “an act of protest” against UN agencies that are considered to be  . “It is unreasonable for Israel to fund bodies that operate against us at the UN,” Ambassador to the UN Danny Danon said. “The UN must end the absurd reality in which it supports bodies whose sole intent is to spread incitement and   propaganda. ”'"}, "time": 1742562067.878936}