{"duration": 0.08841562271118164, "input_args": {"text": "'With its lens tool, Snapchat allows some 150 million daily users to alter reality and play with identity in ways that border on the absurd. You can turn yourself into a pineapple, a dog or a character befitting a Roy Lichtenstein painting. The lenses are blunt,   tools that generate more than 30 million enhanced selfies a day. Any missteps quickly enter the public record. Snapchat lenses have drawn criticism in the past with accusations that the app was promoting blackface or encouraging whitened skin tones as an ideal of beauty. So when it pushed a lens to some users this week that gave them slanted eyes, distorted teeth and puffy cheeks, some critics called it a racist caricature of Asian people  —   “yellowface. ” And they wondered if these repeated controversies pointed to a larger problem that the company has with diversity. The news and the outrage went wide on Wednesday, with reports by The Verge and Motherboard, a day after Snapchat said it had dismantled the feature. The company offered an explanation: The lens was meant as homage to anime characters, not as a caricature of Asian people. But for observers who have experienced racism, the lens reminded them of hurtful stereotypes in action. Others roundly rejected the anime comparison. In an email, Grace Sparapani, a   art student whose tweet about the photos was widely shared, said that the lens was “hurtful and uncomfortable to say the least. ” She added that “it’s hard to argue with the side by side comparison of the very gross Asian caricature and the filter’s effects. It shows that the filter isn’t just yellowface, but yellowface taken to its derogatory extreme. ” Snapchat is not the only company to cross these cultural tripwires. American culture seems involved in an endless struggle over diversity and inclusion, from corporate boardrooms to Hollywood and the devices we all carry in our hands. And Snapchat’s huge audience of younger people  —   who are more racially diverse than their older counterparts  —   might mean that they are even more likely to expect sensitivity. When one of Snapchat’s lenses creates an image that is insulting to a user, Katie Zhu, 25, said in an interview on Thursday, “it’s much harder for these types of things to go unnoticed like they did before. ” On Thursday, Ms. Zhu, a product manager and engineer who works for Medium, decided to delete her Snapchat account and encouraged others to do the same. In an essay for Medium and in a telephone interview, she said she believed that the   controversies reflected a lack of diversity in hiring practices at Snapchat. Ms. Zhu criticized the company’s mostly white,   leadership and ended her essay with a hashtag: #DeleteSnapchat. “It’s either that they had no diverse representation of people of color on their staff to the point where they’re able to make decisions like this,” Ms. Zhu, who is   said, “or they do have some people of color who are working there, but they’re not in positions where they feel safe or comfortable to speak up. ” Other observers share her view,  a complaint that Snapchat has left largely unanswered. The company does not release figures about diversity on its staff, noting its status as a private company. On Thursday, Snapchat declined to discuss the racial backgrounds of its staff, but according to a spokesman, the company recently hired a recruiter to focus on underrepresented populations and on driving inclusion efforts internally. For her part, Ms. Zhu said she would keep her Snapchat account closed, adding, “I wonder if they actually need more users like us to be able to say that this is not O. K. ”'"}, "time": 1742562095.3825788}