{"duration": 0.1799943447113037, "input_args": {"text": "'Free Thought Project – by Claire Bernish \\nTony Podesta — brother of the now-disgraced Hillary Clinton campaign chair John Podesta, whose files Wikileaks has been publishing — is not only a powerful Democratic Party lobbyist, but a registered foreign agent receiving a hefty monthly paycheck from the nefarious government of Saudi Arabia. \\nNo — as tinfoil-hat conspiracy theorist as it might sound — that scenario is the absolute truth. \\nIn 1988, John and Tony Podesta formed the Podesta Group and have used their bigwig party-insider status to lobby and influence government policies — while, at various times, simultaneously holding positions of power — which has created a number of glaring conflicts of interest. \\nAccording to the March 2016 filing made in accordance with the Foreign Agents Registration Act of 1938, Tony Podesta is an active foreign agent of the Saudi government with the “ Center for Studies and Media Affairs at the Saudi Royal Court ,” and acts as an officer of the Saudi Arabia account. \\nAt this point, the web of pay-for-play between the Washington, political heavyweights, and foreign governments comes lurching into the spotlight. \\nFor starters, the Podesta brothers’ lobbying firm receives $140,000 every month from the Saudi government, which, in no uncertain terms — and despite a status as privileged U.S. ally — wages a bloody campaign of censorship, murder, suppression, human rights abuse, and worse against its civilian population, while bombing hospitals, schools, and aid convoys in neighboring nations. \\nJohn Podesta previously served as President Bill Clinton’s chief of staff, founded the think tank Center for American Progress (which oh-so-coincidentally touts the need to reframe Saudi Arabia’s hopelessly tarnished image), counseled President Obama, and now chairs Hillary Clinton’s campaign. \\nTony Podesta acts as a foreign agent for the Kingdom of Saudi Arabia — lobbying to influence government policy in favor of the Kingdom — while also contributing to and bundling for Hillary Clinton’s campaign. \\nThink about that for a moment. \\nOne brother uses the influence of money to both affect United States foreign policy and infuse the Clinton campaign with cash — while the other wields the influence of power as a political insider for the same entities. \\nAs the Washington Post reported months ago in July, Tony Podesta’s lobbying efforts “raised $268,000 for the campaign and $31,000 for the victory fund.” \\n“The Saudis hired the Podesta Group in 2015 because it was getting hammered in the press over civilian casualties from its airstrikes in Yemen and its crackdown on political dissidents at home, including sentencing blogger Raif Badawi to ten years in prison and 1,000 lashes for ‘insulting Islam,’” Alternet reported . “Since then, Tony Podesta’s fingerprints have been all over Saudi Arabia’s advocacy efforts in Washington DC. When Saudi Arabia executed the prominent nonviolent Shia dissident Sheikh Nimr al-Nimr, causing protests throughout the Shia world and inflaming sectarian divisions, The New York Times noted that the Podesta Group provided the newspaper with a Saudi commentator who defended the execution.” \\nNotably, the Saudis’ reputation has only worsened as further atrocities pile up — concerning not only a record number of barbaric beheadings this year, but suspiciously reckless and errant U.S.-backed coalition bombings of civilian sites in several regions of active conflict. \\nAdditionally, Tony Podesta’s status as a registered foreign agent for Saudi Arabia is at least obliquely discussed in an email from April 15, 2015 — ironically revealed by Wikileaks’ publishing of his brothers personal communiques — in which former Clinton Foundation chief development officer and now campaign national finance director Dennis Cheng wrote to a small group of insiders: \\n“Hi all – we do need to make a decision on this ASAP as our friends who happen to be registered with FARA [Foreign Agents Registration Act] are already donating and raising. \\n“I do want to push back a bit (it’s my job!): I feel like we are leaving a good amount of money on the table (both for primary and general, and then DNC and state parties)… and how do we explain to people that we’ll take money from a corporate lobbyist but not them; that the Foundation takes $ from foreign govts but we now won’t. Either way, we need to make a decision soon.” \\nTo which general counsel to the Clinton campaign, attorney Marc Elias, replied [all errors original and emphasis added], \\n“Responding to all on this. I was not on the call this morning, but I lean away from a bright line rule here. It seems odd to say that someone who represents Alberta, Canada can’t give, but a lobbyist for Phillip Morris can. Just as we vet lobbyists case by case, I would do the same with FARA. While this may lead to a large number of FARA registrants being denied, it would not be a flat our ban. A total ban feels arbitrary and will engender the same eye-rolling and ill will that it did for Obama.” \\nAs the exchange continues, how to precisely handle the campaign’s image with potentially controversial donors — while, at all costs, maintaining the flow of cash — becomes even more apparent. As strategist and campaign manager Robby Mook responds, \\n“Where do we draw the line though?” \\nElias suggests a particularly intricate solution: \\n“If we do it case by case, then it will be subjective. We would look at who the donor is and what foreign entity they are registered for. In judging whether to take the money, we would consider the relationship between that country and the United States, its relationship to the State Department during Hillary’s time as Secretary, and its relationship, if any, to the Foundation. In judging the individual, we would look at their history of support for political candidates generally and Hillary’s past campaigns specifically. \\n“Put simply, we would use the same criteria we use for lobbyists, except with a somewhat more stringent screen. \\n“As a legal matter, I am not saying we have to do this – we can decide to simply ban foreign registrants entirely. I’m just offering this up as a middle ground.” \\nMook eventually decides plainly, \\n“Marc made a convincing case to me this am that these sorts of restrictions don’t really get you anything…that Obama actually got judged MORE harshly as a result. He convinced me. So…in a complete U-turn, I’m ok just taking the money and dealing with any attacks. Are you guys ok with that?” \\nAll of this political wrangling appears to have had the desired effect — despite increasing calls for the United States to either rein in or sever completely its support for the bloody Saudi regime — the U.S. approved a stunning $1.29 billion sale of smart bombs to the Kingdom in November 2015. \\nTony Podesta’s specific contract with the government-run Center for Studies and Media Affairs at the Saudi Royal Court, which will earn $1.68 million by year’s end, does, indeed, suggest the infusion of a pro-Saudi message into the U.S. media propaganda machine. \\n“Saudi Arabia is consistently one of the bigger players when it comes to foreign influence in Washington,” Sunlight Foundation spokesman Josh Stewart told the Washington Post . “That spans both what you’d call the inside game, which is lobbying and government relations, and the outside game, which is PR and other things that tend to reach a broader audience than just lobbying.” \\nThat broader audience — the American public — has indeed been manipulated courtesy of at least the thoroughly-corrupt Clinton campaign if not surreptitiously by the Saudis, as well. \\nAs The Free Thought Project has repeatedly reported , the evidence of collusion among the Democratic National Committee, Hillary Clinton’s campaign, and the mainstream presstitutes is indisputable — including no less than 65 so-called journalists listed by name in various leaks as darlings of the campaign. \\nAlthough this level of corruption and collusion would be considered intolerable in nearly any other nation on the planet. And yet, at the center of this shit storm of contention is an official nominee for the White House — who will not be held responsible for any number of questionable and criminal acts. \\nThe system isn’t rigged — it’s performing exactly as intended — and always will as long as the vote validates its existence. Read more at http://thefreethoughtproject.com/clinton-podesta-campaign-saudi-arabia/#gYcjBFazk755MGcp.99 Share this:'"}, "time": 1742561720.799226}