{"duration": 0.14143109321594238, "input_args": {"text": "'Doubles  —   pairs of friends, rivals and families contrasting ideologies and views of the world  —   animate Zadie Smith’s novels, as surely as doubles and doppelgängers haunt many Hitchcock movies. Her astonishing debut novel, “White Teeth” (2000) recounted the story of two World War II vets  —   polar opposites and best friends  —   and their extended families, opening out into a teeming,   portrait of a multicultural London. “On Beauty” (2005) another magical   novel (set mainly in Boston) also depicted two very different families with intertwined lives. And the disappointing “NW” (2012) used the diverging stories of two childhood friends to look at the potent and ever shifting dynamics of money and class. Ms. Smith’s latest novel, “Swing Time,” works a variation on this setup. This time, it’s two spirited London girls and their very different trajectories. There are echoes of Wendy Wasserstein’s captivating 1981 play, “Isn’t It Romantic”  —   in their titles, lifted from 1930s classics in film and song, and in their portraits of two friends’ coming of age and their conflicted relationships with their mothers. At the same time, this novel addresses many themes that have animated Ms. Smith’s work since the start: the competing claims that family, cultural heritage and politics exert on identity how personal imperatives are shaped (or not) by public events the mix of emulation, resentment and rebellion that inform children’s attitudes toward their parents. Told in the first person, the narrative cuts back and forth in time, alternating between persuasive chapters about the unnamed narrator’s memories of her childhood and adolescence (when she and her friend Tracey both aspired to become dancers) and dull, strangely generic chapters about her   experiences, working as an assistant to a famous singer and   humanitarian named Aimee, who can “procure a baby” for adoption “as easily as she might order a   handbag from Japan. ” The novel’s flashback chapters, set in London, possess the tactile energy and emotional detail of “White Teeth. ” Ms. Smith conjures the electric pulse of the 1980s and 1990s, when goth and punk were taking over the streets, and the nostalgia of the Cool Britannia years, when people rode Vespas to work and decorated their cubicles with pictures of Michael Caine in “Alfie”  —   the boys looking like “rebooted Mods” with “Kinks haircuts from 30 years earlier,” the girls like “Julie Christie   in short skirts with smudgy black eyes. ” She also captures the   rituals of that era before smartphones and the internet transformed daily life  —   when email was still a rarity, and research was conducted not through Google, but in libraries, reading old newspapers and microfiche. She is more adept here than in “NW” at mapping the inner lives of her heroines, though the radical sympathy she evinced for her characters in “White Teeth” and “On Beauty” has given way to a somewhat more grudging attitude  —   perhaps accounted for by the fact that the story is told from the narrator’s decidedly subjective point of view. Ms. Smith conveys her heroines’ youthful passion for dance  —   a calling that only Tracey has the talent to seriously pursue  —   and the   of their   friendship. Tracey  —   whose absent father has been in jail, and whose angry mother is an enabler of Tracey’s worst impulses  —   is the diva, the heedless one, who wears flashy clothes, has lots of boyfriends and takes a lot of drugs. The narrator is the good girl, the   prudent one, who plays Ethel to Tracey’s flamboyant Lucy. Eager to escape the shadow of her chilly, politically ambitious mother, the narrator goes off to college, and eventually takes a job that requires her to play Ethel to Aimee’s Lucy. Aimee is a complete celebrity stereotype  —   a rote   of Madonna and Angelina Jolie, who possesses none of the satiric edge or surprising tenderness of, say, the Justin   hero of Teddy Wayne’s 2013 novel, “The Love Song of Jonny Valentine. ” And the chapters that chronicle Aimee’s much publicized efforts to build a school in an unnamed African country are beyond tedious  —   Aimee jetting in from her cosseted life in Britain and America to visit a village and meet with children and politicians, all the while trailed by video cameras. These sections are so perfunctorily rendered that they often feel like stuffing, written to fill out the novel’s schematic structure, which moves between     sections, and flashback,   ones. Some of the narrator’s experiences in Africa with Aimee  —   combined with her efforts to understand shifting attitudes toward race in music and dance  —   are meant to raise larger questions about cultural appropriation, and the relationship between the privileged West and the developing world. But these issues do not spring organically from this clumsy novel  —   a novel that showcases its author’s formidable talents in only half its pages, while bogging down the rest of the time in formulaic and predictable storytelling.'"}, "time": 1742561851.4806645}