{"duration": 0.06344938278198242, "input_args": {"text": "'BEIRUT, Lebanon  —   The ferocious ground assault and aerial bombardment in eastern Aleppo has forced some 16, 000 people to flee for their lives in the last few days, according to Stephen O’Brien, the United Nations under secretary general for humanitarian affairs. “The parties to the conflict have shown time and again they are willing to take any action to secure military advantage even if it means killing, maiming or starving civilians into submission in the process,” Mr. O’Brien warned on Tuesday, calling the siege of the city a “deeply alarming and chilling situation. ” On Monday, forces loyal to President Bashar   captured about a third of the territory in Aleppo that had been held by rebels. Planes have dropped leaflets over the   areas in the eastern part of city. “If you don’t leave these areas quickly you will be annihilated,” the leaflets warn. “Save yourselves. You know that everyone has left you alone to face your doom and have offered you no help. ” Hisham   a member of a council of rebels and civilians in eastern Aleppo, said by telephone on Tuesday that warplanes had hovered closely over the area, steadily dropping barrel bombs, as a delegation of civic activists explored the idea of using   safe routes to leave the city, though many were not confident they could escape with their lives. “For the civilians, they have the choice whether they want to leave or stay, but for those of us who don’t trust the regime, we have no choice,” he said through tears, adding that he did not want to leave his home. “I can’t turn my back on my city. ” Rami Jarrah, a Syrian   activist and citizen journalist who is based in Turkey but regularly travels to   Aleppo, said via Facebook that he did not believe that there was such a thing as safe passage. Five years into the civil war, he said, many of those remaining in eastern Aleppo are on the Assad government’s “black list,” having participated in protests or openly defied it. “All have lost loved ones or have family members who are fighting to protect the city,” he said. “The Syrian regime does not tolerate any form of opposition to its narrative, and this means that leaving eastern Aleppo through ‘safe’ passageways that have been set up by Assad’s forces is not an option for the vast majority of the population. ” He added: “Syrians would prefer to live under chaotic bombardment than be apprehended by the Syrian regime and tortured to death. Five years of people staying put even when leaving was the easiest option is sheer proof of this. ” Around 10, 000 civilians have escaped from the city’s   east into   western Aleppo, Jens Laerke, a spokesman for the United Nations emergency relief coordination office, told reporters in Geneva. An additional 4, 000 to 6, 000 have managed to flee to the   Sheikh Maqsoud neighborhood on the northern edge of the city, he said. Russian and Syrian television channels showed people who had crossed into government territory cheering and thanking the government and complaining of bad treatment by rebels inside. In the   neighborhood of Bustan   where bombs rained down, Dr. Salem Abdulnasser said the medical center where he worked had notified the staff that it would close on Thursday because it was too dangerous to keep operating. Russia said it would be sending mobile hospitals to Aleppo to assist in the crisis. Russian officials also said that 80, 000 people lived in the districts retaken by the Syrian government and that they were receiving humanitarian aid but there was no footage immediately available of such operations inside the areas until Monday held by rebels. Bassem Ayoub, an activist in eastern Aleppo, said that even those sympathetic to the rebels were on the brink of despair. “I’m ready to agree to the regime’s terms  —   whatever they are  —   for the sake of stopping the killing,” he said. “People are dying by the hundreds. Everybody is ready to leave. Stop the killing. ” The United Nations appealed repeatedly for access to deliver food and medical aid to eastern Aleppo and to evacuate the wounded. Jan Egeland, the United Nations special adviser on humanitarian affairs, said last week that Russian officials had agreed verbally, and armed opposition groups in writing, to a   plan submitted this month, but the agency’s plan had not received backing from Damascus and no further action had followed. United Nations officials also said that indiscriminate shelling of western Aleppo had continued killing and injuring civilians, destroying civilian infrastructure, and had forced about 20, 000 people from their homes. The World Food Program said it was able to supply bread and other rations to community kitchens in western Aleppo, but residents in the eastern parts of the city have had no food distribution for two weeks. “It’s really dire,” said Bettina Luescher, a spokeswoman for the agency, citing accounts of residents sifting through garbage for something to eat. ”It’s a   descent into hell,” she said. At the same time, about 700, 000 people are trapped in besieged areas in other parts of the country, Mr. O’Brien said. As in eastern Aleppo, “people in these besieged areas are trapped, terrified and running out of time,” he said.'"}, "time": 1742628307.3224459}