{"duration": 0.09596538543701172, "input_args": {"text": "'November 9, 2016 \\nSatire, an archetype invented by classical Roman poets, has reversed a decision it took in early July and will continue taking charge of the global situation. Satirists, who had hoped to resume control of a vehicle that has now nullified itself by creating real world conditions so ridiculous that it is impossible to send them up, called the decision ‘disappointing but understandable’. \\n‘Just to recap,’ said Satire, ‘I actually began all this in the States a year ago so it’s come full circle. The joke seemed to have gone stale after a while, so I switched to Britain. I whipped up an unnecessary referendum, chucked in some grotesque stock characters and got an overgrown blonde child to pretend to be for one side when he had been for the other just months before.’ \\n‘I encouraged him to do just enough to get an honourable defeat, only to have him win so that his school chum who had been ruling the country had to resign. Then, I arranged for his weird sidekick to stab him in the back, only to get chucked out in turn, then let two demonic female figures fight it out and had one win who thought much the same as the original man about the original problem, which wasn’t really a problem at all and ensured she is bound to win an election on the decision, even though most people regret it.’ \\nAt that point, Satire took a back seat, agreeing that the possibility of a fictional orange-skinned character might become the world’s most powerful man after a campaign based on telling obvious lies, losing every debate and winning the evangelical vote by gripping vaginas was just too ridiculous to write about. Now, however, he has decided to make another go of it. \\n‘OK, so I’m in my comfort zone now,’ Satire concluded. ‘The world’s leading nation devoting its entire energy to building a wall to stop brown-skinned people coming to do the jobs they won’t do themselves, people protesting against the 1% by voting for the epitome of the 1%, a thin-skinned, twice-bankrupt narcissist making decisions that will affect the whole world for a generation – it’s going to be epic. I mean, seriously, what’s the worst that could happen? … Nuclear war, you say? Hey, that could lead to another satire boom too. Boom – geddit? Did you see what I did there? Oh please yourselves…’ Share this story... \\nPosted: Nov 9th, 2016 by Oxbridge Click for more article by Oxbridge .. More Stories about: Left Alert 0'"}, "time": 1742561788.091362}