{"duration": 1.690613031387329, "input_args": {"text": "'Purdue University professors have presented research on rapidly charging batteries that could change the face of the electric automotive industry. [Professor of Earth, Atmospheric and Planetary Science, and Mathematics John Cushman presented new research at the International Society for Porous Media 9th International Conference in Rotterdam, Netherlands. Entitled “Redox reactions in   in porous media  —   membraneless battery applications,” the report outlines a new type of battery, and the method by which it could be recharged with unprecedented speed.  Cushman called the growing worldwide sales of electric and hybrid vehicles “incredible,” but said that there remained “strong challenges” for the industry and consumer alike. Chief among those concerns is the life of a hybrid or electric vehicle’s battery, and the massive infrastructure development needed to keep them charged. For drivers, it boils down to practicality. The time and effort required to keep their cars running is still an ongoing hurdle. Purdue Professor Eric Nauman is the   along with Cushman, of Ifbattery  —   a company exploring the commercial applications of their research. He highlighted the “tremendous cost” of developing infrastructure to handle the needed distribution and storage of the energy used by traditional electric vehicles. With Cushman and Nauman’s new developments, they may have a solution: “Ifbattery is developing an energy storage system that would enable drivers to fill up their electric or hybrid vehicles with fluid electrolytes to   spent battery fluids much like refueling their gas tanks. ” Using fluid electrolytes to power batteries gives them a much more accessible fuel supply. Furthermore, the spent electrolytic fuel could be collected and recharged at a wind, solar, or hydroelectric power plant. Cushman said: Instead of refining petroleum, the refiners would reprocess spent electrolytes and instead of dispensing gas, the fueling stations would dispense a water and ethanol or methanol solution as fluid electrolytes to power vehicles. Users would be able to drop off the spent electrolytes at gas stations, which would then be sent in bulk to solar farms, wind turbine installations or hydroelectric plants for reconstitution or   into the viable electrolyte and reused many times. It is believed that our technology could be nearly ‘ ’ ready for most of the underground piping system, rail and truck delivery system, gas stations and refineries. With the potential for clean, efficient, and reusable fuel, both hybrid and electric vehicles could be poised for a leap into mass consumer relevance. Backed up by higher capacity and recharging that is as easy as a stop at the gas station, we may be looking at the first truly pragmatic alternative to   vehicles. All that remains to be seen is whether the cost of implementation is prohibitive. If not, Purdue and Ifbattery may very well force car companies and consumers alike to take notice. Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742562969.8140068}