{"duration": 0.04754161834716797, "input_args": {"text": "'November 14, 2016 \\nThe stop-motion children’s favourite, is under threat from the newly elected President for using his trademarked name. Mr. Trump has turned litigious after his planning permission was blocked, for golf resort in neighbouring Camberwick Green. \\nExplained Town Hall clerk, Mr Troop: ‘Several landowners around Trumpton and Camberwick Green refused to sell their land to Trump. And he’s made their lives misery, in some cases he’s even cut off their water supply and blocked their roads.’ Local windmill owner Windy Miller has been in dispute with Trump over the sale of land around Colley’s Mill and the Trump Corporation’s aggressive tactics appear to have taken their toll on the normally affable Miller. ‘It’s terrible what they’ve done to Windy,’ says Mr Troop. ‘He’s a broken man. Now he spends his days getting wrecked on home brew cider and firing his shotgun at anyone who comes within 100 yards of his windmill. Peter the Postman has had to visit Dr Mopp several times to have shotgun slugs removed from his rear end’. \\nHowever, not everyone in Trumpton is hostile to the billionaire property developer. Local carpenter Chippy Minton believes that just as Trump is set to bring radical change to America he can do the same for Trumpton. ‘The people are fed up with the career politicians at the town hall. Unless you’re an immigrant or disabled they don’t want to know, bloody do-gooders. Everyone knows there’s too much immigration from neighbouring towns. We’re going to build a wall around Chigley and make Chigley pay for it’. \\n‘There’s even a Mexican family moved in to Trumpton,’ continued Minton. ‘They seem nice but this type of immigration is diluting our local institutions. Take our world famous Fire Brigade for instance. Now it’s ‘Pugh, Pugh, Barney McGrew, Cuthbert, Dibble, Ramirez’. What’s that all about!?’'"}, "time": 1742561982.3053331}