{"duration": 0.08027172088623047, "input_args": {"text": "'Given the establishment media’s focus on the “scandal” surrounding President Donald Trump and his administration’s contact with Russian officials, it is worth reminding Americans of the revelations involving Hillary Clinton and the Kremlin. [1. Hillary Clinton approved the transfer of 20 percent of U. S. uranium to Russia and nine investors in the deal funneled $145 million to the Clinton Foundation.  While Hillary Clinton’s State Department was one of eight agencies to review and sign off on the transfer of 20 percent of U. S. uranium to Russia  —     of State Clinton herself was the only agency head whose family foundation received $145 million in donations from multiple people connected to the uranium deal, as reported by the New York Times. 2. Bill Clinton bagged $500, 000 for a Moscow speech paid for by a   bank while Hillary Clinton was Secretary of State. Former President Bill Clinton delivered a speech in Moscow and received a $500, 000 speaking fee from a Russian   bank, while his wife’s State Department was getting ready to sign off on the transfer of 20 percent of U. S. uranium to Russia. “And, in one case, a Russian investment bank connected to the deals paid money to Bill Clinton personally, through a    speaker’s fee,” reported the New Yorker. 3. Hillary Clinton’s campaign chairman’s Joule energy company bagged $35 million from Putin’s Rusnano. Hillary Clinton’s campaign chairman John Podesta sat on the executive board of an energy company, Joule Unlimited, which received millions from a   Russian government fund. Podesta also owned “75, 000 common shares” in Joule Unlimited, which he had transferred to a holding company called Leonidio LLC. Podesta also failed to fully disclose his position on Joule Unlimited’s board of directors and include it in his federal financial disclosures, as required by law, before he became President Obama’s senior adviser in January 2014. 4.  Clinton Foundation chatter with State Dept. on Uranium Deal with Russia. Senior staffers inside Hillary Clinton’s presidential campaign were warned by Clinton Foundation senior vice president Maura Pally that the chairman of the Senate Judiciary Committee, Sen. Charles Grassley ( ) was asking the Department of Justice to investigate the State Department approval of the sale of American uranium assets to a Russian company. The chain of emails proved the regular interaction between members of the Clinton campaign and senior staff at the Clinton Foundation. 5. Hillary Clinton hid $2. 35 million in secret donations from Ian Telfer, the head of Russia’s uranium company. Ian Telfer, the head of the Russian government’s uranium company, Uranium One, made four foreign donations totaling $2. 35 million to the Clinton Foundation, as the New York Times reported. “Uranium One’s chairman used his family foundation to make four donations totaling $2. 35 million,” the Times reported. “Those contributions were not publicly disclosed by the Clintons, despite an agreement Mrs. Clinton had struck with the Obama White House to publicly identify all donors. Other people with ties to the company made donations as well. ” Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742563673.2243493}