{"duration": 0.09845256805419922, "input_args": {"text": "'President Donald Trump is getting praise from experts on the   foreign guest worker visa for his ‘Hire American’ Executive Order which calls for a review into the system’s abuse at the expense of American workers. [Although the   visa is only meant to be used by a U. S. company when there are no American workers with the   needed for the job, critics argue the program is riddled with abuse and fraud, leaving Americans to sometimes train their cheaper, foreign replacements before being fired.  Trump’s new executive order targeting abuse by U. S. companies, as Breitbart News reported, calls for the Department of Justice (DOJ) the Labor Department and the Department of Homeland Security (DHS) to conduct a “full legal analysis” of all the problems negatively impacting American workers in the   visa system.   expert and attorney John Miano told Breitbart Texas that Trump’s move on the issue is one that is setting the administration on the right trajectory. “We’re going to want to see some   later on,” Miano said in an interview. “But you can’t criticize the president for taking action. This is what we elected him for. ” Miano said the fact that Trump is mentioning the   visa program, an issue that went unaddressed by at least the past two administrations, is “very big. ” Likewise, Sara Blackwell, an attorney who represents Americans who’ve been fired because programs like the   applauded Trump’s move. “We hope it’s a beginning of a lot more. I’m hopeful,” Blackwell told Breitbart Texas. “But, I’m extremely happy that President Trump is talking about it and acknowledging there’s a huge problem. ” The legal review by DOJ, the DOL and DHS will include tracking down abuses within the   visa program where more than 85, 000 Americans are either replaced or passed over for jobs by foreign nationals. Experts like NumberUSA’s Rosemary Jenks and the Center for Immigration Studies’ Mark Krikorian both said the   legal review approach by the Trump Administration is the right way to go about ending the mass discrimination against American workers that currently takes place. “I do think it’s the right approach to take because [DOJ, Labor Dept. and DHS] have different roles to play,” Jenks told Breitbart Texas. “Abuse is handled by the Labor Department. DHS is the agency that’s setting requirements for admission. And DOJ is prosecuting the abusers. This is definitely the right approach. I hope the administration will continue talking to outside groups. ” “Clearly, by indicating that all three departments have to do a review of the program, the White House is making clear they understand the process,” Krikorian told Breitbart Texas. “The initial clearinghouse is the Department of Labor. A lot of the cheap labor aspects can be addressed by the Labor Department’s regulations and statutes. ” Krikorian said he was glad to see the Trump Administration calling for a broad review into the   visa system, rather than taking smaller, administrative actions. “At the same time, it’s encouraging that they didn’t just try to change   unilaterally, they understand there’s a lot of moving parts to it,” Krikorian said. “They know a lot of this has to be fixed by Congress. ” Before the Executive Order, the Trump administration worried critics of the   visa after not making any changes to the system before the application process began. For instance, the Trump Administration could have changed the   system from its current state of handing out visas through a random lottery, switching it to a process where the   jobs are given priority. Krikorian, though, told Breitbart Texas that the lack of prior change to   was mostly likely not politically driven, but rather the administration simply running out of time on the issue. Nonetheless, the new executive order has changed the outlook Americans impacted by the   have on the Trump administration, Blackwell said. “Well the people who are affected by this and know this businesses model were extremely deflated when the   application process started without changes,” Blackwell said. “Now, they’ve gone from hopeless to hopeful. ” Last week, Breitbart Texas exclusively reported how Trump Senior Adviser Stephen Miller held a White House meeting on the   visa issue with longtime critics like Blackwell and Howard University professor Ron Hira. John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742563211.2729707}