{"duration": 0.10289216041564941, "input_args": {"text": "'\\nWho? Comedian. \\nWhere would she move? Spain. “I did buy a house in another country just in case, so all of these people that threaten to leave the country and then don’t, I will leave the country,” she said on Live with Kelly and Michael. \\n(Weirdly, she called Trump charming in the same interview.) \\n3. Neve Campbell \\nWho? House of Cards actress. \\nWhere would she move? Canada. \\n“His honesty is terrifying,” she told Huffington Post UK. \\n4. Barry Diller \\nWho? Founder of IAC Interactive. \\nWhere would he move? Unspecified. \\n“If Donald Trump doesn’t fall, I’ll either move out of the country or join the resistance,” he told Bloomberg. \\n5. Lena Dunham \\nWho? Creator of Girls. \\nWhere would she move? Vancouver. \\n“I know a lot of people have been threatening to do this, but I really will,” she said at the Matrix Awards. \\n6. Keegan-Michael Key \\nWho? Star of Key & Peele. \\nWhere would he move? Canada. \\n“It’s easy. It’s like 10 minutes from Detroit and that’s where I’m from,” he told TMZ. \\n7. Chloë Sevigny \\nWho? Actress and guest star in Portlandia. \\nWhere would she move? Nova Scotia. \\nShe answered simply, “Nova Scotia” to a question of where she would move if Trump were elected. \\n8. Al Sharpton \\nWho? Activist. \\nWhere would he move? Out of here. \\n“If Donald Trump is the nominee, I’m open to support anyone, while I’m also reserving my ticket out of here if he wins,” he said at a press conference. \\n9. Natasha Lyonne \\nWho? Actress in Orange Is the New Black. \\nWhere would she move? A mental hospital. \\n“[I’ll move] to a mental hospital for a while because you’re like ‘why is this happening?’” she said. \\n10. Eddie Griffin \\nWho? Comedian. \\nWhere would he move? Africa. \\n“He’s good at making money, but he’s ignorant…If Trump wins, I’m moving to Africa,” he told DJ Vlad. \\n11. Spike Lee \\nWho? Director of Malcolm X. \\nWhere would he move? …Brooklyn. \\nIf Trump wins, he’ll be “moving back to the republic of Brooklyn, New York,” he reported to Vanity Fair. \\n12. Amber Rose \\nWho? Model. \\nWhere would she move? Unspecified. \\n“I can’t even think about it! I’m moving, I’m out! I can’t. And I am taking my son with me!” she told US Weekly. \\n13. Samuel L. Jackson \\nWho? Actor. \\nWhere would he move? South Africa. \\n“He’s just running for popularity. C’mon, just let it go,” he said on The View. \\n14. Cher \\nWhere would she move? Jupiter \\n“IF HE WERE TO BE ELECTED, IM MOVING TO JUPITER >:|” she tweeted. \\n15. George Lopez \\nWho? Comedian and star of George Lopez. \\nWhere would he move? Mexico. \\n“If he wins, he won’t have to worry about immigration, we’ll all go back,” he told TMZ. \\n16. Barbra Streisand \\nWho? Singer. \\nWhere would she move? Australia or Canada. \\n“He has no facts. I don’t know, I can’t believe it. I’m either coming to your country [Australia], if you’ll let me in, or Canada,” she told Australian journalist Michael Usher. \\n17. Raven-Symoné \\nWho? Actress and host of The View. \\nWhere would she move? Canada. \\n“My confession for this election is if any Republican gets nominated, I’m going to move to Canada with my entire family. I already have my ticket,” she said on The View. \\nNote: Her leaving was contingent on any Republican candidate winning the election–not just Trump. \\n18. Whoopi Goldberg \\nWho? Actress and host of The View. \\nWhere would she move? Unspecified. \\n“I don’t want it to be America. Maybe it’s time for me to move, you know,” she said. \\n19. Omari Hardwick \\nWho? Actor in Power. \\nWhere would he move? Italy. \\n“I’ll move from Denver to Italy… If Donald Trump wins the presidency, I’m out,” he told The Wrap. \\n20. Miley Cyrus \\nWho? Pop star. \\nWhere would she move? Unspecified. \\n“My heart is broken into a 1 pieces…I am moving if this is my president! I don’t say things I don’t mean!” she wrote in an Instagram post. \\n21. Ruth Bader Ginsburg \\nWho? Supreme Court Justice. \\nWhere would she move? New Zealand. \\n“I can’t imagine what the country would be with Donald Trump as our president… Now it’s time for us to move to New Zealand,” she told The New York Times. \\n22. Amy Schumer \\nWho? Comedian and actress. \\nWhere would she move? Spain. \\n“I will need to learn to speak Spanish because I will move to Spain or somewhere… It’s beyond my comprehension if Trump won. It’s too crazy,” she told BBC Newsnight. \\n23. Katie Hopkins '"}, "time": 1742563139.3385189}