{"duration": 0.08460307121276855, "input_args": {"text": "'LONDON  —   Prince Harry on Tuesday attacked the “racial undertones” of British news coverage and social media harassment of his new girlfriend, the American actress Meghan Markle. In an unusual statement, the prince, the    grandson of Queen Elizabeth II, said that a line had been crossed in the reporting of his relationship with Ms. Markle, 35, whose mother is black and whose father is white. “Some of this has been very public,” read the statement, issued in the name of the prince’s spokesman, Jason Knauf. “The smear on the front page of a national newspaper the racial undertones of comment pieces and the outright sexism and racism of social media trolls and web article comments. ” The role and behavior of the news media are a particularly sensitive topic for Prince Harry and his brother, Prince William. Their mother, Diana, died in Paris in a 1997 car crash when pursued by paparazzi. Both princes, who were then 12 and 15, have said that their mother’s death made them wary of the news media, though the royal family has generally been skillful in getting favorable coverage and suppressing scandal. But internet competition and social media activity have accelerated and coarsened coverage of the prince’s relationship with a divorced, biracial woman who was already in the public eye as an actress. Since articles surfaced about Ms. Markle’s dating Prince Harry, the British tabloids have expressed surprise that a “brunette” would be his type and accused her of not being British enough for him. The Daily Mail ran an article headlined, “Harry’s girl is (almost) straight outta Compton:   home of her mother revealed  —   so will he be dropping by for tea?” The article then wove together various racial stereotypes, lamenting Ms. Markle’s mother’s “ ” Los Angeles neighborhood, Crenshaw, and its “tatty   homes,” and listing crime statistics for the area. Newspapers have been digging up suggestive photographs of Ms. Markle and examining her past relationships, and some comments on their websites and on social media have been explicit and racist. The prince’s statement, which confirmed his   relationship with Ms. Markle, expressed fears for her safety and privacy. It noted that his office had regularly fought to keep defamatory articles out of the newspapers  —   which he said had offered large bribes to her  . The statement also condemned the way that the news media has invaded Ms. Markle’s privacy and harassed her mother. In one instance, a palace official said a photographer had chased an assistant to Ms. Markle through the garage of her home in Toronto. The photographer had to be physically removed and the police called, the official said. One article in the tabloid The Sun was about Ms. Markle’s appearing on Pornhub, an adult website, even though the “steamy scenes,” as the newspaper called them, were not pornography but taken from a television series she acts in, “Suits. ” The Sun also ran a headline above an interview with Ms. Markle’s estranged sister, saying, “Don’t fall for my little sis, Harry, she’d be the next Princess Pushy,” a reference to the unkind nickname for Princess Michael of Kent. One comment piece in last weekend’s Mail on Sunday, by Rachel Johnson, said of Ms. Markle: “Genetically, she is blessed. If there is issue from her alleged union with Prince Harry, the Windsors will thicken their watery, thin blue blood and Spencer pale skin and ginger hair with some rich and exotic DNA. ” Ms. Markle described herself as biracial in an August 2015 interview with Elle magazine, saying, “My dad is Caucasian and my mom is  . I’m half black and half white. ” The essay also discussed some of the racism she has experienced as a result. Afua Hirsch, writing in The Guardian, said: “It’s a subtle point, easily missed. Meghan Markle, Prince Harry’s apparent new love, is a ‘glamorous brunette,’ ‘a departure from Prince Harry’s usual type’ and ‘not in the society blonde style of previous girlfriends,’ according to The Daily Mail. I think what they are trying to say is that Markle, actor, global development ambassador and lifestyle blogger, is black. ” Even more scandalous to the tabloids, wrote Ms. Hirsch, is that Ms. Markle is older and divorced and played somewhat “raunchy scenes” in “Suits” and that “her mother is visibly black, with dreadlocks. ” Ms. Markle, who graduated from Northwestern University in 2003, married in 2011 and divorced two years later, a fact that has also been the source of attention from the news media. Prince Harry has criticized the news media before, but never in such an angry and formal fashion. He has gotten into public trouble in the past, with leaked photographs of parties in Las Vegas or wearing a Nazi costume. “Prince Harry is worried about Ms. Markle’s safety and is deeply disappointed that he has not been able to protect her,” the statement said. “It is not right that a few months into a relationship with him that Ms. Markle should be subjected to such a storm. ” “He knows commentators will say this is ‘the price she has to pay’ and that ‘this is all part of the game,’” the statement continued. “He strongly disagrees. This is not a game  —   it is her life and his. ” Ms. Markle is best known for her role as Rachel Zane on the television legal drama “Suits,” and she played an F. B. I. agent in the   series “Fringe. ” She has also been involved in charitable work with nongovernmental organizations. Ms. Markle became a global ambassador for World Vision Canada this year, traveling to Rwanda for its clean water campaign, and she has worked for gender equality and women’s empowerment.'"}, "time": 1742564195.18024}