{"duration": 0.09595489501953125, "input_args": {"text": "'Speaking to workers and business people in Italy’s port city of Genoa Saturday, Pope Francis surprised his hearers by praising entrepreneurship and touting the importance of healthy businesses for the economy. [“There can’t be a good economy without good businessmen, without their capacity to create and to produce,” he said, shattering his reputation as an enemy of the free market economy.  The Pope met with “representatives of the world of work,” including businessmen, workers and unemployed persons at the Ilva steel plant in Genoa Saturday, fielding their questions and reflecting with them on a Christian view of the economy. The Pope recognized that the essential value of work and employment is only possible when companies are sound and successful. Moreover, only an economically healthy society can keep a democracy afloat, he suggested. “The world of work is a human priority,” Francis said, “and it’s also a priority for the pope. There’s always been a friendship between the church and work, starting with Jesus, who was a worker. ” “When work is weakened, it’s democracy that enters into crisis,” he said. “There’s a social compact. ” Without denouncing unemployment benefits, Francis insisted that state intervention wasn’t a real solution. “A monthly check from the state that allows you to keep the family afloat doesn’t solve the problem. It has to be resolved with work for everyone,” he said. The Pope went on to underscore differences between healthy entrepreneurship and financial “speculation,” the latter of which he called both dangerous and unethical. “A sickness of the economy is the progressive transformation of business people into speculators,” Francis said. “A speculator is a figure similar to what Jesus in the gospels called ‘ ’ as opposed to good shepherds. ” Like a hired hand, Francis mused, a speculator “doesn’t love his company or his workers, since they are merely a means for making profits. He has no problem firing people, closing a factory or relocating the company,” because he doesn’t care about his workers but uses them simply as a means for increasing his profits. Francis also said that when competition goes too far and affects the internal life of a company, it becomes  . “The accent on competition, beyond being an anthropological and Christian error, is an economic error because it forgets that a company is above all about cooperation,” he said. “When it’s a system of individual incentives that puts workers into competition among themselves, you can obtain some advantages, but it ends up ruining the trust that’s the soul of any organization,” the Pope argued. “When a crisis comes, the company falls apart. It implodes, because there’s no longer any harmony. ” This isn’t the first time that Pope Francis has shocked pundits by pointing out the important values of a free market economy. In his historic address to the joint session of the U. S. Congress in September, 2015, the Pope took advantage of the occasion to instruct politicians on the importance of wealth creation for lifting the poor out of poverty. The Pope chose to hold up   members of the middle class as an example to all and praising the U. S. free market system. Dashing the predictions of the pundits who prophesied that the Pope would “probably discuss American capitalism’s flaws” in his words to Congress, he actually did the opposite. Comparing the men and women of Congress to the biblical figure of Moses, he reminded them of the importance of the simple, industrious people who make America great. The Pope said that it is “the many thousands of men and women who strive each day to do an honest day’s work, to bring home their daily bread, to save money and  —   one step at a time  —   to build a better life for their families” who “sustain the life of society. ” These men and women “generate solidarity by their actions, and they create organizations which offer a helping hand to those most in need,” he said. The Pope’s most remarkable words came when speaking about the ability of the free market to lift people out of poverty. In the fight against poverty, Francis said, it “goes without saying that part of this great effort is the creation and distribution of wealth. The right use of natural resources, the proper application of technology and the harnessing of the spirit of enterprise are essential elements of an economy which seeks to be modern, inclusive and sustainable. ” “Business is a noble vocation,” the Pope continued, “directed to producing wealth and improving the world. It can be a fruitful source of prosperity for the area in which it operates, especially if it sees the creation of jobs as an essential part of its service to the common good. ” Time and time again Pope Francis has shown that he is more complex and unpredictable than both his critics and his boosters suppose. While focusing his attention on helping the poor, he has also suggested that the free market system may be the best instrument to do just that. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742563403.4092302}