{"duration": 0.18152427673339844, "input_args": {"text": "\"Opinion Un Su-25 à la base aérienne russe de Hmeimim, Syrie. Crédit : AP \\nLa crise syrienne est bien plus dangereuse que les crises de la guerre froide, y compris que la célèbre crise des missiles de Cuba de 1962. Aujourd’hui, le potentiel de conflit dans les relations entre la Russie et les Etats-Unis est plus élevé que ce n’était le cas dans les années 1960. Rivalité systémique Une armée commune européenne pour éviter la désintégration de l’UE? Ce n’est pas un hasard si le politologue américain John Lewis Gaddis a qualifié la guerre froide de « longue période de paix » . Au premier abord, la période qui s’étend entre le milieu des années 1950 et le milieu des années 1980 était une époque de confrontation dure entre deux superpuissances aux idéologies irréconciliables.\\nEn réalité, la confrontation entre l’URSS et les Etats-Unis suivait des règles strictes et ne s’est jamais approchée (malgré la rhétorique virulente) de la confrontation armée directe. \\nLa possession d’armes nucléaires par l’URSS et les Etats-Unis n’était pas la cause principale de cette longue paix. Les dirigeants des superpuissances n’avaient aucune raison politique de lancer un affrontement direct. Les Etats-Unis et l’Union soviétique n’avaient pas de concurrents dans leur rôle de leaders des mondes capitaliste et socialiste. Lire aussi : Convoi de l’Onu bombardé en Syrie : la coopération russo-américaine se fissure \\nL’absence de motifs politiques était complétée par le manque de capacités techniques à mener une guerre directe. Situés dans deux hémisphères différents, l’URSS et les Etats-Unis ne pouvaient pas occuper leur territoire mutuel. Aucune partie ne disposait de la supériorité suffisante pour garantir la défaite de l’adversaire et remporter la victoire dans un conflit régional majeur. \\nL’idéologie soviétique, tout comme l’idéologie américaine, étaient intransigeantes devant l’adversaire. Les deux superpuissances affirmaient le principe de compétition entre le communisme et le libéralisme. L’Otan trouverait-elle la Russie plus dangereuse que Daech? Premièrement, cela signifiait que l’ URSS et les Etats-Unis se considéraient mutuellement comme deux entités égales. Deuxièmement, les deux parties étaient prêtes à suivre des règles. Troisièmement, une compétition suppose que l’adversaire dispose d’aspects positifs qui doivent être adaptés ou surpassés.\\nA la moindre escalade, les dirigeants soviétiques et américains s’empressaient de lancer des négociations et de discuter des conditions d’un compromis. Rivalité non-systémique \\nAprès le démantèlement de l’Union soviétique en 1991, la donne a changé. La Russie et les Etats-Unis ont commencéà accumuler des motifs d’un conflit militaire. Les deux puissances nucléaires aux capacités comparables ont dû construire leurs relations dans le cadre d’un même ordre global mondial. \\nLes contradictions idéologiques réelles se sont justement fait sentir après 1993. Dès la fin de 1994, la Russie refusait officiellement à reconnaître les concepts américains de leadership et d’extension de la démocratie. Lire aussi : Le bouclier US en Europe serait-il dirigé contre la Russie et la Chine ? \\nEn 1997, la Russie avec la Chine ont avancé l’idée d’un monde multipolaire. Cette idée a eu bien du mal à passer à Washington, qui prétendait au rôle de leader de l’ordre mondial en gestation. Il ne s’agissait plus de la coexistence de deux camps, mais de deux façons de construire un monde globalisé. \\nToutes les administrations américaines étaient particulièrement irritées par deux facteurs. Le premier : le potentiel militaire conservé par Moscou. Le deuxième : la conservation par la Russie de son statut de membre permanent du Conseil de sécurité de l’ Onu , qui lui permet de bloquer les décisions de Washington ou de les rendre illégitimes. Syrie : la guerre des résolutions En dépit de la déclaration sur le « partenariat stratégique » , l’objectif de la politique américaine se réduisait à diminuer rapidement (et, idéalement, à liquider) le potentiel stratégique russe pour le ramener à un niveau suffisamment sûr pour les Etats-Unis. \\nLes élites russes , de leur côté, comprenaient parfaitement les raisons qui motivaient les actions des Etats-Unis. Moscou était particulièrement inquiet quant à la réforme du droit international entreprise par Washington. \\nÀ travers un enchaînement de précédents, la diplomatie américaine affirmait deux principes. Le premier : l’éviction forcée des dirigeants des États souverains (avec leur condamnation successive par un tribunal international). Le deuxième : le désarmement forcé des régimes dangereux (du point de vue de Washington) et, en premier lieu, la privation de ces régimes de leur potentiel militaire de destruction massive. Lire aussi : La Russie prête à abattre des avions américains en cas de frappe en Syrie \\nLa guerre en Irak et les crises postérieures autour des programmes nucléaires de l’Iran, de la Corée du Nord et du Pakistan étaient perçues par Moscou comme le rodage d’un scénario de visant à confisquer des ADM à un pays à problème (du point de vue de Washington). Les dirigeants russes soupçonnaient que l’objectif ultime des Etats-Unis était d’utiliser ces approches à l’intention de la Russie. \\nLes nouvelles formes de coopération ont donné naissance à un nouveau type de conflits militaro-politiques. Après 1991, les Etats-Unis ont utilisé la force contre les pays qu’ils désignaient comme « Etats-voyous » , peaufinant ainsi leur modèle de guerre punitive contre des régimes donnés. Washington rompt le dialogue avec Moscou sur la Syrie : et après? Les dirigeants russes ne pouvaient que soupçonner que la Fédération de Russie était l’objectif final de ces actions. Moscou, quant à lui, s’adonnait régulièrement à des démonstrations de force pour contraindre Washington à chercher un compromis.\\nUn système de confrontation indirecte, mais rude, s’est installé entre la Russie et les Etats-Unis. Les crises en Yougoslavie, Tchétchénie, Géorgie et en Ukraine en sont des exemples. \\nÀ ces causes s’ajoute les progrès dans l’ armement . La création d’unités aéroportées autonomes, de systèmes de défense antiaérienne et antimissile, d’armes de précision, etc. rendent le scénario d’un conflit régional entre la Russie et les Etats-Unis plus réaliste du point de vue technique. On ne peut exclure l’éventualité que, dans les 10–15 prochaines années, la tentation d’y recourir grandisse pour les élites de ces deux puissances. Lire aussi : Gorbatchev : « Le monde a atteint une limite dangereuse » L’érosion de la dissuasion nucléaire \\nLa forme future des conflits avec la Russie et la Chine est esquissée, pour la première fois, dans La stratégie militaire nationale des Etats-Unis en 1995. \\nPour les experts américains, ces chocs pourraient prendre la forme d’une intervention de Washington dans un conflit entre Moscou ou Pékin avec l’un de leurs voisins – une sorte de Tempête du désert régionale dans un théâtre d’opérations limité. Bombes et diplomatie : un an d'opération russe en Syrie Sans compter qu’au cours des vingt dernières années, la Russie et la Chine ont accru leur capacité de défense et mis fin à la supériorité américaine dans les armes de précision. Les conflits en Géorgie, en Ukraine et en Syrie doivent être vus comme des tests, une « épreuve de force » pour un affrontement éventuel entre la Russie et les Etats-Unis.\\nIl est difficile de présager comment se terminerait un tel conflit s’il devait, hélas, se produire, mais on peut être certains qu’il mettra fin à l’ordre mondial établi, avec son système financier global et ses processus de mondialisation, ordre au sein du quel l’Onu joue un rôle central. \\nSans doute, le monde reviendra alors à un modèle d’Etats-nations fermés et hostiles sans normes de droit international et à l’idéologie du culte de la force militaire. Après un affrontement hypothétique entre la Russie et les Etats-Unis, le monde rappellera plutôt le système de Versailles-Washington en vigueur de 1919 à 1938. \\nTexte original en anglais disponible sur le site de Russia Direct. Russia Direct est un média analytique international spécialisé dans la politique étrangère. Lire aussi :\""}, "time": 1742564165.0625272}