{"duration": 0.17210054397583008, "input_args": {"text": "'Paul Freedman was having lunch at Delmonico’s  —   not the original, which opened in the early 19th century, but a relic of it in the financial district. Lobster Newburg was still on the menu, the meat napped with a   butter. “But the sauce used to have much, much more brandy in it,” Mr. Freedman said. “The style now is less severe. ” Whatever the brandy content, this plush dish and its environs hardly seemed the stuff of revolution. But to hear Mr. Freedman tell it, Delmonico’s fired the first real shot for American dining, giving rise to a huge, diverse industry that would thrive and adapt to every major shift in the nation’s identity. In his navy suit and   glasses, Mr. Freedman, a professor of medieval history at Yale University, doesn’t look the part of a provocateur, either. But for his new book, “Ten Restaurants That Changed America” (Liveright) he set out on a brash mission: culling through hundreds of thousands of restaurants, across a span of two centuries, to produce a list of what he believes were the 10 most influential. The list is brief, but Mr. Freedman marshals deep research to map the changes each restaurant made to American culture. Howard Johnson’s, the   chain that still evokes nostalgia for the comforting sameness of its fried clams, was designed to be immediately recognizable from a moving vehicle: a wholesome,   restaurant for the growing,   middle class. Until it became a fixture in the 1930s and ’40s, Mr. Freedman writes, roadside dining options were mostly limited to truck stops that catered to men (salesmen and truckers) popping in on their own. Though Howard Johnson’s wasn’t able to keep up with chains that followed in its footsteps, like McDonald’s and Burger King, this was the restaurant that pioneered franchising as an expansion plan, strategically opening along highways and ushering in the era of big fast food. “Uniformity in everything, not just food, was enforced by a manual,” Mr. Freedman writes, “a ‘Bible’ of rules and procedures covering kitchen equipment, décor, maintenance, uniforms and cleaning. ” Chinese restaurants had been in business here since the   century, after the California Gold Rush, but Mr. Freedman zooms in on the Mandarin, which opened in San Francisco in 1961. At a time when most Chinese restaurants were identified with a single dish, chop suey, the Mandarin showed off the cuisine’s nuance. Its owner, Cecilia Chiang, focused on Northern Chinese home cooking, creating a highly successful restaurant that doubled as a bid to broaden Americans’ understanding of Chinese people and culture. Mr. Freedman devotes a chapter to Sylvia’s, the restaurant that Sylvia Woods opened in 1962 in Harlem. Ms. Woods, who was born in South Carolina, was one of many black Americans who moved north in the early 20th century, and she built her business on the traditional Southern cooking she had known as a child. Although in later years, Sylvia’s would become   a shorthand for the very meaning of soul food, for decades it was a prime example of how a neighborhood restaurant could thrive as a social center. Mr. Freedman writes, “It developed a group of regulars, whom Sylvia Woods and her family called by their occupations: ‘  man,’ or ‘  man. ’” At Delmonico’s, a jacketed waiter appeared (“Excuse me? ”) and asked to know if Mr. Freedman would care for some freshly ground black pepper for his pasta with   sauce and peas. Mr. Freedman’s book begins here. When Delmonico’s opened, as a pastry shop in 1827, the restaurant scene in New York was wobbly at best. A hustle of street stalls specialized in cheap, fast oyster preparations. Rowdy taverns served a limited number of simple dishes to people at common tables. That was about it. Americans ate at home, and rich New Yorkers ate and entertained at home. But within a few years, the ambitious Delmonico brothers, from Switzerland, had expanded their pastry shop into a serious French restaurant that modeled itself on   fine dining. It was, as Mr. Freedman tells it, America’s first true restaurant, in that groups could make reservations and order from a deep menu. The kitchen imported black truffles from the Dordogne region of southwest France to bake in pastry, and served   crabs from the Eastern Seaboard, bluefish and turtle. The fare was a prototype: the kind of expensive, endlessly reproduced French cuisine that would rule in American cities for well over 100 years. “I asked the chef if he would recreate an old turtle dish,” said Mr. Freedman, who started the research for his book three years ago, “but he never did get back to me on that. ” Mr. Freedman, who is 67, was raised on the Upper West Side of Manhattan. His father was a psychiatrist and the president of the American Psychiatric Association in the early 1970s (when it declared that homosexuality was not, in fact, an illness). His mother was a labor economist. The family went out to eat French food occasionally, and to Tien Tsin, a Chinese restaurant in Harlem, almost every Saturday. As a treat, Mr. Freedman’s grandmother took him to Schrafft’s, where he ate club sandwiches, chicken potpie and butterscotch sundaes. Schrafft’s, a Northeastern chain, started as a candy store, but in the 1910s transformed itself into a lunch counter and restaurant for women and the expanding middle class. In its early days, before it was considered a stodgy place for little old ladies, it was radical: a safe, affordable space for women to socialize on their own, in an era when women without male escorts were not welcome in restaurants. Schrafft’s also hired many women, not only as waitresses, but also as cooks and managers, and offered maternity leave. Half a dozen of the restaurants in Mr. Freedman’s book could be found in New York, though most are no longer around. The Four Seasons, which established the notion of sophisticated American cuisine in 1959, when French traditions still dominated, also brought in the era of seasonal fine dining. It’s hard to imagine today, but luxury dining up until then had been built on the notion of consistency throughout the year, and on shipping    ingredients, regardless of their quality. A menu that did not change was considered a luxurious menu. Mr. Freedman made it to the Four Seasons before it left its space in the landmark Seagram Building in July, after an impasse with the landlord. (It plans to reopen a few blocks away.) But he missed the chance to experience other restaurants on his list, like Le Pavillon, the Midtown restaurant where Henri Soulé influenced an entire generation of French chefs. Mr. Freedman snubbed one of his choices on principle. “Everyone who lived in New York knew that Mamma Leone’s was a tourist trap,” he said. It was also, as he explains in the chapter devoted to it, much more than that. A giant moneymaking machine, Mamma Leone’s helped bring Italian cuisine and culture into the American mainstream, he writes. Founded by Luisa Leone in 1906, it provided a model for the success of an   restaurant on its own terms, expanding its clientele well beyond   diners. Mr. Freedman rounds out his Top 10 with two restaurants that endure: Antoine’s, which opened in 1840 in New Orleans, “the American city with the strongest roots and the longest run of culinary traditions,” and Chez Panisse in Berkeley, Calif. where in 1971 the chef Alice Waters championed the brand of new American cooking  —   local and seasonal  —   that reigns in restaurants today. Though Mr. Freedman is a medievalist and does not consider himself a food writer, food culture was also the engine of his 2008 book, “Out of the East: Spices and the Medieval Imagination,” in which he debunked the myth that European cooks in the Middle Ages used spices to preserve meat. He lives in Pelham, N. Y. with his wife, Bonnie J. Roe, a lawyer, but often travels to Queens to eat noodles and dumplings at the excellent Taiwanese, Indonesian and Sichuan restaurants in Flushing and Elmhurst. In New Haven, Mr. Freedman’s pizza loyalty lies with Zuppardi’s Apizza and its clam pies, for which the clams are shucked to order. “It takes a little longer, but it’s worth it,” he said. Of the young, ambitious restaurants on the scene now, Mr. Freedman thinks a few may just be in the same league as his 10: Benu, in San Francisco, with its distinctly modern American aesthetic, comes up. So does Husk, in Charleston, S. C. and its ethos that goes far beyond    into reviving historical ingredients. The burger chain Shake Shack, Mr. Freedman notes, could be another contender, with its capacity for   and   reproduction. For dessert at Delmonico’s, Mr. Freedman ordered a baked alaska. It wasn’t just dessert, but a carefully preserved artifact from one of Charles Ranhofer’s old menus: banana ice cream sandwiched in walnut cake, sticky with apricot jam, swaddled in a thick layer of spiky torched meringue. One of the more remarkable things about Mr. Freedman’s book is the way it shows how culinary history repeats itself. By 1867, when Mr. Ranhofer served this dessert, Delmonico’s was buying produce at local markets. “But for many years before that,” Mr. Freedman pointed out, “the restaurant relied on its own farm in Williamsburg. ” Yes, even America’s first restaurant cycled through the Brooklyn    thing. Here are the 10 restaurants that made Mr. Freedman’s list. What would you add to it and why? Tell us in the comments.'"}, "time": 1742564217.6798854}