{"duration": 1.5847206115722656, "input_args": {"text": "'This Wasn’t A Vote, It Was An Uprising \\nDear Readers: The article below has come to me. I am unable to ascertain if it is a published statement or one of those items sent around the Internet. Nevertheless, I do believe that it captures the attitude of those Americans who in the vast majority of the states gave their vote to Donald Trump.\\nThe optimism expessed in the article might be unrealistic. In order to prevail over the Oligarchy, President Trump will need a government as strong as he appears to be. He cannot find the strength he needs for his government among the usual Washington, Wall Street, and corporate sources. If he selects from these people, he will be impotent.\\nThe question is: who is his transition team? Are they focused on making nice with the Oligachs? If so, there will be no change. \\nThe Democratic Party failed America for the eight years of the Clinton Regime, which committed war crimes and overthrew a sovereign government on the basis of lies. The George W. Bush Regime originated the Middle East wars entirely on the basis of lies. These wars have resulted in the deaths, maiming, and dislocation of millions of peoples who have sought refuge from America’s aggression in Europe. The corrupt Obama Regime has continued and expanded Bush’s illegal wars and stupidly brought the US into conflict with Russia and China, either one of which can destroy the United States of America.\\nNow we have the psychopath George Soros funding hired protesters, who are bussed from protest to protest, in an effort to delegitimize the Trump presidency. This is an act of treason, but oligarchs such as Soros are above the law. They are never held accounable. Trump should arrest Soros and put him on trial.\\nTrump says that he wants to bring the oligarchs under the law. If he fails, America fails with him.\\nThis wasn’t an election. It was a revolution. \\nBy Daniel Greenfield, a Shillman Journalism Fellow at the Freedom Center\\nIt was midnight in America. The day of the election millions Americans got up and stood in front of the Machine, the great iron wheel that had been grinding them down. They stood there even though the media told them it was useless. They took their stand even while all the chattering classes laughed and taunted them as white trash racists.\\nThey were fathers who couldn’t feed their families anymore. They were mothers who couldn’t afford health care. They were workers whose jobs had been given to foreigners in foreign countries so that the incomes of oligarchs could rise. They were sons who didn’t see a future for themselves. They were daughters afraid of being raped by the undocumented illegals flooding into their towns. They took a deep breath and they stood.\\nThey held up their hands and the great iron wheel stopped.\\nBlue America crumbled. The Blue States fell one by one. Ohio. Wisconsin. Pennsylvania. Iowa. The white working class that had been overlooked and trampled on for so long got to its feet. It rose up against its oppressors. The rest of the nation, between the West coast and the North East coast–the fly-over zone– rose up with it.\\nThey fought back against their jobs being shipped overseas while their towns filled with migrants that got everything while they got nothing. They fought back against a system in which they could go to jail for a trifle while the elites could violate the law and still stroll through a presidential election.\\nThey fought back against being told that they had to watch what they say. \\nThey fought back against being held in contempt because they wanted to work for a living, take care of their families, and protect the sanctity of marriage.\\nAnd they won.\\nThis wasn’t a vote. It was an uprising. \\nLike the ordinary men chipping away at the Berlin Wall, they tore down an unnatural thing that had towered over them. And as they watched it fall, they marveled at how weak and fragile it had always been. And how much stronger they were than they had ever known.\\nWho were these people? They were the neglected in the fly-over country that is the heart of America. They didn’t have univeristy degrees, and they had never set foot in a Starbucks to pay $5 for a cup of coffee. They were the white working class. They didn’t talk right or think right. They had the wrong ideas, the wrong clothes and the ridiculous idea that they still mattered.\\nThey were told they were wrong about everything. Illegal immigration. Black Lives Matter, but not jobs for the oppressed middle class. Manufacturing is unnecessary for an economy in which financial profits are all important. Transgendered bathrooms. Same gender marriages. Americans were supposed to bow down and surrender to a handful of perverts.\\nTold that the future belongs to the metrosexual dot com transgendered globalist, and not to the guy who once had a good job before the globalist corporations with Washington’s blessings sent it to China or Mexico, real Americans revolted. \\nWhite trash American couldn’t change anything, declared the pundits. But instead of adapting to the inevitable future of America’s demise, they got in their pickup trucks and drove out to vote.\\nAnd they changed everything. \\nBarack Hussein Obama boasted that he had changed America. And he did for the worse. A billion regulations, millions of immigrants, a hundred thousand lies and it was no longer our America. \\nWhite Trash America voted and sent Obama to Hell. They walked through him and through the Democratic Party like the wet paper bag that they are. Voters abandoned the party that had sold out the American people. More black Americans voted for Trump than voted for Romney. \\nThe election repudiated the Obamas, the Clintons, the celebrities, and the media. Americans turned the One Percent’s world upside down.\\nCNN is weeping. MSNBC is wailing. ABC calls it a tantrum. NBC damns it. It wasn’t supposed to happen. The same machine that crushed the American people for six straight terms, the mass of neoconned government, globalist corporations and oligarch-financed non-profits that ran the country, was set to win. Or so they thought.\\nInstead the people stood in front of the Machine. They blocked it with their votes even though the media told them Hillary was the certain winner. They mailed in their absentee ballots even while Hillary Clinton was planning her fireworks victory celebration. They looked at the empty factories and barren farms. They drove through the early cold. They waited in line. They came home to their children to tell them that they had done their best for their future. They bet on America. And they won.\\nThey sre tired of the absence of affordable health care and recognize the fraud of Obamacare. They are tired of unemployment and of being lied to. They are tired of watching their sons come back in coffins so that the military/security complex could continue to loot America with their wars. They are tired of being called names and watching the theft of their country. \\nThey understood that Trump was right. The election was their last hope, their last chance to save themselves and their country. And they did.\\nThis election was not about who gets to use the female toilet. It wasn’t about whether it is racist to enforce the immigration laws. It wasn’t about how men, however uncouthly, express their sexual interest in women.\\nIt was about suffering Americans, whose names no one except a server and the NSA will ever know, fighting back against their oppression. It was about the homeless woman guarding Trump’s star. It was about the betrayed Democrats searching for someone to represent them in Ohio and Pennsylvania. It was about the union men who refused to sell out their futures and vote for a Democrat who is an agent of the One Percent.\\nThe media will never interview those men and women. We will never see their faces. But they are us and we are them. They came to the aid of a nation in peril. They did what real Americans have always done. They did the impossible.\\n\\n\\n\\nThe post This Wasn’t A Vote, It Was An Uprising appeared first on PaulCraigRoberts.org .'"}, "time": 1742563599.1227806}