{"duration": 0.04746389389038086, "input_args": {"text": "'You are here: Home / *Articles of the Bound* / EXCLUSIVE: Keith Ellison’s Student Anti-Capitalist and Anti-Police Activism (Video) EXCLUSIVE: Keith Ellison’s Student Anti-Capitalist and Anti-Police Activism (Video) November 22, 2016, 8:13 am by Guest Author Leave a Comment 0 \\nBy: Renee Nal | New Zeal Keith Ellison (right) in a June 1989 issue of ‘Forward Motion’ responding to “police brutality” \\nIn the wake of communist-fueled anti-police sentiment resulting in relentless, brutal attacks on America’s law enforcement officials, a look at prospective DNC leader Keith Ellison ‘s radical anti-police and anti-capitalist history is in order. \\nAs Trevor Loudon reveals in his film the Enemies Within , Keith Ellison is a “perfect example of the Muslim/Marxist alliance.” In his “student radical days,” the young Marxist was condemning capitalism and “police brutality” around the same time he converted to Islam. In 1989, Keith Ellison was featured in “ Forward Motion ,” the now-defunct print magazine of the Freedom Road Socialist Organization – the same group that eventually spawned the “Black Lives Matter” movement. \\nThe article was titled “Battling the Rise in Police Brutality” and is not found online. Keith Ellison at the FRSO print magazine “Forward Motion,” June 1989 \\nIn the article, Ellison lashed out at “white supremacy” and “capitalism” as being responsible for drug use by black Americans: Keith Ellison as quoted at the FRSO print magazine “Forward Motion,” June 1989 \\nEllison expressed concern later in the same article that working with organized labor may lead to a “white supremacist problem.” Keith Ellison as quoted at the FRSO print magazine “Forward Motion,” June 1989 \\nHere, Keith Ellison discusses the “contradictions” surrounding how those in the progressive movement to convince black Americans that “white supremacy is an evil system” are “predominately white.” Keith Ellison as quoted at the FRSO print magazine “Forward Motion,” June 1989 \\nTrevor Loudon documents more on Keith Ellison here. \\nThe late communist party member Erwin Marquit explains in his memoirs how the radical left worked to elect Keith Ellison in 2006: \\n“To gather support for Ellison, I suggested to [ Communist Party USA members] April Knutson and Jim Knutson that they draft a letter addressed to activists in the peace movement urging them to support Ellison. \\nDoris and I and the Knutsons then solicited signatures to the letter from among well-known peace activists. In July, we circulated the letter as widely as possible. Doris and I volunteered to cosponsor a fundraiser for Ellison in our home on 24 July with our neighbors Dave Holets and his wife Nancy Arneson. Dave, already retired, had been in charge of managing the finances of the School of Physics and Astronomy. Together, we leafleted the immediate neighborhood with invitations to the fundraiser. \\nOn 21 and 22 July, I went into St. Louis Park, a suburb just west of the city line, a block and a half from our home, to do door knocking. When someone appeared at the door, I would begin by introducing myself by name. I was not surprised when one of the first responses I got was, “Oh, you’re the Communist at the University of Minnesota.” Two or three others recognized me in a similar manner. The fact that I was campaigning for Ellison did not seem to bother any of them. ” (emphasis added) \\nWatch this clip on Keith Ellison from Trevor Loudon’s film, The Enemies Within: 0'"}, "time": 1742628569.1807225}