{"duration": 0.04569602012634277, "input_args": {"text": "'Alec Baldwin has a warning for anyone “on deck” to run against President Donald Trump in 2020: you are not going to win. [In an interview with Extra, the Boss Baby actor said that he would enter politics if only to offer “something different” to the American people.  “I would love to run for office because I think people need something different,” Baldwin said, adding, “I think that all the people that are on deck in 2020, none of them are going to win. ” “None of those people are going to beat [Trump],” the    star continued. “You think things are bad now I tell you when things are going to be worse, if he wins again. ” To be clear, Baldwin, who has spent months playing Donald Trump on Saturday Night Live, ruled out adding himself to the ballet: “We’re not going to do that. ” Asked if he is worried that his new memoir, titled Nevertheless, will caused controversy, Baldwin said “I’m married, we have a wonderful family, that’s all I care about. ” Earlier this week, Baldwin appeared on Good Morning America to promote his new book, during which he opened up about a 2007 voicemail to his     daughter Ireland. “It’s thrown in your face every day,” Baldwin said of the voicemail, which was leaked to the media, and caught the actor calling his daughter a “rude, thoughtless little pig. ” “There are people who admonish me, or attack me, and use that as a constant spearhead to do that,” Baldwin explained. “It’s a scab that never heals because it’s been picked at all the time by so many people. I think my daughter, that’s hurt her in a permanent way. ” On Tuesday, producer Dana Brunetti  —   who worked with Baldwin on the 2006 independent film Mini’s First Time  —   slammed the actor’s claim in his biography that he did not know he was filming sex scenes with an underage Nikki Reed.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742563857.3267775}