{"duration": 0.049056053161621094, "input_args": {"text": "'Prison Labor is Slavery by Another Name Prison Labor is Slavery by Another Name By 0 151 \\nRight now there’s a national movement mobilizing to raise the federal minimum wage to a living wage of $15 an hour. But imagine if instead of earning even that much, you could only earn a few cents an hour. \\nIf that sounds like something from the developing world, think again. The reality is our prisons are perpetuating slave labor . \\nEvery day, incarcerated people work long hours for barely any money. Meanwhile, prisons charge inmates for everything from telephone calls, to extra food and convenience items, to occupying a bed. \\nIn an official statement announcing the start of the historically largest nationwide prison strike, the IWW Incarcerated Workers Organizing Committee wrote: “In one voice, rising from the cells of long term solitary confinement, echoed in the dormitories and cell blocks from Virginia to Oregon, we prisoners across the United States vow to finally end slavery in 2016.” \\nThe prison system profits from mass incarceration. Prisons have numerous incentives to fill beds — including the cheap labor prisoners provide — and very little incentive to treat prisoners like human beings. (Photo: Shutterstock) \\nCurrent minimum wage laws don’t apply to people in prison, nor do labor rights regulations. So prisoners experiencing grueling hours or cruel treatment don’t have any recourse to file complaints or seek restitution. \\nOn the contrary, clear human rights violations – including chain gangs — go unchecked all the time. \\nAnd the prison system targets an already incredibly vulnerable population. Most inmates aren’t just low-income — they’re the poorest of the poor. In 2014, prior to their incarceration, inmates generally made over 40 percent less than their peers. \\nMuch of the prison population only wound up in the system in the first place because of policies that criminalize race, poverty, and mental health. \\nSome are there because they couldn’t afford to post bail after facing minimal charges. Others end up back in the system because of stigma and policies that make it difficult to find a job as an ex-convict. \\nOthers still are locked up for being homeless and sleeping on the street, or stealing food. Many with mental illnesses end up cycling between the emergency room and a jail cell. \\nBut even those with steady work, once inside prison, can’t continue to earn a decent living. On just a few pennies an hour, prisoners can’t support themselves or their families, or earn enough to survive once they reenter society. \\nPeople who spend years or even decades behind bars lose years worth of wages and have few resources for food or rent post-incarceration. It’s easy to see how prisons trap people in a cycle of poverty that helps ensure that even if released, they’re likely to end up back in prison. \\nThe majority of these prisoners are people of color who’ve been disproportionately targeted for imprisonment — from racial profiling to the failed war on drugs that targeted black communities starting in the 1980s. \\nAnd it’s not just the wages that are reminiscent of slavery. \\nOne in ten prisoners is subject to physical and sexual abuse by guards and fellow inmates, according to the first National Former Prisoners Survey . \\nThere’s no real infrastructure to address the physical and mental consequences that come with this abuse. Meanwhile, prison wardens, correction officers, and prison administrators are rarely held accountable for their actions. \\nSome of these injustices have inspired the Department of Justice to end federal contracts with private prisons, but that’s not enough. \\nThe Eighth Amendment states that cruel and unusual punishment is illegal in this country. Yet, today people are slaving away in prison factories, under working conditions that first prompted the rise of the labor movement. \\nPrisoners are human beings who deserve the same human rights and dignity as the rest of us. \\nWe must end the practice of prison labor. It’s slavery by another name, and we have a clear obligation to ensure that slavery is completely eradicated in the United States.'"}, "time": 1742628340.5335038}