{"duration": 0.02320551872253418, "input_args": {"text": "\"Share on Facebook Pass me a tissue, please... I'll admit it: I cry during movies… and books, music, and podcasts. Depending on how my hormone levels are, I might preemptively grab tissues and just watch the movie alone. Though a lot of people smirk when they see me watch movies in tears, I'm really fine with it. Truth be told, people who cry over movies tend to have something that a lot of others haven't really cultivated: empathy . It takes a special type of person to have empathy. Many people out there — narcissists and sociopaths, for example — are born without it and live their entire lives without ever really putting themselves in other peoples' shoes. This means they can't really feel for other people. Though a lack of empathy could come in very handy for a used car salesman, it's not always a good thing. Actually caring about others' situations takes strength — a lot of it. Life is brutal to some people and if you're able to actually put yourself in someone else's shoes and feel that pain, it says something about you. You're strong enough to actually withstand that pain, but to feel it nonetheless. You're strong enough to be strong for others. You're strong to the point that you understand where they're coming from and are able to actually feel what they're feeling. It's never a wimpy thing to actually care for another person, even if that person is a fictional character in a movie. It shows that you actually have a heart, and that it's a heart that can break itself for others. Though it can be broken, by the end of the movie, you know it's been patched back together. Being able to recover that quickly says something else about people who cry during movies: they can bounce back like no one else's business , and are strong enough and smart enough to actually separate reality from fiction. Of course, that's not the only reason people cry at the movies. There are also tears that flow because you've been where a character has been — tears of memories that are painful. I have often found it cathartic to see movies that have people going through things I have, simply because it allows me to let some of my bottled up feelings loose in a healthier way. I'd like to see how anyone could doubt someone's strength when they actually confront things that have hurt them in the past. Then, there's the kind of tears that flow when you're really just overwhelmed with the artistic genius of a film. It's not just something pretentious people do, either. It's called Stendhal Syndrome in its more advanced forms and it means that a work of art moved you to the point that you're having both physical and emotional symptoms. Having gotten it after watching the movie Casshern , I can honestly tell you that it takes a lot of strength to jerk yourself out of that physically-altering sense of awe. For people who are really susceptible to the way that art moves them, actually viewing a seriously good movie, listening to a good radio show, or even reading the right comic can be a test of your ability to keep a straight face. It can also be a major roller coaster ride — one which forces you to face and embrace emotions most others choose not to look at . If you ask me, that's a lot of strength to shoulder. Maybe it's not the kind of strength that most people think about when they think of a strong person, but it's the most important kind of emotional strength: empathy. And to a point, intelligent acuity it takes to cry at a movie is something you really can't deny. Even if we aren't lifting 100 pounds, we are exploring our emotions, and that can lift our spirits higher than anything else out there. Related:\""}, "time": 1742628536.2176857}