{"duration": 0.18664288520812988, "input_args": {"text": "'Páginas Libres\\n¡Directores de BCRP ilegalmente designados! Socios | 29 de octubre de 2016 por Guillermo Olivera Díaz*\\n29-10-2016\\nResulta ilegal, por ende NULA, la elección de los 3 nuevos directores del BCRP. Tanto la repentina proposición, ante la Junta de Portavoces, como la velocísima designación por el Pleno del Congreso, sin debate alguno, ni examen de requisitos legales, no cumplen las exigencias que expresamente contempla la Ley Orgánica del Banco.\\nLa \"reconocida solvencia moral\" y la \"amplia competencia y experiencia en economía y finanzas\", requisitos que exige esa Ley, no se presumen o infieren. Deben acreditarse documental e indubitablemente y entrevistando a los propuestos, supuestos que no se han cumplido en ningún momento y forma.\\nLa extraña propuesta y maratónica designación, de un día para otro, viola o infringe lo dispuesto en forma expresa y apodíctica, por la enorme importancia de esta función pública, en el Artículo 11° de la Ley Orgánica del Banco.\\nRafael Rey, integró la plancha presidencial de Keiko en el 2011; José Chlimper, es secretario general de Fuerza Popular y también integró la plancha presidencial del fujimorismo el 2016; y Elmer Cuba, fue casi el único vocero económico en la última campaña electoral de Fuerza Popular, pese a que visiblemente había militado en otro partido del cual era fundador. Por ende, se trata de personajes parcializados, con apego aluvional partidario y ajenos a los intereses generales y neutrales del Banco Central de Reserva.\\nTienen los 3 designados una estrecha vinculación con el fujimorismo y Keiko Fujimori; su designación, de un día de proposición: a las 4 pm, a otro de designación, luego de una repentina y misteriosa propuesta sin documentos de los propuestos, incumple la letra y espíritu del citado Artículo 11° de la ley del Banco Central de Reserva.\\nLo que dice la norma:\\nArtículo 11: “Los directores deben ser peruanos, tener reconocida solvencia moral y poseer amplia competencia y experiencia en economía y finanzas. No representan a entidad o interés particular alguno y su voto debe tener en cuenta únicamente el cumplimiento de la finalidad y las funciones del Banco”.\\nLos tres largamente incumplen esta disposición, pues no se ha establecido debidamente, mediante el escrutinio necesario y documentos del caso, que posean esa reconocida solvencia moral y que tengan no solo competencia o pericia, sino que tengan amplia experiencia en economía y finanzas, que solo es posible acreditarlo mediante el examen correspondiente, en un proceso que debe sujetarse al escrutinio congresal y público, lo cual claramente se ha esquivado o escamoteado. Se ha omitido acatar la ley.\\nAdemás, los tres representan claramente los intereses de Fuerza Popular y de Keiko, y eso está muy claro. Su conducta repetida y pública lo demuestra hasta la saciedad. Profusas fotos hablan de esta íntima anastomosis partidaria.\\nLa solvencia moral no se presume, ni consta en el aire, no es gaseosa, debe demostrarse, acreditarse o probarse y con mayor razón si ella debe ser RECONOCIDA por muchos o por todos\\nIgualmente, la competencia y experiencia en las materias económica y finanzas no se deducen o se coligen por los dichos de los propios interesados, sino que igualmente deben acreditarse, cosa que no se ha hecho. Resulta así absolutamente ilegal esta proposición y designación de los tres candidatos. Alguien debe impugnar este nombramiento ante el Congreso o ante el Poder Judicial. Lo que viola la ley es pasible de nulidad.\\nTomado de http://senaldealerta.pe/opini%C3%B3...\\n* [email protected]'"}, "time": 1742563120.9135406}