{"duration": 0.3416454792022705, "input_args": {"text": "'Donate On Trump: an Open Letter to the Brokenhearted \"To those of you that care about diversity, about the environment, about the beauty of queer sexual orientations, about indigenous lands and their right to thrive, and about policing practices that have led to the deaths of many black men and women...I write.\" How do we respond to this confusing moment? What do we do now? How do we recover? By Adebayo Akomolafe / bayoakomolafe.net \\nLet us acknowledge these difficult feelings of loss, these terrifying thoughts that are suddenly very alive in the air today. It is as if Pandora’s Box has not only been emptied out into the world, but that it has been mass-produced and spread out to the corners of all lands. Hope now seems in short supply. We are undone. \\nI write you because things have indeed fallen apart. While this unspeakable insurgency of despair might goad us into rushing into the next ‘organizational moment’– the itch to hit them back or do something – I want to invite us to slow down and pay attention to the stark grief that haunts us now. She stares us in the face, this repulsive visitor. If we must survive, we must return her gaze and let her do her important work with us. \\nI am a Nigerian living in India. But like most people on the planet that tuned in to the surrealism of the 2016 American presidential campaigns, I woke up to the shocking news that Donald Trump was not only beating Hillary Clinton on election day, but that there was a frightening possibility he could win. And then that distant possibility, once laughably out of the question, became a gut-wrenching reality-to-come. Hillary’s ‘blue wall’ fell to the man who promised to build more; the media people stuttered as their once pristine cast of glossy pundits groped for words; the Mexican peso fell. And in one fell swoop, it felt like America, the so-called home of the brave was exactly that : a place dyed in fear, where braveness would now be required to keep on living. \\nEver since Donald Trump became the 45 th president of the United States, the internet has been flooded with articles attempting to make sense of this story-bursting, crystal-ball-shattering moment. Politico published a piece with a title that must have resonated with many people around the world: “How did everyone get it so wrong?” The London-based Independent insisted that “Donald Trump would have lost US election if Bernie Sanders had been the candidate”, while Thomas Frank opined on the pages of The Guardian that “Donald Trump is moving to the White House, and liberals put him there”. Across the fractured landscape of YouTubia, self-professed Trumpists – also surprised by their fortune – laughed at liberals, mocking the ‘feminazis’ that thought Hillary Clinton – an admittedly troubled candidate who didn’t seem to have a message beyond insisting on her entitlement – would simply waltz into the White House. \\nI will not attempt to pry open the cadaver of this moment – it is probably the case that no post-mortem analysis is good enough to assuage our feelings of shock. What happened is not reducible to a single causative factor or a decidable ‘active ingredient’. The world isn’t that simple. I will however state, in the spirit of full disclosure – the kind of radical honesty we probably need at this time – that I secretly wanted this to happen: I was so invested in the idea of a Sanders presidency (and so mortified by what was obvious to me as an establishmentarian attempt to stifle his voice) that I became possessed by a schadenfreude I couldn’t easily exorcise. I understood the dangers of a potential Trump presidency, but decided even that was better off to the inertia of the neoliberal status quo as embodied by a Hillary Clinton regime. That argument is not easily maintained in the face of the orange predicament we now find ourselves in. \\nIn an all-too-real case of “be careful what you wish for”, I find not relief but a painful sympathy with many who had hoped that the morning of 9 th would somehow usher in a more tolerant America. A more beautiful country. A country that cares about its many colours and contours. Now because of Trump and the energies he has activated, minorities are probably less safe. At a time of unprecedented racial tensions and phallic exhibitions of gunmanship, some folks are already dreading their next brief visit to the shopping mall, knowing that the streets are now being painted red with hate, white with racial acrimony and blind nativism, and blue with the authoritarian aloofness of a candidate who promised ‘law and order’. The new America. \\nIt is to these vulnerable ones I write. Those of you that care about diversity, about the environment, about the beauty of queer sexual orientations, about indigenous lands and their right to thrive, and about policing practices that have led to the deaths of many black men and women. \\nWithout pre-empting Donald Trump or falling into the trap of disillusioned punditry – and yet with a keen awareness of the likely consequences of his presidency – I ask: how do we respond to this? What do we do? How do we recover? What opportunities are presenting themselves to us to work for (with) a caring world? At the time of writing this letter, there is news of revolt on the streets of Los Angeles, Chicago, New York and other American cities. People are protesting the rise of Trump. People are angry. Around this same time, famed documentarian Michael Moore has suggested concerned Americans should ‘fire the punditry’ and ‘take over the Democratic party’. It is impossible to answer the question of what a ‘right’ response is, or to speak as if one is situated outside the swirl and flow of things. I do however want to invite you to try doing something less spectacular…something small, for it is my opinion that with Trump, the seeds of a ‘new’ politics may yet be planted. \\nWhen I was growing up in Christian Nigeria, I was taught to think of my life only in terms of its ‘greatness quotient’. I was conditioned early to yearn for prominence. Fame. Fortune. Legacy. Success. ‘Awakening the Giant Within’. Getting to the top. Lasting forever. Those were resonant memes in my developmental years. The figures of Mandela, Bill Gates, Jack Welch, and Jesus were placed before me as aspirational objects. If I did not do all I can to increase my ‘greatness quotient’, my life did not really matter. \\nI suspect this story is not uniquely mine to tell. We live in a world that places priority in the ‘top’ and discountenances the ‘bottom’. The condition for living a life of meaning and purpose was moral probity: the stunning city of bigness only admitted those who walked the straight and narrow way, I was told. \\nWell, if all that held true once, November 8 was a spectacular repudiation. Donald Trump, ill-prepared, a self-decorated humble person, and one who had said awful things about women, attained the highest office in America – his face beamed on to the Empire State Building in New York amidst the pomp and pageantry that defined his life. The Joker won…and nothing adds up anymore. Punditry is broken. Polls are broken. The sure-banker firepower of celebrity is broken. Virtue is broken. \\nTrump strolled to the grand stage up in the front and wrecked it, but in so doing he inadvertently ‘gave’ us permission to inhabit the aisles – to rearrange the entire room. By becoming president, Trump disturbs the idea that the top is worth reaching – not because he is so vile that his new position as president denigrates the office, but because his unprecedented campaign and quest for power shakes us loose to recognize that where we stand is a thick place, sewn through and through with voices and potential and power. \\nThe stunning revelation of these times of upheaval is that ‘winning’ is defunct, and new relational modes are desperately needed: the red tape, the raised chair, the grand stage, the green room, and the white house are not the interesting, glorified objects they once were. The emperor has lost his clothes. This whole idea that greatness is some end goal to be achieved by the morally pure, the experienced, and the hardworking, has itself been reworked. And we are left with an awkward coming to terms with the fact that life isn’t a highway but an ecology of small things and ordinary becomings. \\nThe way forward is thus awkward – or rather, there is no clear algorithm on what to do now except perhaps, among other things, to pay close attention to these twists and turns, these rabbit holes and tricky terrains. To take a critical look at the material details of our lives outside of the lenses of identity politics. An immaculate straight line was never ‘there’ to begin with. We are left with these small lives the media pretends doesn’t really matter until you achieve celebrity status; we are left with the first stuttering words of a politics that invites us to the incommensurability of our small hours, and – in place of our fascination with distant power and oh-so-shiny things – urges an attention to our bodies, our relationships, our communities, our hidden miracles, our own stories, and our own knowings. \\nLet me spell it out…what I suggest we can do. Please understand that I do not offer these points with any confidence in their stability or with any sort of finality. I offer them sensing that this moment could very well be that bright spot in the middle of a shadow, affording us an opportunity to co-create a politics that does not terminate with concession speeches – a politics that is not tied so stubbornly to single candidates and anorexic voting lines. I sing the songs of other places of power: Embrace the fact that the world is larger than our plots: \\nThe plot of a story is both its gentle guiding hand and its suffocating grip, helping it move along but also blinding it from realizing that life is bigger, sterner, and more promiscuous than its logic. I could have sworn that with Bernie Sanders’ candidacy, the world was finally stepping into an age of deeper justice and beauty – that evolutionary moment we all await. His ‘failure’ to clinch the nomination was a chastising moment for many keen followers of the American primaries. I slowly came to terms with the fact that the world is not beholden to my liberal fantasies. Simply put, the map is not the terrain. The world stretches far and wide beyond our blind spots, our analyses, and our convictions about what justice looks like. Let grief do her work: \\nGlobalizing society hardly has any place left for grief. When we get uncomfortable, we are urged to pull ourselves together and get back on the wheel. I reckon that today’s grief has something to teach us; there is a genius to its workings that allow a shift in how we relate with the world. I do not mean that we should all sit down and hold hands. I do however feel we can acknowledge that we are in a mess, and adjourn the quest for a palliative solution for the time being. Perhaps instead of counting down to 2020, or calling on Michelle Obama to run for office, we can use these days to investigate the edges of our politics. I believe grief disciplines us for this slow kind of work. What is at stake here is more than a liberal agenda, it is how we see the world and therefore how we maintain power structures that no longer serve our fondest hopes. At least for the moment, nurture a suspicion for shiny objects : \\nWe have become a photogenic people – attracted to the spectacular, repulsed by the unseemly. We live in cosmetic pixels. With selfies, Instagram posts, televised news that seems more committed to graphics and bloated soundtracks, and the ongoing digitization of relationships, our lives have been reduced to images – and we are forgetting the art of living in the spaces between those images. We are thus habituated to a regime of visuality that defines what is real to us – and silences/excludes other voices from mattering. Perhaps the reason why most people were shocked by the news of Trump’s win was because they were contained by narratives and material conditions that forced a certain view about America. But then the terrain met the map. We need a new set of eyes. Find the others: \\nWhen things break, we are afforded an opportunity to make reconfigurations. This perhaps is a good time to investigate the contours of our relationships with others, with those we love, with our neighbourhoods, with the strangers who breeze past us in a blur of inconsequentiality. American politics is premised on fixed identity categories – that Democrats and Republicans are essentially two aspects of an adversarial binary. To a large extent, each side sees the other as a noxious blight on the face of the country. The first moments of ‘healing this divide’ is the recognition that even evil has a story, that those persons who hate black people, or curse at ‘the gays’, didn’t just spring out from the earth, fully realized and fleshed out. In a sense that often escapes us, we are unfolding, hyphenated aspects of each other. None of us is on the side of ‘good’. Donald Trump and the people that support him are just as much a product of the same media-infused, economically imperilled, people-denying politics that have created us. In a game of sides, the greatest loss we suffer is the other side. Let us leave room for the outlier, for the strange, and for the unexpected. We are not as ‘sorted out’ as we think we are. Notice the ground upon which you stand: \\nI like to say that falling could very well be flying, without the tyranny of coordinates. Technically speaking, falling objects are actually the gravitational pull of attraction between objects. I won’t succumb to, or insist that, we are being ushered into a more glorious paradigm of politics…I cannot make that claim. There are however sympathies between place and feet, between our stories and our contexts, that call on us to participate in the sacredness of where we are. What attracts you now? What questions matter to you? What performances of place are pressing themselves upon you? What do you do every day? Where do you come from? Does that question make sense? A friend, Eric Chisler, put this sentiment this way: “Remember the earth. Remember your ancestors. Remember your four-legged, winged, crawling relatives. Remember life. Your life, your way of living, that is the only activism you’ve ever had. Use it. Make your existence a ritual that honors everything your body and words touch. The times are troubled and you are needed. Wake up—notice the consequence of every action and non-action. You are needed. You are needed. You are needed.” The confusion about what to do next is redemptive : \\nIf you are still confused about what this all means, how anyone could vote for Trump, what the future holds and how to respond to this proto-crisis of sorts, count yourself among the lucky ones. Confusion and uncertainty are how multiple agencies negotiate directionality – and this ongoing process is important. Even inertia isn’t determinately still. We must slowdown in these times of urgency, and allow other agentic forces to reshape us. \\nIt might be the case that within the specificity of your own context, you know what to do. That’s great. March on the streets. Print BLM tee-shirts. Learn how to plant your own food. Investigate your ancestry. Or open a gift shop and invite passers-by to get free hugs. Out of the logic of our emergence, new moments are distilled and new activisms become possible. We must be humble enough to recognize that the ‘right thing’ to do is almost always known in retrospect, and that justice is always justice-in-the-making. Small lives matter: \\nFinally, don’t beat yourself up for not saving the day. Even if some archaic policy were conjured by the White House, annulling president-elect Trump’s win, it still wouldn’t do much to address the politics that made him happen. The fight is not so much with Trump as it is for a new way of meeting our own selves – a way of speaking with those we consider ‘other than us’. In short, we must turn to each other, for it is in the smallness of our embrace that new worlds burst into life. \\n\\nAll considered, would it have been great to have a woman president? Yes. That would have assured many of their place in the world and told them that they are valued and needed and worthy of love. And yet, that message finds a more interesting home now that we have lost our way…now that hope seems faraway. \\nThe politics that knocks on our doors right now doesn’t have to wait for the next four years. Let your campaigns of sacred enlivenment continue. \\nBayo Akomolafe'"}, "time": 1742564314.980532}