{"duration": 0.02305912971496582, "input_args": {"text": "'Wednesday on Fox News Channel’s “America’s Newsroom,” White House press secretary Sean Spicer elaborated on a statement he offered earlier reacting to a federal judge’s ruling against an executive order threatening to strip federal funding from U. S. cities that function as   sanctuary cities.  In that statement, it said sanctuary cities had the “blood of dead of Americans on their hand. ” “[S]an Francisco, and cities like it, are putting the   of criminal aliens before the safety of our citizens, and those city officials who authored these policies have the blood of dead Americans on their hands,” the White House statement read, referring to the 2015 Kate Steinle shooting by an illegal immigrant. “This San Francisco judge’s erroneous ruling is a gift to the criminal gang and cartel element in our country, empowering the worst kind of human trafficking and sex trafficking, and putting thousands of innocent lives at risk. ” Also in that statement, White House indicated it would prevail before the Supreme Court in overturning that federal judge’s ruling. “America’s Newsroom” anchor Bill Hemmer asked Spicer on what grounds the White House thought the Supreme Court would side on its side, to which Spicer said the executive order was within the authorities it has been given under U. S. code. “On the same grounds as the court ruled,” Spicer replied. “Ironically, the court agreed with the president’s interpretation of the authorities that he has given under U. S. Code. Where they differed is the interpretation of the intent of it which is outside of what they should be looking at. The U. S. Code makes it clear this president has the full authority to do what’s necessary to protect this country and to present grant money in a way he sees fit. The idea that any judge or any jurisdiction would not be wanting to help make sure that we can protect our citizens runs counter to what we should be looking for as citizens and laws supporting to do. ” Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742561934.0508301}