{"duration": 0.12645983695983887, "input_args": {"text": "'The Establishment’s Massive ‘Intelligence Failure’ November 11, 2016 \\nAs shocking as Donald Trump’s victory was – and as uncertain as the future is – his victory marked a massive “intelligence failure” of the Establishment, a blow to its arrogance and self-dealing, says ex-CIA official Graham E. Fuller. \\nBy Graham E. Fuller \\nPresident Trump. The very words hit the ear as a shock; the mind is not ready for it. \\nAnd that is exactly the problem. We could not see it coming. Among other things this tawdry and interminable election represents a massive American intelligence failure. Not failure of IQ, but failure to grasp reality — now a deeply engrained American characteristic. We not only fail to perceive and grasp reality abroad, but now even at home. President Barack Obama meets with President-elect Donald Trump in the Oval Office, Nov. 10, 2016. (Official White House Photo by Pete Souza) \\nThe Establishment was cocksure down to the last hours that such a thing could not, would not happen. It had drunk its own Kool-Aid. \\nA huge portion of this intelligence failure rests with the Democratic Party. Its complacent certitude of its right to win, expressed right down to the end of Election Day, was vivid. \\nSuch smugness also fed the anger of Trump supporters, many of whom were apparently shamed into hiding it, but who voted Donald Trump in the anonymity of the polling place. \\nIt did not fully grasp the racism that still runs so deeply in American society, the poisonous and corrosive legacy of slavery that has not truly been internalized by most white people. The prejudice against Latino, and especially Mexican people, betrays ignorance of the historical reality that vast areas of rising Latino power in the U.S. today are precisely those regions that once constituted an integral part of a large state of Mexico, its society, culture and politics — Texas, Arizona, California. \\nThe U.S. power Establishment — the two national parties, the bureaucracy, the “deep state,” the military, the security establishment, Wall Street and the corporations — all have believed in their own exceptionalism and right to dominate and determine the course of American society — and indeed even much of the rest of the world. \\nWe had no reason to expect that the Republican Party could serve as the natural voice of those who feel disenfranchised and economically marginalized — dissed in the fullest sense. In this sense, Trump was a revolution from within the ranks of the Republican Party. Or perhaps more accurately, he seized the mechanism of the Republican Party to broadcast a message that the Republican establishment could not see or believe until too late. \\nAnd there was widespread and shocking misogyny towards Hillary Clinton and women. And there was shocking racism in the subliminal hostility to the legitimacy of President Obama. That cannot be blamed on the Democratic establishment. \\nThe Democratic Party’s Failure \\nBut for all the ugliness of the Trump campaign, the failure and the blame for this situation rests more deeply with the Democratic Party. This is the party that nominally is supposed to represent the liberal conscience of the country, of those who feel excluded or disadvantaged or just plain hurting within American society. Sen. Bernie Sanders speaking to one of his large crowds of supporters. (Photo credit: Sanders campaign) \\nYet the party’s establishment not only remained insensitive to the deep source of discontent across American society, it actively sought to crush expressions of it. It was openly allied with corporate America, reveling in the contest of who could collect greater bribe money. \\nBernie Sanders, however, did represent a true, clear, open voice articulating a great deal — but not all — of what was profoundly wrong in American society and politics. The Democratic establishment mocked, diminished, or ignored that message as best it could, including President Obama himself. Yet ironically Sanders would likely have defeated Trump. \\nThe performance of the New York Times is especially egregious in this regard. I pick on the Times because it is supposed to represent America’s greatest newspaper, the “newspaper of record,” in theory a voice of centrist liberalism in the country. \\nYet the Times, fully representing establishment and corporate interests, would not/could not acknowledge the Sanders campaign for what it was. It treated it as an amusing human-interest story at most, a sideshow while the big boys got on with serious politics. It constantly opposed Sanders to the end. And once Hillary Clinton was the anointed candidate, the Times turned its powerful establishment guns against Trump as the sole remaining threat to the Establishment. \\nThere are lots of things to dislike or even condemn about Trump and many of his followers. But the Times abandoned any pretense of deeper examination of the Establishment that Trump was posing. It became all anti-Trump all day 24/7 with every single writer and voice assigned a niche role in denigrating Trump. News coverage was indistinguishable from editorial. \\nThe paper became analytically a bore, predictable, a kind of Pravda-on-Hudson. Same-ole same-ole every day. They began to believe it. One had to turn to the foreign press to sometimes get a little broader and deeper analysis. \\nMore hearteningly, we got to see the significant power of the left-of-center voices, primarily relegated to the internet, which made major contributions in understanding the phenomena at hand if anybody bothered to look. The Nation has to rank high in this regard, a publication largely dismissed by the Establishment as marginal, ideological and crank. So did other sites like Truth-Out, Common Sense, Real News, Real World News, Consortium News, Tom Englehardt, and Reader Supported News. \\nIt was not that these sites were right about everything, and god knows each had their own clear perspective and preferences as well, but they were willing to examine the alternative realities around us in the world. The Establishment and the mainstream media never got beyond their own smug stance in support of what they believed was the dominant, anointed perspective. \\nTrump’s Unknowns \\nWhat do we now face with the election of Trump? The scariest thing is that we don’t really know. There is a welter of conflicting signals and we each have had our favorite reasons to hate him. Yet manifestly Trump has had his fingers on the pulse of a huge portion of the country that feels angry, oppressed and isolated. (Sanders grasped this as well.) Former Secretary of State Hillary Clinton. \\nTrump is also an opportunist. He will say anything to get elected. Most politicians will, but he did it better. (Sanders, to his credit, did not say anything to get elected — that is why the Establishment was so shocked, dismissive and incredulous about him.) \\nHow else to explain the rush of the entire spectrum of the Establishment, Democrat and Republican, including leading neoconservatives, to publicly repudiate Trump and declare Hillary as their candidate? \\nAt this point, Trump’s checkered and inconsistent platform record makes it hard to know who the real Trump is. President Obama is probably right that Trump would seem to be temperamentally unfit to be president. But Trump is not the first to be so. \\nLet’s remember that for much of his earlier campaign Trump was often to the left of Hillary — he said the rich should pay more taxes, he attacked and discredited Bush Jr.’s military adventures, he said he could get along with Putin, he said that the U.S. should adopt a neutral stance on the Palestinian issue, he opposed the corporatization of foreign policy in the form of “globalization,” and he opposed compulsive U.S. intervention abroad. \\nHe tacitly acknowledged that America was no longer “great”—fairly evident by so many measures, but denied shrilly by Hillary. Trump has subsequently backed off from many of these positions. Were those his instinctive “default” positions? They served him well at the outset, along with lots of other bad ideas and attitudes. \\nThe Republican and Democratic establishments and the American “deep state” are indeed aware that they may be losing their sinecure on political, financial, military and security policy. How successful might they be in enfolding Trump within their embrace and “rightly guiding” him. And do we want that? \\nThe co-optive power of the American “deep state” is great. The Republican and Democrat establishments may be deeply competitive on domestic issues, especially social ones. But they seem to close ranks on foreign policy. There has been no debate, no discussion about American “exceptionalism,” its right to intervene anywhere and everywhere in the world, and the need to maintain American supremacy in all things, especially military. \\nThe knee-jerk hatred of Russia as its former Cold War opponent, now no longer prostrate. America’s deep fear of China as a rising and successful rival. The reluctance to embrace multilateralism except on U.S. terms. The routine preference for military solutions (“if we have it, why not use it?”) involving issues that above all require diplomatic and political solutions. US reluctance to acknowledge the importance of other rising nations, among them the BRICS. The tendency to believe that every issue in the world may represent a “vital American interest.” \\nWho Is Trump? \\nIn the absence of information so far on who President Trump’s actual appointees will be, it is hard to speculate about future foreign policy. Initial rumors of potential nominees are disquieting. But I tend to think that Trump, by himself, may not be any more likely to stumble into war than Hillary Clinton would have been. Worryingly, the foreign policy “deep state” may override him. A sign supporting Donald Trump at a rally at Veterans Memorial Coliseum at the Arizona State Fairgrounds in Phoenix, Arizona. June 18, 2016 (Photo by Gage Skidmore) \\nDomestically, non-white Americans, and all women, have much reason to fear his language — even more, to fear the views and voices of many of Trump’s supporters. But Trump may have enough ego to now try to be president of “all of America.” \\nHis FDR, New Deal instincts — occasionally uttered — could be significant. A bold, dramatic new domestic agenda could have great impact and be entirely affordable, but only if corporations pay their taxes and if half the U.S. military budget — bigger than the next ten nations in the world combined — was dedicated to fixing America’s crying infrastructural and economic needs for the bottom 90 percent of the population. \\nShockingly, we have a military budget six times greater than the monies allocated to American education — and this in a techno-competitive world. \\nIn the end, this election represents the total collapse of the Republican Party (which is not a true conservative party but a corporate and socially reactionary party). And the election has now gutted the Democratic establishment as well. It had it coming. \\nBut the forces that have kept this country on the wrong path for so long are so intractable, so institutionalized, so resistant to change that it may just require just such a massive shake-up of the system to allow new and creative forces to arise. \\nStrikingly, America is the only democracy in the world that has no Left. The U.S. political spectrum begins just right of center with Obama (except on social issues) and marches on across to a Crazy Right. Indeed, it is slanderous to be called a liberal today, much less a “leftist.” (Being a “rightist” is fine.) \\nAbove all, we should hope that a true genuine Left will now arise in the country, of which Bernie Sanders and Elizabeth Warren are important components. Youth will be its vital second base. Its ranks will grow rapidly if Trump fails to deliver. \\nThe need for big-time change has never been more apparent. Will this cataclysm within the Establishment now give birth to new creative forces, bigger than Trump himself? \\nGraham E. Fuller is a former senior CIA official, author of numerous books on geopolitics and the Muslim World; his latest book is Breaking Faith: A novel of espionage and an American’s crisis of conscience in Pakistan. (Amazon, Kindle) grahamefuller.com'"}, "time": 1742628411.5103416}