{"duration": 0.0898892879486084, "input_args": {"text": "'kreml , moskau , sicherheit Viele vermuten, der Kreml soll vor Drohnen geschützt werden. Quelle:Evgeny Biyatov/RIA Novosti \\nDie Bewohner Moskaus haben Ausfälle ihrer Navigationsgeräte in der Umgebung des Kremls bemerkt: Kommt man in die Nähe der Kremlmauer, verhalten sich GPS- und Glonass-Navigationsgeräte von Zeit zu Zeit merkwürdig und zeigen einen Ort an, der sich 30 Kilometer vom tatsächlichen Standort befindet. \\nDie Anomalie wurde bereits im Sommer dieses Jahres bemerkt. Alles begann mit dem Spiel „Pokemon Go“, das nur mit GPS funktioniert. Nutzer beschwerten sich über ein unzuverlässiges Signal im Gebiet um den Kreml. „Wahrscheinlich gibt es im Kreml seltene Pokemons, und der Wachdienst will vermeiden, dass die Spieler dort auftauchen“, vermutete schon im Juli der beliebte Blogger Ilja Warlamow. Überwachung im Büro: Der Arbeitgeber hört mit Ungefähr zur gleichen Zeit waren Ausfälle bei Fahrern und Nutzern von Taxidiensten im Gespräch. Während sie am Kreml vorbeifuhren, „teleportierte“ sie die Navigation völlig unerwartet auf das Gelände der Flughäfen Wnukowo oder Domodedowo – aus unbekannten Gründen beförderte sie die „Kremlanomalie“ immer gerade dorthin. Das führte dazu, dass Kunden ihre Fahrt als Transfer vom Flughafen berechnet wurde; natürlich für ein Vielfaches des eigentlichen Tarifs. „Jedes Mal, wenn ich ein Taxi zu mir nach Hause bestellt habe, war ich plötzlich in Wnukowo“, schrieb Anna Lapkina bei Facebook.\\nDer russischen Uber-Vertretung sind die Ausfälle bekannt, aber sie seien „nicht massenhaft“, wie das Unternehmen gegenüber RBTH versichert. „Es nutzen doch alle die sozialen Netzwerke. In der letzten Zeit sind mir nur zwei oder drei Beschwerden zu Ohren gekommen“, sagt Jewgenija Schipowa, Mitarbeiterin des Pressedienstes. „Der Kundendienst hat sich damit beschäftigt und keinerlei Probleme feststellen können.“ „Das ist ein Kampf gegen Drohnen!“ \\nAllerdings habe sich die Situation seit dem Sommer nicht gebessert, versichern Nutzer, und ähnliche Ausfälle seien auch in anderen Gebieten Moskaus registriert worden. Im Raum Usowo, unweit der Residenz von Präsident Wladimir Putin, verhalten sich Navigationsgeräte zum Beispiel ebenso merkwürdig. \\nDie Ausfälle sind sogar Dmitrij Peskow, dem Pressesprecher des Präsidenten, aufgefallen. „Ich saß vor Kurzem am Wochenende selbst am Steuer und der Yandex-Navigator in meinem Telefon hat mich tatsächlich in ein anderes Gebiet befördert. Mich hat das nicht sonderlich gestört, aber ich habe mich gewundert“, erzählte er und fügte hinzu, dass er nicht wisse, wie es dazu käme. Was passiert, wenn man den Roten Platz mit einer Drohne filmt Warum dies geschieht, versuchte Grigorij Bakunow, Yandex-Direktor für technologischen Ausbau, herauszufinden. Mit einem Rucksack voller Messgeräte ausgerüstet stieg Bakunow auf seinen Segway und fuhr die „unbeständigen Zonen“ ab.\\n„Ich habe Folgendes herausgefunden: Irgendwo im Kreml steht (oder bewegt sich möglicherweise auch) eine leistungsstarke Sendeeinrichtung. Sie imitiert die Signale von GPS und Glonass“, schreibtder Softwareexperte. „Interessant dabei ist, dass das Scheinsignal einen zum Flughafen Wnukowo schickt. Man kann sich unzählige Theorien überlegen, warum das Signal einen gerade dorthin schickt. Meine persönliche Lieblingstheorie ist der Kampf gegen Drohnen vom Typ DJI und ähnlichen.“ \\nModerne Drohnen nutzen eine Karte, in der Flugverbotszonen ausgegeben sind, und zu diesen Zonen gehören auch alle Flughäfen der Welt. „Es ist unverständlich, warum im Kampf gegen Drohnen das GPS-Signal verändert wird und man die entsprechenden Zonen nicht einfach als verboten kennzeichnet. Aber das liegt natürlich nicht in unserer Kompetenz“, schließt Bakunow. Spekulationen über die Gründe \\nDie Theorie des Kampfes gegen Drohnen erscheint den meisten tatsächlich als die überzeugendste. Aller Wahrscheinlichkeit nach will der Föderale Wachdienst FSO auf diese Weise den Kreml vor dem unsanktionierten Eindringen von Drohnen schützen. „Direkt hinter dem Petersturm befindet sich ein Hubschrauberlandeplatz, der regelmäßig von Putin genutzt wird. Ja, er liebt es, mit dem Hubschrauber in den Kreml zu fliegen“, schreibt Warlamow. \\nDer FSO weist freilich jegliche Verantwortung für die Navigationsstörungen von sich. „Ja, von den Taxidiensten, den Navigationsausfällen und den Folgen für die Kunden haben wir gehört. Das ging bereits im Sommer los“, sagt ein Vertreter der Behörde im Gespräch mit RBTH und fügt hinzu, dass diese absolut nichts damit zu tun habe. „Ich empfehle, sich an die Softwareentwickler zu wenden und sie zu fragen, was da los ist. Wir sind für die Ausfälle nicht verantwortlich“, erklärt der FSO. Gezielter Speerwurf: Ritter schießt Drohne ab Im Verband der Entwickler, Hersteller und Verbraucher von Glonass-Geräten und -Anwendungen weist man die Schuld ebenso von sich und gibt zu verstehen, dass das Problem „vielerlei Ursachen“ haben könne: Programmausfälle, geomagnetische Felder oder weißes Rauschen kämen durchaus infrage.\\n„Anton Wajno (neuer Leiter der Präsidialverwaltung – Anm. d. Red.) probiert im Kreml sein Nooskop aus“, machen sich Facebook-Nutzer lustig. Das Wundergerät Nooskop soll es ermöglichen, „das kollektive Bewusstsein der Menschheit zu erforschen“ und existiert lediglich als Konzept. Im August dieses Jahres berichteten russischen Medien umfangreich von entdeckten „wissenschaftlichen Arbeiten“, die dem Nooskop gewidmet waren und deren Verfasser angeblich Wajno ist. \\n„Aber es kann sein, dass im Kreml tatsächlich Störsender sind. Sie blockieren die ursprüngliche Information, indem sie Falschsignale senden“, sagt ein Vertreter von Glonass. „Aber warum werden dann potenziell gefährliche Drohnen, an denen man auch Sprengsätze anbringen kann, zum Flughafen – einem anderen strategischen Objekt – geschickt? Welchen Sinn ergibt das? Warum nicht auf ein Feld, warum gerade nach Wnukowo?“ Alle Rechte vorbehalten'"}, "time": 1742563315.7746816}