{"duration": 0.07176923751831055, "input_args": {"text": "\"“If conservative ‘Christians’ are about Jesus Christ, why do they always seem to Quote: just about everybody BUT Jesus, most often Paul of Tarsus?” Okay, then. Here are some things Jesus said unlike what you believe:\\n“I tell you, use worldly wealth to gain friends for yourselves, so that when it is gone, you will be welcomed into eternal dwellings,” (Luke 16:9 NIV).\\n“Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword,” (Matthew 10:34 NIV).\\n“From that time on Jesus began to preach, ‘Repent, for the kingdom of heaven has come near,'” (Matthew 4:17 NIV).\\n“You should not be surprised at my saying, ‘You must be born again,'” (John 3:7 NIV).\\nConservatives tend to be more charitable than liberals on average, BTW. It says in 2 Corinthians that God loves a cheerful giver. Socialism would hinder the ability to give freely and out of your heart instead of compulsion.\\nAdditionally, the reason why Jesus “hung out with” sinners is that He wanted to change their evil ways and put their faith in Him:\\n“Jesus answered them, ‘It is not the healthy who need a doctor, but the sick,'” (Luke 5:31 NIV).\\n“‘Haven’t you read,’ he replied, ‘that at the beginning the Creator “made them male and female,” and said, “For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh”? So they are no longer two, but one flesh. Therefore what God has joined together, let no one separate,’” (Matthew 19:4-6 NIV).\\nSo Jesus certainly did not support gay marriage.\\n“Jesus answered, ‘I am the way and the truth and the life. No one comes to the Father except through me,'” (John 14:6 NIV).\\nSo much for the relativism that liberalism is inseparable from.\\nAnd if the Pentateuch is too conservative for you, just remember that when He was tempted, Jesus Quote: d from Deuteronomy every time.\\nLiberalism came from the pagan Enlightenment, not Christianity. You strain a gnat and swallow a camel, as Jesus would say to you.\\nYou dare call yourself a good clergyman, fool? Shame on you for believing the lies of the liberal apostates. You say you are clergy, yet clearly you know nothing about the Scriptures, nor do you know God.\\nIf that is the case with you, then this describes you quite accurately:\\n“For certain individuals whose condemnation was written about long ago have secretly slipped in among you. They are ungodly people, who pervert the grace of our God into a license for immorality and deny Jesus Christ our only Sovereign and Lord,” (Jude 1:4 NIV).\\n“But even if we or an angel from heaven should preach a gospel other than the one we preached to you, let them be under God’s curse!” (Galatians 1:8 NIV).\""}, "time": 1742564302.4768407}