{"duration": 0.06963133811950684, "input_args": {"text": "'License DMCA \\nWhen Tom Hayden died on Oct. 23, we lost a courageous warrior for peace and equality. Hayden was on the front lines of nearly every major progressive struggle for more than 50 years. Vilified by the Right and at times criticized from the Left, Hayden remained steadfast in his commitment to social, economic and racial justice. \\nAn activist, political theorist, organizer, writer, speaker and teacher, Hayden was a Freedom Rider in the South during the 1960s; a founder of Students for a Democratic Society; a leader of the anti-Vietnam War movement; a community organizer; a negotiator of a gang truce in Venice, California; the author of more than 19 books; and an elected official in California for nearly two decades. \\n\"Tom made important contributions as a writer and a political leader, but his greatest strength was as a visionary strategist,\" said Bill Zimmerman, who worked with Hayden in the Indochina Peace Campaign and later managed his 1976 U.S. Senate campaign. \"Tom was able to see far over the political horizon, and was then able to create and lead political movements that were often ahead of their time. Whether it was radical opposition to war or mainstream support for candidates, progressive ballot initiatives and necessary legislation, he was a true leader, clay feet and all.\" \\nThe Indochina Peace Campaign (IPC), founded in 1972 by Hayden and Jane Fonda, who became his wife the following year, was a traveling road show that opposed the war in Vietnam, Cambodia and Laos. Daniel Ellsberg, whose leak of the Pentagon Papers helped to end the war, traveled with Fonda, Holly Near and others for two weeks, speaking around the clock against the war. \\nAccording to Ellsberg, IPC was instrumental in ending the war. While some in the organization took to the road to organize opposition to the war, others lobbied Congress to cut the funding for combat operations. Although the Paris Peace Accord was signed in 1973, many, including Ellsberg, knew the war was not over. - Advertisement - \\nSecretary of State Henry Kissinger was pressuring President Richard Nixon to restart the bombing. Congress cut the funding in 1975 and the U.S. war in Vietnam finally ended. \\n\"IPC was a model of grassroots activism and lobbying,\" Ellsberg said. \\nHayden was steadfast in his opposition to the Vietnam War. He made several trips to North Vietnam, calling attention to the U.S. bombing of civilians. On one trip, at the request of the North Vietnamese government, Hayden returned to the U.S. with American prisoners of war. Since the U.S. government refused to recognize the government in Hanoi, the Vietnamese would only release the prisoners to Americans in the anti-war movement. \\nAdvice from Dr. King \\nA transformative event in Hayden\\'s life occurred in 1960 when he was a college student. He interviewed Rev. Martin Luther King Jr. on a picket line outside the Democratic National Convention in Los Angeles. The picket demanded that the Democratic Party include a strong commitment to civil rights in its platform. King told Hayden, \"Ultimately, you have to take a stand with your life.\" - Advertisement -'"}, "time": 1742564317.1716852}