{"duration": 0.08494758605957031, "input_args": {"text": "'Zoltán Kovács, official spokesman for the office of Hungarian Prime Minister Viktor Orbán, claims the “rigged media” turned his prime minister “into a racist overnight” by deliberately misrepresenting his recent comments on ethnicity. [During his speech, Prime Minister Orbán clarified his recently reported comments on the importance of preserving Hungary’s “ethnic homogeneity” by saying, “Of course, we Hungarians are heterogeneous   …     even if you read the names [in this room] you’d have everything from Bunjevci to Swabian [a reference to ethnic groups in the region]”.  “[T]his is a colourfulness within certain limits, [but] we are all from one civilisation   …     Of course, as we learned from St. Stephen, we welcome everyone. ” By mischaracterising this as a call for a monoracial society along National Socialist lines, says Kovács, the “liberal media” provide “a perfect example of quoting out of context to deliberately twist the meaning and swindle the reader”. He added that “many of the journalists who ran with that distorted version of events never heard or read the speech”. Kovács asserts that “the loud,   press simply don’t have ears to hear the real meaning of a statement and refuse to report the full picture. Instead, these journalists with an agenda quote out of context and crop the photo”  —   a reference to a previous incident of media distortion from 2015. “Set aside the manipulative editing on the part of the journalist and you know that PM Orbán called for the preservation of ethnic homogeneity according to our ‘colourful’ European tradition and history  …     That’s a big difference. Too bad the rigged media is so blinded by their own bias that they can’t see the difference or don’t want to. ” The Oxford Dictionary defines “ethnicity” as “the fact or state of belonging to a social group that has a common national or cultural tradition”  —   an umbrella which could easily encompass a   society, if not a   one. Given the context provided by Kovács, the Hungarian prime minister’s comments may be understood to reflect similar views on “Hyphenated Americanism” expressed by U. S. President Theodore Roosevelt, whose likeness adorns Mount Rushmore today. “There is no room in this country for hyphenated Americanism. When I refer to hyphenated Americans, I do not refer to naturalised Americans. Some of the very best Americans I have ever known were naturalised Americans, Americans born abroad. But a hyphenated American is not an American at all,” he said in 1915. “The one absolutely certain way of bringing this nation to ruin, of preventing all possibility of its continuing to be a nation at all, would be to permit it to become a tangle of squabbling nationalities an intricate knot of           or   each preserving its separate nationality, each at heart feeling more sympathy with Europeans of that nationality, than with the other citizens of the American Republic. ”'"}, "time": 1742564075.7604074}