{"duration": 0.2337350845336914, "input_args": {"text": "'Home » Headlines » World News » Oathkeeper Chapter 8 \\nA peaceful valley in the mountains of Colorado becomes a battleground pitting the federal government against a rural sheriff’s department. Sheriff Bear Ellison finds himself increasingly isolated as he is forced to decide between risking his life protecting a local hero, or reneging on his oath and handing him over to federal prosecutors… \\n\\nChapter 8 \\nCold winds poured down off the mountains and swirled in the valley, heralding the end of Indian summer. Billowing cumulonimbus clouds boiled upwards into the stratosphere, dwarfing the fourteen-thousand-foot peaks to the west. The aspen on the northern slopes had lost the last of their leaves and the cottonwoods and willows that clustered in the arroyos and flood plains had turned yellow. The elk had made their way down off the high meadows, and the mule deer were more common, grazing along the shoulders of the highway, sizing up their prospects of safe crossing. \\nSheriff Ellison drove his patrols with a heavy heart. Nguyet had made her decision. She was leaving for Atlanta, and he would soon be alone. He wished his term was over so that he could jettison his responsibilities and join her and his new granddaughter. The visit with Acevedo had cured him of any lingering political aspirations. Despite the DEA’s wishes, he never did give a press conference on the accidental shooting. \\nWhat would be the point? he thought. Acevedo was right in one sense. The sheriff would have been held responsible for the shooting, regardless of how he framed it for the public. \\nEllison conceded that he would not be able to reign in the feds. He knew that the populace had most likely also realized this by now, and this painted him in a pastel hue of weakness. He noticed that people in general had become less social and cordial towards him since the botched raid. “Good morning, Sheriff. How are things?” was replaced with a cursory “Howdy” or a perfunctory nod, followed by averted eyes. This, along with his wife’s looming departure, filled him with a feeling of isolation. The DEA raids would continue, despite his protest. Nguyet had begged him to resign, but he just couldn’t. Not at such a chaotic time in his career. \\nEllison’s hope was that the county might turn against the DEA occupation. Monte Turcot was a hero, after all, and the shooting of him and his wife was a lightning rod. He hoped that the citizens were beginning to question the value of the DEA’s mission, but without effective leadership and organization, they would be helpless to foment any real resistance. \\nEllison knew Acevedo was disappointed that he did not do the requested damage control on the DEA’s behalf. He learned of this through a phone call with the governor’s office, whom the DEA had contacted to voice their displeasure. They had called him demanding an explanation. \\n“There’s nothing for my department to communicate,” Ellison had explained over the phone. “We were not involved in that operation… We have asked DA Chalmers to launch a grand jury investigation… We expect their decision any day… I’ve ordered Special Agent Acevedo to suspend operations… No, he has not complied… I respectfully disagree with your assessment… I will take the governor’s position under advisement…” \\nThe DEA continued according to their plan. It didn’t matter to them what the sheriff or a constituency of “rancheros and hippy flameouts” thought of their operation. Their mission was ordained by the president. Provincial resistance was futile. Those who stood athwart them would be ignored or swept aside. Acevedo and his agents conducted three more raids after the Turcot shooting, adding to their tally of minor victories in the War on Drugs at a taxpayer cost of over $100,000 per arrest. Thankfully, no one else was shot. \\nOne afternoon, while on patrol, Ellison received a text on his cell phone. He glanced at it quickly, then turned off the road to change direction. An email from DA Chalmers came moments later. \\n“Re: Turcot Shooting,” it read. “GJ has decided not to pursue.” \\nEllison stepped on the gas. He turned west onto County Road 306 and north just after the golf course, taking Gun Club Road for two miles and over Michigan Ditch where it ended at the intersection of a dirt road running east and west. Ellison turned west, his cruiser’s tires throwing up rocks and a plume of dust as he accelerated up the road that led into the hills and evergreen forest. Ten minutes from when he had received the email, he was pulling into Monte Turcot’s driveway. He shut off his cruiser, looked at his watch, took a deep breath, then got out and walked up to the door. As he raised his hand to knock, the recognizable pop of gunfire echoed through the trees. Instinctively, Ellison reached down towards his holster. Another shot rang out, then another, and another, in deliberate succession. The sounds were coming from behind Turcot’s trailer, where it abutted the woods. \\nCautiously, the sheriff made his way around the trailer, ready to draw if necessary. As he stepped out from behind it, the source of the shooting finally came into view. It was Monte Turcot himself, now bearded and thin, firing rounds into a tree trunk with a small pistol. His back was turned to the sheriff, and a half empty bottle of Jim Beam sat clasped in his other hand. \\n“Don’t shoot me, Monte. I’m right behind you,” Ellison called. \\nMonte staggered a few steps back and lowered his gun. \\n“Listen, I came out here to talk to you.” \\nWithout even acknowledging the sheriff’s presence, Monte took a swig from the bottle, his pistol now dangling in his hand like a toy gun at his side. Ellison kept his hand close to his holster and made a quick glance about, looking for cover in the event that Monte had in fact lost his marbles and was mulling over the idea of suicide by cop. \\n“Can we talk?” asked Ellison. \\nMonte stared into the woods, wobbling, his back still turned to the sheriff. After another swig, he lowered his bottle, holding it so loosely that Ellison wondered if it might slip out and crash on the rocks at his feet. \\n“Monte?” \\nMonte didn’t move. \\n“Okay, Monte,” Ellison explained slowly. “I’m going to go back to my car and check my messages and call in. That’ll take me about five minutes or so. Then I’ll be on my way. If you want, you can come over and talk. Or call me later. Does that sound okay with you?” \\nMonte didn’t respond, swaying in the autumn air. A gust of wind blew pine cones off the trees, which landed with a thunk on his trailer’s metal roof. Ellison backed away behind the trailer and walked back to his cruiser. Inside, he radioed a quick status report to dispatch and then checked his messages. Nguyet was wondering when he would be home for dinner. His son had emailed pictures of his granddaughter. A reporter from the Gazette wanted to talk about his reelection campaign. Someone had sent a note about a roadkill carcass on the highway north of town. \\nSomething moved in the corner of his eye. Ellison glanced up and was startled to find the ragged Monte Turcot framed in his windshield. He looked pale, his hair was matted, and his filthy sweatshirt was stained with blood. Ellison looked at his hands. Monte was no longer wielding the pistol, but he still clung to the bottle. From the looks of it, he’d had a few more drinks since the sheriff had arrived. \\nRelieved but still cautious, Ellison rolled down the passenger window. “Get in, Monte.” \\nMonte stared back, his blank expression evoking that of a zombie’s. Ellison clipped his cell phone into its mount on the dash, then reached over and opened the passenger door. Monte slowly shuffled towards it and got in. \\n“How are you holding up, Monte?” Ellison asked. \\n“Still here,” he answered in a raspy tone. \\n“This is a terrible thing you’re going through. I wish there was something I could do to help.” \\n“Thanks,” murmured Monte. \\n“What’s that blood from, on your shirt there?” \\n“Tore my hands up chopping wood.” \\n“Did you cut yourself?” \\n“No.” Monte set his bottle down on the floorboard and presented the palms of his hands to the sheriff. They were covered in blisters, some of which had burst. The tender layer of skin beneath had torn open. \\n“You should take care of that,” Ellison warned him. “It could get infected.” \\n“Yeah…you’re probably right.” \\n“Looks like you did a lot of chopping.” \\n“Four cords,” Monte stated quietly. \\n“How long did that take you?” \\n“I split it all yesterday.” \\n“That ought to be plenty to get you through winter in that trailer of yours.” \\nMonte stared out the passenger window. The mountains appeared through a break in the ponderosa that lined his drive, their peaks sheathed in the purest of white. \\n“It certainly is beautiful out here this time of year,” the sheriff observed. \\n“I think I might just walk myself up into those mountains and never come back down,” Monte answered in a quiet, resigned sigh. “You ever think about doing something like that, Sheriff?” \\n“I think about that a lot, Monte. Maybe not exactly like you describe it, but there are a lot of days – too many days – when I think about dropping everything and going away, going away for a while.” \\n“I ain’t talking about for a while . I’m talking about for good.” \\n“You wouldn’t be planning on bringing that gun along with you, would you?” asked Ellison. \\n“You know, I don’t really plan anything, anymore.” Monte looked down at his ravaged hands. “The future changes day by day. Sometimes I think about going back to active duty again, volunteering for all the action. I thought for sure that was going to be my future yesterday. But then today, I don’t think that’s such a good idea. Today, I think I’ve seen enough killing for one lifetime. I don’t want any part of that no more. Right now, I wish I’d never joined in the first place.” He shrugged. “But then again, who knows? Tomorrow, I’ll probably wish I never came home.” \\n“It’s got to be tough, dealing with everything you’ve been through,” Ellison answered. “It’s too much for one man.” \\n“Yeah.” Monte nodded slowly. “I’m ashamed of the things that I thought about doing yesterday.” \\n“What sort of things?” \\n“I’m worried about you, Monte.” \\n“What do you know about anything, Sheriff?” \\n“You’re right. I don’t know much about what you’re going through. I just worry.” \\n“Don’t.” \\n“Monte,” Ellison said, wary of the direction he was about to take the conversation, “I came out here to check up on you. It doesn’t look like you’re doing well. I don’t think you’re out of line or anything, all things considered. I just think you’re out here all alone, and that it’s not good for you. Is there any way I could talk you into staying with some family for a while? You’ve got a sister, don’t you? Maybe she could come out and stay with you, or you could go visit her.” \\n“She lives in Connecticut. She’s got four kids.” \\n“What about your parents?” \\n“They’re old, worn down, worn out. I’d be a burden on them. I don’t want to deal with them right now, anyway.” \\n“Monte…I wouldn’t feel right about just leaving you out here without knowing you’re going to get some help. Everyone needs help, sometimes. There isn’t any shame in that.” \\nMonte turned from the window and looked at Ellison. “So what happened with the grand jury? That’s really why you came out here, isn’t it? To tell me about that?” \\nEllison felt relieved that Monte had broached the subject first. He hadn’t been able to figure out a way to get there gracefully by himself. \\n“They concluded that, under applicable law, no criminal charges will be filed against the DEA agent that shot you and your wife. I’m sorry.” He watched as Monte’s eyes dimmed in helpless frustration. “For the record, that’s the DA’s language, not mine. I think it’s wrong.” \\n“I can’t say that I’m surprised,” Monte replied. He picked his bottle off the floorboards and opened the door. “I think I’m going to go back inside and lay down for a while.” \\n“Okay, Monte. I’ll stay out here for a few minutes, if you don’t mind.” \\n“Don’t worry, Sheriff. I’ll be all right,” answered Monte. “I just need to get some rest. These hands are hurting real bad, and I’m pretty drunk.” He stumbled out of the cruiser and staggered slowly back into his trailer, letting the door slam shut behind him. \\nSheriff Ellison waited outside with his window down, listening for a gunshot for over an hour.'"}, "time": 1742562167.3373227}