{"duration": 0.18847894668579102, "input_args": {"text": "'We live in a sharing economy of collaborative consumption  —   services, not stuff. Crowdsourcing,    rentals like Airbnb: An interest, exemplified by millennials, in a temporary ownership of goods. Apps, not objects. What, then, to make of objects? In a culture being redefined by the way it consumes, what to make of people who collect things, who keep things? What to make of the personal archives, the private universes, the physical stabs at permanence and immortality that collectors create? “The Keeper,” the New Museum’s summer show, a   exhibit that opens on Wednesday, July 20, is a museum blockbuster of a different kind. With over 4, 000 objects representing more than two dozen collectors, including contemporary artists making art conceived by collecting, Massimiliano Gioni, the museum’s artistic director, and his team of curators have mounted a remarkable series of object lessons about what it means to “keep,” the relationship of possession to loss, the madness inherent in love, and the undeniable importance of the individual’s voice in recording and interpreting history and its sweep. “The Keeper” is its own cultural crowdsourcing, including Korbinian Aigner’s   still lifes of fruit, painted by Mr. Aigner, a German Catholic priest, while interred in the Dachau concentration camp, where he cultivated apples until his escape. Also on view are 3, 000 photographs of people with their teddy bears, assembled by Ydessa Hendeles, a contemporary Canadian artist. Mr. Aigner’s pomological studies were most likely an act of survival, focusing on the reassuring rationality of   during the irrational decimation by the Reich. And, like much of “The Keeper,” Ms. Hendeles’s “Partners (The Teddy Bear Project)” is a kind of unexpected infiltration into ordinary lives, a backstage look at the familiar spectacle of the 20th century as we think we know it. “I don’t want to flatten it by saying it’s a show about collections,” Mr. Gioni said, sitting in the museum recently, concerned that many people associate objects with “luxury objects,” especially in the art world. Mr. Gioni explained that part of his intention for “The Keeper” was to look at ways of collecting and owning things. “It’s not the economic value that makes the value of the object,” he said. “Notions of values are more complicated than keeping score at auction. ” There are no masterpieces in the exhibition, as one would expect of a major museum show. “There’s no hierarchy,” Lisa Phillips, the New Museum’s director, said. “Each has its integrity as a project. ” Yet every piece is a masterwork in its right. The exhibition includes the photographed interiors of “Sociological Record” by Zofia Rydet. In 1978, at 67, she took up photography with the purpose of documenting every household in Poland, as a way to reveal people through the things they lived with. Harry Smith, an American filmmaker and ethnomusicologist, collected string figures, also in the show, made by indigenous peoples around the world. In an interview in 1969, Mr. Smith said, “As far as I know, the string figures are the only universal thing other than singing. ” By design, there are no distinctions between “naïve” and “professional” art, either. Carol Bove’s sculptures and her collaborative installations with the work of Carlo Scarpa, the Italian architect, are well known to the   gallery world. Arthur Bispo do Rosário’s tapestries and garments, constructed from discarded clothing and junk in preparation for Judgment Day, are the products of five decades of residency in a psychiatric hospital in Rio de Janeiro. “Every good artist is some sort of an outsider,” Mr. Gioni said. Every collector is some sort of outsider, too, looking in, trying to understand the experience of being here. Ultimately, even what we choose not to keep defines us. The declutter gurus, yard sales and online exchanges  —   the arcades of unwanted waste  —   are powerful cultural forces, too. Why do we keep? Beyond preservation  —   insuring the safety of a thing  —   keeping can be an act of  . “It is about what brings us together as people,” said Ms. Hendeles, who archived images of people posing with teddy bears. Her intention was to create a portrait of the century, much like the photographer August Sander’s documentary project “Face of Our Time” in 1929. The cuddly teddy bear, sometimes ratty with affection, turned out to be an icon of the first order, appearing like a totemic ghost in thousands of images. In one, a Nazi wearing an arm sling holds a bear on his knee. Another shows children who later died in the Holocaust. The toys were considered totems of protection and sympathy in grief, such as the black bear produced in 1912 to memorialize the Titanic’s victims. Ms. Hendeles’s project is displayed in a   architectural setting meant to resemble an academic library with steel mezzanines and polished wood vitrines. “It questions the authority of the museum, the past, and what we think we know,” she said, an intention shared by Mr. Gioni’s show. Ms. Hendeles is the only child of two survivors of Auschwitz. “I was touching on unconscious needs that I had, because I didn’t have any family photographs,” she said of the genesis of the project. “I’m keeping other people’s memories. ” One might call “Partners” a family album of man. We keep to tell, too. In a small pocket of the exhibition are objects from the National Museum of Beirut, rescued by Maurice Chehab, its director general of antiquities until the outbreak of the Lebanese Civil War in 1975. Mr. Chehab saved artifacts by encasing them in concrete. But as the surviving objects bear witness, preservation can be a sadly poetic concept. They are disfigured and transformed by conflict, melted by hate. Shinro Ohtake’s scrapbooks are more recent records. Mr. Ohtake, an artist and musician, began in 1977 a series of   assemblages that gather the urban residue of his own daily life: clippings from magazines, matchbooks, ticket stubs  —   the cheeky garbage of an active mind. In its devotional richness, each of Mr. Ohtake’s books has the quality of a contemporary Book of Hours. In an email, he explained that he thought of them as communicating “the potential of the streets of the time, as a site where people lived their lives. ” Mr. Ohtake, living in London in 1977, moved frequently and wanted a medium of expression, like a diary, that would be easy to carry and work on. “Traveling is like a collage of everyday time,” he wrote. Speaking as a musician  —   Mr. Ohtake has led two   bands  —   he said that he thought “the most extreme noise is silence. ” Objects, then, would be the loudest things you could live with. A video, “The Last Silent Movie,” by Susan Hiller, provides a lilting, unsettling musical air to the fourth floor of “The Keeper. ” Ms. Hiller, an anthropologist who became an artist, compiled audio samples of endangered and extinct languages, playing them in a video on a black screen with transcribed subtitles. The singsong and staccato of the work gives voice to the recognition that collecting can be a requiem. More optimistically in the same exhibition space is a thoughtful conversation: Ms. Bove’s installation of sculptures with works by Mr. Scarpa, known for his modern redesigns of museums. “When I first saw his work, I felt shocked  —   the strategies that he produced for historical work,” Ms. Bove said recently. “It’s counter to our traditions of museum design, to be neutral. ” Ms. Bove created spatial juxtapositions and interactions that gave the group an intelligent integrity that is a hallmark of a collection greater than the sum of its parts. By its nature, collecting is subjective, even at its most encyclopedic. When collecting strives to become objective, the eccentricity veers into obsession. Oliver Croy, an Austrian artist who discovered 387 homemade building models in a    shop in Vienna in 1993, bought them, lived with them in a    apartment for several years and is no longer collecting, having skirted its edges. “I did therapy, so I gave up on that,” he said in a telephone interview. The models, built in the 1950s and ’60s by an insurance clerk, Peter Fritz, were given to the Wien Museum in Vienna. In another project, a keeper and the subject of his collection have forged a bond, with a rare   on each end. For 62 years, Ye Jinglu sat for an annual studio portrait, the first in 1901. The photographs, shifting imperceptibly in background, costume and the   register of Mr. Ye’s advancing age, are a virtuosic portrait of a man’s life. In the last photograph, the   dandy of the initial one has softly disappeared, and the world has irrevocably changed. The collection was discovered by Tong Bingxue, a photography collector, in 2007. In his mind, Mr. Tong chased Mr. Ye back into the past. “I repeatedly perused the album,” he wrote in an email, “the man patiently telling me his stories by his appearance. ” Mr. Tong contacted anyone who might have known Mr. Ye, including immediate family. “I leafed gingerly through the album again, the leaps from the Qing dynasty, to the Republic of China, and then, to the new China. ” As he contemplated Mr. Ye’s life, he was able to contemplate his own. He called his relationship to this man “uncuttable. ” Mr. Gioni, the curator, writes in his catalog essay that the desperate need to be extraordinary lies “at the root of human nature. ” Most overtly it lies within the heart of collectors. But he concludes with the realization, “harsh and comforting,” that we are, in fact, just like everybody else. One of Mr. Gioni’s keepers might not agree. Wilson Bentley, born to a family of farmers in Vermont in 1865, was fascinated from childhood by the weather. He attached a microscope to a bellows camera and captured on film the intricate pattern of a single snowflake. As is now generally undisputed, each is unique. And so perhaps, as collectors  —   despite all that we “share”  —   are we all.'"}, "time": 1742562236.107244}