{"duration": 0.04750561714172363, "input_args": {"text": "'Abu Omar Almaqdesi, a senior   Islamic State jihadist, said the soldiers and supporters of the Caliphate must not permit the celebration of Christmas in Islamic countries. He went on to describe the festivities as depraved, lewd and based on the “blasphemous idea” that Allah had an equal in Jesus.[ “Isa (Jesus) may he rest in peace, is a prophet like all the others,” Almeqdesi told Breitbart Jerusalem “and in Islam we don’t discriminate between prophets for they are all the messengers of Allah, but the claim that Jesus is a deity represents a heresy that ought to be stamped out in Islamic states. ”   “Those Christians who pay the jizya  —   the poll tax  —   and refrain from practicing these blasphemous celebrations should be given the security they deserve. But if somewhere there are Christians who insist on celebrating Christmas with the support of the heretic authorities, one must unleash upon them all one’s might and deploy all the available means. ” Asked what he means by that, Almeqdesi said that “all methods are admissible when it comes to preventing blasphemy against Allah and his commandments. Yes, including killing and blowing up. But, like I said, we believe that at first you should act politely and explain that living in Islamic countries is conditioned on accepting the Sharia and refrain from openly practicing  rituals other than Islam. ”  Asked whether Christians should be allowed to enjoy alcoholic drinks in the privacy of their homes during the holiday, Almeqdesi replied in the negative, “as the alcohol was bought somewhere, whereas selling it and consuming it is forbidden, so you can’t drink it. Whoever’s caught breaking this law will be whipped and jailed. ”  Almeqdesi said the recent terror attacks in Jordan, Turkey and Germany “are part of the price these states must pay for positioning themselves as part of the Crusader Coalition of the infidel countries fighting against Islam. ”  Almeqdesi added that the Islamic State’s claiming responsibility for the recent terrorist attacks in Jordan and Berlin “was only to be expected seeing as the organization’s leadership pledged to punish all the states that form the coalition against it. While the attacks on Islamic states are ongoing, so will be the (terror) activity of our mujahideen brothers. ”     '"}, "time": 1742628390.7170947}