{"duration": 0.05251955986022949, "input_args": {"text": "'Has Donald J. Trump become a   Christian? That is the suggestion of James C. Dobson, one of America’s leading evangelicals, who said Mr. Trump had recently come “to accept a relationship with Christ” and was now “a baby Christian. ” Dr. Dobson, the founder of Focus on the Family and one of the country’s most prominent social conservatives, gave his account at a meeting Mr. Trump had in New York on Tuesday with hundreds of Christian conservatives. In an interview recorded at the event by a Pennsylvania pastor, the Rev. Michael Anthony, Dr. Dobson said he knew the person who had led Mr. Trump to Christ, though he did not name him. “I don’t know when it was, but it has not been long,” Dr. Dobson said. “I believe he really made a commitment, but he’s a baby Christian. ” Mr. Anthony posted the interview to his blog on Friday. Dr. Dobson could not be reached on Saturday, and Hope Hicks, the Trump campaign spokeswoman, did not respond Saturday to a request for details. Mr. Trump stumbled at times last year when speaking about faith. At one point he said that he had never asked for God’s forgiveness. And after repeating on the campaign trail that the Bible was his favorite book, ahead of his own “Art of the Deal,” Mr. Trump declined to name a favorite verse. “The Bible means a lot to me, but I don’t want to get into specifics,” he told Bloomberg Television. Mr. Trump, a Presbyterian, questioned the faith of Hillary Clinton, a Methodist, at a meeting with a smaller group of evangelical leaders on Tuesday, saying, “We don’t know anything about Hillary in terms of religion. ” During the New York meeting, Mr. Trump made no mention of being born again. It is a possibility certain to cause chortles in some corners, but it could also open doors in others for the   presumptive Republican nominee for president. For evangelicals, “accepting Christ” is at the heart of becoming a genuine Christian, and refers to acknowledging sin and declaring the need for Jesus Christ as savior. “The expectation evangelicals have is of a radical change, a   turn from the life of sin to following Christ,” said Kedron Bardwell, a political science professor at Simpson College in Iowa, who is the son of an evangelical pastor. With new believers, this is often done in prayer with another Christian, which may have been what Dr. Dobson was referring to when he said that he knew the person who had “led him to Christ. ” Mr. Trump won a majority of evangelical voters in the Republican primaries, though some prominent conservative Christian leaders kept their distance. Dr. Dobson endorsed Senator Ted Cruz. Since Mr. Trump clinched the nomination in May, some of those leaders have rallied to him, including Ralph Reed. In his interview, Dr. Dobson conceded that Mr. Trump did not exactly fit the typical mold of an evangelical. “He used the word ‘hell’ four or five times,” he said. “He doesn’t know our language. ” He added that Mr. Trump “refers a lot to religion and not much to faith and belief. ” For evangelicals, the heart of Christianity is a   dependence on God. They often contrast this with what they characterize as merely “religion,” which they view as more rules and  . Dr. Dobson joked that Christians should take it easy on Mr. Trump for what some might perceive as  . “You got to cut him some slack,” Dr. Dobson said. “He didn’t grow up like we did. ” Mr. Anthony referred to the   conversion of Saul, a zealous Pharisee, who later became the Apostle Paul: “He didn’t know the language either. ” Dr. Dobson agreed. “I think there’s hope for him,” Dr. Dobson said. “And I think there’s hope for us. ”'"}, "time": 1742562258.3732069}