{"duration": 0.10642051696777344, "input_args": {"text": "'  \\nI had intended to use this final column before the presidential election to explain at length why I cannot vote for either Hillary Clinton or Donald Trump and plan to vote for Gary Johnson for president. In a nutshell, big government is our biggest problem. It thrives on more debt, more taxes, more regulations, more war, a secretive deep state and less personal freedom. Both Clinton and Trump would grow the government. Only Johnson would shrink it. \\nOne of the most dangerous tendencies of big government is the generation of a police state — wherein laws, rules and procedures are primarily written and can often be bent to aid law enforcement when it is encroaching on our personal freedoms. We saw a terrifying example of that last week when FBI Director James Comey behaved as if he were his most infamous predecessor, J. Edgar Hoover. \\nHere is the back story. \\nLate last week, in an effort to redeem himself from the consequences of having ignored a mountain of evidence of guilt against former Secretary of State Hillary Clinton last summer, Comey told Congress in a cryptic letter that the FBI would resume investigating her emails based upon the belief that more of them may be located in the laptop of disgraced former Rep. Anthony Weiner. Weiner is the alleged sexual predator who remains the estranged husband of Huma Abedin, one of Clinton’s closest aides. Abedin backed up all her emails onto the laptop that she and her husband shared. \\nAt the time he sent his Friday letter, Comey had not yet seen the contents of the Weiner laptop because the search warrant authorizing FBI agents to access its contents was not signed until Sunday. If he saw something incriminating before he wrote his letter, he saw it unlawfully; yet his duty was to bring what he saw to the Department of Justice, for which he works, not to hint about it publicly to Congress. \\nComey’s progress report to Congress is prohibited by the internal regulations of the DOJ and the FBI — and by the canons of legal ethics that regulate lawyers. Comey had no obligation to send the letter at any time; moreover, sending it last week was a direct violation of DOJ and FBI rules that prohibit all public announcements about candidates for public office within 60 days of Election Day. \\nComey told FBI staffers early this week that he sent the letter because he felt duty-bound to members of a congressional committee to whom he had given a promise that he would keep them informed of the status of the email investigation. That was a troublesome promise because its compliance violated other duties imposed upon Comey. Worse than making a promise and not keeping it is making a promise that should not be kept. \\nThe genesis of all this was Comey’s unprecedented news conference on July 5, at which he announced that no charges would be filed against Clinton because no prosecutor would take the case. That was not an announcement for him to make. The FBI’s job is to gather facts and present them to the DOJ, not to make legal evaluations. He made his announcement when he did to head off the behavior of some of his agents who were seeking Clinton’s medical records, unlawfully, from the National Security Agency to ascertain the gravity of her head injury — an injury she posited during her FBI interrogation as the reason for her professed memory loss. \\nI have argued that Comey’s July 5 decision was dead wrong; there is a mountain of evidence with which to indict and convict Clinton on espionage charges. Yet it should have been presented to a grand jury — it was not — rather than at a news conference. The July 5 announcement was bizarre in that it not only exonerated Clinton but also described the quantity and quality of the evidence against her. This insulted the agents who worked on the case and produced the lowest collective FBI morale since Watergate. If Comey sent his Friday letter to address the problems he caused by his July 5 announcement, he did the wrong thing for the wrong reasons. \\nBut perhaps the gravest of Comey’s violations is that of the constitutional guarantee of due process. The essence of due process is notice and fairness. How exquisitely unfair of Comey to say, in effect, “We have something that warrants investigation of you, yet we don’t know its significance, so we can’t say what it is.” This is reminiscent of Franz Kafka’s “The Trial,” in which the lead character is being pursued for a year on unnamed charges, against which he cannot defend himself. \\nIn his play “A Man for All Seasons,” Robert Bolt shows Sir Thomas More arguing with William Roper, a colleague, who suggests that government lawbreaking can be justified for the greater good, particularly if the target is the devil (which Trump has called Clinton). More demolishes that argument in a few now iconic lines: “And when the last law was down, and the Devil turned round on you — where would you hide, Roper, the laws all being flat? This country’s planted thick with laws from coast to coast — man’s laws, not God’s — and if you cut them down, and you’re just the man to do it, d’you really think you could stand upright in the winds that would blow then? Yes, I’d give the Devil benefit of law, for my own safety’s sake.” \\nTo my friends who have rejoiced in James Comey’s letter, please take warning that, as More accurately predicted, the tables can be turned. If there is any moral lesson in all this, it is that the history of human freedom consists of paying careful attention to constitutional guarantees and legal protections, no matter the reputation of the accused. \\nCopyright 2016 Andrew P. Napolitano. Distributed by Creators.com.'"}, "time": 1742564322.2546008}