{"duration": 0.06315159797668457, "input_args": {"text": "'BERLIN (AFP)  —   Germany’s domestic security chief warned Sunday that the country’s radical Islamist scene is not only growing, but becoming more decentralised, posing greater challenges to surveillance operations. [In an interview with national news agency DPA,   Maassen also defended security officials under fire after it emerged that Berlin truck attack suspect Anis Amri had slipped through their net, saying they had done everything they could.  Overall, the number of Salafists  —   or fundamentalist Sunni Muslims  —   in Germany has risen to more than 9, 700, sharply up from 3, 800 people in 2011, said Maassen. “It’s of great concern to us that this scene is not only growing, but it is also very diversified. There is not just one, two, three or four people who have a say,” he warned. “Rather, there are many people who dominate this Salafist scene. And all these people have to be watched. ” While in the past, there were a few people who wielded influence, today, there are many small clusters formed by individuals. “So you can no longer talk about a Salafist scene as a whole, but you have to deal with many hotspots. That makes things more difficult for us, because we can no longer just watch a few people. We have to monitor many groups,” he said. In a defence of security officials under pressure for failing to stop Amri, Maassen said that although officers had watched the Tunisian over a long period of time, they found no evidence to arrest him. “I believe that the security forces, in particular the police, have done everything in their power to assess the danger posed by Amri. But it is also clear that we live under the rule of law, and the legal framework must be respected,” he said. Amri, 24, who was shot dead by Italian police days after ramming a truck into a crowded Christmas market, had been under surveillance since March. But German police dropped their watch in September thinking he was a   drug dealer. Public anger also mounted as the rejected asylum seeker and known radical Islamist should have been deported long ago. In the wake of the attack, Chancellor Angela Merkel admitted that “the Amri case raises questions” and ordered a sweeping review of Germany’s security apparatus.'"}, "time": 1742562834.8384333}