{"duration": 0.044156551361083984, "input_args": {"text": "'. Prescription Painkiller Deaths Dropped 25% in States That Legalized Marijuana In all states that have legalized medical marijuana, there has been a 25% reduction in deaths relate... Print Email http://humansarefree.com/2016/11/prescription-painkiller-deaths-dropped.html In all states that have legalized medical marijuana, there has been a 25% reduction in deaths related to the overdose of legally prescribed painkillers. There is still heated controversy in the United States about whether or not marijuana should be legalized for recreational use, let alone medicinal purposes. After reviewing a study published by the Journal of the American Medical Association in 2014, you’ll likely agree that it’s much safer for cannabis to be doled out than most prescription opioids.For the study , researchers analyzed all deaths caused by opioid overdoses between 1999 and 2010 in the U.S.Then, they determined the association between medical cannabis laws and opioid analgesic-related deaths using linear time-series regression models. The various models helped the researchers determine that in every state that legalized medical marijuana between the aforementioned years (a total of 13 states), there was a 25% reduction in deaths related to the overdose of legally prescribed painkillers.“ The difference is quite striking ,” said Colleen Barry, the study’s co-author and health policy researcher at Johns Hopkins Bloomberg School of Public Health in Baltimore, to Newsweek .It is hypothesized by the researchers that in states where medical marijuana is legal, patients are opting to smoke cannabis to alleviate their pain rather than consume prescription opiates, as the latter tend to cause side effects. In addition, marijuana accounts for 0 deaths per year, whereas overdose of opiates are responsible for over 14,000 deaths annually ( source ).While the statistics speak volumes, not everyone is in agreement with the findings. Dr. Andrew Kolodny, chief medical officer at the national non-profit addiction treatment agency Phoenix House, says that the immediate reduction in overdose deaths is extremely unlikely to be a result of the herb being substituted. This, he says, is because physicians rarely prescribe marijuana for chronic pain. “You don’t have primary care doctors in these states [prescribing] marijuana instead of Vicodin,” he argues. The physician believes that the states that have legalized medical marijuana are more likely to actively treat and help prevent addiction. In his mind, this is a far more likely scenario for the decrease in overdose deaths.While more studies undoubtedly need to be carried out to pinpoint the cause of this phenomenon, this news is heartening at the very least. By Amanda Froelich , Guest writer, HumansAreFree.com  '"}, "time": 1742561696.3884337}