{"duration": 0.04766035079956055, "input_args": {"text": "'Crunched for time but still want to see a show in New York? Here are five productions this month that will take about a “Homeland” episode of your time, with room enough for dinner  —   or a “Walking Dead” binge  —   afterward. Running time 1 hour I don’t know about you, but I’m way too busy to spend more than an hour a day contemplating my own death. That’s where this show fits in nicely. Written by the Pulitzer   playwright Will Eno, “Wakey, Wakey” stars Michael Emerson as a man in a wheelchair who reflects on his life knowing that death is around the corner. There are existential echoes of Beckett and Albee in this contemplative work that’s part TED talk, part show and tell. Our critic praised it as a “glowingly dark, profoundly moving new play. ” [Read the review]  At the Pershing Square Signature Center, through March 26  Running time 1 hour 10 minutes Yeah, yeah, yeah: You want to see “Hamilton. ” But you don’t have A) the time, B) the connections or C) the tickets. This    “Hamilton” parody, from Gerard Alessandrini, the creator of the   “Forbidden Broadway,” is the next best thing. (O. K. maybe more like the next available thing.) If the lyric “In New York, you can be a real ham” sounds like a sidesplitter, this one’s for you. (If not, stay far away.) Our critic called it a “smart, silly and often convulsively funny thesis, performed by a   cast that is fluent in many tongues. ” At Stage 72, the Triad, through May 14 spamilton. com Running time 1 hour Marin Ireland, of Amazon’s “Sneaky Pete,” stars in Martín Zimmerman’s drama about a university professor whose child is killed. Inspired by the Sandy Hook Elementary School shootings of 2012, it’s a solo show on a bare stage, with a story that takes a surprising direction. The play “approaches the subject of American gun violence from a startlingly original perspective,” according to our critic. [Read the review.] [Watch our Facebook Live chat.] At the Black Box Theater, Harold and Miriam Steinberg Center for Theater, through April 2  Running time 45 minutes For parents of small children, this one’s a  . Based on Oliver Jeffers’s book of the same title, “The Way Back Home” is about an adventurous boy who makes an unexpected landing on the moon and has to summon the courage to find his way home. Told with puppets, it’s a great way to introduce children as young as 3 to the visual treats of the theater. And tired parents can do it in less time than it might take to put their kids to bed. At the New Victory Theater, March   Running time 1 hour 20 minutes Ok, so the reviews for David Mamet’s new play weren’t great. “Cynical and morose” is how our critic put it. But if you’ve never seen the dark work of this provocative American playwright (“Glengarry Glen Ross”) now’s your chance. This one’s about a psychiatrist who refuses to testify on behalf of a gay client accused of a horrific crime. If you don’t like it, soothe yourself with a killer cupcake from Billy’s Bakery around the corner from the theater. At the Atlantic Theater through March 26'"}, "time": 1742563660.7364686}