{"duration": 0.020706892013549805, "input_args": {"text": "'in: Human Rights , War Propaganda , World News Minister of war Avigdor Lieberman is part of Israel’s lunatic fringe – ruthless, lawless, racist, militant, extremist and nightmarish for Palestinians. A former nightclub bouncer in Moldova before moving to Israel in 1978, he heads the ultranationalist Israel Beiteinu party. Its agenda includes no concessions, no settlement freeze, no Palestinian self-determination (except maybe on worthless, isolated bantustans), no peace process whether or not he admits it. On Monday, Lieberman said Israel’s next war on Gaza will be its last “because we will completely destroy them,” adding: “As minister of defense (sic), I would like to clarify that we have no intention of starting a new war against our neighbors (sic) in the Gaza Strip or the West Bank, Lebanon or Syria.” “But in Gaza, like the Iranians, they intend to eliminate the state of Israel…If they impose the next war on Israel, it will be their last. I would like to emphasize again: It will be their last confrontation because we will completely destroy them.” Destroy means genocide. Two million Gazans are trapped by illegal siege and blockade, unable to seek safety next time Israel preemptively attacks them – virtually certain to be worse than last time based on Lieberman’s threat alone. How much death and destruction is too much? How much suffering must Palestinians endure to be free from a gangster, Arab-hating Jewish state? How long will Americans tolerate Washington funding its killing machine with their tax dollars – used for mass slaughter and ruthless persecution? How long will Israelis put up with racist, fascist governance threatening their security and well-being? Israel waged three wars of aggression on Gaza since December 2008/January 2009 – Cast Lead, Pillar of Cloud in 2012 and Protective Edge in 2014, each exponentially more destructive than the previous hostilities. Further conflict is certain, likely far more severe than earlier, based on the trend of the last three, exacerbated by lunatics like Lieberman in charge of warmaking, along with leadership under Netanyahu just as bad. Submit your review'"}, "time": 1742628601.6793072}