{"duration": 0.284501314163208, "input_args": {"text": "'VIDEOS Myths, misconceptions, and outright lies about nutrition are keeping people fat and sick We tend to seek out information that confirms what we already believe instead of considering all points of view \\nFatty foods make you fat. \\nCarbs make you fat. \\nIf you eat 1,200 calories a day, you will lose weight. \\nEat whatever you want in moderation. \\nLow fat and no-fat foods will help you lose weight. \\nSugar-free foods will help you lose weight. \\nThe list above provides a few examples of common beliefs about dieting and nutrition. \\nBut the truth is far more complicated. Nutrition just isn’t that simple. \\nLet’s take another look at those statements. \\nFatty foods make you fat. But ..a vocados and almonds are sources of healthful fats. \\nCarbs make you fat. But …f ruits and vegetables are sources of carbohydrates. \\nIf you eat no more than 1,400 calories a day, you will lose weight. But … are the caloric needs of a 300 lb man and a 110 pound woman the same? \\nEat whatever you want, as long as it is in your daily calorie range. So. .. how does one determine how many calories he or she needs? Does this mean eating candy bars all day – as long as I stay in my calorie range – is okay? \\nLow fat and no-fat foods will help you lose weight. But…does this mean I can eat low fat cookies and chips every day and still be healthy? \\nSugar-free foods will help you lose weight. So…I can eat as much of them as I want? \\nCommon beliefs about diet and nutrition are often vague, misleading, and open to interpretation, and can lead to incorrect assumptions, as the examples above show. \\nAnd looking to experts for advice doesn’t necessarily make things any easier. \\nIt would seem that, in this age of marvelous technological advancement and state-of-the-art research facilities, we would have the ability to find definitive solutions to the diet-related problems that plague us. \\nSo, why don’t we? \\nResearch Challenges \\nIn a piece for The New York Times titled Why Nutrition Is So Confusing , science and health journalist Gary Taubes explored this question. \\nSince the 1960s, nutrition science has been dominated by two conflicting observations. One is that we know how to eat healthy and maintain a healthy weight. The other is that the rapidly increasing rates of obesity and diabetes suggest that something about the conventional thinking is simply wrong. In 1960, fewer than 13 percent of Americans were obese, and diabetes had been diagnosed in 1 percent. Today, the percentage of obese Americans has almost tripled; the percentage of Americans with diabetes has increased sevenfold. \\nI’m reminded of a quote that is often attributed to Albert Einstein: \\nThe definition of insanity is doing the same thing over and over again, but expecting different results. \\nTaubes goes on to explain that in 1960, fewer than 1,100 articles on obesity and diabetes were published in medical literature. As of 2014, over 600,000 articles have been published that attempt to provide useful data on these health conditions. \\nYet, here we are, with higher rates of obesity, diabetes, and other diet-related health conditions than ever. \\nIt is possible, Taubes says, that the ever-increasing number of studies and books on dieting, obesity, and diabetes are “the noise generated by a dysfunctional research establishment.” \\nScience – nutrition science in particular – has limitations, he explains: In nutrition, the hypotheses are speculations about what foods or dietary patterns help or hinder our pursuit of a long and healthy life. The ingenious and severe attempts to refute the hypotheses are the experimental tests — the clinical trials and, to be specific, randomized controlled trials. Because the hypotheses are ultimately about what happens to us over decades, meaningful trials are prohibitively expensive and exceedingly difficult. It means convincing thousands of people to change what they eat for years to decades. Eventually enough heart attacks, cancers and deaths have to happen among the subjects so it can be established whether the dietary intervention was beneficial or detrimental. \\nNutrition research also suffers from funding issues. Pharmaceutical companies and the like do not benefit from such studies, so they (understandably) do not want to pay for them. There’s no financial incentive to fund research on the benefits of whole foods. \\nAs a result, Taubes says, …we have a field of sort-of-science in which hypotheses are treated as facts because they’re too hard or expensive to test, and there are so many hypotheses that what journalists like to call “leading authorities” disagree with one another daily. \\nIn the article’s conclusion, Taubes says our current situation is unacceptable, and asks that we challenge ourselves to do what it takes to find answers. Obesity and diabetes are epidemic, and yet the only relevant fact on which relatively unambiguous data exist to support a consensus is that most of us are surely eating too much of something. My vote is sugars and refined grains; we all have our biases. (Author’s note: I am inclined to agree with Taubes regarding sugars and grains…at least for now.) \\nEven when funding for studies IS available, problems are common, as Julia Belluz tells us in her Vox piece titled I asked 8 researchers why the science of nutrition is so messy. Here’s what they said. Take the Women’s Health Initiative, which featured one of the biggest and most expensive nutrition studies ever done. As part of the study, women were randomly assigned to two groups: One was told to eat a regular diet and the other a low-fat diet. They were then supposed to follow the diet for years. The problem? When researchers collected their data, it was clear that no one did what they were told. The two groups basically had followed similar diets. “They spent billions of dollars,” says Walter Willett, a Harvard physician and nutrition researcher, “and they never tested their hypothesis.” \\nAs most people who have tried to stick to any sort of weight loss protocol can testify, humans just aren’t good at sticking with a diet for more than a few days without slipping. This trait makes short-term studies easier to conduct, but those kinds of studies don’t measure long-term results. We can use the results of short-term studies to infer what long-term health effects may occur, but that requires a lot of guessing and assumption-making. \\nIt is also difficult (if not impossible) to control for what scientists call “confounding factors.” Here’s an example : Say you wanted to compare people who eat a lot of red meat with fish eaters over many decades. One hitch here is that these two groups might have other differences as well. (After all, they weren’t randomly assigned.) Maybe fish eaters tend to be higher-income or better-educated or more health-conscious, on average — and that’s what’s leading to the differences in health outcomes. Maybe red meat eaters are more likely to eat lots of fatty foods or smoke. \\nPeople are diverse, and so are food sources and foods themselves – factors which further complicate research. Animal studies have limitations, because, well, animals aren’t humans, and have vast biological and lifestyle differences. \\nEpidemiology, or the study of the patterns and causes of disease, is extremely difficult to do, as Kamal Patel, director at Examine.com , told Lifehacker : Nutritional epidemiology is a really, really tough thing to study. Harder than most other areas of health. Much harder than it sounds. Some people think “Oh nutrition! I know about food and nutrition! That’s much easier than some analyzing some obscure medication that I can’t even pronounce.” Wrong. Medication effects can be complex, but nutritional epidemiology makes that look like child’s play. … It’s easy to see how the public can get mixed messages. Research results are notoriously unpredictable, since only some of the total number of studies get published. Studies have a higher chance of getting published if they show positive results, and food and supplement manufacturers can keep funding trials until one gets published. Nutrients interact with each other, so the effects of any one nutrient are hard to predict, let alone the effect of any one food in the midst of a diet comprised of dozens or hundreds of foods. So while I don’t agree with everything Michael Pollan says, his message is generally on point: “Nutritionism” is bound to fail. If you obsess about your diet and individual nutrients, you not only lose the benefit of the occasional cronut or Thanksgiving dinner, but you lose the forest for the trees. Natural foods are what’s healthy, nutrients and the controversies they cause are what keeps research dollars flowing and flip-flops popping up every couple weeks. It’s important to get nutrients, but it’s wise to get them mostly through food, and only after that supplement what you need in a very targeted manner. \\nPoorly designed research, different researchers studying the same effect but using different measurements and reporting outcomes differently, and researchers’ tendency to selectively report positive or “interesting” results all contribute to the already-murky nutrition science waters. \\nEven well-done studies can produce contradictory results. \\nBig Food Industry’s Influence \\ndishonest clever marketing by the “food” industry all contribute to the confusion. \\nWhen we have soft drink giant Coca-Cola creating its own “research” group and pasta companies paying for studies that “show” their products are linked to lower BMI (woooo boy was THAT study flawed!), well…you can see there are serious issues to contend with. \\n**** \\nMisinterpretation and Miscommunication of Findings \\nIf scientists can’t come to a consensus, how can journalists possibly get it right and report it to us – the end users – accurately? \\nIn the article Cancer, the Media, and the Misinterpretation of Studies: A Cautionary Tale , I explained how typographical errors and misinterpretations of findings can lead to flurries of articles with misleading titles and flawed information being distributed to the masses. This is another way that nutritional myths are born. \\nTruthful claims can sound very similar to misleading or outright false ones, so pay close attention to wording. \\nScience writer and educator Beth Skwarecki provides us with an excellent example: Vitamins are magical substances that will make you more healthy if you are deficient!” Well, yeah. That’s actually true. “Vitamins are magical substances that will make you more healthy!” Sounds similar, but it’s not the same, and it’s not true in most cases. Then you can substitute various other chemicals or superfoods for the word “vitamins” in that sentence. True claims and misleading ones sound very similar. \\n**** \\nAs you can see, it isn’t that we are lacking information. On the contrary; we are drowning in it , much of it conflicting, some of it flawed, and a lot of it biased. \\nSo, what should we believe? \\nAll of the problems we discussed above might have left you feeling hopeless. \\nBut there’s some light at the end of the tunnel. \\nThe following are generally accepted as true. \\nArtificial trans fats are dangerous . Saturated fat is not. You need fat in your diet . \\nEggs (especially the yolks) are very nutritious. Dietary cholesterol has not been proven to raise blood cholesterol or elevated risk of coronary heart disease. \\nButter , once believed to be terrible for health, is filled with vitamins, minerals, and beneficial fatty acids, and has anti-inflammatory properties. Raw, unpasteurized butter and cream contain a unique substance called the Wulzen factor , a hormone-like substance that prevents arthritis and joint stiffness. \\nCoffee , chocolate , and nuts – all also labeled unhealthful in the past – have been shown to have nutritional benefits. \\nSugary beverages (sodas and juices) can damage health and are linked to excess body fat and type 2 diabetes. \\nMost weight loss supplements will reduce your bank account, but not your body fat. \\nThe scale isn’t very useful for measuring health or body composition, and neither is BMI . \\nYou don’t have to count calories to lose weight. It works for some, but some people prefer tracking macronutrients like protein instead. \\nProcessed food package labels can be misleading and should be viewed with skepticism. Avoiding processed “foods” as much as possible is a good idea, speaking of that. Studies show we eat far too much of them, and we are paying for it dearly. \\nA few more things to keep in mind… \\nWhen reading about diet and nutrition, expect to find conflicting information on most topics. Sometimes the issue truly hasn’t been settled, and sometimes interpretation of the available data varies. \\nWatch out for confirmation bias : We tend to seek out information that confirms what we already believe instead of considering all points of view. If you have already formed an opinion about something, intentionally search for information that conflicts with your current belief. It will be uncomfortable, but it is crucial to getting at the truth – which is what you want after all, isn’t it? \\nLook at the sources referenced in articles or books about nutrition. If there aren’t any, be wary. Be VERY wary. \\nFunding by industry doesn’t always mean a study is biased or flawed, but knowing who paid for the research is one factor you can use while weighing the findings (remember the Coca-Cola and pasta “studies” we talked about earlier?). \\nTry searching public journals via PubMed or Google Scholar for studies. \\nParting Words \\nPerhaps keeping it simple is the best answer. Maybe we’ve come full circle, and should go back to the basics. You really can’t go wrong with whole foods, exercise, fresh air, sunshine, clean water, and quality sleep . \\nAnd of course, question everything – including what you read on this website. \\n“Be careful about reading health books. Some fine day you’ll die of a misprint.” ― Markus Herz'"}, "time": 1742563268.311705}