{"duration": 0.27020263671875, "input_args": {"text": "'Americans Seek to Help Persecuted Christians , Government Helps Muslims The people of the United States get it, but the Obama administration could care less. October 31, 2016 \\nOriginally published by the Gatestone Institute. Raymond Ibrahim is a Shillman Fellow at the David Horowitz Freedom Center. \\nAs the Muslim persecution of Christians continues to reach critical proportions around the world (see report below), the average American shows much more concern than the current administration. Soon after it was revealed that the Obama administration has taken in 5,435 Muslim refugees, but only 28 Christians—even though Christians are approximately 10 percent of Syria’s population and are classified as experiencing a genocide there—a poll found that more than three quarters of American respondents agreed with the statement: “It is important to me that the next US President be committed to addressing the persecution that some Christians face around the world (eg., imprisonment, beheadings, rape, loss of home and assets).” \\nThe deliberate targeting and killing of Christians in Europe also reached unprecedented levels in modern times. Most notably, on the morning of July 26, “ Allahu Akbar ” shouting Muslims stormed a small church in France during morning mass. They forced 85-year-old Fr. Jacques Hamel to his knees, slit his throat, and “ critically injured ” a nun, before being killed by police. (It was later revealed that police had known that church was being targeted and had even been monitoring one of the murderers for at least one-and-a-half years.) \\nLater, when a journalist asked Pope Francis if Fr. Jacques was “ killed in the name of Islam ,” the pope disagreed. He argued that he hears of Christians committing violence every day in Italy: “this one who has murdered his girlfriend, another who has murdered the mother-in-law… and these are baptized Catholics! There are violent Catholics! If I speak of Islamic violence, I must speak of Catholic violence.” The logic of the pope’s statement seems to be that violence done in direct contradiction of the Judeo-Christian God’s commandments—such as the murder of wives and mothers-in-law—is identical to violence done in accordance with Allah’s commandments to wage jihad on “infidels.” \\nIn ISIS-controlled territories in Iraq and Syria, reports of Christians being tortured to convert, maimed, crucified, burned alive, beheaded, or sold into sex slavery continued to emerge. In Iraq, a report says that “Christians and other minorities in Iraq are facing persecution at unprecedented levels and are at the verge of extinction …. The Christian population has dwindled from 1.4 million to 300,000 in the last decade, according to some estimates. However, Minority Rights Group put that the number at anywhere between 50,000 to 250,000.” \\nA former ISIS member exposed some of the atrocities the group commits in Syria. “They were extremely brutal, killing women and the elderly who did not obey them. They abused and mutilated their dead bodies. They cut up the corpses, tied them to the back of the cars and dragged them along. They would find them and publicly execute them. I witnessed many executions.” \\nThe remainder of July’s roundup of Muslim persecution of Christians—most of which was not committed by ISIS—includes, but is not limited to, the following: Muslim Slaughter of Christians \\nNigeria : Two armed Muslim tribesmen murdered Rev. Joseph Kurah, an evangelical pastor, while he was working on his farm. They repeatedly hacked him to death with machetes. A local Muslim reportedly hired the assassins after he got into an argument with the Christian leader. Since 2001, Muslim Fulani have murdered thousands of Christians and destroyed hundreds of churches. According to a separate report , in just June and July, Muslim Fulani tribesmen targeted and invaded several Christian majority villages. They killed 133 people, destroyed 76 churches, and countless Christian properties and farms. Muslims hacked a female Christian preacher to death in the outskirts of Abuja. Eunice Elisha, a minister from the Redeemed Church of God, was found dead in a pool of her own blood after she went out to preach in the streets. A month earlier, on June 2, a Muslim mob beat Bridget Agbahime, the wife of a Christian pastor, to death with iron rods on the accusation that she blasphemed against Muhammad. About one million Christian children whose families have been displaced or affected by the violent activities of Boko Haram and Muslim Fulani herdsmen are starving. Churches, which are currently the primary supporters of these children, have gone beyond capacity and tens of thousands of children are expected to die of starvation and disease if they do not receive aid from elsewhere. According to the report, Boko Haram’s seven-year rebellion has left 20,000 people dead and more than two million displaced. \\nPhilippines : Attacks and murders of Christians around Mindanao Island, which has a large Muslim population, are on the rise. Fr. Sebastiano D\\'Ambra, who has lived in the region for 40 years, is calling on authorities to “find proper solutions” to stop “the agony of the Christian community.” He said, “A Christian was killed in Jolo a few days ago. A reliable source told me that 20 Christians have been targeted to be killed or kidnapped soon…. the Christian community is suffering a form of persecution from those who are guided by bad elements who claim to do it in the name of Islam.” \\nKenya : Muslim gunmen from Al Shabaab murdered Pastor John as he was returning home from facilitating a peacemaking training seminar. The jihadis ambushed the bus he was in killing the pastor and six other people including children. \\nDemocratic Republic of Congo : Suspected Muslim militants armed with guns and machetes slaughtered nine Christians in the North Kivu region. They also looted homes, seizing food and cattle as plunder. The area, which is 96 percent Christian, has seen more than 1,100 killed over the last year and a half. \\nPakistan : The 2013 Muslim bombing of the All Saints Church in Peshawar, which killed more than 100 Christian worshippers, claimed its latest victim . After battling internal injuries she had received three years earlier from the attack, Cecilia, a 42-year-old Christian nurse, died from bomb fragments embedded in her body that had turned cancerous. According to the report, “With tearstained eyes,” her husband noted that “We are still losing loved ones [after the attack]. Forced Conversion, Rape and Murder of Christians \\nLibya : A report documents the sufferings that Christians experience at the hands Muslim militants when they migrate through Libya in an effort to reach Europe. In one instance 11 women were abducted and kept as sex slaves underground and repeatedly raped by various jihadis for almost a year. One of the Christian women, Amal, 21, said: “They took [the Christians] to Tripoli and kept us underground – we didn\\'t see the sun for nine months…. Sometimes we didn\\'t eat for three days. Other times they would give us one meal a day, half a piece of bread.” The Christian woman described how they were pressured into converting to Islam under threat of death and beaten with hoses or sticks. “Sometimes they would frighten us with their guns, or threaten to slaughter us with their knives.” \\nIslamic State : ISIS has been making use of social media—including Facebook, and mobile apps like WhatAPP, and Telegram— to sell enslaved Christian and Yazidi girls to a wider network of sadists and pedophiles. One Telegram posting showed a picture of a young girl with the caption: “Virgin. Beautiful. 12 years old,” the posting states. “Her price has reached $12,500 and she will be sold soon.” \\nNigeria: Another report says that the Muslim terrorist group, Boko Haram, has murdered 466 people, almost all of whom were Christian, for refusing to convert to Islam; they also forced 218 women and young girls to “marry” their fighters. \\nPakistan : Muslims kidnapped and forced a 14-year-old Christian girl to convert to Islam last May. Her father pled with them for weeks to release his daughter. They eventually pretended to relent, told him to meet them somewhere so they could return his daughter, and, once he arrived, shot him dead . The girl remains with the rapists, the slain father’s widow and three other daughters are hiding in their home in fear of further reprisals from the kidnappers. According to Najma Bibi, the girl’s mother: “several months after my daughter\\'s kidnapping, the police have not done anything because we have no money to defend our rights. We live in a hopeless situation, we need help. I pray that my daughter will continue to place hope and faith in Jesus Christ.” Muhammad Iqrar, a Muslim man, assaulted and raped Sonia Nasar, a 16-year-old Christian girl. Although the rapist fled when her father rushed to the scene after hearing the cries of his daughter, Sonia was left in “critical condition.” He said that he expects no justice or follow up from local authorities, some of whom are associated with the rapist. Sobia Nadeem, a Christian girl studying for a Master’s degree in physics, was abducted by a group of Muslims, forced to convert to Islam, and forced to marry—at gunpoint—a man named Mohammad Hamza in Lahore. Although the girl managed to escape back to her parents’ home, she was taken to court where her family had to prove that her conversion and marriage were performed under force. Numerous reports continued to appear indicating that non-Muslim students, most often Christians, are being forced to convert to Islam through the public school system. Teachers force them to recite the shahada—which when said before Muslim witnesses makes the reciter a Muslim—and force them to study Muslim beliefs and practices. This often occurs in conjunction with denigration of the Christian faith. Due to ongoing Christian protests, the Punjab government said it would launch an inquiry. Muslim Attacks on Christian Churches and Symbols \\nTurkey : During the July 15 failed coup attempt, at least two churches were attacked . “One of the attacks happened in Trabzon. A group of 10 people attacked Santa Maria Church with paving stones and hammers to smash the windows” said the report. One church leader in Istanbul said, “I\\'m not optimistic about the plight of Christians in Turkey. Bear in mind we\\'ve had a Roman Catholic Bishop murdered, we\\'ve had clergy threatened, we\\'ve had one priest murdered 10 years ago. Any Christian leader, if they\\'re being honest, would say that some of what\\'s going on is quite alarming.” \\nNigeria : On Friday, July 15, Muslims attacked a Catholic church. They were angered that Christians were praying in the church on Friday, Islam’s “holy day,” when Muslims congregate and pray in mosques. According to a Christian church leader, “Sometime around 2pm, some Muslim youths in their hundreds left their mosque after their Friday Jumat prayer and rushed to the church premises, climbed the wall and destroyed everything in the church: the windows, the altar, musical instruments, the chapel. The security man in the church premises was beaten to a pulp. Some women holding a prayer meeting were chased away. The seminarian, who is resident in the premises, was also beaten up and chased away.” \\nIraq : According to a new report , “All 45 churches and monasteries inside Mosul are reportedly now occupied by ISIS, who have looted, burned and destroyed property, in addition to removing the building\\'s crosses.\" Christians unable to flee are forced to pay large extortion money (jizya) or risk instant execution. \\nSudan : A report notes that by continuously bombing Christian and non-Muslim indigenous regions near South Sudan, and targeting churches and pastors’ homes for destruction, the government is trying to “cleanse” the nation of Christians and create a homogenous Muslim state. In recent years, hundreds of thousands of people have been displaced by the violence, their homes, crops, churches, schools and hospitals destroyed. \\nIndonesia : Despite receiving all legal documents and permits, a Catholic family trying to construct a shrine to the Virgin Mary on their own land since 2009 continued to face growing threats from local Muslims. In 2012, a Muslim mob set fire to the shrine site and brought construction to a halt. Most recently in July, Muslims stormed the house of a Catholic leader and ordered him to stop the work, even though he has a building permit issued by the authorities. Muslim Attacks on Christian Apostates, Blasphemers, and Preachers \\nEgypt : According to a report , “Just like the biblical character Daniel in the lions\\' den, an Egyptian Muslim who converted to Christianity found himself at the mercy of ferocious attack dogs that were unleashed by his jailers to torture and possibly kill him. However, law student Majed El Shafie had God on his side and, just like in the story about Daniel, the savage animals miraculously did not harm him—to the utter astonishment of his prison guards.” He was, however, tortured by the Muslim guards themselves. \\nUganda : Another Muslim convert to Christianity has lost his family, home, and business, and now lives in a small shanty. As a result of his apostasy, the extended family of the 53-year-old man, a former Muslim imam, stormed and eventually appropriated his ancestral home in an attempt on his life. Of that night, he said: “I heard people talking outside my house around 8 p.m., saying that they wanted to take away my life and, ‘We cannot watch the whole family turning to Christianity.’” He complained to the local council after his relatives also destroyed his business, but their intervention had no effect and he now lives without any means to provide for himself. \\nPakistan : Nadeem James, a 27-year-old Christian man and father of two, was arrested in Gujarat district after a Muslim angry with him accused James of texting a poem deemed “blasphemous” of Muhammad. According to the accused’s brother: “We were not at home when the police raided our house to arrest Nadeem. However, when the cops couldn’t find any of us in the premises, they took away two women of the family – my wife and the wife of my elder brother, Faryad.” Around the same time, local mosques began calling on megaphones that if he didn’t surrender himself, Christian homes would burn. Nadeem surrendered himself and the women were released. “The charge against my brother is completely baseless. Nadeem is uneducated and could not have possibly sent that text message. I’m certain that Yasir Bashir [Muslim accuser] downloaded the supposedly blasphemous text onto Nadeem’s phone and then forwarded it to his cell number to build a case against my brother.” Yaqoob Masih, 56, a Christian sanitary worker, was accused of committing blasphemy against Islam in Hyderabad. According to the report, “Masih collected waste from the streets and dumped it at a specific [location], however Bakash [Muslim accuser], without verifying, tortured Masih with a stick, accusing him [of] committing blasphemy by burning pages of a book which [reportedly] carried Islamic verses. Masih was packing the garbage and waste in a trunk when Bakash accused him [of] blasphemy.” Masih was hospitalized from his injuries. A Muslim doctor who treated a dying Christian man with medicine that was donated through zakat, Islamic charity, received death threats . The Christian was on the verge of dying without treatment. In his defense, the Muslim doctor said he did not know the man was a Christian, or that it was against some interpretations of Islamic law to use Muslim charity money to help non-Muslims. \\nIran : Three Azerbaijani pastors were arrested in Tehran during a visit. No reason was given to family and local legal experts. According to the report, “This is the latest in a succession of pastors who have been imprisoned by Iranian authorities over many years for accusations ranging from apostasy to evangelism.” And Ebrahim Firouzi, who has been under arrest since 2013 under vague charges \\n“suffered physical abuse at the hands of prison guards when he was forced to attend an appeal hearing.” Dhimmitude: Muslim Contempt and Hostility for Christians \\nBangladesh : Christian and Hindu businesses received notices from a banned Islamic organization ordering them to uphold a number of Islamic customs or be killed. These include hanging banners with Allah’s name, keeping copies of the Koran, putting pictures of the Kaba in Mecca, removing pictures or statues of their own religions, creating a place for Muslims to pray, and banning music and female workers. \\nPakistan : The government in the Raiwind district flooded a Christian graveyard with sewage water and desecrated all the graves. In response, protesting Christians complained that even in the grave they can receive no peace in Pakistan. \\nSudan : Authorities insulted, forcefully arrested and jailed 14 Christians when they attempted to stop them from seizing an evangelical school on church property, which authorities plan on giving to Muslim businesses. Later, authorities returned to the same Christian school, gave letters of dismissal to the Christian headmistress, vandalized her office, and replaced her with a teacher of their own choosing. \\nEgypt : After a Christian man was stabbed to death and many Christian homes and a church burned by angry Muslims because of a rumor that a church was going to be built, Coptic Christian Bishop Makarious of al-Minya was interviewed on television. Church authorities in Egypt are regularly diplomatic and sensitive to what they say, but Makarious made many revealing comments. Although only Christians, no Muslims, were killed and hurt, he wondered why the government and media continue to describe these incidents as “clashes”—which suggests two quarrelling parties—when the reality is always that one side attacks the other: “Within minutes [of the start of one of the attacks], 100 Muslims instantly appeared, fully armed, as if ready for war.” He added: “As long as the attackers are never punished, and the armed forces are portrayed as doing their duty, this will just encourage others to continue the attacks, since, even if they are arrested, they will be quickly released.” When the host asked questions about who is released and why, suggesting that perhaps those released are in fact innocent of any wrongdoing against the Christians, the bishop replied: “Well what do you think when the actual attackers themselves are arrested, with complete proofs and evidences against them, but then they are still declared innocent and released?… this happens every single time.” About this Series \\nThe persecution of Christians in the Islamic world has become endemic. Accordingly, “Muslim Persecution of Christians” was developed to collate some—by no means all—of the instances of persecution that surface each month. It serves two purposes: \\n1) To document that which the mainstream media does not: the habitual, if not chronic, persecution of Christians. \\n2) To show that such persecution is not “random,” but systematic and interrelated—that it is rooted in a worldview inspired by Islamic Sharia. \\nAccordingly, whatever the anecdote of persecution, it typically fits under a specific theme, including hatred for churches and other Christian symbols; apostasy, blasphemy, and proselytism laws that criminalize and sometimes punish with death those who “offend” Islam; sexual abuse of Christian women; forced conversions to Islam; theft and plunder in lieu of jizya (financial tribute expected from non-Muslims); overall expectations for Christians to behave like cowed dhimmis , or third-class, “tolerated” citizens; and simple violence and murder. Sometimes it is a combination thereof. \\nBecause these accounts of persecution span different ethnicities, languages, and locales—from Morocco in the West, to Indonesia in the East—it should be clear that one thing alone binds them: Islam—whether the strict application of Islamic Sharia law, or the supremacist culture born of it. \\nPrevious Reports :'"}, "time": 1742563419.1046593}