{"duration": 0.025653839111328125, "input_args": {"text": "'Home | World | Analyst: Why Turkey Opening Border to Millions Migrants into Europe is a Good Thing Analyst: Why Turkey Opening Border to Millions Migrants into Europe is a Good Thing By Gazi 25/11/2016 11:28:20 \\nANKARA – Turkey – The Turkish president, Recep Tayyip Erdogan on Friday has vowed to throw open Turkey’s borders to illegal migrants after the European Parliament voted to back a freeze in membership talks with Ankara, and have reneged on a visa deal that was promised by the EU a few months ago. \\nWith all these broken promises, Turkey is fully justified in opening the floodgates into Europe once again, where the Schengen zone is an effective unguarded corridor not only for illegal migrants, but drugs, arms and other contraband. \\nThis mass deluge of human traffic into Europe will be good for the United Kingdom’s Brexit stance, as an estimated 5 – 10 million migrants will push their way from Turkey directly into the European heartland, causing further unrest and problems for the EU, which has already been inundated with millions of migrants from South East Asia, Syria, and Africa. \\nThe open border with Greece, all the way up to the Black Sea will once again be open to traffic, and as more millions come, news will spread and even more migrants will make the journey. \\nTurkey’s stance should be applauded in the destruction of the EU, as there will be limited capacity or enthusiasm for even more migrants. \\nThe numbers of migrants could easily increase to 20 million or 50 million migrants within a year or so, depending on the efforts of the Turks and their open door policy, as well as the forced reception within EU countries residing in the Balkans and Eastern Europe. \\nMost migrants will naturally gravitate towards the leading EU nations of Germany and France, however there could be an increased bottleneck scenario occurring around Calais as some try to reach the UK. \\nThe Turks must be fully commended in their push for the destruction of the EU, and the increase in sentiment for Brexit, however it is the Schengen zone created by unelected eurocrats which will be their own undoing..a beautiful and just end to the masochistic EU, who engineered their own destruction through their own socialist utopian dreams. Share on :'"}, "time": 1742561769.2277799}