{"duration": 0.03371930122375488, "input_args": {"text": "'Wednesday during the Senate Foreign Relations Committee’s hearing for   Donald Trump’s Secretary of State nominee, former ExxonMobil CEO Rex Tillerson, Sen. Bob Menendez ( ) criticized Trump’s proposed border wall by saying, “The last time a country tried to wall itself completely from a neighbor was in Berlin in 1961. And that wall was constructed by communist East Germany. ”  Partial transcript as follows: MENENDEZ: Let me turn to Mexico, a little different part of the world than we have been discussing. Some of us care about the Western Hemisphere. Last week the   stated any money spent on the wall will be paid by Mexico. Mr. Tillerson, build a wall on the southern border and having Mexico pay for it has been a hallmark chant at Trump rallies. Now the   says the American people will pay for it and have Mexican reimburse us. I also want to point out the last time a country tried to wall itself completely from a neighbor was in Berlin in 1961. And that wall was constructed by communist East Germany. The former Mexican president last week tweeted that   —   somehow we are conducting foreign policy by tweets these days  —   that ‘Trump may ask whoever he wants but still neither myself nor Mexico are going to pay for his racist monument. Another promise he can’t keep.’ Close quotes. As you’re well aware, the   has repeatedly referred to Mexican citizens who have come to the United States as saying they’re sending, quote, ‘people that have lots of problems and they’re bringing those problems with them. They’re bringing drugs, they’re bringing crime, they’re rapists and some, some I assume are good people.’ So Mr. Tillerson, do you think Mexicans are criminals drug dealers and rapists? TILLERSON: I would never characterize an entire population of people with any single term at all. MENENDEZ:  Do you think that those comments help our relationship with Mexico, our third largest trading partner, a trading partner that represents $583 billion in trades of goods and services, including our second largest goods export market? TILLERSON: Mexico is a   neighbor and friend of this country. MENENDEZ:  And so that doesn’t help your job as secretary of state, does it, if you are to achieve nomination? TILLERSON: Well, we’re going to engage with Mexico because of their importance to us in this  hemisphere and we have many common issues of concern. Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742562735.1830943}