{"duration": 0.09651064872741699, "input_args": {"text": "'shorty Share This: Western claims that the “moderate rebels” fighting the Syrian government are totally separate and antagonistic to ISIS are disproved by the fighting in Aleppo. ALEXANDER MERCOURIS Nothing illustrates the mismatch between Western reporting of the war in Syria and the reality on the ground better than an incident which took place on 1st November 2016 south of Aleppo. The Syrian government’s main supply lines to Aleppo are the roads from the south. This has been especially so since the Jihadi capture of most of the province of Idlib together with its regional capital in the first half of 2015. As the noose tightens on the Jihadis in eastern Aleppo, with their latest counter-offensive repulsed and reports that the eastern districts of the city under Jihadi control are running out of essential fuel and other supplies as the cold weather closes in, the Jihadis attempted on 1st November 2016 to try to turn the tables on the Syrian army by cutting its road links to the south of the city. The Jihadi attempt to do this failed and was quickly repulsed, but in the process it exposed the truth of how the war in Syria is actually being fought. It has become an article of faith in the West that the Jihadi fighters in eastern Aleppo are “moderate rebels” and that Jabhat Al-Nusra (ie. Al-Qaeda) accounts for only a small fraction of them. It is also an article of faith in the West that the Jihadi fighters in eastern Aleppo – including those belonging to Jabhat Al-Nusra – are deadly enemies of ISIS, and have nothing in common with ISIS. It is also continuously claimed in the West that the Syrian army and Russia are only engaging in token fighting against ISIS, and that they are almost exclusively concerned with fighting the “moderate rebels” in Aleppo and elsewhere, who are trying to overthrow the Syrian government. Some Western commentators have gone even further, and have come close to saying that Russia, the Syrian government and ISIS are in de facto alliance with each other, as all three are collectively waging war on the “moderate rebels” who are trying to overthrow the Syrian government rather than fight each other. The Jihadi attempt to cut the Syrian army’s supply lines south of Aleppo which took place on 1st November 2016 shows how completely wrong these claims are. The attack was actually carried out by ISIS. Moreover the attack was clearly coordinated with Jabhat Al-Nusra (ie. with Al-Qaeda) which carried out a similar attack in the same area just days before. As recent events have shown, Jabhat Al-Nusra (ie. Al-Qaeda) is the dominant force in eastern Aleppo , though contrary to Western claims ISIS definitely has a presence there, as confirmed by this 10th October 2016 report by RT’s Murad Gazdiev, which shows Jabhat Al-Nusra and ISIS flags flying together in the city. As our contributor Afra’a Dagher – who is a Syrian writer actually writing for The Duran from Syria – has repeatedly warned, the alphabet soup of differently named Jihadi groups in Syria merely disguises a single continuum of violent Wahhabi Jihadis all committed to the same cause: the overthrow of the Syrian government and the establishment of a sectarian exclusivelyWahhabi Sunni state in its place. Here is how Afra’a Dagher explained the role of ISIS in the Syrian conflict “The “Islamic State” has been designed to attract Takfiri (NB: Wahhabi – AM) fighters from all over the world to join the war against Syria. That way the war to destroy Syria and break the Axis of Resistance is fought with no shortage of fanatical recruits. The war is sponsored and funded by Saudi Arabia, the true factory of Wahhabism, as well as by countries like Qatar and Turkey.” Whilst there undoubtedly are tensions between the senior Al-Qaeda and ISIS political leaderships, these have no practical relevance to the situation on the ground, where fighters from the different groups work continuously to defeat their common enemy, which is the Syrian government and Russia. About the author Alexander Mercouris is a writer on international affairs with a special interest in Russia and law. He has written extensively on the legal aspects of NSA spying and events in Ukraine in terms of human rights, constitutionality and international law. He worked for 12 years in the Royal Courts of Justice in London as a lawyer, specializing in human rights and constitutional law. His family has been prominent in Greek politics for several generations. He is a frequent commentator on television and speaker at conferences. He resides in London. \\n\\n    =SUBSCRIBE  '"}, "time": 1742563641.4156892}