{"duration": 0.24152135848999023, "input_args": {"text": "'This is What Legal Weed Will Look Like in California \\nAmidst election madness, a proposition making marijuana legal just passed in California. Here are 10 things you need to know about what that will look like in the golden state. \\nAlthough Californians will be able to possess and grow marijuana immediately if it passes, people will not have a place to legally buy non-medical marijuana until stores become licensed. The state has until January 1, 2018 to begin issuing retail licenses. State officials believe it will take almost a year to develop the regulations that will be applied to those who grow, transport, test, and sell cannabis. \\n\\nWhile some people are happy about this push to legalize marijuana, others worry about high taxation, and placement of the plant in the hands of wealthy corporations. \\n\\nHere is an outline of what legal pot will look like in California according to what is outlined in the ballot measure. \\n\\nYou will have to be an adult to legally smoke weed. \\n\\nThe Adult Use of Marijuana Act will allow people who are 21 and older to posses, transport, and buy up to 28.5 grams of marijuana for recreational use. \\n\\nThis expands upon an existing law that allows cannabis to be used for medical purposes. \\n\\nThe initiative will allow adults to grow and use up to 6 marijuana plants on their property. Medical marijuana patients will still be allowed to possess the amount needed to meet their medical needs, even in excess pf the 28.5 gram limit. \\n\\nYou can’t smoke weed everywhere. \\n\\nYou will not be allowed to light up a joint in public areas like sidewalks or in bars. The ballot measure does not allow marijuana to be smoked in public unless it is allowed be local ordinances. \\n\\nMarijuana can also not be smoke in areas where state law already prohibits tobacco smoking. \\n\\nFines will be given to those caught smoking weed while driving a motor vehicle, boat, or aircraft. \\n\\nThere will be fines. \\n\\nPeople who are busted smoking in public will be given a fine up to $100. Those caught smoke in a place where tobacco is also prohibited or near a school will be fined up to $250. \\n\\n21 and over. \\n\\nIt will be prohibited to sell marijuana to non-medical users under the age of 21. Yet, medical marijuana can still be used by people who are under 21. Cannabis products cannot be designed to appeal to children or to easily be confused with commercially sold candy. \\n\\nMarijuana products will have to be packaged in child-resistant containers, and pot shops will be prohibited from allowing anyone under the age of 21 on their premises. \\n\\nThere won’t be weed commercials on TV. \\n\\nThe marketing of marijuana products to minors is prohibited which means ads will not be allowed to use symbols, language, music, or cartoon characters aimed at appealing to underage people. \\n\\nIt will not be allowed for marijuana to be advertised on billboards located along an interstate highway or state highway that crosses the border of any other state. Ads will not be allowed within 1,000 feet of day-care centers, schools, playgrounds, or youth centers. \\n\\nSince federal law designated marijuana as an illegal drug, federally regulated television and radio will not advertise it. \\n\\nIf federal law ever changes, Prop 64 includes provisions that require broadcast, cable, radio, print, and digital marketing only to be displayed where at least 71.6% of the audience is expected to be 21 and older. \\n\\nIf you want to sell weed, tell the state. \\n\\nYou will need a state license to open a pot shop and to grow weed for others. \\n\\nPeople who grow, process, transport, or sell marijuana must get a state license and pay a fee to cover the cost of the state processing and enforcing the license. \\n\\nBusinesses will not be allowed to sell marijuana within 600 feet of a school, day care center, or youth center. \\n\\nThose running shops must undergo background checks to obtain a state license, and they can be denied if they have felony convictions involving violence, fraud, drug trafficking, or selling drugs to a minor. \\n\\nSelling pot? You must abide by these rules. \\n\\nThe Bureau of Marijuana Control inside the state Department of Consumer Affairs will be given the job of creating, issuing, renewing, and revoking state licenses for the transportation, storage, distribution, and sale of marijuana. \\n\\nMarijuana growers will have to get a license from the state Department of Food and Agriculture. Those who want to form businesses to manufacture and test marijuana products will be licensed and overseen by the state Department of Public Health. \\n\\nSelling pot without a license will come with penalties and sometimes even jail time. \\n\\nSelling marijuana without a license can result in a misdemeanor charge with penalties of up to six months in jail and $500 in fines. \\n\\nEngaging in any commercial activity in regard to weed without a license will come with civil penalties of up to three times the amount of the license fee for each violation. \\n\\nMarijuana will be taxed. \\n\\nProp 64 will allow the state to impose a 15% tax on the retail sale of marijuana. In addition, the state will be able to levy a cultivation tax on growers of $9.25 per ounce for flowers, and $2.75 per ounce for leaves. \\n\\nThe measure will also allow cities and counties to impose their own taxes to cover costs of services, including enforcement. \\n\\nMedical marijuana patients will be exempt from paying state sales taxes. \\n\\nCalifornia could make a lot of money on pot. \\n\\nState analysts believe that state taxes could generate up to $1 billion annually. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She graduated The Evergreen State College with an undergraduate degree focusing on Sustainable Design and Environmental Science. Follow her adventures on Instagram.'"}, "time": 1742563174.9778998}