{"duration": 0.06348180770874023, "input_args": {"text": "'Waking Times \\n“Does anyone even know why we eat turkey every Thanksgiving? Does anyone even know why we have Thanksgiving? Is it just to eat turkey?” ~ Erin Janus \\nAnother Thanksgiving holiday is upon us, and the tradition of coming together with family to celebrate a vague connection to our heritage as conquerors of North America will be celebrated by millions of people. This year, however, Thanksgiving is all the more ironic given the circumstances unfolding at the Standing Rock Indian Revolution over the Dakota Access Pipeline where Native Americans are being brutalized by militarized police who are protecting a corporate project. \\nSo what is the true story of Thanksgiving? A brief history lesson: \\n“The first actual proclaimed “Day of Thanksgiving” came in 1637 in a meeting between the Pequot Indians and English religious mercenaries. The Pequot were celebrating their annual Green Harvest Festival, which resembles modern-day Thanksgiving. On the eve of the festival, the English demanded that everyone comes out of their homes, puts their weapons on the ground, and surrenders by converting to Christianity. \\nThose who obliged with these terroristic demands were either shot dead or clubbed to death. Those who stayed inside their longhouses – including women and children – were burnt to death. In all, more than 700 Pequot men, women, and children were slaughtered that day. \\nThe “victory” was celebrated by the Governor of Massachusetts Bay Colony holding a feast and trumpeted this as a “Day of Thanksgiving.” During the celebration, they cut off heads of Natives and put them on display publicly; including beheading the Wampanoag Chief and impaling his head on a pole in Plymouth which stayed on display for the next 24 years.” ~ Irwin Ozborne \\nBeyond the historical context of Turkey Day, there is a modern aspect of this story that needs to be outed and understood. \\nModern meat farming has become the most horrifying and inhumane practice on planet earth. While some activists work to expose the shocking abuses that routinely take place in concentrated animal feeding operations (CAFO’s), the meat industry and the National Grocers Association is constantly working to avoid the public relations nightmare that publicity would certainly bring. \\nAg-gag laws criminalize activism with the aim of keeping consumers in the dark, and the largest meat companies have engineered a top-down system of farm control where individual farmers are under severe contracts, having no say whatsoever on how animals are housed and treated. \\nNever the less, the issue of animal cruelty as an embedded part of our food supply is something which needs to be brought into the light of day and exposed, for there truly are much more healthier and humane ways of feeding ourselves. \\nTo this end, and to bring awareness to the ritual insanity of Thanksgiving turkey dinners, filmmaker and activist Erin Janus presents ‘Turkey Day,’ a short film about the week’s festivities. A word of warning, though, for some of the content in this video, while 100% real, is genuinely disturbing. \\n“People will do things just cause everyone else does, and just keep doing it until it becomes tradition.” ~ Erin Janus Read more articles from Vic Bishop . About the Author \\nVic Bishop is a staff writer for WakingTimes.com and OffgridOutpost.com Survival Tips blog. He is an observer of people, animals, nature, and he loves to ponder the connection and relationship between them all. A believer in always striving to becoming self-sufficient and free from the matrix, please track him down on Facebook . Like Waking Times on Facebook . Follow Waking Times on Twitter . \\nThis article ( The Hard to Swallow Truth About Turkey Day   Vic Bishop   Please contact WakingTimes@gmail.com for more info. \\n '"}, "time": 1742628402.2266662}