{"duration": 0.10184240341186523, "input_args": {"text": "'Radio host Rush Limbaugh discussed the riots at UC Berkeley that shut down Breitbart Senior editor MILO’s scheduled event on his show again today, ridiculing former Labor Secretary Robert B. Reich for suggesting that the rioters were   plants. [“The labor secretary, former labor secretary, Robert B. Reichhhh,” said Rush, “claims that the protesters in Berkeley were actually hired by Breitbart. That it was a Breitbart false flag. (laughing) They weren’t really leftists that were doing this. Go to the audio sound bites. Last night on CNN Tonight, Don Lemon speaking with the former Secretary of Labor for Clinton, said, “The violence we saw at Berkeley, it plays right into the hands of the   white supremacists, you know, the people at Breitbart. What do you think about that, Mr. Secretary?”  Rush then played the clip of Reich claiming that the protesters were planted by MILO and Breitbart. “Ha! Ha! Ha! Haaaaaaa! Do you hear how enthusiastic he is? (laughing) Do you know any   capable of this kind of behavior? (laughing) I mean, go to Ferguson, go to Baltimore, go to San Bernardino, go to Watts. Take any protest, any violence. Go to Oakland any time you want. Any time there is violent protests, it’s always left wingers bought and paid for by the Hillary campaign, the Democrat Party, or George Soros, and never once have the Democrats ever condemned them, ’cause they’re proud of them. ” “They’re proud of these anarchists. They’re proud of the people who blow up bank buildings. They’re proud of the people that start fires. They never blame them. They never try to pass it off as fake protesters hired by Republicans. (chuckles) Until now. Why now? Why would it be  …    ? Why don’t they embrace these people? Why isn’t former labor secretary Reichhhh and the rest of the left embracing these people and giving them a bunch of attaboys? Why aren’t they encouraging ’em?” “You know this is the kind of instability and chaos that they want because they know it’s gonna be blamed on Trump. They know that all of this  …     The   and everybody in education’s gonna point fingers at Trump. Peggy Noonan’s done it. I’ve got it  …     (That’s one of the things that’s been superseded by other stuff in the news.) Oh, and they’ve discovered a new unemployment rate! (chuckling) Wait ’til you hear this. They’ve discovered the   unemployment rate at CNBC. Ah, this is just  …     It’s too juicy. And here’s now the former Clinton labor secretary!” “They don’t want anybody to think that these protesters in Berkeley that blew that place up were Democrats. They don’t want ’em to think it’s leftist students. Why do they not want to embrace them, encourage them, and claim credit? What is there to gain by blaming this on Breitbart? Don Lemon, now thoroughly intrigued, said, “You think this is a strategy by Milo Yiannopoulos or right wingers? Did they put this on in an effort to show that there’s no free speech on a college campus like Berkeley? The right wingers did this? ”” “These people are losing their minds. “I was there! I was there! They were all dressed in black! I’ve not seen this before. ” It’s called  …     There’s a name for these people. They’re Black Rock or something, and they are   leftists associated with George Soros. They come in in all black and they hide their faces. Many of them are not students. That’s the point. They are bought and paid for! (laughing) But here is Reich (paraphrased) “I was there! I saw them! These were right wingers, sure as I’m sitting here with you, Don!” (cracking up)” “I thought he was checking student IDs or whatever. But no, they weren’t students. That’s the point. Here’s something else about this if I can try to regain my composure. (laughing) I don’t know. I just hear this little guy get so juiced, folks. He gets so excited talking about this conspiracy. (impression) “I really wouldn’t bet against it, Don! I  …    ” (laughing) I heard that the president of the university  —   I’m still tracking this down  —   actually had campus cops and Berkeley cops stand down while this happened, that there was, in certain quarters, a desire for this to happen. ” Listen to the full clip here.'"}, "time": 1742561838.6340396}