{"duration": 0.015791893005371094, "input_args": {"text": "'Former PM Dr. Manmohan Singh starts watching The Newshour, says its silence is very soothing Posted on \\nTimes Then Now’s prime time show, The Newshour may have lost all its staunch viewers after the departure of its former anchor Arnab Goswami, but has found a new fan in former Prime Minister Dr. Manmohan Singh. ( Image via intoday.in ) \\nIn an audio message a written letter of appreciation to the Times Group, Dr. Singh wrote that he has never enjoyed a television debate this much. “May you be seized of the matter that I thoroughly enjoy the absolutely soothing, calming silence of the new Newshour. Until last week, when I wanted to sleep at night, I used to re-watch my own speeches earlier on the economy etc but for the past few days, every night at 9 pm, I turn the channel on and thanks to the pin-drop silence and sheer pointlessness of it all, I manage to doze off in not more than 10 minutes. Theek hai !!! ,” the two-time former PM’s letter read. \\nDr. Singh also found company in his praise, from the Art of Living founder Sri Sri Ravi Shankar. “I have taught people pranayama and various kriyas for many years now, but I have to admit that the new Newshour is working like magic. Even the most angry, irascible people in our course cool down and sleep like smiling babies on watching the program. Not even Yogendra Yadav’s honey-like, mellifluous voice has had such an impact in recent times. More power..err..actually, lesser & lesser power, to the new Newshour!” Sri Sri told The UnReal Times . \\nBJP spokesperson Siddharth Nath Singh, who still appears on the debate, admitted to feeling very unsettled and uncomfortable. “All these days, I was on the edge of my seat, ever ready to out -shout -squeal the Congress guys. But yesterday, I almost snoozed, yet, people actually waited for me to answer. It was extremely awkward,” Singh stated. \\nTimes Now, however, chose the former PM’s praise as the topic of their next debate, with the hashtag #SilenceOfTheLambs. “Look boss, Arnab might not be here any longer – that can explain the silence, but that doesn’t mean our hashtags aren’t kickass anymore. We’re still killing it in that department,” a Times Now hashtagger exclaimed, before tweeting Dr. Singh’s praise with the “TIMES NOW IMPACT” prefix. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742628494.7766366}