{"duration": 0.0500946044921875, "input_args": {"text": "'License DMCA \\nThe New York Times headline article sums up Comey\\'s dilemma aptly enough. \\n\"Mr. Comey could immediately inform Congress about the emails, which were found in an investigation into former Representative Anthony D. Weiner. That unusual step, months after Mr. Comey had cleared Mrs. Clinton of any criminal wrongdoing in the email case, would risk accusations that he was unfairly harming her presidential campaign less than two weeks before the election. \\n\"Or he could delay any announcement and examine the new emails more closely, risking criticism that he had suppressed important new information if it came out after the election, despite his pledges of \"transparency\" in the investigation.\" \\nAnd with that, the choice should have been obvious -- Comey shouldn\\'t have made any announcement. There shouldn\\'t have been a decision to make. - Advertisement - \\nThat there was even a choice in Comey\\'s mind comes back to the same thing that\\'s caused the FBI Director to err at every single stage of this investigation. It\\'s not that \"Jim Comey is an apolitical straight shooter,\" as every talking head is eager to tell you. It\\'s that Jim Comey is very concerned that he be seen as an apolitical straight shooter. Because of that, he has, repeatedly, put preservation of his own reputation ahead of both justice and the good of the nation. \\nFrom his ludicrous, finger-wagging press gaggle in announcing Clinton\\'s innocence, to his ham-fisted intrusion into the final act of the election, Comey has felt compelled to insert Jim Comey, straight-shooter, into every moment. \\nAs a result he\\'s caused serious harm to the FBI, to the election, and to the nation. And, just incidentally, he\\'s ruined his reputation in the process. \\nAcross the nation, prosecuting attorneys are not exactly the most modest or retiring of public servants. It\\'s a position of unique power, and often engages the most vaunting egos. And yet, Comey has managed to shock those people whose responsibilities are most like his own. \\n\"\\'It is not the function of the FBI director to be making public pronouncements about an investigation, never mind about an investigation based on evidence that he acknowledges may not be significant,\\' [former assistant U.S. attorney] Akerman added. \\'The job of the FBI is simply to investigate and to provide the results of its investigation to the prosecutorial arm of the U.S. Department of Justice. His job is not to give a running commentary about any investigation or his opinion about any investigation. This is particularly egregious since Secretary Clinton has no way to respond to what amounts to nebulous and speculative innuendo.\\'\" - Advertisement - \\nIt\\'s not enough for Comey to do his job. He wants to be seen doing his job. He worries about the eyes of history, the verdict of time. Which is exactly where, and why, Comey failed. \\nDoing the right thing means doing what you believe is proper even if the verdict of history comes against you. It means being willing to be seen as biased, or not transparent, or simply wrong. Doing the right thing risks finding that what you did was actually wrong. You must act on what you know, and do the best regardless. \\nBut Comey was more concerned that he be seen as doing the right thing. And that\\'s ... a completely different thing. \\nIn essence, James Comey set his ego above the good of the country. That\\'s not illegal, but it\\'s certainly not right.'"}, "time": 1742628332.3203106}