{"duration": 0.034937381744384766, "input_args": {"text": "'WASHINGTON  —   A day after the release of a damning intelligence report on Russia’s   efforts to influence the American election,   Donald J. Trump called on Saturday for a closer relationship between the two nations, saying only “stupid” people or “fools” would think this was unwise. The United States, Mr. Trump wrote in a series of Twitter messages Saturday morning, has “enough problems around the world without yet another one. ” He pledged that Russia would “respect us far more than they do now” after he is sworn in as president, and said that the two nations could perhaps work together on the international stage. For years, Russia has been anything but a willing partner of the United States. Relations became strained well before the   cyberattacks began nearly a year and a half ago, despite the Obama administration’s early effort to reset relations. After Russia’s intrusion into Ukraine and its annexation of Crimea in 2014, the United States and its allies levied broad sanctions against the Russian economy and blacklisted dozens of its citizens, including some close to the Russian president, Vladimir V. Putin. President Obama added to those measures last month in retaliation for the hacking, expelling 35 suspected Russian intelligence operatives from the United States and imposing sanctions on two Russian intelligence services. Russia and the United States have also often been at odds over Moscow’s involvement in the war in Syria. Senior intelligence officials briefed Mr. Trump on their findings on Russian election interference on Friday, before releasing a declassified report that concluded that Mr. Putin had “ordered” a sprawling campaign intended to denigrate Hillary Clinton and aid Mr. Trump. Mr. Trump has consistently dismissed the intelligence agencies’ conclusions as politically motivated, but he appeared to soften that stance in a statement his transition team released after the briefing. He also seemingly conceded Russian involvement in the election, but he has taken pains to point out that there is no evidence that any vote tallies were altered, apparently seeking to avoid the suggestion that his victory was illegitimate. Mr. Trump has said repeatedly that it is time to “move on” from the focus on Russian meddling in the election, arguing that it has received such attention only because Democrats are embarrassed about their loss  —   an assertion he repeated on Twitter on Saturday. Late on Friday, he blamed the Democratic National Committee for the hacking of its computer systems, saying that “gross negligence” had allowed it to happen. Many Democrats said on Twitter that Mr. Trump was essentially engaging in  .'"}, "time": 1742628370.2925174}