{"duration": 0.1350259780883789, "input_args": {"text": "'Arthur Hiller, an Academy   director whose long career began in live television and flourished in the movies in the 1970s with   like the phenomenally successful “Love Story,” died on Wednesday in Los Angeles. He was 92. The Academy of Motion Picture Arts and Sciences announced his death. Mr. Hiller, who for a time was one of Hollywood’s most commercially potent directors, piloted nearly 70 feature films, television movies and series episodes in a wide range of genres, from the Holocaust drama “The Man in the Glass Booth” (1975) to the screwball comedy “The  ” (1979). He made two hit films from Neil Simon scripts  —   “   ” (1970) and “Plaza Suite” (1971)  —   and two with the popular comic team of Richard Pryor and Gene Wilder: “Silver Streak” (1976) and “See No Evil, Hear No Evil” (1989). But Mr. Hiller’s greatest commercial success was “Love Story” (1970) which grossed an imposing $106 million when it was released in 1970, the equivalent of about $665 million today. Based on a screenplay by Erich Segal, a Yale classics scholar (who turned it into a   novel that sold more than five million copies) the film portrayed the tragic romance of a wealthy Harvard law student (Ryan O’Neal) and a Radcliffe music major (Ali MacGraw) the product of a     family. In a time of bruising social upheaval, “Love Story” offered a strong, simple palliative, turning audiences   (though some found it sappy) and catapulting the careers of Mr. O’Neal and Ms. MacGraw. Writing about the movie after the novel was published, the critic Roger Ebert was as admiring of one as he was withering about the other. “The film of ‘Love Story’ is infinitely better than the book,” he wrote. “I think it has something to do with the quiet taste of Arthur Hiller, its director, who has put in all the things that Segal thought he was being clever to leave out. Things like color, character, personality, detail and background. ” Mr. Hiller’s emphatic, uncomplicated direction brought home the themes of class and generational reconciliation embedded in Mr. Segal’s story, while Francis Lai’s score took care of the sentiment. The Canadian critic Robert Fulford, writing in The National Post, saw the movie as a product of its time: “Its plot is a checklist of 1970 obsessions: furious generational conflict, a rich and guilty old man symbolizing the Establishment, and death claiming the young and the beautiful. It’s a Vietnam film in which Vietnam remains offscreen. ” Characteristically, Mr. Hiller brought in the production ahead of schedule and under budget, earning his sole Oscar nomination in the process. (Franklin J. Schaffner won the Oscar for “Patton,” that year’s   winner.) “Love Story” earned six other Academy Award nominations, including for best actor (Mr. O’Neal) and best actress (Ms. MacGraw). Mr. Lai’s score won an Oscar. Mr. Hiller’s personal favorite among his films, he often said, was “The Americanization of Emily,” a 1964 feature set in wartime London about the tentative love affair between a young war widow (Julie Andrews) and an American naval officer (James Garner) as   approaches. Written by Paddy Chayefsky, the film strikes an unusual, precarious balance between social comedy and psychological drama, and drew on Mr. Hiller’s wartime experience as a navigator for the Royal Canadian Air Force, based in Britain. Mr. Hiller teamed with Mr. Chayefsky again in 1971 for “The Hospital,” a   satire starring George C. Scott and Diana Rigg, set in a dysfunctional New York medical center. “It isn’t simply that he obtains excellent performances from his stars,” the critic Vincent Canby wrote of Mr. Hiller in The New York Times, “but he has perfectly cast the film down to roles that are so small, they depend  —   I suspect  —   as much on natural mannerism as on acting talent. ” Gentle and   and famous in later years for his nimbus of long, silver hair, Mr. Hiller was much liked in the film industry. He was president of the Directors Guild of America from 1989 to 1993 and president of the Academy of Motion Picture Arts and Sciences from 1993 to 1997. In 2002, he received the Academy’s Jean Hersholt Humanitarian Award for his philanthropic work. Mr. Hiller was born on Nov. 13, 1923, in Edmonton, Alberta, one of three children of Harry Hiller and the former Rose Garfin, Jewish immigrants from Poland. His father ran a secondhand musical instrument store in Edmonton. His first contact with show business came through his parents, who formed a community theater in Edmonton to present plays in Yiddish. He helped his parents build and paint sets, and made his acting debut at age 11. After high school, Arthur joined the Royal Canadian Air Force and navigated bombers over enemy territory in Europe during World War II. Returning from the war, he enrolled at the University of Toronto, where he studied law and psychology. The lure of the performing life proved irresistible, however, and one day Mr. Hiller walked into the Toronto offices of the Canadian Broadcasting Corporation and asked a receptionist where to apply for work. “Three weeks later I was directing talk shows,” he was quoted by Robert J. Emery in the 2002 book “The Directors: Take Two. ” Mr. Hiller began in radio but soon graduated to the new medium of television, where he specialized in the risky,   work of directing live drama. In 1956 he accepted a job and moved to the United States, where he joined an impressive group of young directors  —   including John Frankenheimer, Arthur Penn and Sidney Lumet  —   working on the CBS series “Playhouse 90. ” As live television evolved into filmed programming in the late 1950s, Mr. Hiller became a regular contributor to such series as “Gunsmoke,” “Alfred Hitchcock Presents” and “Route 66. ” His first theatrical film was the 1957 teenage romance “The Careless Years,” based on a script written under a pseudonym by John Howard Lawson and Mitch Lindemann, who were both blacklisted at the time. The tight shooting schedules and tighter budgets of television had taught Mr. Hiller the importance of careful preparation, and his reputation as a fast,   filmmaker spread quickly. By the   he was well established in Hollywood as a director of light comedies like “Promise Her Anything” (1965) with Warren Beatty and Leslie Caron, and “Penelope” (1966) with Natalie Wood. He went on to direct Alan Arkin in the sentimental comedy “Popi” (1969) and again in “The ” an extravagant farce written by Andrew Bergman. Mr. Arkin played a New York dentist and Peter Falk a loony government agent who enlists him in a plot to assassinate a South American dictator. Then came the Neil Simon films and the Richard Pryor comedies. In between were weightier projects, like the musical “Man of La Mancha” (1972) a troubled production on which he replaced Peter Glenville as director “The Man in the Glass Booth” (1975) for the American Film Theater subscription series, in which Maximilian Schell played a rich Jewish industrialist living in Manhattan who is arrested as a war criminal and “Making Love” (1982) one of the first Hollywood films to present a love affair between two men (Michael Ontkean and Harry Hamlin) in a positive light. Mr. Hiller is survived by his daughter, Erica Hiller Carpenter his son, Henryk and five grandchildren. His wife, Gwen Hiller, a social worker and librarian, died in June, also at 92. She was born in Edmonton 10 days before her husband. Their family has noted that when they were schoolmates, he proposed to her when they were 8 years old. Their marriage lasted 68 years.'"}, "time": 1742562408.246117}