{"duration": 0.054291725158691406, "input_args": {"text": "'The number of adult baptisms in the Austrian Catholic church has more than doubled over the last year. The church claims the rise is due to a huge influx of migrants from Afghanistan and Iran converting to Christianity. [The Archdiocese of Vienna has announced that 254 men and women were selected for baptism after completing the rite of Christian Initiation for Adults (RCIA) taking part in a baptism ceremony conducted by Austrian Cardinal Christoph Schönborn Die Presse reports.  The group of converts had to wait a year to be prepared for baptism  —   a recent move by the church due to the number of requests by Muslim asylum seekers for conversion. The baptism ceremony was not opened to the public due to the fears of many of the converts that they could face retaliation from other Muslims or even attacks against their family, particularly those who come from Iran. Cardinal Schönborn declared the day a celebration for the church, saying it was a  “a great and moving day for the Church of Vienna. ” “That they want to follow Christ and live in his fellowship is also a call to us  —   which we have the happiness and privilege of growing up in faith from childhood, but may have forgotten how precious this is,” he added. Schönborn, who many see as a likely successor to Pope Francis, has made headlines several times in recent months. In September he said that many Muslims actively sought to conquer Europe for Islam. Three months later he slammed European politicians and their migrant policies, saying the migrant crisis had gone too far and that it was better to help migrants where they lived. He added that he was shocked by the sheer number of migrants who have come to Europe in recent years. The conservative Cardinal has also been at odds with many European leaders in regards to U. S. President Donald Trump. In early January he compared Trump to former president Ronald Reagan saying, “Many also shook their heads when Ronald Reagan was elected: ‘For God’s sake, an actor from California!’ But Reagan was certainly one of the best presidents the U. S. ever had. So you should not be too quick to judge. ” The trend of conversions is also seen in neighbouring Germany, but some are sceptical of the motives of those converting. Two Syrian migrants living in Lebanon even admitted that they had converted because it gave them a better chance of claiming asylum in Europe.  Follow Chris Tomlinson on Twitter at @TomlinsonCJ or email at ctomlinson@breitbart. com'"}, "time": 1742564208.253493}