{"duration": 0.08867573738098145, "input_args": {"text": "'Many things are blurred about the life and death of Elva Zona Heaster Shue, who lived in Greenbrier County, West Virginia, in the late 1800s. But one thing is known by everyone in the state, she is The Greenbrier Ghost.\\n\\n\\nThe story is that Zona met and soon married Erasmus (Edward) Stribbling Trout Shue in 1896 against her family’s wishes. Edward was a drifter, unknown in the area, and not well received by the community. However, Zone fell in love with him instantly, though her mother was not convinced. Despite her disapproval, the couple married within just a few weeks after meeting.\\n\\n\\nEdward and Zona lived what appeared to be a very happy life, for about eleven months. Everything changed in their house on January 23, 1897, when Edward had sent a hired errand boy to his home to check on his wife. That is where the boy made a ghastly discovery.\\n\\n\\nAs he entered the home, the young boy immediately spotted Zona lying motionless, sprawled out and unresponsive, at the bottom of the stairs. Shocked and frightened, he rushed home to his mother, who called George W. Knapp, the local doctor, and coroner. But before the doctor could get to Zona, Edward came home and did something very odd with his wife’s body.\\n\\n\\nDoctor Knapp went as quickly as he could to the couple’s home, only to find that Edward had redressed her, moved her body back upstairs, laid her out on the bed, and was cradling her head in his hands as he sobbed. He noticed that Edward, who continued to cradle Zona’s head the entire time, would get agitated each time the doctor got too close to her body. Finally, Dr. Knapp pronounced her dead from ‘everlasting faint.’\\n\\n\\nZona’s mother also reported that Edward acted erratically at the funeral, and her suspicions took root — she believed Zona had been murdered. She began telling friends and family about a recurring nightmare she was having about her daughter and her death. In her dreams, Edward had twisted Zona’s head 360 degrees, snapping it off. Her daughter appeared in a flash of blinding light, explaining that her husband had been a cruel man and that her death was not natural, but murder.\\n\\n\\nAfter reporting the story to officials on many occasions, to no avail, her mother would not give up on her insistence of murder. The ghost continued to visit Zona’s mother, telling the same story. Finally, authorities exhumed Zona’s body to examine her.\\n\\n\\nEdward protested the exhumation of his wife’s body, but the police continued and she was reexamined. This time, it was discovered that she was, in fact, murdered. Her head was snapped and finger-like marks on her skin, indicating strangulation. Which explains why Edward was cupping her head when she was first examined.\\n\\n\\nEdward was arrested and charged with her death. While in prison, it was discovered that Zona was actually his third wife; his first divorced him for cruelty, and the second had died mysteriously. Authorities found a drawing Edward had made that depicted an ominous scene: a married couple with coffins in the background of their home.\\n\\n\\nZona’s death was officially declared a murder. Upon learning the news, a mob of angry locals grouped together to try and lynch Edward by hanging him. He was rescued by the sheriff and taken to safety, where he stood trial for the death of his young wife.\\n\\n\\nAs the Greenbrier Ghost, Zona’s tale is no longer one of many unsolved historic crimes; visitors to the area can visit her grave, and her story is not forgotten. There’s no telling whether her ghost is truly what helped solve her murder, but her mother’s vision certainly did. Zona’s ghost was never seen again, but a marker in the cemetery describes how her ghost helped solve her own murder.\\n\\niLyke \\nSOURCE '"}, "time": 1742561808.065749}