{"duration": 0.05886530876159668, "input_args": {"text": "'Sudanese President Omar   indicated through his state media on Friday that he would not attend this weekend’s Islamic Summit in Saudi Arabia, at which U. S. President Donald Trump will be a guest of honor. Trump is scheduled to deliver a major address on American relations with the Muslim world at the summit. [The Associated Press quotes Sudanese reports that Minister of State Taha   will be sent to the summit in Riyadh instead.  “President Omar   has apologized to King Salman of Saudi Arabia for being unable to attend the Riyadh summit,” said a statement from Bashir’s office. Undefined “personal reasons” were given as the reason for his absence. The New York Times notes that Saudi Arabia’s invitation to Bashir “outraged human rights advocates, who called it a breach of longstanding United States policy. ”  The policy in question calls for ostracizing accused war criminals with outstanding arrest warrants, of which Bashir boasts two, dating back to 2009 and 2010. The International Criminal Court describes him as a “suspect still at large. ” The list of charges is impressive: Five counts of crimes against humanity murder, extermination, forcible transfer, torture, and rape two counts of war crimes intentionally directing attacks against a civilian population as such or against individual civilians not taking part in hostilities, and pillaging three counts of genocide: by killing, by causing serious bodily or mental harm, and by deliberately inflicting on each target group conditions of life calculated to bring about the group’s physical destruction, allegedly committed at least between 2003 and 2008 in Darfur, Sudan. According to the United Nations, up to 300, 000 people have been killed in the Darfur genocide, and another 2. 3 million displaced into refugee camps. The U. S. State Department said it was opposed to “invitations, facilitation or support for travel by any person subject to outstanding International Criminal Court (ICC) arrest warrants, including President Bashir. ” Bashir usually encounters little difficulty when he wishes to travel, despite the war crimes charges against him. The International Criminal Court has filed complaints against several nations, including South Africa and Uganda, for refusing to arrest him when he traveled to their jurisdictions. This week, Bashir’s government confidently stated he would attend the Saudi summit and “participate actively,” with a particular emphasis on lifting U. S. sanctions against Sudan. “On his agenda for the summit will be the removal of sanctions finally which were imposed by the US on Sudan. Also on the top of the agenda is to how to combat and how to fight terrorism. What we know is that President Bashir and President Trump will be in the same conference hall, but we don’t know whether he will meet President Trump,” Rabie Abdul Atti, a senior member of the ruling Sudanese party said on Wednesday. CNN notes that prior to President Trump’s inauguration, the Obama administration played up Sudanese opposition to the Islamic State, and was working to ease some sanctions against Sudan as a reward for humanitarian progress in Darfur.'"}, "time": 1742562169.518638}