{"duration": 0.05893898010253906, "input_args": {"text": "\"Reality check media Breaking Trust, Breaking the Bank - The Inside Story of Russia's Biggest Bank Robbery \\nBenedict Worsley is implicated in the disappearance of $3 billion from the Trust Bank of Moscow Originally appeared at Dances with Bears \\nInvestigators searching for $3 billion in funds missing from Trust Bank of Moscow, the biggest Russian bank fraud in history, have found Benedict Worsley, the Cyprus-based manager of the bank’s offshore operations, at a heavily fortified house in the south of France, where he is guarded by British gunmen formerly employed by the British secret services. \\nThe High Court in London has revealed that in return for cash and a promise of immunity from prosecution, Worsley has agreed to cooperate in the search for the missing money. He is now reported to be employed by Otkritie Bank, which is being financed by the Central Bank of Russia, to operate the old Trust Bank. However, sources close to the Central Bank say that officials at the bank are anxious to see Otkritie start repaying the bailout loans, and reluctant to soften the terms or extend the repayment dates as Otkritie is reported to be requesting. Suspicion is also rife in Moscow banking circles, according to one source, that “ well-known names in high places were beneficiaries of the Trust Bank loans. They don’t want to be identified or obliged to repay. ” They, according to a Cyprus source and another in London, who knows Worsley, are “threats to Worsley, and he knows it.” \\nWorsley refuses to respond to emails, and he has closed the Cyprus office of Teos Management, where until late last year, he used to manage Trust Bank’s loans through dozens of companies he created and directed, on instruction from the bank, its control shareholder Ilya Yurov, and others. Yurov has testified in the London court that he ordered forensic accountants to trace what had happened to the bank’s loan funds. The Russian state Deposit Insurance Agency (DIA) amd Otkritie Bank have also been searching. To substantiate their application to the High Court for a freeze on Yurov’s assets in the UK and Switzerland, they have reportedly identified asset value and bank accounts worth $830 million. For more details of the Yurov scheme, read this . For the High Court records, click to open . \\nOne source for Worsley’s operations has not been made public before. This is the archive known as the Panama Papers , compiled by the International Consortium of Investigative Journalists (ICIJ) in Washington. According to the ICIJ, it obtained its “ data through three massive leaks. The largest one comes from Panamanian law firm Mossack Fonseca, whose inner workings were exposed in the Panama Papers investigation published in April 2016 in conjunction with Süddetsche Zeitung and more than 100 other media partners .” \\nIt is far from easy to find Benedict Worsley in the Panama Papers data base assembled by the ICIJ. For example, here is what turns up when the search box cue is Benedict Worsley . Most of the listed entities were either deactivated before Yurov took over Trust Bank, or are unconnected to both Russia and Cyprus, where Worsley and Yurov have operated. One entity, Benedict Investment Corporation, was created by GSL Law in Cyprus in 2002, and is still active. GSL is a Russian law firm, based in Moscow, which provides offshore services. It doesn’t appear to have been involved with Worsley and Trust Bank. \\nHowever, Benedict Worsley can be found in the Panama Papers, not by searching for his name, but by searching for companies he created, managed, and directs still. In order to open Worsley’s file in the Panama Papers, it is necessary to know the names of several of his companies first. Some of these names have not been detected in the Cyprus searches before. \\nHere is the asset map for Worsley in the Panama Papers archive:\""}, "time": 1742561912.0987167}