{"duration": 0.12718510627746582, "input_args": {"text": "'BRUSSELS (AFP)  —   The EU warned Poland on Thursday it may take legal action to stop logging in a UNESCO World Heritage forest, risking a new clash with Warsaw’s   government. [Brussels gave Poland one month rather than the usual two to address its concerns about the ancient Bialowieza forest or face being summoned by the EU’s top court.  “One month was considered the right time considering the urgency of the situation,” European Commission spokesman Enrico Brivio told reporters. He said Poland’s reply to requests to stop   logging in the forest was “not satisfactory” amid concerns it could cause irreparable biodiversity loss. The Bialowieza forest includes some of Europe’s last primeval woodland and has been granted protected status by the UN heritage organisation. The threat comes with Brussels and Warsaw already at loggerheads over changes to Poland’s constitutional court which the EU has warned could merit sanctions as a “systemic threat” to the rule of law. Since the populist PiS administration came to power in Warsaw in October 2015, it has come into conflict with Brussels on several fronts. The EU launched both the logging inquiry  —   based on a complaint by environmentalists  —   and the rule of law investigation last year. If the logging case goes before the European Court of Justice, Poland could face fines. But if found at fault on the rule of law Poland could face the far more serious prospect of seeing its EU voting rights suspended. The Bialowieza forest straddles Poland’s eastern border with Belarus and is home to unique plant and animal life, including a herd of some 800 European bison, the continent’s largest mammal. The vast woodland includes one of the largest surviving parts of the primeval forest that covered the European plain ten thousand years ago. The Polish government began logging in May last year, saying it was clearing dead trees to prevent damage caused by the spruce bark beetle, and insisting the policy was entirely legal.'"}, "time": 1742564389.6201718}