{"duration": 0.11522269248962402, "input_args": {"text": "'Donald J. Trump, tempering the tone of his   approach to immigration for a general election audience, avoided repeating his previous call for mass deportations on Monday and instead said he wants to come up with a “really fair” plan to address the millions of undocumented immigrants now in the country. The softer comments from Mr. Trump, who postponed plans to give a major immigration speech this week in Colorado, follow months of vows to build a wall along the Southern United States border with Mexico and deport immigrants who have entered the country illegally. Those proposals were a centerpiece of the platform that helped propel Mr. Trump to winning the Republican presidential nomination, and a shift would be significant. Asked on Fox News if he was   on his immigration ideas, Mr. Trump insisted that he still intends to be “strong” while emphasizing the importance of fairness when it comes to immigrants who came to the United States illegally. “We want to come up with a really fair, but firm, answer,” Mr. Trump said. “It has to be firm. But we want to come up with something fair. ” Although he held back on offering specifics, Mr. Trump’s different tone could be an attempt to court moderate Republican voters disturbed by the candidate’s tough stances on immigration. His remarks come as recent polls have shown him falling behind Hillary Clinton in several swing states and struggling to appeal to minorities. The campaign has sent conflicting signals about whether Mr. Trump would actually change his proposals regarding immigration. He was expected to give a major immigration speech in Arizona, but it was moved to Colorado and planned for this Thursday. On Monday, the campaign canceled the speech without explanation and declined to discuss his latest thinking on immigration. Speaking on Monday evening at a rally in Akron, Ohio, Mr. Trump did not mention any changes in his immigration policy, but promised another of his key proposals, to build a wall on the border with Mexico. “That wall will go up so fast your head will spin,” he said as the crowd cheered. “And they’ll say: ‘You know what? He meant it.’ And you know what else I mean? Mexico is going to pay for it. ” In an evening interview with Fox News’s Bill O’Reilly, Mr. Trump insisted he was not backing down on deportations, but would be focusing on criminals. “We’re going to obey the existing laws,” he said. “The first thing we’re going to do, if and when I win, is we’re going to get rid of all of the bad ones. We’ve got gang members, we have killers, we have a lot of bad people that have to get out of this country. ” But there have been signs that Mr. Trump is preparing to publicly evolve on his immigration plans. Mr. Trump’s new campaign manager, Kellyanne Conway, signaled on Sunday that he has been reconsidering his approach to deportations. Pressed in an interview on CNN as to whether a deportation force was still on the table as a law enforcement measure, Ms. Conway said it was “to be determined. ” Senator Jeff Sessions of Alabama, a staunch ally of Mr. Trump’s who advises him on immigration policy, also acknowledged the new uncertainty, saying on CBS that Mr. Trump was “wrestling” with what to do about deportations. Speculation that Mr. Trump was wavering also grew over the weekend after he met on Saturday with his newly formed Hispanic advisory council. Univision and BuzzFeed reported that he expressed interest in finding a “humane” way to deal with undocumented immigrants that sounded at odds with his previous plan to forcibly remove them from the country. The Trump campaign denied that he was wavering. Any reversal on immigration by Mr. Trump would represent a political feat, considering he has said repeatedly that “we don’t have a country” if border laws are not enforced. During the primary campaign, Mr. Trump assailed all of his Republican rivals for being too weak on immigration. He kicked off his campaign saying that Mexico was sending criminals and rapists into the country, vowed that Mexico would pay for his planned border wall and called for the “mandatory return of all criminal aliens. ” In interviews about his immigration plans, Mr. Trump offered himself little leeway. Questioned a year ago about breaking up families, Mr. Trump said that “they have to go. ” Last November, he was explicit in his desire to deport and pointed to President Dwight D. Eisenhower’s “Operation Wetback” as an example of successfully removing people en masse. “You’re going to have a deportation force, and you’re going to do it humanely,” Mr. Trump told MSNBC at the time. “Look, we have to do what we have to do, and Ike did it and other people have done it. ” Immigration experts and independent analysts have warned that mass deportations would be costly and chaotic, but until recently, Mr. Trump has remained steadfast. A move to tone things down at this stage of the race could anger Mr. Trump’s base of supporters. Representative Steve King, Republican of Iowa and one of the most conservative voices on immigration in the Republican caucus, said that he was not concerned that Mr. Trump is changing his position, given the ambiguity of his comments and the close counsel he keeps from the likes of Mr. Sessions. But he conceded that he would be troubled if Mr. Trump did change his sentiment on mass deportations, or if he were to advocate a “touchback” system in which people would return to their home country and then apply for visas to return to the United States under an expedited process. “That would concern me,” Mr. King said, saying that it would essentially convert the immigration system into a large enterprise by which people were being   for entry. Whit Ayres, a Republican pollster, said that Mr. Trump’s softer language is less about a turnaround that could draw in Hispanic voters than it is an effort to woo swing voters who are turned off by the candidate’s language and proposals. “No rational person would believe that he’s actually going to do significantly better among nonwhite voters after the last 15 months,” Mr. Ayres said. “There may be a calculation that reaching out verbally makes him more acceptable to moderate Republicans and some women, perhaps. But actions speak a lot louder than words, and he has 15 months of action to overcome. ” Since reshuffling his campaign leadership last week, Mr. Trump has demonstrated a new affinity for flexibility. He has already expressed “regret” for remarks that he has made during the campaign that might have been hurtful, and he expanded his outreach to black voters. However, leading Hispanic groups said that it was too late for Mr. Trump to win their trust on immigration reform. “The fact of the matter is he can’t unring the bell,” said Javier Palomarez, the president of the United States Hispanic Chamber of Commerce. “These are the acts of a desperate candidate who knows he is going to lose. ” The Clinton campaign, meanwhile, has no plans of letting Mr. Trump’s immigration contortions go unnoticed. Senator Tim Kaine of Virginia, the Democratic   nominee, seized on Mr. Trump’s latest remarks at a union convention on Monday in Las Vegas. He said that they were more evidence that Mr. Trump could not be trusted on the issue. “We can’t afford to be tricked by Trump,” Mr. Kaine said. “He’s saying that he’ll try to deport people in a humane way  —   whatever that means. It’s just wrong. ”'"}, "time": 1742564130.108076}