{"duration": 0.05454063415527344, "input_args": {"text": "\"1 comment \\nJames Comey went from being the darling of the left, to their arch nemesis in an instant. When the four devices, including a laptop, were seized in the Anthony Weiner sexting case, over 10,000 of Huma Abedin’s State Department emails were discovered. First off, Comey had a duty to disclose those emails. Second, as far as redemptive opportunities go, this one is golden. Comey gets a chance to do the right thing and remove some of that tarnish from his name and from the FBI. \\nNow, Congress is considering holding an emergency hearing this next Friday… just four days before the general election. It’s unprecedented and you can bet the Democrats will try to stall. Comey will star at the hearing and the fact that the Department of Justice is either stalling or just refusing to issue a warrant for those emails is telling. That won’t hold up forever… eventually, a federal judge will step in if the DOJ insists on flaunting more corruption. But timing is everything here. Almost assuredly those laptops that the FBI supposedly destroyed, but didn’t, will come up as well. \\nFrom Western Journalism : \\nBoth parties in Congress jockeyed for position Saturday in the wake of the dramatic bombshell delivered by the FBI on Friday regarding new evidence that has led the FBI to breathe new life into its investigation of Democratic presidential nominee Hillary Clintonâ\\x80\\x99s use of a private email server while she was secretary of state. \\nRepublicans sought to move the issue to the front burner in the week before Election Day, while Democrats castigated the FBI for announcing its probe. \\nOne report claimed House Oversight Committee Chairman Jason Chaffetz, R-Utah, was considering holding a hearing Friday to grill Comey about the most current evidence and investigation. \\nCongress is currently on its usual pre-election recess. \\nThe possibility of a pre-election hearing or briefing was also raised by Sen. Ron Johnson , R-Wis., chairman of the Senate Homeland Security and Government Affairs Committee. \\nIf the hearing happens (and I pray it does), there will be fireworks all the way into election day and beyond. There’s a really good chance now that Trump may win because of all this. If Clinton wins, this scandal will follow her into the White House as will impeachment proceedings and an indictment. We could wind up with her resigning almost immediately and Tim Kaine becoming president. Shudder. \\nI doubt that House Oversight Committee Chairman Jason Chaffetz is going to let this slide. He’ll be a bull dog on it and he’ll get his hearing this next Friday probably. Both Clinton and Abedin are going to go down over this. I don’t think Congress has ever faced an emergency quite like this one in our lifetime. Related Items Terresa Monroe-Hamilton \\nTerresa Monroe-Hamilton owns and blogs at NoisyRoom.net . She is a Constitutional Conservative and NoisyRoom focuses on political and national issues of interest to the American public. Terresa is the editor at Trevor Loudon's site, New Zeal - trevorloudon.com . She also does research at KeyWiki.org . You can . NoisyRoom can be found on Facebook and on Twitter .\""}, "time": 1742628400.3852062}