{"duration": 0.05547070503234863, "input_args": {"text": "'November 25, 2016 - Fort Russ News -  RusVesna - translated by J. Arnoldski -  \\n\\n\\n\\nThree servicemen of the Turkish army were killed yesterday as a result of a Syrian airstrike in the Aleppo province,  the Turkish newspaper Hürriyet has reported citing the Turkish General Staff. The bombardment also injured 10 of Ankara’s soldiers. \\nOn Thursday, November 24th, an airstrike by Syrian military aviation with Turkish troops as its target was recorded for the first time since the beginning of Turkey’s illegal Euphrates Shield operation on the territory of the Syrian Arab Republic.  \\nSince August 24th, Erdogan’s forces have been engaged in operation Euphrates Shield in the Aleppo province without agreement from the government of Syria. The declared goal of the military operation is the clearing out of ISIS terrorists from the northern regions of Syria adjacent to Turkey. Many experts have called the real objective of the operation to be fighting against armed Kurdish groups. \\nA military source has reported to Russian Spring that the strike hit Turkish occupation units in the vicinity of Al-Bab, where they, together with members of the bandit formation known as the Free Syrian Army, are attacking Kurds and ISIS.  \\n“Before the strike, the troops received several warnings that Syrian Air Force planes would bomb rebel positions north of Al-Bab. They were supposed to leave this territory of Syria,” the source said. \\n\\nYesterday was the anniversary of the death of Russian air force pilot Oleg Peshkov and marine Alexander Pozynich, who were killed by Turkish military operations and pro-Turkish militants in Syrian Latakia.   \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742562728.6886034}