{"duration": 0.057504892349243164, "input_args": {"text": "'Hillary Thugs IDENTIFIED, Homeless Woman Protecting Trump Star Gets Justice Posted on November 1, 2016 by Rebecca Diserio in News Share This \\nIn a sad story that went viral, thugs beat up a homeless black woman who was defending Donald Trump’s star on Hollywood Boulevard. Now, those thugs have been identified. Shockingly, these Hillary Clinton thugs are nothing but bullies who beat up anyone supporting Trump, even the elderly and disabled, but the good news is, the homeless black woman is getting much-deserved justice. A black homeless woman was beaten up by Hillary thugs for protecting Donald Trump’s “star”& supporting him in this election. \\nAfter an idiot took a jackhammer to Donald Trump’s Hollywood “Star of Fame,” one brave black homeless woman decided to protect it from further damage. That brought out the Hillary bullies, but there was one problem. None of them could be identified because   kept the best video evidence from getting out. \\nNow, Paul Joseph Watson of Infowars has obtained a clear copy of what happened, and we now have enough evidence to identify the attackers. In the video, Watson does an excellent job of identifying two of the Hillary bullies. One he calls “ Trigglypuff ,” an obese woman who may identify as a man, is wanted for felony assault by Los Angeles police, and another man, who ironically is wearing a cross necklace, taunted the homeless woman, saying, “Didn’t I tell you about five minutes ago that no I would not defend you because you spewed hate and you got hate, you got exactly what you were dishing out.” “Trigglypuff” (the name given to social justice warriors who get triggered) is caught on video, wanted by police for felony assault. The thug who yelled, “Didn’t I tell you,” is caught on video and also wanted by Los Angeles police for aiding and abetting a felony assault. \\nThe California homeless woman sat on the star with a sign that read, “20 Million Illegals and Americans Sleep in the Streets In Tents, Vote For Trump.” That was the “hate” she was spewing, and here is the backward logic the Hillary bullies are selling, as Watson sarcastically points out , “Didn’t I tell you if you disagree if you dare disagree with our retarded political opinions you get physically attacked by a sack of sh*t [Trigglypuff] and by the way it’s your fault for spewing hate.” \\nAnother thug can be heard saying not to call an ambulance as they continue to laugh at the victim, but there is a silver lining. This latest video gives the police all they need to formally identify “Trigglypuff,” who is wanted for felony assault and those other thugs who aided and abetted the felony crime of beating this homeless woman. \\nThis incident has gotten so much attention, and the police are very motivated to do everything they can to track down these Hillary bullies. It’s just a matter of time, and they will be positively identified. In the meantime, Trump dispatched one of his representatives to Los Angeles to find the homeless woman to give her “something.” I’m sure Trump was moved by this woman’s plight, and what he is offering will help her in the dire situation she finds herself in. \\nThis story was not on any mainstream media networks, but imagine if the homeless woman was a Hillary supporter and Trump supporters beat her up. We all know it would be reported on 24/7 on CNN and MSNBC with panels of experts discussing Trump and his supporters who commit acts of violence. \\nAs Watson concludes in his video, the only thugs acting out after this election will be the paid Hillary bullies who time after time have shown up at Trump events and used violence against peaceful citizens. Luckily, their sick reign of shame and violence is coming to an end as Hillary is falling apart and Trump will be elected our next president.'"}, "time": 1742562204.7074027}