{"duration": 0.09964799880981445, "input_args": {"text": "'“Lifeline” is a   thriller directed by an Academy Award winner about a man’s search for his missing girlfriend. In the film, set in Shanghai with a plot driven by corporate malfeasance, punches are thrown, shots are fired and people are killed. At one point, the actress Olivia Munn stands over a dead woman, blood on her hands. But this is no ordinary movie. It is an online advertisement for the mobile technology company Qualcomm and, in particular, its Snapdragon 820 chip set, a smartphone processor. As more people skip or block ads when streaming shows or browsing websites, advertisers are trying to find new ways to deliver their messages. The internet has long been a place where companies have tried to break out of the   and   ad model, but as it has become easier to present   videos online  —   and as top directors and actors have shown a willingness to be involved  —   these efforts have become more sophisticated. The goal of “Lifeline” and similar ads is “to make something you want to see  —   and the holy grail is if people seek you out,” said Teddy Lynn, chief creative officer for content and social at Ogilvy  Mather, which produced the film. “This is a piece of entertainment that can compete in a very crowded marketplace. ” “Lifeline” was released in May and pushed out on multiple social media channels in the United States and China. “Inside Lifeline,” a      look at the film, is also available on the “Lifeline” website. It emphasizes the importance of the cellphone to the action in the film and the phone’s various features the film hopes to highlight, like its long battery life and improved photo capability. In many ways, “Lifeline” is just an extension of product placement and show sponsorship by advertisers that goes back to the early days of radio and television, said Lou Aversano, chief executive of Ogilvy  Mather NY. “I think we continue to push, not just in terms of length, but in terms of the line between entertainment and brand message,” he said. Many companies are looking for ways to promote their brand through longer storytelling, such as Johnnie Walker, Nike and Prada. It is an impulse that dates to at least 2001 or 2002, when a series of eight   films for BMW starring Clive Owen appeared online. “That was at the time the internet was still ” said Steve Golin, founder and chief executive of Anonymous Content, a multimedia development company that produced the BMW ads and “Lifeline. ” “It would take all night to download. ” “Lifeline,” which stars Ms. Munn, Leehom Wang and Joan Chen, is directed by Armando Bo, who won an Oscar for best original screenplay for “Birdman” in 2015. The film has attracted 20 million views. There have been an additional 100 million combined views of the film’s trailers and the    video, Mr. Lynn said. Eighty percent of the views came from China, which was the primary market. The dialogue is 70 percent in Chinese and 30 percent in English. Mr. Lynn said Qualcomm would not disclose the cost of the ad, but noted that with less money needed to buy time on television, more was available for the production. “You can create content that is compelling and you don’t have to spend money to place it on TV,” said Mr. Golin, whose company has been involved with movies like “Spotlight” and “The Revenant” and TV shows like “Mr. Robot. ” “We think this is the direction advertising is headed. As long as sports exists, we will still do   and   commercials, but with most other entertainment there is a lot of resistance to watching    advertising. ” Mark Crispin Miller, a professor of media studies at New York University, said the disappearing boundaries between advertising and entertainment could be troubling. Ads, by their nature, often exaggerate “the benefits or virtues of the products and, even more troubling, downplay the dangers or risk of a product,” Mr. Miller said. And using big stars “makes the commercial intent even harder to perceive and blurs the true purpose behind the work. ” Still, more advertisers are eager to experiment. Take “The Ballad of the Dreadnought,” a   documentary about the distinctive guitar body originally manufactured by C. F. Martin  Company. It is narrated by Jeff Daniels and includes interviews with musicians like Rosanne Cash, Stephen Stills and Steve Miller. The film appears solely on Martin’s website, but was selected to appear at several film festivals. It has received 40, 000 views since it first streamed on May 5, said Scott Byers, a managing partner at Lehigh Mining  Navigation, the advertising agency that developed the film. The documentary idea developed, Mr. Byers said, when Martin came to his agency wanting to celebrate the dreadnought guitar, which was developed in the early 20th century but never trademarked, enabling many other manufacturers to copy it over the years. “They asked, ‘What can we do to reclaim ownership of the shape? ’” said Denis Aumiller, also a managing partner at the agency. “The initial thought was that we would produce a short,   product video, or maybe a magazine article. ” As enticing as it may be to think of every commercial as a potential short film that could play on the festival circuit, creating something that attracts viewers and promotes a product is not easy. Entertainment, after all, is not the ultimate goal. “At some point,” Mr. Aversano said, “there’s a responsibility to deliver the message of the brand. Otherwise it’s just empty calories. ”'"}, "time": 1742564013.4007742}