{"duration": 0.15752720832824707, "input_args": {"text": "'Embodying The Monad, A Session Transcript \\nES Forum Reference Link (Jan. 2011): \\nThis gives us the bigger picture and an understanding of why embodying the monad right now is so important. The suggested invocation will follow. \\nThere are two agendas happening simultaneously for 2012 and beyond. \\nOn one level there is a battle happening over the control of the souls here. The beings that are entrenched in the first three chakras are being subjected to more aggressive and more amounts of technology geared to break down the mental body. \\nThe algorithms that create the binary process of the linear mind meaning, how our solar plexus projects impulses that our physical brain picks up, that process is being interrupted with static, harnesses and mind control. If a person is not in their own power, they will be influenced to either be possessed by consciousness entities or possessed by forces that they act out that they don’t understand. This is the agenda of the negative aliens who are continuing to be aggressive with these technologies. \\nAs fragmented souls become more stressed out and engage in more negative behavior, at a certain point the body’s aura will include more percentage of that possessed dark energy. If a person is 49% light and 51% dark, that person will be sucked like a vacuum. A person that is primarily in fear or sick, they will get sucked down like a magnetic pull and it will cause that person to fragment. Their soul and seed atom will shatter. This is the metatronic black heart, which is essentially a reversal monad pulled down into a phantom system. The controllers want to destroy the actual crystal seed atom and have it be disconnected from the body. By doing this, they create an automaton, which is a body that is human but is not animated by any kind of soul , only a finite life force. \\nSimultaneously to that, there are those of us that are in the light warrior family or the galactic family starting to embody new levels of our spirit bodies that are starting to be returned to us (the monad) and with that god technology and consciousness technology we are learning new ways to work with the technology and some of that has required new levels of dark arts training. \\nWe are attempting to embody as much of our monadic consciousness and activate the seed atom. As we activate the seed atom, we activate and change the pulse rhythm in the grid on the planet. So many areas of the planetary grid are damaged, so they are going in reversals patterns. If we can hold this base pulse rhythm, we create a circumference in an area where we can literally create a safe zone. We are being asked to create a safe zone by Guardian contacts. If we can embody this, we create a safe zone on the planet. The more of us that do this, the more safe zones we are going to have. More people are going to have the opportunity to be able to pick up the code they need and not get sucked down into the controllers system where their seed atom could get shattered. \\nWe must embody this consciousness and architecture and hold it in our location. Our location is never an accident. This is our assignment meaning where we are, where we are holding it is where we need to anchor it down. \\nWe seem to have a goal to get a lot of this done by 2011 and ongoing. We are trying to meet a goal of a certain threshold of healing by November 11, 2011, which is 11/11/11. At strange at it may sound, bodies are freed now and we need to get them to their rightful owner. \\nHere is an explanation of the changes and adjustments that are happening in our bodies as the monad comes in and the Christ seed gets activated: \\n“There are multidimensional centers in the body that are called flame access points and they control the neurological processes in the physical body and also adjust the brain nervous system. As the body undergoes adjustments in the heart chakra, I am understanding that particular part of the bio computer which is controlled by the monad. So this is the nervous system adjustment that is controlling the currents that work with the pulsation on the heart rhythm. And then there is the heart rhythm axiatonal line upgrade in the center of the chest and heart. The flame access points work with a part of the architecture on the heart chakra where these points come out of the heart and are a part of breathing the zero point. \\nWe the starseeded ones are working with biological prototyping and we hold these certain levels of architecture. The holding of the Mother Arc is that 13th dimensional frequency which has to do with the universal monad and the dimensional 13 monad frequency of the Mother Arc. Generally I note that the monadic core is the 8th dimensional chakra in the thymus area where this starts to open up and the crystalline structure of the heart and its function starts changing. Layers 1-7 are planetary. 8th and above layers are off planet, galactic, multiple bodies that exist in other planets and star systems. The monadic 8th dimension and how it connects with the mother energy, changes biorhythms and certain chemicals that relate to the heart function. \\nThe permanent seed atom or the Christ seed starts coming on line when the monad starts connecting to the body. Higher spirit body starts connecting to the body at the thymus level and starts adjusting the heart pattern. It causes change in hormones, endocrine, biorhythms like a domino effect when the monad starts coming on line. \\nThe Egyptians knew that our endocrine system was responsible for secreting hormones and those hormones were responsible for our neurology being able to perceive other dimensions. The hormonal secretions change our neurochemistry and then align us to the broadcast to those particular windows of the soul. \\nThe monad is the 7th, 8th and 9th layer but it starts connecting at the 8th chakra level which is the heart. When the monad starts coming in like this, the whole heart changes pattern meaning the heart chakra is no longer an astral heart, it is a blue heart. Your heart turns blue and the frequency coming through starts turning blue. They were showing me something new I have never seen before which is that blue connection to the turquoise of the mother. So the 8th dimension is a gold color but when the monad starts flowering in the heart and the heart starts to configure, it actually looks blue and they call this the living lotus. I call this galactivation. \\nWhen our heart is healed, there is a fire that is ignited inside the heart that is accessed and the fire in the heart is also in the kidneys. There is a triangle that connects the heart into the kidneys. The kidneys are in the base of the triangle from left to right and the point of the triangle is in the heart. When the heart is healed, there is a twin flame ignition in our heart and kidneys, which shifts the heart configuration. Twin flames = structure of light within the heart. So two flames ignite in the heart. The monad is the greater flame and the physical body is the lesser flame. When this flame is ignited, there is an ignition in the heart and a fire coming in to the kidneys. \\nHow it impacts the 5th chakra, thyroid and parathyroid, glandular system, and secretions of the brain tell the brain how the heart and breathing rhythm work. It is a vast circulatory system including meridians, axiatonal lines, and the multiple levels of bodies of complexity working toward the physical embodiment of the Christ consciousness. This is about igniting the Christ consciousness eternal seed atom and bring that on line. The Monadic spark starts to connect to the seed atom, which is the Christ consciousness and our crystal body. \\nThis is the seed that the controllers are attempting to crush or stop from flowering in the human population. They want to crush the permanent seed atom in the thymus, which is the 8th chakra, which is where the monad starts coming in and actually connecting in to the body.” \\nTranscript of LR Session by L. Alexander. Share: Rate:'"}, "time": 1742564170.5648465}