{"duration": 0.16418862342834473, "input_args": {"text": "'Celebrating the Death of the TPP Trade Deal November 20, 2016 \\nExclusive: It’s been a rough year for neo-liberalism and its orthodoxy about global “free trade,” now including the political defeat of President Obama’s Trans-Pacific Partnership trade deal, writes Chelsea Gilmour. \\nBy Chelsea Gilmour \\nIn all practical senses, U.S. participation in the Trans-Pacific Partnership is over, at least for now. The Washington Post reported that Senate Majority Leader Mitch McConnell says Congress will not seek to ratify the trade deal during the lame-duck session, essentially the last hope of the Obama Administration to pass the deal. People celebrated the defeat of the TPP at a rally on November 17, 2016. (Photo by Chelsea Gilmour) \\nHouse Speaker Paul Ryan said the GOP does not have enough votes to pass TPP in the House, with soon-to-be Senate Minority Leader Chuck Schumer, D-New York, confirming the deal will not be approved. \\nHow did this historic defeat happen? One answer is people-power built around widespread anger over the damage that earlier trade deals, such as NAFTA, have done to America’s manufacturing base and the decent-paying jobs that went with it. \\nThe TPP deal was viewed as one more corporate give-away and another sell-out of the working class, a disdain shared by many on both the Left and Right. That, in turn, inspired a strong bipartisan, grassroots opposition that delayed passage of the deal, carrying the issue into 2016 and the presidential election. Timing sealed the deal’s fate, TPP became political anathema to any politician who tried to touch it. \\nThe pushback against the Trans-Pacific Partnership came from many directions, mainly because of the intersectional nature of the deal itself. The TPP would have affected everything from environmental regulations to internet privacy to pharmaceutical prices to workers’ ability to organize themselves. \\nCelebrating a Victory \\nAt a rally organized by the labor union National Nurses United (NNU) on Nov. 17 in Washington, D.C., various unions, progressive groups and Congressional Democrats came together to celebrate TPP’s apparent defeat and to emphasize the importance of continuing the grassroots momentum under the incoming Trump administration. \\nSen. Bernie Sanders of Vermont, Rep. Tulsi Gabbard of Hawaii and former Ohio State Sen. Nina Turner spoke at the event, along with leaders of various unions and organizations, such as AFL-CIO Vice President Tefere Gebre. The Amalgamated Transit Union (ATU), the Communication Workers of America (CWA), and United Steelworkers (USW) were some of the unions in attendance to support the defeat of the deal and to celebrate their role in helping halt the deal in Congress. \\nFernando Losada, the Collective Bargaining Director of National Nurses United who organized the rally, said “The movement against TPP was a movement of movements, if you will — a movement for healthcare justice, movement for environmental justice, movement for workers rights, etc. All these things were under threat under TPP and now those same movements are under threat [from the Trump administration], so we have to be vigilant, not only about the trade agreements but all the issues.” Members of National Nurses United, which organized the anti-TPP event on November 17, 2016, hold signs supporting Bernie Sanders and Medicare for All. (Photo by Chelsea Gilmour) \\nThe rally was originally organized to galvanize opposition to the TPP but the trade deal’s political demise transformed the event into more of a celebration. Because of Trump’s victory in the Nov. 8 election, the rally shifted emphasis somewhat to concerns about the actions of a Trump administration. \\nFor instance, a main theme of the rally was Medicare for All, single-payer healthcare for all American citizens, but there was also fear that the Republican-controlled Congress would take aim at Medicare itself, the health insurance program for the elderly. \\nLosada explained: “Medicare itself — Medicare for the limited numbers that it’s available to now — is completely vulnerable and exposed to existential attack by the Republican administration. Paul Ryan, in particular, stated he wants to privatize it.” \\nNext Steps for Progressives \\nThere were also signs of a shared Left-Right hostility toward policies pushed by the Establishment that harm common citizens, the TPP trade deal being only one, though the rally focused on what progressives should do in the future. \\n“It’s really about all the political Establishment that would think about undermining our past achievements, our rights, and our aspirations for the future as a movement,” Losado said. “We’ve got to organize people’s power here, there’s just no alternative to it. We can only organize our way out of this one. \\n“We think that this coming period is going to really rally people, we’re already seeing that. We’re going to see a rise in militancy, a rise in vigilance and maybe this is what the movement needs to finally get us over the hump. The alternative, of a neoliberal regime in power, ultimately may have not helped the final outcome, so we’ll see. We’ll remain hopeful. All we can do is fight.” \\nFormer Ohio Sen. Turner, a Bernie Sanders supporter during Campaign 2016, MC’d the event and asked attendees — particularly progressives — to be wary against tactics of division and hate in their organizing efforts, tactics which were used extensively by the Trump team. She said the “promise lies in the problem” and referenced the popular Democratic slogan, “Love Trumps Hate.” \\nBernie Sanders called on Democrats to reflect on their own shortcomings and to formulate a new direction moving forward. He endorsed Rep. Keith Ellison, D-Minnesota, to become the new chairman of the Democratic National Committee. (Photo by Chelsea Gilmour) \\nAddressing the likely policies of the incoming Trump administration, Sanders said, “Donald Trump is not going to stand up to the Establishment — We are going to stand up to the Establishment.” \\nHe stressed the need for individuals of all political stripes to get involved in movement-building in their own communities: “If there’s any message I have today it is not ‘Bernie,’ it is ‘All of Us Together.’ … \\n“As previous speakers have told you and what I believe: if you look at history, the lesson that you learn is that when ordinary people stand up by the millions, when they don’t let demagogues divide us up … when we stand together and keep our eyes on the prize, when we focus on economic justice, when we focus on social justice, racial justice, environmental justice, when we stand together, Donald Trump and nobody — nobody — is going to stop us. Let us go forward together.”'"}, "time": 1742562196.2105765}