{"duration": 0.7614116668701172, "input_args": {"text": "'The summer light was fading to gold near Red Square as Oliver Stone maneuvered through the lobby bar of a   Moscow hotel last year. He walked past the marble staircase and the grand piano to a table in the back. A group of businessmen in suits lingered nearby. Stone grimaced. “I think we should move,” he said. His producer, Moritz Borman, led the way to another corner. “How’s this?” Borman asked. Stone didn’t answer. He eyed an older couple slurping soup and kept moving. A moment later, Stone finally settled in by a window, comfortably beyond earshot of the other patrons. Such security precautions had become routine. Ever since Stone decided to make a biopic about Edward Snowden, the American   blower currently holed up in Moscow somewhere, the director  —   who became a Buddhist while making “Heaven  Earth” and sampled a buffet of psychedelic drugs for “The Doors”  —   had gone all method again. On “Snowden,” he and Borman became so preoccupied with American government surveillance that they had their Los Angeles offices swept for bugs more than once. The director hadn’t been sleeping well. Principal photography wrapped a month earlier, and now Stone had come to Moscow to film Snowden for the movie’s grand finale. He ordered a decaf coffee and began to lay out the events that led him and Borman to be hanging out in Russian hotels, on the lookout for potential spies. “Last January, Moritz calls me,” Stone said. “He says: ‘You got a call from this fella who represents Mr. Snowden. You’re invited to Moscow. ’’u2009” The call had come from Anatoly Kucherena, Snowden’s Russian lawyer. In the course of his career, Kucherena has represented Russian oligarchs, film directors, a few pop singers and a state minister. In 2012, he campaigned for Vladimir V. Putin, and soon after Snowden landed in Moscow, Kucherena showed up at Sheremetyevo Airport and offered his services. Then Kucherena wrote a novel about his new client. Titled “Time of the Octopus,” it follows a National Security Agency leaker named Joshua Cold who is marooned in the airport and the Russian advocate who liberates him. In January 2014, months before the book was published, Kucherena called Borman to see if Stone might like to make it into a Hollywood movie. “And I know you from working on, what, three films?” Stone said at the bar. “Five,” Borman said. At the time, Stone and Borman were barely speaking after a   out during the making of “Savages,” a beachy Blake Lively thriller. “We’ve had our fights,” Stone said. “You know, he’s German I’m American. ” He didn’t elaborate. “He calls, and I go: ‘Oh, [expletive]. Not again,’’u2009” Stone continued. It wasn’t just about Borman. Stone wanted nothing to do with another political docudrama. He spent two decades trying to get a biopic about the Rev. Dr. Martin Luther King Jr. off the ground, only to see “Selma” get made to critical acclaim. Then there was the My Lai massacre film. Merrill Lynch put up cash, Bruce Willis was set to star and Stone built an entire village in Thailand. As the economy collapsed in 2008, the financing evaporated. “You get these scars, and they don’t go away,” Stone said. So Stone was skeptical. But this was Snowden, who   handedly exposed the colossal scale on which the United States had been surveilling its citizens. Plus, the director needed a hit. After early successes like “Platoon” and “Wall Street,” his more recent films didn’t receive the attention he hoped. The Snowden story had all the ingredients of an epic Stone picture: politics, government conspiracy and, at the center of it all, an American patriot who had lost faith. If it panned out, it could be Stone’s millennial   up to “Born on the Fourth of July,” the Ron Kovic biopic that won him an Oscar in 1990. But first Stone and Borman had to make sure Kucherena was for real. Borman asked the lawyer to send the book and two   tickets to Moscow. Both arrived the next day. In case they still had doubts, Kucherena’s office gave Borman a number to call. On the other end was an employee of the Russian consulate in San Francisco, who turned out to be a big fan of “The Life of David Gale,” a film Borman produced. They were issued visas that same week. (Kucherena denies buying   tickets for Stone and Borman or helping expedite their visas.) “When that happened,” Borman said, “I thought, O. K. I guess Kucherena can pull the strings. ” As   narratives go, Snowden’s is a compelling one. His transformation from a shy and pale   something  —   full of the sort of idealism those years can afford  —   to political dissident made him a hero figure to   establishment liberals who are in the business of storytelling. Raised in a family of federal employees, Snowden grew up near Fort Meade, Md. He enlisted in the Army, went to work for the Central Intelligence Agency and became a technology specialist for the N. S. A. By the summer of 2013, he had downloaded thousands of documents, taken off for Hong Kong and asked the journalists Glenn Greenwald and Laura Poitras to meet him there. The initial revelations were sensational. Not only had the N. S. A. been monitoring the calls, emails and web activity of millions of Americans, but it also had been tapping into the networks of Google, Yahoo and other companies to do so. The Guardian published the leaks, and Greenwald eventually revealed the identity of his source in a video shot by Poitras. Depending on your feelings about national security, the N. S. A. ’s actions were either necessary or unconstitutional. The Apple   founder Steve Wozniak called Snowden a hero. Secretary of State John Kerry called him a traitor. Donald Trump called for his execution. As Snowden became a celebrity, a cause and a historical event, the web of people who wanted to take part in it widened. Most had his best interests in mind, but his story also happened to advance agendas that had long needed an appealing spokesperson.   liberties lawyers wanted to represent him. Activist journalists wanted access to him. Publishers rushed out books, including “The Snowden Files: The Inside Story of the World’s Most Wanted Man,” by Luke Harding of The Guardian, and “The Snowden Operation: Inside the West’s Greatest Intelligence Disaster,” by Edward Lucas of The Economist. Despite promising an “inside” look, neither writer had ever met Snowden. Those with intimate knowledge documented the experience, too. In 2014, Greenwald published “No Place to Hide: Edward Snowden, the N. S. A. and the U. S. Surveillance State,” a dramatic retelling of how Greenwald broke the story. That fall, Poitras released “Citizenfour,” a tense and spooky documentary about a modest and intelligent young man who hid under a blanket when typing on his laptop. (It won the 2015 Oscar for best documentary.) Snowden, meanwhile, ended up in Russia. He had embarked on a trip to Ecuador, but the United States revoked his passport midflight, leaving him stranded in Moscow. For Russia, Snowden was like a bird that flew in through an open window  —   or, as Putin joked, an unwanted Christmas present. But politically speaking, he could be useful. After enduring the United States’ endless lectures about human rights, the Kremlin could suddenly welcome a man who exposed   American hypocrisy. Kucherena entered the picture as Snowden’s lifeline, or at least as someone who could help him navigate Russia’s asylum laws. An experienced lawyer, Kucherena was appointed by Putin to the Public Council, overseeing the Federal Security Service (F. S. B. ). Snowden’s case presented a new opportunity. It took Kucherena a month to negotiate Snowden’s stay and three months to write “Time of the Octopus. ” Stone’s first meeting with Kucherena was a disaster. (“I thought he was a gruff bear,” Stone told me.) The director wanted to meet Snowden, but Kucherena said Snowden wouldn’t meet them until they agreed to option “Time of the Octopus. ” (Kucherena denies this.) According to Stone and Borman, by the end of a long weekend, they reached a gentlemen’s agreement: Stone would option the novel  —   if Kucherena could provide regular access to his client. I first spoke to Stone in June 2015, after reading that he was in the midst of shooting a film based on Kucherena’s novel. He said he would be traveling to Moscow again that week to shoot Snowden and agreed to let me tag along. A day later, a peeved Borman called me. “You’ve been disinvited,” he said coolly. During those 24 hours, this magazine had contacted Ben Wizner, Snowden’s lawyer at the American Civil Liberties Union, to arrange an interview with his client. Kucherena may be Snowden’s Russian representative, but in the United States, Wizner runs the show. Wizner was furious. Not just because Stone had invited a reporter to Moscow, but because of how it all looked: that Snowden was involved in a Hollywood movie and that the whole production was seemingly brokered by a lawyer with ties to the Kremlin. Borman would later tell me that we had waded into the sticky territory of Snowden’s multiple emissaries. “There are two ways to access him: One is Kucherena and one is Wizner, and it’s completely political,” Borman said. “It’s a political situation that goes way above your head. ” When Wizner and I finally got on the phone, he was in   control mode. He told me that Snowden wasn’t profiting from Stone’s film in any way. “One    rule Ed always had was, I’m not selling my life rights,” Wizner said. Snowden’s participation in a Hollywood movie would only fuel the claims of his critics  —   that he was a narcissist eager to cash in. That said, Stone’s film would be seen by millions of people, which meant it could sway public opinion. “We were choosing between two bad options,” Wizner said. “He could have stubbornly stayed completely at arm’s length and had no input whatsoever. Or he could have some input and compromised the arm’  relationship. And I didn’t know how to advise him on that. ” According to Wizner, Snowden met with Stone only to make sure that the film told an accurate story. “It’s been us walking this tightrope between clearly not having any formal connection to the project  —   not deriving any benefit from it  —   and also not wanting to just be completely helpless and, you know, see what Oliver Stone comes up with,” Wizner said. Despite some initial discomfort, he was tentatively optimistic. “Maybe it’ll be good,” Wizner added. “You know, Oliver Stone wrote ‘Scarface. ’’u2009” Still, Stone was heading to Moscow to film Snowden for an appearance in the movie, which could be seen as an endorsement.   checking is one thing, I said a cameo is another. “It is, and I’m not entirely comfortable with it,” Wizner said. Wizner had negotiated veto control over any footage featuring Snowden in the film. After we spoke, the lawyer says he asked Borman to put that in writing. He also reiterated that if Stone took a reporter along, Snowden would not participate. Stone and I eventually reached a compromise: I wouldn’t observe the shoot, but I could still come and meet Kucherena. A few days later, I met Stone in Moscow. The director, who is 69, has a   leaning gait and unruly eyebrows, so that he looks a bit like a bull that is always about to charge. He emerged from the hotel’s elevator with a pained look on his face. It was drizzling, and Stone’s hair, which is the color of dark shoe polish, was pointing laterally. “I have some bad news,” he said. “I cannot deliver Anatoly. ” He had just seen Snowden, who had been in touch with Wizner and was very upset, Stone said. “Ed said he doesn’t want Anatoly talking to you, and he said that very clearly,” Stone added. I would spend the next few days camped out at the hotel. When Stone wasn’t shooting, we would meet in the lobby bar as he continued to tell me about the making of his film. Soon after optioning Kucherena’s novel, Stone had returned to Moscow with his   writer, Kieran Fitzgerald, a recent University of Texas M. F. A. graduate. Anticipating a homesick Snowden, Fitzgerald hauled over a duffel bag packed with the stuff of Americana dreams: Kraft macaroni and cheese,    cups, Oreos, Pepperidge Farm cookies, Twizzlers, peanut butter, Spam, an Orioles baseball cap and a pair of Converse sneakers. “It was like delivering a care package to a kid at summer camp,” Fitzgerald told me. He also slipped in a copy of “The Odyssey” translated by his grandfather, Robert Fitzgerald. “I thought it was appropriate, since Ed was on his own kind of odyssey trying to get home. ” Snowden and Stone had gotten off to a slow start. Snowden was squeamish about a movie being made about his life. Stone, in turn, said the film would be made with or without him. Fitzgerald says he played referee. “Oliver can be a bit of battering ram,” Fitzgerald said. “He’s accustomed to hard men who need to be cracked, but that’s not Edward Snowden. He’s not an   male type. He’s a very sensitive mind. So I was there to say: ‘Everything is going to be O. K. He’s a good guy. It’s going to be a good movie. ’’u2009” Eventually, Snowden began to open up, answering questions about his childhood his girlfriend, Lindsay Mills and what he could about his work for the N. S. A. While Fitzgerald returned to Austin to work on the script, Stone set out to plant his flag in the Snowden story. In Hollywood, book options are the equivalent of calling dibs, and Stone had competition. In May 2014, Sony Pictures optioned Greenwald’s “No Place to Hide. ” By June, Stone had announced that he acquired Kucherena’s book and Harding’s “The Snowden Files. ” The tactic worked. Sony got nervous. “Now what?” Amy Pascal, then Sony’s   chairwoman, wrote to another executive. (The email would be leaked during the Sony hack.) Pascal’s colleague reminded her of the case of the dual Steve Jobs biopics  —   “Jobs,” with Ashton Kutcher, might have come out first, but it was “Steve Jobs,” starring Michael Fassbender, that was the better film. Pascal wasn’t convinced. “Oliver Stone is not Ashton Kutcher,” she responded. She wrote to George Clooney to pique his interest in adapting Greenwald’s book, but Clooney passed. “Stone will do a hatchet job on the movie, but it will still be the film of Snowden,” he replied. For Stone, the impending Sony project was a call to arms. Fitzgerald cranked out a first draft of the script, and that fall Stone went out to studios with a budget of $50 million and a release date in December 2015. Each one turned it down, and Stone became convinced that the studios wanted to quash the project because of its controversial subject matter. “This is why corporations owning movie studios is not a good idea,” he said. While Borman hustled to find independent financing, Stone dove into casting. For the lead, he chose Joseph   Levitt, the son of liberals from Sherman Oaks, Calif. and a former child actor who has retained a pleasingly boyish look. “There’s an interesting blandness to him in the same way that Jimmy Stewart might’ve been considered bland,” Stone said. “There’s a neutrality there, which allows him to grow on you. ” Shailene Woodley was cast to play Lindsay Mills, Zachary Quinto as Greenwald and Melissa Leo as Poitras. By early 2015, Borman and Stone had racked up several hundred thousand dollars in debt, but the money was still short. The shoot was ultimately delayed three weeks as the producer cobbled together European partners. In the United States, “Snowden” was picked up by Open Road Films, a small production company that had just put out “Jobs”  —   the Kutcher version. “It was painful that we ended up with this independent distributor,” Stone said. Borman offered that Open Road was not so independent anymore. “I’d never heard of it,” Stone said, adding: “I’ve been there before, but not on this level and not at this age. So for me, it was very difficult personally. ” The cover of “Time of the Octopus” features a   image of Snowden’s face and a globe peeled like an orange to reveal the logo of the C. I. A. In his author photo, Kucherena indeed looks bearish, with a round face, matted white hair and a cellphone pressed to his right ear  —   as if he were midnegotiation. “The whole truth about the American agent on the run,” the cover boasts. Also: “Oliver Stone is currently shooting a film based on this book. ” I had gotten my copy from Stone, who handed it to me with a disclaimer. “Now, it’s easy to take a shot at this,” he said. “You know, it wasn’t the basis of the movie. But it’s fun. I enjoyed reading it. ” “Time of the Octopus” takes place in a single night. The protagonist, Joshua Cold, is sequestered in a bunker at Sheremetyevo Airport, where his Russian lawyer keeps him company. The chapters alternate between their   stamped conversations and those labeled as digital files (“File 004. wav”) suggesting that they are the lawyer’s transcribed recordings. The basic facts of Cold’s case sound familiar, as do the character names: There are journalists named Boitras and Greywold and an organization called Mikileaks run by an Augusto Cassangie. For the most part, Cold and the lawyer sit and talk about life, quoting Laozi to each other. But there is also a distinctly   Soviet tone to the novel, which reads both like a love letter to American culture  —   Steven Spielberg, B. B. King, “The Terminator,” Penthouse magazine, Popeye, “The  ” Paul Newman, Bon Jovi, “  Man,” “Braveheart,” Quentin Tarantino and Tupac Shakur are all mentioned  —   and a gleeful taunt to its government. “Not only did [Cold] snap the beak of the American eagle,” Kucherena writes, “but he also gave him a good kick and a very humiliating one, as if it was not a menacing predator but a rural hen. ” In the bunker, Cold enjoys pizza and whiskey, but he is worried about American agents coming to retrieve him. “Believe me, Russia is not the worst option for you,” the lawyer tells Cold. “And you needn’t regard us with such mistrust. ” Once Cold is granted asylum, the propaganda is dialed up. “I shall work in Russia and get an apartment!” Cold announces. “I thought I would spend the rest of my life in this underground prison. ” “As far as I know Mr. Putin, he is not one to change his mind easily,” the lawyer assures him. “All will be O. K. ” The novel concludes with Cold vowing to learn to drink like the Russians, but the lawyer suggests he try Kvass instead, a fermented beverage made from rye bread. (“It is the Russian   Cola,” the lawyer says.) Then they leave the bunker. “Weird, huh?” Fitzgerald said when I asked about the novel. In fact, few people associated with either Snowden or “Snowden” wanted to discuss it. “I don’t want to say anything on the record about that book,”   Levitt told me. According to WikiLeaks, Stone paid a million dollars for “Time of the Octopus,” which seemed like a hefty amount to pay for material that Stone admitted he had no plans of using. (That’s the same figure Sony reportedly paid for the rights to “Eat, Pray, Love. ”) “We bought it because we did get good access to Ed,” Stone explained. “He had to be brought along. ” During Stone’s visits, Kucherena hosted the director at his favorite restaurants and at his dacha outside Moscow. “They had a kind of bromance,” Fitzgerald told me. Photos from the trips look like vacation postcards, with Stone and Fitzgerald grinning in Red Army caps (a gift from Kucherena) and Fitzgerald and   Levitt posing for a selfie in front of St. Basil’s Cathedral. While out in public, the group referred to Snowden as “Sasha,” a nickname Kucherena had given him. Kucherena and I would eventually speak by phone. He said he wrote the novel because he had received calls from many “representatives of Hollywood,” writers and filmmakers. “At some point, I just thought to myself, Why don’t I try to write the book?” he said. I asked which writers and directors had called him. “Very many people called me,” he replied. “But I honestly don’t remember their names now. ” The lawyer was deeply troubled by the news media’s insinuations that he is connected to the Kremlin. He pointed to several clients he has defended against the F. S. B. including Platon Obukhov, a writer accused of spying for Britain. “I never had any kind of agreement with the Kremlin,” he said. “They tried to say I’m tied to the F. S. B. but that’s complete nonsense, excuse me. ” Kucherena said he was inspired by his favorite authors, who include Tom Clancy, Aldous Huxley and George Orwell. “The Octopus in my novel is, you can say, a direct offspring of Big Brother,” he said. Like most writers of fiction, he was reluctant to discuss which parts of his book were based in reality. “A person can only be open with someone he trusts,” Kucherena said. “And here, because he had no one else, it turned out that I took on the role of mother and father. Accordingly, we had confidential conversations of various sorts. ” He did not see a conflict of interest in his writing the novel. “I wrote an artistic book,” Kucherena said. Because he represents Snowden pro bono, he never expected to capitalize on the relationship. “I don’t take any money from him,” Kucherena said. “He doesn’t have any. So I wrote a book, yes, fine. So I got a little, as we say in Russian. ” Despite being the one to put the “Snowden” project into motion, Kucherena shied away from assuming any credit. “I’m very far from all that,” he said. “I’m just an advocate. Look at where I am and where Hollywood is!” When I told Wizner that Stone said he bought Kucherena’s book to gain access to Snowden, his voice climbed a few octaves again. “Virtually every single other person who’s met with Snowden, and there have been dozens of them, have just gone through me, and we’ve hooked it up,” Wizner said. He listed some names, which included the film director Doug Liman, as well as the actors Jared Leto and John Cusack. (Cusack took Snowden Cool Ranch Doritos, as well as DVDs of “Network” and “Dr. Strangelove. ”) Wizner, who is 45, has been at the A. C. L. U. since 2001. Before Snowden, he tried to bring several suits to increase oversight over the intelligence community. Wizner likes to say that he spent a decade banging his head against a wall, and then Snowden came along and brought that wall down. Snowden had not only revealed the scope of the surveillance apparatus, but also that top government officials routinely misled the public about it. Since becoming Snowden’s advocate, Wizner has become a figure of not insignificant geopolitical importance. Those revelations have since formed a critical backdrop for legislative reforms, and there are few things that irritate Wizner more than claims that threaten to tarnish Snowden’s character and their common cause. It would not be a stretch to say that for Wizner, Kucherena has become a bit of a liability. Since 2013, the Russian lawyer has announced that Snowden landed a job at a major Russian website  —   news that turned out to not be true  —   and has supplied the news media with photos of his client enjoying his new life in Russia, attending an opera at the Bolshoi Theater and cheerfully hugging a dog named Rick. (Rick later turned out to be the dog of one of Kucherena’s friends.) Now Kucherena had sold a novel to Stone, making it seem as if the director had to pay a Russian fixer to have access to Snowden  —   or worse, that Snowden was somehow under the lock and key of the Russian authorities, lent to Stone for a Hollywood movie. Wizner’s counterefforts in the United States have been successful. Former Attorney General Eric Holder, once a fierce critic, has acknowledged that Snowden performed “a public service. ” President Obama has called for the reform of phone metadata collection, and last June, Congress passed the U. S. A. Freedom Act, a law that directly resulted from Snowden’s leaks. Snowden has come to be seen as a levelheaded activist. According to Wizner, he leads a free existence in Russia, making appearances via live video and publishing   against Russia’s human rights violations. “I think people are inclined to believe that Russia would never let him stay there unless he was paying for it in some way,” Wizner said. “But it’s just not true. Not only is he not cooperating, but he’s actually being critical. ” When I asked Wizner about Kucherena’s book, we were meeting at a cafe near his office in Lower Manhattan. “Maybe you should just characterize my facial expression  —   ‘He smirked,’’u2009” Wizner said. (Except that his smirk was mixed with a frown.) According to him, Snowden has not read Kucherena’s book. “The thing is, Ed has much bigger fish to fry,” he said. “If you had people calling for your assassination, you’d be annoyed. If you were facing life in solitary confinement, you’d be concerned. If someone wrote some book in Russia that no one is going to read, it doesn’t register. ” Wizner was reluctant to discuss Kucherena’s role in Snowden’s life, but he conceded that it was somewhat unorthodox. “It seems like the ethical rules governing the   client relationship may be somewhat different in Russia,” he said. “It would be very unusual for a lawyer in a   profile case to provide exclusive photos of his client to newspapers or write an unauthorized book and sell it to Hollywood. ” Kucherena and Wizner have never met. Whatever uneasiness there may be, Kucherena spoke warmly about his American counterpart. “We are on the same team!” he told me. “Ben works in America, I work in Russia. If he wanted to write a book, I would have no problem. ” Wizner told me he has no plans to write a book about Snowden, fictional or otherwise. “Mission accomplished,” Stone announced. We had met in the lobby bar again, the day after he filmed Snowden, and the director was in better spirits. The shoot took place at Kucherena’s dacha. The day went long. Stone’s idea was to interview Snowden and capture an affecting moment that would give the film its dramatic ending. But the first takes were stiff. “Ed is used to answering questions on a level of intelligence,” Stone said. “But I was interested in the emotional, which is difficult for him. ” Stone ended up doing nine takes. At one point, they took a break and went for a walk around Kucherena’s property. By the end of the day, Stone decided that he had gotten Snowden to go as far as he was going to. “He was cooperative,” Stone said. “He wanted to make it work. But as an actor  —   he’s not used to that. I mean, he’s not an actor. And I don’t think he became one that day. ” To make Snowden more comfortable, Stone worked with a minimal crew. Some were meeting the   blower for the first time and still seemed a bit  . “Suddenly this little creature comes teetering in  —   so fragile, so lovely, such a charming,   behaved, beautiful little man,” the cinematographer, Anthony Dod Mantle, told me. “He’s like an old soul in a very young body. He’s got fingers like violins. ” Filming Snowden reminded Mantle of shooting other men with outsize reputations and slight builds. “It’s like Bono or Al Pacino,” he added. “Those guys are   weenies. But if you isolate him into a frame, he can be as big as anybody else. ” Mantle shot Danny Boyle’s “Slumdog Millionaire” and “127 Hours,” but “Snowden” proved to be a special challenge. Convinced that making the film on American soil would be too risky, Stone decided to film in Germany, where Borman was able to score some tax subsidies. With roughly 140 script pages to shoot in 54 days, the crew sprinted from Munich to Washington, to Hawaii, to Hong Kong, and then back to Munich. Often, Mantle wouldn’t get to see locations before he had to film in them. To cut costs, the suburbs of Munich had to stand in for rural Maryland and Virginia, with German extras cast as Americans. “Thank God the Germans act like Americans,” Stone said. The production itself resembled a covert operation, with a code name (“Sasha” had stuck) and elaborate security protocols. Worried that “Sasha” would be of interest to the N. S. A. Borman and Stone avoided discussing production details by phone or email  —   “It was all handwritten notes and long walks in the park,” Borman said  —   and kept the script on   gapped computers, ones that have never been connected to the internet. If it had to be mailed, Borman would mix up the pages into four packages, which he would send with four different couriers to four different addresses. “Maybe nobody gave a [expletive],” Borman told me. “Or maybe the N. S. A. is laughing at us like, ‘Look at those idiots  —   of course we copied everything that came through DHL and FedEx!” For the actors, the frenetic schedule and paranoia on set added to the mood of the production. “Snowden himself was in the midst of a stressful situation, so the fact that our shoot was a little bit that way, I think, helped,”   Levitt said, before catching himself. “Making the movie was obviously a walk in the park compared to what he did. But just to have those little emotional touch points can help when you’re acting. ” Committed to inhabiting Snowden’s robotic speech pattern,   Levitt lifted the audio from “Citizenfour” and played it on repeat while he slept. He also worried that some of the dialogue felt   handed. “Oliver is very into making his point,” the actor said, “as he should be. I really admire him for that. But I felt like it was my job to be like, ‘O. K. I want to make the point, too, but this is a human being and not just a mouthpiece. ” Stone found   Levitt’s approach too “  ish” at times. “I was trying for the dramatic side as much as possible,” Stone said. Fitzgerald was ultimately flown in to the set to execute   minute rewrites. By late spring of 2015, Stone was close to wrapping when his mother, Jacqueline Goddet Stone, died at 93. She had called him in Munich, but Stone felt he couldn’t risk leaving. “To go to L. A. would have cost us three down days,” Stone told me. “I knew she was going to pass, but I thought I could make it. ” Stone remained on set during the funeral and kept shooting. Stone’s trip to Moscow to film the real Snowden was the last bit he needed to complete the film. But he was still worried  —   that the footage would be leaked, that critics would eviscerate it, that Snowden wouldn’t like it. “I want him to vet it,” he said. He was heading to New York to begin editing and planned to return to Moscow at the end of the summer to show Snowden a rough cut. “O. K. my dear,” Stone said, getting up to leave. “See you in New York. ” Then he disappeared for six months. Before Stone set out to make his film, he had met Snowden’s chief biographers, Greenwald and Poitras. Stone and Greenwald became friendly, and when Greenwald’s book drew interest in Hollywood before it was published, the journalist turned to Stone for advice. “In the back of my mind, I thought if he had any interest in making a film, that would be a good segue for him to say so,” Greenwald told me. At the time, Stone wasn’t interested, and Greenwald negotiated the deal with Sony. Stone later came back and offered to match Sony’s bid, but Greenwald declined. “I think he was a little perturbed,” Greenwald said. Of the principal cast, Zachary Quinto, who plays Greenwald in Stone’s movie, was the only actor who didn’t meet his   counterpart as research. “I always thought that was a little weird,” Greenwald said. “I think Oliver thought I had some competitive hostility toward his project, or he had some hostility  —   I’m not really sure. ” (According to Stone, Quinto didn’t need to meet Greenwald because there were so many videos of the journalist online.) In the spring of 2014, Stone flew to Berlin and met with Poitras. The meeting did not go well. According to Poitras, Stone proposed that she delay the release of “Citizenfour,” which she was then in the middle of editing, to time up with his film. “Because his film would be the real movie  —   because it’s a Hollywood movie,” Poitras told me. “Obviously I wasn’t interested in doing that. To have another filmmaker ask me to delay the release of my film was  —   well, it was somewhat insulting. ” Stone was annoyed, but he stuck around for a few drinks. They discussed new movies, including “12 Years a Slave. ” As Poitras recalls, Stone found the film too violent, while Poitras thought the brutality was appropriate given the subject matter. Stone was growing increasingly frustrated. “At some point, he reached over and had his hands around my neck,” Poitras said. “It was sort of in a joking way. I think he was a little bit drunk. But it was not a particularly pleasant evening. ” According to Stone, he only offered to help Poitras get distribution. “We thought we’d help her either bring out her film with our film, or in the wake of it or before it, if we could,” Stone said. He didn’t recall pretending to strangle Poitras. “I think from talking to her, you sense she’s superparanoid,” he said. “But I liked her,” he continued. “I admired her. I saw her films. I was trying to help her. If Laura is accusing me of trying to aggress her or kill her, she’s crazy. ” Despite his occasional bullishness, Stone craves approval. His films tend to resemble his character: at once original, impetuous, dogmatic and stubbornly ambitious. They typically run up to three hours, and he is often hurt when they’re underappreciated. Once, I was with Stone when he was handed a copy of “A Child’s Night Dream,” the novel he wrote at 19. Stone began to recite the blurbs aloud. “The language moves in torrents, always energized . .. shamanistic,” Stone read, quoting The Boston Globe. “I don’t get many good reviews, but this is good. ” I said that he has gotten plenty of good reviews since then. “You should see Rotten Tomatoes,” he said, referring to the   review aggregator. Stone’s torment is at least in part   inflicted. Biopics can be a nasty business, and Stone routinely throws himself into historical narratives and the messy negotiation between fact and fiction. The haggling with historians and family estates is the reason Stone was never able to make films about Martin Luther King Jr. and Hank Williams, and it was why he had to wait for Richard M. Nixon to die to make “Nixon. ” For Stone, the   characters of the stories he is after have become both the obstacles and the necessary arbiters of his work. It’s why he refused to make “Snowden” without Snowden, and why his appeals to Greenwald and Poitras were his way of getting them on board. If Poitras had a strong reaction to Stone’s proposal, it was because she had already been hounded by Sony. After the studio optioned Greenwald’s book, Poitras says Sony asked to buy her life rights  —   an offer she declined. Sony suggested that she come on as a consultant, but when the contract arrived, it stipulated that the studio would have access to Poitras’s tapes and notebooks. “So I’d already gone through that when Oliver came in trying to position himself,” she said. Poitras is a   spoken, cautious woman who has spent much of the past decade on government watch lists. Her resistance to participating in various Snowden projects has less to do with her feeling territorial than with her trying to maintain some control as she has become a character in a story that is no longer hers. Poitras’s radical position is that the “Snowden story” can really belong only to Snowden. “I could have asked him for a   contract in Hong Kong, but I don’t believe in that as a concept,” she said. “It’s his story, and I hope he tells it when he’s ready. ” Neither Greenwald nor Poitras ultimately object to Stone making his film. While his own movie still lingered in development, Greenwald thought Snowden’s story might in fact be safer in Stone’s hands than it would be elsewhere. The Sony leaks would eventually reveal that Stone’s paranoia may have been justified: In emails about the purchase of Greenwald’s book, an executive in Sony’s   affairs office suggests toning down the news release, changing “illegal spying” to “intelligence gathering” and “misuse of power” to “actions. ” “My big worry with Hollywood and the Snowden story is that they’re either going to be cowards and completely drain it of its political vitality,” Greenwald told me, “or that they’re going to do a superbiased smear job. For all the talk about how liberal Hollywood is, the reality is that they’re really close to the government. And whatever other things you might say about Oliver, I was actually relieved that someone was going to do this film where there was no danger of those things happening. ” This January, I drove to Stone’s office in West Los Angeles to watch a rough cut of “Snowden. ” Stone works out of a discreet suite in a pristine office complex. The décor is eclectic. There are tribal masks, Indonesian throw pillows, a Che Guevara painting and a lone potted palm tree. Like “Citizenfour,” “Snowden” takes place in Hong Kong, but this time the story has the eerie feeling of a familiar scene   enacted by skilled Hollywood actors. Stone was right about   Levitt. His performance is not an interpretation so much as a direct replica of the   blower’s even demeanor and intonation. Quinto plays Greenwald with such intensity that he appears perpetually enraged. Melissa Leo’s Poitras is in turn warm and protective, almost maternal. Stone came in just as the credits rolled. He was nursing a cold but was back on caffeine and asked his assistant for Bulletproof, the trendy coffee brand made with “  butter. ” “It’s supposed to be nutritional,” Stone said. “No radicals. ” Since I last saw him, the film’s release had been pushed from December 2015 to May 2016 as Stone rushed to complete it, and then once more to September 2016. The biggest challenge was pacing. Stone likes to structure his movies around a series of   pivoting, battlelike scenes  —   the concerts in “The Doors,” the football games in “Any Given Sunday” or actual warfare in “Alexander. ” A story in which the drama hinges on a tech specialist downloading classified documents was more subdued than he was accustomed to. “Coding is not exciting,” Stone said. “At the end of the day, it’s a nerdlike behavior  —   it’s dull on a screen. ” Stone got around the tedium of reality by turning his film into a cross between a cyberthriller and a love story, using Snowden’s relationship with Mills to inject emotional stakes. Cutting between Snowden in Hong Kong and flashbacks to his past, the film speeds through Snowden’s biography with the help of techno music, snappy explanations of N. S. A. programs and tricky camerawork to build in the tension of surveillance. (There are scenes filmed from the perspective of tiny phone cameras  —   the modern peephole  —   and suggestive   on eye pupils.) But there are also unmistakable  . “I just don’t really like bashing my country,”   Levitt says to Woodley as they stroll past a   era antiwar protest in front of the White House. “It’s my country, too,” Woodley says. “And right now, it’s got blood on its hands. ” Snowden’s N. S. A. boss is unsubtly named Corbin O’Brian, after the antagonist in Orwell’s “1984. ” “Most Americans don’t want freedom,” O’Brian tells Snowden. “They want security. ” Snowden’s many storytellers all tell a similar hero narrative. But if Greenwald’s account is about journalism, Poitras’s is a subtle and artful character study and Kucherena’s is an attempt at the Russian novel  —   a man alone in a room, wrestling with his conscience  —   Stone’s is the explicit blockbuster version, told in high gloss with big, emotional music and digestible plot points that will appeal to mass audiences. As Wizner wisely anticipated, it is the narrative most likely to cement Snowden’s story in Americans’ minds. Snowden declined to comment for this article, but Stone told me he had seen the film and liked it. At a screening at   Con a few months later, Snowden would beam in via satellite to give his somewhat wary approval. “It was something that made me really nervous,” he said of Stone’s film. “But I think he made it work. ” As Stone intended, Snowden shows up at the end of the film. He appears in a   paneled room in Kucherena’s dacha, a modest,   looking space, with little to see except a vase of flowers and some curtains in the background. The Snowden who speaks is not the stoic version, but one who manages to deliver a   caliber movie line. “I no longer have to worry about what happens tomorrow,” he says, “because I’m happy with what I’ve done today. ” Just before the screen fades to black, Snowden is shown gazing toward a window, a faint, inscrutable smile on his face. By this summer, whatever anxieties there may have once been seemed to have dissipated. With the film completed, Stone would officially beat Sony’s project. Open Road, the distributor he was worried about, had won an Oscar for “Spotlight. ” After “Snowden” earned similar marks to that film during test screenings, everyone seemed optimistic, if a little surprised. “At first I thought there must be something wrong,” said Borman, who told me that he hadn’t seen such high scores in 25 years. Open Road had pushed for a fall release, placing it firmly among Oscar contenders. (“Snowden” will open in theaters on Sept. 16, the day after Stone’s 70th birthday.)   Levitt was so moved by Snowden’s story that he donated most of his salary from the film to the A. C. L. U. and used the rest to collaborate with Wizner on a series of videos about democracy. Wizner was preparing to petition Obama to grant Snowden a presidential pardon in the fall, and he hoped Stone’s film would help transform the public’s perception of his client. Kucherena, meanwhile, had turned “Time of the Octopus” into a trilogy  —   in the sequel, the N. S. A. sends an assassin to Russia to “eliminate” Joshua Cold. He hoped to come to the United States for the premiere of the film, in which he has a cameo as a Russian banker who encounters Snowden at a party. “If I can get a visa, why not?” he said. In July, Stone and Wizner joined forces for an A. C. L. U. event. The evening was billed as a conversation with Wizner about surveillance and Edward Snowden, with Stone hosting at his   style home in the Brentwood neighborhood of Los Angeles. As several dozen West Coast supporters of the A. C. L. U. filtered into Stone’s backyard, the director sat camped out on a bench by the pool, taking the party in from a distance. He boasted that he had recently cut four more minutes from the film, bringing the run time to a lean 134 minutes. I asked if he would keep finessing until the end. “No, it’s over,” he said. “This is it. Now I die. ” Wizner roamed around, inspecting a meditation gazebo outfitted with a large gold Buddha. After several people inquired who was playing him in the movie, the lawyer came up with a pithy reply. “Kevin Spacey, reprising his role as Keyser Soze,” he joked. “The guy behind the guy behind the guy  —   hiding in plain sight. ” (Wizner is not a character in Stone’s film.) That week, NPR ran an interview with a Russian security official who posited that Snowden is maybe, probably, most definitely cooperating with Russian intelligence. This inevitably set Wizner off. “Of course, this is the same week that Snowden is blasting Putin on Twitter every day,” Wizner said to Borman, who nodded along. The producer suggested that Snowden’s critics would claim it’s a cover. “That’s what they say!” Wizner said. “This is preapproved criticism so that it’ll seem like he’s free, but actually Putin is the master pulling the strings. ” Eventually, everyone moved to the den, a spacious, brightly lit room filled with family photos. Matthew Weiner, the “Mad Men” creator, took a seat by a stack of DVDs, which included multiple seasons of his own hit TV show. Others arranged themselves along wicker chairs that lined the room’s perimeter. The whole thing had the feeling of a P. T. A. meeting, but without the stale cookies. Wizner got up and spoke for some time about his efforts as Snowden’s lawyer. As he opened the room to questions, someone asked how long Russia could be relied on to keep Snowden safe. Wizner turned the question over to Stone. “Oliver is the Russia expert,” he said with a hint of   aggression. Since completing “Snowden,” Stone had become absorbed in his newfound interest in Russia and announced that he was making a documentary about Putin. In recent months, he had accompanied the Russian president to a theater performance and a World War II Victory Day parade in Moscow. “He represents a different point of view that Americans don’t want to hear,” Stone had told RIA Novosti, a Russian news service. When someone else asked about Stone’s experience of making “Snowden,” his answer was despondent. “It was really a horrible experience in every way,” he said. Everyone laughed except for Stone. As the guests dispersed, Wizner lingered in the foyer, admiring Stone’s art collection depicting important and mostly dead men. He thought that a print of   Sartre looked like Steve Buscemi and that a   looking Beethoven was actually Stone. On the opposite wall was a sketch of Genghis Khan, the feared Mongolian emperor. Stone called him a liberal. “Yes, Genghis Khan  —   misunderstood,” Wizner teased. Stone smiled and cocked his head. “Listen, the A. C. L. U. should defend him!”'"}, "time": 1742561691.7896042}