{"duration": 0.055400848388671875, "input_args": {"text": "'President Donald Trump met with a group of conservative media reporters, columnists, and radio hosts to discuss his first 100 days as president, speaking about trade issues, foreign policy, and infrastructure spending. [Representatives from Breitbart News were present for the event.  The event was billed as a reception, as White House aides and members of the press office mingled with about   individuals from conservative media outlets to discuss Trump’s first 100 days and issues of importance. But the event turned into an impromptu press conference after the president entered the room flanked by senior advisers Reince Priebus, Steve Bannon, and Jared Kushner. At one point economic advisor Gary Cohn peered in the door to view the event. White House press secretary Sean Spicer was also present, as Trump held a discussion, which the White House press staff put on the record afterwards. Conservative journalists asked Trump policy questions  —   particularly about trade foreign affairs in North Korea, Iran, and Syria and social policy. Trump announced that he wanted to levy a 20 percent tax on Canadian soft lumber and suggested he wanted to address milk imports as well. “It means we’re going to start doing lumber in our country, it’s going to mean that farmers are going to start selling milk in our country,” Trump said. A senior administration trade official said that the issue was a “long simmering problem” with Canada, accusing them of charging lumber companies low subsidized rates. “We love Canada, wonderful people, wonderful country, but they have been very good about taking advantage of us through NAFTA,” Trump said. Trump said that he would explore allowing more logging on federal lands with the Department of Interior and the Environmental Protection Agency. “We’re actually having some of those horrific fires because this stuff is sitting there, virgin stuff for so long, and it’s in very bad shape,” he said. Trump seemed to think that Syrian dictator Bashar   would not use chemical weapons again. “Wait and see if he uses them again, OK?” he said, adding that the Obama administration was wrong about Syria getting rid of their chemical weapons. “That turned out to be false,” he said. “They duped the Obama administration. ” Trump continued to highlight the problems with North Korea but remained elusive about what he was planning to do in the country. He mused that North Korea’s dictator Kim   was probably not as strong militarily as he appeared. “I’m not so sure he’s so strong like he says he is I’m not so sure at all,” he said. Trump criticized modern presidents for not acting decisively on the North Korea threat. “This should have been done by Obama and it should have been done by every president since, really, Clinton,” he said, referring to the former president’s memoirs. He also discussed the ongoing crisis of persecuted Christians in the Middle East. “Nobody’s been treated worse, it seems to me, than Christians in the Middle East,” he said, arguing that it was easier for Muslims to come into the United States as refugees than Christians, although it was far more dangerous there for Christians. “We’re going to be helping the Christians big league,” he said. Trump defended his plan to spend big on infrastructure, pointing out that the United States spent $6 trillion in the Middle East with little to show for it. “I tell you what we got, it’s 20 times worse than it first was when we first started bombing the hell out of Iraq,” he said. “Iraq was thrown in the hornets nest and it’s a disaster, far worse than anybody understands. ” Trump said he wanted to spend $1 trillion on building new infrastructure and repairing existing infrastructure projects like bridges, roads, and airports. When asked if he still believed DACA was illegal, Trump demurred, instead focusing on his efforts to crack down on   gang members. “We’re getting rid of people, and people in towns, they’re cheering. These are rough people,” Trump said, saying that DHS Secretary Gen. John Kelly called   members as bad as  . “We have people that came into this country that should have never ever in a million years been allowed into this country. ”'"}, "time": 1742562957.4738348}