{"duration": 0.1480574607849121, "input_args": {"text": "'By Sarah Jones on Sat, Oct 29th, 2016 at 12:03 pm Donald Trump uses sexual shaming and humiliation of women as simplistic revenge for the slightest felt spurn. A newly surfaced video via Ryan Grim shows the Trump Humiliation game in action, which I walk everyone through from the POV of the woman. Share on Twitter Print This Post \\nIf you’re a woman who’s worked in any business where you’re forced to try to appease the massively sensitive ego of a sexually aggressive, vulgar man in power, you will know exactly what’s about to happen in this video. \\nDonald Trump uses sexual shaming and humiliation of women as simplistic revenge for the slightest felt spurn. And there’s a newly surfaced video via Ryan Grim at Huffington Post that shows the Trump Humiliation game in action. \\nIn the video, Trump publicly sexualizes and shames the 2004 Miss Universe winner from Australia, Jennifer Hawkins as revenge. Before he does it, Trump tells the audience, “Get even with people. If they screw you, screw them back 10 times as hard. I really believe that.” \\nWatch this newly surfaced 2011 corporate speech here via Huffington Post (major trigger warning if you’ve been there): \\nWatching this you see the Trump modus operandi in action. This is the sting felt by numerous women who report spurning Trump’s advances. The harassment as revenge. The sexual shaming. \\nTrump sets the audience up for the Roman Gladiator moment of public sexual offering by priming them with his belief that you should “screw” people back if they “screw” you. The sexually angry verb foreshadows what’s to come, because he is going to “screw” Jennifer Hawkins in public, when she realizes that because it’s public, she can’t further humiliate him by saying no or objecting without facing huge repercussions. \\nTrump says he’s going to give them an example of his revenge theory, “Jennifer Hawkins.” \\nTrump orders Hawkins to the stage. The audience cheers and jeers, delighting in the upcoming shaming of the beautiful girl. It’s to be a public spanking. So much fun. \\n“First of all, how beautiful is Jennifer,” Trump asks, claiming ownership of Jennifer as an object while playing magnanimous daddy who dishes out praise and approval before the spanking. The message: He can make or break her. She better play nice. \\nWarning shot, “This is about getting even.” \\nTrump tells the audience that he was mad at Hawkins because she allegedly dissed him by declining to introduce him at the event in Sydney. He tells the audience how mad he was, and then says, as she’s crossing the stage, “She’s my favorite Miss Universe.” So she thinks maybe this isn’t going to be as bad as she fears. \\nBut then he stabs her publicly for the first time, “But I think I like the new one better.” \\nThe audience loves it. He is going to feed them the sexual humiliation of a beautiful woman because she wasn’t a good girl. She reaches him and they clasp hands while she smiles through the shame knowing she has no choice and wanting to be a good sport. \\nHawkins tries to make light of the situation while appeasing Trump, playing along with his game because she has to, but there will be no easy way out of this one. It won’t be enough to fawn over him in front of the audience. She will have to pay. \\n“I was actually going to get up and tell you that Jennifer is a beautiful girl on the outside, but she’s not very bright,” Trump tells the audience, signaling that Hawkins is a piece of meat to be dissected by him publicly for her refusal to give him anything he asks for. \\n“That wouldn’t have been true, but I would have said it anyway,” Trump proudly tells the audience. This is his alpha male routine, except in real life, the alpha male doesn’t have to abuse money and power he inherited in order to win the girl. But in the mind of little men like Trump, this makes him a winner. \\nTrump points out that Hawkins is a big star now, but he helped her make it and then dissed him. He owns her. She must comply or face his wrath. Hawkins tries to say that she did introduce him, but Trump pushes her away from the microphone. This public shaming will be done from Trump’s POV only. No need for Hawkins to assert her personhood.There will be no defense allowed, because she’s already guilty. \\n“And you know what? She came tonight, she came — came, she came, she came,” Trump says gleefully like the drunk pervy uncle everyone tries to avoid at Christmas. He waits for the audience to join him in his sexual shaming, and they do. They get it. Hee heee. So clever. Came. Knuckles dragging on the floor clever. \\n“See, so they have the same filthy minds in Australia,” Trump says. \\nTrump grabs Hawkins around the waist and forces a kiss on her, just like he bragged about doing on the Bush tape. \\nHawkins reflexively turns away and puts her arm between them. The kiss misses its mark and lands on her cheek. She is hoping this is good enough humiliation for him, but putting her foot down on actual mouth contact. She’s allowed herself to be publicly humiliated to appease him, and pretended to fawn over him as required, but she will not, cannot, allow the kiss. The repulsive kiss. \\nI’m telling this story as I imagine it to be from her point of view, although she has refused to comment. Of course she refused to comment, women are told they will be blackballed if they comment. The world is full of men like Trump, and they stick together. See Roger Ailes. Women have to play along and appease and if that doesn’t work, they have to allow themselves to be sexually assaulted and humiliated just a little bit in public, especially if they said no in private. \\nI can only do this because I have lived it, somewhat like this, in public. And I have tried to appease the ego of the assaulter in order to keep my job, while denying him his assumed entitlement to my body. \\nFrom talking to so many women during this election, I know that I’m not alone. I know that many other women will watch this and know. They will feel the creep of fear and revulsion, the deer in the headlights cringe that takes over when you know that you are about to be humiliated as a sexual object because you refused him or refused to appease the ego of the powerful man in charge by behaving like a sexual conquest. How dare Hawkins have her own life and be unwilling to change all of her plans in order to introduce Trump. \\nAnd other people will watch this humiliation and enjoy it, setting you up to be humiliated even more. They will laugh about it and gossip about it, which is the social punishment women face when they reject a man like Trump. Ironically, if you give in you’re not humiliated. It’s only if you say no that you are set up to be publicly flogged as a sex object. \\nIt’s not just the unwanted kiss, although that is disgusting and assault, much like Donald Trump bragged about doing on the Billy Bush bus tape. It’s the public humiliation and denigration. \\nIt’s the way the woman is forced, in front of thousands of people, to try to smile her way through his ambush of verbal and physical assaults as he takes revenge. \\nIt’s the way she tries to make it okay, to sweet-smooth his ego in order to get out of the line of fire, and in return he shames her by suggesting he made her “come” and then grabs her for an unwanted kiss. \\nIf there is any good to come out of the total crapfest of the Trump candidacy, perhaps it is a raised awareness that women are people, and that this kind of thing is horrific but it’s not all Trump’s fault. It’s the culture’s fault because it takes a willing audience to successfully publicly sexually shame a woman. \\nIn fact, this is shades of what Trump did to Hillary Clinton in the stalking debate, after which he announced that looking at her from behind he was not impressed. \\nNeither are we by you, Mr. Trump. Neither are we.'"}, "time": 1742563951.979467}