{"duration": 0.04784703254699707, "input_args": {"text": "'Big Cannabis – on the lines of Big Pharma – is on the cards. At least that’s what Germany-based pharmaceutical giant Bayer’s $66 billion takeover of America-based agrichemical giant Monsanto (a leading producer of RoundUp Ready genetically modified crops) indicates. Financed from a consortium of corrupt, in-debt, and influential banks (including Goldman Sachs, HSBC, JP Morgan, and Bank of America), the multi-billion-dollar deal (negotiated by the Rothschild Banking Cartel) brings Bayer ( famous for selling heroin to children and financing Nazi concentration camps ) closer to the multi-billion-dollar cannabis market through its ”mission” to create a one-stop shop for seeds, crop chemicals and computer-aided services to cannabis growers .\\n#Cannabis is Non Toxic but #Monsanto will make it toxic by making a GMO version. #SaveCannabis #VoteNoOn64\\n— David (@rskls) September 6, 2016\\nCannabis proponents believe the largest all-cash deal on record will destroy the infant marijuana industry by introducing genetically modified cannabis seeds, highly expensive cannabis-based drugs, monopolistic use of patents, and restrictive business practices. Leafly notes:\\n“The worry is that the combined firm will have the financial and political influence to do to cannabis what it has already done to corn, tobacco, and other cash crops — namely, use pricey patented cannabis seeds (Roundup Ready Blue Dream, anyone?) that favor large-scale operators and rigidly control how all cannabis farmers farm. The merger, in other words, could be the first step toward Big Cannabis .”\\nMonsanto’s decades old intimate ties with the Scotts Miracle-Gro Company — a leading producer of pesticides for commercial and consumer lawn and garden use (who was ordered to pay $12.5 million in criminal fines and civil penalties for violations of Federal Pesticide Laws in 2012) — is especially a matter of concern. Monsanto and Scotts Miracle-Gro have long been partners with the DEA to produce hormones and carcinogenic chemicals used in the wars against marijuana and coca plants.\\nJim Hagedorn, who took over Scotts Miracle-Gro in 2001, shared his intention to “invest, like, half a billion in the pot business” with Forbes in July, calling cannabis the biggest thing he has ever seen in lawn and garden. Forbes reports:\\nScotts Miracle-Gro shelled out $135 million last year on two California-based businesses [including the $130 million buyout of General Hydroponics] that sell fertilizers, soils and accessories to pot growers. It recently spent another $120 million on a still-undisclosed lighting and hydroponics equipment company in Amsterdam and promises to invest about another $150 million by the end of 2016.\\nAltogether, the deals are bigger than the largest single acquisition in the history of Scotts Miracle-Gro, which takes in $160 million of profit on $3 billion in sales annually.'"}, "time": 1742562012.134905}