{"duration": 0.08911561965942383, "input_args": {"text": "'The price of hubris has set in.\\nAfter years of assuming an easy victory in 2016, Team Hillary is taking the heavy toll as reality is setting in.\\nHuman Abedin, under her own set of scandals after the brutal email-centric campaign, was seen breaking down in tears as she carried dry cleaning through Manhattan in New York.\\nClearly, the campaign is not taking their failure to secure total power very well at all. Right now they are in the grieving phase.\\nThis image captured by Daily Mail photographer Jae Donnelly tells it all – actually, there are many angles and snaps of this priceless moment at the Daily Mail :\\n\\nAccording to the Daily Mail :\\nHillary Clinton’s closest aide Huma Abedin wept openly in the street on Friday as she returned to the place where the Democratic candidate’s campaign was fought – and lost. \\nAbedin looked like she had the weight of the world on her shoulders as she visited the campaign headquarters of the failed presidential candidate – after her own stumbles and her husband’s sexting habits helped contribute to Clinton’s historic defeat.\\n[…] The pain and emotion of the situation were clearly visible on the face of the long-time loyalist, despite the dark large-frame sunglasses that covered her eyes. \\nEvidently, her breakdown was triggered by a text message, as the Daily Mail notes:\\n“Abedin appeared to start weeping after she read a message on her mobile phone as she made her way to the Brooklyn headquarters.” \\nIt is thought that Huma feels guilty for the campaign’s defeat, as the last minute FBI investigation into Hillary just before election week was largely due to the 650,000 emails found on her husband’s laptop, himself under fresh investigation for allegedly misdeeds involving underage girls. Regardless of the merits of either of the investigations, it may have taken Hillary down a final peg, just enough for Donald Trump to win the presidency.\\nThough Huma is taking it quite hard, she is hardly the only one upset.\\nHillary Clinton herself has been reportedly crying inconsolably, and cycling through systematic blame against her surrogates and opponents, while lamenting her own loss of what is, no doubt, ‘rightfully’ hers.\\nAs SHTF reported, it was the primary reason why she did not make an appearance on election night:\\nAccording to Ed Klein who spoke with a close friend and confidante of Hillary, that she did, in fact, have a serious breakdown and was in no condition to speak to America on live television.\\nThe shock of losing after having been a “98%” lock for the Presidency was simply too much to bear. And as you might expect from a Clinton, it was everybody else’s fault: \\nShe was crying inconsolably. She couldn’t stop crying. And her friend, her female friend from way, way back said it was even hard to understand what she was saying she was crying so hard… her friend said she could make out that she was blaming James Comey, the Director of the FBI, for her loss, and, I don’t understand exactly, the president of the United States for not doing enough. ( Via Gateway Pundit) \\nThe question is, did Hillary really cast the bulk of blame on the loyal aide who is typically more closely at her side than even her daughter or husband?\\nHillary has a notoriously dark reputation for (allegedly) throwing objects at the former president , castigating her staff and surrogates and demeaning the general public and even her own supporters .\\nWe can only imagine how bad she took her rage and despair about the big loss on Huma.\\nRead more: We Finally Know Why Hillary Disappeared On Election Night: “She Was Crying Inconsolably… It Was Hard To Understand What She Was Saying She Was Crying So Hard” “She Was In Full Meltdown”: Hillary Unleashed On Donna Brazile For Unapproved Debate Question \\nEvidence Surfaces That “DNC Chair Fed Questions to Hillary Campaign in Advance” \\nMake No Mistake: “Everyone Who Is Warning About Clinton Is A Target and They Are Marked” \\nMedia Faces Blowback From Clinton Worship: “They Bet the Farm on Hillary… And Lost” \\n'"}, "time": 1742564172.0912423}