{"duration": 0.06726884841918945, "input_args": {"text": "\"When Stalinist monsters bestow their blessing. November 3, 2016 Humberto Fontova \\n“It’s Hillary’s hour!...The only hope of defeating Donald Trump is Hillary Clinton…the difference between the two candidates is vast. Barack Obama did not exaggerate when he claimed that she was better prepared to be a U.S. President than even he was—or was her husband Bill Clinton.” (Stalinist Cuba’s KGB-founded and mentored media organ Cubadebate, Oct. 15, 2016.) \\nThere was a day when winning a ringing endorsement from communist mass-murdering, terror -sponsors who craved (and came within a whisker) of nuking your nation would NOT be considered an asset for a U.S. Presidential candidate. \\n“ In any nation of the world–and even in the U.S. during normal times–Donald Trump would find himself either in prison or in a mental institution!” \\nThere was a day when being threatened with prison and torture (even figuratively) by an enemy Stalinist regime that jailed and tortured political prisoners (many of them U.S. citizens) at a higher rate than Stalin during the Great Terror would be considered an enormous asset for a U.S. Presidential candidate. \\nBut the ringing communist endorsement for Hillary Clinton gets even “better:” \\n“ Hillary Clinton is our only hope of detaining barbarism!” \\nSo warns the eunuch scribe for a totalitarian regime that murdered more Cubans in its first three years in power than Hitler murdered Germans during his first six– and in the process converted a highly-civilized, immigrant-swamped nation into a slum/sewer with the Hemisphere’s highest suicide rate, which is ravaged by tropical diseases, where tens of thousands have died trying to escape, where alley cats constitute a delicacy and where ox-carts represent luxury transportation. \\n“On a few occasions Trump has even suggested the assassination of Hillary Clinton!” \\nSo warn the notorious assassins of suddenly inconvenient colleagues ranging from Camilo Cienfuegos to Tony De la Guardia to Manuel “Barbarroja’ Pineiro. Yes, the Castro regime “devoured its own children” even more voraciously than even Lenin and Stalin’s. \\n“The news are dominated by revelations—some on video—showing Trump’s obscenity and male chauvinist conduct—along with his treatment of women as sex objects!” \\nSo warns the Stalinist regime that jailed and tortured 35,150 Cuban women for political crimes, a totalitarian horror utterly unknown in the Western Hemisphere until the Castro brothers and Che Guevara took power. Some of these Cuban ladies suffered twice as long in Castro’s Gulag as Alexander Solzhenitsyn suffered in Stalin’s. \\nTheir prison conditions were described by former political prisoner Maritza Lugo. “The punishment cells measure 3 feet wide by 6 feet long. The toilet consists of an 8 inch hole in the ground through which cockroaches and rats enter, especially in cool temperatures the rat come inside to seek the warmth of our bodies and we were often bitten. The suicide rate among women prisoners was very high.” \\nOn Christmas Eve of 1961 a Cuban woman named Juana Diaz Figueroa spat in the face of the executioners who were binding and gagging her. Castro and Che Guevara's KGB-trained secret police had found her guilty of feeding and hiding “bandits” (Cuban rednecks who took up arms to fight the Stalinist theft of their land to build Soviet–style Kolkhozes.) When the blast from Castroite firing squad demolished her face and torso Juana was six months pregnant. \\n“They started by beating us with twisted coils of electric cable,” recalls former Cuba political prisoner Ezperanza Pena from exile today. “I remember Teresita on the ground with all her lower ribs broken. Gladys had both her arms broken. Doris had her face cut up so badly from the beatings that when she tried to drink, water would pour out of her lacerated cheeks.” \\n“On Mother’s Day they allowed family visits,” recalls Manuela Calvo from exile today.” But as our mothers and sons and daughters were watching, we were beaten with rubber hoses and high-pressure hoses were turned on us, knocking all of us the ground floor and rolling us around as the guards laughed and our loved-ones screamed helplessly.” \\n“When female guards couldn’t handle us male guards were called in for more brutal beatings. I saw teen-aged girls beaten savagely, their bones broken, their mouths bleeding ,” recalls Polita Grau. \\nThousands upon thousands of Cuban women have also drowned, died of thirst or have been eaten alive by sharks attempting to flee the regime founded by the folks who recently endorsed Hillary Clinton. This from a nation formerly richer than half the nations of Europe and deluged by immigrants from same. \\nRemember how Donald Trump was taken greatly to task by the media for not quickly repudiating David Duke’s (so-called) endorsement? \\nWell, we certainly look for the media to take Hillary Clinton similarly to task for not instantly repudiating the endorsement of mass-jailing, mass-torturing, mass-murdering Stalinists. \\nAfter all, recalling the “sticks and stones can break my bones” riddle of our childhood, David Duke’s crimes” consist of words (“hate-speech.”) Whereas the (literal) sticks, stones--and chains, manacles, bullwhips and bullets--of the fine folks so enthusiastically endorsing Hillary Clinton have caused untold suffering to hundreds of thousands of people.\""}, "time": 1742628351.2141924}