{"duration": 0.09420299530029297, "input_args": {"text": "'  Donald J. Trump dismissed Meryl Streep as “a Hillary lover” early Monday morning after the actress, in a speech at the Golden Globes award ceremony, denounced him as a bully who disrespected and humiliated others. Mr. Trump, in a brief telephone interview, said he had not seen Ms. Streep’s remarks or other parts of the Globes ceremony, which were broadcast on NBC, but he added that he was “not surprised” that he had come under attack from “liberal movie people. ” [ Read Meryl Streep’s Golden Globes speech ] The Globes were the last   Hollywood event before Mr. Trump’s inauguration on Jan. 20, a transfer of power that many in the entertainment industry have bemoaned. While   comments at the Globes were relatively restrained, Ms. Streep, one of the most outspoken progressives in the film world, mounted a powerful critique of Mr. Trump’s abilities as a performer, complimenting in a backhanded way a style of showmanship that she all but called insidious. “There was one performance this year that stunned me  —   it sank its hooks in my heart,” Ms. Streep said. “Not because it was good there was nothing good about it. But it was effective and it did its job. It made its intended audience laugh, and show their teeth. “It was that moment when the person asking to sit in the most respected seat in our country imitated a disabled reporter,” she said, referring to a speech by Mr. Trump in 2015 when he shuddered and flailed his arms, seeming to mock a disabled reporter for The New York Times. “It kind of broke my heart when I saw it, and I still can’t get it out of my head, because it wasn’t in a movie. It was real life. ” Mr. Trump, as he has done many times before, grew heated in the interview as he flatly denied that he had intended to make fun of the Times reporter, Serge F. Kovaleski. “I was never mocking anyone,” Mr. Trump said. “I was calling into question a reporter who had gotten nervous because he had changed his story,” arguing that the reporter had been trying to back away from an article he wrote in September 2001 about the terrorist attacks on the World Trade Center and elsewhere that month. “People keep saying I intended to mock the reporter’s disability, as if Meryl Streep and others could read my mind, and I did no such thing,” he said in the interview. “And remember, Meryl Streep introduced Hillary Clinton at her convention, and a lot of these people supported Hillary,” Mr. Trump said, referring to Ms. Streep’s remarks at the Democratic National Convention last summer on behalf of his opponent, Mrs. Clinton. Later Monday morning, Mr. Trump, in a series of tweets, called Ms. Streep “one of the most   actresses in Hollywood,” and “a Hillary flunky who lost big. ” He also reiterated his argument that he had not mocked the reporter “but simply showed him ‘groveling. ’” Ms. Streep’s artful denunciation of Mr. Trump  —   whom she never mentioned by name  —   drew applause from many other actors at the Globes ceremony, but also attacks online from the  ’s allies, like Sean Hannity, as well as some Republicans, like Meghan McCain, who are critical of Mr. Trump but see Hollywood liberals as only emboldening his supporters. Ms. Streep’s speech did not seem intended to win people over  —   she spoke dismissively of football and mixed martial arts at one point  —   but rather to voice frustration and anger before Mr. Trump’s inauguration. “This instinct to humiliate, when it’s modeled by someone in the public platform, by someone powerful, it filters down into everybody’s life, because it kind of gives permission for other people to do the same thing,” she said in her remarks. “Disrespect invites disrespect, violence incites violence. And when the powerful use their position to bully others we all lose. ” Mr. Trump said that, Ms. Streep and her allies aside, he was confident that celebrities and others would turn out in strong numbers for his inauguration. “We are going to have an unbelievable, perhaps   turnout for the inauguration, and there will be plenty of movie and entertainment stars,” Mr. Trump said. “All the dress shops are sold out in Washington. It’s hard to find a great dress for this inauguration. ”'"}, "time": 1742564444.1245966}