{"duration": 0.09417891502380371, "input_args": {"text": "'RIO DE JANEIRO  —   Portugal’s education minister was robbed at knife point. So was the chief of security for the opening ceremony as he left Olympic Stadium. A police officer was killed when his vehicle was sprayed with gunfire, and an Olympics bus carrying journalists was attacked by people throwing rocks. Even before the armed robbery this weekend of four American swimmers, including the gold medalist Ryan Lochte, a series of crimes had drawn attention to Brazil’s shortcomings in providing security for the Olympic Games in Rio de Janeiro. But for many in this   city, a bigger question remains: What will happen after the Games? To thwart crime around the Olympics, Brazil has mobilized a security juggernaut in Rio twice the size of the one used for the London Games in 2012. Mindful of Rio’s reputation for violent crime, the Brazilians have deployed 85, 000 security personnel. This show of force includes 23, 000 soldiers patrolling the city, some in military vehicles, along with helicopters and warships looming around the city’s most popular beaches. “The city has never felt so safe,” said Gilberto Dias, 50, a hot dog vendor who described how plainclothes officers had sprung to action one morning last week after two muggers accosted a tourist in the upscale Copacabana neighborhood. “They just materialized out of nowhere, which is something I’ve never seen before. ” But even before the Games began, Rio was facing a surge in lawlessness in recent months that had rattled residents and alarmed the authorities. With the economy in turmoil, assaults and robberies on the street jumped by 42 percent in May, with 10, 000 robberies that month. And after years of declining homicides, the number of murders increased by more than 7 percent during the first half of the year, with over 1, 500 people killed. As dread persists over street violence and gun battles rage in Rio’s favelas, some Brazilians worry about what will happen in the aftermath of the Games, when the soldiers are withdrawn and the city is left on its own to grapple with a financial crisis. “The assault on the American athlete is what happens to us in Rio every day,” said Marcello Brito, 51, an architect, referring to Mr. Lochte. Rio’s finances were so bad before the Games that it had declared a “state of calamity. ” Budgets had been gutted, with police officers and firefighters protesting delays in receiving pay by holding signs at the airport telling visitors, “Welcome to hell. ” The federal government responded with an $850 million bailout package to help the state of Rio de Janeiro stay afloat, pay salaries and keep essential services running during the Olympics. But the crisis in Rio’s finances, which are heavily dependent on global oil prices, remains, and the security lapses threaten to undermine ambitions for a resurgence in the city’s fortunes. The authorities invested billions of dollars in sports venues, transit systems and   pacification projects in poor urban areas, arguing that the Olympics would serve as a linchpin in overhauling the city. In the weeks before the Games, Mayor Eduardo Paes even contended that Rio would be “the safest city in the world. ” Many residents have welcomed the increased security. “It’s nice to see soldiers patrolling the streets, at least where I live,” said Cassius Almada, 39, a high school math teacher who lives in Copacabana. “It could be a lot worse. ” But those living beyond the necklace of upscale seafront neighborhoods say the increased security has had little effect in communities that have long been troubled by violence. Maria do Rosário Silva Santos, 54, who was visiting Rio from Brasília, the nation’s capital, said she had been stunned to see young men  —   not police officers  —   toting guns casually in Acari, a   neighborhood in north Rio, where she was staying during the Games. “It was shocking to see,” she said. “As far as I can tell, nothing has changed. ” Some security experts emphasized that considerable risks persisted around the city, especially in favelas, the poor areas that generally emerged as squatter settlements and that are still controlled by drug gangs. Because of Rio’s financial crisis, plans fell apart to establish a network of policing outposts in Maré, one large area of favelas. Julita Lemgruber, the director of the Center for Studies on Public Security and Citizenship at Candido Mendes University in Rio, said it was naïve to expect a drastic drop in crime during the Games. “The government thought a snap of their fingers would bring peace to a city that has lived through so much violence in the past few years,” she said. “It doesn’t do any good to have this show of thousands of extra police unless you tell every Olympic athlete to walk the street with a policeman by his side. ” The Olympics, she said, had actually increased bloodshed  —   but only in the vast favelas, where the police have been battling militias and drug gangs. In Complexo do Alemão, a large group of favelas, a   of gun battles since the start of the Olympics has left at least two residents dead and two police officials wounded. “Police forces are invading the favelas every day and killing people, which is outrageous,” Ms. Lemgruber said. “How can anyone hope to bring peace by spreading violence?” Heder Martins de Oliveira, the vice president of Brazil’s National Association of Police Officers, said that the killing of the officer in Rio last week pointed to the risks that security forces faced daily in the city. Referring to the wave of armed assaults during the Games, he said, “The situation would be even worse, an international disgrace, if dedicated police weren’t doing their job at this time. ” “Of course, there’s more attention to these episodes because they’re taking place when the world is looking at Rio,” Mr. Martins de Oliveira said. “But this is a dilemma that Rio faces on a daily basis. ” The police have also been involved in violent episodes blemishing the Olympics. Over the weekend, an   federal police official opened fire in the direction of a man he was brawling with at Rio Scenarium, a downtown nightclub. It was not clear whether anyone was seriously injured. Amid the surge in lawlessness, many residents have found a measure of solace on social media, where they commiserate about their experiences and document each episode of crime in hopes of spurring the authorities to action. Among dozens of Facebook groups focused on crime is “Where I was robbed,” a   map containing dots that form a road map of brutalization and despair. “Hello, hello, authorities!” one Facebook user, Eliane Cattapan, wrote recently. “With the arrival of all the tourists, I’m much more afraid of the rise in street crime than terrorism. ”'"}, "time": 1742561757.0639262}