{"duration": 0.09357261657714844, "input_args": {"text": "'The leader of the Republican Study Committee chose to remain outside the conservative coalition fighting Speaker Paul Ryan (R. ) and his American Health Care Act, which amends the 2010 Patient Protection and Affordable Care Act so as to stabilize insurance company margins. [“We’re a yes and we’re excited to be there,” said Rep. Mark Walker (R. ) the chairman of the RSC. Founded in the 1970s, the RSC was the conservative bloc in the House of Representatives, until the   session of Congress, when Speaker John Boehner (R. ) pressured members to support moderate Rep. Steve Scalise (R. ). Under Scalise, the RSC was incorporated into the House GOP leadership’s own whip system.  Walker spoke at the White House Thursday after meeting with President Donald Trump at the White House flanked by Rep. Mia Love ( ) Rep. Marsha Blackburn (R. ) and other Republican congressmen, including Scalise, who is now the GOP’s Majority Whip. “We appreciate the opportunity to discuss with the president the best ways forward to repeal and replace Obamacare,” Walker said. “For over six weeks, we’ve been working with the White House, House leadership, congressional committees and members of the Republican Study Committee to address conservative concerns and make the bill better for the American people,” he said. “Based on our conversations with the president, several measures to improve the bill will be added in the final product,” he said. Walker said the president agreed that the RyanCare bill would be amended before it reached his desk to create a work requirement for   Medicaid recipients without dependents and remove provisions in the Ryan bill that would have allowed tax credits for abortions. “On balance and with the changes we agreed to in the bill’s final text, I can vote for it,” he said. “We will continue working to advocate changes to the bill, and hope the legislation improves in the Senate. At the end of the day,” Walker said, “we are all committed to repealing Obamacare. ” The RSC has a membership of more than 170 members, which would make it the most powerful militia on Capitol Hill, but its own membership is now so diverse across ideological lines that it rarely votes as a bloc. Before Scalise took over the RSC, Rep. Jim Jordan (R. ) tried to lead the committee as the conservative bloc in the House, but when he ran afoul of Boehner, he was turned out in favor of Scalise. This was the immediate reason why Jordan founded the House Freedom Caucus. As of this publication, the House Freedom Caucus, along with random libertarian congressmen and House Republicans from liberal districts, have the votes to block the RyanCare bill when it comes up for a vote scheduled for Thursday. The HFC does not release its whip count, but a Capitol Hill source familiar with the whip count told Breitbart News that the HFC still has the votes to defeat the bill, if the Democrats also vote against the bill. There are 237 Republicans and 193 Democrats in the House. With five vacancies, Speaker Ryan needs 216 votes to pass his Obamacare amendment, but if 21 HFC Republicans hold the line, the bill fails. If the bill fails, which is still a very strong possibility, members of the House Republican Conference are going to have to not only figure out what to do next about their promise to repeal and replace Obamacare, they are also going to have to decide if Ryan is still the man to be holding the gavel. The same votes needed to defeat RyanCare are enough to pass a motion to vacate the chair and force out Ryan the same way conservatives forced out Boehner. Watch Rep. Mark Walker (R. ) make remarks about his support of RyanCare in a video posted by House GOP Whip’s office: '"}, "time": 1742563247.9193723}