{"duration": 0.0816030502319336, "input_args": {"text": "'Posted on September 13, 2016 by Dr. Eowyn | 19 Comments \\nScott Adams is creator of the Dilbert comic strip. According to his self-description, Adams is also a hypnotist of many years, trained in observing people and subtle nuances in appearance and body language. \\nBelow is Adams’ post of September 11, 2016, “ Checking My Predictions About Clinton’s Health ,” which was republished by Russia Insider : \\nIn a blog post I wrote on December 27th , 2015, I said this… \\nBonus Thought 1: One of the skills a hypnotist has to master is reading people’s inner thoughts based on their body language. That’s a common skill for people in the business world too, but hypnotists go deeper than looking at crossed arms and furrowed brows. We learn to look for subtle changes in breathing patterns, tiny changes in muscle tone, variations in skin color (blushing or not), word choice, pupil dilation, and more. I assume law enforcement people look for similar tells when doing interrogations. \\nAs regular readers know, I’m a trained hypnotist. And to me, Hillary Clinton looks as if she is hiding a major health issue. If you read Malcolm Gladwell’s book, Blink , you know that so-called “experts” can sometimes instantly make decisions before they know why . In my case, I am going to make an “expert” hypnotist prediction about Hillary Clinton without knowing exactly which clues I am picking up, or whether I am hallucinating them. \\nPrediction: I’ll put the odds at 75% that we learn of an important Clinton health issue before the general election. That estimate is based on my own track record of guessing things about people without the benefit of knowing why . I think Trump is picking up the same vibe. He has already questioned Clinton’s “stamina.” \\nOn December 29th, 2015 I blogged that Trump would be seen as “running unopposed” before election day. I mentioned Clinton’s health as a possible reason. \\nWhile I’m on the topic, I’ll add another prediction to the Master Persuader series. I predict that by the time Trump is in the general election and running against Clinton, you will start hearing that Trump ( Lucky Hitler) is – for all practical purposes – “running unopposed” as Clinton’s poll numbers plummet. \\nThat can happen in a variety of ways. One way is if Clinton’s health or legal issues rise to the point of being disqualifying, and Trump persuades us to think about those things more than we think about anything else. Once you imagine there is one candidate in the race who is eligible and one who might not survive the term, or might be in jail, you start to imagine it as a one-person race. \\nAnd you will. That’s how you get a landslide. \\nLook for the words “running unopposed” in pundit articles and quotes within a few months of election day. And it still counts if it started here, because it won’t catch on unless it actually fits. \\nOn April 29th of 2016 I expanded on the thought in this post . \\nI have blogged and tweeted that Hillary Clinton looks unhealthy to me. And I have mentioned on Twitter that one of the skills of a hypnotist is identifying subtle bodily changes. Observation is a huge part of a hypnotist’s skill. You look for micro changes in muscle tone, breathing, posture, and anything else that can tell you whether your technique is working or you need to quickly pivot to a new approach. Think of it as rapid A-B testing on humans. And like any skill, one gets better with practice. I have more than three decades of practice for this specific skill. \\nWhat I see in Clinton’s health is an unusual level of variability. Sometimes her eyes bug out, sometimes they are tired and baggy. Sometimes she looks puffy, sometimes not. It would be easy to assume fatigue is the important variable. And that is clearly a big factor. But notice that the other candidates have little variability in their physicality. Trump always looks like Trump. Cruz always looks like Cruz, and so on. Sometimes we think we can detect fatigue in their answers, but visually the other candidates appear about the same every day. \\nClinton, on the other hand, looks   That suggests some greater variability in her health. And that’s probably a tell for medications that are waxing and waning but rarely at the ideal levels. Or perhaps the underlying conditions have normal variability. Or both. \\nUnder normal circumstances it would be deeply irresponsible for a cartoonist to give a medical diagnosis to a stranger he hasn’t met. I trust you to ignore my medical opinions. I do this to build a record of my persuasion-related predictions and to show you the method. \\nI give Clinton a 50% chance of making it to November with sufficiently good health to be considered a viable president. Judging from her performance on the campaign trail, she is managing her health effectively to get the job done. But I would think most people who run for president end up sacrificing their health in some measure. The big question is how much buffer she has left. \\nTo be clear, there is no dependable evidence of Clinton having an undisclosed major health issue. But it looks that way to observers. \\n~End of Scott Adams’ article~ \\nH/t FOTM’s josephbc69'"}, "time": 1742563957.7409377}