{"duration": 0.10233211517333984, "input_args": {"text": "'LONDON  —   Ecuador and Sweden have agreed to allow Julian Assange to be questioned by Swedish prosecutors inside the Ecuadorean Embassy in London, in a possible breakthrough to a   impasse, Ecuador said on Thursday, but no date for the interview was announced. The Ecuadorean attorney general delivered a document agreeing to a request by the Swedish prosecutor to question Mr. Assange, the founder of WikiLeaks, who is wanted by Sweden for questioning to respond to allegations of rape made against him, accusations he denies. Mr. Assange was granted political asylum by Ecuador in 2012 after his appeal against extradition to Sweden was denied, and he has been confined to the embassy ever since. He says he fears that if he is sent to Sweden, he will then be shipped to the United States, where he could be charged with espionage offenses. WikiLeaks has published damaging and confidential information from the United States and many other governments, and recently, Mr. Assange and the organization attracted attention after the distribution of hacked emails from the Democratic National Committee and his statements criticizing Hillary Clinton, the Democratic presidential nominee. Although there is no open indictment against Mr. Assange in Washington, he and WikiLeaks are the subject of an investigation in the United States. Mr. Assange has previously offered to be questioned by the Swedish authorities inside the embassy, but prosecutors had insisted until last year that he be interviewed in Sweden. Karin Rosander, a spokeswoman for the Swedish prosecutor’s office, said that the investigation was almost finished but that “the interview with the suspect has been missing all the time. ” Mr. Assange’s lawyers in Sweden recently made a new appeal to drop the arrest warrant against him, citing the “passivity” of the Swedish prosecutor in trying to question him. He is sought for questioning to see whether he should be charged with “minor rape” after an episode in 2010 in Sweden. Earlier allegations of sexual abuse were dropped because of the statute of limitations. A statement issued in Ecuador said, “In the coming weeks, a date will be established for the proceedings to be held at the embassy of Ecuador in the United Kingdom. ” The statement said that Ecuador and Sweden had signed “an agreement on mutual legal assistance in criminal matters” in December, “which provides the legal framework for the questioning. ” Ms. Rosander said a formal request from Sweden to question Mr. Assange at the embassy, first submitted in January, with a reminder sent in June, asked for the interview to be conducted by a Swedish prosecutor and a police officer. Thomas Olsson, a member of Mr. Assange’s legal team, told Radio Sweden that he believed the investigation would be shut down. “It’s hard to imagine that any of the involved parties will have a clear memory of what happened six years ago,” Mr. Olsson said. “Another consequence of the delay is that several of the accusations are now barred due to the statute of limitations. We can’t see any other outcome for this investigation than that it be shut down. ” In February, the Working Group on Arbitrary Detention of the United Nations ruled that Mr. Assange was being arbitrarily detained and should be released freely and with compensation for the violation of his rights. The opinion was nonbinding and has been rejected by Britain and Sweden. “Ecuador’s Foreign Ministry reiterates its commitment to the asylum granted to Julian Assange in August 2012,” the statement from Ecuador said, “and reaffirms that the protection afforded by the Ecuadorean state shall continue while the circumstances persist that led to the granting of asylum, namely fears of political persecution. ”'"}, "time": 1742563500.567113}