{"duration": 0.21957159042358398, "input_args": {"text": "'It won’t be the old car or the thousands of tobacco leaves or even the leaping crocodile model that will greet visitors when they walk into “¡Cuba! ,” the first major exhibition the American Museum of Natural History has ever organized about that island nation. Guests will be welcomed instead by   photographs of Cubans from Cuba and New York, alongside quotations that display a variety of views and aspirations. Although this is not a political exhibition, the nature of Cuba’s relationship to the United States means that politics cannot  —   and should not  —   be avoided, said Christopher J. Raxworthy, curator of the museum’s department of herpetology and a curator of “¡Cuba!” “We wanted the exhibition to be very honest,” he said, to allow the diversity of Cuba, both environmental and political, to come through. “¡Cuba! ,” opening Nov. 21 and running through Aug. 13, 2017, will be one of the largest exhibitions on Cuba’s biodiversity, natural resources and culture ever presented in the United States. It will also be the museum’s first fully bilingual show. All the senses will be brought into play. The scent of tobacco leaves will waft through part of the exhibition. Videos of Cuban music  —   and perhaps even live performances  —   will play at the end of what looks like a typical Cuban street, with cafes (no food or drink, but guests can sit down and play a game of dominoes to the aroma of coffee). The timing is both serendipitous and not. It comes about 16 months after President Obama announced the   of diplomatic ties, which were severed by the Cuban missile crisis more than 50 years ago. Legal commercial flights to Cuba began just this summer. But the museum’s ties to Cuba go deep. “We have a relationship with Cuban scientists and paleontologists going back 100 years,” Dr. Raxworthy said. While the museum had long had an interest in doing something on Cuba, “the normalization awakened people’s interest,” he said. The political shift also made it easier to invite Cuban colleagues to help and accelerated visas, said Ana Luz Porzecanski, director of the museum’s center for biodiversity and conservation and a curator of the exhibition. While it takes a minimum of two years to create something of the complexity and size of “iCuba! ,” this has been a little more rushed. “We have had just under two years,” Dr. Raxworthy said. Nothing is being shipped from Cuba because of the tight controls on the movement of biological materials. In any case, Dr. Porzecanski said, it is common for the museum to make models the exhibition needs to be hardy enough to travel, as it might be shown in different museums over the next 10 years. So in the bowels of the museum, an entire kaleidoscope of Cuban life has been created. It took 25 volunteers and several staff members to make the 4, 000 tobacco leaves out of construction paper. They are   with acrylic in varying shades of brown and green, complete with tiny holes mimicking insect damage. Stems made of hardened hot glue are attached. Then they are crinkled, bundled together and hung over drying poles. “It’s taken from April to the end of August” to finish the leaves,” said Andrea Raphael, a model maker for the museum. There’s a   shed for the leaves that will demonstrate the tradition of   and a   of a throne used for the   spiritual tradition known as Santeria, with information on how both have shaped the island nation. Also displayed are 30 original posters created over the last decade, which show “the breadth and vitality of Cuban art,” said Catharine Weese, director of exhibition graphic design. Michele Miyares Hollands, a Cuban artist who created some of the posters, was brought in to help develop that part of the show. An interactive exhibit allows museumgoers to explore the country’s art, fashion and dance worlds. A 1955 Chevy will be on display as a tool to explain Cuban restrictions on imports and sales of American cars after 1959, as well as the ingenuity Cubans used in keeping their ancient automobiles running. But of course, the natural world is an important part of the exhibition, and that means an enormous amount of work has been done to recreate accurately everything from the prehistoric giant owl to the bee hummingbird, the tiniest bird in the world. Wetlands, rain forests and coral reefs all come to life. The plywood, foam and resin model of the Garden of the Queens coral reef alone took about six months to make, complete with a   shark, which once lived in the museum’s Ocean Life hall and had been banished to storage. “Cuba has some of the best sea corals in the Caribbean,” Dr. Raxworthy said. The giant owl, which went extinct about 6, 000 years ago and might have been the largest flying bird, stands about three feet tall and was created by sculpturing epoxy, applied over foam and a steel armature form. Its piercing glass yellow eyes were flown over from Wales because no one in the United States had the right size in the right color, said Jason Broughan, a model maker who was working on the owl. “It was hard to flesh out the whole body  —   we had to do a lot of inference,” he said. Rebecca Meah, who created the model of the endangered Cuban crocodile  —   known for leaping in the air to catch small animals hanging from tree branches  —   used the skull of a Cuban crocodile that lived in the Bronx Zoo for many years to shape its head. Working with clay over urethane foam, Ms. Meah said it was the details  —   such as recreating exactly how the skin lies on the bone  —   that make the animal seem real. “Otherwise, it looks like a stuffed animal,” she said. The reuse of bits and pieces from other parts of the museum is typical. The fur of the Cuban solenodon  —   which looks like a shrew with a very long snout  —   was repurposed from a polar bear and painted rusty brown. And some live animals, including the Cuban tree frog and Cuban boa, will also be on view. The hope, Dr. Raxworthy said, is that visitors will “learn and have fun” And, he said, “for   who haven’t been back in a long time, it could be emotional. ”'"}, "time": 1742563380.8306162}