{"duration": 0.10379672050476074, "input_args": {"text": "'“The Birth of a Nation,” a drama about the Nat Turner slave rebellion, upended the Sundance Film Festival, selling for a record $17. 5 million and instantly vaulting to   of next year’s Oscar race. Scheduled to be released Oct. 7, the film is now attracting unwanted attention because of renewed interest in a    case in which the film’s director, writer and star, Nate Parker, was accused  —   and later acquitted  —   of rape when he was a student at Penn State. His college roommate, Jean McGianni Celestin, who received a credit on the movie, was also charged. Last week Deadline. com and Variety asked Mr. Parker about the case, and on Tuesday, Variety reported that his accuser committed suicide in 2012 at age 30. In a statement to The New York Times, the woman’s family said: “We appreciate that after all this time, these men are being held accountable for their actions. However, we are dubious of the underlying motivations that bring this to present light after 17 years, and we will not take part in stoking its coals. While we cannot protect the victim from this media storm, we can do our best to protect her son. For that reason, we ask for privacy for our family and do not wish to comment further. ” But the woman’s sister, Sharon Loeffler, said that statement did not represent the sentiments of other family members or the woman herself. “I know what she would’ve said,” Ms. Loeffler said, “and that would be, ‘I fought long and hard, it overcame me. All I can ask is any other victims to come forward, and not let this kind of tolerance to go on anymore. ’” Ms. Loeffler said her sister had believed there were other victims and had been broken by the 1999 case and its aftermath. “These guys sucked the soul and life out of her. ” Mr. Parker took to Facebook on Tuesday evening to say he had just learned of the death and was filled with sorrow. “I can’t help but think of all the implications this has for her family. I cannot  —   nor do I want to ignore the pain she endured during and following our trial. ” He maintained his innocence, but added that he wished he had been more empathetic at the time, writing: “There are things more important than the law. There is morality,” and adding, “I look back on that time as a teenager and can say without hesitation that I should have used more wisdom. ” Here’s a look at the case. WHAT WE KNOW Mr. Parker was accused in 1999 of raping a fellow student at Penn State. The victim, whose name is not public, said that Mr. Parker and his roommate, Mr. Celestin, raped her while she was intoxicated and unconscious, according to court documents, and that they later harassed, intimidated and stalked her after she pressed charges. Both men said that the sex was consensual. Mr. Parker, who, according to court transcripts, had had consensual oral sex with the woman previously, was acquitted of the charges. Mr. Celestin, who received a “story by” credit on “The Birth of a Nation,” was convicted of sexual assault, but his case was appealed. There are conflicting accounts about the outcome. The woman, under the name Jane Doe, then sued Penn State for failing to protect her from harassment the case was settled for $17, 500. According to court records, the victim had twice attempted suicide after the alleged rape. According to a court document, as a result of the harassment, the accuser “suffered severe depression, sleeplessness, and anxiety attacks. ” She also said that her apartment had been broken into and that her files on the case had been “disturbed. ” On Tuesday, it emerged that the woman killed herself in 2012, overdosing on sleeping pills, according to Variety’s interview with her brother. WHAT MR. PARKER HAS SAID ABOUT THE CASE In an interview with The Times last weekend on Martha’s Vineyard, Mass. where he was appearing with Spike Lee at a film festival, Mr. Parker said that he had never wanted to hide his past, and that he had made a conscious decision not to change his Wikipedia page, which included references to the 1999 case. “I talked about it publicly and I never sought to hide it,” he said. “It was the most painful thing I have ever had to experience. I can imagine it was painful for a lot of people. ” He also said that he “welcomed the conversation. ” “It’s a serious issue. I get it,” he said. “The reality is there is a problem on campuses in America, and violence against women is not taken seriously enough. And the dialogue and the discourse isn’t loud enough. I think there’s even more that can be done to educate university students, men and women. Being a father of daughters”  —   he has five daughters, three with his wife  —   “it’s important to say if something happened, to lift your voice. ” He later said: “They say the oppressor is anyone who’s not on the side of the oppressed. I stand firmly on the side of the oppressed. ” Asked if justice had been served in the case, he replied: “I was cleared of all charges. We’re talking 17 years later. We’re discussing a case which was thoroughly litigated. I was cleared of everything. At some point I have to ask myself, ‘How often am I willing to relive it? ’” WHY THIS IS A STORY NOW Backed by Fox Searchlight, Mr. Parker has just embarked on an extensive campaign to promote the film, and media scrutiny is heightened. While the case was written about in 1999 in local newspapers and in a 2007 profile of Mr. Parker in The   it only garnered widespread attention after Deadline published details from the court transcripts. “The Birth of a Nation” tells the story of Nat Turner, who led a slave rebellion in Virginia in 1831. The film was first screened at the Sundance Film Festival this year, shortly after the   slate of Oscar acting nominees set off an outcry as well as a larger conversation about the lack of diversity in Hollywood. Almost everything about the film seemed a remedy to all that, including its name, a sharply pointed reappropriation (not a remake) of D. W. Griffith’s landmark and racist 1915 film of the same title. Born into poverty, Mr. Parker, whose previous films include “The Secret Life of Bees,” “Red Tails” and “Beyond the Lights,” had made telling Turner’s story a passion project, even turning down other work. He wanted Americans to face the legacy of slavery head on, and said the country’s aversion to doing so led to countless   problems, including tensions between the police and black Americans. Support for the film surged. Last weekend, at the film festival on Martha’s Vineyard, Mr. Parker and his   Aja Naomi King, appeared on a panel with Mr. Lee, who urged audience members to pack the theaters when it opens. At Sundance in January, Mr. Parker received a standing ovation from a packed audience before the film began. Afterward, there was a bidding war, with Fox Searchlight emerging the victor and paying a festival record for the right to distribute the drama. This week Variety reported that in light of new attention around Mr. Parker over the rape case, Fox Searchlight would be changing its release plans and possibly refusing to grant more interviews with Mr. Parker for a few weeks, but a studio spokesman said Tuesday that those suggestions were untrue and that the release and marketing of the film would go ahead as planned.'"}, "time": 1742628341.6210167}