{"duration": 0.11539816856384277, "input_args": {"text": "'By Jonas E. Alexis on October 27, 2016 Putin: “Some people, from the outside, think that if they can ‘comb’ the region to how they see fit – some of them call this ‘democracy’ – then the region will come into calmness and order. That’s not how it is.\" “Will NWO agents ever learn logic?” …by Jonas E. Alexis \\nThe United States and New World Order agents have obviously enough reasons to hate Vladimir Putin because he doesn’t back down when it comes to fighting terrorism and the New World Order in Syria. Putin delivers. And obviously NWO agents would love to see his head on a silver platter. Putin declares: \\n“ You know what [the Americans] can’t answer us? The key armed opposition group…al-Nusra…Yes, this organization is one of the key ones in the armed opposition [against Assad]. The U.S. State Department has confirmed it is a terrorist organization linked to al-Qaeda. Al-Nusra does not hide that fact. And – what are [the Americans suggesting]? For al-Nusra to be in the future parliament? \\n“Or, here’s another example. They support certain organizations that are fighting against Assad in Syria, yet those same countries [who support them in Syria] fight against these organizations in Mali. Often, not only are they the same organizations – they are the same individuals. They simply leave Syria and go to fight in Mali – where western states do not support them. Then the same people go back to Syria and there they are supported.” \\nRead those statements again and ask yourself these questions: When was the last time that a leader in Europe and in America ever pointed them out? Has even John Kerry ever taken time to responsibly address this internal contradiction? Has any NWO agent ever even bothered to give their listeners a rational response? \\nWell, not a single NWO agent has ever attempted to formulate a serious answer. Not one. In fact, what we have been hearing over and over is that Russia is the bad guy; Putin is a potentate seeking to expand Russia’s influence in the entire world; Russia is not attacking ISIS or terrorist groups but civilians in Syria, and on and on it goes. \\nPutin asks: “Where is the logic? How will it all end? These are not just empty words.” \\nWell, Mr. Putin, there is no logic at all. The New World Order does not have to have logic and formulate serious arguments. They have to resort to name calling, colossal hoaxes, complete and deliberate fabrications, and deceptive means. These issues have been certainly frustrating to Russian officials, including Russia’s Foreign Affairs spokesperson, Maria Zakharova. YouTube - Veterans Today - \\nChristopher A. Preble wrote in The New Republic that Assad posed no threat whatsoever to the security of the United States, that it was foolish for the US to get involved in this war, and that 81 percent of the American people did not approve sending troops to Syria. [1] \\nRussia in particular wanted to talk to the Syrian rebels in order to settle a peace treaty, but their response was that the toppling of Assad was a precondition for peace talk. [2] Who, then, are the real terrorists? \\nNo New World Order agent will answer this question in any rational fashion because the system itself is incoherent and worthless. Putin again nails it when he says: “Some people, from the outside, think that if they can ‘comb’ the region to how they see fit – some of them call this ‘democracy’ – then the region will come into calmness and order. That’s not how it is. Without taking into account the history, the traditions, religious particularities, you must not do anything in the Middle East, especially as an outsider.” \\nObviously New World Order agents, most specifically the Neocons, are still upset with Putin. They still blame him for virtually anything bad that happens in Syria. Flaming Neocon Max Boot has recently written: \\n“Russia aircraft dropped incendiaries, cluster munitions, and even giant ‘bunker buster’ bombs on homes and hospitals, killing and maiming at random.” [3] \\nBoot talks about “a durable peace” in Syria, but for that to happen, he advocates a serious confrontation with Assad, which would inexorably lead to another confrontation with Russia. \\nIn a similar vein, Matthew Kroenig of the Weekly Standard cannot sleep well at night because he thinks that “Putin’s nuclear trash talk needs a serious response.” [4] \\nIf Putin is the real threat here, then Kroenig has a lot of rethinking to do precisely because the state of Israel doesn’t just declare that they have nuclear warheads. They literally declare that they can obliterate cities in Europe practically overnight. Remember Martin van Creveld’s bold statement? Here it is again: “We possess several hundred atomic warheads and rockets and can launch them at targets in all directions, perhaps even at Rome. Most European capitals are targets for our air force…. We have the capability to take the world down with us. And I can assure you that that will happen before Israel goes under.” [5] \\nKeep in mind that Creveld is an Israeli military historian. He has written books for Cambridge University Press and other academic institutions. Yet Zionist outlets were completely silent about his statement. In fact, they never seriously challenged him or even the state of Israel on that very issue. \\nThose outlets are much more interested in Vladimir Putin and Assad than addressing the serious issues. That is one reason why organs like the Economist , Newsweek , and the New Statesman never missed an opportunity to attack Putin. \\nYet despite all their lies and fabrications, Russia continues to thrive. Perhaps NWO agents need to learn very quickly that truth will triumph in the end. \\n[1] Christopher A. Preble, “Please, Mr. President, Don’t Intervene in Syria,” New Republic , December 14, 2012. \\n[2] Michal Shmulovich, “Russian FM’s Overtures for Talks,” Times of Israel , December 28, 2012. \\n[3] Max Boot, “Cleaning Up Obama’s Syria’s Mess,” Commentary, October 14, 2016. \\n[4] Matthew Kroenig, “Putin’s Nuclear Trash Talk Needs a Serious Response,” Weekly Standard , October 24, 2016. \\n[5] Quoted in “The War Game,” Guardian , September 21, 2003. Related Posts:'"}, "time": 1742564283.400946}