{"duration": 0.11271834373474121, "input_args": {"text": "'\\nPosted by Lindsay Hayward | Nov 2, 2016 | Liberal Corruption Assange exposes John Podesta and Hillary Clinton \\nFrom a young age, Americans learn what “basic behavior” is accepted in modern society. Part of that learning curve teaches children to never lie. These children grow up into successful, trustworthy adults, right? How To Make An Organic Super Food For Survial At Home - Watch Video Click Here \\nLawyers, doctors, government officials, and so on are all supposed to be upstanding citizens. They are supposed to represent truth and freedom for our nation. \\nWhere there is great responsibility, there is also opportunity to abuse this power. Hillary Clinton’s appointed chairman, John Podesta, is familiar with this all too well. \\nTruth seeker and founder of WikiLeaks, Julian Assange, has released Hillary Clintons deleted emails from her private server to make Americans aware of what’s going on. \\nIn a world where it’s difficult to tell what’s right and what’s wrong anymore, its natural to feel fear. However, “fear” is what people like Hillary Clinton thrive on. \\nThe FBI is revisiting the initial Clinton email scandal and has provided newly declassified information about the Clinton Foundation via the FBI Vault . \\nIn an email sent to Cheryl Mills from John Podesta the evening of March 2, 2015, hours after the New York Times reported that Clinton possibly violated federal record requirements by using the private server, a shocking revelation has been uncovered. \\nAccording to the latest batch of Podesta’s hacked emails, Podesta writes, “Not to sound like Lanny, but we are going to have to dump all those emails so better to do so sooner than later.” \\nMills responded, “Think you just got your new nick name.” \\nThe “Lanny” reference is to lawyer Lanny Davis, who served as special counsel to former President, Bill Clinton. Lawyers, unfortunately, are not always the most honest individuals and have been known to cover up for their guilty clients. Hillary Clinton is one of these lawyers. \\nCheryl Mills is the same woman who oversaw the controversial construction of a South Korean sweat shop being built in Haiti. A week after this email exchange took place, Hillary Clinton announced that she would love nothing more than to share her emails with the general public, claiming she had nothing to hide. At least, she didn’t think she did. \\nAfter being subpoenaed by federal court, Hillary Clinton acid-washed her private server, deleting thousands of emails. She denied, under oath, that classified information was ever on the server or sent/discussed via her private email address. Do you think Hillary Clinton ever gets tired of lying, each lie covering up the next? \\nAcid-washing a server costs a pretty penny. If she truly had nothing to hide, why did she completely bleach her server free of everything? \\nThanks to leaked emails from WikiLeaks, it has been proven that Hillary lied when she said no classified information had ever been involved with her private server- Not only was there classified information stored and talked about, but hackers were able to intercept the data and correspondence. \\nNew York Post comments, “Democrats on the House Oversight Committee point to Clinton tweeting on March 4, 2015, calling on the State Department to release her 55,000 pages of work files.” \\n“I want the public to see my email,” Hillary wrote two days after the Podesta message. \\nAt the time, the real Lanny Davis was in support of Clinton addressing her emails. \\nAnother WikiLeaks email displays members of the Clinton Organization getting frustrated with Davis’ public voicing. \\n“We gotta zap Lanny out of our universe,” campaign manager Robby Mook wrote Podesta March 8, 2015. “Can’t believe he committed her to a private review of her hard drive on TV.” \\nGood thing for Lanny Davis, “zap” doesn’t equate to “wet-work.” \\nAlthough Davis may have been rash to announce and support Hillary Clinton’s innocence, the DNC had major issues with it. \\nDavis told Fox News host Chris Wallace, during a televised interview, about Hillary Clinton’s private email server- “there can be a neutral party to review all these records – nothing unlawful.” \\nApparently, Davis wasn’t given the memo by Hillary Clinton’s team regarding her bleached server and it’s true contents. \\n“I think it is a reasonable idea if anybody has any doubts that there’s a delete on a hard drive- to have an independent go inspect her private e-mail?” Davis added. \\nHillary Clinton is known for lying, her own chairman doesn’t even believe her when she claims she “forgets” things. Even Podesta Knows She Is A Liar \\nHillary Clinton wouldn’t know honesty if it slapped her in the face. She is a psychopathic liar that thirsts for ways to obscenely scam on a global spectrum. \\nShe calls out Donald Trump for “using the system” but in no way has he abused the system in the grand scale that the Clintons have. He’s a business man, he was simply following the laws that government had implemented. \\nFloods of emails and documents are being leaked every day by Anonymous, WikiLeaks and the FBI. These are desperate cries for help mostly from whistle blowers who have been intimately involved with the government, trying to warn American citizens of certain madness and despair that awaits us if Hillary Clinton wins presidency. \\nDonald J. Trump genuinely cares for the American people. He is a natural leader, he enjoys helping people because he believes in bettering America, not policies that encourage ‘pay for play’. \\nHillary Clintons transparency is starting to become blurred. Shatter the busted deception and lock everyone involved with the Clinton scandals in prison. \\nDonald Trump recognizes the need for America to rebuild, which starts with depleting government corruption and replacing government officials. This is something Hillary could never accomplish. Hillary Clinton would just hire her friends and abuse her position of power, as she’s done for nearly four decades. \\nJohn Podesta suggested that Hillary Clinton delete her emails- he must believe she is capable of worse than sharing classified information and as president of the United States, who would stop her from committing even more crime? She would put each and every one of our lives on the line and not think twice. \\nJohn Podesta doesn’t even believe in her, why should America? '"}, "time": 1742563645.8234658}