{"duration": 0.056162118911743164, "input_args": {"text": "'in: Government , Multimedia , Special Interests November 8th’s election in the United States is perhaps the most important ever in the history of the country. It is not just an election to choose a President and some Senators and Representatives, it is perhaps the last true election that Americans will see. There is much more than just voting at stake. There are issues that are much more important than selecting judges for the Supreme Court. The election of 2016 may be the culmination of what previous American presidents warned: an internal takeover for the complete destruction of the country. Apparently, the attempt to, once a for all, strip Americans away from their Constitutional Rights has already been noticed by members of the intelligence community, who have launched a counter coup to stop the big American takeover led by Hillary and Bill Clinton. “Hillary and Bill Clinton are attempting a takeover of the United States and will stop at nothing,” warns former US government official, Steve Pieczenik. “A coup d’état of this magnitude has never been affected in such a subtly calculated way,” he explains in a video posted on his account on Youtube. In his video, Pieczenik explains that the Coup in which the Clintons are participating has been done silently and via the use of two methods: corruption and co-optation. “The Clintons have been involved in co-opting our White House, our Judiciary, our CIA, our Federal Bureau of Investigation, our Attorney General Loretta Lynch and our Director of the FBI, James Comey,” Pieczenik says. He says that the people and organizations cited above were made part of a group that was directed through political cronyism. Pieczenik says that him and other former members of the intelligence community have now launched a counter coup operation with the collaboration of Julian Assange and Wikileaks. The former government official announced that the revelation of new emails contained in a laptop computer that belonged to Anthony Weiner was the first step, the first warning, that the counter coup had started. Speaking directly to those who he believes are carrying out the Coup d’Etat against the American people, Pieczenik said: “We are going to stop you from making Hillary the president of the United States.” He also announced that his group would indict the president of the United States, Loretta Lynch and others who, according to Pieczenik, are involved in the cover-up of the massive corruption going on at the Clinton Foundation. You can watch Steve Pieczenik’s video below: Submit your review'"}, "time": 1742562948.9065397}