{"duration": 0.15591669082641602, "input_args": {"text": "'PAUL VAN AUKEN, WSWS.ORG 28 October 2016 T he United Nations Security Council was the scene Wednesday of a bitter exchange over the ongoing war in Syria, with the Western powers indicting Russia for war crimes over its operations in the northern city of Aleppo. The UN aid chief and former Tory member of the British parliament Stephen O’Brien set the tone by declaring himself “incandescent with rage” over the inability of the Security Council to take action. “Aleppo has essentially become a kill zone,” he said. The fact that both Russian and Syrian warplanes have halted their strikes against the Al Qaeda-affiliated Islamist militias that control eastern Aleppo for the past 10 days was brushed aside by Samantha Power, the US ambassador to the United Nations, who represents the living embodiment of imperialist “human rights” hypocrisy. Clueless Americans’ tax dollars at work: Samantha Power doing her Neocon best to stir up further trouble for humanity. Taunting Russian ambassador Vitaly Churkin, she declared. “You don’t get congratulations and credit for not committing war crimes for a day or a week.” Continuing her tirade, Power asked, “Does Russia believe that all of the children in eastern Aleppo are Al Qaeda members?” Such outrage over the fate of civilians and children is highly selective. None of the representatives of US imperialism and its allies evinced even a spark of rage over the killing of men, women and children in government-controlled western Aleppo, which is regularly bombarded by mortars and rockets provided to the Al Qaeda “rebels” by the Pentagon and the CIA. On Thursday, rocket fire claimed the lives of six children in the west of the city, where the vast majority of the population lives. Three Syrian children died at their school, where 14 other students were wounded. In a separate attack, three young brothers died when a rocket struck their home. Nor for that matter, as far as the human rights imperialists are concerned, can the slaughter of civilians in US air strikes elsewhere in Syria be compared in any way to the deaths caused by Russian bombs in Aleppo. Amnesty International issued a report Tuesday on 11 separate strikes by the US-led “coalition” in which it said some 300 civilians were killed. The Pentagon has acknowledged only one death in these bombing raids. Other monitoring groups have put the civilian death toll inflicted by the US air war in Syria at well over 1,000. All told, the Pentagon admits to killing only 55 civilians in two years. Power’s jibe that the Russians view every child in Aleppo as a member of Al Qaeda applies with equal force to the Pentagon, whose bombs apparently kill only members of ISIS. Power is herself a veteran practitioner of this kind of grotesque double standard. This crusader for human rights took the effective position that “every child in Gaza was a member of Hamas” during the 51-day Israeli siege of 2013 that killed over 2,100 Palestinians and wounded another 11,000. During this one-sided slaughter, the US ambassador used her post at the UN to relentlessly proclaim Israel’s right to “defend” itself. Waving the filthy imperialist human rights banner, she was also one of the leading proponents of the US-NATO war in Libya that killed tens of thousands and left the country in ruins, as well as the war for regime change in Syria, which has killed over 300,000 and driven millions from their homes. T he hypocrisy and double standard of the war crimes denunciations against Russia over Aleppo emerges most starkly in relation to the launching earlier this month of a US-led siege of the Iraqi city of Mosul, just over 300 miles to the east, which was overrun by ISIS in 2014. While the Russians are indicted for turning Aleppo into a “kill zone,” the Western media routinely refers to the American onslaught as the “liberation” of Mosul. To that end, US warplanes, rocket launchers and heavy artillery are relentlessly pounding the city of over a million, which analysts acknowledge will be reduced to rubble. The head of the US military’s Central Command, Gen. Joseph Votel, boasted in an interview with AFP that his forces had killed “800 to 900 Islamic State fighters.” He said not a word as to how many civilians had died under the US bombardment; nor has the US corporate media shown any interest in that subject. When one horrific incident did come to light—the bombing of a Shia mosque near Kirkuk last Friday in which 17 women and children lost their lives and scores were wounded—the Pentagon brushed it aside and the media largely ignored it. Even as US officials, parroted by the press, indict ISIS for using Mosul’s population as “human shields”—a timeworn alibi for the slaughter of civilians—they ignore and tacitly support Al Qaeda’s use of terror and violence to prevent civilians from fleeing from the besieged neighborhoods of eastern Aleppo. While the actions carried out by the Russian military against the civilians trapped in eastern Aleppo are no doubt reprehensible, they are not the real concern of those screaming about war crimes. Their fear is that the Al Qaeda-linked militias that serve as the principal proxy force in the war for regime change are facing a final rout. Power trying to dragoon the UN Russian delegate, V. Churkin. Encouraged and rewarded by their hypocritical masters, the empire’s goons know no limits to their audacious indecency. More fundamentally, the crimes of Russia[—such as they are, and that, in itself needs careful contextual examination— Editors] in Aleppo pale in comparison to those carried out by Washington in the region, and for that matter, around the globe. Have those who feign shock and rage over the Russian bombs dropped on Syria forgotten “shock and awe?” The US invasion and occupation of Iraq took an estimated 1 million Iraqi lives. Are these champions of human rights unaware of the ongoing slaughter in Yemen, where over 10,000 people have died under Saudi airstrikes carried out with US supplied bombs and missiles and made possible by extensive intelligence and logistical aid from the Pentagon? Why is there no rage over a war by the ruling monarchy of the Middle East’s wealthiest nation against the region’s poorest, in which the systematic destruction of civilian infrastructure and a blockade imposed with the aid of US forces is threatening the population with starvation? When it comes to war crimes, the Kremlin oligarchy represented by Vladimir Putin is in the minor leagues. Since the end of World War II, and the US atomic bombs that killed some 200,000 in Hiroshima and Nagasaki, virtually every US president has engaged in wars of military aggression that entailed war crimes, many of them on a scale surpassed only by the atrocities carried out by Hitler’s Third Reich. The Korean War resulted in 3 million civilian deaths; in Vietnam, the US killed some 3 to 4 million civilians. Afghanistan’s tragic and protracted encounter with US imperialism, dating back to the CIA-orchestrated war of regime change of the 1980s, claimed the lives of between 1.5 and 2 million more. Meanwhile, Washington remains at war in at least seven different countries, where civilian deaths continue to mount daily: Iraq, Afghanistan, Pakistan, Syria, Libya, Yemen and Somalia. The source of the feigned rage and tears over Aleppo is the fact that the US war for regime change in Syria has turned into a debacle. Moscow launched its intervention in defense of the interests of Russia’s ruling capitalist oligarchy, not those of the Syrian masses. Nonetheless, it has presented an obstacle to the US drive to assert its hegemony over the entire oil-rich region of the Middle East. The unrelenting “human rights” propaganda and demonization of Russia over Aleppo stands as a warning. US imperialism is preparing a major escalation, not only of the US intervention in Syria, but of its confrontation with Russia itself, carrying with it the real and present danger of a nuclear war. —Bill Van Auken'"}, "time": 1742564168.091605}