{"duration": 0.06475067138671875, "input_args": {"text": "'in: Special Interests , US News (image credit: Getty) After announcing her presidential bid last year, Hillary tried getting Moroccan King Mohammed VI to donate $12 million to the Clinton Foundation in return for a face-to-face meeting and speaking engagement. Nice work if you can get it. Easy if you’re Bill or Hillary Clinton, money from Morocco’s king one of many examples of their corrupt practices. Reporting on email content revealed by WikiLeaks, Fox News Ed Henry, said the following: “Just hours after Hillary Clinton dodged a question at the final presidential debate about charges of ‘pay to play’ at the Clinton Foundation, a new batch of WikiLeaks emails surfaced with stunning charges that the candidate herself was at the center of negotiating a $12 million commitment from King Mohammed VI of Morocco.” In an email to Hillary’s campaign chairman John Podesta and campaign manager Robby Mook, close Hillary aide Huma Abedin said “this was HRC’s idea.” “She created this mess and she knows it” – referring to scheduling a pay-to-play deal one month after launching her presidential bid, certain to raise red flags if revealed. Her advisors were concerned. Abedin emailed “(j)ust to give you some context, the condition upon which the Moroccans agreed to host the meeting (of the Clinton Global Initiative) was her participation. If hrc was not part of it, meeting was a non-starter.” “This was HRC’s idea. Our office approached the Moroccans and they 100 percent believe they are doing this at her request. The King has personally committed approx $12 million both for the endowment and to support the meeting.” A compromise was reached. Bill and Chelsea participated, representing Hillary. Fox News Sunday host Chris Wallace pressed Robby Mook for an explanation. Wallace: “Why wasn’t that classic pay-to-play,” he asked? Mook: “There’s nothing new here” – only in terms of it being commonplace Bill and Hillary practice. Wallace: “But, Robby, there is some new stuff. Emails show, and I’m going to go through some of them, you were not happy at all (about) the idea of this meeting and her going there.” Mook: Calling it a scheduling issue, he claimed “(w)e didn’t want her going overseas…before the campaign was kicking off.” Journalist Bob Woodward called Clinton Foundation practices “corrupt…a scandal. The mixing of speech fees, the Clinton Foundation, and actions by the State Department which she ran are all intertwined…You can’t just say it’s unsavory.” It’s the kind of stuff landing ordinary people in prison. Bill and Hillary remain unaccountable for years of illegal practices. Instead of long overdue prosecution, they’re returning to the White House in January for a third co-presidential term as things now stand – apparently rigged to assure it. Submit your review'"}, "time": 1742561964.7210388}