{"duration": 0.05385231971740723, "input_args": {"text": "\"Email \\nOn Wednesday evening Bill O’Reilly, host of The O’Reilly Factor , offered his solution to gun violence: make all gun crimes federal crimes to be enforced at the federal level. “That way,” he claimed, “American law enforcement everywhere can not only take guns off the streets but people who illegally carry them and/or use them to commit crimes … and the upshot, pardon the pun, is that legal gun owners would be left alone.” \\nHe expanded on this trashing of precious gun rights by federal police: “Anyone committing any crime, any crime with a gun, even simple illegal possession, should be subject to federal mandatory prison sentences. All gun crimes should become federal crimes.” \\nTranslation: Guns as well as the criminals using them will be taken off the streets — without due process, without Second Amendment protections — done presumably by federal law enforcement using federal police officers. State laws would be overridden and ignored. \\nThis is the real Bill O’Reilly. Widely perceived as a “conservative,” O’Reilly has been a master at deception, deflecting attention away from real issues. For example, rarely if ever does O’Reilly, or his carefully selected guests, talk about the threats to national sovereignty posed by the United Nations, a New World Order (whose desired implementation really isn't even hidden by elites anymore), or the Council on Foreign Relations. Never does he allow his audience to hear from the likes of Alex Jones of InfoWars or Jack McManus or Art Thompson of The John Birch Society. Can any viewer remember the last time anyone from Breitbart News appeared with O’Reilly? Or Eric Erickson of Red State ? \\nO’Reilly feigns conservative stances and then lets his real positions be known. Back in January, following the San Bernardino, California, shooting, O’Reilly could have represented the National Rifle Association when he said: The truth is, terrorists are not going to submit themselves to background checks — neither are dangerous felons or insane people. They are not going to sign any paper when they buy a gun. Do we all get that? They will buy their guns on the black market. And no registration law will prevent that. \\nLess than six months later, on June 14, O’Reilly blamed gun violence on the “right wing,” calling them responsible for it and then adding: There is too much gun crime in the USA, and high powered weaponry is too easy to get. That's the fact. So let's deal with it. We all have the right to bear arms, but we don't have the right to buy and maintain mortars. Even if you feel threatened by gangsters or a New World Order. No bazookas, no Sherman tanks, no hand grenades. That's because the Second Amendment clearly states the government has a right to regulate militias, made up of individuals. They have that right in the name of public safety. \\nIgnoring his egregious misunderstanding of what the Second Amendment not only says but what it means, his rant sounded awfully similar to that expressed by the “reverend” Jesse Jackson the same day: Gun control cannot end terror, neither the mass shootings like Orlando nor the daily horror as in Chicago. Omar Mateen, the killer in Orlando, was a security guard, apparently with a record clean enough that he was able to buy guns legally. But surely it is inconceivable that military assault weapons like the AR-15 semiautomatic rifle that he used (and that was also used in Aurora and Newtown and San Bernardino) should be so easily purchased. Reviving the ban on assault weapons that lapsed under President Bush is not a full remedy, but it is simple common sense. \\nO’Reilly’s “make all gun crimes federal offenses” statement on Wednesday night reflects how his education at liberal Boston University and Harvard and his decades-long employment by CBS News, ABC News, and CBS’ Inside Edition bleeds over from time to time into his comments on gun violence. When he drops his “deflection” shield, one can see who he really is: just one more shill for the totalitarian Left that controls the mainstream media. \\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. .  \""}, "time": 1742628529.6803644}