{"duration": 0.06033730506896973, "input_args": {"text": "'Germany: Students Forced to Chant ‘Allahu Akbar,’ Punished for Refusing Trip to Mosque Intolerance will not be tolerated! Chris Menahan | Information Liberation - October 28, 2016 Comments \\nIslamic indoctrination is now mandatory in German schools. \\nFrom The Daily Express : \\nPUPILS at a primary school were forced to chant “Allahu Akhbar” and “there is no God but Allah”, an appalled father has claimed. \\nThe father of the pupil at the girl’s primary school in German ski resort Garmisch-Partenkirchen discovered that his daughter had been forced to learn the Islamic prayer when he discovered a handout she had been given. \\nHe claimed she had been “forced” by teachers to memorise the Islamic chants and forwarded the handout to Austrian news service unsertirol24. \\nThe handout read: “Oh Allah, how perfect you are and praise be to you. Blessed is your name, and exalted is your majesty. There is no God but you.” \\nIt had been given to the girl during a lesson in “ethics” at the Bavarian school. \\nWhat are they going to teach, the ethics of conquest and slavery? \\nHere’s another story from yesterday in RT : \\nParents of a German teenager may face a trial and fine for “truancy” after refusing to allow their son to go to a local mosque on a school field trip out of fear that it would lead to his “indoctrination” by Islamic radicals. \\nThe story broke in mid-June, when parents of a 13-year-old student opposed the idea of their son visiting a mosque in the northern German town of Rendsburg, reportedly organized as part of a geography class. \\nIn a letter to the class teacher quoted by the NDR, the teen’s father argued that his son would be “indoctrinated” in the mosque. He went on to say that “for years we have been hearing reports about religiously-motivated violence connected with Islamic people.” \\nA local education authority subsequently fined the couple a total of €300 ($328), referring to school regulations and regional laws which include penalties for truancy. \\n— Alexandra Witt (@AlexiaStellar) October 23, 2016 \\nWhen the parents opposed the fine, their case was forwarded to Peter Mueller-Rakow, a local prosecutor, who will decide whether or not to proceed with a court trial, Spiegel reported on Wednesday. \\nThe parents’ lawyer, Alexander Heumann, argues that they refused the school trip out of fear for their son’s “bodily safety.” \\nDenying any faith-based motives, he emphasized that the couple do not belong to any religious group, and are of the opinion that “nobody shall be forced into a sacred place against his good will.” \\n…School principal Renate Fritzsche … told NDR that the field trip to the mosque was meant to promote tolerance and diversity. \\n“We also have Muslim children with us and Muslim parents also know that there are no exceptions,” she said, adding that swimming lessons and sex education are compulsory for Muslim children as well. “It is not the responsibility of the parents to say: ‘My child will attend such or such class,’” Fritzsche asserted. \\nIntolerance will not be tolerated! \\nNow get back to your damn prayer rugs and start praying to Mecca! NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742562703.60715}