{"duration": 1.7955882549285889, "input_args": {"text": "'ALPHARETTA, Ga.  —   A gray mood has settled over   voters in some of the country’s most reliably Republican congressional districts, as the party’s stumbles in Washington demoralize them and leave lawmakers scrambling to energize   supporters in a series of   elections. While the next nationwide elections are not until 2018, Republicans have grown fearful that these voters are recoiling from what they see as lamentable conditions in Washington: a government entirely in Republican hands that has failed to deliver on fundamental goals like overhauling the health care system. Early missteps by President Trump and congressional leaders have weighed heavily on voters from the party’s more affluent wing, anchored in    suburbs around major cities in the South and Midwest. Never beloved in these precincts, Mr. Trump appears to be struggling to maintain support from certain voters who backed him last year mainly as a way of defeating Hillary Clinton. Interviews with   voters in four suburban districts  —   in Georgia, Kansas, Minnesota and New Jersey  —   revealed a sour outlook on the party. These voters, mainly white professionals, say they expected far more in the way of results by now, given the Republican grip on power in the capital. In opinion polls, they consistently give Mr. Trump mediocre approval ratings, even as he remains solidly popular with   whites. In the past,   presidents have suffered grievous losses in midterm elections, when their party’s voters have stayed home while the opposition party has marched to the barricades. Former President Barack Obama saw Democrats lose 63 House seats in 2010 after Republicans and disaffected independents stampeded to the polls and grumbling Democrats did not. It is too early to say if the same dynamic is afflicting Mr. Trump. But already, Republicans have strained to prop up their candidates in a pair of special House elections in the areas around Atlanta and Wichita, Kan. both in districts that have voted overwhelmingly Republican in past congressional races. Republicans spent nearly $100, 000 in   ads boosting Ron Estes, a candidate in Kansas, who won a relatively narrow victory Tuesday night as turnout from the party’s voters slumped. Wary national Democrats invested little money in the race, prompting criticism from activists seeking to fight Mr. Trump’s party on every possible front. Republicans may face a tougher test next week in Georgia, where both parties have poured millions into contesting the seat vacated by Tom Price, Mr. Trump’s new health and human services secretary. At a   shopping mall outside Atlanta, Eric Riehm, 48, said he was beginning to question the point of casting his ballot for Republicans. “The vote seems to matter less and less, because nothing can be done, just like repealing Obamacare,” said Mr. Riehm, who works in information technology sales and voted for Mr. Trump. That malaise cuts across regional lines: In the New Jersey district held by Representative Leonard Lance, a Republican, Joe Boyle, 61, said he took a dim view of Mr. Trump but still hoped he would turn things around. Mr. Boyle, who said he usually votes Republican, faulted the party for failing to “do the homework” on health care, and criticized lawmakers for focusing on their own interests instead of forging bipartisan agreements. “It’s all about ‘me,’ not about the better good of the overall population,” said Mr. Boyle, who recently retired as a marketing executive at Johnson  Johnson. Of Mr. Trump, he added: “He’s a mess. ” Where Democratic activists have flocked to   races, hustling to volunteer, donate money and quickly cast their ballots in   periods, Republicans have seen no comparable energy on their side. They have taken special measures to drum up interest: In Kansas, Senator Ted Cruz of Texas held a   rally to draw attention to the race, and Mr. Trump praised Mr. Estes on Twitter on Tuesday morning. But in an illustration of the rising frustration among    Republicans, Mr. Cruz received his loudest ovation when he rebuked his own party. “We have a Republican president, we have a Republican House, we have a Republican Senate  —   how about we act like it!” he demanded. Mr. Estes ultimately won by 7 points, compared with a nearly   victory margin last fall for the district’s previous congressman, Mike Pompeo, who now leads the C. I. A. And the enthusiasm gap between the parties was on vivid display: Mr. Estes won 62 percent fewer votes than Mr. Pompeo did last fall, while the Democratic vote was only 32 percent lower than in November. Should Republican voters remain so demoralized  —   and Democrats so fired up  —   it could imperil dozens of congressional seats that are usually safe. Midterm elections typically turn on which party is more enthusiastic about sending a message in the past special elections have served as political omens, like when former Senator Scott Brown’s upset win in Massachusetts in 2010 foreshadowed a building conservative wave. Republican anxieties run deeper than just the House. The gloomy environment has hampered their recruiting in a number of   Senate seats, alarming the Senate Republican leader Mitch McConnell, according to Republican officials who have spoken to him, who insisted on anonymity to describe those conversations. Joel McElhannon, a Republican strategist in Georgia, said intraparty wounds from the presidential race remained raw in areas Republicans badly need to win, making it difficult for them to turn out their voters. “It makes it hard to energize the broader Republican base when there are still these unresolved conflicts,” said Mr. McElhannon, predicting: “You’ll see it in various suburbanized districts throughout the country. ” Far from Atlanta, along the shoreline of Lake Minnetonka, Minn.  —   where the accents could scarcely be more different, but the taste in   cars and   politics is the same  —   voters in Representative Erik Paulsen’s   district voiced a similar sense of unease. Mr. Paulsen has been   easily since managing a victory the year Mr. Obama was first elected president. But Hillary Clinton won his district by 10 points in November, making it terrain that could turn competitive if centrist voters recoil from the G. O. P. That would mean a   insurrection from the type of voters strolling along Lake Street in Wayzata or dropping off their dogs at the Lulu and Luigi grooming parlor, as Jackie Carley did with Tiny Bubbles and Viggo, two of her rescues. Ms. Carley, a   moderate, said she would be more likely to support a congressman who would slow or halt the president’s agenda. “I’m a Minnesota person so I don’t want to be rude, but I’m not a fan,” Ms. Carley, a     said of Mr. Trump. Others were less diplomatic. “It’s a mess,” said Gretchen Gilbertson, 51, a    mother out walking her own dog, Pancake. “Congress can’t get anything done, and our president is a buffoon. ” Ms. Gilbertson vowed to do whatever she could to send Mr. Trump a message of disapproval in next year’s election. Paul Anderson, a state senator from nearby Plymouth, Minn. said voters there would judge their congressman on his own record. But for Mr. Paulsen to win   Mr. Anderson suggested, he would probably “have to separate himself at some point from Trump. ” It remains to be seen if Democrats can fully exploit the turbulent environment. They hoped last fall that Mr. Trump’s unpopularity would drag down   Republican candidates across the country, but the party won full control of government. And Democrats may face a tricky balancing act if the explosion of energy on the left collides with the native sensitivities of the    districts they aim to win. Representative Josh Gottheimer, a moderate Democrat who captured a   seat in the New Jersey suburbs last November, said he believed even some conservatives would be “  to voting for Democrats, with the right approach. ” “You have to find a very     approach and one that is not ideologically rigid on either side,” Mr. Gottheimer said. “People are so fired up on the left, too, you have to make sure you are responsive there as well. ” In Georgia, the Democrat running for Congress, Jon Ossoff, has tried to walk that line, promising in ads to check Mr. Trump’s power, while also pledging to cut wasteful spending. He faces a fractious array of Republicans in an open primary on Tuesday. While the district easily   Mr. Price, Mr. Trump barely carried it against Mrs. Clinton. Strolling briskly past Banana Republic and Orvis storefronts, Helen Thompson, 72, said she was dismayed that Republican disorder had endangered the seat. “I think the Republican Party needs to get together  —   they need to get their    together,” she said. “I love Donald Trump, but I just wish he’d keep his mouth shut sometimes and I wish he’d listen to the people who know what they’re doing. ” Ms. Thompson, who worked at a brokerage firm before retiring, said she had voted early in the special election for Dan Moody, a former state senator, from a throng of candidates that includes Karen Handel, a former county commissioner in Fulton County, and Judson Hill, a former state senator. Other voters were less committed: Edward Holben, 62, an engineer on his way into Whole Foods, said he was not following the race closely but expected to vote Republican. Yet Mr. Holben said he was turned off by partisan rancor in Washington, and unsure of Mr. Trump’s ability to enact major legislation. He called the attempt to restructure the health care system so inept he was unsure Republicans were ever determined to pass it. “You want a   rating?” Mr. Holben asked of the Congress. “How about a  ?”'"}, "time": 1742562560.4728117}