{"duration": 0.10645842552185059, "input_args": {"text": "'Trump’s election breaks chains of political correctness By Ben Tanosborn   Ben Tanosborn \\nOne likely winner to come out of the 2016 US presidential election: accuracy in polling. Obviously not past but future polling! \\nDonald Trump, from the start of his campaign to capture the presidency, harangued his followers during the rallies with such unrestricted language that they felt liberated, able to speak out their minds without any fear of repression or recrimination. Well, at least not in the safety and camaraderie of their rallies; although also aware that politically correct America frowned on such openness, leaving them with a bi-forked tongue when applied to people who would likely judge, or categorize them . . . and that definitely applied to pollsters. \\nOne suspects that as much as 10 percent of the actual Trump vote came out of what we could call correctness-hiding, making total mockery of most pollsters. As a pertinent note I might add that while a student in operations research, I had a professor (Anant Negandhi, UCLA) who then claimed that polling involving issues with sociopolitical subjectivity was for the most part worthless because of the difficulty in modeling a survey which would correctively identify and quantify both the causal and intervening variables. Over a generation later, that difficulty has not really changed; nor has the need of pollsters to make a living, which may push them to sell smoke and mirrors to a well-funded political establishment. \\nMy own observation in weighing the impact of Trump’s campaign on his followers, most particularly those in the construction trades, has been one where from the start of the campaign, and solidly after Trump’s winning the Republican candidacy, these people who had expressed racial and ethnic bias with some trepidation were now doing so with little angst, as if their speech now had society’s imprimatur and they had been godfathered by Donald Trump. \\nAfter the cataclysmic misreading by a polling industry that has reverted from a science to an art . . . lagging miles behind the weather predicting science, one would expect the rigidity of science to take a critical role. So, of necessity if wishing to survive, the entire industry must undergo a true and complete overhaul. And that would be one positive result from this election: accuracy in polling. \\nNow that Trump has become president-elect, to be escorted to the White House by a Republican Congress . . . and a conservative-in-waiting Supreme Court, will the specter of political correctness exit from American life? Not likely; but rest assured that there will be a great degree of accommodation for the 26 percent of American bigoted patriots (bigopats). [Read my article of June 16, 2016: Bigopats: ‘ Undocumented’ Largest Group in American Politics . ] \\nTo say that America is divided is a mini-characterization of incredible proportions that we, as a nation, will have incredible difficulty in overcoming . . . and perhaps never will. First, we must cope with the surreal realization that this United States of America isn’t at all represented by Kansas being a dream away from Oz. The results from this last election have told us the naked truth about our nation; a truth that most Americans would like to keep under wraps: that more than a divided country split in two or more political camps, America is really a fallen Humpty Dumpty fragmented economically, socially, and politically in a way that it will take a Herculean effort to be able to put it back together again. An effort that requires drastic change: both political and institutional. \\nOnce upon a united America, we insist in telling ourselves, we were the land of promise and hope; the great experiment in humankind: economic opportunity, the American dream, the mythical melting pot, freedom, dignity and self-realization. But we seem to forget, that it was the economic wellbeing in the America of generations past that did provide the glue that kept our multi-part Humpty Dumpty (diverse America) sitting smilingly on the wall, looking condescendingly over the rest of the world. \\nGlobalization has melted that glue; and economic change for that symbolic American middle class, whether coming from the Right (Trump) or the Left (Sanders), is unlikely to improve their lot. But at the end of the day, neither would have that middle path that Hillary Clinton would have walked. \\nThe establishment Detestables have lost the Toilet Bowl to Trump’s Deplorables . . . we either grin and bear it; or, for the lack of a better plan, get ourselves dirty fighting Trump’s Movement . . . certifiably a bowel movement in this last Toilet Bowl. Copyright © 2016 Tanosborn \\nBen Tanosborn, columnist, poet and writer, resides in Vancouver, Washington (USA), where he is principal of a business consulting firm. Contact him at .'"}, "time": 1742561717.5274222}