{"duration": 0.08859419822692871, "input_args": {"text": "'The St. Louis Cardinals have sponsored “Christian Day” for 30 years, but recently gay activists have begun to pressure the Major League Baseball team to cancel the special day, or at the very least to remove former Cardinals star Lance Berkman as the event’s spokesman. To it’s credit the team has rejected the demands. [Gay activists are upset that the Cardinals have allowed Berkman to be the spokesman of “Christian Day” because he recently spoke out against transgender boys posing as girls in school locker rooms. As Paul Mirengoff reported, Berkman said:  The issue is, what to do about a 15 or    boy who thinks he’s a girl and wants to shower with the girls. Maybe he is [transgender] maybe he’s confused. But I wouldn’t want him in the shower with my daughters. We shouldn’t have the rights of 2 percent of the population trump the rights of the other 98 percent. In an interview, Berman added, “To me, tolerance is the virtue that’s killing this country. We’re tolerant of everything. You know everything is OK, and as long as you want to do it and as long as it feels good to you then it’s perfectly acceptable do it. Those are the kinds of things that lead you down a slippery slope, and you’ll get in trouble in a hurry. ” LGBTQ in St. Louis was outraged by the player’s comments. A spokesman for St. Louis Pride said they were “disappointed by the decision of the St. Louis Cardinals to provide a public platform for Berkman, an individual whose words and actions towards the LGBTQ+ are divisive and demeaning. ” To their credit, the Cardinals have resisted the demands made by the   activists to remove Berkman or cancel the July 30 “Christian Day” promotion. In a statement, the team said it sees nothing wrong with its sponsorship of Christian Day. “The Cardinals have hosted a Christian Day at the ballpark for nearly three decades,” the team said in its statement. “The   event usually features a   keynote speaker (often a former Cardinal or professional athlete) who talks about his or her experience of being a practicing Christian in the public arena. “Lance Berkman participated in Christian Day when he was a Cardinals player, and we welcome him back this year to discuss his faith. ” The ball team points out that it has a large number of special promotional days to bring members of the community together. “As an organization, the Cardinals have always been committed to bringing   groups together to share in the unifying experience of Cardinals baseball,” the statement continued. “We are an inclusive organization with a social responsibility to be welcoming to all types of people and organizations. “We continue to try and reach out to every part of our community, and have hosted a variety of themed events like Christian Day, Jewish Community Night, Catholic Family Night, Bosnian Heritage Night, Fiesta Cardenales, and many others. “We are excited to announce that we will be hosting our first Pride Night later this season (details to follow shortly) which will bring members of the LGBT Community together to enjoy Cardinals baseball. ” Despite the pressure, the Cardinals have signaled full speed ahead with its Christian Day promotion. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742563760.8700094}