{"duration": 0.05951642990112305, "input_args": {"text": "'In an epic demonstration of showing the that the Democrat Party if full of manure, someone took it upon themselves to dump a truckload of manure in front of the headquarters of the Warren County Democratic Party headquarters in Ohio. \\nThe Washington Post reports : \\nFor those who think this election season can\\'t get crappier, we bring you to Warren County, Ohio, where a large truckload of manure was dumped in front of Warren County Democratic Party headquarters in Lebanon, about 35 miles northeast of Cincinnati. \\nA sheriff\\'s deputy was the first to notice the pile and alerted office leaders of it about 8 a.m. Saturday, local party officials told The Washington Post. \\nAmanda Kelley with WLWT tweeted the following picture. Meanwhile today at Warren County Democratic Headquarters someone dumped a pile of manure #wlwt #Election2016 pic.twitter.com/1rYcOzGZjS \\n— Amanda Kelley (@AmandaWLWT) October 29, 2016 \\nDavid Pepper commented: When they dump manure, we go high! One of our best performing offices, generating strong D early vote. Lesson: keep organizing while they bs pic.twitter.com/0pbrUEPG1O \\n— David Pepper (@DavidPepper) October 29, 2016 \\nIn 2012, something very similar occurred. A pile of manure was dumped almost in front of the headquarters in identical fashion. \\n\"At the time, we did not have a camera system, because it kind of caught us by surprise,\" Bethe Goldenfield, chairwoman of the Warren County Democratic Party, said of the 2012 dump. \"We didn\\'t think something like that would happen.\" \\nThis time, the act was caught on surveillance video that the Warren County Sheriff\\'s Office is now reviewing, Goldenfield said. She did not want to elaborate on what the cameras captured because it was an open investigation, but she noted that it involved a dump truck. \\n\"And I\\'m not going to jump to the conclusion that it was the same person [as in 2012], but of course that crossed my mind,\" Goldenfield said. \"We just need to have a little more specifics, and then hopefully we\\'ll bring the perpetrators to be accountable.\" \\nIt appears to me this is something akin to the Boston Tea Party, only in this case whoever dumped the manure probably paid for it to make a political statement, one that we already know to be true and both the crimes of Barack Hussein Obama Soetoro Sobarkah and Hillary Clinton have demonstrated. That statement is that the Democrat Party is the BS party and cannot be trusted.   shares'"}, "time": 1742561710.6269898}