{"duration": 0.23322319984436035, "input_args": {"text": "'Lisa Tanner October 31, 2016 Four Common Mistakes When Burning Wood \\nDo you heat your house with wood heat? Wood stoves are a great way to provide heat even when the power goes out. They help lower your heat bill . \\nBut, burning wood takes a little preparation. You need to make sure your stove is ready to burn safely throughout the winter months. You’ll have to put up a supply of firewood to see you through the season. \\nHere are some major mistakes people make when burning wood, and how you can avoid them. \\n1. Not Inspecting & Cleaning Your Stove \\nBefore you start burning around the clock, make sure your stove and chimney are ready for the season. As part of this inspection, you’ll want to examine your firebrick lining and see if any of it needs replaced. The brick reflects heat, keeping the body of the stove from overheating. \\nYou’ll also want to make sure the chimney is cleaned. You can either get it cleaned professionally, or do it yourself, whichever you are most comfortable with. This will prevent chimney fires, and help your fire burn more efficiently. \\nIf any of your stovepipe leading to the chimney has a sharp turn, you’ll want to give that section extra attention during cleaning. Creosote can build up quickly in a bend. When your stove is cool, disconnect the pipe if you can and take it outside to ensure its thoroughly cleaned. \\nWhile you’re checking your stove, be sure to check the seal around the door. You want a tight seal to keep smoke from getting into your house. The braid cord that’s around the door in many stove models may occasionally need replaced. \\nOnce everything is in good working order, you’ll be all set to use your stove all winter long. Neglecting these steps can lead to a chimney or house fire. \\n2. Not Having Enough Wood \\nYou don’t want to run out of wood in the middle of winter. It’s always best to have too much wood on hand rather than too little. How much you’ll need depends on many factors, such as: Whether your family is home all day How large your house is How much insulation your house has How low the temperatures drop in your area The type of wood you’ll be burning How hot you like your fires How much of the year you’ll burn \\nI live in a large, old home without much insulation in the rooms we haven’t yet renovated. Most windows are still single-paned. And the kids and I are home all day long. \\nWe burn a lot more wood than my parents who live across the street. Their home is insulated well, has updated windows, and they work out of the house so they just bank their fire before they leave. \\nTen cord of wood is what we try to have on hand at the start of winter. We don’t typically burn it all, but if the temperatures drop below zero, we go through wood at an alarming rate. We also don’t just burn in the “winter” months. To keep the house comfortable, we usually burn September through May. \\nIt’s a lot of wood, but I’d much rather end the burning season with a head start on next winter’s supply than be caught short. We did that once when we first moved here, and falling dead trees with three feet of snow on the ground in the freezing weather wasn’t fun. \\nWhen you make your estimate for firewood usage, estimate high, especially if it’s your first year. You’ll be able to get a better idea of how much wood you used in the spring. That’ll make future estimates easier. \\n3. Not Storing Your Wood Properly \\nOnce you have your firewood cut, it’s time to split it and stack it . You want to make sure it’s not going to get wet over the winter, so store it somewhere dry. \\nIt’s best to store your wood off the ground a bit, like on a pallet. That way the air can circulate throughout the pile and keep everything dry. \\nYou can stack your wood in a woodshed, an old barn, a lean-to, or pallets in the yard with a tarp on top. You’ll want to ensure a couple sides of your woodpile are opened to allow air to circulate. \\nSince wood is flammable and can attract pests, it’s best not to store large quantities of it touching your house or in your basement. \\nProperly storing your firewood will help protect your supply . That way you always have seasoned wood ready to go when you need it. \\nIf you don’t take care of your woodpile, it’ll get exposed to the elements and won’t dry out. \\n4. Not Having a Backup Plan \\nWhat would happen if your wood supply gets stolen or compromised? What if you underestimated how much you’d need and now you’re out? \\nIf you need to heat your home and you’re out of wood, there are some alternatives to burn in your stove. Some will burn quickly, while others will smolder for quite a while. \\nYou should think through a worst-case scenario before winter hits, and examine some of your options. Rolled Jean Logs \\nDo you have old jeans that no longer fit or are so full of holes you can’t wear them? You can roll each pair into a tight log, tie it with string or twine, and then let it burn. \\nThe tighter you roll it, the longer it’ll take to burn. That’s because you’re keeping the air from circulating through it as quickly. \\nTo make a jean roll, you’ll need a pair of jeans and a couple of feet of string. Here’s the way I found to be the easiest. \\nStretch the jeans out in front of you, with the legs closest to your body. Begin rolling one leg. Roll it as tight as you can, jellyroll style. \\nOnce you get to the crotch, take a section of string and tie it around the rolled leg to keep it in place. You’ll want the string to run across the long end of the roll rather than the short end. \\nNow, repeat with the other leg. \\nWhen both legs are secure, grab onto both sections. Slowly begin rolling the leg rolls up into the waist of the pants. It’ll be bulky, so you’ll have to keep pressure on it to keep it tight. \\nThe waist section should completely cover the individual leg rolls and wrap around it a couple of times. Once you’ve reached the top of the jeans, it’s best if you have some help to tie it. That way you can ensure it stays tightly wound. \\nWrap string all the way around it and secure tightly. Repeat in three more places. Now your jean logs are ready for the fireplace. Rolled Paper Logs \\nDo you have a large supply of newspapers on hand? What about books, magazines, or a couple of phone books? This paper can all be used to create rolled paper logs to burn. \\nYou’ll need to stack up your paper before you roll it. You want your finished log to be about three inches in diameter, so you might need to experiment with how much you stack to see how thick your finished product turns out. \\nAs with the jeans, you’ll want to roll the paper as tightly as possible. It’ll take a while to get the first couple of logs rolled, but once you get the hang of it, the process will go more quickly. \\nOnce the paper is rolled, use string, twine, or rubber bands to hold it tightly. You don’t want it to unroll on you. Video first seen on New and Lost Crafts . Green Wood \\nIf you have access to green wood, you can cut it down and it’ll burn. Are there any shrubs, bushes, or trees in your yard that you could get to safely? \\nWhen going this route, keep in mind that green wood burns differently than seasoned wood. It’s harder to start, and may require a propane torch instead of just a match. \\nUnseasoned wood also puts more creosote into your chimney, so you’ll want to ensure you check the chimney frequently for any build up. If you notice build up, let your fire go out and clean the chimney before you use it again. You don’t want to start a chimney fire! An Emergency Tree \\nWe usually pick out one or two emergency trees at the start of each fire burning season. These are standing dead trees on the property that’ll be accessible by tractor even in the middle of winter. If our wood supply is ever compromised, we know that we can get a couple loads from those trees. \\nIf you have your own wooded land, you might consider leaving an emergency tree too. Twisted Straw Sticks \\nYou can take a page out of a Little House book and use the method Laura and Pa did in The Long Winter. When the Ingalls family ran out of wood to burn, they started twisting hay into long sticks. \\nIt was time consuming, but kept the family warm through the long winter. If you have a surplus of hay or straw, you can make your own sticks to burn. You’ll want to ensure the sticks are tightly wound so they burn longer. Broken Furniture and Wood Scraps \\nDo you have any broken wood furniture around your homestead? How about wood scraps from building projects? Both can be burned. \\nWhat other wood burning mistakes can you add? \\nThese are four common mistakes that people burning with wood make. Can you add others to the list? How do you best prepare for your wood burning season? \\n  Lisa Tanner for Survivopedia. 7 total views, 7 views today'"}, "time": 1742561707.1489313}