{"duration": 0.11193513870239258, "input_args": {"text": "'Home | World | Experts: Britain’s National Security at Stake Infiltrated by EU Experts: Britain’s National Security at Stake Infiltrated by EU By Guy Fawkes 05/11/2016 11:17:32 \\nCorruptio optimi pessima est \\nLONDON – England – The High Court decision to quash Brexit is proof that there are clandestine operatives within the system who only hold allegiance to Brussels and not to the United Kingdom. \\n\\n\\nOnly a purge of the political, judicial, and defence sectors can save Britain from the mass infiltration of EU operatives working within the British governmental institutions. \\nThese people have been identified during the EU referendum and must be purged from the system otherwise these treasonous operatives of the EU could cause further harm to the British constitution and Britain’s national security. \\nWe have seen the damage already committed within the judicial system when EU operative judges were allowed to preside over the Brexit ruling and attempted to thwart the vote of the electorate on the EU referendum. \\nThe blatantly biased decision by these EU judges, one of which is Lord Carnwath, 71, who was one of four co-founders of the EU Forum of Judges for the Environment and served as the forum’s secretary general from 2004-05. The body exists to “promote the enforcement of national, European and international environmental law”. \\nL ord Reed, began his career as an advisor to the Scottish education department, served as a judge in the European Court of Human Rights, who also acted as an expert adviser to the European Union Initiative with Turkey on Democratisation and Human Rights between 2002 and 2004, and the following year he became chairman of the Franco-British Judicial Co-operation Committee. \\nThe other EU judge is Lord Kerr, 68, who also sat as a judge in the European Court of Human Rights, ruling on a case in 2001 involving aircraft noise from Heathrow. \\nAdditionally we have L ord Mance, 73, who began his career working for a law firm in Hamburg, before qualifying as a barrister in 1965. His time in Germany gave him a taste for international legal affairs, and he has represented the UK on the Council of Europe’s Consultative Council of European Judges, which was set up in 2000 to advise the Council of Europe on the “independence, impartiality and competence” of judges. He has also served as a member of a seven-person EU panel that helps select judges and advocates-general of the European Court of Justice and General Court. \\nThese elements within the panel were clearly not impartial in their decision purely on their heavily entrenched links with the EU. \\nImpartiality within law regarding key national security decisions like Brexit should be paramount to the judicial system within Britain therefore in justice terms, their decision to thwart Brexit, and the EU referendum result, voted for by 52% of the electorate, is wholly unjust and biased, bordering on corruption at the highest levels. \\nThe question of corruption should be implemented with a full public inquiry into how these judges were selected and how they were allowed to come to their obviously biased non impartial decision. We must as a democracy look into any form of clandestine payments given to the judges prior to their decision, and if any discrepancy is found it must be put right. \\nBritain’s national sovereignty is at stake, and treachery, corruption at the highest judicial levels must be eradicated to conserve our constitution. To purge the institutions of EU collaborators and clandestine operatives should be of paramount import in order to solidify Britain’s national security and overall sovereign status. Share on :'"}, "time": 1742561804.6447325}