{"duration": 0.1367502212524414, "input_args": {"text": "'Shapiro Eviscerates Raucous Protesters At University Of Wisconsin By: Hank Berrien November 16, 2016 \\nDaily Wire Editor-in-Chief Ben Shapiro spoke at the University of Wisconsin-Madison on Wednesday night, and amid raucous leftist protesters who consistently tried to interrupt him and even blocked him from being seen by the audience by creating a human wall in front of him, found a way to respond with hilarious repartee that left the audience howling and the protesters eventually filing meekly out of the auditorium. \\nAfter the ovation he received on entering, Shapiro quipped, “Hey look at this. A campus that doesn’t actually try to arrest me when I come.” He continued, “Before I begin, I did come bearing gifts for the social justice warriors in this room. I hear you’ve started wearing these safety pins around because you want to show your fellow college students how you’re not one of these awful, terrible Trump people, that you’re sensitive, and that you want to signal your virtue, so I’ve brought along these safety pins, (holding up safety pins) and I also brought you something to wear them with – this diaper.\" \\nShapiro then held up a diaper, prompting huge laughs from the audience. \\nWhen a protester yelled at Shapiro that he should be “wearing a swastika,” Shapiro held out his yarmulke, then fired back, “In case you hadn’t noticed, the folks with the swastikas aren’t too nice to my type.” \\nShapiro continued, “Stop being self-indulgent children; stop pretending that everybody who voted for Trump is a vicious racist; it’s your right to protest, of course, but you just make yourself look like an idiot when you cry over a duly-held election … Donald Trump doesn’t care about your protest. Donald Trump is sitting somewhere in Trump Tower eating a steak and bathing in your salty, salty tears.” \\nReferring to the attempt by leftists to prevent people who weren’t university students from attending Shapiro’s lecture, Shapiro opined: “I hear that a lot of folks at this publicly-funded university want this campus to become a sanctuary campus for illegal immigrants. I do have a quick question: if this campus can be a sanctuary for people in the country illegally, why are so many people trying to ban American citizens from this community from coming to this lecture? And by the way, I’m aware of this private Facebook page titled ‘F(***) White Supremacy: Interrupting Ben Shapiro.\\' With all due respect, ‘F’ you right back, gang.” \\nAfter the applause subsided and Shapiro joked about how both Black Lives Mater and the KKK target him, the real fun began. Protesters stood up, chanting, “Shame” over and over again. \\nShapiro quipped, “Wow, it’s like Game of Thrones . Should I get undressed and walk down the aisle?” \\nThe bulk of the crowd started booing the protesters. Shapiro addressed the protesters, saying, “I’m happy to talk with you,” but they responded by screaming “safety” over and over. Shapiro joked, “Did somebody fart?” The crowd responded to the protesters by chanting, “USA.” \\nShapiro replied, “I tell you try not to be children; the first thing you do is start screaming like my two-year-old.” He added, “You see, this is how conservatives actually treat people; you stand up and you interrupt and you shout ‘Safety,” and you’re perfectly safe. Look at that. It’s amazing.” That provoked sustained applause. \\nWhen the protesters started screaming “Shame” again, Shapiro eviscerated them, pointing out, “If you’re going to pick a chant like ‘Shame,’ watch Game of Thrones first. The bad guys shout ‘Shame.’” The audience loved that line. On a roll, Shapiro continued, “You’re not changing anybody’s mind, All you’re showing everybody is that your collective IQ, if it were channeled into electricity, night be able to toast a piece of bread lightly.” \\nHe continued, “Okay, can we talk now, or are you going to keep shouting? Now’s your chance to get it out. Let’s hear your feelings. C’mon. Just go for it. Or is it going to be like every thirty seconds; like an annoying microwave timer?” \\nWhen the protesters resumed chanting, Shapiro responded, “If you guys want to talk, we can talk, If you want to shout, get the hell out.” More applause. \\nShapiro fired, “For God\\'s sake, at least wait until I say something that offends you before getting offended.\" \\nShapiro returned to deconstructing the term “social justice.” When the protesters started again, a woman who runs a soup kitchen stood up, and admonished the protesters that she had driven for ten hours that day, and that they should “shut freaking up and listen to the man speak.” That prompted a standing ovation from the crowd and Shapiro. too. He added, “See, that’s what a decent, hard-working person sounds like as opposed to a loser student here on the public dime, presumably.” \\nShapiro returned to his speech: “Racial diversity doesn’t mean anything; decency means everything … Diversity isn’t our strength; decency is our strength.” He turned to the protesters: Remember that? Decency.” \\nThe protesters screamed back, “Shame!” Shapiro fired back, “Decency!” The protesters chanted “Shame” but the crowd soon joined Shapiro in chanting “Decency,” shutting the protesters up. \\nAs Shapiro spoke of the falsity of “white privilege,” the protesters formed a line in front of Shapiro, prompting him to quip, “If you guys are all going to come up here, can we all just have circle time or something?” \\nThe protesters chanted “Safety” for a minute and a half, but then the crowd started yelling back, “Free speech matters.” Shapiro turned to the blackboard behind him and wrote in capital letters, “MORONS” That again prompted cheering. \\nOne member of the audience yelled to the protesters, “At least tell us what you want, or otherwise, just get out!” That brought a sustained ovation. \\nAfter one protester tried to deliver a whiny monologue, the protesters started shouting “Safety” again, then filed out, yelling “F*** white supremacy” while flipping off Shapiro and the entire audience. That prompted the crowd to sing, “Na-na-na-na, na-na-na-na, hey, hey, good-bye.” It also promoted this from Shapiro: \\nEven after leaving the lecture hall, protestors continued to pound on the door. \\nAfter Shapiro explained why the protesters had not been arrested, as the university stated that it gave the protesters time to protest at the front of the stage, or otherwise it would have to shut down the entire event, he continued, “All I can wonder is if the administration would allow the same sort of privilege for any sort of conservative who decided to do this at a leftist event.” \\nEven after leaving the lecture hall, protestors continued to pound on the door, prompting Shapiro to quip, “Doesn’t this school give homework? Does anybody have a job around here? I guess when you’re majoring in gender and diversity studies you have a lot of time on your hands.” \\nShapiro noted that he had engaged in a back-and-forth with one of the protesters, who accused him of being a white supremacist. When he asked her why she thought so, she replied that she got that impression from his image. He fired back, “Really? Was it the yarmulke that did it for you?” \\nHe took another shot at the protesters during the speech, noting that people were born unequal, and adding, “Some people us are born rich; some of us are born poor; some of us are born smart; some of us are born protesters.” \\nThe rest of the speech was vintage Shapiro, as was the Q&A afterward. Even the chalk was impressive: \\nWent back to the lecture hall and grabbed the EXACT piece of chalk @benshapiro used to write MORONS! #FactsNotFeelings #onlyatYAF pic.twitter.com/W0Ch06SaGR — Japheth Patterson (@japhood) November 17, 2016 \\n\\nVideo of entire event below: \\n'"}, "time": 1742561921.360053}