{"duration": 0.12761712074279785, "input_args": {"text": "\"‹ › Debbie Menon is an independent writer based in Dubai. She is Editor-in-Chief of VeteransNewsNow.com Her main focus are the US-Mid-East Conflicts. Her writing has been featured in several print and online publications in the Middle East. She is committed to exposing (AIPAC) the Israel Lobby's control of American policy for the Middle East. Control which amounts to treason by the Zionist Lobbies in America and its stooges in Congress, and that guarantees there can never be a peaceful resolution of the Middle East conflicts, only catastrophe for all, in the region and the world. Her focus is Israel’s drift towards greater oppression of the Palestinian people; the political deceptions and crisis in Syria and Ukraine; the cold hard facts about America’s so-called ‘war on terror’ and grim future; countering the propaganda war towards Iran & Russia and calling attention to, the new, developing, promising, strategic alliances as a consequence. Her mission is to inform and educate the public on issues of the US/Middle East conflicts that are unreported, underreported, or distorted in the Zionist owned American Media. Her writing reflects the incredible resilience, almost superhuman steadfastness of the occupied and oppressed Palestinians, who are now facing the prospect of a final round of ethnic cleansing. Her mission is to inform and educate internet viewers seeking unfiltered information about real events on issues of the US/Middle East conflicts that are unreported, underreported, or distorted in the American media. Her purpose is to look at the current reality from a different and critical perspective, not to simply rehash the pro-US/Israel perspective, smoke and mirrors that has been allowed to utterly and completely dominate Mainstream discourse. PS: For those of her detractors that think she is being selective and even “one sided,” tough, that is the point of her work, to present an alternative view and interpretation of the US-Israel-Middle East conflict, that has been completely ignored in mainstream discourse and denied the US public. Oh, and she is not Muslim or Palestinian and not married to one either! She is practicing Roman catholic. Donald Trump delivers POWERFUL policy speech on First 100 Days In Office By Debbie Menon on October 24, 2016 GROUNDBREAKING CONTRACT FOR THE AMERICAN VOTER \\nTrump Presents 100-Day Plan To Make America Great Again – For Everyone \\nGettysburg, PA: Today, in historic Gettysburg, PA, Donald J. Trump presented a game-changing plan for his first 100 days in office. This revolutionary “Contract with the American Voter” will ensure that America’s economy is revitalized and citizens are protected. \\n“I’m not a politician, and have never wanted to be one. But when I saw the trouble our country was in, I knew I couldn’t stand by and watch any longer. Our country has been so good to me, I love our country, I felt I had to act,” said Mr. Trump in his address. \\n“Change has to come from outside this broken system. The fact that the Washington establishment has tried so hard to stop our campaign is only more proof that our campaign represents the kind of change that only arrives once in a lifetime,” he continued. \\n“I am asking the American people to rise above the noise and the clutter of our broken politics, and to embrace that great faith and optimism that has always been the central ingredient in the American character. I am asking you to dream big. \\n“What follows is my 100-day action plan to Make America Great Again. It is a contract between Donald J. Trump and the American voter – and begins with restoring honesty, accountability and change to Washington,” he concluded. \\nDONALD J. TRUMP CONTRACT WITH THE AMERICAN VOTER \\n“Therefore, on the first day of my term of office, my administration will immediately pursue the following six measures to clean up the corruption and special interest collusion in Washington, DC: \\nFIRST, propose a Constitutional Amendment to impose term limits on all members of Congress; SECOND, a hiring freeze on all federal employees to reduce federal workforce through attrition (exempting military, public safety, and public health); THIRD, a requirement that for every new federal regulation, two existing regulations must be eliminated; FOURTH, a 5 year-ban on White House and Congressional officials becoming lobbyists after they leave government service; FIFTH, a lifetime ban on White House officials lobbying on behalf of a foreign government; SIXTH, a complete ban on foreign lobbyists raising money for American elections. \\nOn the same day, I will begin taking the following seven actions to protect American workers: \\nFIRST, I will announce my intention to renegotiate NAFTA or withdraw from the deal under Article 2205 SECOND, I will announce our withdrawal from the Trans-Pacific Partnership THIRD, I will direct my Secretary of the Treasury to label China a currency manipulator FOURTH, I will direct the Secretary of Commerce and U.S. Trade Representative to identify all foreign trading abuses that unfairly impact American workers and direct them to use every tool under American and international law to end those abuses immediately FIFTH, I will lift the restrictions on the production of $50 trillion dollars’ worth of job-producing American energy reserves, including shale, oil, natural gas and clean coal. SIXTH, lift the Obama-Clinton roadblocks and allow vital energy infrastructure projects, like the Keystone Pipeline, to move forward SEVENTH, cancel billions in payments to U.N. climate change programs and use the money to fix America’s water and environmental infrastructure \\nAdditionally, on the first day, I will take the following five actions to restore security and the constitutional rule of law: \\nFIRST, cancel every unconstitutional executive action, memorandum and order issued by President Obama SECOND, begin the process of selecting a replacement for Justice Scalia from one of the 20 judges on my list, who will uphold and defend the Constitution of the United States THIRD, cancel all federal funding to Sanctuary Cities FOURTH, begin removing the more than 2 million criminal illegal immigrants from the country and cancel visas to foreign countries that won’t take them back FIFTH, suspend immigration from terror-prone regions where vetting cannot safely occur. All vetting of people coming into our country will be considered extreme vetting. \\nNext, I will work with Congress to introduce the following broader legislative measures and fight for their passage within the first 100 days of my Administration: \\n1. Middle Class Tax Relief And Simplification Act. An economic plan designed to grow the economy 4% per year and create at least 25 million new jobs through massive tax reduction and simplification, in combination with trade reform, regulatory relief, and lifting the restrictions on American energy. The largest tax reductions are for the middle class. A middle-class family with 2 children will get a 35% tax cut. The current number of brackets will be reduced from 7 to 3, and tax forms will likewise be greatly simplified. The business rate will be lowered from 35 to 15 percent, and the trillions of dollars of American corporate money overseas can now be brought back at a 10 percent rate. \\n2. End The Offshoring Act Establishes tariffs to discourage companies from laying off their workers in order to relocate in other countries and ship their products back to the U.S. tax-free. \\n3. American Energy & Infrastructure Act. Leverages public-private partnerships, and private investments through tax incentives, to spur $1 trillion in infrastructure investment over 10 years. It is revenue neutral. \\n4. School Choice And Education Opportunity Act. Redirects education dollars to gives parents the right to send their kid to the public, private, charter, magnet, religious or home school of their choice. Ends common core, brings education supervision to local communities. It expands vocational and technical education, and make 2 and 4-year college more affordable. \\n5. Repeal and Replace Obamacare Act. Fully repeals Obamacare and replaces it with Health Savings Accounts, the ability to purchase health insurance across state lines, and lets states manage Medicaid funds. Reforms will also include cutting the red tape at the FDA: there are over 4,000 drugs awaiting approval, and we especially want to speed the approval of life-saving medications. \\n6. Affordable Childcare and Eldercare Act. Allows Americans to deduct childcare and elder care from their taxes, incentivizes employers to provide on-site childcare services, and creates tax-free Dependent Care Savings Accounts for both young and elderly dependents, with matching contributions for low-income families. \\n7. End Illegal Immigration Act Fully-funds the construction of a wall on our southern border with the full understanding that the country Mexico will be reimbursing the United States for the full cost of such wall; establishes a 2-year mandatory minimum federal prison sentence for illegally re-entering the U.S. after a previous deportation, and a 5-year mandatory minimum for illegally re-entering for those with felony convictions, multiple misdemeanor convictions or two or more prior deportations; also reforms visa rules to enhance penalties for overstaying and to ensure open jobs are offered to American workers first. \\n8. Restoring Community Safety Act. Reduces surging crime, drugs and violence by creating a Task Force On Violent Crime and increasing funding for programs that train and assist local police; increases resources for federal law enforcement agencies and federal prosecutors to dismantle criminal gangs and put violent offenders behind bars. \\n9. Restoring National Security Act. Rebuilds our military by eliminating the defense sequester and expanding military investment; provides Veterans with the ability to receive public VA treatment or attend the private doctor of their choice; protects our vital infrastructure from cyber-attack; establishes new screening procedures for immigration to ensure those who are admitted to our country support our people and our values \\n10. Clean up Corruption in Washington Act. Enacts new ethics reforms to Drain the Swamp and reduce the corrupting influence of special interests on our politics. \\nOn November 8th, Americans will be voting for this 100-day plan to restore prosperity to our economy, security to our communities, and honesty to our government. \\nThis is my pledge to you. \\nAnd if we follow these steps, we will once more have a government of, by and for the people.” Related Posts:\""}, "time": 1742628326.8177354}