{"duration": 0.07008790969848633, "input_args": {"text": "'We Are Change \\nIn perhaps the most disturbing Wikileaks release to date, Tony Podesta (John Podesta’s brother) is invited to a “Spirit Cooking” dinner with performance artist Marina Abramovi?.\\nDinner with a famous artist might sound deeply mundane, but there is far more to this story.\\nAbramovi?, 69, is a fairly famous Serbian performance artist, who now lives in New York.\\nIn an email dated June 28, 2015, Abramovi? wrote:\\n“Dear Tony,\\nI am so looking forward to the Spirit Cooking dinner at my place. Do you think you will be able to let me know if your brother is joining?\\nAll my love, Marina”\\nTony then forwarded the email to his brother, John, asking:\\n“Are you in NYC Thursday July 9\\nMarina wants you to come to dinner\\nMary?”\\nWhile this seems like a completely normal and uninspiring email, a look at what “spirit cooking” is, changes things immediately.\\nIn the video, Abramovi? is seen painting the recipe for these “spirit dinners,” using what appears to be thickly congealed blood. The recipe read, at one point, “mix fresh breast milk with fresh sperm, drink on earthquake nights.”\\n\\nSo, we have to ask, did John Podesta’s brother invite him to go drink semen mixed with breast milk? Yikes. \\n\\nAbramovi? is known for her often-gory art that confronts pain and ritual. Her first performance involved repeatedly, stabbing herself in her hands. The next performance featured her throwing her nails, toenails, and hair into a flaming five-point star — which she eventually jumped inside of, causing her to lose consciousness.\\nDuring the next, she ingested a medication to treat people who are catatonic, which caused violent muscle spasms.\\nPerhaps most famously, in 1974, Abramovi? placed 72 objects on a table, including a rose, a feather, honey, a whip, olive oil, scissors, a scalpel — and a gun and a single bullet. Alongside the items was a sign informing the audience that the items could be used on her in any way that they chose.\\nFor six hours, she remained at the mercy of the audience, allowing them to do as they pleased. During that time, she was stripped, cut, and one audience member even held the gun to her head.\\n“What I learned was that … if you leave it up to the audience, they can kill you. … I felt really violated: they cut up my clothes, stuck rose thorns in my stomach, one person aimed the gun at my head, and another took it away. It created an aggressive atmosphere. After exactly 6 hours, as planned, I stood up and started walking toward the audience. Everyone ran away, to escape an actual confrontation,” she later said of the performance.\\nWe really just want to know what Podesta had for dinner.\\nThe post Spirit Cooking: The Most Disturbing Podesta Email Yet? (Warning: Graphic Content) appeared first on We Are Change .\\n'"}, "time": 1742561682.3855484}