{"duration": 0.07634544372558594, "input_args": {"text": "'Despite being present in the country long before its independence, the Christians in Pakistan are among the nation’s most persecuted victims of social discrimination, mob violence, and the   threat of terrorist attacks. [In Lahore, the Christian community recently celebrated its first Easter without an attack on its churches since 2014. The Pakistani army announced that they had foiled this year’s plot to attack the community, finding suicide vests and other weapons in the home of a suspected jihadist.  On Easter 2015, suicide bombers targeted two churches in Lahore on Easter, killing fourteen. The next year, a bomb claimed by the Pakistani Taliban targeted a Lahore park, killing 72 and injuring hundreds, mostly women and children. As the leader of the Catholic community there, Archbishop Sebastian Shaw OFM of Lahore faces the formidable task of keeping his community’s spirits high while engaging the majority Muslim community in order to turn the tides of suspicion against Christians. In an exclusive interview with Breitbart News arranged alongside the Catholic charity Aid to the Church in Need, the Archbishop emphasized the need for interfaith dialogue and   education for Christians in creating a more tolerant and peaceful Pakistan, the former necessary for breaking down unfounded stereotypes and the latter to allow for better dialogue. The better Christians know their own faith, he noted, the better equipped they are to educate those of other religions who may see Christians as a threat to national stability. “Children should have a good knowledge of their own religion,” he explained. “If we talk to people for interreligious dialogue, one has to know about his or her own religion. Otherwise, [dialogue] turns into debate, and debate ends in enmity and sour relations. ” “We are a very small minority, but we are very strong in faith and very loyal and faithful to the country,” Archbishop Shaw emphasized. “Christians are in the army, they are in the judiciary, in the schools and education, hospitals. All together we are working for the progress and fortification of Pakistan. ” In the   however, the Archbishop noted that Christians must live with the reality that they will face threats of violence from terrorists and mobs incensed by accusations of blasphemy and that includes heavy investments in security and cooperation with the Pakistani government. “Christian volunteers are very alert, we have to be very alert and vigilant for any big event. It’s not good, but this is the way we are living now,” he lamented. “The pressure [from violent actors] is there, sometimes growing, but at the same time, all government agencies are more alert. When they have security meetings, they invite our churches also, so in this way, the network is very good. ” The local Catholic Church is investing in a variety of new security measures for its churches, from higher fences to security cameras to armed guards, he said. Christian officials and volunteers reach out to politicians who sympathize with the community as well. Most importantly to the Archbishop, however, were appeals to interfaith dialogue and eradicating the belief that Christians were somehow less patriotic or more loyal to foreign powers than Muslim Pakistanis. “After   [the September 11, 2001,   attacks]  —   before that also, but more after    —   many people thought that to be Christian in Pakistan means we are allies to America or the West,” he noted. “So that’s why many of our churches and institutions were attacked. ” “Through interreligious dialogue, people of different faiths came together, we started talking, sharing ideas about peace, coexistence, and how to make our society a better society for everyone,” the Archbishop added. “We started explaining that God has given us this planet, this planet is for everybody, a person is free to have his or her own religion, that is a choice God gives us. ” Archbishop Shaw noted that not all action against Christian persecution is dialogue, however. He highlighted the need for Christians to practice Christianity towards all, particularly through charity acts, to show Pakistani Muslims that there is no need to fear or attack Christians. He noted a particular instance in which Christians united to aid victims of a major flood. “People knew that [the charity work] was within the church, and the church was helping people with the reconstruction of houses, building of schools,” he noted. “The schools are for everybody  —   in all our schools, 90 percent of students are Muslims  —   so they know that Christians, especially Catholics, are serving all people regardless of creed or religion. ” Christian schools have long served Muslims in Pakistan, particularly the nation’s higher classes who have the means to choose their children’s education. “Christian schools and universities are a prominent part of the Pakistani educational system and are highly regarded by Muslims and the Pakistani government,” Sara Singha explains in her chapter in Christianity and Freedom: Volume 2, Contemporary Perspectives. “Many of these schools incorporate Christian values into curricula and are preferred by Muslim elites because of their moral and educational training. ” To those he serves, Archbishop Shaw delivers a simple message of hope: “If you are born in Pakistan, be happy because God has a purpose for you. If not, you would have been born in America or somewhere else. Try to understand the purpose of your being and purpose of your life to become a true follower of Christ and give witness to the lessons of risen Christ. ” He highlights what he calls “the two F’s: don’t live in fear, and do not fight. ” “Jesus gave us a new commandment: love one another,” he explains. “We should have a point of view of the world that we are not here to fight with anybody and we are also not here to live in fear. We are here to respect ourselves and respect other people. We feel it is the right approach to work for coexistence and a peaceful society in the future. ”'"}, "time": 1742562316.4120533}