{"duration": 0.03277397155761719, "input_args": {"text": "'Based on his experiences living in Europe and the “  ” problems now being committed in the name of liberalism in California, model and actor Fabio warns Americans, “Don’t ever give up your guns. ”[He suggests liberals have divided people and are using the split to push their   agenda. He said, “The current division in the country only makes politicians stronger. When people are divided, the politicians can do whatever. When people are united, that’s a dangerous thing. ”  According to LifeZette, Fabio recalled arriving in America for the first time, saying, “It was like a beautiful dream. It was like paradise. I fell in love with this country. ” But he has watched sweeping change occur under Democrats like Governor Jerry Brown, and he indicates that the change favors criminals while leaving police “demoralized. ” He said, “It’s a disaster. It’s an epidemic. I’ve been around the world. I’ve been to Africa. Everywhere. Downtown Los Angeles now looks like a   country. ” Fabio said LA is is full of “  streets and sidewalks” and also has “  ” crime and homeless problems. And he warned that things are going to get worse because of Proposition 57. Fabio said that proposition was ubiquitously promoted to save money by releasing “nonviolent” criminals from prison, but he says Prop. 57 has actually resulted in a reduction in sentences for “human trafficking involving sex with minors, assault with a deadly weapon, attempting to explode a bomb in a school or hospital, discharging a firearm on school guards, failing to register as a sex offender   …     the list goes on and on and on. ” Fabio said, “Just look at Europe and go the opposite way. It’s as simple as that. Europe already jumped off the cliff. They are doomed. ” He added: Don’t you ever give up your guns. If people lose that right, forget about it. Politicians  —   they will take everything away from you. And then what are you going to do, protest with a rock? Because that’s what they do in Europe. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562955.6756017}