{"duration": 0.08434581756591797, "input_args": {"text": "'A national poll released Monday showed Philippine President Rodrigo Duterte’s popularity holding steady, with 80 percent of respondents saying they have “much trust” in the controversial strongman. [The Social Weather Stations (SWS) polling occurs after every annual quarter, this poll taken between March 25 to 28 but published Monday. The SWS poll found that ten percent of the 1, 200 respondents had “little” trust in Duterte, and another nearly 11 percent were undecided. Reuters notes that this represents a   drop from his   “much trust” approval rating in December 2016. Throughout the entirety of SWS’s tracking of Duterte  —   since December 2015  —   Duterte has remained near the   mark, with his highest rating at 84 percent after his election but before his inauguration. Reuters adds that Duterte’s initial trust rating in December 2015 was at 47 percent.  Duterte’s ratings are better with men than women, as 83 percent of men and 79 percent of women say they had “much trust” in the president, gaining one percentage point among men and one among women. Regionally, his best ratings came from his native Mindanao, a southern Philippine island, where 90 percent of respondents said they had “much trust” in Duterte, down from 92 percent in December. The Philippine Star notes that the presidential palace announced the numbers with pride, as SWS deems an 80 percent “much trust” percentage as an “excellent” approval rating. “The President continues to be the most trusted national leader today,” presidential spokesman Ernesto Arbella told reporters. “His net trust rating has been excellent for four consecutive quarters, considering the deeply entrenched culture of illegal drugs, criminality and corruption. ” Duterte’s enduring popularity appears unaffected by a global campaign to raise awareness about his call for extrajudicial killings against drug suspects. Duterte, who won the presidency on a campaign to eradicate drug crime calling upon his   tenure as the mayor of Davao City, where he enacted sprawling   initiatives. Duterte has encouraged civilians to kill suspected drug criminals and offered them bounties. He also claimed to have killed suspects himself as mayor. In December, SWS found that his policies against drugs were largely popular. While 80 percent of respondents said they personally feared being killed as part of Duterte’s drug war, 85 percent said they approved of Duterte’s approach to solving the problem.   a regional broadcast outlet, quotes experts stating that Duterte’s popularity is largely the product of his populist,   image. “He comes across very strongly as ‘makamasa’ and it’s not only giving an impression, he packs that with good action,” Fr. Ranhilio Aquino, dean of the San Beda Graduate School of Law, told the outlet. “Makamasa” is a Tagalog term roughly meaning “man of the people. ” Duterte refuses to live in the presidential palace, Malacanang, in Manila, for fear of it being haunted by late presidents. Instead, he lives in his humble Mindanao home while he is not in the capital. In January, Duterte hosted Japanese Prime Minister Shinzo Abe at his home instead of Malacanang, offering him a traditional breakfast and his favorite mosquito net. The positive ratings for Duterte arrive as he embarks on a foreign policy venture around Asia. The presidential palace announced that Duterte will leave the country on May 10 to visit Cambodia, Hong Kong, and China. Among the items on Duterte’s agenda is a meeting of the World Economic Forum (WEF) where an estimated 700 “leaders from business, government, and civil society groups” will convene. Duterte’s visit to China also arrives following what appears to be a shift in policy from the Philippine president, who once boasted of seeking to sever ties with the United States to get closer to Beijing but has since offered President Donald Trump “full friendship and cooperation. ” Follow Frances Martel on Facebook and Twitter.'"}, "time": 1742563402.0534828}