{"duration": 0.07947301864624023, "input_args": {"text": "'Loading Posted on November 4, 2016 Putin Condemns Europe’s Handling of Migrants and Says the Child Rape in Austria Shows ‘a Dilution of National Values’ Jennifer Newton, Daily Mail, November 3, 2016 \\nVladimir Putin has waded into the migrant crisis condemning Europe’s handling of asylum seekers and saying a case of child rape in Austria ‘dilutes national values’. \\nThe Russian president has largely kept quiet over the refugee crisis in Europe but has now spoken out of his disbelief over its handling claiming that a continent that ‘can’t protect its children’ has no future. \\nHis comments come off the back of a case in Austria last week, which saw an Iraqi migrant have his conviction of raping a 10-year-old boy at a swimming pool in Vienna overturned. \\nHe was originally convicted of the crime but it was overturned because a court didn’t prove he realised the boy was saying no. \\nIt came after the migrant, identified as 20-year-old Amir A., claimed that it was a ‘sexual emergency’ because he had not had sex for four months. \\nA second trial for the rape is expected to take place next year, but the attacker is likely to remain in custody until then. \\nAnd speaking at a press conference this week, Putin slammed Europe’s migration policy and cited the case, where the victim was from a Serbian family living in Austria. \\nHe said: ‘In a European country, a child is raped by a migrant, and the court releases him. \\n‘It doesn’t fit into my head what on earth they’re thinking over there. \\n‘I can’t even explain the rationale–is it a sense of guilt before the migrants? What’s going on? It’s not clear.’ \\nHe also claimed that the case highlighted ‘the dissolution of traditional national values’ adding: ‘A society that cannot defend its children has no future.’ \\nAnd Putin’s words appeared to have struck a chord, as he is extremely popular with Serbs. \\nIn the rape case, the boy had arrived in Austria with his Serbian mother, who paid for him to go to the Theresienbad swimming pool, where he was violently attacked. \\nThe boy was so badly injured that he needed hospital treatment but he will be forced to go back to court for the Iraqi man’s second trial, outraging the Austrian Serbian community. \\nAustrian media say the case has hardened the communities position against asylum seekers, who were previously divided about whether to vote for the left-leaning Green party candidate or the far right option Nobert Hofer in upcoming elections. \\nHowever, it is not the first time Russia has lashed out at the EU’s handling of the migrant crisis. \\nIn March, Konstantin Romodanovsky, head of Russia’s Federal Migration Service accused leaders of willfully ignoring cultural differences that have caused such widespread friction and chaos across the Continent. \\nHe also added that ‘multiculturalism has failed’ because Europe never formed a unified strategy to integrate refugees into Western society. \\nHe said: ‘The European Commission left it up to individual nations to decide how they want to treat asylum seekers–despite the fact the policies and capabilities of member states are very different. \\nRomodanovsky also accused EU countries of ignoring the ‘differences in culture, religious traditions, and customs’ with the refugees, the vast majority of whom are Islamic.'"}, "time": 1742562323.4871485}