{"duration": 0.04748415946960449, "input_args": {"text": "'Despite Widespread Concerns, DOJ Spreads Election Monitors Thin 2013 gutting of Voting Rights Act means fewer full-access election observers will be stationed at polling places. | November 8, 2016 Be Sociable, Share! Inflatable figures direct voters at the Santa Clara County Registrar of Voters, Oct. 24, 2016, in San Jose, Calif. \\nThe 2013 gutting of the Voting Rights Act means the U.S. Department of Justice (DOJ) will deploy just 500 election monitors to polling places in 28 states on Tuesday—hundreds less than in 2012, and imbued with limited powers. \\nThe DOJ made its announcement Monday amid escalated concerns about voter intimidation and discrimination . \\n“The bedrock of our democracy is the right to vote, and the Department of Justice works tirelessly to uphold that right not only on Election Day, but every day,” said Attorney General Loretta Lynch. “The department is deeply committed to the fair and unbiased application of our voting rights laws and we will work tirelessly to ensure that every eligible person that wants to do so is able to cast a ballot.” \\nBut the U.S. Supreme Court’s decision in Shelby County, Alabama v. Holder , which struck down parts of the 1965 Voting Rights Act (VRA), means that work will be curtailed as compared with previous years. \\nThe 500 personnel will be deployed in 67 jurisdictions across 28 states; in 2012 there were 780 monitors sent to 51 jurisdictions in 24 states. \\nNot all the DOJ officials will have the full powers of election “observers.” As Reuters explains : Most of those states will receive Justice Department staff who have no statutory authority to access polling sites as a result of a 2013 Supreme Court decision that struck down parts of the Voting Rights Act, curtailing the department’s ability to deploy election observers with unfettered access to the polls. […] Courts have granted the Justice Department permission to deploy full-access observers in five states: Alaska, California, Louisiana, New York, and Alabama. But the court order for Alabama only pertains to municipal elections and it is not on the list of states where the Justice Department is deploying poll watchers this year. The Justice Department staff who are deployed to the other 24 states on Tuesday will be election “monitors”, who must rely on local and state authorities to grant them access to polling locations. \\nBloomberg notes that the DOJ was able to send observers to 13 states in 2012. \\nAccording to the DOJ, the agency’s Civil Rights Division will monitor the election on the ground in the following 67 jurisdictions: Bethel Census Area, Alaska;'"}, "time": 1742562679.3006196}