{"duration": 0.03680586814880371, "input_args": {"text": "'Hillary Dressed In The Most Perfect ‘Costume’ Today Without Realizing It Posted on October 31, 2016 by Amanda Shea in Politics Share This Hillary Clinton in “costume” \\nFor the first time in her campaigning, Hillary Clinton is working overtime, now that we’re in the final hours of this election and she has a major FBI scandal to try to cover up. She’s not letting a holiday like Halloween hold her back from her scheduled speaking engagements, scaring everyone she meets with what she inadvertently decided to dress up as. \\nThe troubled Democratic candidate showed up at Kent State University to greet another anemic crowd that she’s become accustomed to seeing. While she thought she was treating them with her presence, the “trick” was actually on her when everyone took a closer look at what she was wearing and saw the irony in it based on everything Americans have seen over recent weeks. \\nWhile she didn’t depart from her typical androgynous pantsuit garb, there was something else about her outfit hidden in plain sight. As the American Mirror point out, every inch of the draping fabric she had on was crimson red, making her appear like she dressed as a walking blood clot for Halloween. \\nSince clots have been suspected as contributing to her health issues, which she’s had a hard time hiding, the irony of the outfit wasn’t lost on those looking for deeper meaning in what she picked to wear on this particular holiday. Hillary Clinton in all crimson red at Kent State today on Halloween \\nAccording to The Sun , Hillary has been known to have clotting issues in the past when they reported on this condition in September. “Clinton had a long history of ill health starting with a blood clot in 1998 while her husband Bill was commander-in-chief,” the source explained. “The ‘Venous thromboembolism’, which was located behind her right knee, resulted in her foot ballooning in size.” \\nThe article added that Hillary is on a daily regimen of blood-thinning medications to treat deep vein thrombosis (DVT) “after suffering two other clots in 2009 and 2012,” one of which was discovered in her brain. \\nThe symbolism potentially runs deep in this color choice as it’s one of her few appearances she’s made since Friday when the FBI announced that they were looking back into her e-mails, which possibly mean the end of the road for her. Red represents anger, which she surely feels inside, or perhaps it’s a hidden message that the election will end with a win for Republicans whose party is represented by this bold color.'"}, "time": 1742561929.3382556}