{"duration": 0.11533522605895996, "input_args": {"text": "'The Abnormal Normal of Nuclear Terror October 28, 2016 \\nAlmost goofily, behind Official Washington’s latest warmongering “group think,” the U.S. has plunged into a New Cold War against Russia with no debate about the enormous costs and the extraordinary risks of nuclear annihilation, Gray Brechin observes. \\nBy Gray Brechin \\nWhen Lewis Mumford heard that a primitive atomic bomb had obliterated Hiroshima, the eminent urban and technology historian experienced “almost physical nausea.” He instantly understood that humanity now had the means to exterminate itself. \\nOn March 2, 1946, seven months later, he published an essay titled “Gentlemen: You Are Mad!” Not only did madmen, Mumford insist, “govern our affairs in the name of order and security,” but he called his fellow Americans equally mad for viewing “the madness of our leaders as if it expressed a traditional wisdom and common sense” even as those leaders readied the means for “the casual suicide of the human race.” Illustration by Chesley Bonestell of nuclear bombs detonating over New York City, entitled “Hiroshima U.S.A.” Colliers, Aug. 5, 1950. \\nIn the 70 years since the Saturday Review of Literature published Mumford’s warning, that madness has grown to be normative so that those who question the cost, safety and promised security of the nuclear stockpile are regarded as the Trojans did Cassandra — if they are noticed at all. \\n“The bottom line on nuclear weapons is that when the president gives the order it mus t be followed, ” insisted Hillary Clinton in the third presidential debate as a means of affirming her own — rather than her opponent’s — qualifications to give that order. “There’s about four minutes between the order being given and the people responsible for launching nuclear weapons to do so.” \\nFour minutes to launch is a minute more than the three to midnight at which the Doomsday Clock now stands. Clinton no doubt calculated that voters would be more comfortable with her own steady finger on the nuclear trigger. I can think of no better proof of Mumford’s contention than the fact that those voters would give any individual the power to abruptly end life on Earth unless it is that her statement went unremarked by those keeping score. \\nThe Nobel Mistake \\nLess than nine months into Barack Obama’s presidency, Norway’s Nobel Institute bestowed the Nobel Peace Prize on him largely on the strength of his pledge during his first major foreign policy speech in Prague to rid the world of nuclear weapons. In a 2015 memoir, former secretary of the Institute Geir Lundestad expressed remorse for doing so, saying “[We] thought that it would strengthen Obama and it didn’t have that effect.” President Barack Obama uncomfortably accepting the Nobel Peace Prize from Committee Chairman Thorbjorn Jagland in Oslo, Norway, Dec. 10, 2009. (White House photo) \\nLike all modern presidents, Obama quickly learned the political economy of the entrenched nuclear establishment, committing a trillion dollars to the “modernization” of the arsenal and its delivery systems 30 years beyond his presidency. \\nAs Obama prepared to leave office, his Defense Secretary Ashton Carter rejected pleas for reducing the stockpile and announced that the Pentagon planned to spend $108 billion over five years to “correct decades of underinvestment in nuclear deterrence … dat[ing] back to the Cold War.” The last Cold War, that is. \\nSuch staggering expenditures are, however, even more unlikely to purchase the order and security that Secretary Carter promised than when Mumford issued his warning. That was well before thousands of thermonuclear weapons waited on hair-trigger alert for the order to launch or a glitch that would do so without an order. \\nIn his recently published book My Journey At the Nuclear Brink , Bill Clinton’s Defense Secretary William Perry detailed the numerous close calls by which the world has dodged partial or all-out Armageddon and claimed that the likelihood of disaster is growing rather than diminishing. Most of these events are unknown to the public. \\nFormer head of the U.S. Strategic Command General James Cartwright bolstered Perry’s claim when he told a San Francisco audience that “It makes no sense to keep our nuclear weapons online 24 hours a day” since “You’ve either been hacked and are not admitting it, or you’re being hacked and don’t know it.” One of those hackers, he said, could get lucky. \\nA Non-existent Debate \\nWhen Hillary Clinton was asked at a town hall event in Concord, New Hampshire, if she would reduce expenditures for nuclear arms and rein in the corporations that sell the government those weapons, she replied “I think we are overdue for a very thorough debate in our country about what we need and how we are willing to pay for it.” Former Secretary of State Hillary Clinton speaking with supporters at a campaign rally at Carl Hayden High School in Phoenix, Arizona.   by Gage Skidmore) \\nSuch a debate has never been held and — given the peril, complexity and cost of nuclear technology — it is never likely to happen unless a president of exceptional courage and independence demands it. The profits of weapons production are simply too great and few of the prospective victims understandably want to dwell on the unthinkable when so much more diverting entertainment is available on their Smartphones. \\nNuclear weapons by their nature are inimical to transparency and thus to the public discussion, control and democracy they ostensibly protect. Nor does Doomsday make for winning dinner banter. \\nThe Brookings Institute in 1998 published a study of the cumulative costs of nuclear weapons entitled Atomic Audit . It put the bill to date at $5.5 trillion, virtually none of which was known by the public or even to members of Congress or the President. The cost simply grew and continues to grow in the dark, precluding spending on so much else that might otherwise return in public works and services to those who unwittingly pay for the weapons while also mitigating the causes of war abroad. \\nIf she wins, Hillary Clinton’s election to the Presidency will be hailed as historic, but not nearly as historic as if she would sponsor that “overdue” and “very thorough debate” of which she spoke in the city of Concord. Such a debate might begin to lift from her own shoulders — and from those of her successors if there are to be any — what she called “the awesome responsibility” of four minutes to launch. That way lies sanity after 70 years of its opposite. \\nDr. Gray Brechin is the Project Scholar of the Living New Deal University at the UC Berkeley Department of Geography. He is the author of Imperial San Francisco: Urban Power, Earthly Ruin which explains the historical context of California’s long but little-known involvement with nuclear weaponry.'"}, "time": 1742628312.421328}