{"duration": 0.1054532527923584, "input_args": {"text": "'Elton John famously collects eccentric eyewear. He is less widely known as a collector of photography  —   and yet the   owns close to 8, 000 pieces dating from 1910 to the present. Highlights from that collection are now being shown here at Tate Modern. For the next six months (through May 7) “The Radical Eye” presents 191 works from the 1920s to the 1950s by a hit parade of photographers including André Kertesz, Edward Steichen, Man Ray, Irving Penn and Dorothea Lange. (Parts of the collection have been shown at the High Museum of Art in Atlanta in   and at the Pinchuk Art Centre in Ukraine in 2007.) Mr. John and David Furnish, his husband and the collection’s   are in talks with Tate over which works they will make available to the national collections as a “gift or promised gift,” said Simon Baker, senior curator of photography at Tate Modern. “This is undoubtedly one of the world’s most important collections of photography,” said Phillip Prodger, head of photographs at the National Portrait Gallery, who is not involved in the exhibition. “It contains many of the very finest examples of the most famous photographs in the world, particularly in that modern period between the wars. ” Mr. John began collecting photographs in 1990, shortly after coming out of rehab for alcohol addiction, he said in an interview published in the show’s catalog. While staying with friends in southern France, he attended a photography festival met a gallerist from Los Angeles who had brought photographs with him. “I’d never really noticed photography as an art form before,” he said in the interview. “I looked at them and thought, oh my God, these are so beautiful. I bought about 12 on the spot. ” The timing “couldn’t have been better,” Mr. John said. “Photographs were very undervalued then. ” He began by buying early   photographs, including some that had caught his eye as a child, and hunted for vintage prints. In 1993, he paid $193, 895 for a print of Man Ray’s “Glass Tears” (1932) the most expensive photograph sold at auction at the time. “When he found his sobriety, he saw life with new eyes,” said Newell Harbin, the director of Mr. John’s collection since 2012. “He realized, going back to when he was a child and looking at posters of these famous photographs, that this was his moment, and that he could really start from there. ” “The Radical Eye” is like a crash course in photography: it includes nearly every major photographer from the period, and presents their works thematically rather than chronologically. Most of the pictures are in gilded,   or painted wooden frames made for Mr. John in Atlanta, where he has a home. A room of portraits at the start features photographs by Man Ray of Pablo Picasso, Constantin Brancusi, and the Surrealist poet André Breton, among others there are a total of 25 Man Ray works in the show. The same gallery contains a wall of Irving Penn “corner portraits”  —   in which famous figures like Spencer Tracy, Joe Louis, Duke Ellington and Salvador Dalí were photographed squeezed into the corner of a room. Elsewhere in the show are significant works like Paul Strand’s “Wall Street, New York” (1915) and Dorothea Lange’s “Migrant Mother” (1936). But the exhibition also contains many   gems, such as an image of a winding staircase taken around 1928 by Werner Mantz, or the Surrealist stills of Josef Breitenbach. “The really amazing thing about this collection is the provenance of some of the key works,” said Shoair Mavlian, the Tate assistant curator who organized the show together with Mr. Baker and Ms. Harbin. Ms. Mavlian said that the tiny image of Kertesz’s “Underwater Swimmer” was the very first contact print made by the artist in 1917, and the 1932 Herbert Bayer photomontage “Humanly Impossible ( )” was the first print that Bayer painted and which “every subsequent reproduction was made from. ” Ms. Harbin, who was previously manager of the photography collection at the Art Institute of Chicago, said Mr. John collected from all periods, including contemporary, and had recently acquired works by Christopher Williams and Sally Mann. “It has to speak to him,” she said. “He doesn’t just get that photographer because it has to tick a box. ” Mr. Prodger of the National Portrait Gallery’s said Mr. John was “very uncompromising in his collecting, and always sought out those examples that thrill when you see them. ” “It’s incredible not just that he has a print of such and such,” he added, “but he has the print. ”'"}, "time": 1742563763.7136056}