{"duration": 0.06402921676635742, "input_args": {"text": "'You are here: Home / political cartoon / Why Polls Showing Hillary in The Lead Are Useless And Misleading [CARTOON] Why Polls Showing Hillary in The Lead Are Useless And Misleading [CARTOON] October 29, 2016 Pinterest \\nRobert Gehl reports that with less than ten days to go, Donald Trump appears to be surging with likely voters across the country. \\nDespite an onslaught of negative coverage from all corners of the media, the Republican Presidential candidate has gained on Hillary Clinton in the latest poll from The Washington Post and ABC News. \\nHillary still holds a 48-44 percent edge over Trump, but that is up from 38 percent support for Trump in the last week alone, fueled by support is shoring up among political independents and hard-core Republicans. He has made up ground among white people – with a 30-point advantage among whites without a college degree, up from a 20 point advantage. \\nTrump saw his biggest gains among political independents, favoring Trump by a 12-point margin in the latest tracking poll, 49 to 37 percent, after giving Clinton a narrow edge in late last week. Neither candidate has maintained a consistent lead among independent likely voters in Post-ABC polling this fall. \\nDespite the surge in Trump’s popularity, still six in ten voters expect Hillary Clinton to win anyway. The same poll found that only 30 percent thought Donald Trump would prevail. This plays into the Trump narrative that the vote is somehow “rigged” in favor of Clinton and no matter how much support he has, Trump would never ascend to the presidency. \\nSizable minorities of likely voters express concerns about fraud and inaccuracy at the ballot box, though worries about both have declined in the past month. Fewer than four in 10 voters now say voter fraud occurs very or somewhat often (37 percent), down from 47 percent in early September. Studies of voter fraud have found that it is very rare. \\nIn a separate question, the share of voters saying they do not have confidence votes will be counted accurately dipped from 33 to 28 percent, while the percentage saying they are “very confident” rose from 31 to 43 percent. \\nSeven in 10 Trump supporters say voter fraud occurs at least somewhat often, including 34 percent who think it happens “very often.” And Trump voters are split on whether votes will be counted accurately across the country, with 50 percent at least somewhat confident and 49 percent “not too” or “not at all” confident. \\nWhile Trump voters’ concerns about fraud and vote counting have not changed significantly since last month, Clinton supporters expressed growing confidence in the election process. The share of Democrats who are “very confident” the vote will be accurately counted has grown from 45 percent last month to 70 percent in the new Post-ABC poll. And while more than 1 in 5 Democrats last month thought voter fraud occurs at least somewhat often, that has fallen to slightly more than 1 in 10 in this week’s poll. \\nThe poll was conducted with a sampling of 1,775 adults and has a margin of error of plus-or-minus 2.5 percentage points.'"}, "time": 1742561718.3339255}