{"duration": 0.06191134452819824, "input_args": {"text": "\"  Netanyahu Calls Trump ‘True Friend Of Israel’, Likud Party Pols Call For U.S. Embassy Move To Jerusalem Politicians from Netanyahu's Likud party called for Trump to follow through on his promise to move the US embassy from Tel Aviv to Jerusalem, in a break with the policies of previous Republican and Democrat administrations   9, 2016 Prime Minister Benjamin Netanyahu congratulated Donald Trump on his election as US president on Wednesday and called him ‘a true friend of the state of Israel’. “For if thou altogether holdest thy peace at this time, then shall there enlargement and deliverance arise to the Jews from another place; but thou and thy father’s house shall be destroyed: and who knoweth whether thou art come to the kingdom for such a time as this?” Esther 4:14 (KJV) EDITOR’S NOTE: So where is the Bible in all this excitement surrounding this election? It’s right here – Jerusalem. God showed me well over a year ago that Donald Trump was “His man” for the White House for one reason, and one reason only. Because Donald Trump will move the US Embassy to Israel , an act which will declare Jerusalem as the capital of Israel, that will usher in an amazing time of fulfillment of prophecy on a scale that we have never seen. ‘I look forward to working with him to advance security, stability and peace in our region,’ Israeli leader Netanyahu said in a statement. He went on: ‘The ironclad bond between the United States and Israel is rooted in shared values, buttressed by shared interests and driven by a shared destiny. PM Netanyahu Congratulates US President-Elect Donald Trump: ‘I am confident that president-elect Trump and I will continue to strengthen the unique alliance between our two countries and bring it to ever greater heights.’ Netanyahu avoided controversial topics in his statement, unlike members of his government. Education Minister Naftali Bennett , who heads the hardline Jewish Home party , said Trump’s victory eradicated the idea of a Palestinian state. He said the unprecedented win was an ‘opportunity for Israel to immediately retract the notion of a Palestinian state in the centre of the country, which would hurt our security and just cause’. For such a time as this: The day I heard Donald Trump say that he will “move the US Embassy to Jerusalem as president”, the Lord tapped me on the shoulder and said “pay attention to that guy”. Glad I did. Listen to this 2-hour radio program on how Bible propehcy will likely be fulfilled. Palestinian President Mahmoud Abbas said that he hopes ‘peace will be achieved’ during Trump’s term. Politicians from Netanyahu’s Likud party called for Trump to follow through on his promise to move the US embassy from Tel Aviv to Jerusalem, in a break with the policies of previous Republican and Democrat administrations.  \""}, "time": 1742562212.5015028}