{"duration": 0.03305411338806152, "input_args": {"text": "'on November 6, 2016 8:03 am · \\nSaturday Night Live has helped bring quite a bit of levity to this otherwise horrific election year but in the final episode before the election, before we as a nation go to the polls and decide if we want to be extraordinary or “deplorable,” the cast of Saturday Night Live could not help but drop the act and get real with America. \\nIt began as it normally does, with Alec Baldwin’s masterful Donald Trump character and Kate McKinnon’s excellent portrayal of Hillary Clinton (if she spent all day every day mainlining a dangerous mixture of sugar and caffeine). \\n“I never use emails,” Trump says in the cold opener. “I use a very private, very secure site where one can write whatever they want to and no one can read it It’s called Twitter.” \\nAfter he is informed that everyone can see his tweets, “Trump” replies: \\n“Really? And I’m still in this thing? America you must really hate this lady.” \\nAfter a scathing rebuke of the media’s decision to ignore Trump’s cozy relationship with Putin, the KKK, and the FBI and instead focus on something as meaningless as Hillary Clinton’s emails, something magical happened: McKinnon and Baldwin dropped the facade and got serious. \\n“I’m sorry, Kate. I just hate yelling all this stuff at you like this,” Baldwin says. “I just feel gross all the time about this. Don’t you all feel gross?” he added, addressing the audience. \\nMcKinnon agrees and the two embark on a “friendship montage” through the city before returning to the stage. Then they dropped perhaps the most important message you will hear this election year. “None of this would have mattered if you don’t vote,” Baldwin says. \\n“We can’t tell you who to vote for, but on Tuesday we all get a chance to choose what kind of country we want to live in,” McKinnon finishes. \\nThey’re right.'"}, "time": 1742562048.9948173}