{"duration": 0.11854171752929688, "input_args": {"text": "'Leave a reply \\nBill Still – Good morning, I’m still reporting on 4Chan. \\nIf TruePundit is right again, then there are movements of FBI agents tonight that suggest a massive raid happening tomorrow in the DC metro area that may involve arrests and seizure of evidence in the Clinton Foundation investigation. \\nI think I can hear the sound of thousands of computers being scrubbed by BleachBit from Leesburg, Virginia to Bowie, Maryland when I walk outside. And if so, then tomorrow a mighty blow for freedom will be struck as the first step towards the restoration of the rule of law is taken. \\nBut first, this letter from Anonymous writing on 4Chan making some interesting predictions. \\nFirst of all, what is 4Chan? \\nSee also SR 1318 – Huma Abedin FLIPPED in NYPD Slimy Sex Probe – Crooked Hillary May Be Involved \\nIt is a message board that is designed from the ground up to be totally anonymous. Users don’t even have to pick a username. Posts are time sensitive – less time for R-rated discussion threads – more time for G or PG rated ones. So, the reliability of the comments can only be judged by knowledge of the context surrounding the comments. \\nI did a story on 4Chan on Aug. 3, 2016, Still Report #1091 . Since I thought it was true, I ran the story then. Now, it no longer seems a bit flaky, because much of it has panned out. \\nThe particular 4Chan thread that pertained to whether or not Hillary Clinton would not be recommended for indictment by FBI Director Jim Comey was announced by an anonymous FBI Analyst. \\nNow management of the thread has apparently been taken over by Anonymous. The previous author may have met his fate at the hands of the conspirators attempting to steal the American election. What follows is the message, dated Nov. 3, 2016 @00:43:33: \\n“Over the next few days many new documents will be released. The contents of these documents will contain evidence of perhaps the largest cover-up in American history. \\n”Before this happens we would like to explain ourselves and answer a few questions you may have.” \\n”Until this month, WikiLeaks and Anonymous have worked together building an efficient, detailed, comprehensive set of documents that would be responsible for the incarceration of Hillary Clinton, Bill Clinton, and 21 individuals ranging from the DNC, FBI, CIA, and Clinton Foundation. \\n”These documents will show without a doubt, the evidence of treason, obstruction of justice, election fraud manipulation, and bribery. \\n“This was intended to be the October surprise. But before the release of these documents, we were contacted by a member of the FBI, as well as another from the CIA, and a week later by the NYPD. All with information pertaining to something much darker than even we imagine. Due to the nature of these leaks, we all work together as efficiently as possible to ensure two objectives: 1. That all necessary information would be given to the public in an organized, searchable, manageable way. 2. Those who provided us with this information would be able to find safety before these releases were made (this concern wasn’t without warrant). \\nThe new leaks being released this week will provide documents in the form of emails pictures and videos. Within these will be evidence of Bill Clinton, as well as, at least, six other government officials, taking part in sexual acts with minors. As well as evidence of human trafficking that also included minors. We believe these pictures and videos were taken for the purpose of political manipulation in order to make sure all participants followed through on a previously agreed agenda. \\nThese documents were given to us by an American government official when he had come to learn that this crime had been covered up by Hillary and her staff through methods including bribery and blackmail. He also told us that due to the restricted access of these documents they would soon know he was the one who released them to us. We were trying to make arrangements for him to exit the country safely, but he was killed before those arrangements could be carried out. \\nRemember, remember, the 5th of November. I’m still reporting from Washington. Good day. SF Source Bill Still Nov. 2016 Share this:'"}, "time": 1742561795.2108898}