{"duration": 0.032576560974121094, "input_args": {"text": "\"Syrian War Report – November 2, 2016: ISIS and Al-Nusra Attempt to Cut Off Govt Supply Line to Aleppo ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board Iraq’s Popular Mobilization cuts Daesh’s main supply route in Mosul By GPD on November 2, 2016 \\n\\nIraq’s Hashd al-Shaabi forces, also known as the Popular Mobilization Units, have taken control of the main highway connecting the Daesh-held Iraqi city of Mosul and the Takfiris’ de facto capital in Syria. \\nThe group’s spokesman, Jaafar al-Husseini, announced on Wednesday that the troops had gained control of the highway linking the northern Iraqi city to Raqqah in a move that effectively cuts the terrorist’s main supply line. \\nForces from the Popular Mobilization Units are part of vast operations launched on October 17 by the Iraqi army, Shia and Sunnivolunteer fighters as well as Kurdish Peshmerga forces to retake Mosul, the last stronghold of Daesh in Iraq. \\nMeanwhile, Iraqi special forces are carrying out a house-to-house terrorist clearance operation in the newly-recaptured neighborhood of Gogjali in eastern Mosul. \\nLieutenant Colonel Muhanad al-Timimi said that so far eight Daesh militants had been killed during the operation. Iraqi special forces take part in an operation against Daesh militants in Gogjali, west of Mosul, Iraq, on November 2, 2016. \\nThe Iraqi force also downed a Daesh drone during the operations in Gogjali. \\nEarlier, Iraq’s Federal Police Forces announced that they had recaptured four villages near city’s Hammam al-Alil area. \\nBaghdadi trapped in Mosul \\nMeanwhile, reports say Daesh’s chief, Ibrahim al-Samarrai, also known as Abu Bakr al-Baghdadi, was hiding in Mosul when the Mosul operations began last month, and is now trapped in the besieged city. \\n“Baghdadi is there and, if he is killed, it will mean the collapse of the whole [Daesh] system,” Fuad Hussein, chief of staff to Iraqi Kurdistan President Masoud Barzani, said in a Wednesday interview published by The Independent. \\nHussein noted that Baghdadi’s presence in Mosul could prolong the operations to liberate the city, adding that capturing the city would spell the end of Daesh. \\n“It is obvious that they will lose, but not how long this will take to happen,” he added. Iraqi special forces take part in an operation against Daesh militants in Gogjali, west of Mosul, Iraq, on November 2, 2016. \\nUN voices alarm over Mosul human shields \\nIn another development, the United Nations Security Council has expressed concerns over reports that Daesh is taking civilians in Mosul from their homes and relocating them in positions where they can be used as human shields. \\nThe council condemns “the use of human shields and calls on all parties to take all feasible precautions with a view to avoiding harm to civilians and civilian objects in accordance with international humanitarian law,” said Senegal’s Deputy Ambassador Georgui Ciss, whose country currently holds the council’s presidency. \\nCiss also noted that the Security Council would “not like to see the spread of Daesh to neighboring Syria.” \\nThe remarks came a day after the UN warned that it had received reports of Daesh terrorists forcing thousands of civilians into Mosul, possibly to be used as human shields. \\nResidents from various locations around the city have also confirmed the reports. An internally displaced man walks with his belongings at al Khazar camp near Hassan Sham, east of Mosul, Iraq, on November 2, 2016. \\nOver one million trapped in the city \\nAccording to the Norwegian Refugee Council (NRC), more than one million civilians are trapped in the city, all of whom “are in grave danger.” \\nThe aid agency noted that around 18,000 Iraqis had fled their homes since the operation began over two weeks ago to retake the city. \\nThe NRC’s Iraq director, Wolfgang Gressmann, said that aid workers “are now bracing… for the worst. The lives of 1.2 million civilians are in grave danger, and the future of all of Iraq is now in the balance.” Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by GPD on November 2, 2016, With 278 Reads Filed under World . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742628565.5212467}