{"duration": 0.13228678703308105, "input_args": {"text": "'By the look of the renderings officially unveiled on Wednesday morning, New York’s next significant landmark may be the city’s biggest Rorschach test, too. Big, bold and   the structure, “Vessel,” stands 15 stories, weighs 600 tons and is filled with 2, 500 climbable steps. Long under wraps, it is the creation of Thomas Heatherwick, 46, an acclaimed and controversial British designer, and will rise in the mammoth Far West Side development Hudson Yards, anchoring a   plaza and garden that will not open until 2018. Some may see a jungle gym, others a honeycomb. But Stephen M. Ross, the billionaire founder and chairman of Related Companies, which is developing Hudson Yards with Oxford Properties Group, has his own nickname for “Vessel”: “the social climber. ” And the steep price tag Mr. Ross’s privately held company is paying for Mr. Heatherwick’s installation? More than $150 million. The back story of the   “Vessel” involves two men who are in step in more ways than one: a designer known for dreaming big, and a   developer who will spend whatever it takes to make a statement. Currently under construction in Monfalcone, Italy, the   and concrete pieces that make up “Vessel” are not to be assembled on site until next year, but on Wednesday, Related Companies rolled out the design with a Hudson Yards spectacle hosted by Anderson Cooper, with a performance by the Alvin Ailey dance troupe on a set that mimicked the multiple stairways inside “Vessel. ” The crowd of hundreds included Mayor Bill de Blasio. “We know ‘Vessel’ will be debated and discussed and looked at from every angle, and Thomas,” the mayor added, addressing the architect, “if you meet 100 New Yorkers, you will find 100 different opinions on the beautiful work you’ve created. Do not be dismayed. ” On a visit to New York this summer, Mr. Heatherwick, founder of the Heatherwick Studio in London, was eager to explain his design. “We had to think of what could act as the role of a landmarker,” he said. “Something that could help give character and particularity to the space. ” Mr. Heatherwick said “Vessel” was partly inspired by Indian stepwells, but he also referred to it as a climbing frame  —   what Americans would call a jungle gym  —   as well as “a Busby Berkeley musical with a lot of steps. ” The design reflects Mr. Heatherwick’s belief that city natives are always looking for their next workout. “New Yorkers have a fitness thing,” he said. (It will test many city folk who can barely climb into their Ubers, but there will be an elevator for anyone unable to reach the top.) Inside the piece, the 154 interconnecting staircases may put visitors in mind of a drawing by M. C. Escher, especially given that the   structure will have 80 viewing landings. Mr. Heatherwick’s career, as measured by his personal profile, has certainly been climbing. He gained fame for ingenious designs like his torch for the 2012 London Olympics, known as the Caldron. He is collaborating with the architect Bjarke Ingels on the design for Google’s new campus in Mountain View, Calif. and he is reimagining the home of the New York Philharmonic, David Geffen Hall, with Diamond Schmitt Architects of Toronto. But other projects have faced some downward pressure. Mr. Heatherwick’s proposal for a   bridge across the Thames River in London was held up by budget issues in July, though Mr. Heatherwick said it was moving forward again. In New York, the Hudson River island park known as Pier 55  —   funded by another   billionaire, Barry Diller  —   was stalled by a legal challenge that was rejected last week. (According to Mr. Diller, the challenge is being secretly sponsored by Douglas Durst, a real estate rival of Mr. Ross’s.) “It’s a leap of faith in terms of scale,” said Susan K. Freedman, president of the Public Art Fund, who has seen the “Vessel” renderings and likes them. “ I admire the ambition,” she added. “You can’t be small in New York. ” But Ms. Freedman had her reservations. “The bigger problem may be traffic control,” she said, given that the work will be near the already crowded High Line, the tourist attraction whose northernmost segment winds around Hudson Yards. “I think people will want to experience it. ” Thomas Woltz, of the firm Nelson Byrd Woltz, designed Hudson Yards’ Public Square and Gardens, with input from Mr. Heatherwick, as a dramatically landscaped attraction. The square will be the $200 million centerpiece of Hudson Yards’ eastern section, a   parcel with eight buildings comprising office space, retail outlets, residences and  a new cultural institution, the Shed. The eastern section  stretches from 30th to 34th Streets and from 10th to 11th Avenues, built largely on a platform over the West Side Rail Yards. Despite the name “Public Square,” Hudson Yards is a private development, and “Vessel” was commissioned and approved by a committee of one: Mr. Ross, who has kept the design models in a locked cabinet in the Related offices  —   when not allowing brief peeks to lure commercial tenants. “I have the only key,” he said with a smile. When Mr. Ross began the process of finding a piece several years ago, he first turned to five artists who are known for working in public plazas  —   and whom he declined to name  —   and asked them for detailed proposals. One of the unbuilt plans cost him $500, 000, he said, and another $250, 000. But he was unsatisfied. “Been there, seen that,” Mr. Ross said of his reaction. A Related colleague suggested Mr. Heatherwick, who had come in previously for a meeting at the company to discuss a future pavilion on the site. Mr. Heatherwick and Mr. Ross talked, and six weeks later, the designer sent a proposal. “I looked at it and said, ‘That’s it,’” Mr. Ross said. “It had everything I wanted. ” That was in 2013. “Everybody here thought I was nuts,” Mr. Ross said of his colleagues’ reactions. The idea of “Vessel” as an exclamation point toward the northern end of the High Line is part of Mr. Ross’s grand plan to make Hudson Yards the center of New York, despite its    location. “The most important place in New York is Rockefeller Center during Christmas time,” Mr. Ross said. “I wanted to have a   Christmas tree. ” One of Mr. Heatherwick’s main goals for the piece is to raise people significantly above ground level so they can see the city  —   and one another  —   in a new way. “The power of the High Line is the changed perspective on the world,” Mr. Heatherwick said. The interactive feature of “Vessel” was partly a reaction to what Mr. Heatherwick sees as previous failures in public projects: Plop art. “We’ve gotten used to these 1960s, 1970s plazas with obligatory big artworks plunked down,” he said. “Vessel” is only 50 feet in diameter at its base, rising to 150 feet at the top, meaning that it has a “small bum,” Mr. Heatherwick said, and does not take over the plaza’s ground level. The cost of the piece has ballooned from the original estimate, $75 million, Mr. Ross said. Mr. Heatherwick noted that the process of making the steel pieces was unusually complex. “We didn’t have an unlimited budget, but no corners have been cut,” Mr. Heatherwick said, adding that “Vessel” was sturdy enough to “take Hurricane Sandys. ” The price does not appear to trouble his patron. Mr. Ross has now hired Heatherwick Studio to design two residential buildings, one at Hudson Yards and one in Chelsea. For Mr. Heatherwick, “Vessel” represents his firm’s focus on doing innovative work for the public to enjoy. “I’m doing this project because it’s free, and for all New Yorkers,” he said. “I’m just itching to see a thousand people on it. ”'"}, "time": 1742561676.5167265}