{"duration": 0.17595887184143066, "input_args": {"text": "'Democrats complained mightily about their questions being limited, but the Republicans, who hold the majority, get to set the rules. Four of   Donald J. Trump’s cabinet choices faced aggressive questions, but avoided any major stumbles. Here are 10 highlights: ■ Representative Tom Price of Georgia, picked to be health secretary, said repealing the Affordable Care Act would not leave millions without health insurance. ■ Mr. Price offered lofty goals for replacing the law but gave few details about the administration’s plans. ■ He did not rule out cuts to Medicare or Medicaid. ■ Scott Pruitt, the Oklahoma attorney general and the pick to lead the Environmental Protection Agency, said he disagreed with Mr. Trump’s statement that climate change is a “hoax,” but hedged when asked how much of it is caused by human activity. ■ He defended what he called “common sense” environmental regulation, arguing that farmers, ranchers and business had been hurt by intrusive federal rules. ■ Mr. Pruitt said he would not deny the government’s finding that carbon dioxide and other greenhouse gases are a threat: “That is a law of the land. ” ■ Wilbur Ross, selected to be commerce secretary, had a message for Mexico and Canada: Be ready to renegotiate the North American Free Trade Agreement. ■ Some Republicans said they were taken aback by Mr. Trump’s threats to impose big tariffs, but Mr. Ross assured them that the   was merely being a good negotiator. ■ Gov. Nikki R. Haley of South Carolina, Mr. Trump’s choice for ambassador to the United Nations, criticized the international body’s treatment of Israel. ■ Ms. Haley said there would not be a Muslim registry in the United States. Mr. Price tried to offer reassurance that the Republican effort to repeal the Affordable Care Act would not leave millions of people suddenly without health insurance, but Democrats challenged him repeatedly on that point. “One of the important things that we need to convey to the American people is that nobody’s interested in pulling the rug out from under anybody,” Mr. Price said. But Mr. Price gave up few details about Mr. Trump’s plan. Senator Bernie Sanders of Vermont, an independent who ran for president as a Democrat, pressed Mr. Price on whether he viewed health care as “a right. ” Mr. Price deflected. “We’re a compassionate society,” he said. “No, we’re not a compassionate society,” Mr. Sanders shot back, lamenting the United States’ treatment of some of its neediest citizens. Mr. Sanders also parsed Mr. Price’s remark that Americans deserved “access” to   health care. “I have access to buying a $10 million home,” Mr. Sanders said. “I don’t have the money to do that. ” Mr. Price, who has faced intense scrutiny and criticism from Democrats over his stock trades while in Congress, found a defender in Senator Rand Paul, Republican of Kentucky. “To question your motives, I think, is insulting,” Mr. Paul said. “To question whether you’re honest is insulting. ” Democrats have made clear their deep discontent with Mr. Price’s nomination. But one of them, Senator Michael Bennet of Colorado, found a silver lining with the nominee, who happens to be an orthopedic surgeon. “I have never shown a knee, my knee, to any nominee before Dr. Price came to my office,” Mr. Bennet disclosed when it was his turn at Wednesday’s hearing. “But he gave me some free medical advice and I’m grateful. ” “How you doing?” Mr. Price chimed in, showing a glimpse of his bedside manner. “It’s terrible, but I’ll talk to you after it’s over,” Mr. Bennet said. “It’s not because of you. ” Senator Elizabeth Warren, Democrat of Massachusetts, pressed Mr. Price to address Mr. Trump’s pledge that he would not cut Medicare or Medicaid. “Do you believe he was telling the truth?” she asked. “I believe so, yes,” Mr. Price said. Ms. Warren went on to ask Mr. Price to guarantee that he would “safeguard” that pledge and not use his administrative power to “carry out a single dollar of cuts to Medicare or Medicaid eligibility or benefits. ” Mr. Price did not provide such an assurance. Mr. Pruitt, whose hearing attracted dozens of protesters to the Capitol, defended his   position that excessive government regulation was hurting business and energy development. Mr. Pruitt said his “first and primary goal” as administrator of the Environmental Protection Agency would be “to return the agency to that core mission of protecting the American people through common sense and lawful regulations. ” He said that “farmers, ranchers, landowners and   owners have recently felt hopeless, subject to a   torrent of new regulations that only a lawyer can understand. ” “They fear the E. P. A. and that just shouldn’t be the case,” he said. “If confirmed, I will work tirelessly to ensure that the E. P. A. acts lawfully, sensibly and with those   Americans ever in mind. ” But several senators challenged him. Lead came up repeatedly in the hearing, and Mr. Pruitt has come under fire for his answers. In an one round of questioning, Senator Benjamin L. Cardin, Democrat of Maryland, asked, “Do you believe there is any safe level of lead that can be taken into the human body, particularly a young person? Mr. Pruitt responded: “That’s something I have not reviewed nor know about. I would be very concerned about any level of lead going into the drinking water or obviously human consumption, but I’ve not looked at the scientific research on that. ” As the writer Susan Matthews at Slate noted, the E. P. A. says there is no safe level of lead in the bloodstream, though its regulations still allow extremely small amounts of lead in plumbing systems. Mr. Pruitt’s statement led to a strong reaction online: There was also a forceful response among the Democratic members of the Senate in the hearing room. Senator Tammy Duckworth of Illinois asked incredulously, “You are seeking to be the E. P. A. administrator and you’ve not looked into the issue of lead in our drinking water supply?” She called that, in the aftermath of the water crisis in Flint, Mich. “a serious oversight on your part. ” Mr. Pruitt responded that the E. P. A. had power to address problems with lead in water and that the agency should have done more in Flint. “The E. P. A. has emergency order authority” to respond to incidents of contamination, he said, “and I think the E. P. A. should step into these situations in a very meaningful way. ” Senator Edward J. Markey, Democrat of Massachusetts, had a feisty exchange with Mr. Pruitt over climate change and ethics. Mr. Markey started out by revealing a bit of daylight between the positions of Mr. Trump and Mr. Pruitt on climate change. Mr. Markey noted that Mr. Trump has called climate change a hoax created by “the Chinese. ”” Mr. Markey asked whether Mr. Pruitt agreed with the president elect on that point. “I do not believe that climate change is a hoax,” Mr. Pruitt replied. “O. K. that’s important for the president to hear,” Mr. Markey responded. Gov. Nikki Haley of South Carolina, the nominee for United States ambassador to the United Nations, was the subject of rather mild questioning, but that did not mean the hearing was  . “I am concerned with your lack of foreign policy experience,” said Senator Benjamin L. Cardin, Democrat of Maryland and the ranking Democrat on the Foreign Relations Committee. But he then praised Ms. Haley for leading the fight to take down a Confederate battle flag from the South Carolina statehouse property. For her part, Ms. Haley pivoted to an issue of central concern to Republicans, and many Democrats: the United Nations’ relationship with Israel. “Any honest assessment also finds an institution that is often at odds with U. S. interests,” Ms. Haley said, noting the body’s 20 resolutions against Israel, more than against Syria, Iran and North Korea. “This cannot continue,” she said, also criticizing the United States’ abstention from the latest such resolution against Israel. “I will never abstain when the United Nations takes any action that comes in direct conflict with the interests and values of the United States,” she said. She also was asked whether she agreed with sanctions on Russia. “I think that Russia has to have positive actions before we lift any sanctions on Russia. ” What about a Muslim registry? Nope, Ms. Haley said, not going to happen. Mr. Ross kicked off his confirmation hearing by taking a tough stance on China, describing the country as protectionist. “They talk much more about free trade than they actually practice,” he said. Mr. Ross’s stance echoed Mr. Trump’s own   approach. The   rankled many by accepting a congratulatory phone call from the president of Taiwan, challenging the   One China principle and heightening tensions with the country before he even takes office. In an unexpected revelation, Mr. Ross admitted he had unknowingly employed an undocumented household worker, a fact he said he discovered while preparing for his Senate confirmation process. Mr. Ross said the employee had presented a Social Security card and a valid driver’s license, both bearing that individual’s name, when hired in 2009. But during a check over the past month, the employee had been unable to provide similar documentation. He fired the employee immediately, he said. “We did the best that we thought we could do in order to verify the legality of the employment, and it turned out that was incorrect,” Mr. Ross said. During that roughly   period, Mr. Ross said he paid all applicable taxes without incident on that employee, using the Social Security number he had been given.'"}, "time": 1742563591.3804948}