{"duration": 0.06292152404785156, "input_args": {"text": "'posted by Eddie The National Aeronautics and Space Administration has always been at the frontier of science and technology. Since 1958, NASA has done its best to allow humankind to know more about life and the universe. Thanks to this space agency, people have been able to walk on the moon. In the near future, we might even have people walking on Mars. NASA will be moving farther into the unknown areas of the Universe. I know that many of us are hoping to find life beyond the earth. But what if NASA is already aware of alien life ? Well, one hacker claims to have found NASA’s secret photos for all the world to see. Read on! 1. Is that a massive wheel from an extinct civilization? This could have possibly been a part of a huge machine. 2. The side of this cliff has been charred. This shouldn’t look like this if this portion was a representation of what occurred thousands of years ago. Is this because of extraterrestrial activity? 3. This metal vault was hidden in ice for so long. I want to know what’s inside this mysterious container! 4. Is this place from another planet? If you look closely, the area beyond shows a structure that doesn’t look like anything on the earth. 5. These golden bricks hide an unknown language. Sadly, no one has been able to decipher what these writings mean. 6. What were all those military ships doing there? Either they were observing a supernatural phenomenon, or they were trying a new military weapon. 7. Did NASA hide this asteroid impact from the public? If they did, they must have good reason to keep it away from everyone else. Did they witness extraterrestrial life? 8. Those holes don’t look natural at all. The circles are almost the same, and the placement is strange. It looks like a place where machines are hidden and deployed. 9. Using night vision, NASA supposedly captured an unknown structure. It looks like a pyramid, but it is not visible using normal cameras. 10. Was this huge skeleton a part of the Anunnaki? The Anunnaki was known in Mesopotamia as a group of Gods. 11. Large human beings probably existed at some point. However, why can’t scientists find something like this today? This creature might have been an alien that looks like a human. 12. I found this image incredibly terrifying! If this is true, then NASA has evidence of extraterrestrial life. That obviously looks like a spaceship. 13. A temple was found underneath the ocean. Source:'"}, "time": 1742564577.0331218}