{"duration": 0.13787603378295898, "input_args": {"text": "'Sexual abuse was so rampant that it created a “private hell” for some students at an elite prep school in Rhode Island in the 1970s and ’80s, investigators reported on Thursday, describing an atmosphere of terror in which at least 61 students were victimized and some staff members committed assaults for years before being forced out. The investigation found that at least 51 students were abused by employees of St. George’s School, a prestigious private boarding and day school near Newport, and at least 10 others by fellow students  —   and that the true numbers are probably significantly higher. The inquiry came after years of pressure from victims who said that St. George’s had refused to squarely acknowledge the extent of the problems. The report  —   with pages of vivid, painful detail from accusers  —   follows other revelations about sexual abuse at several prominent prep schools in the same area, but none have matched the sheer scale and pervasiveness of the misconduct discovered at St. George’s. More victims will come forward, and “when the sun is set on this case, it could be the largest school sex abuse case in history,” said Roderick MacLeish, a lawyer and St. George’s alumnus who has worked with abuse survivors in pressuring the school to conduct the investigation. “It’s in the thousands of years of suffering this caused. ” The abuses that alumni have recounted, often after decades of silence, include forced intercourse, oral sex and digital penetration one student sodomizing another with a broomstick sexual groping harassment and taking photographs of naked students without their knowledge and showing them to other students. The misconduct by one staff member, the report said, was so frequent and such common knowledge that many of the former students  —   now   and many of them women  —   told investigators they did not see how other adults could have been unaware of it. “Many of these students remember St. George’s as a place where their abusers created a kind of private hell for them  —   a place where they suffered trauma and emotional wounds that, for many, remain unhealed,” Martin F. Murphy, the leader of the inquiry, wrote in the nearly   report documenting the findings. Both the school and advocates for the victims presented the release of the report as a milestone in the history of a school that had addressed some abuse cases individually, but did not begin to grapple with the scope of the problem until last year. “We have never had something we could point to and say, ‘Here it is in its enormity, in the horror of it,’” said Anne Scott, 53, who was raped while she was a student and later maligned by the school when she sued. Ms. Scott later founded a victims’ group, SGS for Healing. The report “evokes both deep sorrow over the harm inflicted on the most vulnerable members of our community and hope for our future that having finally faced these tragic events with humility and honesty, we may together find the path to reconciliation,” Leslie B. Heaney, chairwoman of the school’s board of trustees, wrote in a letter to the students, staff, alumni and parents. Some former students who claimed to have been abused were not included among the 61 listed in the report, because their stories could not be corroborated, though they may be true, the investigators said. In other cases, people told secondhand stories of abuse, but the victims, themselves, did not come forward and were not included. St. George’s lagged behind most of its peers in facing its past, Mr. MacLeish said, but he praised the school, particularly its headmaster, Eric F. Peterson, for ultimately embracing openness. The report revealed that Mr. Peterson tried to start a broad investigation five years ago, but was dissuaded by the school’s lawyers and some trustees. The report contains repeated echoes of scandals surrounding Catholic priests who preyed on children, in which church leaders moved those priests to different parishes, did not alert the police and pressured victims to remain quiet. Over the years, the report said, St. George’s fired or expelled the abusers it learned about, though only after repeated accusations in some cases. But it did not report them to law enforcement, it misled students and parents about the reasons for staff dismissals, and some of the victims claimed their accusations were brushed aside or that they were bullied into silence for years. The school gave job references and financial support to two faculty members it fired and some who were dismissed went to work at other schools, only to be accused of abuse there as well. A single person victimized more than half the confirmed victims, at least 31: an athletic trainer and coach named Al Gibbs. About   of the girls who attended St. George’s in the 1970s told investigators that they had been sexually abused, and at least one had been raped, by Mr. Gibbs, who was fired for sexual misconduct in 1980 and died in 1996. “We expect the number of women actually abused by Gibbs substantially exceeds the reported figure,” wrote Mr. Murphy, a partner in the law firm Foley Hoag in Boston, noting that most sexual assault survivors are reluctant to report the crimes. “These are just the firsthand accounts,” he said. “Many students with whom we spoke indicated that friends had similar experiences, but would not be contacting us. ” Ms. Scott, who graduated in 1980, says she was raped by Mr. Gibbs, an experience that she said left her shattered psychologically and in need of extensive treatment that threatened to impoverish her parents. She sued the school in 1988. “I had stopped talking for periods of time, I was hospitalized, I couldn’t hold a job, I couldn’t leave the house,” Ms. Scott said. “My parents had spent about $200, 000 on my care at that point, and they thought they were looking at a lifetime of care. ” The administration had known for years that Mr. Gibbs was a serial predator, but the school admitted nothing. Its lawyers then played hardball with Ms. Scott, leading her to drop the case in 1989. “I was called a liar, I was accused that it was consensual, I was bullied  —   they just went   into attack mode,” she said. This year, St. George’s and SGS for Healing commissioned Mr. Murphy’s law firm to conduct the investigation, asking to speak with alumni who knew of abuses. The investigative report includes Foley Hoag’s own findings, and those of another firm that was initially retained to conduct the investigation, but was let go over concerns about a potential conflict of interest. The investigators’ mandate was to look at abuses dating back to 1960, but they did not confirm any after the 1980s. The report documented improper and suggestive conduct by one faculty member in the 1990s and 2000s, but nothing that rose to the level of sexual abuse. An accusation against a current staff member was deemed not credible, the investigators reported. “St. George’s School today is a very different place than it was in the 1970s and 1980s,” Mr. Murphy wrote. The report named six faculty members it says were guilty of sexual abuse  —   those against whom there was the most solid evidence of the more serious charges, including Mr. Gibbs. The other five, all now in their 60s and 70s, refused to talk to investigators. None could be reached for comment on Thursday.'"}, "time": 1742563876.4014494}