{"duration": 0.04808163642883301, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / American Funhouse: Manufacturing Consent Essential Reading By Smoking Mirrors on September 8, 2011 \\nSmoking Mirrors at his creative best writing about … well you decide what he’s writing about Hellstorm – Exposing The Real Genocide of Nazi Germany (Full Documentary) By wmw_admin on May 10, 2015 \\nWhat happened in the aftermath of World War II has been one of the darkest and best kept secrets in world history. The Crucifixion of Jews Must Stop! By wmw_admin on August 21, 2010 \\nThe sacrifice of “six million Jews” was being talked about before Hitler rose to power. A photocopy from the American Hebrew dated Oct. 1919, speaks openly about a holocaust of six million Jews before declaring “Israel is entitled to a place in the sun”!! The Advent of the Anti-Christ By Rixon Stewart on August 2, 2010 \\nA few words on the market meltdown and how it may assist the debut of a truly sinister figure Does God Play Dice with the Universe? By Rixon Stewart on December 1, 2003 \\nResearch into particle physics is revealing a world full of almost magical qualities. Could it be that this mysterious, puzzling world is in fact the world of the spirit – the spiritual world that saints and mystics throughout history have sought to explo “Holocaust” declared 7 years before there was a “Holocaust” By wmw_admin on December 13, 2014 \\nThe New York Times was already reporting of Jewish persecution and an ongoing “Holocaust” in May 31, 1936 Magic Thermite and the 9/11 Fairytale By Smoking Mirrors on April 15, 2009 \\nThe evidence is in and it’s irrefutable: scientists have discovered traces of hi-tech explosives in the WTC debris. Which means the UK/US/Israel will have to stage another event on the scale of 9/11 to counter the brushfire this report will ignite\""}, "time": 1742562085.0125954}