{"duration": 0.1570138931274414, "input_args": {"text": "'by PAUL FASSA \\nFirst realize that even without being diagnosed with cancer, we all have at least a few cancerous cells floating around in our “inner terrain”. A decent immune system residing in a slightly alkaline or neutral pH inner terrain is able to fend them off and keep them from colonizing into tumorous masses. On the other hand, those who indulge primarily in the SAD (Standard American Diet), which includes lots of factory farmed meat and junk foods saturated with refined sugars or high fructose corn syrup (HFCS), which processed foods use even with their non-sweet products to keep you addicted, along with all those refined carbs in refined grain baked products, are adding fuel (literally) to the fire of cancer. \\nMainstream oncology ignores this 1930s Nobel Prize discovery by Otto Warburg, aka the “Warburg Effect”: When normal cells begin to lack oxygen respiration to utilize glucose and nutrients metabolically for cellular energy, they depend on fermenting sugar to thrive without oxygen and become cancerous. \\nYum … ice cream with my chemo! \\nInstead oncologists administer chemo IV therapies while giving their patients ice cream and cookies as the poison is injected into them. Big profits from the treatment and selling those toxic drugs at a profit also. “Cancer cells consume sugar about 19x faster than healthy cells.” – Dr. Murray Susser, MD Mainstream medicine refuses to look into diet as a function of potential metabolic dysfunction that helps promote and maintain cancer while asserting genetic disposition as a primary cause of cancer. Their hubris and incredible profits thrive from toxic interventions such as chemotherapy and radiation. The first concern with preventing or eliminating cancer should be what you put into your body. That gives you control over cancer. \\n\\nIt’s a no-brainer when it comes to avoiding sodas, juices with added sugars, pastries, candies, and processed foods that use processed grains and even add sugar or HFCS to foods that are not even sweet. That’s to keep you addicted even if you can’t taste it. Refined sugar is actually addictive, some claim it’s even as addictive as cocaine. \\nA Recent Study That Makes Sugar Carcinogenic \\nBut now it’s even worse. Green Med Info has uncovered a study that seems to be hidden from the public eye and is certainly not welcome within our orthodox oncology system. It would cramp the food and soda business’s profits if refined sugar is seen as carcinogenic. \\nThe study, “Increased sugar uptake promotes oncogenesis via EPAC/RAP1 and O-GlcNAc pathways” was published in the 2013-2014 Journal of Clinical Investigation (JCI). Because it is a free access journal, you can access the full text, not just the abstract, here . \\nI wonder how come this study hasn’t made much of a stir in our sick-care system since it is so accessible. Instead it was dug up by a research scout for Green Med Info. \\nIt is of course full of biochemical details, which is what medical people are supposed to be familiar with. So for now, let’s be content with a layman’s summary report of their study, which was an in vitro (cultures, petri dishes, and test tubes) study as opposed to an in vivo (animal or human) study. This way they could really play around with and analyze the results with total control. \\nHere’s the bottom line of this study: Increased glucose uptake leads to early phases of cancer cell creation while curbing glucose intake reversed cancerous cells into normal cells. In other words, sugar is carcinogenic as well as fodder for already existing cancer cells. \\nIt’s important to not confuse the enormous amount of refined sugar, table sugar or HFCS, one takes in with sodas and processed foods with naturally occurring sugars and fructose in plant foods, regardless of how high the glycemic index may be. Fruit juices don’t need added sugars, but many fruit juices have sugar added. That’s the type of beverage or food that needs to be avoided. \\nBut table sugar is refined, and most off the shelf breads and pastries are composed of refined grains that are refined carbohydrates, which become sugar instantly without any compensating nutrition. They are processed out of whole foods to be independent of other compounds that balance natural whole foods to make them beneficial. \\nAn interesting informative excerpt from the Cancer Tutor: Dr. Tony [Antonio] Jimenez hypothesizes that sugar from Organic Produce may not contribute to cancer cell growth like its adulterated counterpart [refined sugar/HFCS]. He explains that human mammalian cells absorb levorotatory (left spinning) molecules, while cancer cells can only assimilate dextrorotatory (right spinning) molecules. \\nEssentially, fruits in their natural state contain left spinning sugars, whereas GMO-influenced fruits consist only of right spinning sugars. Dr. Jimenez concludes that the glycemic index is not nearly as important as the source and lineage of the fruits and vegetables we eat. As an example, Dr. Max Gerson used Carrot Juice as a successful alternative therapy, despite its high glycemic index. An Easy Tip That’s Not So Easy for Many \\nSo here is the simplicity of it all. Avoid putting adding sugar to your foods and drinks, avoid all sweets and processed foods, even the ones not obviously sweet contain added refined sugars to keep you coming back for more because of its addictive quality. \\nThis is harder for most than you may think. I met an American woman in Mexico who was advised to return to Texas and have a top cancer hospital determine the status of a mass detected in her gastrointestinal tract. I advised her to lay off sugar because if did turn out to be cancer it would exacerbate her condition. \\nShe slumped and groaned slightly, indicating the impossibility of such an abstinence for her. I have read enough reports from spouses, friends, and relatives that show many are unwilling to make dietary changes to cure cancer, and whatever therapy they had used did fail probably because of that. \\nMany would rather just do what their doctors’ say and eat and drink what they want. And some want the same freedom even while avoiding chemo or radiation. This is especially true among those who use cannabis as a “silver bullet” to treat their cancer. \\nDespite all the carcinogenic chemicals that blanket our biosphere, we do have one area that’s in our control – avoiding refined sugars and carbohydrates. \\n\\nPaul Fassa is a contributing staff writer for REALfarmacy.com. His pet peeves are the Medical Mafia’s control over health and the food industry and government regulatory agencies’ corruption. Paul’s valiant contributions to the health movement and global paradigm shift are world renowned. Visit his blog by following this link and follow him on Twitter here .'"}, "time": 1742561729.9688275}