{"duration": 0.12346363067626953, "input_args": {"text": "'Email \\nIn a report released November 2 by the California state attorney general\\'s office, private educational technology companies are warned to be very vigilant in their handling of sensitive student data obtained by them in the course of their dealings with public schools. \\n“In some instances we’re seeing evidence of companies mining data from school children beyond what’s necessary for their education,” said Daniel Suvor, chief of policy for California Attorney General Kamala Harris. \\nHarris’s office released their report, entitled \"Ready for School: Recommendations for the Ed Tech Industry to Protect the Privacy of Student Data,\" to convince these corporate educational conglomerates with substantial contracts with school districts nationwide to come up with procedures that aren\\'t careless with the private data obtained from students in the course of complying with the various standardized tests and other activities required as part of the big money agreements signed by administrators and the companies. \\nAccording to the report, education has become an $8-billion-a-year business. No wonder these companies care so much about pleasing their clients. \\nThe purpose of the report and its recommendations is to limit \"the collection and use of the student information acquired through the technology,” Harris\\' office said in a written statement. \\nAs a teacher, this writer can witness firsthand to the subtle and substantial ways that these \"educational companies\" collect personal data from students. I have seen the forms that these companies include as part of their packets, and the information demanded of students goes far beyond anything necessary for the purpose of improving education or the classroom experience. \\nNaturally, much of this data mining comes from the adoption by so many states of the Common Core standards. \\nCommon Core State Standards Initiative is the official name of the scholastic standards copyrighted by the Washington, D.C.-based National Governors Association (NGA) and the Council of Chief State School Officers (CCSSO). Common Core has come under significant fire from parents, teachers, and school administrators across the country, who declare that the standards are a bid by the federal government to take over the education system. Additionally, privacy advocates have voiced concerns over the distribution to contractors of personally identifiable information about students and their families. \\nAs we noted in an article entitled \" Orwellian Nightmare: Data Mining Your Kids, \" published in 2013: One of the most troubling aspects of the “education reforms” currently being advanced by the Obama administration and its allies is the unprecedented monitoring and tracking of students — invasions of privacy so pervasive George Orwell might blush. Everything from biometric data to information on children’s beliefs and families is already being vacuumed up. Opponents of the “reform” agenda have highlighted the cradle-to-grave accumulation of private and intimate data as among the most compelling reasons to kill the whole process. Aside from data produced by the looming Common Core-aligned national testing regime, most of the data-mining schemes are not technically direct components of the plot to nationalize education standards. However, the vast collection of personal information and the accompanying data-mining are intricately linked to the federally backed standards in multiple ways, not to mention myriad other federal schemes. Despite protestations to the contrary, the new standards and the data collection go together hand in hand. \\nLater in the piece, we presented some evidence of just how massive the menace has grown: All across the country today, Big Brother-like technological developments in biometrics are also making schools increasingly Orwellian. Earlier this year in Polk County, Florida, for example, students’ irises were scanned without parental consent. “It simply takes a picture of the iris, which is unique to every individual,” wrote the school board’s “senior director of support services” in a letter to parents. “With this program, we will be able to identify when and where a student gets on the bus, when they arrive at their school location, when and what bus the student boards and disembarks in the afternoon. This is an effort to further enhance the safety of our students. The EyeSwipe-Nano is an ideal replacement for the card based system since your child will not have to be responsible for carrying an identification card.” In San Antonio, Texas, meanwhile, a female student made national news — and exposed what was going on — when she got in a legal battle with school officials over her refusal to wear a mandatory radio-frequency identification (RFID) device. The same devices are already being implanted under people’s skin in America and abroad — albeit voluntarily. Also in the biometric field, since at least 2007, children in states such Pennsylvania, West Virginia, and New Jersey have been fingerprinted at school under the guise of “school lunch” programs and other pretexts. \\n\"Most of the companies we spoke to throughout this process thought it made sense for us to lay a set of recommendations they could use to govern the sector,” Suvor said, after a meeting with the companies involved in the collection of student data. \\nAgain, it\\'s not hard to see why these companies would bend over backward for the school districts considering the enormous financial benefits that they derive from playing according to the schools\\' rules. \\nOf course, our children wouldn\\'t be subjected to this siphoning of data if the people of the states would come to understand one simple and undeniable fact: The Constitution does not grant to the federal government any authority over education. \\nParents must demand that administrators and state education officials refuse to enter into a contract with any company for any reason for any amount of money that would carry out federally mandated information collection. Furthermore, the people must insist that their local leaders reject out of hand any educational program or policy that would turn our children into informants. \\nIf we fail to force our elected leaders to adhere to their constitutionally imposed oaths of office, we will find that our children are the latest individuals to be caught in the ever-expanding net of federal surveillance, putting our youngsters under the never-blinking eye of the potentate on the Potomac.  '"}, "time": 1742564390.4748511}