{"duration": 0.07183694839477539, "input_args": {"text": "'Share This 74-year-old Gladys Coego (left), 33-year-old Tomika Curgil (right) \\nAfter being entrusted with a room full of votes, two Florida women were on the job when a co-worker showed up and caught what they were hiding at the ballot center. Terrified by what they had just walked in on, the employee immediately reported it to the police, and now, these two are where they belong — in jail. \\nEvidently, Democrats will trust anyone with a pulse to do a job that requires a lot of honesty and integrity, then turn around and tell voting citizens not to worry about voter fraud because it “isn’t real.” This line, discrediting conservatives’ concern, has been repeated extensively by pro-Hillary Clinton liberal media over the last couple of weeks, assuming that Americans are stupid enough to ignore what they see and take their word for it. \\nHowever, the more they say it, the more proof comes out. What happened in the battleground state of Florida should terrify everyone relying on an honest system for Donald Trump to win. \\nWe saw a situation in 2012 that reeked of undeniable voter fraud when Mitt Romney was ahead in the polls by a landslide but lost, which was likely due in part to entire counties strangely missing every single vote for the Republican. We’re supposed to just accept that nothing of the sort will happen this year, even though it seems to occur every election. Two Miami women just proved liberals wrong with what they were caught doing during a Mayoral race and ballot initiative, which you can only assume takes place for presidential elections when the stakes are much higher. \\nAccording to the Miami Herald , 74-year-old Gladys Coego was simply supposed to open completed ballots sent in from county voters and set them aside. However, she took this trust as an opportunity to give her mayoral candidate of choice, Raquel Regalado, an unknown number of votes. She apparently wanted Regalado to win bad enough that she was willing to commit a felony to make it happen. \\nDemocrats would excuse this fraudulent voting behavior as a very rare instance that’s not of concern for any other race, however, 33-year-old Tomika Curgil disproved that lie with the voter fraud she also committed in Florida. Curgil is accused of taking liberties to complete ballots for her own agenda, without people’s consent, and also “submitted at least 17 forms for people who apparently don’t exist — and several forms for people who are dead,” the Miami Herald explained. \\nIf voter fraud isn’t real, then these two dishonest ballot-workers wouldn’t have been arrested for it. What they were willing to do in a small election setting, with rather innocuous results, only proves that the same desperate level of dishonesty is bound to occur when it come to ensuring their equally dishonest leader takes office.'"}, "time": 1742563909.7762623}