{"duration": 0.09455609321594238, "input_args": {"text": "'JERUSALEM  —   The huge billboard images appeared overnight in Tel Aviv: a menacing crowd of Palestinians making the V for victory sign and bearing a legend in Arabic, “Soon we will be the majority. ” One interpretation of that inevitability was explained in Hebrew for those who dialed the number on the billboard: If Israel does not act to separate itself from the Palestinians, it will be less secure, less democratic and less Jewish. The provocative  —   many said racist  —   campaign was kicked off last month by retired Israeli generals and senior officers to shake Israelis out of apathy. President Trump accomplished something similar over the course of just a few seconds on Wednesday, when, standing beside Prime Minister Benjamin Netanyahu at the White House, he declared that he was “looking at   and  ” formulas for resolving the   conflict. “I like the one that both parties like,” he added, seemingly overturning decades of American policy centered on the creation of a Palestinian state alongside Israel. Purposefully or not, Mr. Trump had suddenly implied that the   solution of two states did not really matter. By Thursday, Israelis and Palestinians were feverishly debating what might come next, still confused about American policy after Mr. Trump’s ambassador to the United Nations, Nikki R. Haley, reasserted that the administration “absolutely” supported two states. What were the viable options other than the   solution? One state with equal rights for both Israelis and Palestinians? A dominant Israeli state alongside a defined Palestinian region with statelike but curtailed powers? Would either side ever settle for less than everything? Over decades, Palestinians have watched Jewish settlements spread over land they consider theirs for a future state and concluded that Israel did not intend to concede it. Many of them, particularly those in Hamas, which rules the Gaza Strip, still do not recognize Israel at all. Many Israelis believe that they have repeatedly made good offers that were refused, and that Palestinians are irrevocably split between the West Bank and Gaza, with no unified leadership to negotiate with. Good will, they say, has been met by rocket fire. Now, the Israeli political establishment, moving rightward, clearly believes it is the time to put its thumb on the scale. “I think what the president and prime minister were saying was any solution is possible and now we have to look at alternative solutions, and there are alternative solutions,” said Michael Oren, a deputy minister for diplomacy in Mr. Netanyahu’s office. These, Mr. Oren told reporters, could involve “interim measures and recognition of the fact that there may be a   reality on the ground, which may not conform to what we know as a   solution, but would enable the Palestinians to lead their lives in prosperity and security”  —   and also benefit Israel. Mr. Netanyahu, weakened by corruption investigations and under pressure from   politicians who oppose a Palestinian state, has recently been evasive about his support for a   solution. It depended, he said in Washington, on what the Palestinians had in mind: “What are we talking about? Are we talking about Costa Rica, or are we talking about another Iran?” Mostly, Mr. Netanyahu appears to want to solidify Israeli control over the occupied West Bank and manage the conflict. That basically means maintaining the current situation of Palestinian cantons divided by growing Israeli settlements and surrounded by Israeli forces. Mr. Netanyahu has referred to it as a “ ”  —   implying the Palestinians would get some statelike autonomy, and that would be enough. Critics call it a creeping   reality, and certainly not the “ultimate deal” that Mr. Trump says he hopes to achieve. Some analysts chalk up Mr. Trump’s flippancy to a lack of knowledge, because one thing many Palestinians and Israelis do agree on is that a   formula will not bring peace. “One state is not an option,” said Ghassan Khatib, a Palestinian political scientist at Birzeit University in the West Bank, noting that Israel, which was established to give Jews   would never give all Palestinians the vote. “We are talking two states or no solution, a continuation of the status quo,” he said. Shaul Arieli, an Israeli expert on political geography who prepared maps for past negotiations with the Palestinians and is a member of Commanders for Israel’s Security, the group behind the billboard campaign, said “one state is impossible” for Israel. Demographically and economically, absorbing millions of comparatively poor Palestinians would destroy it, he said. Results of a survey of Israelis and Palestinians released on Thursday, put out jointly by Tel Aviv University and Israeli and Palestinian research centers, indicated that 55 percent of Israelis still support the notion of a   solution, while support among the Palestinians dropped to 44 percent. But the numbers on both sides rose significantly when they were offered additional incentives like a broader regional peace between Israel and the Arab world. Among Palestinians, support rose for the ability to work freely in Israel even after the establishment of an independent state. The survey included a representative sample of 1, 270 Palestinians and 1, 207 Israelis. Israelis are increasingly fearful of the prospect of a Palestinian state at their doorstep. They see other areas of the Middle East in chaos. After Israel unilaterally left the Gaza Strip in 2005, they watched as the militant group Hamas, which rejects Israel’s existence, seized full control of the territory after winning legislative elections. And they know that without the West Bank, Israel is just nine miles wide at its narrowest point. There is also the emotional issue for those who identify the West Bank as the heart of the biblical Jewish homeland promised by God. The Israeli idea of Palestinian statehood never included all of the attributes of full sovereignty. Israel insists on a demilitarized state, and Mr. Netanyahu says the Israeli military has to keep overall security control. Together with other    issues  —   like the fate of Jerusalem and of Palestinian refugees  —   many experts have long said that the maximum Israel can offer does not meet the minimum Palestinian requirements. Saeb Erekat, a senior Palestinian official, noted this week that the   solution “represents a painful and historic Palestinian compromise of recognizing Israel over 78 percent of historic Palestine. ” President Mahmoud Abbas of the Palestinian Authority, an interim government that has held sway in parts of the West Bank since the 1990s, is weakened by internal struggles and threatened by his rivals in Hamas. Mahmoud Zahar, a   member of Hamas and one of its founders in Gaza, said of Mr. Abbas in an interview this week: “He is wasting his time. He is wasting our time and helping the Israelis expand settlements. He is a traitor. He is a spy. ” When the former United States secretary of state, John Kerry, came up with a proposed framework accord defining the principles of a comprehensive   agreement after months of negotiations in 2014, Mr. Abbas did not respond. Since then, Israel has approved plans for thousands of new settler homes in the West Bank and East Jerusalem and has moved to retroactively legalize settler outposts that were built throughout the territory. The measures have further entrenched the occupation, now in its 50th year since Israel captured the territory from Jordan in the 1967 war. A growing number of   Israeli ministers, including from Mr. Netanyahu’s Likud Party, are pushing to annex the settlements that Israel intends to incorporate within its borders under any future deal. Israel has also invested heavily in roads and infrastructure connecting and serving the West Bank settlements, now home to some 400, 000 people. Yet supporters of the   solution insist it still could be executed. Both sides have recognized that it would require adjustments along the 1967 lines. Mr. Arieli, the political geographer, said Israel could keep 80 percent of its West Bank settlers within its borders by swapping territory equal to about 4 percent of the West Bank. Many of the remaining 20 percent of settlers  —   roughly 30, 000 families  —   would most likely agree to move back into Israel for compensation, he said. The numbers can also be deceptive, and some experts insist that much of the change on the ground in recent years can be reversed. About 50 percent of the growth of the settler population has come in two large   settlements, Modiin Illit and Beitar Illit. Both are considered swappable, being close to the 1967 line. Jews mostly went there for cheap housing, not ideology. Together, these two settlements have about 130, 000 residents  —   a third of the total settler population of the West Bank. In some more outlying settlements, Mr. Arieli said, the population was decreasing as Israelis were “voting with their feet” by not moving in, or moving out. Settlement leaders attribute the drop to pressure from the Obama administration that limited the construction of new homes. Mr. Khatib, of Birzeit University, agreed that a   solution was still physically possible “with some creativity, like swapping. ” But, he said, “It won’t remain so for long. ” What is lacking is political will of the leaders on both sides. Nahum Barnea, a leading Israeli columnist, wrote in the newspaper Yedioth Ahronoth on Thursday that if Mr. Trump were “slightly more informed,” he might have realized that it was not an issue of one state or two states: “The two sides, in practice, have chosen a third option: not to agree. ”'"}, "time": 1742628558.5264995}