{"duration": 0.17788243293762207, "input_args": {"text": "'0 0 With humanity’s awakening continuing to speed up as every day passes, we see more and more people desiring information to help them better themselves. Whether that is done through eating healthier foods, beginning a yoga or meditation practice, or whether it is done by being more mindful with the words they choose to use when having an inner dialogue or a conversation with friends and family, more people are looking for information to help them transform their lives in a positive way. While there are many methods to improving one’s life, below are some methods that can help a person spark an inner revolution to create positive and uplifting change in his or her world. Grounding/Earthing Grounding, or what is also called Earthing is when a person has bare skin touching the Earth or a tree and is most commonly done by standing on the Earth with one’s bare feet. Doing this begins to balance the electrochemical state of the body because of the negative ions the Earth emits. Negative ions act as antioxidants (free-radical scavengers) by pairing up with the free radicals and rendering them neutral. Thus, pain, inflammation and anything out of balance begins to move towards balance, or homeostasis. There have been several studies that have shown how grounding helps with pain reduction, wounding healing, balancing of the circadian rhythm to help improve sleep, as well as helping to shift a person’s brainwaves to the alpha state, which is great for a calm and balanced, yet alert and fully awake state of mind. Standing barefoot on the Earth, sand, dirt or concrete (not asphalt) will allow the free flow of negative ions to come in contact with the sensory neurons on the skin and begin to trigger positive physiological and psychological changes within the body. Taking it a bit further, if a person is able to connect with the Earth in a quiet place, the benefits could be even more as Dr. Joe Dispenza has said , “In clinical studies, we have proven that 2 hours of nature sounds a day significantly reduce stress hormones up to 800% and activates 500-600 DNA segments known to be responsible for healing and repairing the body.” Burning Sage In a 2007 study from the Journal of Ethnopharmacology , researchers found that medicinal smoke killed harmful airborne bacteria by up to 94% in just one hour. On a more spiritual level, burning sage has long been used to clear negative or disharmonious energies from a space. This can be done when a person comes home from work or school for that day, as burning sage can be a good way to clear any discordant energy the person may have “picked up” or had “taken on” from other people or their environment. It is used to clear away such energy so that a person can be centered in who he or she is, rather than having to deal with issues that might have been taken on from others. I personally do this each time after coming home from getting groceries or running and errand. Essential Oils The two best ways to use essential oils are to smell them as well as apply them to the skin. While applying essential oils to the skin has many of it’s own benefits, smelling them also creates wonderful responses in the body, and especially the brain. According to the University of Minnesota , smelling essential oils’ molecules affect the olfactory organs, the lungs (and thus the respiratory system) as well as the brain. Odor molecules travel through the nose and positively affect the limbic system of the brain, which is sometimes called the “emotional part of the brain.” To this end, the limbic system controls heart rate, mood, blood pressure, memory, breathing, stress hormone response and overall stress levels. Applying or smelling essential oils throughout the day is a wonderful way to develop emotional intelligence and can help a person respond to stressful situations in a more positive way than before. Smelling essential oils can be personally described as an uplifting and heavenly experience; one that allows us to smell the cosmic byproduct of thousands of flowers pressed into a wonderful gift for humanity. Breathing Exercises Breathing exercises, which can also be considered a form of meditation, can have profound effects on the body and mind. According to Deepok Chopra , a regular practice of rhythmic deep breathing has been shown to reduce anxiety and depression, stabilize blood pressure, increase energy levels and decrease feelings of stress. Over time, a breathing or meditation practice can lead to wonderful internal shifts both physically and emotionally. Incorporating a deep breathing practice into the practice of grounding or Earthing is a great way to accomplish both practices at once. Here is an article of three sample breathing exercises from Dr. Andrew Weil. While there are many other practices a person can use to help catalyze deeper inner growth, such as flower essence therapy (different from essential oils), nature walking, sun-bathing and the use of certain health supplements like fulvic acid and Reishi , this list is a guide that may help those who may just be starting to experience an internal transformation. These four simple practices can be easy to incorporate into one’s life and is recommended to experiment with what feels best for that person. What of these practices do you use in your life? What other practices do you use to help you continue your inner revolution? Share with us your practices or suggestions you have in the comments section. Cheers to our health! Lance Schuttler graduated from the University of Iowa with a degree in Health Science-Health Coaching and offers health coaching services through his website Orgonlight Health. You can follow the Orgonlight Health Facebook page or visit the website for more information on how to receive health coaching for yourself, your friend or family member as well as view other inspiring articles.'"}, "time": 1742561628.2092514}