{"duration": 0.12575268745422363, "input_args": {"text": "'RIO DE JANEIRO  —   Down in the pool, the Australian synchronized swimming duo was performing a     tour of the animals of the outback  —   kookaburras, emus, centipedes  —   to music from “Crocodile Dundee. ” In the stands, the American   duo of Ruth and Emily Thunstrum was trying to figure out what, exactly, was going on. “There was definitely a bird of some kind,” Emily said. “I think there was a crocodile,” Ruth answered. “You should know  —   you spent that time in Australia. ” You do not have to be from someplace other than Australia to be mystified by synchronized swimming, a sport that lies in the corner of the Twilight Zone where Kabuki opera meets advanced underwater survival. It may look as if the athletes are simply gesticulating emphatically, flinging themselves around in improbable aquatic configurations, and executing shockingly complex leg movements while upside down and not breathing. But that’s not the half of it. Each synchro routine also has an elaborate theme, and each theme must be conveyed with grace, precision and dramatically relevant facial gestures, as well as moves like the catalina rotation (rotate your body while holding your leg,   in the air) and the vertical descent (descend, straight upside down, until your toes are submerged). The athletes also have to do each move at the same time and make it seem fun and not hard at all, even when they are heaving, hypoxic and about to pass out. Judged for their artistic as well as athletic skills, synchro swimmers put considerable effort into their themes and choreography. The stories can celebrate a nation’s history and culture evoke classic tales, ballets, songs and myths mimic natural phenomena or abstract principles and, in the case of “Fury,” the American duo’s free routine theme in Rio, convey a mood itself. Sometimes the themes are obvious and careworn: Every competition seems to include at least one “Swan Lake” (hello, Austria). They can also be hideously ill conceived. In 1996, for instance, the French synchro team picked an unusual subject for the Olympics: the Holocaust. The routine began with the athletes   on the deck like Nazis and ended with them being rounded up and sent to the (figurative) gas chamber in the pool. After an international outcry, the team switched to a different topic, although its trainer, Odile Petit, tried to argue that the routine was no more offensive than the one “depicting torture in Chile” performed by the national   team. One strange feature of the sport is that despite all the attention lavished on the themes, even the judges cannot always work out what they are. “Not all the judges get the story,” said Irene Hawes, a longtime synchro judge. Take the “Firebird” suite by Stravinsky, she said. “There’s the phoenix rising and the battle and all that. A lot of people don’t know that. ” She continued, “I remember one routine was meant to be a tumbleweed, and the athletes were rolling along the deck, and people were wondering what they were doing. ” She figured it out, she said, only when the competition ended and “the country handed out a flier. ” Still, synchro athletes said, the narratives help both them and the spectators. “It’s much more interesting to watch a routine that has a specific theme in it,” said Bianca Hammett, captain of the Australian synchro team. She said the team’s free routine was “a journey through the unique flora and fauna of Australia. ” It features both the obvious (crocodiles: athletes’ legs snapping open and shut) and the not. “We have a lizards’ dance party,” Hammett said. “We put our hands near our heads, like we’re mimicking lizards. ” Many synchro teams pick themes celebrating their countries. The Spanish duo in Rio is doing a Flamenco routine while the Brazilians are depicting natural life in the Amazon. Britain is representing snakes (always popular, because of their watery sinuousness) the Kazakhs, ravens. The Swiss theme is “Orient bazaar,” whatever that means, while the French, with renewed Gallic ambition, have selected “Africa. ” The Russians, who almost always win, are modestly pretending to be mermaids. Another challenge: The choreography has to fit the music. “If you used a ballet but did, like,   movements, we would see it as strange,” Hawes said. “Same thing if it has a crescendo and you’re doing absolutely nothing but laying on your back. If it has a winding type of sound, which wants spinning, and you’re doing marches  —   these are factors. ” Every judge has pet peeves. Many people at the 2012 London Games did not care for Canada’s team program, which looked more like an Esther Williams extravaganza than a sports routine and which Hawes denounced as “gross. ” “It had to do with their headgear  —   large swimming caps covered with plastic flowers  —   their extreme facial moves, and the spitting of water,” Hawes said. As for Linda Loehndorf, another judge  —   spare her the circus programs. “It’s like, ugh,” she said. “I get it. You’re a clown. You don’t need to stick your tongue out at me. ” And then there are particularly memorable performances. Last year, for instance, China unveiled an electrifying routine that at first seemed destined for cliché corner. “I thought, Oh, jeez, not that again  —   ‘The Phantom of the Opera,’” Loehndorf said. “It’s something you hear over and over again. But they managed to tell the whole story in four and a half minutes, and I got it completely. It was a     sort of thing. ” And people still speak with awe about Spain’s daring 2009 performance to “Stairway to Heaven,” the cryptic song that launched a thousand sweaty slow dances. For those who have long been made to wonder, the team’s interpretation of the always challenging “bustle in your hedgerow” lyric offered as plausible an explanation as any. There was a line of athletes lying    in the water, arms and legs stretched out, possibly like a hedge wearing a selection of bathing suits there were two athletes off to the side, performing what was surely a bustle. “It was gorgeous,” Loehndorf said.'"}, "time": 1742563676.898011}