{"duration": 0.16768288612365723, "input_args": {"text": "'. Coca-Cola and Pepsi Fund 96 U.S. Health Groups It sounds like a bad joke, but it’s the sad truth: Coca-Cola and Pepsi, the nation’s 2 top soda make... Print Email http://humansarefree.com/2016/11/coca-cola-and-pepsi-fund-96-us-health.html It sounds like a bad joke, but it’s the sad truth: Coca-Cola and Pepsi, the nation’s 2 top soda makers, recently gave money to several prominent public health groups – including some run by the government. [1]The sadder truth: Those groups were more than happy to accept the funds.As reported by a new study published October 10 in the American Journal of Preventative Measures, researchers at Boston University School of Medicine reveal that a whopping total of 96 public health groups accepted money from Coca-Cola and PepsiCo (or both companies) between 2011 and 2015.Some of the organizations might look familiar: American Diabetes Association, the National Institutes of Health, the American Red Cross, the Academy of Nutrition and Dietetics, just to name a few .Study author Daniel Aaron, a medical student at Boston University, said of the groups:“To see all these organizations [accepting money] is shocking and surprising. I don’t think companies have a legal duty to protect people’s health, but I think these groups do.”Take a minute to let that sink in. The American Diabetes Association takes money from soda makers . The very products the organization advises people not to consume. The study’s authors called this link “surprising, given the established link between diabetes and soda consumption.” [2]Let’s take a deeper look at this bizarre report. Sweet, Sweet Data Aaron and his coauthor, Dr. Michael Siegel, a professor of community health sciences at the university, decided to take a closer look at the love fest between soda companies and public health groups last year, when The New York Times ran a piece about Coca-Cola’s financial support of a group called the Global Energy Balance Network. [1]This now-defunct “network” was composed of university researchers, and to put it in the simplest terms possible, Coca-Cola paid these so-called scientists to shift the blame away from junk food and sugary drinks for causing the global obesity epidemic, and a host of other health problems.Aaron says:“We were bothered by that, and a little bit confused, and we wanted to know if this was common.” So Aaron and Siegel began investigating the links between Coca-Cola and Pepsi and 96 organizations: 63 public health groups 5 government groups 2 food supply groups Pepsi sponsored 14% of these groups, while Coca-Cola sponsored 99%. The men think that’s probably an underestimate, however; Coca-Cola recently disclosed its sponsorships, while PepsiCo is “known for making its sponsorship data extremely difficult to track.”Additionally, the study also only looked at national organizations, and most sponsored organizations are state or city-wide, the researchers report.Here’s a shocker (note the sarcasm): When the team looked at lobbying efforts by both companies, they found that the soda companies actively oppose legislation that targets soda and is aimed at preventing obesity. Between 2011 and 2015, Coca-Cola and PepsiCo publicly opposed 28 bills and supported 1. Of the bills the companies opposed: 12 were soda taxes 4 were Supplemental Nutrition Assistance Program (SNAP) regulations 1 involved the controversial limit on soda sizes in New York. However, both companies supported a bill designed to limit the marketing of soda in schools, though beverages like Diet Coke could still be marketed.All that lobbying had a definite impact. One group, Save the Children, gave up pushing for soda taxes after Coca-Cola and Pepsi gave them a cool $5 million in 2009.And The Academy of Nutrition and Dietetics issued a statement saying that it would not back New York Mayor Michael Bloomberg’s proposed limit on soda portions, arguing that the emphasis should be placed on nutrition education.Marion Nestle, a New York University professor of public health and nutrition, says:“First, they attack the science. Then, they fund community groups, promote exercise as a solution, and say they’re self-regulated and don’t need to be regulated by an outside source.” [3]Aaron and Siegel write in the study:“It is probable that corporate philanthropy is increasing consumption of soda throughout the country.“Rather than supporting public health, organizations may become unwitting partners that contribute to corporate marketing strategy.” [1]The duo argues that soda companies’ sponsorship of health groups ends up creating positive cultural associations with their brands. It should be noted that sponsorship is considered marketing by the Federal Trade Commission (FTC).And never underestimate an industry’s ability to shape the public view.As I wrote last month, the sugar industry paid Harvard scientists to frame sugar as a mostly-harmless substance, while painting fat as the cause of obesity, heart disease, and all of the health problems we now know are actually caused by sugar.The sugar industry was so successful, in fact, that – to quote one professor – it was able “to derail the discussion about sugar for decades.” By Julie Fidler / References: [1] Time ; [2] RT ; [3] Business Inside r; Medical Daily Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742562710.673813}