{"duration": 0.11209321022033691, "input_args": {"text": "'NTEB Ads Privacy Policy HOCUS POCUS: Pope Francis Laughably Announces He Extends Priests ‘Power To Forgive Abortions’ The letter continues: \"May every priest, therefore, be a guide, support and comfort to penitents on this journey of special reconciliation. \"I henceforth grant to all priests, in virtue of their ministry, the faculty to absolve those who have committed the sin of procured abortion.\" by Geoffrey Grider November 21, 2016 Pope Francis has extended indefinitely the power of Catholic priests to forgive abortions, making the announcement in an apostolic letter released Monday. \\n“For there is one God, and one mediator between God and men, the man Christ Jesus;” – 1 Timothy 2:5 (KJV) \\nEDITOR’S NOTE: There is not a man on the face of the earth who has power to forgive your sins. The best anyone can do is point you to where forgiveness is, and that journey begins and ends with Jesus Christ . He shed God’s own blood on the cross at Calvary to obtain that pardon for you, and He did not “transfer that power” to any other human agency. When you step into the Catholic “confessional” and ask a man for forgiveness, you step out of that box just as dirty as you went in. Cut out the phony middleman, and go straight to the Source if you want to be clean. If you put your trust in the black-robed, “hocus-pocus” man from Rome, you will be gravely disappointed. Pun intended. \\nIt continues a special dispensation granted last year for the duration of the Year of Mercy — which finished Sunday — which gave all priests, rather than just bishops and specially designated confessors, the power to absolve the sin of abortion. \\nWhile the practical effect of Francis’ announcement remains unclear, it draws attention to the prevailing theme of his papacy: That the doors of the Church must remain open, just as God’s forgiveness and mercy extend to all those who repent from sin. THE GOSPEL TRUTH ABOUT VATICAN CITY AND THE ROMAN CATHOLIC CHURCH \\nThat said , the Catholic Church’s stance on abortion has not changed — it is still viewed as a “grave sin.” But it makes it easier for women who have had abortions to be absolved for their actions, and rejoin the church. \\n“I wish to restate as firmly as I can that abortion is a grave sin, since it puts an end to an innocent life,” the Pope’s letter states. “In the same way, however, I can and must state that there is no sin that God’s mercy cannot reach and wipe away when it finds a repentant heart seeking to be reconciled with the Father.” \\nThe letter continues: “May every priest, therefore, be a guide, support and comfort to penitents on this journey of special reconciliation. “I henceforth grant to all priests, in virtue of their ministry, the faculty to absolve those who have committed the sin of procured abortion.” \\n“For by grace are ye saved through faith; and that not of yourselves: it is the gift of God:” Ephesians 2:8,9 (KJV) \\nForgiveness for the sin of abortion , and for all sins, is found only in Jesus Christ and Him alone. \\n '"}, "time": 1742563863.4306326}