{"duration": 0.08531975746154785, "input_args": {"text": "'Review: Agent Orange linked to bladder cancer, hypothyroidism, Parkinson’s More veterans may be included in compensation By Christina Sarich - November 11, 2016 \\nMonsanto and Dow were 2 of the 9 wartime contractors hired by the US government to create Agent Orange, a combination of the toxic chemicals 2,4-D, and 2,4,5-T, just over 40 years ago. The damage these chemicals have perpetrated on our health and environment did not end with the Vietnam War though. \\nAside from the long-term poisoning of soil and crops, a new review of Agent Orange research has found evidence that bladder cancer and hypothyroidism are more strongly linked to exposure to Agent Orange than was previously assumed. \\nAlthough the new information does not support a previously-held belief that spina bifida , a birth defect, occurs more often in the offspring of exposed veterans, a report released by the Institute of Medicine on the health effects of Agent Orange recommended the Veterans Affairs Department grant service-connected presumption to veterans with “Parkinson’s-like symptoms,” not just those diagnosed with Parkinson’s disease related to Agent Orange exposure. In addition cancer, endocrine disease, and neurological impairment still loom large in the shadow of Agent Orange’s use. \\nGovernment agencies and their contractors who made these chemicals claim they dissipated shortly after being sprayed in the air, but two-thirds of these herbicides were contaminated with TCDD, a form of dioxin, a highly toxic substance linked to at least 15 classes of cancer and other medical conditions, as well as several birth defects . \\nThe toxic legacy on the Vietnamese will remain for generations, even though the dioxin contaminant may eventually be cleansed from the “hot spots” remaining in parts of southern Vietnam to this day. ( Agent Orange Record has a repository of information to corroborate these claims.) \\nThe 1,115-page review is the last of a series conducted by the IOM (part of the National Academies) on health problems related to Agent Orange and other herbicide use during the Vietnam War. \\nThe panel responsible for writing the report reviewed scientific literature released between October 2012 and September 2014, chaired by Kenneth Ramos, professor of medicine at the Arizona Health Sciences Center, University of Arizona. \\nThe pronouncement that Agent Orange caused bladder cancer and hypothyroidism was tied to results of a large study of Korean War veterans who served in the Vietnam War. \\nThe upgrade for bladder cancer and hypothyroidism from the category “inadequate or insufficient evidence” to “limited or suggestive evidence,” of a link as well as the recommendation to include Parkinson’s-like symptoms to the service-connected list could pave the way for thousands of veterans to receive health care and disability compensation where they have been neglected before. \\nThis review also shows quite clearly that for either political reasons or scientific ones, or both, we often do not understand the complete ramifications of using pesticides and herbicides until decades after they have been released into the environment, and by this time the damage is far-reaching in multiple layers of society. \\nRoughly 2.6 million U.S. veterans served in Vietnam, many of whom may have been exposed to Agent Orange. Many more Vietnamese people, including innocent women and children were exposed to these chemicals as well. The land in Vietnam is still an Agent Orange scourge, with about 12 million gallons of this supercharged weed killer, enough to douse 18,000 square miles , being sprayed on the 66,000 square miles of South Vietnam during the War. That’s enough to cover a fourth of the country. \\nAgent Orange was supposedly put out of commission in the 1970’s, but the ecological damage the spraying of these chemicals caused is still evident throughout Vietnam. \\nAttorneys for Military Veterans Advocacy and the Blue Water Navy Vietnam Veterans Association recently presented oral arguments to the U.S. Court of Appeals for the District of Columbia, asking it to decide whether the VA should have included these veterans in their presumption. \\nRetired Navy Cmdr. John Wells, executive director of Military-Veterans Advocacy, said the sailors who served on ships should be included because the vessels’ distillation systems used water contaminated with Agent Orange to produce drinking water as well as water used for their boilers. \\n“There was no magic, invisible Agent Orange filter at the mouth of the rivers,” Wells said. “We have documented proof of its presence in Nha Trang Harbor, 20 years after the war. That evidence has been presented to the VA. The distillation system which produced drinking water and water for the boilers did not remove the dioxin — it enriched it.” \\nDioxin is a member of the class of persistent organic pollutants which resulted from the deliberately accelerated production of 2,4,5-T, one of the components of Agent Orange. Dioxin can shorten the life of humans exposed to it and is associated with severe degradation of health in this and, potentially, future generations. \\nMonsanto was recently held accountable for polluting the environment in non-war time with dioxins. The company had to pay $93 million to citizens of a small town in West Virginia as part of compensation in a settlement for manufacturing dioxins. A factory was opened in Nitro in 1948 for this purpose. \\nWhile this case did not involve glyphosate , another deadly toxin used in Monsanto herbicides such as Roundup, its time will come soon. \\nThis report makes it clear that further study on the health consequences of dioxin exposure on humans is necessary. Agent Orange is just one of the many deadly chemicals that Monsanto, Dow and other chemical companies manufacture.'"}, "time": 1742562703.8903089}