{"duration": 0.03478217124938965, "input_args": {"text": "'\\nNo wonder they’re so confident!\\nDominion Voting Systems brags on its home page that “Together with our customers, we strive to change elections for the better!”\\nWikipedia currently reports that Dominion provides voting machines to 22 states.\\nIf you hit the link to this statement, however, the supporting post has now been taken down.\\nDominion Voting Systems is owned by George Soros an internationalist billionaire who is openly supporting Hillary Clinton and donated to her campaign dozens of millions of dollars.\\n\\nWe now know that the machines are already flipping out votes from Donald Trump to Hillary Clinton in Texas, Illinois, North Carolina and other states. The people working at the voting boots always find out some WHATEVER excuses while so far there hasn’t been a single vote switched from Hillary to Trump.\\nSoros is also said to control a British company called Smartmatic, which had something to do with election fraud in Venezuela. Thanks to the Smartmatic machines, communists “won” the elections over and over again.\\nSmartmatic is tied to Soros’ Open Road Foundation and it used to have a subsidiary called Sequoia. Sequoia electronic voting machines are used in the US general election. Sequoia was eventually sold to Dominion Voting Systems.\\nHow do you like that people? The man in charge of counting your votes happens to have a favorite.\\nThis is exactly like Joseph Stalin’s famous quote: “The people who cast the votes don’t decide an election, the people who count the votes do.” \\nIt does’t matter that you go out and vote for Trump, what matters is that Soros is gonna count votes the way he wants to and that’s just not right to have a private person in charge of the elections basically.\\nSoros needs to have his entire fortune confiscated by the US government, nationalized and included in the state budget and have him locked up for the rest of his miserable life. Remember how those commie SJWs call for equality and taking from the rich and giving to the poor? Sure lets start with this high-profile thief right here.\\nThe system is rigged people and Trump is right! Voting should only be on paper not on machines which can be manipulated easily!\\n'"}, "time": 1742561942.4374616}