{"duration": 0.11067867279052734, "input_args": {"text": "'WILLINGBORO, N. J.  —   The peacocks were rooting around in the bushes, strutting and pecking and ruffling their trains. Occasionally, one  —   Boy or Big Boy, say, or Snow White  —   struck a pose, tipping its beak up to emit a banshee shriek. “They’re just a bunch of drama queens, honey,” said Pat Cleveland, as she sat in the backyard of her house in a rural part of New Jersey, sipping on a   juice drink the color and texture of algae. Drama queens, as it happens, is a topic on which Ms. Cleveland has some stories to tell. This she does in “Walking with the Muses,” a picaresque new memoir about a tall, skinny   girl (“not black enough to be black or white enough to be white”) hailing from a section of East Harlem that she terms the Golden Edge. In her 1950s childhood, Ms. Cleveland writes, that neighborhood was still representative of a now largely bygone city, a place where “the Jews, the blacks, the Irish and the Puerto Ricans all had a corner of their own. ” Ms. Cleveland took her leave from childhood’s haunts fairly early and through the kind of cinematic turn of fate that seems to have characterized much of her life. A Vogue editor discovered the     on a subway platform, chased her down and set her on the road to becoming a fashion model. “Model” is probably too limited a job description for a woman who, through a singular combination of moxie,   beauty and preternatural energy, spent the next five decades romping across continents and stamping her imprint on an industry that, if it didn’t always know what to do with her, inevitably succumbed to her goofball appeal. “Pat was a muse for Halston, Stephen Burrows, Giorgio Sant’Angelo and Antonio Lopez,” Diane von Furstenberg, the designer and chairwoman of the Council of Fashion Designers of America, wrote in a recent email from Tokyo, where she had paused briefly on her way to Bhutan. “She was, and is still, magical. ” Whether on catwalks in New York or the various European capitals of fashion, Ms. Cleveland made for an unconventional model, one not classically beautiful and yet “a more gorgeous version of Josephine Baker,” as Ms. von Furstenberg said. Dancing, twirling, strutting on a runway and “moving like no one else,” as the designer added, Ms. Cleveland had an effect on the catwalk best captured by another top model of the era, Janice Dickinson: “When she moved, she painted the air around her with the clothes. ” To comprehend what Ms. Cleveland is to the recent history of fashion, it probably helps to consider what fashion is not anymore: an insular and largely tribal business dominated by cliques and elites. Compelling to a largely cult fan base, fashion in Ms. Cleveland’s 1970s prime was anything but the corporate juggernaut and global entertainment spectacle it has since become. American fashion, in particular, during the era when Ms. Cleveland first appeared, was also more porous and racially diverse than it would be in the subsequent decades. Success in the business was measured in those days not by social media metrics but by an ability to bewitch the cognoscenti, to make yours a name they whispered about. And seemingly Ms. Cleveland has been an object of fascination for those around her almost from the time she was born 65 years ago to a white Swedish saxophonist and an   artist from the South. Soon after, Ms. Cleveland’s father, Johnny Johnston, returned to Sweden, leaving her mother, Lady Bird Cleveland, to raise her   young daughter alone. “If you’re a single black woman and have a Swedish lover, life is never going to be easy, and Lady Bird didn’t have the opportunities in life,” Ms. Cleveland said. “But her lesson to me was always, whatever your circumstances are, it’s up to you to create your own world. ” She was sitting at a picnic table in the mild spring sunshine. Behind her was a clutch of the tame peacocks that had strayed from a nearby farm and into the yard of her modest   house one day and somehow remained. Set amid a row of   plots carved from rich local farmland, the house was Lady Bird’s until her death last year from Alzheimer’s disease. More than a decade ago, Ms. Cleveland and her husband, the photographer Paul Van Ravenstein, returned to the United States from the Italian mountain village where they’d been living, to care for the ailing woman. “I tell my kids I expect them to do the same for me,” Ms. Cleveland said of her son, Noel Van Ravenstein, a sometime model and yoga teacher, and her daughter, Anna Cleveland, who herself has cut a considerable swath through the modeling business in recent years. Throughout the house hang scores of the prolific Lady Bird Cleveland’s paintings and drawings images of black historical figures crowd the walls there, stand five deep in a storeroom and are even taped inside kitchen cabinet doors. A parallel domestic presence is that of Gurumayi Chidvilasananda, the Hindu spiritual leader who counts Ms. Cleveland among her devotees. Dressed in a     and snug plum jeans, Ms. Cleveland looked surprisingly fresh that day, particularly given that she’d driven home from Manhattan at 6 in the morning, after a marathon   photography session with Anna Cleveland for a catalog. The prosaic suburban setting seemed a far cry from her glamorous work life and from the   haunts Ms. Cleveland depicts in her book. It was not easy to square the serene figure at the picnic table with the goofball naïf who over the years found herself on   jaunts through the Serengeti with tempestuous models and photographer divas who spent a thousand nights clubbing in New York or Paris fueled by lavish quantities of Champagne and other stimulants who embarked on nearly that many libidinal adventures along the way. “I practically killed myself at the Tenth Floor,” she remarked offhandedly, referring to a   1970s gay dance club made famous in Andrew Holleran’s novel “Dancer from the Dance. ” “I was wearing platform shoes and went up on a ladder and started laughing and dancing because we all had poppers and I almost fell off. ” “Walking with the Muses,” a densely peopled and illustrated volume, is studded with the boldface names of Ms. Cleveland’s acquaintance (“Diane Vreeland was a freak and she liked the freaks,” she remarks) and amorous partners  —   Mick Jagger, Jack Nicholson and Warren Beatty make appearances  —   but also with cultivated figures from her mother’s Harlem Renaissance coterie. It was Carl Van Vechten who snapped some of Ms. Cleveland’s earliest photos. What’s notable about Ms. Cleveland’s story is its grounding in an untutored wisdom, her own canny powers of observation and a willingness to write with candor about professional challenges that, as often as not, were rooted in race. When she first appeared on the scene, according to André Leon Talley, a contributing editor of Vogue, Ms. Cleveland was a type of model people hadn’t seen before. “A skinny girl from Harlem with no boobs and a frizz of hair,” is how she describes herself. At the height of her powers, that same skinny girl from Harlem was transformed into a star on the evening of Nov. 28, 1973, when she  —   one of 30 black models chosen to participate in a benefit runway show held at the Palace of Versailles outside Paris  —   took to the stage in front of 800 guests, many of them prominent or titled, and, spinning and twirling, left little doubt in the minds of observers that the immediate future of fashion belonged not to the Old World but to the New. “Pat was never a parody of the   model,” Mr. Talley said. “The way she walked, her sense of theatricality wasn’t something she acquired. Whether she was being zany, goofy Pat or ethereal, ephemeral,        Pat, what she did was natural to her. It came from within. ” So, too, Ms. Cleveland said, does the memoir, which she composed in multiple drafts across a dozen years, employing notes made so long ago that most were written on a typewriter. “I wrote this book myself, honey,” said Ms. Cleveland, as she glided indoors and into a sunlit studio where stacks of early drafts lay piled alongside snapshots of a   girl in pigtails and scores of magazine tear sheets showing a glamorized Ms. Cleveland as captured by nearly every    fashion photographer of any note: Richard Avedon, Irving Penn, Bruce Weber and Steven Meisel. Ms. Cleveland doesn’t shrink from facing down in her book an industry not always welcoming of black beauty, then or now. “In the beginning, people said, ‘You shouldn’t use her, you shouldn’t use her,’” the designer Stephen Burrows explained recently by telephone. “But her personality was so electrifying and inspirational, you could imagine anything you designed on her, like a sketch come to life. ” It is dismal to note that, as Ms. Cleveland said, the racial discrimination she experienced at the start of her long career persists. “It’s still out there, my darling,” said the model, who decades ago fled New York for Paris, where she vowed to remain until a black woman appeared on the cover of Vogue. (Beverly Johnson earned the distinction in August 1974.) It was early on during her sojourn in Paris that Ms. Cleveland fell in with the   fashion illustrator Antonio Lopez, and through him that she met the model Donna Jordan, the designer Karl Lagerfeld and many others from among an impossibly glamorous faction the writer Alicia Drake characterized as the Icarus Generation in her 2006 book, “The Beautiful Fall: Lagerfeld, Saint Laurent and Glorious Excess in 1970s Paris. ” Most favored of the perches for that group were the banquettes of the Café de Flore on the Boulevard  . There, as Ms. Drake wrote, “designers, models and muses all came,” seeking notice, arrayed on one side of the room a cluster of beautiful and seductive Yves Saint Laurent loyalists  —   people like Loulou de la Falaise and Betty Catroux  —   and opposite them, half hidden behind potted palms, “a dazzling throng of Americans” from the camp of Mr. Lagerfeld. “We were just like two little girls from Little Rock,” Ms. Cleveland says of herself and Ms. Jordan, a reference to the beautiful provincials in “Gentleman Prefer Blondes. ” “We were comrades and we were going to get that Vogue cover!” she adds. Failing that, they would win the embrace of designers like Valentino and Oscar de la Renta and Thierry Mugler and Ms. von Furstenberg, and of Mr. Burrows and Kenzo and Yves Saint Laurent. So besotted was Halston with how Ms. Cleveland looked and moved in his clothes that he drew her into his inner circle, anointing her a “Halstonette. ” It is a challenge to conjure, in an age of anonymously interchangeable and often robotic creatures, her effect on those lucky enough to have observed her working her ephemeral magic on a runway. For those who did, she remains unforgettable. “I still have a visceral, electric memory of her,” said Michael Gross, the author of “Model: The Ugly Business of Beautiful Women” and “Focus: The Secret, Sexy, Sometimes Sordid World of Fashion Photographers,” which will be published on July 5. “It wasn’t just dancing, it wasn’t leaping, it certainly wasn’t mere walking,” Mr. Gross said. “She was the living embodiment of not just the clothes, but the joie de vivre, the energy and enthusiasm, everything that was great about that particular moment in fashion and the joy of being alive. ”'"}, "time": 1742628525.085225}