{"duration": 0.13384675979614258, "input_args": {"text": "'Former Virginia chairman of the Donald Trump for President campaign and candidate for Virginia governor Corey Stewart spoke to Breitbart News Monday as voters prepare to go to the polls in Tuesday’s GOP primary. [Stewart has campaigned as an   Trumpian populist, placing the fight against illegal immigration at the center of his policy portfolio and rousing the ire of the mainstream media and the political left with his steadfast defense of Virginia’s numerous monuments to its Confederate war heroes.  “I led the nation’s toughest crackdown on illegal immigration in 2007. It’s still in place today. So far we have handed over to the federal government more than 7, 500 criminal illegal aliens,” Stewart told Breitbart News, referring to his time as a Prince William County Supervisor where he first came to national notice for his introduction of a county policy requiring police to look into the immigration status of those they arrest. Stewart continued his pitch for serious immigration enforcement, focusing on the transnational criminal gangs that have been terrorizing Virginia, committing a string of gruesome crimes evocative of their central American origins across the state. Stewart said: I am determined to put in place the toughest statewide crackdown on illegal aliens in the country in Virginia, especially rooting out and destroying  . I am going to do that through the 287( g) authority, which would mandate that every locality, every jail in the state will check immigration status   …     and hand inmates over to the federal government if they’re here illegally. Stewart sought to draw a contrast between his own immigration agenda and that of his main opponent in the GOP primary, putative   and narrowly defeated 2014 U. S. Senate Candidate Ed Gillespie, whom he called a “squish Republican” despite his own pledges to be tough on immigration. Stewart has hit Gillespie for serving as a lobbyist for Tyson’s Food as it was charged, and later acquitted, in a human smuggling investigation in connection with its labor practices. Tyson’s widespread use of refugee and   immigrant labor has continued to come under criticism from   immigration groups. “Ed was paid money not only to downplay human smuggling charges, but also to lobby for amnesty,” Stewart told Breitbart News. “That’s not being tough on illegal immigration, that’s being complicit in illegal immigration. ” “He never reneged on his statement that he supports the “Gang of Eight” amnesty,” Stewart continued, referencing Gillespie’s   endorsement of a “path to citizenship” on CNBC’s Larry Kudlow. “The Amnesty for twelve million illegals, he called it good politics and good policy. ” Gillespie also told Kudlow in that 2013 interview that the Gang of Eight bill was “not perfect. ” His campaign website insists he was never supportive of the bill’s amnesty provisions. Gillespie campaign spokesman David Abrhams took issue with Gillespie’s characterization on his immigration record. “We’re done commenting on Corey’s constant stream of attacks, fabrications and falsehoods. Ed’s focused on the issues that matter to the voters of Virginia, and we’re looking forward to tomorrow’s primary,” he told Breitbart News. While Stewart’s hardline immigration stances have caused sparks between him and his GOP primary opponents Gillespie and State Senator Frank Wagner, it is the controversy surrounding his defense of Virginia’s Confederate heritage that pushed his campaign into the pages of the national press. The issue exploded this spring, as cities like New Orleans began to tear down   monuments built to the southern heroes of the War Between the States to the applause of “civil rights” groups like the Southern Poverty Law Center and their allies in both major political parties. In Virginia  —   cradle of the Confederate capital birthplace of such   revered generals as Robert E. Lee, J. E. B. Stuart, and Thomas “Stonewall” Jackson host to almost all of the   conflict’s most   battlefields and source of more Confederate war dead than any state  —   the march to erase the  “ugly” Confederate past ran into an obstacle. In Charlottesville, home to University of Virginia, which a little over 150 years ago provided the Confederate Army with more than 1, 400 officers including slavery opponent and pioneer of mobile warfare John Mosby, the city council’s efforts to remove   statutes of Lee and Jackson were met with lawsuits and defiant protests. Stewart, alone among prominent politicians, stood, much to the chagrin of the mainstream media, with those who sought to preserve the reverent memory of the Confederate dead of the Old Dominion. Outlets like Politico and the Washington Post quickly published dismissive pieces on Stewart linking him to racial hatred when he refused to condemn the monuments and those who defended them. Stewart’s likely opponent in November’s general election should he win Tuesday’s primary, Democratic   Tom Perriello, made a stand with the leftist agitators and liberal local governments calling for the widespread removal of historic Confederate monuments across the state, accusing Stewart of “touting an ignorant,   view of Virginia” with his insistence they be left alone and calling the Confederacy “our greatest sin. ” Perriello later tweeted that Stewart was “a Confederate apologist trying to use racism to score political points,” as he used the incident to hit his   general election opponent Gillespie, who had said he would vote for Stewart if he won the primary instead of him. Not even a Confederate apologist trying to use racism to score political points can draw condemnation from @EdWGillespie. Says it all. https:  .   —   Tom Perriello (@tomperriello) April 25, 2017,  “What I’ve found is that those liberal like Tom Perriello who preach tolerence are some of the most intolerant people there are. He is intolerent and has a hatred and disgust of Virginia’s heritage and history,” Stewart said to the implication: Anyone trying to destroy [the monuments] is trying to rewrite and erase our history for their own ends. I’m trying to defend it and for that he calls me a bigot and a racist and  . I’m not trying to live in the past   …     but that doesn’t mean we let go of our culture and of our values, and doesn’t mean that we denigrate those men who fought to protect Virginia. Asked what he thought Perriello’s own view of Virginia was, in contrast to the “ignorant,  ” once ascribed to him, Stewart replied: Tom Perriello’s vision for Virginia is transgender bathrooms at every rest stop, every school, and every business, millions of illegal aliens coming into Virginia taking people’s jobs, committing crimes and then not having them deported. His vision is having more restrictive environmental regulations on Virginia businesses and continued job losses. His vision is the shutdown of the coal industry in southwestern Virginia. His vision is misery and poverty. Perriello’s campaign declined to comment for this article. Polling for the race had put Stewart well behind Gillespie. A poll released Sunday by new   firm Change Research, however, has Stewart with a narrow lead and up by nine points against his GOP rivals among the voters who will “definitely” vote for their preferred candidate. Breitbart News could not independently verify the methodology of this poll, but the same outfit forecasted Greg Gianforte’s victory in his special election for Montana’s U. S. House seat within one point the actual result. Polling places open Tuesday at 6am and are open until 7pm.'"}, "time": 1742563366.0050054}