{"duration": 0.047387123107910156, "input_args": {"text": "\"Wed, 26 Oct 2016 21:10 UTC © Jonathan Ernst / Reuters The Kingdom of Bahrain's authoritarian ruler King Hamad bin Isa Al Khalifa visited British Prime Minister Theresa May at Downing Street on Wednesday, despite outcry from human rights and anti-arms trade groups. The Gulf regime is a close ally of both the UK and Saudi Arabia, as well as being a major UK arms customer, and is currently bearing much of the cost for building the Royal Navy's new Mina Salman naval base. Human rights groups have highlighted widespread abuses committed by Bahraini government forces against pro-democracy activists during the 2011 Arab Spring. The king's visit was met with protests by the Bahrain Institute for Rights and Democracy, and Campaign against the Arms Trade (CAAT) on Wednesday afternoon. Two activists were escorted away by police. Already in 2016, senior British Royals, who are known for their closeness to the Gulf monarchies, have been criticized for meeting the Bahraini monarchy both in the UK and during trips to the nation. The Prince of Wales and Duchess of Cornwall will soon visit Bahrain on behalf of the UK government, despite long-standing concerns over human rights abuses and UK arms sales. In April, a report for the Foreign Affairs Select Committee blasted Bahrain's record on human rights abuses, not least during the violent crushing of Arab Spring protests with the direct support of another controversial UK ally, Saudi Arabia. The report also argued that human rights had effectively been downgraded by the UK government in a bid to shore up relations with the authoritarian state, which enjoys arms trading and security arrangements with Britain. A broad campaign is currently underway, including MPs, to put a halt to UK arms sales to the Saudi regime in light of repeated reports of war crimes in its UK-assisted aerial bombing campaign in Yemen. Comment: More on UK's close relationship with Bahrain:\""}, "time": 1742563940.884916}