{"duration": 0.008397340774536133, "input_args": {"text": "'Geraldo Rivera says President Donald Trump is “surrounded by rats. ”[The Fox News correspondent unloaded on anyone accusing Trump of obstructing justice amid reports that the president asked former FBI Director James Comey to drop his investigation into former National Security adviser Mike Flynn.  In a series of Twitter messages sent Wednesday morning, Rivera said Trump did not come “close to obstruction. ” “News Flash, @realDonaldTrump hoping @JamesComeyFBI cuts @MikeFlynn some slack because he is a ‘good man’ is not close to #Obstruction,” Rivera tweeted: News Flash, @realDonaldTrump hoping @JamesComeyFBI cuts @MikeFlynn some slack because he is a ’good man’ is not close to #Obstruction,  —   Geraldo Rivera (@GeraldoRivera) May 17, 2017,  “Attack @POTUS with reckless abandon  it tanks #stocks, spreads uncertainty among our allies  joy among our enemies. Empanel Select Cmte,” Rivera added: Attack @POTUS with reckless abandon  it tanks #stocks, spreads uncertainty among our allies  joy among our enemies. Empanel Select Cmte,  —   Geraldo Rivera (@GeraldoRivera) May 17, 2017,  The Fox News correspondent called talks of impeaching President Trump “lazy” and “reckless. ” “#Impeachment talk is lazy, uninformed    no underlying crime. #ComeyMemo does not spell out #Obstruction@POTUS has rights too,” he wrote: #Impeachment talk is lazy, uninformed    no underlying crime. #ComeyMemo does not spell out #Obstruction @POTUS has rights too,  —   Geraldo Rivera (@GeraldoRivera) May 17, 2017,  Refusing to mince words, Rivera said Trump’s administration is filled with “rats. ” “Whatever you think of @realDonaldTrump imagine how daunting it is to go to work each day surrounded by rats”: Whatever you think of @realDonaldTrump imagine how daunting it is to go to work each day surrounded by rats,  —   Geraldo Rivera (@GeraldoRivera) May 17, 2017,  The New York Times reported Tuesday that Trump had conversations with Comey, insisting that he shut down the investigation into Flynn. “I hope you can see your way clear to letting this go, to letting Flynn go,” Trump told Comey, according to parts of the memo, as published by the New York Times. “He is a good guy. I hope you can let this go. ” The Trump White House has denied the Times story. Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742628467.1909575}