{"duration": 0.2788529396057129, "input_args": {"text": "'DAVAO CITY, Philippines  —   President Rodrigo Duterte relishes the image of  . He boasts of killing criminals with his own hand. On occasion, he calls for mass murder. Speaking of the drug addicts he says are destroying the Philippines, he said, “I would be happy to slaughter them. ” Mr. Duterte and his friends have long cultivated legends of his sadistic exploits, like throwing a drug lord from a helicopter and forcing a tourist who violated a smoking ban to eat his cigarette butt at gunpoint. It is a thuggish image that Mr. Duterte embraces. Whether Mr. Duterte has done what he says  —   the killings he claims to have carried out are impossible to verify  —   he has realized his gory vision in national policy. First as a mayor, now as president of the Philippines, he has encouraged the police and vigilantes to kill thousands of people with impunity. While his draconian justice and coarse manner have earned him widespread condemnation outside the Philippines, an   look at his rise to power and interviews with many people close to him reveal a man of multiple contradictions. He has alienated many with outrageous comments and irrational behavior, yet remains wildly popular. He is an antidrug crusader, yet has struggled with drug abuse himself. And he grew up a child of privilege, the son of a provincial governor, yet was subjected to regular beatings. His mother whipped him so often for his misbehavior that she wore out her horsewhip, according to his brother, Emmanuel Duterte. At parochial school, he was caned by Jesuit priests and, the president says, molested by one. By his teenage years, he was known as a street brawler. “Violence in the house, violence in the school and violence in the neighborhood,” Emmanuel Duterte said. “That is why he is always angry. Because if you have pain when you are young, you are angry all the time. ” Years later, a psychological assessment of Mr. Duterte, prepared in 1998 for the annulment of his marriage, concluded that he had “narcissistic personality disorder” and a “pervasive tendency to demean, humiliate others and violate their rights. ” Nonetheless, his ailing   campaigned for his presidential bid last year. That act of devotion only begins to unravel the paradox that is Mr. Duterte. Behind his brutish caricature, according to interviews with dozens of Mr. Duterte’s friends, family members, allies and critics, is a man who can be charming and engaging. He has many loyal friends and a soft spot for sick children. As mayor of Davao City, he was known to help people in need by digging into his pocket and handing them a wad of cash. To many, his vulgar jokes only burnish his bona fides as a man of the people. When he appears in public, he is swarmed by adoring fans. Still, the bodies have been piling up. Since Mr. Duterte took office last June and declared a “war” on drugs, the police and unknown assassins have killed more than 3, 600 people, the police say, mostly in the slums of Philippine cities. Some put the toll at more than 7, 000. “I might go down in the history as the butcher,” he acknowledged unapologetically in January. In less than nine months, he has already surpassed the death toll of President Ferdinand Marcos, whose forces killed about 3, 300 political opponents and activists during his harsh   rule. Yet his gangland approach to combating crime and drugs has largely endeared him to Filipinos who have suffered high rates of violent crime and who see him as a refreshing change from the sophisticated but    elite who have ruled this country for most of the last three decades. The dissonance between the image of the gentle, caring grandfather and the brutal strongman spilling blood on the streets is just one of many in a   president who was born to the elite and has lived a life surrounded by violence. Rodrigo Roa Duterte grew up in   Davao City, in the southern Philippines, the oldest son of the governor of Davao Province. As a teenager, he hung out with the toughest kids, got into fights and learned the rude expressions he uses today. By 15, he was carrying a gun, his brother said. As a freshman at the Ateneo de Davao high school, he was fondled by an American priest, an experience he revealed only in 2015. He identified the priest as the Rev. Mark Falvey, who later moved to California and died in 1975. The Jesuit order agreed in 2007 to pay $16 million to nine people Father Falvey molested as children at a Hollywood church. Mr. Duterte retaliated against another priest who had punished him by filling a squirt gun with ink and spraying the priest’s white cassock, his siblings said. For that, he was expelled. He often skipped classes and likes to tell audiences that it took him seven years to finish high school. His misbehavior was often overlooked because of his status, family members say. “He was known as the governor’s son,” said his older sister, Eleanor Duterte. A daredevil, he took flying lessons at 16. On his first solo flight, he buzzed the family home and hit a treetop with the wheel of his Piper Cub, Emmanuel Duterte said. Later, a car accident put him in a coma for two days, his sister Jocellyn Duterte said. The first time he killed a man, he says, was in a drunken beach brawl at age 17. “Maybe I stabbed somebody to death,” he told an interviewer two years ago. His reputation as a womanizer is well founded, but it was often women who sought him out. “Being the governor’s son,” Jocellyn Duterte said, “the women were always available. ” His father told him that since he was always in trouble, he could save legal fees by becoming a lawyer, his brother recalled, so Rodrigo went to law school. In his final year, he shot and wounded a fellow student whom he accused of bullying him. Mr. Duterte graduated anyway and became a prosecutor. “One thing about my brother is he is hardheaded,” Emmanuel Duterte said. “The more you tell him not to do it, the more he will do it. He needs to tone down on his anger. He needs anger management. ” In the 1980s, his mother led frequent marches against President Marcos’s dictatorial rule. After his ouster, President Corazon Aquino offered her the post of Davao’s vice mayor. She asked that Rodrigo be appointed instead, friends and family said. Two years later, in 1988, he ran for mayor and won, starting a lifelong streak in which he has never lost an election. When he took office, much of Davao was a war zone. The iron rule of the Marcos era had ended, and Communist rebels held a large part of the city. Armed groups operated with impunity and assassinations of police officers were common. Making the city safe was Mr. Duterte’s biggest challenge, and one he accepted personally. Jesus G. Dureza, a high school friend who is now a   adviser, recalls seeing him late one night in the taxi he often drove to patrol the city. Mr. Duterte said he was hunting for a man who had been robbing cabdrivers. Mr. Dureza noticed that his pistol was cocked. “He had a death wish,” Mr. Dureza said. Shortly after he became mayor, crime suspects started turning up dead on Davao’s streets. Mr. Duterte and his supporters have long denied the existence of a death squad in Davao City. But in September, Edgar Matobato, 57, came forward and told a Senate committee that he worked as an assassin on the squad for 24 years, killing about 50 people. In an interview with The New York Times, he said the death squad was founded in 1988 at a lunch he attended at the old Menseng Hotel with Mr. Duterte, several police officers and six other recruits. They were told their job was to hunt down criminals. A police officer passed around a covered basket, and each recruit took out a weapon. Mr. Matobato considered it good fortune that he drew a . 45. “The only one who could command the Davao Death Squad was Mayor Duterte,” he told The Times. “If there was an order to kill, it had to be with his clearance. Without his orders, we kill no one. ” Mr. Duterte took part in at least one killing, Mr. Matobato said. In 2007, a chance encounter on the road with a man named Vicente Amisola led to a shootout. After Mr. Amisola ran out of ammunition, Mr. Matobato said, Mr. Duterte arrived, grabbed an Uzi and emptied two magazines at the defenseless Mr. Amisola. When they checked Mr. Amisola’s body, the squad discovered that he worked for the National Bureau of Investigation. Arnold Rosales, the bureau’s acting regional director in Davao, said that Mr. Matobato’s account of Mr. Amisola’s killing matched the findings of the bureau’s investigation except for one detail: the allegation of Mr. Duterte’s involvement. Investigators concluded that the death was a result of miscommunication, and no charges were filed, Mr. Rosales said. The investigative report is missing, he said. In February, a former police officer, Arthur Lascañas, 56, came forward and confessed to having led the death squad. He said that he received orders to kill directly from Mr. Duterte and that he had killed 200 people. “All the killings that we committed in Davao City, whether they were buried or thrown in the sea, were paid for by Mayor Duterte,” he said. Of the more than 1, 400 people the Davao Death Squad is believed to have killed, at least one was not a crime suspect. Jun Pala, a journalist and outspoken critic of Mr. Duterte’s, was gunned down near his home in 2003. Mr. Lascañas said the mayor ordered the killing, and that Mr. Lascañas helped carry it out. Mr. Duterte has never directly addressed the accusations made by Mr. Matobato or Mr. Lascañas, and he declined to be interviewed for this article. After Mr. Matobato’s testimony, Mr. Duterte accused the senator who led the committee of taking payoffs from drug lords. She was arrested and jailed last month. Mr. Duterte’s personal death toll is harder to substantiate. If he stabbed someone on the beach, there is no record of it. In boasting that he hunted down suspects by night, he offered no specifics. His claim to have killed “about three people” probably refers to a 1988 hostage raid in which he says he fired an   at three kidnappers. But he recently acknowledged, “I may have hit them all or none at all. ” Becoming president has been an adjustment for Mr. Duterte, who is 71. For months, he still thought of himself as mayor and often called himself that. He prefers to go home to Davao City rather than stay in the sprawling presidential palace complex in Manila. In a land that is notoriously corrupt and where government officials often live like kings, he has lived for decades in the same modest   house where he only recently installed  . Pomilda Daniel, a neighbor, calls him “a simple man. ” She said that Mr. Duterte once admired her large new television and asked if he could have it if it ever broke so that he could fix it and use it. Yet when he discovered during a visit to the House of Hope, a child cancer treatment center in Davao, that the children had no televisions, he returned the same day with nine TV sets and had them installed, said Dr. Mae Dolendo, a pediatric oncologist who heads the center. “He is very, very compassionate,” she said. “We have had presidents who conducted themselves like we would expect presidents to conduct themselves, but they haven’t solved the country’s problems. He’s not perfect. He curses. But he gets things done. ” Mr. Duterte has no official first lady and boasted during his campaign that he had two wives and two girlfriends. Later, he said that he should give Pfizer an award for creating Viagra. In 1973, he eloped with Elizabeth Zimmerman, a former flight attendant, after courting her for a month. The marriage lasted until 2000, when it was annulled. The psychological assessment of Mr. Duterte prepared for the annulment, a copy of which was obtained by The Times, was based on an examination of Ms. Duterte and is not a diagnosis. In addition to the finding of narcissism, it described Mr. Duterte as a “control freak” and womanizer who began having affairs soon after he was married and flaunted his infidelity by bringing girlfriends to public functions. While still married, Mr. Duterte met Cielito Avanceña, a teenage contestant in a beauty pageant who goes by Honeylet. She is 25 years his junior. He has described her as his second wife, although they never married. Ms. Duterte and Ms. Avanceña declined to be interviewed. Perhaps some of the president’s mercurial behavior stems from the constant pain he suffers and his use of narcotics to treat it. Mr. Duterte has made a political career of fighting drugs but acknowledged in December that he had been abusing the opioid fentanyl, the powerful and addictive drug that killed the musician Prince last April. Mr. Duterte began using fentanyl to treat back pain and migraines from a spinal injury, apparently a result of a motorcycle accident a few years ago. His doctor prescribed a quarter of a fentanyl skin patch, the president said, but he began using an entire patch at a time. When his doctor discovered that, he ordered him to quit. “He said: ‘Stop it. The first thing that you would lose is your cognitive ability,’” the president recounted. “‘You are, you know, abusing the drug. ’” Mr. Duterte has not said publicly when he started using fentanyl or whether he has stopped. In December, he denied being addicted. His communications director, Martin Andanar, said that Mr. Duterte had stopped using fentanyl “way before he was elected president” last May. But a person with knowledge of his condition told The Times in September that Mr. Duterte was using the drug then. Mr. Duterte’s energy and   hair belie his age, but his afflictions have taken their toll. During public appearances, he often presses his fingers against a nerve on the side of his face to reduce the pain. He has skipped several public events because of illness. In his speeches, he sometimes suggests he will not live to serve out his   term. He has not explained why. Decades ago, Mr. Duterte learned that he had two rare conditions, Barrett’s esophagus and Buerger’s disease, which prompted him to quit drinking and smoking. As mayor, he enforced a strict public smoking ban, and he is now considering a similar measure nationwide. He dislikes being questioned about his health. After a reporter asked for his medical report, he publicly rebuked the journalist, demanding, “How is your wife’s vagina?”  Mr. Duterte’s outrageous remarks have left many with the impression that he is unhinged. He says God speaks to him and made him president of this heavily Roman Catholic country. He has compared himself to Hitler. He used a term that translates as “son of a whore” to describe both Pope Francis and President Barack Obama. Antonio Trillanes, a senator, recalled that when they met in 2015 to discuss a political alliance, Mr. Duterte only wanted to talk about people he had killed and “how the brains were splattered all over the place, gangland style. ” He seems never to have questioned the proposition that shooting people on the street is the best remedy for crime and addiction. “I have my own political philosophy,” he said recently. “Do not destroy my country, because I will kill you. ” He scoffs at complaints about lack of due process for people killed by his police force and has threatened to kill human rights activists. On numerous occasions, his aides have had to walk back his comments. Press secretary Ernesto Abella cautioned journalists that they should use their “creative imagination” to understand him and not be “too literal. ” That Mr. Duterte’s violent boasts should not always be taken literally matters little to his zealous supporters and is of little consolation to the families of the thousands killed by his policies. “He is a child of privilege, but he became a champion of the little guy,” said Ken Angeles, Mr. Duterte’s college roommate and lifelong friend. “He’s a very passionate guy. ” Senator Trillanes, now a leading critic of Mr. Duterte, has another name for him: “mass murderer. ”'"}, "time": 1742561972.0467067}