{"duration": 0.06395196914672852, "input_args": {"text": "'November 2, 2016 \\nA group of about 200,000 White Holland turkeys in a gigantic shed at a farm in Ohio is now debating whether or not to vote in favour of Thanksgiving. The vote to be made next week by pecking once at a pile of grain for ‘Thanksgiving’ or twice for ‘Something Else’ comes after bitter arguments in which claims and counter-claims were made about the availability of dust for bathing in over the turkeys’ long-term (i.e. three-week) future. \\nMany turkeys have deplored the resulting divisions, which have seen elevated levels of pecking in the once harmonious community five miles from Wapakoneta. ‘I’ve lived here all my life, y’all,’ said turkey hen Wanda-Mae Cabrera. ‘What was it we were deciding on again? Me an’ my folks before me, we all lived here, yes we did.’ \\nVoting for Thanksgiving means that the turkeys will be able to build a wall from their own faeces to deter any incoming poultry from Kentucky from trying to get into the shed, once they have mastered the intricacies of building a wall from their own faeces. Many also believe that this will make the shed great again, as it hasn’t been great for a long time but definitely used to be. They also said they liked the sound of a new farmer called Donald, who recently grabbed a pussy-cat that raided the shed before it could do any damage. \\nSome turkeys prefer to carry on not celebrating Thanksgiving because the past 244 generations had not and had all gone away to live happily on a farm somewhere else, apparently. ‘One labourer said we will get a right stuffing either way,’ said anti-Thanksgiving turkey DeMarius Jackson, aged 28 weeks. ‘Well, that’s democracy. I imagine.’ \\n‘I ain’t having no goddam American Bronzes sharing my shed, no sirree,’ raged White Holland cock Burl Griffin CCXXVI. ‘Before you know it, they’ll be gobblin’ around your hens, stealin’ your water and sayin’ you can’t worship the Great Spotlight in the Roof no more. I ain’t breedist but have you seen the size of their wattles? I like my shed the way I like it, so I’m for Thanksgiving, sure thing. What is Thanksgiving, anyway?’ Share this story... \\nPosted: Nov 2nd, 2016 by Oxbridge Click for more article by Oxbridge .. More Stories about: World News 0'"}, "time": 1742562297.9106095}