{"duration": 0.06591153144836426, "input_args": {"text": "'NC Trump Supporter Hangs Clinton In Effigy At Rally, Says She Deserves Prison (VIDEO) By Andrew Bradford on October 27, 2016 Subscribe \\nDonald Trump held a rally Wednesday night in the crucial battleground state of North Carolina, and as he spoke, one of his supporters held up a Hillary Clinton doll with a noose around its neck. \\nThe woman who hung the Democratic nominee in effigy said her name was Ginger Glover. Glover said she decided to hang the “Lyin’ Hillary” doll to show that Clinton should be “incarcerated, at the very least.” \\nSo does Glover wish harm on the former Secretary of State? She insisted she didn’t: “It’s just for effect.” \\nOne is left wondering why, if Glover thinks Clinton should be imprisoned, she didn’t dress the doll in an orange jumpsuit or prison stripes. Perhaps she’s simply not bright enough to have thought of doing so. \\nIn recent weeks, various disturbing and violent displays have shown up at Trump rallies: Earlier this week at a rally in Virginia Beach, Trump supporters took a model of Clinton’s head and mounted it on a stake. \\nAlso, at that same rally, reporters saw a poster which depicted a bull’s-eye superimposed over Clinton’s face. \\nIt should also be noted that a frequent chant heard at Trump rallies is the oft-repeated “Lock her up” refrain which was a feature of the GOP convention in Cleveland. Yet the Trump campaign always denies that their supporters are are the least bit violent or seeking confrontations with those who disagree with them. \\nActions speak louder than words, and clearly the Trumpkins are a hate-filled basket of deplorables. \\nFeatured Image Via NBC News Screengrab About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect'"}, "time": 1742628345.4326065}