{"duration": 0.13016724586486816, "input_args": {"text": "'MEXICO CITY  —   Vicente Fox, the former president of Mexico, was recently stuck in Mexico City traffic, overcome with frustration  —   not by the congestion, but by something that was irritating him even more: Donald J. Trump. He grabbed his phone, turned the lens on himself and pressed record. “Ha! Donald,” Mr. Fox said, holding the phone perhaps a little too close to his face. “What about your apologies to Mexico, to Mexicans in the United States, to Mexicans in Mexico?” In short order, the   clip was on Mr. Fox’s Twitter feed  —   another salvo in a personal campaign against the American presidential candidate that has included television appearances, radio interviews and a fusillade of hectoring Twitter posts. Mr. Fox’s voice is among a growing, if uncoordinated, chorus of influential Mexicans worried about what a Trump victory could mean for the complex relationship between the United States and Mexico  —   not to mention the impact Mr. Trump’s presidential bid may have already had. The voices have included at least two former Mexican presidents, top government officials, political analysts, academics, editorial writers and cultural figures. President Enrique Peña Nieto likened the candidate’s language to that of Hitler and Mussolini in an interview with Mexico’s Excelsior newspaper. And he recently shuffled his diplomatic corps in the United States, replacing Mexico’s ambassador to Washington and installing new consuls general around the country, in part to strengthen his administration’s response to the rise of Mr. Trump and what it reflects about American sentiment toward Mexico. While many leaders around the world are worried about how Mr. Trump’s campaign, win or lose, could shape American foreign policy, the concerns are particularly pointed in Mexico and throughout the Mexican diaspora because of the exceptionally close geographic, economic, demographic and cultural ties between the two countries. The two countries are now enjoying one of the more harmonious periods in a turbulent history. But many in Mexico fear that the friendship would rupture should Mr. Trump win the election and follow through on his threats to undo the North American Free Trade Agreement, force Mexico to pay for the construction of a wall between the countries by interrupting remittances and deport the estimated 11 million illegal immigrants in the United States, about half of whom are Mexican. “His threat is cataclysmic, I think, for Mexico,” Enrique Krauze, a Mexican historian and literary magazine editor, said in an interview. “What it would mean for bilateral trade, in social terms, in the tearing of families, in the trauma, the collective panic, the opening of old wounds. ” He added: “I can use one of Trump’s favorite words. Yes, this is huge. It’s a huge danger. ” Mexican critics of Mr. Trump say he has already damaged the image of their country and of the Mexican people with his espousal of views that many regard as xenophobic. At a rally to kick off his campaign in June, the Republican candidate suggested that many Mexican immigrants were drug traffickers and rapists. Mexican officials, concerned about negative impressions of Mexico in the United States, have been rolling out a strategy to improve the image of their country and show how the relationship between the two nations has been of “mutual benefit,” said Paulo Carreño, the newly appointed under secretary for North America in Mexico’s Foreign Ministry. The strategy includes “cultural diplomacy,”   activism and the deployment of Mexican community and business leaders living in the United States, he said. As part of the strategy, the Peña Nieto administration shook up its diplomatic corps in the United States last month: The Mexican ambassador to Washington, Miguel Basáñez Ebergenyi, who had been in the job less than a year, was abruptly replaced by Carlos Sada Solana, a veteran diplomat. In addition, 26 consulates changed leadership. A statement from the Foreign Ministry announcing Mr. Sada’s appointment emphasized his experience “protecting the rights of Mexicans in North America, as well as defending the interests of Mexican abroad. ” In addition, a few   government officials have reacted publicly to Mr. Trump, including Humberto Roque Villanueva, the Interior Ministry’s under secretary for population, migration and migratory affairs. He told the newspaper El Universal this month that the Mexican government was analyzing “how to confront what we would call the Trump emergency. ” “I believe Mr. Trump speaks off the top of his head and doesn’t have a clear idea about financial matters or international accords,” he added. “We live in a globalized world. The United States would have to return to a kind of Middle Ages to prohibit remittances or charge tariffs that aren’t charged in other parts of the world. ” In general, however, the administration has mostly refrained from commenting on the candidate. That has frustrated many Mexicans, who have called on the government to come to the defense of Mexico and push back at Mr. Trump more forcefully. “They can package that in the traditional Mexican nonsense: We don’t interfere in elections,” said Jorge Castañeda, a former foreign minister. “The real reason is that they have no idea what to do, so the default option is to do nothing. ” Instead, most of the Mexican agitation against Mr. Trump has come from the general public. At the beginning of his campaign, many Mexicans viewed Mr. Trump with a mixture of alarm and amusement. But the amusement has mostly fallen away. “Why should we worry?” Mr. Krauze asked, rhetorically. “I couldn’t think of a reason not to worry, no?” In the fall, Mr. Krauze and Carmelo   an emeritus professor of economics and Latin American studies at the University of Pittsburgh, drafted a letter denouncing Mr. Trump’s campaign.   prominent Latinos  —   academics, scientists, writers and filmmakers in the United States, Spain and Latin America  —   signed it. “His hate speech appeals to lower passions like xenophobia, machismo, political intolerance and religious dogmatism,” the letter said. In recent months, Mr. Castañeda has been pushing a   social media campaign with the hashtag #ImProudToBeMexican. Aiming at an American,   audience, he has uploaded videos to Facebook and a campaign website extolling the diversity of the Mexican diaspora and its contributions to the United States. Explaining the American focus of this lobby, he said: “I don’t want to convince Mexicans how nasty Trump is, because everyone knows that. That’s a done deal. ” Mr. Fox’s drumbeat of harangues against Mr. Trump began in February when he declared in a television interview, using a forceful expletive, that Mexicans would not build the candidate’s proposed wall. He escalated from there, chiding Mr. Trump with language that sometimes devolved into schoolyard churlishness. He called the candidate “a false prophet,” “dictator” and “loser. ” He posted a selfie taken against the backdrop of a beach with this message: “Trump, this beautiful Cancun. YOU ARE NOT WELCOME HERE. ” He posted photos from his wife’s birthday party, taunting Mr. Trump: “What do you know about love? Or you just know about hating. How sad!” This month, Mr. Fox expressed contrition for some of his comments in an interview with Breitbart News and apologized to Mr. Trump. But amid blowback from Mexicans on social media and elsewhere who accused him of weakness, he resumed his badgering, posting photos on social media of a   tie made in China and a   jacket made in Mexico  —   evidence, he said, of the candidate’s hypocrisy. Mr. Fox said in a telephone interview from his home in Guanajuato State that he was motivated to attack Mr. Trump by what he called “pure love for that great nation, the United States. ” “I don’t understand why the American public is buying this,” he continued, pain in his voice. “We are partners, we are neighbors, and we should be friends. He’s dividing not only American society, but he’s dividing two nations. “Why does he pick on Mexico?”'"}, "time": 1742561932.587796}