{"duration": 0.10277342796325684, "input_args": {"text": "'In the 1960s and ’70s in Moscow, Nina Brodskaya was a singing star. “I used to sing for the biggest band in Moscow,” said Ms. Brodskaya, who performed with the illustrious Eddie Rosner Jazz Orchestra in the Soviet Union before she moved to the United States in 1980. She made records here with names like “  ” and “Come to USA” but never equaled the renown she had in the Soviet Union. But she still appears regularly in a cramped basement alongside a longstanding group of fellow musicians from Russia and other former   countries who have settled in and around Brighton Beach, the heavily Russian neighborhood in Brooklyn. There is no audience, but Ms. Brodskaya has the joy of jamming with her fellow immigrants as they gather on Tuesday nights below a dentist’s office in Sheepshead Bay, Brooklyn, in a modest room adorned with posters of American and Russian jazz luminaries. The musicians are mostly over 60 and often learned jazz clandestinely and resourcefully in   Russia, where the authorities were suspicious of people interested in American culture, especially cultural traditions that emphasized improvisation and artistic freedom. “They would tell us, ‘Today, you’re playing jazz tomorrow, you’re selling your country,’” recalled Ms. Brodskaya, who was a singer in the band led by Eddie Rosner, a trumpeter and bandleader known as the Polish Louis Armstrong who was imprisoned for years in a Soviet gulag under Stalin. On a recent Tuesday, Ms. Brodskaya rehearsed two numbers with the band that demonstrated its   duality: a jazz standard, “Just in Time,” and a Russian song whose title translates to “Save Love. ” The rehearsals are exhaustive   affairs run under the strict baton of the band’s musical director, Zinovy Pritsker, who instructs the musicians in Russian. But reward comes afterward, when a table is set up in the waiting room of the dentist’s office and a bottle of icy vodka is plunked down, along with a meal of herring, potatoes and Russian delicacies. The group plays mostly   classics from the repertoires of Count Basie, Duke Ellington and others, arranged for the band by Mr. Pritsker, 69. From the back of the room, the band is propelled by its drummer, Dr. Mark Rosen, 71, whose dental office is upstairs and who named the ensemble the Dr. Mark Rosen Big Band. Asked about the name, Mr. Pritsker, a formal man with a dark Russian mood, shrugged and said: “What can I tell you? He has the rehearsal space. ” The band plays the occasional Russian wedding or dance at catering halls in Brighton Beach. Sometimes, Russian musicians visiting New York hear about the band and sit in. But, for the most part, the only outsiders who hear the band are the nighttime dog walkers in the neighborhood who, according to Dr. Rosen, say they love the sound of swinging jazz that seeps out of the basement windows. The group is mainly a rehearsal band that allows players to stay connected to one another and the music they fell in love with as young musicians. It was a time when jazz was seen as the decadent music of the West and suppressed, Dr. Rosen said, recalling his years of living under Communism. The band’s male singer, Lev Pilshik, added: “Jazz was prohibited. If you played it in certain clubs, you might have K. G. B. agents coming and asking about you. ” Despite mostly playing for one another, the band has a rare concert scheduled on Tuesday night in Manhattan, at the Cutting Room on East 32nd Street. It was arranged by Mr. Pritsker’s son, Gene Pritsker, who plays guitar in the big band and is also an accomplished modern classical composer whose works are performed at the Cutting Room. For the concert, Gene Pritsker thought he should come up with a better marketing strategy for a band that is named after a dentist. So for Tuesday’s performance, the band will be rebranded as From Russia With Swing. Even in   New York City, a longstanding big band, much less one of this size, is rare: a   ensemble with five saxophonists, four trombonists, four trumpeters, a   rhythm section and three regular singers. Most of the band members were classically trained at Russian conservatories but had to learn jazz privately, in secret jam sessions or by acquiring recordings through friends or the black market. Some members recalled tuning in to the Voice of America on shortwave radio  —   despite government efforts to jam the signal  —   for the famous jazz broadcasts of Willis Conover, who introduced the music to Eastern bloc countries during the Cold War. “The government didn’t want you listening to the jazz broadcasts, because they felt it was all part of the American propaganda,” said Dr. Rosen, who came to the United States in 1978. One of his patients turned out to be Mr. Pritsker, a saxophonist from Leningrad, who moved to New York the same year and who fell in love with jazz while playing in the Soviet Army band. Today, the basement rehearsal space has become something of a running joke because of the notion that the musicians are playing “underground jazz,” said Dr. Rosen, who started a big band while in medical school, inspired by performances he saw in Leningrad by Duke Ellington and Benny Goodman with their bands. Those concerts were allowed by the government, Dr. Rosen said, as were certain jazz clubs that catered to tourists, government officials and other important citizens whose patriotism was beyond question. Other than that, jazz performances were suspect. “We were afraid, but we did it,” Dr. Rosen recalled. “Sometimes the K. G. B. might call you and ask if you’re playing jazz with a certain musician and ask you to watch them. ” Mr. Pritsker said a friend had given him scratchy    tapes of bebop recorded from radio broadcasts that stoked his desire to become a jazzman. But to make money after he moved to New York, he became a piano tuner, if a notoriously temperamental one. He and Dr. Rosen placed advertisements in local Russian newspapers for musicians and formed the band in 1997. Many of the musicians who responded had played for the best Russian jazz bands but were busking or working modest day jobs in New York. Lev Barsevov, who plays trumpet, was a   driver another trumpeter, Aaron Gerskovitch, was a kosher butcher. A saxophone player, Veniamin Popov, worked as a circus clown, which he proved on a recent Tuesday night by contorting his legs above his head while sitting down  —   even before the vodka was brought out. Russian immigrants playing American music can result in many   moments, and one occurred when the band began hotly debating in Russian the way the English lyrics to “New York, New York” should be delivered. After a few false starts, Mr. Pritsker shook his head and said in his thickly accented English, “I hope in concert, we don’t have this problem. ”'"}, "time": 1742562035.3202631}