{"duration": 0.07569766044616699, "input_args": {"text": "'You Are Here: Home » Anxiety » Study Finds Ocean Views are Linked to Better Mental Health Study Finds Ocean Views are Linked to Better Mental Health Prev post Page 1 of 3 Next \\nDo you currently live in a home with a view of the ocean? Can you hear the waves rolling in and smell the salt air as you have dinner on the balcony? If so, the rest of us envy you. As it turns out that perfect home with an ocean view could have even more benefits than the obvious. It could be beneficial to your mental health. \\nA recent study has shown that living in a home with a view of the ocean could have significant benefits of reducing stress and improving overall mental health. That’s right; as if that perfect beach home you dream of wasn’t perfect enough already, it could even help your sanity. \\n“Increased views of blue space is significantly associated with lower levels of psychological distress,” says one of the authors of the study. \\nThe research study was performed by a group at Michigan State University and found some relatively surprising results. It was co-authored by Amber L. Pearson , an assistant professor at the university whose main focus is social justice and understanding the “unexpected tenacity, adaptability and resilience of the underprivileged.” \\nHer area of focus may seem surprising enough, considering the fact that ocean views are normally only affordable to the very upper-class. However, that was part of the point of the investigation. Professor Pearson seeks to understand the aspects of the built, physical and social environment that bolster health in the face of adversity. She has worked specifically in the realm of water research and to understand the intersection of spatial and social dimensions of health as they relate to water access. \\n“We live in increasingly urbanized areas which limit our exposure to natural spaces and this could lead to more depression and mental health issues – one of the top causes of disease worldwide – so identifying factors within cities which relate to positive mental health is important,” says Professor Pearson. Prev post Page 1 of 3 Next Leave a Reply Your email address will not be published. Comment Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name GMO apples may be deregulated by the end of 2013 \\nBy: Laura Sesana Genetically modified (GM) crops have been part of the U.S. food supply for several years. However, only one type of GM fruit, the Hawaiian papaya (Rainbow and SunUp), has been available to U.S. consumers. This may change by the end of 2013. If approved, two varieties of apple, Arctic® Granny Smith and […] World’s oldest yoga teacher spills secrets of youth and healing \\nby Raw Michelle – Natural News Tao Porchon-Lynch can balance all of her weight on her forearms, lifting her entire body up and parallel to the floor without the need for support from her legs. She also engages in competitive dancing, cutting a rug with dancing partners half her age. The big deal? She’s 95! Clearly, Porchon-Lynch […] Permaculture Gurus Share Secrets of Dramatic Land Transformations \\nTraci Knight – Staff Writer Permaculture is a movement whereby permanent agriculture is incorporated into personal landscapes through careful designs that mimic patterns in nature. A minimalist approach to land management is adopted, after the implementation of careful planning – usually with mass plantings of fruit and nut trees where land and space allow. The […] Attachment And Separation: What Everyone Should Know \\nby Dr. Peter Cook – The Natural Child Project Many human troubles would be lessened if the emotional needs of infants and young children were better understood in our society. This applies particularly to attachment needs and the effects of separating infants from their parents. Can you imagine how you might feel if you were happily […] Are You An Emotional Empath? \\nTo determine whether you’re an emotional empath, take the following quiz. by Judith Orloff Adapted from Dr. Judith Orloff’s New York Times Bestseller, “Emotional Freedom: Liberate Yourself From Negative Emotions and Transform Your Life” (Three Rivers Press, 2011) Empaths are highly sensitive, finely tuned instruments when it comes to emotions. They feel everything, sometimes to an extreme, and […] Scientific Health Benefits of Meditation \\nby Giovani – Liveanddare.com We all have heard that “meditation is good for you”. But good in what terms? Is that just reports from people doing it for 10 years, or are there good scientific studies showing specific benefits that I care about? In this massive article I have summarized several scientific discoveries on the […] Silymarin: Healing benefits of Milk Thistle \\nMilk Thistle (Silymarin) is an herbaceous annual or biennial plant with a dense prickly flower head that has purplish tubular flowers. It is an edible plant native to southern Europe, southern Russia, Asia Minor, and northern Africa, and has been used for food in the countries surrounding the Mediterranean for a long time as well […] True Horror Stories of Cosmetics Dangers \\nPeople will go to great lengths to be “beautiful,” and cosmetics companies know it. What consumers may not know is that they have long risked death and disfigurement for the sake of beauty… by Tina Sigurdson | www.ewg.org In 1933, a woman was hospitalized with excruciating eye pain. Doctors watched in horror as her eyes were […] New Study Shows Monsanto’s Roundup Inhibits Body’s Natural Detoxification \\nGlyphosate, found in Monsanto’s Roundup, is being deemed deadly by publishers of the new study “one of the most dangerous chemicals” being unleashed into the environment today. The modern age of industrial agriculture and manufacturing has dumped heavy metals, carninogens, plastics, and pesticides into the environment at alarming rates. These toxins are showing up in […] Inulin: The Health Benefits \\nInulin, also known as a polysaccharide, is a soluble fibre classed as a fructan. Fructans are chains of fructose indigestible by our body, but loved by the good bacteria in our gut flora. Since our body cannot digest the fructans, inulin has very little impact on blood sugar and unlike other sugars is not insulemic. […] FDA Approved Prescription Drugs Kill Hundreds of Thousands of People Annually \\nBy Matt Hall — Staff Writer What if I told you hundreds of thousands of people died every single year from drugs? You wouldn’t be surprised. You’d probably think, “Well, they overdosed, or they abused them to get high, or they experimented in a dangerous way and got what was coming to them.” (Yep, we’ve […] Turmeric Strikes at ‘Root Cause’ of Cancerous Tumor Development \\nTurmeric effective at fighting cancer tumor development? by Elizabeth Renter – Natural Society Turmeric is known for a wide range of benefits, one of the most promising being it’s potential uses in the prevention and treatment of cancer. A new study published in the journal Cancer Letters has taken a new look at the active anti-cancer […] 10 great ways to detoxify your body \\nby Deborahann Smith – Gaiam Life Feeling sluggish or out of sync? Having skin problems, aches and pains, or digestive problems? Straying from your healthier habits lately? Having trouble kicking off your weight loss? It might be time for a body detox. Practiced for centuries by many cultures around the world — including ayurvedic and Chinese […] The Healing Power of Tea Tree Oil \\nTea tree oil is a wonderful, useful, and effective product. No other essential oil on the market can quite live up to tea tree oil. Even if you are not an essential oil expert or a fanatic about aromatherapy, you can make good use of this oil. Tea tree oil has been used around the […] Join For Free! Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name '"}, "time": 1742628438.5210211}