{"duration": 0.15293383598327637, "input_args": {"text": "\"Hacksaw Ridge: Steadfast Love Amidst the Horrors of War Written by Michael E. Telzrow Email \\nMel Gibson's directorial comeback effort, Hacksaw Ridge , plays fast and loose with the facts — but by no means all of the facts — surrounding the wartime exploits of conscientious objector, and devout Seventh Day Adventist, Desmond Doss. While Gibson's story can be faulted for taking some major liberties with Doss' life, in particular the portrayal of his father as a bitter, abusive WWI veteran, as well as the facts surrounding the Army's effort to discharge Doss for refusing to carry a rifle, it hits the mark in its portrayal of Doss' love of God and his fellow man. In some ways, this is not a war movie, but rather a love story with the Sixth Commandment as the guiding principle of Doss' convictions. \\nAndrew Garfield plays Doss close to perfection. His portrayal of the humble Virginian captures Doss' love for his beloved wife Dorothy, played by Teresa Palmer, and his unshakeable resolve to never take a human life. The latter of which lands Doss in hot water with military authorities and his fellow soldiers of the 77th Infantry Division. Although threatened with court-martial, and subject to discharge on psychological grounds, Garfield was successful in convincing a reluctant battalion commander to let him stay in the army as a company aid man. Therefore, the dramatic court-martial scene in movie never actually occurred. \\nGarfield conveys a carefully nuanced blend of humility and genuine charity for his fellow soldiers without coming off as false, or weak. Although a pacifist, there was nothing cowardly or impotent about Doss. He clearly found strength in his beliefs and in the Bible, and Garfield effectively portrays the depth of Doss' religious beliefs with respect and believability. \\nThe battle scenes, although embellished and fictionalized to some extent, are typical of Gibson's approach. Slow-motion close ups, and the liberal use of blood and gore, although verging on the cartoonish, accurately portray the ferocity of the war in the Pacific, and the type of warfare that characterized the last days of the Japanese Empire. One inaccuracy, however, cannot be ignored. Gibson implies that the men of Doss' regiment and division were not battle tested by the time they arrived at the terrible battle for Okinawa. The scene unfolds with what appears to be a wide-eyed and untested 77th Division watching remnants of the 96th Division moving to the rear after a hard fight for the Maeda Escarpment (Hacksaw Ridge). In reality, Doss and the men of the 307th Regiment, 77th Division had already seen significant action at Guam and Leyte Gulf. In fact, Doss had already demonstrated his propensity to put other lives above his own by repeatedly rescuing men from the front, while under fire. For his efforts at Guam and Leyte Gulf, he was awarded the Bronze Star with Oak Leaf Cluster. So, by the time he reached Okinawa, Doss had already won the respect of his formerly resentful comrades. \\nGibson's portrayal of the battle for the Maeda Escarpment contains a series of embellishments, some more puzzling than others. In one instance, he curiously fictionalized Doss' wounding, messes with the timeline, and leaves out a poignant moment where Doss vacates his place on a stretcher for a more critically wounded soldier. In that one act, Doss' true love for his fellow man is illustrated with clarity and strength. One has to wonder why Gibson omitted such a powerful event. Other embellishments and inaccuracies are hardly worth mentioning, largely because they do not detract from the message of the film. The portrayal of Doss going from wounded man to wounded man, and lowering them down the face of the escarpment is the stuff of movies — but in this case it actually happened! Garfield plays the part effectively, and Gibson's dark palette of the blood stained battlefield adds to the tension. Although Doss' exploits are courageous, there is no glorification of the killing of hundreds of men on the escarpment. \\nThe cinematic portrayal of Doss' comrades is fairly typical. We see the usual suspects — rough kids from the metropolitan areas of the eastern seaboard, a few oddballs, and the humble recruit thrown together in the barracks. In this case there is some truth to the old stereotype. Doss did experience some serious hazing from a small group of soldiers who resented his adherence to Seventh Day Adventist doctrine and his pacifist convictions. But, he also had friends who accepted his desire to serve as a company aid man. In general, despite some rather bizarre characterizations, Gibson treats the soldiers with respect. This is never more apparent than in the battle scenes where we see soldiers laying their lives down for one another. \\nUltimately, Gibson has created both a love story, and a film that shows the brutal realities of the saddest activity that man may engage in. The juxtaposition of Doss' pure and steadfast love and his Christian convictions stands in stark contrast to the brutality and anarchy of the battlefield. In the end, perhaps Gibson has given us an anti-war love story that illustrates the strength of Christian conviction. \\nRelated article: \\nDesmond Doss: His Only Weapon Was His Conscience  \""}, "time": 1742561802.602797}