{"duration": 0.01591658592224121, "input_args": {"text": "'0 comments Attorney General Loretta Lynch has admitted she is guilty by pleading the 5th and Congress is slamming her for it! \\nObama sneaks $1.7 Billion in cash to Iran, who wants to destroy us, and they can’t understand why someone might question that insanity. \\nYou ONLY plead the 5th if you COULD INCRIMINATE yourself. Thanks Loretta for admitting guilt! \\nNewsmax reports : \\nAttorney General Loretta Lynch is declining to comply with a probe into the Obama administration’s secret efforts to send Iran $1.7 billion in cash earlier this year to avoid incriminating herself, according to The Washington Free Beacon. \\nFlorida Sen. Marco Rubio and Kansas Rep. Mike Pompeo wrote in a letter that Lynch chose to “essentially plead the Fifth,” after the Republican lawmakers presented her with questions about the cash payment! \\nAttorney General Loretta Lynch is declining to comply with a probe into the Obama administration’s secret efforts to send Iran $1.7 billion in cash earlier this year to avoid incriminating herself, according to The Washington Free Beacon. \\nFlorida Sen. Marco Rubio and Kansas Rep. Mike Pompeo wrote in a letter that Lynch chose to “essentially plead the Fifth,” after the Republican lawmakers presented her with questions about the cash payment. \\nIt is high time the the entire Obama corruption scheme of the last 8 years comes toppling down. We know how the left works and revelations this year from WikiLeaks and Project Veritas have confirmed exactly how horrific it all is. \\nTHEY LIE! \\nThey lie, cheat, steal, deceive! They make real bad decisions! \\nSerious…. IRAN SAYS THEY WANT TO DESTROY US! Why are we sending them CASH??? $1.7 Billion dollars in CASH!!! THAT IS INSANITY!! \\nI think we need to make a law that elected officials cannot plead the 5th. Loretta needs to answer questions NOW! \\nWE THE PEOPLE are the masters and our public servants are the servants.'"}, "time": 1742628485.890302}