{"duration": 0.0597989559173584, "input_args": {"text": "'Arctic Warming Gives U.S. and Europe the Chills   \\nBy Tim Radford / Climate News Network A cold New York winter. Research shows there could be much worse to come. (Gregory Tran via Flickr) \\nLONDON—Warming in the Arctic—one of the fastest-warming regions on the planet—could be heightening the chances of extreme winters in Europe and the US. As the Arctic warms, the stratospheric jet stream that brings occasionally catastrophic ice storms and record snow falls to the eastern United States could also be on the move, according to new research in the journal Nature Climate Change . The phenomenon is a natural one. Some years the track of the jet stream is wavy, and delivers severe cold weather to the mid-latitudes of the northern hemisphere. Some years the pattern alters, and Europe in particular experiences mild winters. The temperate zones have always experienced occasional extremes. But climate change could be tilting the balance. Extreme spells “We’ve always had years with wavy and not so wavy jet-stream winds, but in the last one or two decades the warming Arctic could well have been amplifying the effects of the wavy patterns. “This may have contributed to some recent extreme cold winter spells along the eastern seaboard of the United States, in western Asia and at times over the UK,” says Edward Hanna , a geographer at the University of Sheffield, UK, and one of a team of British, European and US scientists behind the study. “Improving our ability to predict how climate change is affecting the jet stream will help improve our long-term prediction of winter weather” The study doesn’t claim to settle the question: notoriously, climate is what you expect but weather is what you get, and it may be impossible to prove that this or that unexpected event happened because the global average temperatures are now at least 1°C higher than they used to be, before the human combustion of fossil fuels began to increase the concentration of the greenhouse gas carbon dioxide in the atmosphere from 280 parts per million to 400 ppm. But there are changes in the Arctic that are happening because of global warming, and meteorologists have been watching the knock-on effect on the stratospheric winds, especially the jet stream. In the same issue of the journal one group identified a persistent shift and a weakening in the Arctic winter polar vortex , a meteorological monster that plays a role in temperate zone weather patterns. Others identified a link between Arctic changes and the speed of the jet stream, and its effect on transatlantic airline timetables . Yet others have linked Arctic warming to dangerous extremes of heat further south , and yet another group has linked polar climate change to both ice storms and heatwaves . Arctic signals The debate continues. The important thing is to monitor the melting sea ice, the rising sea-surface temperatures and the emerging pattern of severe winter weather. If meteorologists can learn to read the signals from the Arctic, then communities could plan more effectively for the consequences. “Improving our ability to predict how climate change is affecting the jet stream will help improve our long-term prediction of winter weather in some of the most highly populated regions of the world,” Professor Hanna says. “This would be highly beneficial for communities, businesses and entire economies in the northern hemisphere. “The public could better prepare for severe winter weather and have access to extra crucial information that could help make life-saving and cost-saving decisions.” \\nTim Radford, a founding editor of Climate News Network, worked for The Guardian for 32 years, for most of that time as science editor. He has been covering climate change since 1988. \\nAdvertisement'"}, "time": 1742563296.308728}