{"duration": 0.16390132904052734, "input_args": {"text": "'ANTWERP, BELGIUM  —   For architects, or at least for Zaha Hadid, there is an afterlife. On Sept. 22, nearly six months after this British architect’s sudden death at 65, one of her boldest buildings, Port House, opened in a ceremony on the newly christened Zaha Hadid Square in Antwerp. Under the soaring prow of a dynamically angled    structure drifting like an airship over a palatial brick firehouse, a chorus and orchestra performed the “Ode to Joy” from Beethoven’s Ninth Symphony. The score and backdrop amounted to a curtain rising on the second act of Ms. Hadid’s career, as operatic as any since Frank Lloyd Wright’s. Ms. Hadid’s   moment signaled, with the recent opening of another building in Italy, the start of a posthumous career that promises to deliver nearly 50 more structures  —   as many buildings as were created in her lifetime. Ms. Hadid’s professional journey started late but gathered momentum, culminating with 36 projects under construction or in final drawings, and others in the pipeline. Her business partner, Patrik Schumacher, now principal of the firm, estimates it will roll out in 26 countries over the next decade. Zaha Hadid Architects will retain its name even as it evolves under his direction, “but always with Zaha’s DNA,” he said. At the opening ceremony, Marc Van Peel, president of the Port of Antwerp, called the faceted structure, its facade erupting in a stormy field of reflective triangles, a “diamond ship,” referring both to the city’s famous diamond trade and to the building’s site overlooking the sprawling port. Even taxi drivers had strong opinions: “I like it because it’s by a woman and because I like science fiction,” one said. “It’s magic. ” Starchitects don’t usually enter open competitions with such   odds. But in 2008, Ms. Hadid signed up with a hundred other architects to vie for the chance to adapt and expand a     fire station into an office building for the 500 employees who run the port’s operations. Rotterdam, just across the Scheldt River, is Europe’s largest port. Brussels, the capital, is the repository of Belgium’s and the European Union’s grandest public buildings. Antwerp tries harder. Before completion of Ms. Hadid’s   $62 million design, when officials introduced foreign delegations to a port updated with the largest berths, deepest channels and latest technologies, they had to do so from a scrum of offices overlooking a vestigial harbor serving pleasure boats. According to the project architect Joris Pauwels,“They wanted their headquarters in a building that represents their     port. ” Urban planners also wanted to stake a goal post for the growth of Antwerp’s residential district. “They wanted a statement piece of architecture that would pivot the north edge of the growing city to the southern edge of the expanding port,” said Mr. Pauwels, a Belgian who works in Ms. Hadid’s London office but hails from the Antwerp area. Ms. Hadid did her homework for the competition. Because the existing building, a copy of a   Hanseatic structure, had historic designation, she hired a heritage consultant who advised that a spire originally designed for the firehouse, but never built, anticipated and justified an “accent” piece atop the   base. Mr. Schumacher recalled that when Ms. Hadid saw a map and images of the site, she said its sheer scale  —   the Port of Antwerp is 10 times larger than the city itself  —   called for a signature piece “that would own the port but address the city,” he said. “Anything less would disappear. ” Mr. Pauwels recalled: “The importance to Zaha was the layering, setting a new structure over the old one” that would both read at a distance and liberate ground for public space. And Patrik wanted the new structure to overshoot the fire station and land on a single point. ” Ms. Hadid and Mr. Schumacher reviewed and changed numerous options developed mainly by Mr. Pauwels, based on the initial concept. From the beginning of her career, Ms. Hadid lofted her buildings, defying gravity: Air has been her design habitat. The architects perched the      volume of new offices on a leaning, sculpted column housing a fire escape that meets the ground like a Louboutin heel, and on an elevator core rising up from the original courtyard. A tall space between old and new buildings is a promenade deck for viewing and receptions. Inside the addition, all floors are   offices with rows of desks arranged on the bias the triangulated walls offer circumferential views of the city and the vast Scheldt estuary. In the brick firehouse, the architects stripped decades of accretions down to a shell that they restored inside and out their new glass roof transformed the courtyard into a reception area (now used to exhibit Ms. Hadid’s work). What provoked the “wows” often heard on Zaha Hadid Square is that the architects threw the hovering volume off balance, first by planting the addition   to maximize light into the courtyard, and then by bending and stretching its shape, as though driven and distorted by invisible forces. The whole volume lists like a ship under sail, capturing the movement of a boat that, counterintuitively, looks as though it’s suspended in dry dock. Halfway down, the flat planes of the leaning sidewalls crack into a tessellated field of triangles that reflect light, activating the surfaces and dynamizing the shape. Edges are cut and beveled, sometimes for views, sometimes for interior stairways. At night, the whole structure resembles a huge suspended urban lantern competing with the moon. Like all of Ms. Hadid’s projects, especially in recent years, the design was produced by a firm that she structured, Mr. Schumacher said, “to encourage the survival of the best idea  —   an office that could think for itself. ” Despite the popular perception of Ms. Hadid as a   design force, even a diva, she ran an open office where, according to Mr. Pauwels, ideas flowed democratically rather than hierarchically. Within the general principles she had broadly developed during 35 years of practice, Ms. Hadid, Mr. Schumacher and other architects, both senior and junior, brainstormed ideas together, and the younger design architects would then develop proposals that would lead to further sketches. “There was no recipe for design,” Mr. Pauwels said “She wanted to push boundaries. ” Ms. Hadid and Mr. Schumacher made the final decision together. He said that she had offered to share the masthead with him before she died, but he declined: “It was better to keep the focus on Zaha, and to avoid diluting our identity if there were eventually other partners’ names to add. ” If little has changed in the design process, the office that she had run for years as an informal, very personal atelier is more structured. Over the last dozen years, it grew to 400 from 40. “We couldn’t have hundreds of people on a zero hierarchy,” Mr. Schumacher said. “We restructured, organizing clusters under collegial leadership” and adding mechanisms to handle financial accountability. He noted that despite aggressive head hunting by some of London’s most prominent firms, no one had left. He is now the principal owner of Zaha Hadid Architects, though he said the details of the ownership were still to be determined. Since Ms. Hadid’s death, the office has received several major commissions, among them a   central business district in Prague with nearly a million square feet of offices and retail, and the Sberbank Technopark headquarters in Moscow, said to be Russia’s answer to Silicon Valley. Several   and a vast airport in Beijing are under construction. “Due to scale, we are looking for new drivers to give character and identity to buildings, new structural and environmental logics that will give buildings a new physiognomy,” Mr. Schumacher said. Clarifying how the Hadid DNA would endure even at a vastly larger, technologically driven scale that normally homogenizes design, he continued: “We want to bring technical ideas into an expressive area. Zaha believed in research, and of course, our interests in research will change. We’ve looked at shells in Saudi Arabia, tensile structures in London, new ideas for skeletons in Miami, New York and Chicago, and we’re looking at the mega atriums that Atlanta architect John Portman built into his hotels. ” There are headwinds. Though Mr. Schumacher has strongly stated that he favors “Brexit,” to liberate British offices from the European Union’s regulatory environment, the   office will possibly lose access to competitions required by the European Union for large public projects. “‘Brexit’ could impact us,” he said. “It might exclude us. ” Then there is the issue of profits: “So far we have made profits only on a minority of projects, and often pay for the last project with the new project,” he said. “You can do that if you’re stable or growing, and we’re growing, but shrinking is a problem. We’re not allowed to shrink. ” There remains one potential issue of Zaha Hadid Architects without Zaha Hadid: Will the firm have the magnetic power to draw prestigious institutional and cultural clients without its charismatic leader? “For a long time, we’ve had a very distributed leadership and collective design process, so that won’t change,” Mr. Schumacher said. “But I’m not so well known in the project world of clients, and the question is, Will I have the credibility to attract commissions of cultural significance? For me, without Zaha, that will be the challenge. ”'"}, "time": 1742563575.87767}