{"duration": 0.18680286407470703, "input_args": {"text": "'Donald J. Trump had barely met Rowanne Brewer Lane when he asked her to change out of her clothes. Ms. Brewer Lane, at the time a    model, did as Mr. Trump asked. “I went into the bathroom and tried one on,” she recalled. It was a bikini. “I came out, and he said, ‘Wow.’ ” Mr. Trump, then 44 and in the midst of his first divorce, decided to show her off to the crowd at    his estate in Palm Beach, Fla. “He brought me out to the pool and said, ‘That is a stunning Trump girl, isn’t it?’ ” Ms. Brewer Lane said. Donald Trump and women: The words evoke a familiar cascade of casual insults, hurled from the safe distance of a Twitter account, a radio show or a campaign podium. This is the public treatment of some women by Mr. Trump, the presumptive Republican nominee for president: degrading, impersonal, performed. “That must be a pretty picture, you dropping to your knees,” he told a female contestant on “The Celebrity Apprentice. ” Rosie O’Donnell, he said, had a “fat, ugly face. ” A lawyer who needed to pump milk for a newborn? “Disgusting,” he said. But the 1990 episode at    that Ms. Brewer Lane described was different: a debasing    encounter between Mr. Trump and a young woman he hardly knew. This is the private treatment of some women by Mr. Trump, the   and more intimate encounters. The New York Times interviewed dozens of women who had worked with or for Mr. Trump over the past four decades, in the worlds of real estate, modeling and pageants women who had dated him or interacted with him socially and women and men who had closely observed his conduct since his adolescence. In all, more than 50 interviews were conducted over the course of six weeks. Their accounts  —   many relayed here in their own words  —   reveal unwelcome romantic advances, unending commentary on the female form, a shrewd reliance on ambitious women, and unsettling workplace conduct, according to the interviews, as well as court records and written recollections. The interactions occurred in his offices at Trump Tower, at his homes, at construction sites and backstage at beauty pageants. They appeared to be fleeting, unimportant moments to him, but they left lasting impressions on the women who experienced them. What emerges from the interviews is a complex, at times contradictory portrait of a wealthy,   and provocative man and the women around him, one that defies simple categorization. Some women found him gracious and encouraging. He promoted several to the loftiest heights of his company, a daring move for a major real estate developer at the time. He simultaneously nurtured women’s careers and mocked their physical appearance. “You like your candy,” he told an overweight female executive who oversaw the construction of his headquarters in Midtown Manhattan. He could be lewd one moment and gentlemanly the next. In an interview, Mr. Trump described himself as a champion of women, someone who took pride in hiring them and was in awe of their work ethic. “It would just seem,” he said, “that there was something that they want to really prove. ” Pressed on the women’s claims, Mr. Trump disputed many of the details, such as asking Ms. Brewer Lane to put on a swimsuit. “A lot of things get made up over the years,” he said. “I have always treated women with great respect. And women will tell you that. ” But in many cases there was an unmistakable dynamic at play: Mr. Trump had the power, and the women did not. He had celebrity. He had wealth. He had connections. Even after he had behaved crudely toward them, some of the women sought his assistance with their careers or remained by his side. For Ms. Brewer Lane, her introduction to Mr. Trump at    was the start of a whirlwind romance  —   a heady blur of helicopter rides and   hotel rooms and flashing cameras. “It was intimidating,” she said. “He was Donald Trump, obviously. ” It started at the New York Military Academy, a small, severe boarding school 90 minutes’ drive north of New York City. Strictly enforced rules prohibited girls from setting foot on the   campus unless it was a special occasion. And on those special occasions, young Donald Trump paid careful mind to the kind of girls he brought to school. They had to be gorgeous  —   10s, in his future parlance. “Donald was extremely sensitive to whether or not the women he invited to campus were pretty,” recalled George White, a fellow student in the class of 1964. “For Donald,” he added, “it’s display. ” He steadily built an image as a young playboy amid the deprivations of a   military school, where most boys craved but rarely enjoyed the company of a girl. By senior year, his classmates had crowned him “ladies’ man” in the yearbook, a nod to the volume of his dates. Asked how he had earned the “ladies’ man” title, Mr. Trump at first demurred. “I better not tell you  —   I’ll get myself in trouble,” he said. He later elaborated, saying he had “a great feeling” and “a great like” for women. Mr. Trump grew up with an influential role model for how to deal with women: Fred C. Trump, his powerful and unyielding father. The elder Mr. Trump exerted control no matter how big or small the decision, as Ivana Zelnickova learned over dinner one night in the late 1970s. Her boyfriend, Donald Trump, had invited her to join his siblings and parents at Tavern on the Green, the ornate restaurant in Central Park. When the waiter came to take orders, Ivana made the mistake of asking for what she wanted. Fred Trump set her straight, she recalled in a previously unpublished interview with Michael D’Antonio, the author of “The Truth About Trump. ” Mr. Trump defended his father’s conduct. “He would’ve said that out of love,” he said. If his father had overruled her fish order, Mr. Trump said, “he would have said that only on the basis that he thought, ‘That would be better for her.’ ” The elder Mr. Trump did not hide his more traditional views on gender. When his son hired a woman, Barbara A. Res, as his head of construction in the 1980s, Fred Trump was mystified and annoyed. Mr. Trump said it was a different era. “My father,” he said, “probably never would have seen a woman in that position. ” Mr. Trump still holds up his parents as models, praising his    mother for understanding and accommodating a husband who worked almost nonstop. “My mother was always fine with it,” he said, recalling her “brilliant” management of the situation. “If something got interrupted because he was going to inspect a housing site or something, she would handle that so beautifully. ” “She was an ideal woman,” he said. With his purchase of the Miss Universe Organization, Mr. Trump was now in the business of young, beautiful women. They craved his advice and approval, a fact he seemed to understand well. Temple Taggart, the    Miss Utah, was startled by how forward he was with young contestants like her in 1997, his first year as the owner of Miss USA, a branch of the beauty pageant organization. As she recalls it, he introduced himself in an unusually intimate manner. Mr. Trump disputes this, saying he is reluctant to kiss strangers on the lips. But Ms. Taggart said it was not an isolated incident. At the gala celebration after the show, she said, Mr. Trump immediately zeroed in on her, telling her how much he liked her style and inviting her to visit him in New York to talk about her future. Soon enough, she said, he delivered another unwelcome kiss on her lips, this time in Trump Tower. After boasting of his connections to elite modeling agencies, he advised her to lie about her age to get ahead in the industry, she said. “ ‘We’re going to have to tell them you’re 17,’ ” Ms. Taggart recalled him telling her, “because in his mind, 21 is too old. I was like, ‘No, we’re not going to do that.’ ” His level of involvement in the pageants was unexpected, and his judgments, the contestants said, could be harsh. Carrie Prejean, who was 21 when she participated in the Miss USA contest in 2009 as Miss California, was surprised to find Mr. Trump personally evaluating the women at rehearsal. “We were told to put on our opening number outfits  —   they were nearly as revealing as our swimsuits  —   and line up for him onstage,” she wrote in her memoir, “Still Standing. ” Mr. Trump, in an interview, said he would “never do that. ” Such behavior, he said, would bruise egos and hurt feelings. “I wouldn’t hurt people,” he said. “That’s hurtful to people. ” Mr. Trump was not just fixated on the appearance of the women around him. He possessed an almost compulsive need to talk about it. Inside the Trump Organization, the company that manages his various businesses, he occasionally interrupted routine discussions of business to opine on women’s figures. Ms. Res, his construction executive, remembered a meeting in which she and Mr. Trump interviewed an architect for a project in the Los Angeles area. Out of the blue, she said, Mr. Trump evaluated the fitness of women in Marina del Rey, Calif. “They take care of their asses,” he said. “The architect and I didn’t know where he was coming from,” Ms. Res said. Years later, after she had gained a significant amount of weight, Ms. Res endured a stinging workplace observation about her own body from Mr. Trump. “ ‘You like your candy,’ ” she recalled him telling her. “It was him reminding me that I was overweight. ” Her colleague Louise Sunshine experienced similar observations from Mr. Trump when she gained weight. But she saw it as friendly encouragement, not a cruel insult. “He thought I looked much better thin,” she said. “He would remind me of how beautiful I was. ” Whenever possible, Mr. Trump wanted his visitors to see his most attractive employees, as Ms. Res learned. Mr. Trump frequently sought assurances  —   at times from strangers  —   that the women in his life were beautiful. During the 1997 Miss Teen USA pageant, he sat in the audience as his teenage daughter, Ivanka, helped to host the event from onstage. He turned to Brook Antoinette Mahealani Lee, Miss Universe at the time, and asked for her opinion of his daughter’s body. “ ‘Don’t you think my daughter’s hot? She’s hot, right?’ ” Ms. Lee recalled him saying. ‘I was like, ‘Really?’ That’s just weird. She was 16. That’s creepy. ” Ms. Brewer Lane, who dated Mr. Trump for several months in 1990 and early 1991, said it did not take long for him to solicit her view on the attractiveness of two of his previous romantic partners, Marla Maples and Ivana Trump. Mr. Trump said he did not know Ms. Brewer Lane very well, despite dating her. “I wouldn’t have asked anybody about how they rate other women,” he said. He liked to brag about his sexual prowess and his desirability as a date, no matter who was around. Barbara J. Fife, a deputy mayor under David N. Dinkins, New York’s mayor in the early 1990s, was not especially close to Mr. Trump. But that did not stop him from telling her why he was in such a hurry one day as he sat in her office at City Hall. “I have this great date tonight with a model for Victoria’s Secret,” Ms. Fife recalled him telling her. “I saw it as immature, quite honestly,” she said. At his office in Trump Tower, Mr. Trump seemed eager for his colleagues to hear about his new companion, Ms. Maples. When The New York Post feasted on her supposed satisfaction with him in bed, captured in the headline “Best Sex I’ve Ever Had,” Mr. Trump was unabashed, Ms. Res said. Mr. Trump denies boasting about the headline. He seems more bashful these days, saying he cannot recall how many women he has dated. “Not as many as people would think,” he said. “I’m not somebody that really loved the dating process. ” To build his business, Mr. Trump turned to women for a simple reason: They worked hard  —   often harder than men, he told them. When Mr. Trump hired Ms. Res to oversee the construction of Trump Tower, he invited her to his apartment on Fifth Avenue and explained that he wanted her to be his “Donna Trump” on the project, she said. Few women had reached such stature in the industry. He entrusted several women in his company with enormous responsibility  —   once they had proven themselves worthy and loyal. Ms. Sunshine had little experience in real estate, but as a top campaign   for Gov. Hugh Carey of New York, she had fulfilled a lifelong wish for Mr. Trump: She secured him a vanity license plate with his initials, DJT, which adorned his limousine for years. Ms. Sunshine worked for Mr. Trump for 15 years, becoming a major New York real estate figure in her own right. Ms. Res remained at the company for 12 years, left after a disagreement over a project and then returned as a consultant for six more years. Both expressed gratitude for the chances Mr. Trump had taken on them. In a    industry thoroughly dominated by men, Mr. Trump’s office stood out for its diversity, recalled Alan Lapidus, an influential architect who designed the Trump Plaza casino in Atlantic City. To women who had climbed to positions of power outside his company, Mr. Trump’s behavior could feel like a jarring throwback. Alair A. Townsend was for a time the   woman inside New York’s City Hall during the Koch administration, with the title of deputy mayor for economic development. But when Mr. Trump called her, she said, her position seemed less relevant to him than her gender. It was an unthinking habit when he interacted with women, colleagues said. “At Trump Tower,” said Ms. Res, his longtime colleague, “he called me Honey Bunch. ” No single figure better encapsulated the paradoxes of Mr. Trump’s treatment of women in the workplace than his first wife, Ivana. He entrusted her with major pieces of a corporate empire and gave her the titles to match. She was the president of Trump’s Castle, a major casino in Atlantic City, and the Plaza Hotel, the storied complex on Central Park South in Manhattan. “She ran that hotel,” Ms. Res said. “And she ran it well. ” But he compensated her as a spouse, not a   employee, paying her an annual salary of $1 for the Trump’s Castle job, according to her tax documents. And he grew to resent her outsize role. By the end of their marriage, Mr. Trump wrote in his 1997 book, “The Art of the Comeback,” he regretted having allowed her to run his businesses. He seems to have kept his word. His current wife, Melania, has marketed her own lines of beauty products and jewelry. But Mr. Trump remains mostly uninvolved in her work. After calling it “very successful,” he struggled to describe it. “What is it on television with the sales?” he asked. “What do they call that? Not Home Shopping, the other one. ” Once his first marriage started to collapse, Mr. Trump faced his most serious allegations of aggression toward women. When “Lost Tycoon: The Many Lives of Donald J. Trump,” by the journalist Harry Hurt III, was released in 1993, it included a description of a night in which Mr. Trump was said to have raped Ivana in a fit of rage. It also included a statement from Ivana that Mr. Trump’s lawyers insisted be placed in the front of the book. In the statement, she described an occasion of “marital relations” during which “I felt violated, as the love and tenderness, which he normally exhibited toward me, was absent. ” “During a deposition given by me in connection with my matrimonial case, I stated that my husband had raped me,” the statement said. “I referred to this as a ‘rape,’ but I do not want my words to be interpreted in a literal or criminal sense. ” Mr. Trump denied raping Ivana, and she did not respond to a request for comment. After the allegation   in the news media last year, Ivana said in a statement, “The story is totally without merit. ” In the early 1990s, Jill Harth and her boyfriend at the time, George Houraney, worked with Mr. Trump on a beauty pageant in Atlantic City, and later accused Mr. Trump of inappropriate behavior toward Ms. Harth during their business dealings. In a 1996 deposition, Ms. Harth described their initial meeting with Mr. Trump at Trump Tower. Mr. Houraney said in a recent interview that he was shocked by Mr. Trump’s response after he made clear that he and Ms. Harth were monogamous. “He said: ‘Well, there’s always a first time. I am going after her,’ ” Mr. Houraney recalled, adding: “I thought the man was joking. I laughed. He said, ‘I am serious.’ ” By the time the three of them were having dinner at the Oak Room of the Plaza Hotel the next night, Mr. Trump’s advances had turned physical, Ms. Harth said in the deposition. “Basically he   throughout that dinner, when he wasn’t groping me under the table,” she testified. “Let me just say, this was a very traumatic thing working for him. ” Ms. Harth, who declined to comment, gave the deposition in connection with a lawsuit that alleged Mr. Trump had failed to meet his obligations in a business partnership. Mr. Trump settled that case but denied wrongdoing. Ms. Harth withdrew her own lawsuit against Mr. Trump alleging unwanted advances, but she has stood by her original claims. Mr. Trump said it was Ms. Harth who had pursued him, and his office shared email messages in which Ms. Harth, over the past year, thanked Mr. Trump for helping her personally and professionally and expressed support for his presidential candidacy. Mr. Trump says the world misunderstands his relationship with women. He sees himself as a promoter of women  —   a man whose business deals, like the purchase of the struggling Miss Universe pageant, have given them untold opportunities for employment and advancement. “Hundreds and hundreds of women, thousands of women, are the better for it,” he said. He has groomed his daughter, Ivanka, to run his company. And as a chief executive, he said, he admires women for a work ethic that can exceed that of the men around them. Mr. Trump recalled a telling exchange with a female worker. Several women who have held positions of power within the Trump Organization in recent years said they had never known Mr. Trump to objectify women or treat them with disrespect. “I think there are mischaracterizations about him,” said Jill Martin, a vice president and assistant counsel at the company. Ms. Martin said Mr. Trump had enthusiastically supported her decision to have two children over the past five years, even when it meant working from home and scaling back on business travel. “That’s hard with women lawyers,” she said. “For me, he’s made it a situation where I can really excel at my job and still devote the time necessary for my family. ” After competing in the 2009 Miss USA pageant, Laura Kirilova Chukanov, a Bulgarian immigrant who lived in Utah, met with Mr. Trump in his New York office and explained that she wanted to make a documentary about her home country. Mr. Trump encouraged the project and followed through on a promise to put her in touch with his production company. “He genuinely wanted to know what I wanted to do with my life and how he could help,” Ms. Chukanov said. But when Mr. Trump lost confidence in women, he could inflict lasting damage on their lives. After Alicia Machado won the 1996 Miss Universe title, something very human happened: She gained weight. Mr. Trump did not keep his critique of her changing body quiet  —   he publicly shamed her, she said. Mr. Trump said he had pushed her to lose weight. “To that, I will plead guilty,” he said, expressing no regret for his tactics. But the humiliation, Ms. Machado said, was unbearable. “After that episode, I was sick, anorexia and bulimia for five years,” she said. “Over the past 20 years, I’ve gone to a lot of psychologists to combat this. ”'"}, "time": 1742628498.7295494}