{"duration": 0.07298636436462402, "input_args": {"text": "'Thu, 20 Oct 2016 13:28 UTC © sky32.ddns.net Yahoo has urged the US government to disclose national security orders Washington allegedly issued to obtain user data. It comes after a Reuters report claimed that Yahoo built a software program to search customers\\' emails for specific US intelligence. The letter to Director of National Intelligence (DNI) James Clapper was released on Yahoo\\'s website on Wednesday. \"We urge your office to consider the following actions to provide clarity on the matter: confirm whether an order, as described in these media reports, was issued; declassify in whole or in part such order, if it exists; and make a sufficiently detailed public and contextual comment to clarify the alleged facts and circumstances,\" the letter read. The company called for an explanation of \"under what set of circumstances\" the US authorities obtained users\\' private information. \"Citizens in a democracy require such information to understand and debate the appropriateness of such authorities and how the government employs them.\" According to Yahoo, the report \"set a stronger precedent of transparency for our users and all citizens who could be affected by government requests for user data. As we\\'ve said before, recent press reports have been misleading; the mail scanning described in the article does not exist on our systems.\" Timothy Barrett, a spokesman for Clapper\\'s office, confirmed to Reuters that the DNI head had received a letter and \"will respond to Yahoo directly.\" A similar call to the US government has been made by the American Civil Liberties Union (ACLU). The group filed a motion to the Foreign Intelligence Surveillance Court (FISC) requesting the release of court records. \"As the revelation of the Yahoo! Order underscores, an unknown number of legal opinions and orders assessing the constitutionality of and statutory basis for the government\\'s surveillance activities remain hidden from the public,\" the group said in its letter. According to the ACLU motion, \"judicial opinions interpreting constitutional and statutory limits on governmental authorities - including those relevance to foreign-intelligence surveillance - have regularly been available for inspection by the public ... their release is manifestly fundamental in a democracy committed to the rule of law.\" The controversial document, which claims Yahoo built a custom software program to search all of its customers\\' incoming emails for specific information provided by US intelligence officials, was released October 4. The document, first reported by Reuters, said that a custom software program was secretly built in 2015 to comply with a classified US government directive. The program scanned hundreds of millions of Yahoo Mail accounts, according to the revelations. Under laws including the 2008 amendments to the Foreign Intelligence Surveillance Act, intelligence agencies can ask American phone and internet companies to provide customer data to aid foreign intelligence-gathering efforts for a variety of reasons, including prevention of terrorist attacks. But it wasn\\'t until the disclosures by NSA whistleblower Edward Snowden and others who exposed the extent of electronic surveillance on the public that the US government was forced to scale back its program in order to protect privacy rights. Comment: See also:'"}, "time": 1742562550.1748958}