{"duration": 0.07893085479736328, "input_args": {"text": "\"Finian CUNNINGHAM | 14.11.2016 | OPINION US, British ‘Clean House’ to Delete Syria Terror Links US President Barack Obama has just given the Pentagon orders to assassinate commanders of the Al Nusra terror network in Syria. American media reports over the weekend say the new urgency arises from US intelligence fears that al Qaeda-affiliated groups are preparing to mount terror attacks against Western targets from strongholds in Syria. The purported US «kill list» will be acted on through drone strikes and «intelligence assets». The latter refers, presumably, to US special forces that are already operating in northern Syria alongside Turkish military. Last week, a similar announcement was carried in the British press, which reported that elite British SAS troops had received orders to kill up to 200 jihadi volunteers from Britain who are suspected to be active in Syria (and Iraq). Again, the same rationale was invoked as in the latest American plan. That the assassination program was to pre-empt terror attacks rebounding on Western states. A British defense official was quoted as saying that the mission could be the most important ever undertaken by the SAS in its entire 75-year history. «The hunt is on», said the official, «to take out some very bad people». Significantly, too, the British SAS kill operations in Syria are reportedly being carried out as part of a «multinational effort». That suggests that the Pentagon’s initiative reported this weekend in being coordinated with the British. However, there is something decidedly odd about this sudden determination by the Americans and British to eliminate terrorists in Syria. Since the outbreak of the Syrian war in 2011, US, British and other NATO forces have shown meagre success in delivering on official claims of combating al Qaeda-linked terror groups, such as Islamic State (IS, ISIS or Daesh) and Jabhat al Nusra (also known as Jabhat al Fatal al Sham). A straightforward explanation for this apparent anomaly is that the US and its NATO allies are in reality covertly working with these terror networks as proxies for regime change against the Assad government – a longtime ally of Russia and Iran. What Washington refers to as «moderate rebels» whom it supports are in reality serving as conduits for arms and funds to the known terror groups. In this context, the terror groups have been Western assets in the regime-change war. Therefore, there has been no incentive to liquidate these assets – until now that is. Why now is the telling question. The recent ceasefire debacles in the battleground northern city of Aleppo have demonstrated a systematic Western terror link. The failure by Washington to deliver on its commitment to separate so-called moderates from extremists is clear evidence that the alleged dichotomy is a hoax. The plain fact is that the US-backed «rebels» are fully integrated with the terror groups. That is, the US and its allies are sponsors of terrorism in Syria. This has led to the reasonable charge by the Russian government that the US is supporting al Nusra, despite the latter being an internationally proscribed terrorist organization at the heart of the so-called American «war on terror». That charge has been corroborated by claims made by Nusra commanders who say that they have been receiving covert weapons supplies from the Americans. It is also substantiated by recent finds of US weaponry among terrorist dens that have been over-run by the Syrian Arab Army. So, the question is: what is this latest urgency from the Pentagon to wipe out Nusra's leadership in Syria really about? First, let’s note that the implied precision of terrorist «kill lists» that the Americans and British are suddenly working on seems incongruous given that these NATO powers have up to now apparently been unable to furnish Russia with coordinates for extremist bases in Syria. The Russian Ministry of Defense disclosed last week that the Americans have not provided a single scrap of information on the location of terrorist groups in Syria. The US was obliged to share intelligence on extremist positions as part of the ceasefire plans resolved in September by Secretary of State John Kerry and Russia’s Foreign Minister Sergei Lavrov. That then marks a seeming curious shift. From not being able to provide any intelligence on terror groups, now we are told in a different context that the US and its British counterpart are urgently moving ahead to carry out decapitation strikes on Nusra and ISIS commanders. On the British side, reports said that a kill list of hundreds of British jihadis had been drawn up by the intelligence services of MI5, MI6 and GCHQ. Why wasn’t this information shared before with Russia, as part of the Kerry-Lavrov accord? Timing is also another telling factor. Obama’s announced order to the Pentagon to ramp up assassination of Nusra leaders comes in the wake of the shock presidential election victory for Donald Trump. Trump’s election last week was an outcome that completely blindsided the White House and the Washington establishment, who thought that Democrat rival Hillary Clinton was a safe bet . The abrupt US impetus to neutralize Nusra cadres also comes as the Russian navy flotilla takes up position in the Mediterranean off Syria. The flotilla is led by the aircraft carrier, Admiral Kuznetsov , along with destroyers equipped with Kalibr cruise missiles. The naval formation has been described as the biggest Russian deployment since the end of the Cold War 25 years ago. It will greatly enhance Russia’s air power which already has over the past year transformed the Syrian war into an eminent defeat for the Western-backed insurgents. Now that nearly three weeks of Russia’s unilateral cessation in air strikes on terror targets in Syria has elapsed to no avail for a surrender by the insurgents, it is anticipated that Russian air power and Syrian forces on the ground are readying for a final, decisive offensive to vanquish the Western-backed proxy war. President-elect Trump has stated on several occasions his approval of Russian and Syrian anti-terror efforts, unlike the Obama administration, which has sought to hamper them by accusing Moscow and Damascus of «war crimes» against civilians. Russia has rejected those claims as false. It points to recent initiatives to set up humanitarian corridors in Aleppo as evidence that it is trying to minimize civilian casualties. It is the US-backed militants who have sabotaged the humanitarian efforts. In any case, Trump’s accession to the White House can be expected to give Russia a freer hand to bring the Syrian war to a close. And as noted, increased Russian military forces appear to be poised for this final push. This is perhaps where the real significance of the latest Pentagon and British terrorist kill program is evinced. If we accept the plausible and proven premise that the Americans and their NATO allies have been covertly funding, arming and directing jihadi terror proxies, then one can expect that there is plenty of evidence within the terrorist ranks of such state-sponsoring criminal connections. As Russian and Syrian forces eradicate the terrorist remnants one can anticipate that a trove of highly indicting information will be uncovered that grievously imputes Washington, London, Paris and others in Syria’s dirty war. Among the finds too will be hundreds of Nusra and other terrorist operatives who may be willing to testify as to who their handlers were. A huge can of worms awaits to be prized open. To pre-empt such devastating evidence of Western culpability in waging a covert criminal war in Syria, the Pentagon and its British partner appear to be dispatching their elite troops to perform a little bit of «house cleaning». That cleaning may involve whacking jihadis who know too much. No wonder the British official said it could the most important mission for the SAS in its 75-year history. Washington and London’s neck is on the line.\""}, "time": 1742628512.3037138}