{"duration": 0.008281469345092773, "input_args": {"text": "'This post was originally published on this site Rosa Khutor alpine ski resort in Sochi \\n© ITAR-TASS/Artur Lebedev \\nMOSCOW, November 15. /TASS/. Almost 500 specialists will serve as judges at the 3rd CISM Military World Winter Games that will be held on February 22-28 in Sochi, the Russian Defense Ministry said on Tuesday. \\n“The main sports event of 2017 will start in 100 days. The program of competitions and schemes of sports tracks were officially coordinated with national sports federations. Federations also preliminarily approved judging teams in different disciplines and the order of their arrival. The total number of specialists who will judge at the Games will stand at 488 people,” the defense ministry said. \\nThe defense ministry noted that the Organizing Committee already agreed on facilities that will be used at the Games. “Competitions will be held in coastal and mountain clusters: Laura biathlon and ski complex (biathlon, cross country skiing, ski orienteering), Rosa Khutor Alpine Resort (Alpine skiing, ski mountaineering), Iceberg Skating Palace (short track) and Bolshoy Ice Dome (rock climbing),” the ministry added. \\nThe ministry noted that preparations for the Games proceed in accordance with the schedule. “Our team synchronously develops several spheres in order to hold the most successful World Winter Games in the history of their existence,” the ministry quoted Chief of the Central Sports Army Club Mikhail Baryshev as saying. \\nRussian Defense Minister Sergey Shoigu, who heads the Organizing Committee, put forward the idea to hold the Games at Olympic facilities in Sochi. \\nAround 2,000 athletes from 40 countries are expected to take part in the Games. Forty-four sets of medals will be up for grabs in individual and team disciplines. The opening ceremony of the 3rd CISM Military World Winter Games will be held on 23 February 2017. \\n{{item.group_date}} '"}, "time": 1742628549.5790539}