{"duration": 0.04787254333496094, "input_args": {"text": "'Dienstag, 8. November 2016 Trump froh, dass er sich ab morgen endlich nicht mehr zurückhalten muss New York (dpo) - Bald kann er wieder ganz so sein wie er ist: Nach Monaten taktischer Zurückhaltung und höchster Achtsamkeit auf Seriosität und Political Correctness freut sich Donald Trump eigenen Angaben zufolge bereits auf die Zeit nach der Präsidentschaftswahl – ganz unabhängig von deren Ausgang. \"Egal ob ich gewinne oder verliere: Ab morgen kann ich endlich wieder ich selbst sein und muss mich nicht mehr ständig zusammenreißen\", freute sich Trump heute in einem Interview mit dem Fernsehsender Fox News. \"Diese ständige Rücksichtnahme war in den letzten Monaten echt anstrengend. Ich musste wirklich jedes Wort auf die Goldwaage legen, damit ich niemanden beleidige.\" Zu mehreren Bevölkerungsgruppen wären Trump noch ganz andere Dinge eingefallen, hätte er sich nicht mit aller Kraft beherrscht: \"Gerade Mexikaner habe ich betont sachlich als \\'Mörder und Vergewaltiger\\' beschrieben, da hätte ich durchaus auch ausfallend werden können\", so Trump. Vom Wahlkampf jedenfalls hat der Geschäftsmann die Nase gestrichen voll: \"Wissen Sie, wievielen Frauen, die glatte Zehns waren, ich nicht an die Pussy greifen konnte, weil ich Kandidat war? Meine Tic-Tac-Packung von letztem November ist immer noch nicht aufgebraucht, weil ich so wenig geküsst habe. Was bin ich froh, wenn das alles endlich vorbei ist!\" Dabei kann Trump auch einer möglichen Niederlage positive Aspekte abgewinnen. \"Selbst wenn ich die Wahl verlieren sollte, bin ich immerhin wieder frei\", erklärte er. \"Ob ich dann so richtig vom Leder ziehe und das Land in einen Bürgerkrieg stürze oder einfach wieder wie früher die nackten Kandidatinnen meiner Schönheitswettbewerbe ausspanne, weiß ich nocht nicht. Ich würde aber auf jeden Fall das beste aus der Zeit machen und meine Freiheit genießen.\" Am liebsten würde er jedoch die Wahl gewinnen. \"Selbst als berühmter Milliardär kann man sich nicht so austoben wie als US-Präsident. Das wird ein Feuerwerk! Wenn ich erstmal frei von dem Zwang bin, immer auf Umfragen achten zu müssen, beginnt der Spaß erst richtig. Mächtigster Mann der Welt sage ich da nur\", so Trump mit einem Augenzwinkern.'"}, "time": 1742562460.6218867}