{"duration": 0.01583242416381836, "input_args": {"text": "'The Lipstick Lobby  —   part of the larger Trump “Resistance” movement  —   is campaigning for Planned Parenthood with its new shade, “Kiss My Pink,” the proceeds for which will all be donated to the nation’s largest abortion provider. [.@Marinanachos looks fabulous in Kiss My Pink! Love it! #AidsLifeCycle #SistersOfPerpetualIndulgence #LipstickItToTheMan pic. twitter.   —   The Lipstick Lobby (@TLipstickLobby) June 5, 2017,   The Lipstick Lobby’s website says it is “part of a larger movement for change, progress and equality,” and notes that wearing its new signature shade  —   which it claims is “vegan” and “ ”  —   serves as a reminder that ‘small actions can create big waves. ” “It’s a simple way to speak up and speak out against the threats to women’s freedoms and health care posed by the Trump administration,” the Lipstick Lobby continues. “Together we can resist. Together we can make a difference. Together we can #LipstickItToTheMan!” Kiss My Pink is for everyone. Get your shade at https:  . ! 💄❤️ pic. twitter.   —   The Lipstick Lobby (@TLipstickLobby) May 31, 2017,  The Lipstick Lobby describes its “Kiss My Pink” shade  —   which can be purchased for $19  —   as a “high drama, high impact color. ” Budgets reflect priorities. #TrumpBudget tells you all you need to know about how his admin values women. @PPact pic. twitter.   —   The Lipstick Lobby (@TLipstickLobby) May 25, 2017,  While the Lipstick Lobby protests what it claims are “threats to women’s health care,” Planned Parenthood’s own recently released annual report shows a sharp decline in many of the services it claims to provide, as well as a drop in the total number of patients seen. The number of abortions performed at Planned Parenthood, however, has increased, as have its taxpayer funding and profits. “Despite reports that the number of abortions performed in the United States is declining, Planned Parenthood once again reports an increase in the number of human lives ended in their facilities: 328, 348 abortions last year,” says Americans United for Life’s president Catherine Glenn Foster. “Additionally, despite their repeated claims that American women rely on them for   health care services, many of their   services have continued to decrease. ” #Regram (@mayasworld): @TheLipstickLobby and their new lippie “Kiss my Pink”. 100% of net profits go to@PlannedPar  …     https:  .  pic. twitter.   —   The Lipstick Lobby (@TLipstickLobby) May 24, 2017,  Congressional legislation aimed at eliminating Planned Parenthood’s taxpayer funding also seeks to redirect that funding to other community health centers that provide more expansive services and do not perform abortions. “It’s time to redirect Planned Parenthood’s funding to community health centers,” said Susan B. Anthony president Marjorie Dannenfelser. “They outnumber Planned Parenthood facilities by an average of 20 to 1 nationwide and are more comprehensive and accessible to the poor. ” “Taxpayers would be disentangled from the grisly abortion industry and get a better return on their investment in women’s health,” she added.  '"}, "time": 1742628531.602026}