{"duration": 0.1699059009552002, "input_args": {"text": "'Good morning. (Want to get California Today by email? Here’s the  .) For many Californians, the drought now feels long gone. According to the latest figures from the United States Drought Monitor, about 17 percent of the state remains under “moderate drought” conditions or worse. This time last year, it was about 95 percent. But not everyone is rejoicing. On Catalina Island, just off the Southern California coast, water scarcity is so severe that residents still rely almost entirely on a pair of desalination plants. Catalina is home to population of 4, 000 or so people and a beach playground for roughly a million annual visitors. Residents and businesses have had to contend with mandatory water rationing since 2013. Surrounded by ocean, the island has a major disadvantage to the rest of California: It can’t tap the melting Sierra Nevada snow that sustains mainland farms and cities during the warm months. That’s why officials have tightly restricted the use of Catalina’s main water source: an aquifer connected to the interior Middle Ranch Reservoir. The drumbeat of winter storms has helped to replenish the reservoir, but as of last week it was still only roughly a quarter full  —   and summer is looming. Alex Krowiak, a photographer and marine science educator who lives on Catalina, published a photo essay on the island’s water problems in News Deeply this month. He shared some of his pictures with us: (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • A day after 14, 000 people were ordered to flee rising floodwaters in San Jose, the mayor acknowledged that the city had been ill prepared. [The Mercury News] • A slumping hillside caused a bridge on Highway 1 in Big Sur to crack. Caltrans said a new one would have to built. [Monterey Herald] • Once you see the spiraling floodwater in Napa County’s Lake Berryessa, it’s hard to take your eyes off it. [The New York Times] • The threat of deportation, once for only those who committed serious crimes, has many immigrants in   house arrest. [The New York Times] • Here are the most significant elements of the new immigration approach. [The New York Times] • The road to a Democratic House starts in Orange County, not the industrial heartland. [The New York Times] • Protests flared in Anaheim after a video appeared to show an   police officer firing a gun during a confrontation with teenagers. [Los Angeles Times] • A former Palm Springs mayor surrendered at the Riverside jail. He was accused of accepting $375, 000 in bribes from two businessmen. [The Desert Sun] • An art space in Los Angeles’s Boyle Heights neighborhood said it would close after attacks by   activists. [Los Angeles Times] • With the Chargers gone, the Padres have San Diego to themselves. Can they fill the void? [The New York Times] • Managers groping employees. Homophobic slurs. Threats over performance. An inside look at Uber’s workplace culture. [The New York Times] • A judge ruled against a law that would allow actors to hide their age on IMDb, saying it almost certainly violates the First Amendment. [Hollywood Reporter] • Hosting this year’s Oscars, Jimmy Kimmel hopes to find the sweet spot between too much politics and too little. [The New York Times] • On the banks of the Yuba River in the Sierra foothills is a      schoolhouse with only 10 students in kindergarten through eighth grade. [Capitol Weekly] • The perfect day trip from Los Angeles: the   Channel Islands. [The New York Times] Last week, the State Senate leader, Kevin de León, quietly introduced legislation that would require California to get all of its electricity from solar, wind and other renewable sources by 2045. The proposal significantly raises the bar set in 2015 when Gov. Jerry Brown signed legislation that aims for 50 percent use of renewables by 2030. We asked a few energy experts for their reactions to the plan. • Is the timeline plausible? It’s “ambitious,” said Felix Mormann, a faculty fellow at Stanford’s Steyer —  Taylor Center for Energy Policy and Finance. “But not implausible. ” “Last year, Germany was able to briefly meet 95 percent of the country’s electricity demand with renewables,” Mr. Mormann said. “But such peak events are still a long way from weaning an entire energy economy off all nonrenewable energy on a permanent basis. ” • What are the biggest challenges? Cost is one, said Ethan Elkind, director of the climate program at U. C. Berkeley’s Center for Law, Energy and the Environment. “Prices are coming down in all these technologies,” he said. “But we wouldn’t know how much it would cost. We also presumably would have to retire some existing power plants, so the ratepayer impacts are unknown. ” Another challenge is energy storage. A total reliance on renewable energy would require a major expansion of storage capacity for those times when the wind dies down and the sun fades, said Sadrul Ula, managing director of U. C. Riverside’s Winston Chung Global Energy Center. “Lithium batteries offer good potential,” he said. “But they’re still not there. ” • Is Mr. de León’s legislation encouraging?  Yes, said Dr. Ula, because it would essentially set the table for innovation. “Without that, we don’t discuss it. We don’t have a target,” he added. “Resources and development don’t get channeled unless there is a goal post. ” Want to submit a photo for possible publication? You can do it here. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742562063.0529058}