{"duration": 0.12949895858764648, "input_args": {"text": "'Wedding season is here, and many brides and grooms will find themselves in the best shape of their lives. Through a combination of adrenaline, dieting and   exercise, they will walk the aisle as slim and buff as they will most likely ever be. That is, some say, unless they get divorced. For a lot of people, the divorce process seems to kick up stress hormones and motivations quite similar to those swirling around the body and psyche when a marriage ceremony draws near. “It goes to your guts, literally,” said Julie Worden, a yoga teacher in Brooklyn who divorced in 2015. “It’s almost the same feeling as falling in love. It’s the butterflies. ” Ms. Worden, 43, a former dancer, lost 15 pounds during her divorce. “The body goes through this emotional stress, higher levels of cortisol,” she said. “There were times I couldn’t eat because I couldn’t break food down. ” Something similar happened to Astrid Swan, 34, a fitness expert in Los Angeles. “One day I put on a pair of jeggings and they were baggy,” she said. At first she was thrilled, she recalled, because as a former model who was always being told to lose weight, she could “now walk the runways in Milan. ” But as a trainer, she knew that her low weight, and the pain involved with how she achieved it, was unsustainable. “I took some time to celebrate, and then the next month I was like, ‘O. K. this is a problem. ’” Alison Rona, 53, an interior designer and architectural consultant who lives in Brooklyn, also felt conflicted about her new figure. It pleased her, as a sort of “bonus,” she recalled, and yet she felt uninspired to do anything about it, like buy new clothes or date. “It felt a little false, that inside I was still hurting so much. Physically I had a body to show off but I didn’t have the confidence, because I was still so distraught by what had happened. ” Often called “the divorce diet,” which most recently got a celebrity   by the country singer Blake Shelton, who slimmed down after he split from the singer Miranda Lambert, the   regimen is really nothing more than stress, rage, sadness, and (for some) a need to control any part of their lives  —   through diet, exercise, or both  —   that hasn’t fallen into complete chaos. Rachel Sussman, a relationship expert and author of “The Breakup Bible,” said she sees upward of 70 percent of people going through divorce or breakups growing extremely thin. “Then when they start feeling better, at least 50 percent of those people want to keep that weight off,” she said. James J. Sexton, a divorce lawyer in Manhattan and Rockland County, N. Y. estimated that about 80 percent of his clients have lost weight,   of them through exercise, and the others because they weren’t eating or were depressed. When Mr. Sexton went through his own divorce at age 36, he turned to intense exercise, practicing Bikram yoga six days a week. “It became something that stabilized me,” he said. “When the ground has fallen out from beneath you, where you sleep, your children are gone, where you live, exercise is a form of religion, there’s a routine and predictability to it,” he said. “In a scary world and in a scary time of your life, it’s wonderful to have it. ” “You can drink and you can take Xanax or you can join SoulCycle,” he said. Those with compromised metabolisms or who eat their feelings may not have much sympathy for skinnier people under divorce duress, but losing one’s appetite can turn into something serious. Ms. Sussman warns of the divorce diet becoming a gateway to eating disorders, and that those going through divorce need calories and protein to keep their cognitive abilities functioning when they are negotiating important legal issues. Ms. Swan, the fitness expert, said she was so disoriented by her divorce that she had to force herself to eat. “I had to remind myself, ‘You’re going to go and you’re going to get that sandwich,’” she said. But she also believes that exercise, even for those who are underweight or who have lost their appetites, is the best cure. “After a workout, you are craving a replenishment, your muscles know you need it,” she said, “not to mention endorphins, your time, your focus. ” Ms. Worden, the dancer, got certified in Kundalini yoga to get her strength back and to improve her   she said. She now teachers a class specifically for divorced women called Sustaining the Groove to “clear out the nervous system of the yucks,” she said. Already thin, Ms. Worden gained back the 15 pounds she had lost within a year. But she said that many of her students had lost weight in her class and were happy to keep it off. “You’re so concerned with clearing out the rage that it happens without you even knowing it,” she said. Mark Fisher, who owns a gym in midtown Manhattan, agrees that exercise is crucial during “this time of disruption,” but warns against exercising too hard, which can compound the stress even further. “Most people would benefit from having movement that the body doesn’t perceive as a wartime scenario,” like yoga, he said. “We tend to like these workouts that take us to the limit, but these other softer workouts calm the body, the nervous system. ” Going through a divorce, like getting married, is often about entering a new life phase. And many women, said Cynthia Sass, a nutritionist and author in Manhattan, take that idea and run with it. “In many marriages, spouses become each other’s partners in crime by eating unhealthily together, including patterns like splitting pizzas, sharing pints of ice cream, snacking while watching TV,” she said. Ms. Sass said that many of her clients have told her that they have no desire to return to their old, unhealthy ways once they are single again. “Divorce can be a real opportunity for positive, healthy transformation,” she said. Jessica Rojas, a    buyer for Estée Lauder, certainly sees it that way. After a rocky divorce in 2013 (“I would rather lose a limb than go through that again”) Ms. Rojas started Snatched in Six Weeks, an exercise and nutrition program at Mr. Fisher’s gym. “I could barely do a   on my knees,” she said about her   state. Mr. Fisher’s   community of “misfits, nerds, outcasts, and Broadway geeks” cheered her on, she said, and after Snatched ended, she continued to work out there, enjoying the positive energy at the gym. Within a few months, she said, she went from a “flabby size 8 with a corporate commuter look” to a size 2. “That was the one thing I could have control over at that moment,” Ms. Rojas said. “I was in a fight for my life. ” “I’m going to get hot, I’m going to get the guy I want, I’m going to get the things I want out of life,” she recalled herself thinking. It worked. Last fall she locked eyes with Tim Kosakowski, 40, an old friend who works in wildlife management, at their 20th high school reunion in Easton, Pa. She fell for him immediately. On June 25, Ms. Rojas’s 40th birthday, she and Mr. Kosakowski were married under a gazebo at his home, which they now share, in Washington Township, N. J.'"}, "time": 1742562048.7870307}