{"duration": 0.058712005615234375, "input_args": {"text": "'On January 5, Representative Blake Farenthold (  ) introduced legislation that protects the gun rights of military families by allowing the spouses of deployed military personnel to buy guns “in the state where they live due to military orders. ”[This legislation is needed in light of the Gun Control Act of 1968, which bars   citizens from purchasing handguns outside their state of residence. Farenthold’s bill recognizes that “exceptions” to that prohibition were made “for active duty military personnel,” but no exception was made for their spouses. This means spouses of a deployed military member could easily find themselves in a home unarmed —  i. e. defenseless —  for months at a time.  Farenthold’s bill is titled, “Protect Our Military Families’ 2nd Amendment Rights Act. ” In the press release which accompanied the Act’s introduction Farenthold said, “Our military spouses give up a great deal to support their active duty service member, often moving far from home and far from family to be with their spouse. Military spouses should not be denied their Second Amendment rights based on the orders of the military member. They have the right to defend themselves and their families just like anyone else. ” A text of the Act was sent to Breitbart News and its language amends current codes so that military spouses’ residency is determined like the residency of active duty military personnel, as relates to the exercise of Second Amendment rights. The Act says: A member of the Armed Forces on active duty, or a spouse of such a member, is a resident of —   ‘‘(1) the State in which the member or spouse maintains legal residence  ‘‘(2) the State in which the permanent duty station of the member is located and ‘‘(3) the State in which the member maintains a place of abode from which the member commutes each day to the permanent duty station of the member. ” In the wake of recent, heinous attacks witnessed against our stateside military personnel at Chattanooga (July 16, 2015) and Fort Hood (November 5, 2009 and April 2, 2014) —  as well as at other installations —  taking steps that protect military families who are also near these installations is a necessity. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742563739.6715045}