{"duration": 0.05725407600402832, "input_args": {"text": "'  Carol Adl in News , World // 1 Comment \\nSpain is having to review its decision to allow Russian warships to refuel at one of its ports amid international outrage. \\n“The latest stopover requests are being reviewed at the moment based on the information we are receiving from our allies and from Russian authorities,” the Spanish foreign ministry said. \\nA naval fleet headed by the Admiral Kuznetzov aircraft carrier, which passed through the English Channel last week, was expected to dock this morning in the autonomous enclave of Ceuta to take on fuel and supplies under a permit issued by Spain’s Foreign Ministry. \\nNATO, the British government & EU officials have expressed anger even though Spain says Russia’s warships have been mooring there “for years.” \\nThe Independent reports: \\nAsked about Spain’s role in supplying the fleet, Jens Stoltenberg, the Nato Secretary-General, said he was “concerned”. \\n“I have expressed that very clearly about potential use of this battle group to increase Russia’s ability and to be a platform for airstrikes against Syria,” he added. \\n“I repeat those concerns today and I believe that all Nato allies are aware that this battle group can be used to conduct airstrikes against Aleppo and Syria.” \\nGuy Verhofstadt, president of the Alliance of Liberals and Democrats in the European Parliament, called Spain’s decision “scandalous”. \\nHe wrote on Twitter: “Spain signed EU statement on Russian war crimes in Aleppo last week – today [Tuesday] helps refuel fleet on way to commit more atrocities. Seriously?” \\nThe UK said that although access to Spanish ports was a matter for local authorities, concerns had been raised. \\n“Her Majesty’s government has previously expressed concerns to the Spanish government about its hospitality to the Russian navy when we have concerns about Russia’s military activity,” a British Government spokesperson said. \\nSpain, a Nato member, regularly allows Russian war ships to stop in its enclave of Ceuta, which borders Morocco at the mouth of the Mediterranean Sea. \\nA spokesperson for the foreign ministry told El Pais permission was granted on a case-by-case basis depending on the ship in question and possibly security risks. \\n“We are looking at the latest [supply] stops requested based on information requested by Russian authorities,” he added. \\nIntense international media coverage has followed the fleet’s progress from the Arctic Circle to the Mediterranean, with Royal Navy ships tracking it through the Channel.'"}, "time": 1742564219.2023408}