{"duration": 0.1678028106689453, "input_args": {"text": "'3 Type of Social Engineering Attacks to Watch Out For Nov 15, 2016 1 0 \\nMany of us think that we are not only the main actors of the films of our lives but also the directors of it. But the more detailed analysis of the reality shows that this is only an illusion. In most cases our mind directs the film of our lives, not we. I’ve previously introduced in my articles how the mind works, now I only wish to point out those factors, which manipulate our film of life unconsciously. 3 type of social engineering attacks are the following: the Consumer Social Pattern, the Power of Expectations and the Mirror of Opinions. The Consumer Social Pattern \\nThe most important system of social co-existence on Earth today is the consumer society. It means that the basis of social development is economic growth and economic growth depends on how much we consume. \\nThe most important consumer is Ego, since all products obtained (house, car, expensive clothes), improve the imaginary greatness of the Ego . The more commodities or more power we possess, the more important members of consumer society we are. \\nIf we are able to divert our attention from Ego, and concentrate on our internal development and our spiritual birth , our qualities as consumers will considerably drop, since we are no longer attracted to the things that so far fattened our Egos. \\nAs in the recent decades more and more people have felt a need for spiritual birth, social strategy changed accordingly . Spiritual development has also been made a consumer product, which largely supported by the survival instinct of the Ego. The Ego, which has been interested in money and power, now turns towards spiritual development, and disguises itself in the dress of a spiritual Ego . We try to decorate those spiritual clothes by adding more and more spiritual knowledge and experience so as to make it more colorful and individual. With all that, we hope that our spiritual progress will serve the further increase and eternal happiness of our spiritual Ego. \\nConsumer society is all too pleased to serve us in those needs. A glance at the vivid market of spiritual books, methods and masters will suffice to convince us about that. Nothing has really changed; the pattern of the consumer society is the same, only its contents have been partially replaced. The Power of Expectations \\nThe more complex a society is, the more space a specific member of it is supposed to occupy in the complicated system of human relationships. Every such occupied status involves a set of rules, the system of expectations that dictate how the individual occupying the status is supposed to behave in a specific situation, how to behave as a man, a father, a doctor etc. \\nThese expectations tell us how we must and how we must not behave in a specific situation and in connection with a specific person. \\nIn the majority of cases, these expectations work unconsciously, almost like automatic programs running in our life. These deep programs have become a part of our mind in the course of our upbringing, and they are activated by a specific situation in which we are or a person we get into contact with. Then we put on the appropriate mask, tailored to the specific situation or person. \\nWe occupy several statuses at the same time, so it seems that we drown in the sea of expectations. It is also common that the various expectations attached to various statuses collide with each other, generating further anxiety and stress for us. \\nWhat keeps us on the forced track of expectations, why do not we simply leave it behind? \\nThe dynamizing power of the social expectations is provided by our identification with the internal and external expectations, and base our identity on them. We identify with our social statuses, with the masks of our roles in our gender, family and occupation. These masks are attached to us so closely that we would not be able to exist without them. We indentify ourselves with our internal expectations, and our scruples and level of demands often constitute the cornerstone of our identity. \\nWe are so deeply identified with these social expectations, we do not notice that these very expectations convert us into replicas, fake personalities. The pages of our personal history are written by these external forces imposed upon us by society, they determine how to see the world, how to think about the world, how to think about it, what to believe in, what is good for us and what we should avoid. \\nThat is how we have lost our individuality over the years and became unconsciously the victims of a manipulation based upon public agreement. The social expectations have been shaped through a general agreement over the centuries, and became manipulative because we insisted on our identification with the separate state of consciousness . \\nThat is how we jointly sustain this identity, rooted in isolation, this social ”creatureness,” because, due to our ignorance, we stick to the world of forms and shapes. We are only able to imagine our personal existence in the here and now. The Mirror of Opinions \\n”Tell me, what do you think about me, what is your opinion about me?” we have asked other people this question a number of times. What we have gathered from the opinions received from others, we forged an image of ourselves, who we are and what our mission in life is. We have gradually identified with the image, we believed that the image is really us; we have pinned it up on the wall of our room, and proudly show it to any coming our way: look, that is me. \\nOn the other hand, the image in the mirror has also caused us a lot of worry, since there is always a doubt in us: does that image really meet the expectations of others, do we appear good, decent, religious enough in the eyes of others? \\nAs a consequence, we spend our whole life polishing and improving the image in order to make it look better and better for others. We tend to believe that the best strategy in this process is copying, imitating others. This is a strategy that we use from our babyhood onward, that is how we learn our native language, and that is how we acquire the elements of our culture. Later, when we are older, we continue copying others, since if we follow the ways of those who lead a decent and good life, we cannot be wrong. \\nAnother characteristic feature of our image in the mirror is that it is contradictory by nature. We receive almost as many opinions as many friends and acquaintances we have. Some may consider as clever, whereas others do not find that the most important feature of ours. It generates a permanent state of uncertainty in connection with the image, that is, in connection with ourselves. \\nThis uncertainty in connection with ourselves shall serve as a basis for our desire to convince other people that the image in the mirror is true, and we really are the way other people see us. If our identification wirth the image in the mirror, generated from the opinions of others, is strong, it keeps us in a virtually hypnotic state, and we life our whole life under the spell of that image. Be the Director of the Film of your Life \\nIf we realise how these unconscious processes affect our lives, we can become the directors of the films of our lives. \\nOur internal development therefore does not only depend on our life experience; it depends much more on our ability to divert our attention from the outside world to our internal world. The patterns of the consumer society are determined to prevent us from making the necessary adjustments in our orientation by gluing our attention to various consumer products or a spiritual development scheme that involves the Ego . A major element of this spiritual development pattern is that we are trying to understand the contents of our Minds, to analyze our thoughts and emotions. Our attention is thus engaged by the various methods that we are using to examine our thoughts and emotions. That is what we regard as our real internal world, and we create the illusion of toiling on our spiritual birth. \\nFrom the aspect of our spiritual growth the –often chaotic– world of our Mind and emotions is not our real internal world. Our attention should not be directed to the analysis and comprehension of these; instead, we need to concentrate on becoming conscious of our existence, to find the center of our Self behind our external life and personal history. That is our real internal world. \\nIn the course of our spiritual world we become conscious of, and alert to that internal center, to that internal world. Once that has been accomplished, our life is placed on entirely new foundations. The Mind stops functioning the way it used to and, together with that, our sense of identifying with the Mind vanishes. The spiritual Ego, our separate little self disappears, and we are permeated by a permanent, light presence. The personality is gone, and what remains is silence and presence, as the real essence of our existence. From that time on, that will serve as the real foundation for our internal development. \\nWe submerge into the present moment, we shall experience a miracle. At present, the program of our internal expectations have already been dissolved, and we no longer identify with our expectations of the other people. The mirror of opinions blurs, and our wholesome Self, the pleasure of Existence shall be revealed.'"}, "time": 1742563499.3075871}