{"duration": 0.10523581504821777, "input_args": {"text": "'Email \\nHillary Clinton has been under the protection of a “Shadow Government,” according to an FBI document which is part of the investigation into her use of a private e-mail server during the time she was secretary of state. The “Shadow Government” — the exact term used in the FBI document — included among its “known regular attendees” some well-known and powerful people. \\nThe FBI document, which is heavily redacted in some places, is dated August 24, 2015, and was made public earlier this month. It includes information from an FBI “interview of [redacted]” on August 19, 2015 and addresses the Freedom of Information Act (FOIA) requests which had been made in regard to Clinton’s e-mails. The document reveals some of the process about what was redacted from those e-mails before they were released as part of those FOIA requests. On page 56 of the document, it says: Most of the items with CIA redactions were emails from Sidney BLUMENTHAL. One item was deemed classified according to the FBI and Kennedy held a closed door meeting attended by the FBI’s [redacted] and IPS’ [redacted] among others. In that meeting, KENNEDY asked [redacted] to change the FBI’s B(1) upgrade classification, but [redacted] did not change the FBI’s stance. On May 22, it was decided by the IPS team they would keep the upgrade of the one FBI-related email and the IPS officials sent David KENDALL, Attorney, Williams & Connolly, LLC, a letter informing him of the results. \\nAside from the element of showing how the sausage is made in backroom “closed door” meetings, the document also includes some damning information in the next paragraph. It tells of a “powerful group of very high-ranking STATE officials” referred to as “The Shadow Government,” which met weekly “to discuss the FOIA process, Congressional records, and everything CLINTON-related to FOIA/Congressional inquiries.” The document says: There was a powerful group of very high-ranking STATE officials that some referred to as “The 7th Floor Group” or “The Shadow Government.” This group met every Wednesday afternoon to discuss the FOIA process, Congressional records, and everything CLINTON-related to FOIA/Congressional inquiries. The known regular attendees included Jonathan FINER, Chief of Staff for Secretary of State John KERRY, Jennifer STOUT, Deputy Chief of Staff, Heather HIGGENBOTTOM, Deputy Secretary of State for Management and Resources [Patrick] Kennedy, Julia FRIFEILD, Assistant Secretary, Legislative Affairs, [redacted] Office of the Legal Advisor, [redacted] Office of the Legal Advisor overseeing STATE’s [redacted], [redacted] [redacted] and [redacted]. \\nThe document goes on to explain that the “7th Floor Group” (which is also called “The Shadow Government”) pushed to have all of Clinton’s e-mails released “all at once in January 2016” even though “with larger FOIA requests, such as with the CLINTON-related FOIA request” that would normally be done on a scheduled “rolling release” happening “every few weeks or month.” It also says that while IPS (the Office of Information Programs and Services) “officials did not have control of the release process of the 296 e-mails related to the House Select Committee on Benghazi’s request, they did have control for the release process for the approximately 30,000 e-mails or 52,455 pages related to the CLINTON FOIA request, and it was decided to be a rolling release.\" \\nThe “7th Floor Group/The Shadow Government” is mentioned in previous documents as well. On page 54, it says, “[redacted] stated those involved at IPS felt the 7th floor, or leading STATE officials, had their own ideas on how to formally review the 296 emails.” It is obvious that “The Shadow Government” on the 7th floor wanted to protect Clinton in both the review process and the release process. \\nPerhaps this explains why — despite a mountain of evidence that Clinton knowingly violated a plethora of federal laws regarding her use of a private e-mail server and account to send and receive classified information — the FBI declined to recommend indictment. After all, Clinton is the clear “Shadow Government” candidate in this presidential race.  '"}, "time": 1742563092.0371277}