{"duration": 0.07407760620117188, "input_args": {"text": "'Nominations for the 89th Academy Awards will be announced on Tuesday, and movie marketers will be ready to pounce with ads that try to coax more people into seats: The establishment is swooning! Get to a theater! It works. Research indicates that Oscar nominations often result in tens of millions in additional ticket sales, particularly for     films. Among the movies counting on awards attention to find a bigger audience is “Moonlight. ” Seen as a leading contender for best picture, this euphorically reviewed drama about a young black man in Miami started strong but has stalled. It has taken in about $15. 8 million over 14 weeks. For “Silence,” Martin Scorsese and Paramount desperately need the academy to help their   drama from becoming a financial washout. Costing $50 million to make, “Silence,” a passion project for Mr. Scorsese as director, has collected $5. 2 million since its arrival on Dec. 23. “Lion,” a   set largely in India, is a Weinstein Company film that has earned $16. 4 million  —   a solid result for an art film of its type but still a long way from Weinstein awards hits in recent years. (Another Weinstein movie, “The Founder,” about the start of the McDonald’s   empire, arrived to $3. 4 million in ticket sales over the weekend.) “20th Century Women,” a comedic drama about a quirky mother (Annette Bening) in the late 1970s, has taken in $2. 3 million. An Oscar nomination for Ms. Bening would help give it momentum. As for the weekend, “Split,” the latest thriller from M. Night Shyamalan and Blumhouse Productions, was the No. 1 movie in North America. Expertly marketed by Universal Pictures, which leaned on   digital promotions, “Split” sold an estimated $40. 2 million in tickets, far surpassing prerelease analyst expectations. “Split” cost just $9 million to make, with Mr. Shyamalan personally footing the bill. Arriving as a distant second was “XXX: The Return of Xander Cage” (Paramount) which managed roughly $20 million  —   an underwhelming start for a film that cost at least $125 million to make and market and was designed to revive an action series that had been dormant for 12 years. Instead, “The Return of Xander Cage,” starring Vin Diesel, who tried to rally his 101 million Facebook followers, will likely become more evidence that Americans have little appetite for movie franchises that have been on ice for more than a few years. (See: “Independence Day: Resurgence” and “Zoolander 2. ”) Paramount, which offset its financial risk by bringing in partners, said the film collected an additional $50. 5 million in partial release overseas and called it “the No. 1 movie in the world. ” Rounding out the top three, “Hidden Figures” (20th Century Fox) continued to ride strong word of mouth, taking in roughly $16. 3 million, for a   domestic total of $84. 2 million, according to comScore, which compiles ticketing data.'"}, "time": 1742564618.1552536}