{"duration": 0.10585856437683105, "input_args": {"text": "'BRİCS ülkeleri ABD’nin mali savaşıyla baş etmek zorunda yazan Ariel Noyola Rodríguez ABD’nin başlattığı mali savaşla baş edebilmek için, BRİCS ülkelerinin ekonomi ve finans alanlarındaki işbirliği bağlarını acilen güçlendirmeleri gerekiyor. BRİCS ülkelerinin yeni kalkınma bankasının kredi hacmini ve aynı şekilde döviz rezervi derinliğini arttırması gerekiyor. Bunun dışında BRİCS ülkelerinin mümkün olan en kısa zamanda kendi kredi derecelendirme kuruluşunu oluşturmaları gerekir. Ekonomik bütünleşmeyi yoğunlaştırmak için bir serbest bölgenin oluşturulması gümrük engellerini ortadan kaldıracak ve böylece kendi aralarındaki ticaretin etkili bir şekilde artmasını sağlayacaktır. Kısacası, eğer kısa zamanda uygun önlemler alınmazsa, BRİCS ülkeleri yaklaşan mali tayfun sırasında batma riski taşıyorlar.\\nVoltaire İletişim Ağı | Meksiko (Meksika) | 5 Kasım 2016 français русский italiano Español Deutsch 15 ve 16 Ekim tarihlerinde, Hindistan’ın Goa Eyaletinde, BRİCS’in (Brezilya, Rusya, Hindistan, Çin ve Güney Afrika) sekizinci zirvesi yapıldı. Toplantının, küresel ekonominin çok kritik durumu bağlamında gerçekleştirildiğini kabul etmeliyiz. Bu arada, BRİCS ülkeleri, kötü bir dönemi stratejik bakış açısından hareketle aralarındaki bağları derinleştirmek için bir fırsata dönüştürme konusundaki olağanüstü yeteneklerini bir kez daha ortaya koydular.\\nBRİCS ekonomileri altın çağlarını yaşadıktan sonra, son yıllarda, büyüme oranları sert bir şekilde yavaşladı. Bu zor durum karşısında, BRİCS ülkelerinin, bundan birkaç yıl önce Fortaleza’da (Brezilya) yaptıkları altıncı zirce sırasında kuruluşunu dünyaya duyurdukları mali kurumlardan yararlanmaya şimdi her zamankinden daha çok ihtiyaçları vardır [ 1 ].\\nGeçtiğimiz Nisan ayında, yeni Kalkınma Bankası 800 milyon doların üstünde bir tutarda ilk kredisini verdi [ 2 ] ve 2017 yılında verilen toplam kredi tutarının 2 500 milyon doları bulması bekleniyor [ 3 ]. Bunun dışında, bu yılın Temmuz ayında, aynı mali kurum, 450 milyon dolara yakın bir tutarda Yuan cinsinden « green bonds » -yeşil tahvil- itfasını tarihi bir gerçekleşme ile başarıyla yürüttü [ 4 ]. Bu mali enstrümanlar, dünya ölçeğinde Çin para biriminin etkisini arttırırken, büyük yatırım projelerinin finansmanını sağlıyorlar.\\nBu arada, 100 milyar dolar değerindeki döviz rezervi fonu (İngilizce kısaltmasıyla CRA), Hindistan Maliye Bakanı Arun Jaitley’in duyurduğu gibi, BRİCS ülkelerinin ödemeler dengesine istikrar kazandırmak üzere ilk kredilerini vermeye hazırdır [ 5 ]. ABD Federal Rezervi (FED), alışageldiği üzere, küresel çapta yeni bir mali krize yol açacak şekilde federal faiz oranlarının artışı tehdidini her savurduğunda, BRİCS ülkelerinin istikrar fonlarının parasal kaynaklarını olabildiğince hızlı bir şekilde arttırmaları önem kazanıyor. Aksi taktirde, büyük yatırım bankalarının spekülatif bahisleri nedeniyle ciddi hasar alma riski taşımaktadırlar.\\nAynı zamanda BRİCS ülkelerinin, sadece yaptıkları ticarette yerel para birimlerini kullanarak değil ama aynı zamanda örneğin kendi merkez bankalarında Yuan cinsinden rezervleri arttırarak uluslararası mali sistem içerisindeki ABD ve dolar hegemonyasına açık bir şekilde meydan okumak üzere yeni cepheler açmaya ihtiyacı vardır [ 6 ]. Üstelik halkın para birimi –Çince Renminbi- geçen 1 Ekim tarihinde, 1960 yılında Uluslararası Para Fonu’nun (İMF) tarafından oluşturulan özel çekim hakkını destekleyen elit para birimleri sepetine resmi olarak kabul edildi [ 7 ].\\nBunun dışında BRİCS ülkelerinin, Latin Amerika, Asya, Afrika ve Ortadoğu ile aralarındaki güçlü jeopolitik bağlar sayesinde mali bir ittifakı harekete geçirme yeteneği de vardır. İster Asya Altyapı Yatırım Bankası (İngilizce kısaltmasıyla AIIB), ister ALBA Bankası (Bizim Amerikamız için Bolivarcı İttifak) ve hatta nihayet bu yılın sonundan önce faaliyete geçecek olan Güney Bankası olsun, temel olarak çevre ülkeleri tarafından biçimlendirilen Bölgesel Kalkınma Bankaları bu amaca hizmet edebilir.\\nFitch, Moody’s ve Standard & Poor’s aracılığıyla ABD’nin elinde olan ezici hakimiyetten kurtulmaları için, kendilerine ait bir kredi derecelendirme kuruluşunun oluşturulması da, BRİCS ülkeleri için acil bir ihtiyaç haline geldi [ 8 ]. Bu üç kredi derecelendirme kurumu, teknik kriterlerden hareketle değerlendirmeler yapmak yerine, özellikle uzaktan kumandalı politik içerikli eğilimlerle hareket ediyorlar. Bu çalışma tarzı söz konusu kuruluşları, devlet tahvillerinin notlarını indirerek ve böylece Yunanistan, Rusya ya da Venezüella gibi ülkelerin kredi maliyetlerini çarpıcı bir şekilde artırarak özgün bir savaş aygıtı haline getiriyor.\\nEkonomik bütünleşme, son yıllarda, özellikle de 2001 ve 2015 arasında BRİCS ülkeleri arasındaki ticaretin toplam ticaretlerine oranı % 6’dan % 12’ye çıkarak [ 9 ] ikiye katlanmasıyla büyük şekilde gelişmesine rağmen, bir başka büyük meydan okumadır. Çin, uzaktan bakıldığında diğer BRİCS ülkeleriyle en çok entegre olan ekonomidir. Buna karşın, Hindistan ve Güney Afrika gibi ülkelerin arasındaki bağlar marjinaldir. Aynı durum Brezilya ve Rusya için de geçerlidir. Bu da BRİCS ülkeleri arasında bir serbest ticaret bölgesinin oluşturulmasının yerindeliğini ortaya koyuyor [ 10 ]. Öte yandan, kendi aralarındaki ticari engelleri ortadan kaldırmanın ötesinde, BRİCS ülkeleri kendi aralarında, en elverişsiz ülkelerin sanayileşmesini teşvik etmek için üretim sistemlerinin entegrasyonu yoluyla, birlikte değer zincirlerinin inşasını desteklemelidir.\\nSonuç olarak, gelişmekte olan beş gücün karşısında ufukta birçok meydan okuma vardır. Bunun devamında BRİCS ülkelerinin başarısı yeniden icat etme yeteneklerine, uzun vadeli hedeflerine ulaşmak için yeni işbirliği boyutlarının ifadesi yolundaki yaratıcılıklarına bağlı olacaktır. Amerika’nın hazırlığını yaptığı yeni mali savaş karşısında, BRİCS ülkelerinin yeniden saldırıya geçmesinin zamanı gelmiştir…\\nAriel Noyola Rodríguez Çeviri\\nOsman Soysal\\nKaynak\\nRussia Today (Russie)'"}, "time": 1742563121.2854702}