{"duration": 0.10567283630371094, "input_args": {"text": "'Talk show hosts talk. After a mass murder, the pattern goes, they take a moment to talk more seriously. They talk about grief, love and hope. And then  —   this being their job  —   they move on to talk about something else. Monday night, as   shows aired their first episodes after the mass shooting at a gay nightclub in Orlando, Fla. there was a recurring theme: Talk is not enough anymore. From more freewheeling cable shows to the mainstream broadcasters, the prevailing message was that   hosts had been here so many times, after so many mass murders, the sad comic’s display of apolitical grief response had become shtick. “You realize that you know what to say,” Stephen Colbert said on CBS, “because it’s been said too many times before. ” Samantha Bee, the host of “Full Frontal” on TBS, said that she was too angry to deliver some “  words about how we will get through this together, how love wins, how love conquers hate. ” She continued: “Love does not win unless we start loving each other enough to fix our [expletive] problems”  —   starting, she argued, with restricting access to guns like the semiautomatic that Omar Mateen used to kill dozens of clubgoers. Ms. Bee’s political comedy has been blistering from the second “Full Frontal” began in February, and taking sides is her mission, much as it was on her alma mater, “The Daily Show. ” (In his own commentary on the terrorist attack, Trevor Noah declared, “America needs to make it a lot harder for people who shouldn’t have guns to get guns. ”) What was new was the quaver in Ms. Bee’s voice  —   the barest suggestion that it was all she could do to keep it together even as she lashed the National Rifle Association and politicians who oppose gun regulations. Ms. Bee has been a   punk band of rage, sarcasm and urgency Monday’s show added an acoustic note of heartbreak. Ms. Bee’s   Conan O’Brien, made a bigger departure. Never a particularly political host, he told his audience, “I have really tried very hard over the years not to bore you with what I think. ” But on this night, he said, “I simply do not understand why anybody in this country is allowed to purchase and own a semiautomatic assault rifle. ” Hosts evolve over the years  —   David Letterman became more political in his later seasons  —   and Mr. O’Brien has been at this since 1993. But he also now has the latitude afforded by a smaller cable audience. It’s questionable whether, were he still hosting “The Tonight Show,” he would have been able to speak out the same way. Compare the emotional but conventional plea for peace and understanding offered by the current host of “The Tonight Show,” Jimmy Fallon: “Maybe there’s a lesson from all this, a lesson in tolerance. We need to support each other’s differences and worry less about our own opinions. ” On CBS’s “Late Show,” Mr. Colbert’s reaction captured his delicate effort over the past year to find a middle ground between the sharp point of view of “The Colbert Report” and the more typical neutrality of late night. His monologue wasn’t as prescriptive as Ms. Bee’s or Mr. O’Brien’s, but it tiptoed up to the edge of   …     something. Opening behind his desk  —   a departure for his show  —   Mr. Colbert talked about love fighting despair, but with the suggestion that feeling, in itself, wasn’t enough. “Love the families and the victims and the people of Orlando, but let’s remember that love is a verb. And to love means to do something. ” Mr. Colbert was saying not that love is itself an action, but that love requires acts to mean anything. It was an idea that wouldn’t be out of place in a church group, and indeed, the former Sunday school teacher seemed to be trying to bring that experience to late night. Not to punt on the moral question or preach about it, but to think through a problem with his congregation. He continued that approach with his first guest, Fox News’s Bill O’Reilly, who had been scheduled before the attack. The conservative host was more eager to talk about the   angle of the killings, whereas it became clear that for Mr. Colbert, “do something” meant, in part, getting powerful guns off the streets. Conservatives will notice, correctly, that late night was not exactly an N. R. A.  zone. In his “A Closer Look” segment, Seth Meyers touted a Harvard study that linked more gun availability to more gun deaths. “Which should be obvious,” Mr. Meyers continued. “That’s like saying, where there’s more white people, there’s more brunch. ” But the “Late Show” exchange was strikingly civil. Mr. O’Reilly signaled openness to restrict some guns Mr. Colbert gently shushed his less conservative audience when it grumbled at his guest: “Listen to what he has to say, please. ” Trying to come to some mutual understanding about guns and terrorism at any time, let alone in an election year, seems quaint and quixotic. And it symbolizes the tough job Mr. Colbert has had in synthesizing the Comedy Central and CBS audiences on his new show. He might be too political for the car   crowd, too accommodating for partisans who want viral clips of their enemies being “totally destroyed. ” Whether he succeeds or not, there was a growing, exhausted sense Monday that the usual     approach wasn’t cutting it. As Mr. O’Brien put it: “It’s time to grow up. ”'"}, "time": 1742562290.2432983}