{"duration": 0.1606006622314453, "input_args": {"text": "'PARIS  —   It’s 1944, in occupied Paris. Four friends spend their days in a narrow room atop a Left Bank apartment building. The neighbors think they’re painters  —   a cover story to explain the chemical smell. In fact, the friends are members of a Jewish resistance cell. They’re operating a clandestine laboratory to make false passports for children and families about to be deported to concentration camps. The youngest member of the group, the lab’s technical director, is practically a child himself: Adolfo Kaminsky, age 18. If you’re doubting whether you’ve done enough with your life, don’t compare yourself to Mr. Kaminsky. By his 19th birthday, he had helped save the lives of thousands of people by making false documents to get them into hiding or out of the country. He went on to forge papers for people in practically every major conflict of the   century. Now 91, Mr. Kaminsky is a small man with a long white beard and tweed jacket, who shuffles around his neighborhood with a cane. He lives in a modest apartment for people with low incomes, not far from his former laboratory. When I followed him around with a film crew one day, neighbors kept asking me who he was. I told them he was a hero of World War II, though his story goes on long after that. It remains painfully relevant today, when children are being bombed in Syria or boarding shabby boats to escape by sea. Like most Westerners, I usually ignore their suffering, and assume that someone else will step in to help. But Mr. Kaminsky  —   a poor, hunted teenager  —   stepped in himself, during the war and then for many different causes afterward. Why did he do it? It wasn’t for the glory. He worked in secret and only spoke about it years later. His daughter Sarah learned her father’s whole story only while writing a book about him, “Adolfo Kaminsky: A Forger’s Life. ” The English translation comes out this week. It wasn’t for the money, either. Mr. Kaminsky says he never accepted payment for forgeries, so that he could keep his motives clear and work only for causes he believed in. He was perpetually broke, and scraped together a living as a commercial photographer, he said. The wartime work put such a strain on his vision that he eventually went blind in one eye. Though he was a skilled forger  —   creating passports from scratch and improvising a device to make them look older  —   there was little joy in it. “The smallest error and you send someone to prison or death,” he told me. “It’s a great responsibility. It’s heavy. It’s not at all a pleasure. ” Years later he’s still haunted by the work, explaining: “I think mostly of the people that I couldn’t save. ” Mr. Kaminsky empathized with refugees partly because he was one himself. He was born in Argentina to Russian Jews who’d first fled Russia to Paris, and then been kicked out of France. When Adolfo was 7, the family, by then with Argentine passports, was allowed to rejoin relatives in France. “It was then that I realized the significance of the word ‘papers,’ ” he explained. After dropping out of school at 13 to help support his family, he was apprenticed to a clothes dyer, a precursor to the modern dry cleaner. He spent hours figuring out how to remove stains, then read chemistry textbooks and did experiments at home. “My boss was a chemical engineer, and would answer all of my questions,” he said. On weekends he helped a chemist at a local dairy, in exchange for butter. In the summer of 1943, he and his family were arrested and sent to Drancy, the internment camp for Jews near Paris that was the last stop before the death camps. This time, their passports saved them. Argentina’s government protested the family’s detention, so they stayed at Drancy for three months, while thousands of others were swiftly sent on to die. Mr. Kaminsky remembered a math professor who had agreed to tutor him in the camp. “One day, when it was time for our classes, he wasn’t there. He hadn’t wanted to tell me beforehand that his name was on the list. ” The Kaminskys were eventually freed, but they weren’t safe in Paris, where Jews were under constant threat of arrest. Soon Argentines were being deported, too. To survive they would have to go underground. Adolfo’s father arranged to get false papers from a Jewish resistance group, and sent Adolfo to pick them up. When the agent told Adolfo that they were struggling to erase a certain blue ink from the documents, he advised using lactic acid, a trick he’d learned at the dairy. It worked, and he was invited to join the resistance. Mr. Kaminsky’s cell was one of many. His would get tips on who was about to be arrested, then warn the families, assembling new papers for them on the spot. The group focused on the most urgent cases: children who were about to be sent to Drancy. They placed the kids in rural homes or convents, or smuggled them into Switzerland or Spain. In one scene from the book, Mr. Kaminsky stays awake for two nights straight to fill an enormous rush order. “It’s a simple calculation: In one hour I can make 30 blank documents if I sleep for an hour, 30 people will die. ” Historians estimate that France’s Jewish resistance networks together saved 7, 000 to 10, 000 children. Some 11, 400 children were deported and killed. After the war, Mr. Kaminsky didn’t plan to keep working as a forger. But through his wartime networks, other movements got in touch. He continued forging papers for 30 more years, playing a small role in conflicts ranging from the Algerian war of independence to the   struggle in South Africa to the Vietnam War, making documents for American draft dodgers. He estimates that in 1967 alone, he supplied forged papers to people in 15 countries. I can’t vouch for every cause. Some of the rebel groups he supported used violence. And at close range, his stubborn idealism was no doubt maddening. He had two kids soon after World War II, but couldn’t tell them or his   about his underground work, so they didn’t know why he rarely visited. Girlfriends assumed he was absent because he’d been cheating. He was supposed to follow one woman to America, but never showed up, because he’d joined the Algerian resistance. “I saved lives because I can’t deal with unnecessary deaths  —   I just can’t,” he told me. “All humans are equal, whatever their origins, their beliefs, their skin color,” he later added. “There are no superiors, no inferiors. That is not acceptable for me. ” In 1971, convinced that too many different groups knew his identity, and that he’d soon be caught and imprisoned, Mr. Kaminsky quit forging for good, and mostly made a living teaching photography. On a visit to Algiers he met a young law student, of Tuareg ancestry, who was the daughter of a liberal Algerian imam. They’re still married, and have three children. The last time I saw Mr. Kaminsky, he showed me a photograph he took just after the liberation of Paris. It shows about 30 children who’d come out of hiding, and were hoping to be reunited with their parents. He knows there are children in similar peril today, and that having the wrong passport can still cost your life. “I did all I could when I could. Now, I can’t do anything,” he said. Surely, though, the rest of us can.'"}, "time": 1742561680.620245}