{"duration": 0.04162192344665527, "input_args": {"text": "'US and Allies Openly Massing Huge Army on Russian Border! \\nAndrew Anglin October 26, 2016 WWIII: Do it for Ambulance Boy, goyim pigs. \\nYou know, maybe we should do a referendum, like “do you think we should have a nuclear war with Russia to save ISIS because of human rights and barrel bombs?” \\nI mean, I know most people probably agree with the Jews that the human rights of Syrians are a pretty damned good reason for a third World War. \\nBut I think in a Democracy, the people should have a right to make the call. \\nReuters : \\nBritain said on Wednesday it will send fighter jets to Romania next year and the United States promised troops, tanks and artillery to Poland in NATO’s biggest military build-up on Russia’s borders since the Cold War. \\nGermany, Canada and other NATO allies also pledged forces at a defense ministers meeting in Brussels on the same day two Russian warships armed with cruise missiles entered the Baltic Sea between Sweden and Denmark, underscoring East-West tensions. \\nIn Madrid, the foreign ministry said Russia had withdrawn a request to refuel three warships in Spain’s North African enclave of Ceuta after NATO allies said they could be used to target civilians in Syria . \\nTARGETING CIVILIANS, GOYIM! \\nRUSSIANS ARE PURPOSEFULLY KILLING SYRIAN BABIES \\nWHY???? \\nWell, no one knows. \\nI guess because they are just really mean people. \\nThe ships were part of an eight-ship carrier battle group – including Russia’s sole aircraft carrier Admiral Kuznetsov – that is expected to join around 10 other Russian vessels already off the Syrian coast, diplomats said. \\nNATO Secretary-General Jens Stoltenberg said the troop contributions to a new 4,000-strong force in the Baltics and eastern Europe were a measured response to what the alliance believes are some 330,000 Russian troops stationed on Russia’s western flank near Moscow. \\nRUSSIA HAS A MILITARY INSIDE THEIR OWN COUNTRY 111 \\nWHY WOULD A COUNTRY HAVE AN ARMY IN THEIR OWN COUNTRY???? \\nIT IS A PERFECTLY MEASURED RESPONSE TO MOVE THOUSANDS OF TROOPS ACROSS AN OCEAN AND PLACE THEM ON THEIR BORDER!!!! \\n“This month alone, Russia has deployed nuclear-capable Iskander missiles to Kaliningrad and suspended a weapons-grade plutonium agreement with the United States,” Stoltenberg said, also accusing Russia of continued support for rebels in Ukraine. \\nThose ballistic missiles can hit targets across Poland and the Baltics, although NATO officials declined to say if Russia had moved nuclear warheads to Kaliningrad. \\nNATO’s aim is to make good on a July promise by NATO leaders to deter Russia in Europe’s ex-Soviet states, after Moscow orchestrated the annexation of the Crimea peninsula in 2014. \\nNATO’s plan is to set up four battle groups with a total of some 4,000 troops from early next year, backed by a 40,000-strong rapid-reaction force , and if need be, follow-on forces. \\nAs part of that, U.S. Secretary of Defense Ash Carter announced a “battle-ready battalion task force” of about 900 soldiers would be sent to eastern Poland , as well as another, separate force equipped with tanks and other heavy equipment to move across eastern Europe. \\n“It’s a major sign of the U.S. commitment to strengthening deterrence here,” Carter said. \\nBritain’s Defence Secretary Michael Fallon said Britain would send an 800-strong battalion to Estonia, supported by French and Danish troops , starting from May. The United States wants its troops in position by June. \\nLondon is also sending Typhoon fighter aircraft to Romania to patrol around the Black Sea, partly in support of Turkey. \\n“Although we are leaving the European Union, we will be doing more to help secure the eastern and southern flanks of NATO,” Fallon said. \\nSYRIAN SHADOW \\nOthers NATO allies joined the four battle groups led by the United States, Germany, Britain and Canada to go to Poland, Lithuania, Estonia and Latvia. Canada said it was sending 450 troops to Latvia, joined by 140 military personnel from Italy . \\nGermany said it was sending between 400 and 600 troops to Lithuania, with additional forces from the Netherlands, Norway, Belgium, Croatia and Luxembourg. \\nStoltenberg said allies’ commitments would be “a clear demonstration of our transatlantic bond.” Diplomats said it would also send a message to Republican presidential nominee Donald Trump, who has complained that European allies do not pay their way in the alliance. \\nSEND A MESSAGE ALSO TO TRUMP!!!! \\nIT’S NOT JUST ISIS OR UKRAINE WE’RE SAVING HERE – WE ALSO HAVE TO STOP DONALD TRUMP!!! \\nThe choice is very clear: \\nWill we allow Putin to help Assad barrel bomb his own people by bombing ISIS and thus deny Syrian babies of human rights? \\nOr will we launch a massive World War inside of Europe to stop human rights atrocities in Syria? \\nI think we all know the morally correct answer to this question. \\nBut still though. Let’s have a referendum, just to make sure we’re all on the same page here.'"}, "time": 1742628565.9379776}