{"duration": 0.1439189910888672, "input_args": {"text": "'Toxins, Vaccines, and a Strategy to Keep Kids Healthy Toxins, Vaccines, and a Strategy to Keep Kids Healthy: A Chiropractor Reviews The Vaccine-Friendly Plan \\nby Karen Lee, D.C. drkarenslee.com \\nWhen the long-awaited book, The Vaccine-Friendly Plan by Paul Thomas, M.D. and Jennifer Margulis, Ph.D., was finally published, I couldn’t wait to download it to read it. \\nMy iPad stayed next to me wherever I went and when my husband and I watched our regular weekly TV show, I “pretended” to watch TV while I was actually reading it on the iPad. \\nI knew Jennifer was working tirelessly on writing this potentially controversial book since last year when I interviewed her for my Wellness Wednesday Webinar , and I applauded her for her tenacity to set the facts straight. \\nNow that I’ve finished the book, I’m honored to share my thoughts with you here. Don’t judge a book by its cover \\nI have to admit; I was a bit confused when I read the Table of Contents and the first few chapters. From the title of the book, I expected the book to be only about vaccination, but it was much more than that. \\nDr. Paul educates new moms on how to make sure their children are as healthy as possible, so that toxic exposures, including the toxic ingredients in vaccines, will not harm them. Vaccination can be preventative to many diseases if done right, and there is more to it than just getting the shots as recommended, and Dr. Paul’s comprehensive plan for keeping children healthy prior to getting the shots was a new holistic approach I didn’t expect. \\nAs a mom and a retired chiropractor, I appreciated Dr. Paul’s, a medical doctor, views on raising children as naturally as possible. \\nI am a firm believer in letting the body heal itself and doctors being only a tool to help the healing process when needed. So I appreciated Dr. Paul’s holistic advice on raising healthy children and not blindly following the usual allopathic methods. \\nUnfortunately, medical doctors often neglect to look at the whole body and the environment when treating patients, relying instead on potentially harmful drugs or unnecessary procedures. You can’t blame them since that’s how they were trained in medical schools and after their formal training they are pressured from the medical associations and pharmaceutical companies. \\nThe Vaccine-Friendly Plan is a classic case in point in applying the old saying, “Don’t judge a book by its cover,” as there’s so much more to the book than the title. \\nAnd if you’re a new mom, the information in this book will save you from sleepless nights and unnecessary late night phone calls to your pediatrician. So what is exactly “The Vaccine-Friendly Plan”? \\nWell, for one thing, Dr. Paul tries to make you understand the whole picture of what it takes to raise a child as healthy as possible. You, as a young parent, need to apply many aspects of a child’s internal and external environments and not just what doctors tell you or what the internet says. \\nTake the vaccine schedule, for example. There are genetics, environmental, and cellular differences that you have to consider. Just as what the CDC recommends can be harmful, even a flexible schedule can also be harmful if it’s applied to a “wrong” child. That’s why Dr. Paul lays out the health challenges a child may face and explains what his holistic recommendations are in dealing with those health conditions. \\nAnd because healthy immunity is the best way to fight any external assaults, as with diseases and vaccines, keeping your child healthy is the key to preventing diseases and vaccine injuries, regardless of what schedule you follow. \\nAnd to explain why you need to pay attention to toxins your child will be exposed to, he starts the book with the first chapter on toxins, toxins, toxins, and how you can help your child to avoid toxic contamination. \\nI found this chapter to be really helpful in helping new moms understand what the toxins mean and what they can do to a healthy person. \\nThe rest of the book covers developmental stages starting with pregnancy all the way up to the teen years, discussing various milestones, conditions, situations, and, of course, what vaccines are required and what Dr. Paul recommends you do and which you should avoid. \\nPhysical and mental statuses of each stage are discussed in each chapter, and the vaccine information is discussed at the end of each chapter with references. \\nEven general topics like “Car Seat Safety,” “Swim Safety,” and whether you should have a dog or not if you have a toddler are discussed in this book. \\nWhen I was a new mom, that kind of information would have been very helpful. The emphasis throughout is that keeping your baby healthy is a key to fighting any toxic contamination. So what does Dr. Paul say about vaccines specifically? \\nI knew Dr. Paul and Dr. Margulis were not anti-vaccine. At the same time, they are both strong and outspoken proponents of medical freedom , vaccine choice , and flexible and delayed scheduling in some cases. \\nDr. Paul mentions at the end of each stage which types of vaccines are usually recommended and why he doesn’t recommend certain ones. I don’t want to mention which ones because you have to read the book to get the full details, but I would have liked his recommended schedule to be even more flexible—perhaps not starting any vaccines until age two . \\nI also do not think it is safe to vaccinate if the child’s family has a history of certain diseases, like autism or MTHFR mutation. \\nThe reason I believe in this “flexible” schedule is that one of my closest friends has an autistic child. He is the older fraternal twin, and he was diagnosed with autism when he was about a year and half old. Personally, I believe this was a vaccine injury case, despite the mom’s refusal to believe that it was. In this case of twin brothers with same genes, one develops serious, low-functioning sensory issues with autism but his brother did not. \\nIt couldn’t have been just genetics. \\nHis symptoms started to show after one of their visits to the pediatrician. And despite his diagnosis, they continued to receive vaccine shots every visit. \\nObviously, I completely agree with Dr. Paul’s emphasis on autism when talking about vaccines because of my personal connection to autism but also because one out of forty-five children is diagnosed with this terrible condition that could be prevented. \\nHowever, I don’t believe vaccine injuries only manifest as autism but also as a myriad of other health problems like autoimmune diseases, allergies, eczema, and neurodevelopmental problems like ADD and ADHD. \\nI had hoped Dr. Paul would cover more referenced cases like these as I think the prevalence of those cases caused by vaccines is even higher than autism. Final Thoughts \\nThe Vaccine-Friendly Plan has 12 chapters on children’s developmental stages with vaccine information in the back of the chapters. It also has 9 appendices, including one that lists the vaccine schedule in 1983 and the schedule in 2016 (this was a shocker!), one that lists the ingredients in each vaccine, clinical data from Dr. Paul’s practice, how to file a vaccine reaction, references, aluminum information, and Dr. Paul’s vaccine schedule at a glance. It’s not as detailed with a bazillion references but it cites over 300 peer-reviewed articles in the blind endnotes, giving every reader enough information to help you understand the dangers of certain vaccine ingredients and possible triggers of vaccine injury. You can look up to research further if you want to. \\nThe Vaccine-Friendly Plan is an easy-to-read book on how to raise a healthy child despite vaccines, so don’t expect to learn just about vaccines. \\nBe ready to learn everything from what chemicals to avoid while pregnant to how to breastfeed to how to talk to your teenagers about alcohol and even intimacy. \\nAs a mom to grown children, I can see how this book can help new moms not to be overwhelmed while educating them so they can make informed decisions. \\nI wish I had this book when I was an anxious new mom, along with other books I read. \\nYou can never learn enough when it comes to the health of your child. \\nComment on this article at VaccineImpact.com . \\nSee Also :'"}, "time": 1742563765.9337006}