{"duration": 0.09486651420593262, "input_args": {"text": "'Las Vegas May Become the New Amsterdam 11/07/2016 \\nHIGH TIMES \\nNevada already has legal brothels, round-the-clock casinos and a coy catchphrase declaring that “what happens in Vegas, stays in Vegas.” If voters approve, the state could soon add another vice in the form of recreational marijuana. \\nA proposal on the Nov. 8 state ballot would legalize pot, and entrepreneurs hope its passage could someday allow the drug at Las Vegas’ glamorous nightclubs and perhaps provide the framework for a future Amsterdam-style cannabis district. \\n“I really think this would be the third-largest market in the country,” said Derek Peterson, whose company operates medical marijuana dispensaries called Blum. He predicts that only California and New York would offer a bigger customer base than Las Vegas and its 42 million tourists a year. “I think it should be able to fit in really well with the whole dayclub/nightclub thing.” \\nNevada has allowed medical marijuana since 2000, and Peterson sees recreational pot as an alternative for visitors tired of cocktails that can top $15 apiece and inflict hangovers. But before waitresses begin delivering high-grade marijuana at clubs along the Las Vegas Strip, weed proponents will have to win over not just voters, who narrowly support the initiative in polls, but a risk-averse casino industry. \\nThe Nevada Resort Association came out against the measure, pointing to an opinion from gambling regulators that casino owners should avoid the marijuana industry because the substance remains illegal under federal law. Las Vegas Sands owner Sheldon Adelson has bankrolled most of the opposition, pouring $2 million of his fortune into a campaign that raises the possibility that small children could become intoxicated from candy-like marijuana edibles. \\nAdelson also has contributed $1.5 million in Arizona and Massachusetts, a significant share of all anti-marijuana donations there. \\nAdelson, whose son died of a drug overdose and whose wife is a doctor specializing in drug addiction, has donated millions toward efforts to defeat medical marijuana proposals in Florida and other states in years past. \\nOther casino operators have joined the fray, but to a lesser extent. \\nIn spite of its libertine reputation, the rigorously regulated casino industry is known to err on the conservative side to avoid scandalizing the middle-aged tourists who are its bread and butter. \\n“I don’t know that this is a game changer in terms of tourism,” Virginia Valentine, president of the Nevada Resort Association, said of marijuana’s potential. “We’re really known for other things. You may attract people or turn them off.” \\nThe Las Vegas Convention and Visitors Authority, which promotes Sin City’s amenities to the world, is neutral on the issue. \\nClyde Barrow, a gambling expert who chairs the political science department at the University of Texas-Rio Grande Valley, suggests the donations may indicate the casino companies are acting in their own best interests. \\n“The marijuana industry is emerging as another form of recreation and entertainment. Given the casino industry’s difficulties attracting millennials, marijuana is probably perceived as a direct competitor with casinos for entertainment dollars,” he said. “Another reason is that legalized marijuana competes with alcohol, and, to that extent, competes with the food and beverage sales at casinos.” \\nThere’s no solid state-sponsored research on how legal recreational marijuana has affected tourism in places that have legalized it, although both sides point to Colorado to make their case. \\nPro-marijuana interests cite a state study that found Colorado set an all-time tourism record in 2015, capping a fifth year of growth. It’s unclear how much of that is due to weed, and how much can be chalked up to other factors, such as good snow in recent years relative to competing ski states. \\nMarijuana opponents refer to a report from the Visit Denver tourism bureau that logged increasing complaints about panhandling and open marijuana consumption in the city’s downtown corridor. \\n“Denver is losing visitors and valuable convention business as a result of these overall safety (or perception of safety) issues,” the report said. “We fear not being able to brand Denver away from this growing reputation.” \\nNevada’s ballot initiative would not allow municipalities to put blanket bans on marijuana, as Colorado does. But it would bar consumption in buildings that are open to the public and permit local governments to restrict the locations of marijuana dispensaries and related businesses. It effectively blocks people from growing their own by banning the practice within 25 miles of a licensed marijuana store.'"}, "time": 1742563581.4636886}