{"duration": 0.07656598091125488, "input_args": {"text": "'\\n“Hail Hitler” and “Heil Victory” – do they eerily sound the same? It’s because it is. Alt-Right groups are performing Nazi-like salutes for President-Elect Donald Trump. What is the Alt-Right? \\nThe Alt-Right consists of white supremacist groups most likely composed of college-educated white men upholding the superiority of their skin color and believing in every right-wing propaganda. \\nSuch groups have gone almost extinct under President Obama’s administration, reduced to a few sites and pages on social media. However, they surfaced with renewed vigor after Donald Trump’s victory in the 2016 elections. \\nTheir leader, Richard B. Spencer, emerged as something of a wannabe Adolf Hitler and is calling for his followers to take back the U.S. as theirs. \\nRead Also: Russia Bombs Syria After Putin Speaks With Trump \\nOn November 20, a crowd of people gathered in front of the Ronald Reagan pavilion in Washington to listen to Spencer’s speech. \\nAfter quoting the Nazi propaganda in German, Spencer called the assembled white people “children of the sun.” In his speech, he expressed the central idealism of the group – that white-skinned Americans were born to conquer, not follow. \\nThe speech concluded with shouts of “Heil the people! Heil victory!” The people had their arms stretched out in front of them, reported the New York Times . \\nThere was little doubt as to what Spencer meant when he reiterated the belief that white-skinned Americans should not live in the shadows anymore. That the time had come for their “awakening to their own identity.” \\nRead Also: US, Syria, Russia And Iran International Relations Improving After Donald Trump Win Donald Trump Cabinet \\nDuring his Presidential campaign, Trump’s demeanor and discourse were equated with the most notorious leader of all time, Hitler. However, after his victory, his cabinet choices are leaving little to the imagination. \\nTrump has picked Steve Bannon, founder of the Breitbart website, to be his strategist. Breitbart is widely known to to be a platform for alt-right news. \\nWhat’s more, Richard Spencer expressed that he is looking forward to Bannon shaking things up in the White House. \\nThe U.S. Holocaust Memorial Museum vehemently condemned the “hateful rhetoric” spreading throughout the nation. \\nRead Also: Mike Pence Upholding Torture For Interrogation Under Donald Trump Administration? \\n“The Holocaust did not begin with killing, it began with words,” said the museum in a statement, reported Business Insider . “The Museum calls on all American citizens, our religious and civic leaders, and the leadership of all branches of the government to confront racist thinking and divisive hate speech.” Nazi-Like Salute For Trump \\nThere are other instances of alt-right supporters celebrating Trump’s victory in a Nazi-esque fashion. \\nA restaurant called Little Italy in Washington D.C. recently issued an apology for mistakenly hosting a banquet for a group called National Policy Institute (NPI), reported CBS News . Apparently, the group had tweeted a photo of some of their members giving a Nazi-salute to Donald Trump . \\n“This expression of support of Hitler is extremely offensive to us, as our restaurant is home to Teammates and Guests of every race, religion and cultural background,” said the restaurant on its Facebook page . \\n“We want to sincerely apologize to the community of Friendship Heights for inadvertently hosting this meeting, which resulted in hateful sentiment,” it added. ICYMI! A restaurant unintentionally hosted a white supremacist dinner that included #TilaTequila ! https://t.co/jnVdtUUKkr pic.twitter.com/f6sdPCwVpS '"}, "time": 1742562340.6178682}