{"duration": 0.18573617935180664, "input_args": {"text": "'The Miami Herald stated that the Human Rights Campaign (HRC) endorses Hilary Rodham. Clinton. The organization is also the largest LGBTQ political group. The HRC has endorsed Hillary Clinton in the 2016 election.\\nTheir new video advertisement features Clinton’s pledge to fight for the LGBT community’s equality. The ad was also released days before the election on Nov. 8.\\nThe video titled “Hillary Clinton: Equality Is About Changing Hearts And Minds,” was released in Washington D.C., which is the HRC headquarters are located.\\nThe organization has a section of their website dedicated to the group’s endorsement of the candidate. The HRC also stated that Clinton has stood with the LGBTQ community and the group will now stand with Clinton. The HRC concluded by saying that Clinton’s fight is with the community and that what the HRC advocates.\\nThe HRC President Chad Griffin said that Clinton has shown through her words and actions that she is dedicated to fighting for the rights of the LGBT community. He also stated that all of the progress the community has made is at stake in the 2016 Presidential election as the HRC has endorsed a candidate in the 2016 election.\\nGriffin then continued to state that Donald Trump’s campaign is filled with hateful language that will reverse the LGBTQ movement’s gains. He also said that Clinton will tear down the walls of bigotry against people of alternative lifestyles. The HRC leader concluded by saying that it is very important that people who are pro-equality voters for Clinton in the next presidential election.\\nBreitbart stated that an artist from the Art Wing Conspiracy group said a lot of Trump supporters, especially amongst the LGBT community, are “in the closet.” The artistic group has painted several Think Different posters across the city of San Francisco near the offices of Twitter and Clinton’s campaign headquarters. The posters feature a rainbow Apple logo with a silhouette of Trump’s face on it. They were released on National Coming Out Day.\\nThe Art Wing Conspiracy artist also stated that on National Coming Out Day the organization encourages people to “stop living a lie and come out.” He conveyed this idea, in a voting booth, i.e. a closet, no one has to know who supports Trump or Clinton.\\nThe artist also said that the liberal community in San Francisco must know that there are many Trump supporters amongst the city’s LGBT community. The individual stated that having pride means to be true to oneself and one’s beliefs, even if it is against the mainstream. The artist concluded that is what the LGBT rights movement conveys.\\nThe Stonewall Inn’s website stated that the historic inn was the birthplace of the historic LGBT rights movement. The patrons of the club retaliated against harassment from the local police department. Subsequently, a riot occurred on June 28, 1969.\\nThe website also claimed that the patrons refused to accept the status quo of oppression for the first time. They then stood up for each other and the whole LGBT community.\\nThe site continues to state that the riot at the Stonewall Inn sparked the lengthy battle for all members of the Gay and Lesbian community. The incident is often referred to as the Rosa Parks incident of the LGBT community. The site then stated that the incident led the government and society, in general, to look at members of the LBGT community as equals.\\nIn 1969 the police raided gay clubs regularly. Eight police officers arrived at the Stonewall Inn on a Saturday morning at 1:20. Approximately 200 people were in the establishment that night. However, the raid was not conducted as planned. The patrons did not cooperate, resulting in the riot that led to the LGBT rights movement of the 1970s, which is why the HRC now exists and has endorsed a candidate for the 2016 election.\\nBy John A. Federico\\nEdited by Cathy Milne\\nSources:\\nMiami Herald : LGBTQ group Human Rights Campaign (HRC) releases video supporting Hillary Rodham Clinton (HRC)\\nBreitbart: Rainbow Trump Posters Appear in San Francisco on ‘National Coming Out Day’\\nThe Stonewall Inn: THE HISTORIC STONEWALL INN\\nFeatured Image Courtesy of Mobilus In Mobili’s Flickr HRC , HUman Rights Campaign'"}, "time": 1742563946.9726834}