{"duration": 0.17087316513061523, "input_args": {"text": "'By Jonas E. Alexis on October 30, 2016 What if China, Malaysia, the Philippines, and Russia end up forging an alliance, since they all realize that they have a common enemy? Would that be good news for the New World Order? In order to deal with Soros, Malaysian officials need to give Vladimir Putin a call. …by Jonas E. Alexis \\n\\nGeorge Soros has again shown that Jim W. Dean was right all along. Soros, Dean says, “ refuses to die and join his victims.” Soros, Dean moves on to declare, has been involved in the “the age-old pump-and-dump stock manipulation scam” for quite a while. \\nAs we have argued elsewhere, Soros was involved in destroying the Russian economy in the 1990s. But he has created other covert activities as well. He was behind the Black Lives Matter movement . He wants to flood Europe with so-called refugees from virtually all over the Middle East while remaining silent about US officials supporting terrorist organs in Syria. In short, Soros still wants to move and shake the world. \\nSoros has recently turned his attention to Southeast Asia. He wants to taste economic blood in that region. He has been in that part of the world before. And government officials know him pretty well. \\nPrime Minister Mahathir Mohamad of Malaysia declared back in 1997 that for people like Soros, “wealth must come from impoverishing others, from taking what others have in order to enrich themselves. Their weapon is their wealth against the poverty of others.” [1] The New York Times reported then: “Mr. Mahathir specifically blamed Mr. Soros for orchestrating Malaysia’s economic crisis—he told the assembled bankers and economists that Mr. Soros’s ilk had to be stopped.” [2] \\nMahathir said: “I am saying that currency trading is unnecessary, unproductive and totally immoral. It should be stopped. It should be made illegal. We don’t need currency trading.” [3] \\nMahathir was trying to articulate that rapacious usury is antithetical to the moral order and is therefore to be avoided. He has witnessed what usury, through “crony capitalism,” has done and how it precipitated the economic crisis in much of Asia, most specifically in South Korea and the Philippines. [4] The same “currency” has brought down economic progress in places like Thailand and Indonesia, where was a drastic decline in income. One scholar noted: \\n“ The enormity of the shock is captured by the fact that in the worst-affected countries real GDP growth has turned abruptly from over 7 per cent per annum to negative. In Thailand growth fell from 6 per cent in 1996 to almost zero in 1997, with all the decline concentrated in the second half of that year, and has fallen by at least a further 5 per cent in 1998. In Indonesia the corresponding swing is from 8 per cent growth up to the third quarter of 1997 to an absolute decline of 15 per cent in 1998… \\n“These huge aggregate income shifts were the result of a financial crisis reflected in precipitous currency devaluations and falls in equity prices. Currencies depreciated by up to 80 per cent in the worst case (the Indonesian rupiah) while equity and other asset prices fell by 50 per cent or more in the worst-affected countries. \\n“The key factor behind this currency and stock market collapse was a massive reversal of foreign capital flows. It has been estimated that for Indonesia, the Republic of Korea, Thailand, Malaysia and the Philippines net private inflows dropped from US$ 93 billion to 12 billion – a swing of 11 per cent of GDP between the end of 1996 and the end of 1997.” \\nMany countries in Asia were basically following capitalism by that time, and it was no accident that they had a huge debacle by 1997. [5] Mahathir, in that sense, was trying provide a response to that debacle. Soros didn’t like what Mahathir said because Soros is a capitalist and wanted to rip people in Southeast Asia off their labor. He fired back at Mahathir by saying: \\n“Dr. Mahathir’s suggestion yesterday to ban currency trading is so inappropriate that it does not deserve serious consideration. Interfering with the convertibility of capital at a moment like this is a recipe for disaster. Dr. Mahathir is a menace to his own country.” [6] \\nMahathir seemed to have learned his lesson. By 2003, he created a storm of controversy by saying that “The Jews rule the world by proxy. They get others to fight and die for them.” [7] \\nSome have said that Mahathir was promoting violence against Jews, but that itself is false. If a person says that the Japanese bombed Pearl Harbor, it does not necessitate the illogical idea that every single Japanese person is responsible for Pearl Harbor at all. Mahathir was making a general claim, and many Jews, including Henry Makow, agreed with him. Elias Davidsson of Jerusalem concurred as well. He said: \\n“As a Jew myself (but opposed to Zionism) I need no encouragement from Malaysain PM Mahathir Mohammed to observe what should be obvious to the blatant eye: Namely that Jews effectively rule US foreign policy and thus determine to a great extent the conductof most countries… \\n“So it is with the proposition that Jews control the world. Surely the do not control every single action; surely it does not mean that every Jew participates in the ‘control.’ But for all practical purposes the proposition holds. \\n“Mahathir has neither asked to discriminate against Jews, let along to kill Jews. It is shameful to equate him to the Hitlerites.” [8] \\nMahathir added elsewhere that “a U.S. dominated IMF was ‘trying to change the Asian system.” [9] Obviously that “U.S. dominated IMF” was in concert with capitalism, which has been refined in the twenty-first century by people like Milton Friedman. [10] \\nBut Mahathir probably wouldn’t expect Soros to come back to Southeast Asia for round two. It has been reported that Soros is looking for a “color revolution” through his Open Society Foundation in Malaysia because he seems to think that there is a lack of “constitutional democracy.” [11] Like Rodrigo Duterte, Malaysian Prime Minster Najib Razak has recently been trying to build an alliance with China: “Malaysian Prime Minster Najib Razak heads to China next week to build closer ties and seek investment, which may further dent US aims in Southeast Asia after a push by President Rodrigo Duterte of the Philippines to bolster China ties.” [12] \\nObviously this is not good news for New World Order agents at all. It gets worse: “Both Malaysia and the Philippines have long been in dispute with China over the South China Sea. However, Kuala Lumpur may follow in the footsteps of Manila, seeking to ease tensions with Beijing in exchange for economic benefits.” [13] \\nSoros again does not like that, and this might be one reason why he declared that “There is no Business like the Revolutions Business.’” Mathew Maavak of Risk Foresight at Universiti Teknologi Malaysia (UTM) comments: \\n“NGOs and the West-friendly media constitute a major subsidiary of the global social revolutions enterprise. Together, they seek out, identify and amplify public discontent in nations not aligned to the United States. \\n“Such US-engineered activisms have never led to more equitable societies; rather they have engendered endless bloodshed and global terrorism. To the agitprop entrepreneur, the returns on revolutionary investments are immense. \\n“A wealthy hedge fund manager can short a targeted market before executing a pre-planned ‘revolution.’ The resultant stock market and currency meltdown would provide self-evidentiary ‘proof’ to an anxious public, exerting more pressure on the government of the day to either capitulate or concede to ‘popular demands’ that are actually drafted abroad, likely by the IMF!” [14] \\nMaavak, like other experts in Asia, are well aware that Soros was behind the economic crisis in 1997. He writes, “The entire region was in turmoil, and the name of George Soros featured prominently in this sordid saga. The ‘Reformasi’ [protest] movement led by sacked [Malaysian] Deputy Prime Minister Anwar Ibrahim — who had close to ties to Washington hawks — failed to topple the government of the day.” [ 15] \\nPerhaps Malaysia needs to do what China and Russia did: they need to kick Soros out of for good. Or perhaps they need to give Vladimir Putin a call and ask him how he did it. But what if China, Malaysia, the Philippines, and Russia end up forging an alliance, since they all realize that they have a common enemy? Would that be good news for the New World Order? \\nI guess US Deputy Secretary of Defense Bob Work has good reason to say: ““Our adversaries [Russia], quite frankly, are pursuing enhanced human operations and it scares the crap out of us.” [16] \\n[1] Edward A. Gargan, “Premier of Malaysia Spars With Currency Dealer,” NY Times , September 22, 1997. \\n[3] Ibid. \\n[4] For further studies on this issue, see David C. Kang, Crony Capitalism: Corruption and Development in South Korea and the Philippines (Cambridge: Cambridge University Press, 2002). \\n[5] See Helen Hughes, “Crony Capitalism and the East Asian Currency Financial ‘Crises,’” Policy , Spring 1999. \\n[6] Gargan, “Premier of Malaysia Spars With Currency Dealer,” NY Times , September 22, 1997. \\n[7] Quoted in E. Michael Jones, The Jewish Revolutionary Spirit and Its Impact on World History (South Bend: Fidelity Press, 2008), 1064. \\n[8] Ibid., 1064-1065. \\n[9] Paul Blustein, The Chastening: Inside the Crisis That Rocked the Global Financial System and Humbled the IMF (New York: Public Affairs, 2001 and 2003), 164. \\n[10] For a historical study on these issues, see E. Michael Jones, Barren Metal: A History of Capitalism as the Conflict Between Labor and Usury (South Bend: Fidelity Press, 2014). \\n[11] “Leaked Memo: Is Soros Planning ‘Series of Color Revolutions’ in Southeast Asia?,” Sputnik News , October 28, 2016.'"}, "time": 1742561905.9504263}