{"duration": 0.07193565368652344, "input_args": {"text": "'MEXICO CITY  —   When the pop singer Natalia Lafourcade stepped onto the stage of National Auditorium here last fall, it was a high point of a career that began more than 10 years ago, when she performed in   attire. But for this concert, Ms. Lafourcade eschewed the ripped jeans. Instead, she wore pants from a Mexican designer and a crown of red roses, paying homage to the artist Frida Kahlo. Halfway through the show, she was joined by a band playing jarocho, a style of folk music from Veracruz. “It was time to connect back with my origins,” said Ms. Lafourcade, 32. “I wanted to infuse my music with Mexican character. ” In a country that is struggling with pressing social, economic and political challenges yet possesses a rich cultural heritage, many emerging artists and trendsetters no longer feel compelled to look abroad for inspiration. “Foreigners love our people, our beaches, our pyramids, our food,” said Israel Gómez, a member of the     band Centavrvs. “It was about time we started to value ourselves the same way people do abroad. ” While Mexico had a moment of cultural bonanza in the early 20th century, the recent shift among young artists reflects a broader change underway. Even as talk of a border wall dominates the regional conversation, and corruption continues to plague the government, Mexico’s stature is growing in cuisine, culture, design and art. Mexicans can now talk about their own   filmmakers, international art shows or breakout chefs. “The influence of Mexican culture in art and fashion is quite strong, and there is this new generation of young Mexicans, either there or abroad, that are pushing that message forward,” said Roopal Patel, the fashion director of Saks Fifth Avenue. The artist Edgar Flores, known as Saner, drew on Mexico’s complex colonial history for a huge mural he completed in 2013 in    France, depicting a deadly embrace between an Aztec warrior and a Spanish conquistador. Mr. Flores said the work was “a desperate cry” to preserve and redefine Mexican identity, a fragile concept that for him “could otherwise be easily lost” if more Mexicans do not value their own culture and history. “In a globalized world where you belong to everywhere and nowhere, I hold on to my roots to know who I am, what I want to say and where am I heading,” he said in a recent interview in his Mexico City studio. Mr. Gómez of Centavrvs said his band, inspired by a nickname for Pancho Villa, the revolutionary folk hero, was seeking to unearth that same heritage. The band combines the sounds of traditional cumbia and ranchera music, weaves the voices of an indigenous Michoacán women’s chorus into Mexican pop songs and includes fragments of old Mexican poems or novels in some of their lyrics. “Our music is the result of a ‘new’ Mexico completely inspired in the old one,” Mr. Gómez said. “It has to do with who we are today, and being proud of it, taking our roots and telling the world about all that ‘Mexicanity. ’” The resurgence of interest in Mexico’s cultural heritage is particularly evident in fashion circles here. Local designers and consumers have shed their fears of being too ethnic and are now embracing indigenous textiles and crafts long considered to be of interest only to American tourists looking for souvenirs. In many countries, an initial exhilaration over seemingly endless consumer choices has faded, replaced by a yearning for authenticity and deeper connections to goods and cultural legacies. “The elation of buying Philippe Starck design pieces at Target soon turned to the feeling that nothing sacred was left, no uniqueness,” said a New York art historian, Maggie Galton, a founder of Onora Casa, a luxury design brand in Mexico City that works with traditional textiles. “People now want their   bedspread, they want their product to be pretty but also with identity, a history and a time invested in it,” Ms. Galton added. And even though the fashion scene here is yet to reach its potential, the awareness and inspiration wave seems to be in full motion, as creative people here are tapping into this thirst for authenticity, while stirring feelings of pride and empowerment. “We are offering something the world is looking for, which is awareness of the place your product comes from, how and who made it,” said the fashion designer Francisco Cancino, whose Yakampot brand mixes sophisticated, minimalist ideas with traditional and artisanal designs to create indigenous garments like the rebozo, or shawl. Yakampot’s designs can be found on the luxury shopping website Luisa Via Roma and in cities like Florence, Italy.   fashion powerhouses are also looking to Mexico for inspiration, adding bits of modern and ancient Mexican culture into their haute couture designs. In the 2015 spring collection of the French designer Jean Paul Gaultier, for instance, the towering models wore masks inspired by the colorful, fearsome ones favored by Mexico’s lucha libre professional wrestlers. Also last year, the Japanese label Comme des Garçons showcased guarachero boots  —   impossibly long, pointy boots that originated in northern Mexico and are celebrated in the “tribal guarachero” music culture. But as more companies and designers find market opportunities by mining Mexican traditions and techniques, concerns are rising over when inspiration crosses over into cultural appropriation and theft. Last fall, the designer Isabel Marant was accused of plagiarism because a blouse in her collection closely resembled the embroidered clothes produced by the indigenous Mexican women of Santa María Tlahuitoltepec. Ms. Marant’s office rejected the accusations. Similarly, in April, a petition surfaced to prevent Pottery Barn from selling   pillowcases labeled “Otomí embroidered” because they were not made in the Otomí region. Mining Mexico’s heritage has allowed some designers to redirect their careers. Mr. Cancino, the Yakampot designer, grew up, like many others here, with the idea that professional success could be achieved only abroad. So he packed his bags and left his home in the southern state of Chiapas for Paris. Feeling out of place, he asked himself how could he create a contemporary, sophisticated clothing line that would be embraced by fashion lovers around the world. “The simple answer is if you found your project’s identity in your own culture, with its traditions and techniques, something really authentic and valuable comes from it, and people will appreciate it,” Mr. Cancino said. Yet for others, embracing and redefining Mexican identity means stepping away from the clichés and stereotypes associated with their country and exploring other aspects of their culture and society. When the filmmaker Alonso Ruizpalacios set his 2014 feature film, “Güeros,” in the Mexico City of 1999, he chose to emphasize the simmering class conflict and seething political contradictions of the capital, avoiding the more common themes of drug crime and violence. “There was the idea that to be truly Mexican, you had to be or make folklore,” Mr. Ruizpalacios said. “Now the conversation is shifting, the ideas are becoming more complex. ”'"}, "time": 1742628456.0485682}