{"duration": 0.10988211631774902, "input_args": {"text": "'41 Days And 8 Months Later: Dissecting The Oregon Standoff Trial 10/31/2016 \\nOPB \\nIn the shadow of trees covering Chapman Square park in downtown Portland, four of seven defendants acquitted of conspiracy in the occupation of the Malheur National Wildlife Refuge posed for pictures. \\nDavid Fry smiled as he flashed a peace sign. He slung his arms around co-defendants Neil Wampler — clutching a hotdog from the victory barbecue and a stack of newspapers with his face on them — and Shawna Cox. Jeff Banta stood to the far right. An alternate juror named Sarah Foultner stood between them while a supporter cycled through phones to capture the moment for everyone. \\nThe prosecution didn’t picture the trial ending like this. \\n“Disappointing,” said U.S. Attorney for Oregon Billy Williams of the not guilty verdicts. “Bitterly so.” \\nJust as quickly as the defense proclaimed a victory for rural America, occupation opponents dubbed the result an embarrassing loss for the prosecution. And supporters of other movements — #BlackLivesMatter and #NoDAPL to name two — wondered aloud about the meaning of justice. \\nBut 41 days and eight months later, the leaders of the armed occupation in eastern Oregon were found not guilty by a jury of peers. \\nStill, questions remain: How did it happen? And what happens next? Ammon Bundy Hometown: Emmett, Idaho NOT GUILTY \\nLeader of the Malheur refuge occupation. Before Oregon, Ammon Bundy was less prominent than his siblings in protesting the federal government. Ryan Bundy Hometown: Cedar City, Utah NOT GUILTY \\nEldest of Nevada rancher Cliven Bundy’s 14 children. Worked alongside his brother, Ammon Bundy, as a leader of the Malheur occupation. The Charges \\nAmmon Bundy, Ryan Bundy and five others were charged with conspiracy to impede federal employees from doing their jobs by force, threat or intimidation. \\n“It’s a favorite charge of prosecutors,” said Portland defense attorney Kevin Sali before the trial began. “When people are involved in a conspiracy they can be liable … for things their co-conspirators did.” \\nThe Bundys, Fry, Banta and Cox also faced weapons charges. (Prosecutors dropped those against Cox .) Ryan Bundy and Kenneth Medenbach were also charged with theft of government property. Internet radio show host Pete Santilli also faced a conspiracy charge but it was later dropped . \\nThe jury found the defendants not guilty on all but one charge. They failed to reach consensus on Ryan Bundy’s theft charge stemming from the removal of government surveillance cameras at the refuge. \\nIn light of the verdict, questions swirled about whether the prosecution brought the proper charges. \\nWilliams, the U.S. Attorney for Oregon, said prosecutors could have brought criminal trespass charges and tried the occupiers in state court. But misdemeanor trespassing didn’t seem to pass for muster — prosecutors wanted to bring felonies. \\n“If there had been some other federal statute that specifically addresses the conduct, we would have considered using it,” Williams said in an interview with OPB’s Amelia Templeton . “We have and still believe we brought the most applicable and appropriate charges under the evidence, which is our duty.” A watch tower at the Malheur National Wildlife Refuge. Andy Dunbar, a rancher who lives adjacent to the refuge, explained his view of the occupation in court. Amelia Templeton/OPB The Prosecution \\nSome described the prosecution’s case as a “slam dunk.” In basketball, a slam dunk is a show of force. \\nMike Arnold, Ammon Bundy’s previous attorney, told OPB’s Anna Griffin he thinks the prosecution brought felony charges to make a powerful statement with “serious prison time.” \\n“Their goal is to prevent any sort of activity like this in the future from the actual defendants themselves and other like-minded folks,” Arnold said. \\nProsecutors brought mounds of evidence to the table — sometimes literally, like when they brought a large display of firearms and ammunition into the courtroom. \\nAnd rarely did defendants dispute the facts of the case. They admitted to illegally taking over a federal facility, even to bringing their arms. \\n“It didn’t bother me to be arrested because I’m where I want to be right now,” Medenbach said on the stand . “Like the Bundys, I’ve been called by a higher power … we all know this is what God called us to do.” \\nBut prosecutors missed the dunk. And just like in basketball, a missed dunk in the courtroom can be humiliating. \\nJuror No. 4 — who earlier sparked a fellow juror’s dismissal by questioning his impartiality — wrote the Oregonian/OregonLive saying the prosecution came off as arrogant in its case. \\n“The air of triumphalism that the prosecution brought was not lost on any of us,” the juror wrote. \\nThe prosecution moved through its case quickly. Prosecutors rested after 13 days. They cross-examined Ammon Bundy for just 15 minutes . Their closing argument lasted less than two hours. \\nWilliams admitted the hurry with which prosecutors prepared their case may have hurt it. He called the legal timeline “extraordinary.” \\nThe prosecution focused heavily on the occupiers’ intent behind the refuge takeover. But the jury ultimately determined the prosecution failed to prove impeding federal employees was the occupiers’ goal — even if the occupation actually did impede employees. The Defense \\nMatt Schindler, Medenbach’s hybrid counsel, delivered a thunderous closing argument on Oct. 19. \\nThe charge all seven occupiers faced was conspiracy to impede federal employees from doing their jobs by threat, force or intimidation. \\n“I just sat through five weeks of a trial about threatening federal employees without hearing a single threat,” Schindler said in his closing argument. \\nThe defense tried to make its case bigger than the Bureau of Land Management and U.S. Fish and Wildlife employees in Harney County. \\nFive defendants ended up taking the stand, speaking at length about the U.S. Constitution, land management, divinity, and the 2014 standoff in Bunkerville, Nevada. Ryan Bundy questioned his wife on the stand. David Fry giggled when prosecutors asked him about using government computers. Medenbach reveled in the glory of public testimony after decades of protesting the federal government. \\nIn their closing arguments, defense attorneys attempted to instill into the jurors a sense of political responsibility. \\n“We’re counting on you to stop government overreach,” Marcus Mumford, Ammon Bundy’s attorney, told the jury. “Our trust is in you.” \\nA jury found seven defendants charged in the occupation of the Malheur National Wildlife Refuge not guilty, following a trial that lasted several weeks. The Verdict \\nDefense attorneys expressed shock at the verdict; even they did not expect such a result. It came despite scrutiny from U.S. District Court Judge Anna Brown and prosecutors for lack of organization . \\nDefendants and their supporters erupted into tearful celebration outside the federal courthouse in downtown Portland (and streamed it live online, just like much of the occupation). \\n“We came to Oregon — to Harney County — seeking justice,” defendant Neil Wampler said after his acquittal, “and today we found it.” \\nBut despite defendants’ and supporters’ cries of victory, Juror No. 4 wrote in his letter to the Oregonian that the verdict was not an endorsement of the occupiers’ political beliefs. \\n“It should be known that all 12 jurors felt that this verdict was a statement regarding the various failures of the prosecution to prove ‘conspiracy’ in the count itself — and not any form of affirmation of the defense’s various beliefs, actions or aspirations,” the juror wrote. \\nDefendants and their supporters celebrated a not guilty verdict in the trial of seven people involved in the occupation of the Malheur National Wildlife Refuge. The Celebration \\nThe mood was jubilant among occupiers and their supporters, who grilled, milled and posed for cameras in downtown Portland on the Friday following the verdict. \\nMany people have said they fear the verdict will embolden defendants and their supporters. Cox and Fry both said they would participate in protests like the Oregon Standoff again. \\n“If I have a compelling urge to come out here to join a protest, if I think it’s a legitimate reason to come, I’ll absolutely protest,” Fry told OPB. Teressa Raiford speaks at a Don’t Shoot PDX-organized rally on Portland State University’s campus. Bradley W. Parks/OPB \\nThe reaction was different just a few blocks away. \\nDon’t Shoot PDX, a Portland activist group supportive of the Black Lives Matter movement, was holding what was supposed to be a rally, unrelated to the trial, at Portland State University. \\n“I don’t know how I can keep telling people to protest,” lead organizer Teressa Raiford told the crowd. Raiford seemed exhausted. \\nThe occupiers’ acquittal came the same day more than 100 protesters in North Dakota were forcibly removed from the construction site of the Dakota Access Pipeline and arrested. It came weeks after Don’t Shoot PDX protesters were pushed out of City Hall and pepper-sprayed by Portland police. \\nRaiford expressed anger at having to discuss the Malheur trial verdict. She and countless others on social media highlighted what many see as a double-standard in how law enforcement and the justice system punish people of color. With the exception of David Fry, defendants in the occupation case were all white. All jury members were also white. \\n“Forty-one days at a compound on federal land,” Raiford said, pointing to weapons at the refuge, occupiers’ refusal to leave, and threats made by occupiers against the FBI. \\n“The difference is we would have been murdered,” Raiford said. \\nJarvis Kennedy, of the Burns, Oregon, Paiute tribe told OPB’s Amanda Peacher he was angry with the verdict. Kennedy and the Paiute tribe have been vocal opponents of the Malheur occupation from the start. However, Kennedy added he was now more motivated to fight for Native lands and rights . \\nDon’t Shoot PDX eventually marched past the occupation supporters’ barbecue Friday, where they staged a die-in near the courthouse steps and burned an American flag . \\nAfter a brief shouting match, Bundy supporters went back to the grill and Don’t Shoot PDX continued to City Hall. A member of the Pacific Patriots Network at the Malheur National Wildlife Refuge in January. Many wonder if the verdict in the Oregon occupation trial will embolden militia groups to take up armed land battles throughout the West. Dave Blanchard/OPB The Implication \\nAmmon and Ryan Bundy are still in federal custody, despite an animated effort by Marcus Mumford to win his client’s release upon receiving the verdict. \\nAfter arguing with Judge Brown for Ammon Bundy to be let go, Mumford was tackled by U.S. Marshals, allegedly tased, briefly detained and later released. \\nThe Bundy brothers still face charges for the 2014 standoff in Bunkerville led by their father, Cliven Bundy. \\nSeven Oregon occupiers still await trial in February, though the status of those proceedings could be in limbo. \\nShawna Cox called Thursday’s outcome “just one win” in a larger movement to change how the federal government manages land in the American West. \\nU.S. Attorney Billy Williams seemed to hope more people would shun the Bundys’ form of protest. \\n“There are a good number of folks in rural America who are of the mind that you don’t take arms and take over a federal facility to prove your point,” Williams said. \\nThe Oregon verdict will certainly color the conversation around the impending trial in Nevada. The result there — where the penalties for alleged crimes are slightly more harsh than Oregon — has the potential to make even bigger waves in the so-called patriot movement . \\nBut occupiers and their supporters cooking out in downtown Portland took heart in the Oregon verdict and envisioned a long fight ahead of them on behalf of rural Americans. \\nUnder downtown shade-trees, defendant Jeff Banta approached supporter David Zion Brugger, who decorated his hat and shirt with “NOT GUILTY” buttons, and shook his hand. \\nIn a hushed voice, Banta said, “See you down the road.” Share On:'"}, "time": 1742628474.1713145}