{"duration": 0.08044934272766113, "input_args": {"text": "'The airbag maker Takata on Friday settled a closely watched lawsuit involving the injury and eventual death of a woman whose car crashed in 2014. The settlement was announced moments before a critical hearing in which a judge in Jacksonville, Fla. could have ordered the company’s chief executive, Shigehisa Takada, to testify in the case. Even the lawyer representing the family of the victim, Patricia Mincey, said the sudden turn of events was unexpected. “I had no expectations at all” of a settlement, said the lawyer, Theodore J. Leopold, of the plaintiffs’ law firm Cohen Milstein in Washington. “We were preparing to go to trial. ” But Takata, whose airbags have been linked to at least 14 other deaths and more than 100 injuries, has been keen to keep Mr. Takada, a grandson of the company’s founder, out of the spotlight and away from depositions. Takata’s airbags can rupture when they deploy in a crash, shooting metal fragments toward the driver or passengers. The defect has prompted 14 automakers to recall more than 60 million vehicles in the United States and millions more overseas. Ms. Mincey was paralyzed from the neck down after the Takata airbag in her 2001 Honda Civic forcefully inflated after a collision on June 15, 2014. The airbag was among those recalled by Honda less than a week later. Ms. Mincey alleged in her lawsuit, filed the following year, that Takata had knowingly designed and manufactured airbags that were defective and dangerous. She died in April at the age of 77 from complications from her quadriplegia. “The matter has been resolved to the satisfaction of all parties,” Robert Rendine, a Takata spokesman, said on Friday. Neither side would disclose a settlement sum. Takata has generally been quick to settle other cases in which its airbags were blamed for deaths and injuries. But the company had resisted settling Ms. Mincey’s case, because her airbag did not rupture. Instead, it deployed forcefully, crushing her spine, her complaint alleged. In the course of months of pretrial hearings, Takata was forced to hand over thousands of pages of internal documents that pointed to the faking of test results by its engineers,   calculations of potential recall costs and an early understanding of potential safety risks. About a dozen Takata officials were deposed. In a series of congressional hearings on the issue, Takata has been represented by Hiroshi Shimizu, its top product safety official, and Kevin Kennedy, its executive vice president in North America. But the company has continued to shield Mr. Takada, whom company documents have shown was aware years ago of a possible widespread defect in Takata airbags. Mr. Takada said last month that he would step down, but the timing of his departure, and who will succeed him, remains unclear. The airbag defect involves propellants, or explosives, that help inflate airbags in microseconds. Takata’s propellant degrades over time when it is exposed to moisture and temperature fluctuations, which can cause its metal casing to overpressurize and rupture. According to minutes of a meeting at Honda’s American headquarters in Torrance, Calif. unsealed as part of Ms. Mincey’s case, a Honda official pressed Mr. Takada on the extent of the defect in  . “I am constantly worrying how far it spreads out,” Hidenobu Iwata, the Honda official, told Mr. Takada and other Takata executives at the meeting, according to the minutes. “I want you to study the reason quickly. ” An engineer identified only as Otaka pressed Takata on the reasons for the defect. “Why does the propellant deteriorate with age? Why does it explode? I want to know the truth. ” Ms. Mincey had also sued Honda initially, but reached a separate settlement with the automaker.. The mass recalls of Takata airbags gained new urgency last month, when federal safety regulators warned that airbags in more than 300, 000 older Honda and Acura vehicles were at an unacceptably high risk of exploding and needed to be replaced immediately. Takata also faces a   lawsuit brought by owners of affected cars and is the subject of a criminal investigation by the Justice Department.'"}, "time": 1742561827.659886}