{"duration": 0.04828906059265137, "input_args": {"text": "'. 17 Year Old Indigo Child Message to the New Children and Lightworkers For thousands of years the ancients have predicted great changes ahead for this planet. The Mayans ... http://humansarefree.com/2016/11/17-year-old-indigo-child-message-to-new.html For thousands of years the ancients have predicted great changes ahead for this planet. The Mayans anticipated the Age of Aquarius that began in 2012 and now another great transition in the planet’s timeline have arrived. All over the world people are waking up, realizing that something is awfully off. My dear bearers of the light, something has been off for years! The Elite has done everything in its self-serving power to keep humans in the dark and I am happy to say that their ruler ship is drastically coming to a dead end.My message in this article will be that of unity, compassion and the inner strength we will all have to find to bravely accept our mission, even if we don’t remember completely what that mission is yet, and to hold the new frequency Mother Earth and the Collective Consciousness will need to complete the transition into 5D .My human vehicle is just 17 earth years but I’ve existed for lifetimes. I will share something personal in hope that it will be of encouragement to the hearts of young indigos and Starseeds who are facing similar challenges; you are not alone! I’ve always had trouble with my spirituality and psychic development . From a very early age I knew this planet was not where I originate but because of the human family I grew up with, a family who believes aliens and psychic powers are nonsense and impossible, I always doubted myself. For a good couple of years those doubts and the way the school system and society conditioned me stood as a blockage for my awakening. I had tons of supernatural experiences! Around the age of 8-9 I drowned and had a near death experience . An experience I will never forget, sweeter than my very first kiss! I’ve had lucid dreams of encountering extraterrestrials on spacecrafts , I’ve had astral travel experiences, spoken with crystals and spirit beings etc. It’s not like these things never happened to me but always, always, I seemed to stumble or get stuck in some points of my evolution. The magical thing I am beginning to understand however this is: YOUR BLOCKAGES ARE A PART OF YOUR AWAKENING! Whether it is spiritual, psychic or emotional, feeling stuck and limited is an integral part of our awakening because we are becoming aware of the limitations that is forced upon us in the third dimension. With this awareness, deep inside our being we begin to feel uncomfortable. We try over and over to move something with our minds or to fly or leave our body and it just doesn’t work. This feeling is important.Feeling is a universal language, the language that reveals the secrets we all seek to uncover.By feeling limited you begin to understand that you are not! That is why we feel uncomfortable in such cases. A lot of discomforts will be on this awakening path but they are not there to stop you from reaching your potential.This is where you will be tested and required to use your inner strength, your inner knowingness to pierce through the veil of forgetfulness and move to the next phase of your awakening and why you are here. WHAT THE PLANET NEEDS AT THIS TIME Compassion is needed. A love that is unconditional, not judgemental or selective but free and pure. Love indeed is the energy that binds all life together. Love keeps us connected. The stargates that opened in August through to September as provided humanity with the frequency required to complete our cycles and timelines, to allow the old and negative ways to fade leaving infinite space for the love and light of Prime Creator to express itself.The world has enough medical doctors, soldiers, lawyers, pilots etc etc… A new reality is emerging and what the planet needs now more than ever is people with loving hearts, kindness and selflessness. And that is the energy that will bring us to ascension. Children of the stars overcome your obstacles. Now is the time! Hold the new energies that our Creator has provided us then express it abundantly with every soul you come in contact with. YOU MUST UNITE Critical times are upon us. Turn off the television because the garbage on there won’t edify you. Come out into nature, sing with the birds, sit under a tree and daydream a little. Begin taking a habit of projecting positive and peaceful thoughts because they will shape your reality and make life better on Earth. Start to meet up with others of like mind like you who walks away from the crowd and seek the secrets of the universe. Come together, meditate together for together we are stronger. Together the new energy you brought to this planet will anchor and change the world. Namaste! Love and Light to my brothers and sisters of the stars. By Shawn-Dee Scott Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742628545.8730159}