{"duration": 0.3192267417907715, "input_args": {"text": "'1597 Views October 28, 2016 8 Comments Guest Posts The Saker \\nby Peter Koenig \\nImagine, Donald Trump would accede to the US Presidency, an unlikely event with the presstitute media relentlessly slamming, slashing and demonizing him, not unlike they do with President Putin – while cheering no-end for the warmonger Killary, no matter what atrocities she has on her hands and body, no matter that blood is dripping out of her mouth every time she opens it – like Iraq, Libya, Syria, Palestine, Afghanistan, Sudan – and more, much more. They, the elite, the military-security complex, the financial mafia, want more blood, more than is already covering the entire current Obama Administration’s structure of psychopaths. Blood is weapons, blood is money, blood is more profit, blood is good for business – so said the Washington Post, just slightly translated from ‘war is good for business’. The warmongering MSM (mainstream media) also propagate for more weapons to enrich the military-security complex that pays them. But just for a moment, let’s assume, Trump would get elected with such a large margin that voter fraud would be difficult to manage. \\nTrump is sending a different narrative from that of eternal war. Trump seems to be looking into a different direction. He essentially says – stop the conflict with Russia, make Russia a partner, stop outsourcing jobs, bring them back, give labor back to Americans, slash the unemployment rate – which is, of course, everybody knows, way above the silly fabricated 5%. The reality is that unreported but real unemployment in the US is hovering between 22% and 25%, a real hammer for the economy, increasing anger and unhappiness and crime. Trump also says in the same vein as bringing back jobs – STOP globalization, restrain NATO, rein in the banks – yes, Wall Street, the Goldman Sachs-es and Co. of this world of fake pyramid money, dominated by the Rothschild-Rockefeller-Morgan clan. Trump says, let’s have a financial system that works for the people. \\nDoes he mean it? – I don’t know. Could be true. Most of what he says makes sense for America, for Americans – and by extension for much of the rest of the world, especially Europe, the genuine Europe, not the puppet-commandeered Europe. He also says a lot of outright discriminatory and xenophobic rubbish – like building a wall separating Mexico from the US of A, emulating Israel; and propagates a crackdown on Moslems. Does he mean it? Or does he want to please potential voters? – Such statements are indeed dangerous rubbish, but they are secondary to all the other things that are PRIORITARY, as they would help restore American society, workforce, dignity – most important: DIGNITY. Dignity is important for Americans to wake up to realize that they are living in a country that wastes their money, the peoples’ resources – on countless criminal wars around the world, feverishly racing towards Full Spectrum Dominance to benefit a few. The secondary stuff is important too, but can be dealt with in parallel by Americans that have come to senses. \\nTrump is in many ways like France’s Marine LePen, representing the extreme right, and therefore, no matter what sensible things she says and has on her agenda to do – and I don’t doubt one minute that she means what she says – like EUREXIT and send NATO to hell – she is still framed by the ‘left intellectuals’ – if such a thing still exists in our neoliberal universe – as a discriminatory xenophobe who would expel all ‘colored’ and ‘veiled’ foreigners. Of course, that’s bad. But let her first initiating France exiting from the EU, the Euro and NATO – the likely salvation of Europe, then tackle the other issues. First comes first. A true intellectual left would have to understand that – and not bend to the presstitute promoted clichés. \\nTrump has enough money power. He doesn’t have to bend to the military security complex, to the banks, to the Obamacare pharma-fiefdom. He doesn’t really have to bend to anybody. That worries the elite. He is independent. Let’s give him the benefit of the doubt. In no case could he be worse than Hillary – the killer – so much can be read from every word she says. Her pattern of pathology – “We came, we saw, we won” , when she saw the bloodstained image of the NATO-slaughtered Ghaddafi – indicates that she would not stop from pressing this infamous Red Button of Death and total world annihilation – perhaps even repeating that same smirk, , “We came, we saw, we won” . \\nNow let’s go to the next hypothesis, assuming Trump would be elected and ‘they’ – the elusive high-powered small elite that pulls the strings on Washington and the White House’s overseas puppets, and let’s assume ‘they’ would let him live, at least for a while, Trump might be doing ‘irrational’ things in the eye of the Beltway slaves. Recognizing the perils for his own country and those for his neighbor, Canada, Mr. Trump might call on the western stooges, in Europe particularly, who for the sake of brown-nosing the naked king in Washington, are prepared to sell-out 500-plus million European and their future generations to the most nefarious trade deals the world has ever known – CETA, TTIP and TiSA (let alone the TPP, where 12 Pacific countries are about to kiss ass in Washington) – telling them to come to senses, think democracy and stop the deals that 80% or more of Europeans despise and reject. \\nAs a parenthesis and philosophically speaking, one could say that given the hundreds of years of colonization around the globe, of shameless exploitation, of raping and killing millions of people throughout Africa, Asia, and Latin America, that these trade ‘deals’ are Europe’s historically deserved heritage.—– The Saker wrote a great essay on the aberration of this upcoming election and what might follow after the election, “The US Is About To Face The Worst Crisis in Their History” – http://www.informationclearinghouse.info/article45729.htm . One of the article’s commenters pinned it down to the point: “ If Trump does become Commander in Chief, his first job will be securing his life. Those who really run the show in the US will stop at nothing to safeguard their empire. Truly the US is at a cross roads and by extension the world. Times are really scary .” \\nWhat Trump says he would do during his first 100 days in office, he presented in a groundbreaking speech at Gettysburg, Pa. this past weekend, is for the most part truly astounding http://www.veteransnewsnow.com/2016/10/24/donald-trump-delivers-a-powerful-policy-speech-on-his-first-100-days-in-office/ . It is not less than revolutionary, because no US politician, let alone a Presidential candidate or President has said something for the most part so sensible as did Presidential candidate Trump. Summarizing, he promises bringing back overseas jobs, would prevent the continued outsourcing of the American production processes, bring order to the crime-ridden communities, he would seek friendly partnership with Russia, defusing the WWIII threat – and he would tackle, restrain and control the corrupt banking system, including the endless money-making machine, the privately owned, Rothschild dominated FED. – That is a challenge other Presidents have failed to master, including Lincoln and JFK. We know how they ended. \\nTrump has already hinted that to revive the American economy the zero-interest policy may have to be changed, so that banks become more responsible. The owners off the system would hardly allow Trump’s interference in their obscene profit-making scheme. They’d rather at their calling let the bomb loose. A sudden change of this policy would hit many over-stretched banks like a bombshell – reminiscent of 2008 Lehman Brothers, just magnified by a factor of 10. There are currently at least three, possibly five Wall Street giants that are on the edge. They get by, because of the FED’s zero interest policy- and they make sure that this doesn’t change, as several if not all of them are part of the private FED system. Would Trump dare touching this system? – It’s a deadly challenge. He knows it. \\nThis time there may be more at stake then just another banking collapse, a planned emulation of the 2007 / 2008 crisis, where Wall Street was copiously rewarded for its excesses by tax-money bail-outs. Be aware, this time it would not be tax-payer’s money that would rescue the Too-Big-To Fail (TBTF) banks, but it would be YOUR money, your deposits, your savings, your pension funds, possibly even your shares if you have any in the bank being ‘collapsed’ – and the process would be called ‘bail-ins’. \\nThe (western) world is under the hegemon of a privately-owned money system, the US-dollar – and most people don’t even know it. The accent is on the western world , because the east, comprising Russia, China, the SCO countries (Shanghai Cooperation Organization – comprising China and Russia and most of the Central Asian former Soviet Republics, plus Iran and Pakistan – and others are waiting in the wings), the EEU (Eurasian Economic Union), as well as most of the BRICS (Brazil, Russia, India, China and South Africa), are forming their own eastern economic and monetary block. – I have said this before, but will repeat it for readers to realize – this ‘economic block’ – is largely, if not entirely, delinked from the dollar scheme. It consists of about half the world’s population and one third of the world’s GDP, a solid GDP that is. In contrast to the western, especially the US GDP; in the eastern block much of the GDP is based on real labor output and manufacturing. \\nIn reality, this eastern economic power block which is also displaying the world’s largest economic development potential, since history remembers, the New Silk Road – or the One Belt, One Road (OBOR) economic development scheme, stretching from Vladivostok to Lisbon (if Europe chooses to participate), does not need the west anymore. The OBOR project has already begun. It represents a view into the future, with job opportunities and the outlook for a truly better life for hundreds of millions, possibly billions of people during coming generations – a dynamic vision for the future. The east is where the future lays.——- \\nDonald Trump as President notwithstanding, a new western well-planned banking collapse may start in the US, the ramifications and impact would be felt around the globe – sinking millions, hundreds of millions of people into poverty, misery, the like we haven’t seen in recent history. The banks ‘depositors’ money might not be enough. The reptiles are hungry. They might privatize public properties, infrastructures, roads, ports railways, health care, education, pensions, natural resources – anything that is still in the hands of the people. If Greece is a reminder, then think of Greece blown up by a factor of 1000 – all around the globe, touching in extremis the vulnerable people of the vulnerable countries – billions of people. While the money flows again from the poor to the rich, to an ever-shrinking pool of super-rich; widening the rich-poor gap to a disgusting yawn. Leaving the 99.99 % – by now the 99. % ever more powerless, having to fend for sheer survival – seeking refuge in ‘better lands’ – It’s a war by money. Canons, bombs and guns could rest – for a while. \\nFor years, I have felt the Empire will have to be brought down from inside – from the people who can’t take it anymore, from an internal revolt that eventually would break the worldwide extended monster’s back. Rome and most subsequent empires have fallen this way. It may still happen. But now I side more with The Saker’s theory, namely that the defeat may come from a combination of inside revolt and outside forces, not so much military forces, but economic forces. In theory, it could happen tomorrow. Just imagine, the one third of world-GDP-countries would drop all their dollar reserves, all the dollar denominated international contracts, all dollar issued trade agreements – and in particular, abandon at once the unwritten rule of hydrocarbons to be traded only in US-dollars. It would most likely wipe out the western economy. \\nThis will not happen, of course. Simply, because the One Third GDP holders do not want to destroy the economy of the rest of the world, especially the so-called developing and emerging countries, many – or most of them – eventually to become allies of this eastern block that promises peaceful co-existence rather than the current western pattern of ever multiplying wars and conflicts – a sheer dollar-fed killing spree, with destruction and weapons manufacturing no end. \\nThe Power of Money. Would Donald Trump, as President, himself a moneyed powerhouse, survive such a calamity? In fact, would he be able and strong enough to veer the ship around, guiding the world away from such destructive scenarios and towards peace and cooperation between East and West? – Or is the train already too far out of the station? – No telling at this time. The signals are certainly not good. But, let’s put in a grain of optimism and ‘bank’ on a positive strand of dynamics fueled by an increasing human consciousness – one that would not allow Hillary to push the Death Button. \\nPeter Koenig is an economist and geopolitical analyst. He is also a former World Bank staff and worked extensively around the world in the fields of environment and water resources. He writes regularly for Global Research, ICH, RT, Sputnik, PressTV, The 4th Media, TeleSUR, TruePublica, The Vineyard of The Saker Blog, and other internet sites. He is the author of Implosion – An Economic Thriller about War, Environmental Destruction and Corporate Greed – fiction based on facts and on 30 years of World Bank experience around the globe. He is also a co-author of The World Order and Revolution! – Essays from the Resistance . The Essential Saker: from the trenches of the emerging multipolar world $27.95 '"}, "time": 1742564079.533703}