{"duration": 0.04246211051940918, "input_args": {"text": "'français English \\nDopo aver chiamato gli italiani a votare Sì al referendum, ingerendosi nella nostra politica nazionale col complice silenzio dell’opposizione parlamentare, il presidente Obama ha confermato al «buon amico Matteo» che con l’Italia gli Usa hanno «patti chiari, amicizia lunga». \\nNon c’è dubbio che i patti siano chiari, anzitutto il Patto atlantico che sottomette l’Italia agli Usa. Il Comandante supremo alleato in Europa viene sempre nominato dal Presidente degli Stati uniti d’America e sono in mano agli Usa tutti gli altri comandi chiave. \\nDopo la fine della guerra fredda, in seguito alla disgregazione dell’Urss, Washington affermava la «fondamentale importanza di preservare la Nato quale canale della influenza e partecipazione statunitensi negli affari europei, impedendo la creazione di dispositivi unicamente europei che minerebbero la struttura di comando dell’Alleanza», ossia il comando Usa. Concetto ribadito dal segretario della Nato Stoltenberg nella recente tavola rotonda sulla «grande idea di Europa»: «Dobbiamo assicurare che il rafforzamento della difesa europea non costituisca un duplicato della Nato, non divenga una alternativa alla Nato». A garanzia di ciò c’è il fatto che 22 dei 28 paesi della Ue (21 su 27 dopo l’uscita della Gran Bretagna) fanno parte della Nato sotto comando Usa, riconosciuta dall’Unione europea quale «fondamento della difesa collettiva». \\nLa politica estera e militare della Ue è quindi fondamentalmente subordinata alla strategia statunitense, su cui convergono le potenze europee i cui contrasti d’interesse si ricompattano quando entra in gioco il loro interesse fondamentale: mantenere il predominio dell’Occidente, sempre più vacillante di fronte all’emergere di nuovi soggetti statuali e sociali. Basti pensare che l’Organizzazione di Shanghai per la cooperazione, nata dall’accordo strategico cino-russo, dispone di risorse tali da farne la maggiore area economica integrata del mondo. \\nNel quadro della strategia Usa/Nato – documenta la Casa Bianca – l’Italia si distingue quale «saldo e attivo alleato degli Stati uniti». Lo dimostra il fatto che «l’Italia ospita oltre 30 mila militari e funzionari civili del Dipartimento Usa della difesa in installazioni dislocate in tutto il paese». \\nAllo stesso tempo l’Italia è «partner degli Usa per la sicurezza globale», fornendo forze militari e finanziamenti per una vasta gamma di «sfide»: in Kossovo, Afghanistan, Iraq, Libia, Siria, Baltico e altrove, ossia ovunque è stata e viene impiegata la macchina da guerra Usa/Nato. \\nUn ultimo fatto conferma quale sia il rapporto Usa-Italia: stanno per arrivare alla base di Amendola in Puglia, probabilmente l’8 novembre, i primi due dei 90 caccia F-35 della statunitense Lockheed Martin, che l’Italia si è impegnata ad acquistare. \\nIl costo della partecipazione dell’Italia al programma F-35, quale partner di secondo livello, è ufficialemente quantificato nella Legge di stabilità 2016: 12 miliardi 356 milioni di euro di denaro pubblico, più altre spese per le continue modifiche al caccia che ancora non è pienamente operativo e necessiterà di continui ammodernamenti. Nonostante ciò – conferma Analisi Difesa – l’Italia avrà una «sovranità limitata» sugli stessi F-35 della propria aeronautica. Una legge statunitense vieta che i «dati di missione» (i software di gestione dei sistemi di combattimento dei caccia) siano comunicati ad altri. Saranno dunque gli Usa a controllare gli F-35 italiani, predisposti per l’uso delle nuove bombe nucleari B61-12 che il Pentagono schiererà contro la Russia, al posto delle attuali B-61, sul nostro territorio «nazionale».'"}, "time": 1742628576.6101623}