{"duration": 0.15881133079528809, "input_args": {"text": "'During the height of the Cold War, the CIA attempted to develop mind control techniques with the MKULTRA program. As it happens, the Communists already had a leg up on them. We’ll explore how this was done, along with some new twists.\\nThe criticism and self-criticism technique in history This is what happens to people who joke about Chairman Mao ripping off Hillary’s wardrobe.\\nThe technique of “ criticism and self-criticism ” (kritika i samokritika) was developed during the early days of the Soviet Union . This got results. When the early Soviet show trials and purges took place, the targets would confess to committing treason—the details stretching credulity—and beg for execution. The Maoists (Chinese Communists) used it too, typically during “ struggle sessions .” Also, forced confessions were required in Vietnam for prisoners in reeducation camps .\\nWhat happened wasn’t much different from a medieval inquisition. Those targeted would be badgered until they confessed to whatever it was they supposedly did. Of course, physical forms of coercion were also an option. These weren’t actual trials; their fates were already decided.\\nThe lucky ones were released and got to resume their lives as before, after their memorable reminder to toe the Party line. Others faced stiffer penalties than that: from loss of Party membership (and accompanying status) all the way up to execution. No amount of compliance or abject groveling could save them if it was predetermined that they were going to be purged or killed.\\nAfter the ordeal, survivors were surely scared witless. With their egos beaten down, they were ready to do as they were told without question. It’s basically a form of brainwashing. As for those who were executed after that, the purpose of going through the motions was for benefit of the audience. It was political theater, convincing those present that they were delivering justice to wrongdoers, and serving as an example of what could happen to those who step out of line.\\nOther than that, the “criticism and self-criticism” technique—badgering and forcing a confession—also was picked up in the USA during the 1960s by certain cults and oddball encounter groups. Today, we might think of these strange and humiliating rituals as a thing of the past, but the truth is that they’ve merely changed form . As I’ve noted previously , cultural Marxism is a crappy and inherently destructive “for-export” variety of Communism, so it’s no great surprise that it has adapted this technique for its purposes.\\nModern witch hunts This is what happens to people who say that Bruce Jenner is actually a dude.\\nWhen people are encouraged to become incensed over even tiny things , this causes a “walking on eggshells” atmosphere. In today’s politically correct climate, it’s easy to run afoul of the Thought Police. This might result in a visit to the HR Department, or a campus “speech code” investigation. However, if the thoughtcrime is serious enough—or the target is prominent enough—then this can ignite a media circus . Also, someone could end up featured on a mailing list for Social Justice Warriors . Besides just trolling and harassment, this can result in doxxing (release of your personal information) or pressure on an employer to fire the thought criminal.\\nWe in the Western world pride ourselves on the right to free speech. That was one of the main goals of liberalism, back in the 18th Century when liberalism was still a good thing. Actually, many “free” countries criminalize politically incorrect speech. Even in places that don’t have legal penalties for speaking your mind, it carries the risk of the loss of your livelihood . This effectively makes entire policy arguments forbidden to articulate, which naturally is the whole point. Other goals, of course, are information control and thus thought control. So much for freedom of speech! It took a few centuries, but liberals now oppose what they once stood for.\\nThe following scenario has happened time and again. Someone points out an inconvenient truth , writes something that offends someone, donates to the “wrong” cause, mocks a feminist’s First World problems , tells an off-color joke , or even wears the wrong T-shirt . Then the feeding frenzy begins, resulting in torrents of criticism. Usually the target apologizes profusely, but loses his job no matter how abject or groveling his apologies are.\\nIt’s possible to convince a judge and twelve jurors that you’re not guilty of something, but good luck getting the media or an online SJW mob to calm down and leave you alone! The traditional Communist session was better in one way. That is, they quit after breaking the target’s will. A modern feeding frenzy, though, can drag on for months, even after the target has been begging for forgiveness. What goes on the Internet can stay there forever, including lies about you.\\nIf you get caught in a Social Justice Weenie witch hunt , never apologize. Explain and clarify if you absolutely must. This is for the benefit of the uncommitted; the SJWs will already have made up their small minds about you and won’t stop no matter what you do. Never let them break your frame! Instead, go on the attack. You have a right to your own opinion and to express it.\\nIf you beg for their forgiveness, then you will be allowing them to turn their criticism into your self-criticism. Remember that groveling is unlikely to save you! Apologies are for people who actually did something wrong. Having a difference of opinion isn’t wrong, despite some people’s curious notions about freedom of speech.\\nHere are some other particulars to remember:\\nYou can’t reason with them ; online mobs don’t know you and have been told that you’re an evildoer. You’ll probably never know exactly what was said about you, who said it, and what email list all that was on. (If you do find out, sue for defamation of character.) However, you can be sure that you’ve already been deemed guilty. They’re not interested in the truth. SJWs have great difficulty comprehending basic logic. Many of them don’t even believe in objective reality ; only their feelings are real to them. Why would the truth matter to these idiots? Finally, Social Justice Weenies are a bunch of losers . Their opinion of you matters less than that of a snotty child cursing you out. Therefore, don’t let these oxygen-wasters mess with your self-esteem. Societal criticism and self-criticism Wallowing in guilt at its finest\\nThe Frankfurt School , a Communist think tank that moved to the USA and began subverting the educational system, developed critical theory . One of their top classics was Eros and Civilization by Herbert Marcuse. It contained lots of Freudian arguments on how our society was too repressed and we needed to loosen up our morals. Another was The Authoritarian Personality by Theodor Adorno. That too contained Freudian mumbo-jumbo, smearing right wing politics with accusations of neurosis and homo Daddy issues. All told, they wrote dozens of books along those lines, some attacking Western civilization directly. These vaporings wouldn’t have amounted to much, if they hadn’t become trendy in academia and influenced the 1960s zeitgeist.\\nMeanwhile, radical feminism—the Second Wave—was starting up. This too had lots of Communist influence , another front of cultural Marxism. This also was all about criticism of our culture. This caused friction between the sexes, driving a wedge deep into the heart of society. The results included the snarky, snotty, and spoiled attitudes you’ve surely encountered. Worse, this caused untold misery from high divorce rates and broken homes .\\nThis was one of several movements that became prominent during the 1960s and are still with us today. (Surely you can think of many others.) The methodology was the same—all angrily made overblown complaints about how bad society has been to them. The way they tell it, they’re out fighting for their rights. The goal of cultural Marxism, though, was all about attacking our morale and softening us up. The people involved in those movements were merely tools, being used by leaders who were in it for power, money, and status.\\nThe educational system has been dumbed down . History has been rewritten too. Figures like Christopher Columbus and the US Founding Fathers are bad guys now. Even as early as the 1980s, campuses were hell-bent in purging “DWEMs” (their charming term for “dead White European males”) from the literary canon. None of this was really about inclusiveness; it’s all about robbing our people of our heritage, making us ashamed of our accomplishments, and destroying our resolve.\\nThe propaganda is everywhere. Television is full of social and political messages, even in shows for children , and piggybacked onto advertisements too. “Sensitivity training” courses deliver politically correct indoctrination. College campuses are notorious for pushing propaganda. This even happens to elementary school kids. (My first exposure was in second grade.) Some of the indoctrination exercises require audience participation, such as forcing them to fill out “privilege” checklists (with the facts cherry-picked ) to instill a sense of “collective guilt.”\\nAll this has worked according to plan. Many are out of touch with their roots, and don’t understand that they have a heritage worth preserving. Worse, others have been infected by guilt trips. Sometimes this leads to public spectacles of wallowing in guilt; again, there’s the self-criticism part.\\nThe antidote to this is the truth. The fact is, every civilization has its good points and its bad points, and ours is no exception. It’s rotten hypocrisy for the bullshit merchants in academia and the media to dwell on our faults and overlook those of other parts of the world, while selectively ignoring our accomplishments and elevating those of others . The truth is that none of our shortcomings or misdeeds are solely found in Western civilization, but some of our good characteristics are indeed unique.\\nYou can protect your children by home schooling them or sending them to a private school where they won’t be indoctrinated. You can always get rid of your TV too. Meanwhile, though, millions of other students will be putty in the hands of propagandizing professors and teachers, and of course the lying media. Those pushing this from the top down must be called out, exposed, and removed from power.\\nRead More: 13 Common SJW “Arguments” And How to Dismantle Them \\n'"}, "time": 1742563570.497665}