{"duration": 0.04147648811340332, "input_args": {"text": "'LinkedIn could soon be banned in Russia 27 October 2016 rt.com LinkedIn may turn out to be the first casualty of Russia’s Federal Law On Personal Data. The world’s largest professional network did not transfer its servers to Russia. Facebook network , law , society Networking site for professionals LinkedIn is the world\\'s largest business and employment oriented social network. Source:AFP/East News \\nThe world\\'s largest professional network LinkedIn could soon be blocked in Russia. The company has failed to comply with a law that obliges companies to keep data on Russian users in the country. \\n\"We are seeking a court order to block LinkedIn. We twice sent requests in the summer, but they did not provide answers to our questions,\" said Roskomnadzor spokesman Vadim Ampelonskiy in an interview with the TASS news agency. Apart from not moving servers to Russia, LinkedIn collects and sends information about people who are not users of the network without their consent, according to the Russian internet watchdog Roskomnadzor. \\nYakutia is where Google should store data \\nAccording to the spokesman, Moscow’s Tagansky District Court has ruled in favor of the watchdog, but LinkedIn has appealed to a higher court. \\n“If the appellate court upholds the judgment, and it will no longer be appealed, the decision will enter into force within 30 days. We will include the appropriate IP address in the register of violators of the personal data rights, which means blocking,”Ampelonskiy said. The decision will be announced on November 10. \\nThe watchdog will remove the ban, if the social network provides information that it has fulfilled the law and moved servers with data about Russians to the country. \\n\"This is the first company we are suing in court. In future we will use the same mechanism in relation to other companies,\"the spokesman said. \\nRoskomnadzor also told Kommersant daily that another reason for the lawsuit was \"numerous publications in the media about repeated leaks of user data from the social network.\" \\nBig Brother is listening: Beware \\nIn May, website Haker.ru reported the sale of 167 million stolen LinkedIn accounts, and passwords for 117 million accounts on the dark web. LinkedIn said the leak happened in 2012, and passwords have now been updated. \\nLinkedIn is the world\\'s largest business and employment oriented social network. As of 2015, it had 400 million users with 5 million people registered in Russia. \\nFirst published by rt.com .'"}, "time": 1742564172.1338024}