{"duration": 0.130234956741333, "input_args": {"text": "'LOS ANGELES  —   From the stars to the producers to the executives, no one involved with “The People v. O. J. Simpson: American Crime Story” seemed to realize the significance of where they were celebrating their triumphant Emmy night after the awards ceremony Sunday. They were all at an   at an event space called Vibiana, about two blocks from the courthouse where the Simpson case was tried. A couple of decades later, the case was recreated on this FX program, which won the Emmy for best limited series, capping a big night for the show. When the Fox executive Dana Walden heard about the proximity of the courthouse to the party, she said, “That just gave me chills,” a sentiment echoed by FX’s chief executive, John Landgraf, who called it “a little chilling. ” But there was one person who understood the odd coincidence of ending up back where it all started, after a circuitous and sometimes torturous route. “I know where I am,” Marcia Clark, the prosecutor in the Simpson case, said, a little gravely. She was sitting on a couch, inches away from the actress Sarah Paulson, who was holding the Emmy she won for portraying Ms. Clark. Ms. Clark, who was Ms. Paulson’s guest at the Emmys, said she couldn’t help but think about how near the courthouse was on the ride over from the ceremony. It was a bitter reminder for Ms. Clark, who was ridiculed in the news media in the    —   the perception being that she had blown the prosecution and let Mr. Simpson go free. She has found her public comeback only in the last year, after the explosive popularity of the series and the sympathetic portrayal from Ms. Paulson, who in her acceptance speech for her best actress award offered up a moving public apology to Ms. Clark. “The world saw me in sound bites,” Ms. Clark said. “Now I feel like I’m more understood. ” As Ryan Murphy, the prolific television producer who shepherded this show, put it: “The great story tonight is Marcia Clark finally won. ” And so did FX. At the Emmys, it’s usually an HBO night, and to a certain extent it was again: The premium cable channel won the best drama and comedy categories for a second consecutive year with “Game of Thrones” and “Veep. ” It also broke Comedy Central’s hold on the variety category, with a victory by John Oliver’s “Last Week Tonight. ’’ But propelled by a category that FX is reinventing  —   the limited series  —   the network arguably stole the show, smashing the basic cable Emmy record by winning 18 awards over all. The previous record was eight awards. The FX show also won acting Emmys for Courtney B. Vance’s portrayal of the defense lawyer Johnnie Cochran and Sterling K. Brown’s depiction of another prosecutor, Christopher Darden. (Louie Anderson won his first Emmy for his role as the mother of Zach Galifianakis’s character in FX’s “Baskets. ”) Mr. Landgraf has said in the past that he feels like he has to play “Moneyball” to compete with his rivals. Last month, he said his budget was about a sixth the size of Netflix’s. (Netflix’s programming budget is about $6 billion, HBO’s is $3 billion, and FX’s is about $1 billion.) But despite that, FX outshined them on Sunday. The success of the O. J. show wasn’t a sure thing. For decades, Hollywood did everything it could to stay away from the Bronco chase, Judge Lance A. Ito and the trial, in what proved to be a divisive national episode. “Like most things, it’s a   in retrospect, but it wasn’t at the time,” said Brad Simpson, a producer of the show, with his Emmy in hand. “There was such a heavy saturation of O. J. that nobody wanted to hear about it again. When we announced the show, all the comments were, ‘Oh lord, don’t put the country through this again.’ But the show touched on things that obsesses America: class, race, the criminal justice system. ” By turning it into a limited series, which requires a relatively easy time commitment, FX was able to attract actors including John Travolta, Cuba Gooding Jr. and David Schwimmer. (All were nominated for awards on Sunday night.) And though the Academy Awards have been criticized for their   lineup of acting nominees, the Emmys have done better with diversity: Three   won acting awards on Sunday, including Mr. Vance and Mr. Brown from “The People v. O. J. Simpson. ” “Actors and directors follow the writing,” Mr. Vance said at the party. “The writers in TV are writing for different hues of color. Hopefully the movies start to see that if you want to get the people, you better do the writing. ” Mr. Murphy, the producer, has been a regular at the Emmys (he’s the man behind shows including “Glee,” “ ” and “American Horror Story”) and he said that between the diversity onstage and the large number of   winners, Sunday night’s ceremony represented “a sea change. ” “I feel like sometimes you go to those award shows, and there are some people who win over and over again, but it wasn’t that type of night,” he said. “The Television Academy and the voters have moved onto a different feeling, a different embrace, and it felt good. ” There was arguably nobody who benefited more on Sunday night than Ms. Clark. Though Ms. Paulson was joined at the hip with Ms. Clark on Sunday, the two did not meet until late in production. They’ve become close since then, and Ms. Paulson provided one of the night’s stirring moments when she apologized to Ms. Clark during her acceptance speech, saying that the public in the 1990s was “superficial and careless. ” Ms. Clark seemed to be enjoying the rehabilitation of her reputation. “I think the benefit of this   was people got to see the fullness of everyone involved,” she said. “Not just me. Chris Darden, too. Everyone. As well as the historical context. I think everybody got more of what was going on, more than they did ever before. ” For two hours, Ms. Clark and Ms. Paulson sat cozily in a corner near Mr. Murphy and the “Narcos” star Pedro Pascal. At a little before midnight, Ms. Paulson got up to leave with Ms. Clark. As they walked through a courtyard, a group of young women were gawking at them, but they weren’t interested in the one holding the Emmy. “Oh my God, that’s Marcia Clark!” one woman said. Ms. Clark heard it, looked over, pointed triumphantly and waved. She walked out of the party and toward an S. U. V. with Ms. Paulson, and just a few blocks away from her first brush with fame, Ms. Clark finally had her Hollywood ending.'"}, "time": 1742561693.60346}