{"duration": 0.03161501884460449, "input_args": {"text": "'Comments criticizing Federal Communications Commission (FCC) chairman Ajit Pai are “full of bot accounts, fake comments, and death threats,” according to a report. [The Washington Free Beacon reports that “thousands of comments” against Pai’s reversal of the Obama administration’s net neutrality rules were found to be using “fake names and bots posing as ‘Jesus Christ,’ ‘Michael Jackson,’ ‘Homer Simpson,’ and ‘Melania Trump. ’”  1, 761 comments were also discovered to be filed under the name “John Oliver,” while 611 comments used “1” as their name. Oliver criticized Pai’s Restoring Internet Freedom proposal on the latest episode of Last Week Tonight with John Oliver and encouraged viewers to visit www. gofccyourself. com to lodge complaints. The URL redirects to the Restoring Internet Freedom filing on the FCC’s website where comments can be left. Ajit Pai’s name was also used 500 times, as well as “Donald Trump,” which was used 189 times, and “f*ck,” which was used 11 times. “Pai also received death threats in several submissions,” reported the Washington Free Beacon, adding, “One commenter said, ‘[F] —  k you Ajit Pai for what you’re are trying to do and I hope you die a horrible painful death with no remembrance to your name you cocksucka [sic]. ’” Others reportedly prayed “for the slow and painful death of Chairman Ajit Pai and every living member of his family, direct or indirect,” while some even called for his deportation. “Save internet and fuck this Ajit guy,” said one user. “He’s from India, deport that asshole. We will take care of him when he’s back. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742628571.9812672}