{"duration": 0.10598254203796387, "input_args": {"text": "'Good morning. (Want to get California Today by email? Here’s the  .) The Democrats’ power in the State Capitol is ironclad. And it was wielded in startling fashion last week when a Republican state senator defied a demand to stop speaking and was physically removed from the Senate floor by law enforcement. The senator, Janet Nguyen, had stood up to criticize Tom Hayden, the 1960s radical, over his opposition to the Vietnam War. Days earlier, Mr. Hayden had been honored in the Capitol for his service in the Legislature. He died in October. But as Ms. Nguyen, who fled Communist Vietnam as a child, was speaking, the presiding senator declared her out of order. When she refused to sit, he summoned the   . “Have her removed immediately,” said the senator, Ricardo Lara, a Democrat. If the plan was to silence Ms. Nguyen, it backfired. Captured on video, the commotion drew wide news coverage. Republicans circulated their outrage on social media, with some adopting the #shepersisted hashtag that became a rallying cry after Senator Elizabeth Warren was herself cut off during a speech. At the California Republican Party’s convention over the weekend, Ms. Nguyen was held up as a symbol of free speech. Hundreds of stickers were printed that read: “I stand with Janet. ” “It’s unknowable for us why they wouldn’t allow it,” Jean Fuller, the Senate Republican leader, said of the action against Ms. Nguyen. Some Democrats accused Ms. Nguyen of having violated parliamentary rules. Mr. Lara declined through a spokesman to offer specifics. On Monday, Kevin de León, the Senate president pro tempore, addressed the controversy on the Senate floor, saying he was “troubled” by what happened. “Thursday was not one of the finest moments in the Senate’s history,” he said. “As the leader of this body, I take full responsibility for what transpired and for making sure it never happens again. ” That may not be enough for Republicans who are calling for an investigation. “My constituents are extremely upset,” said Ms. Nguyen, who represents a part of Orange County with a large Vietnamese population. “They’re upset that their voices were shut down. ” Even so, as happened with Ms. Warren, Ms. Nguyen’s   speech got far more attention than it otherwise would have. You can read it here. (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • A small plane crashed into a Riverside neighborhood. At least three people died. [The Press Enterprise] • Making sense of Measure S, the latest battle in Los Angeles’s war over development. [Los Angeles Times] • A judge affirmed a blogger’s right to publish the home addresses of California lawmakers who backed gun legislation. [The Associated Press] • Unauthorized immigrants in Sacramento are selling their furniture and cars in case they are deported. [Sacramento Bee] • California leaders demanded details from the Trump administration on immigration arrests in the state. [Reuters] • It’s science, minus the swearing. A Los Alamitos school is using a PG edition of the book “The Martian” to teach physics, astronomy and chemistry. [The New York Times] • SpaceX plans to send two tourists around the moon and back in 2018. [The New York Times] • An Uber official resigned after the company learned he was accused of sexual harassment while working at Google. [The New York Times] • How apparent human error combined with live television to   effect at the Oscars. [The New York Times] • Photos: Ten images that show the extensive damage to the Lake Oroville spillway. [KCRA] • San Diego County was deluged with its heaviest rain of the winter. [San Diego  ] It was “the worst party ever. ” That’s how Bill Schutt, author of the gripping new book “Cannibalism: A Perfectly Natural History,” titled his chapter on the Donner Party tragedy. In the summer of 1846, a group of 87 pioneers set out from Missouri to settle the California coast. Led by George Donner, a businessman with no trail experience, the group took a misguided shortcut that in fact put them weeks behind schedule. Still, by late October, they stood before the final mountain pass in the Sierra Nevada, just a day or two from civilization on the other side. They rested for the night. And in a stroke of colossally bad luck, disaster hit. It snowed. They were stuck. Through the winter months, the group descended into starvation, madness and, infamously, cannibalism. The last survivor, found surrounded by half eaten corpses, wasn’t rescued until  . All told, 35 died during the winter encampment or trying to escape it. We caught up with Mr. Schutt, who is a professor of biology at Long Island University, by phone. Some excerpts from the conversation: Q. I get the sense that your book tries to normalize cannibalism. Is that right? A. That’s a fine line to walk. If you’re not careful it sounds like you’re condoning that behavior. And I’m not. What I’m doing is taking a look at it through the eyes of a zoologist, of a scientist. . .. When looking at survival cannibalism like the Donners, I’m not trying to normalize that, I’m trying to say that it’s predictable behavior. Q. What did you learn about human nature researching this story? A. Just how strong and rugged these people were.   …     They showed incredible bravery all along the way. There was individual heroism, group heroism on a scale that makes you glad that you’re human. Q. Why do you think the Donner Party attracts such fascination? A. They came so close to getting across that pass. They missed it by a night. And if you’ve ever stood in the Donner Pass and looked down and realized that they got this far  —   that blew me away. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742562980.7815866}