{"duration": 0.047688961029052734, "input_args": {"text": "'\\nThis article was written by Kurt Nimmo and originally published at his Another Day in the Empire site. \\nEditor’s Comment: Here we are back to one of those people that just seems to know something we don’t know… well it isn’t really the fact that he suggested Donald Trump won’t keep all his campaign promises. People aren’t that much in the dark. It’s the way he phrased it, and nurtured the idea, as something soft and malleable. \\nKissinger is more than willing to break in Trump, as one would a horse, and shape him towards the kind of president that international banksters and geopolitical hotheads can be proud of. By that time, you might not recognize President Trump as the fiery campaigner who defeated Bushes and Clintons with ease, but that just shows the crafting and development that went into the project, mostly behind the scenes… you might even find that Kissinger and Trump are old pals (see above). \\nKissinger: Don’t Expect Trump to Keep Campaign Promises \\nby Kurt Nimmo\\nElder statesman, Rockefeller confidant, and master war criminal Henry Kissinger told the globalist Fareed Zakaria voters are not going to get what was advertised with Donald Trump.\\n“One should not insist on nailing [Trump] into positions that he had taken in the campaign,” Kissinger told Zakaria .\\nKeeping campaign promises made to voters is counterproductive, according to Kissinger.\\nKissinger argued that it is counterproductive to demand absolute consistency from presidential administrations, particularly in the face of fluid international situations.\\nCommending Trump on the effectiveness of his campaign tactics, the former secretary of state added: “The art now would be to develop a strategy that is sustainable, that meets the concerns that have appeared during the campaign but that can be linked to some of the main themes of American foreign policy.”\\nIn other words, Kissinger and the elite expect Trump to carry the torch and continue the Bush-Obama agenda of never-ending war.\\nDonald Trump appears eager to please. He is considering neocons for his cabinet and his national security adviser is an anti-Islam ideologue.\\nThis article was written by Kurt Nimmo and originally published at his Another Day in the Empire site. Please visit and support his site. '"}, "time": 1742561982.3689623}