{"duration": 0.1424121856689453, "input_args": {"text": "'It has been 25 years since a record turnout of people watched the World Series on television. Nobody saw this win coming, and it was 108 years in the making. However, dreams came true on Tuesday, Nov. 2, 2016, when the Chicago Cubs, crowned the Lords of Windy City, won the World Series.\\nThe city of Chicago experienced an epic moment in sports history. A moment, so grand that it would topple the elections for a split second. After the game, crowds went ballistic. Things were just getting warmed up as two million fans relished in the Cubs victory lap around the city. The triumphant tour ended with a rally in Grant Park. However, the lap may have concluded but the Chicago Cubs long awaited success story has yet to be told.\\nThe Road to Victory\\nSuccess did not come overnight. In fact, it started years ago. Before they were the Lords of Windy City, the Cubs played in 11 World Series, overall. Moreover, before they were the Chicago Cubs, they were the Chicago White Stockings, in 1876. West Side Grounds was where the White Stockings did their damage, with multiple victories. Eventually, establishing themselves as one of the new league’s highest-regarded teams.\\nBy 1890, they had converted to the Chicago Colts. Nevertheless, they would not remain the Colts for long. Despite the fact, the franchise had ushered in a new dynasty, a name change was underway for the final time. In 1902, they became the Chicago Cubs.\\nThe Cubs won four emblems. in a five-year span. from 1905 to 1912. During that time, they won two World Series titles. The Cubs recorded a record 116 victories and the best-winning percentage (.763) in Major League history. However, it would all fall apart due to the alleged Billy Goat curse.\\nCurse of the Billy Goat\\nIn 1945, a man named William Sianis, owner of Billy Goat Tavern, supposedly placed “The Curse of the Billy Goat” on the Chicago Cubs. This sports-related curse lasted from 1945 to 2016. The legend began over the odor of his pet goat, Murphy. The myth states that Murphy’s scent was annoying fans. During game four, he was asked to leave Wrigley Field, the 1945 World Series. Livid, Sianis apparently professed, “They ain’t gonna win no more, those Cubs,” which has been understood as an indication the Cubs would not win another World Series or the National League (NL) pennant.\\nSianis stormed out of the stadium with his goat, and the Cubs lost the 1945 World Series to the Detroit Tigers. Never again, would they see a win, until the 2016 World Series Championship.\\nThe Chicago Cubs Drought\\nBefore their historic win, the Cubs had to endure almost a century of losses. In 1908, the Chicago Cubs won their last World Series, for the second successive year, against the Detroit Tigers. Even though the Cubs went on to play in seven World Series afterward, they went home with nothing. Instead of wins, there was only the agony of defeat. Nevertheless, this torment turned into the thrill of victory after winning the 2016 World Series, and the 2016 National League Championship Series.\\nThe night of Nov. 2, concluded the 108-year World Series championship drought, plus a 71-year National League pennant drought that plagued the Chicago Cubs for over a century. This time period of losses would go down in history as one of the longest by any major American sports team.\\nThe Victorious Night\\nAll it took was an 8-7, 10-inning triumph over the Cleveland Indians, in an electrifying Game 7, that started Wednesday evening (Nov. 2) and finished promptly, on Thursday before noon (Nov. 3). It was a night to be remembered; every seat at Wrigley Field filled. The stadium, recognized for its ivy-coated brick outfield wall, unusual wind patterns from Lake Michigan, and the iconic red pavilion was the center of the universe that night.\\nStars like John Travolta and Amy Schumer were at the event. Homeland Security, 1,000 Chicago police officers, and FBI agents swarmed the place. It was more than a big deal. The Chicago Cubs went out with a bang, ending the season with a 103–58 (.640) record. It would be their first 100-win season since 1935 (100–54, .649) and their best since 1910 (104–50, .675). Additionally, it is the sixth 100-victory season in franchise history.\\nWhen it was all over, the Cubs won the World Series for the first time since 1908, terminating the infamous 108-year win deficiency and the “curse,” thus, being crowned the Lords of Windy City.\\nBy Jomo Merritt\\nEdited by Jeanette Smith\\nSources:\\nFox 32: Cubs World Series celebration ranks as 7th largest gathering in human history\\nESPN: Chicago parties with the Cubs\\nChicago Tribune: Cubs roster breakdown: Players expected to return, depart for 2017 season\\nImage Courtesy of Arturo Pardavila III’s Flickr Page – Creative Commons License\\nImage Courtesy of Erik Drost’s Flickr Page – Creative Commons License 2016 World Series , chicago cubs , Cleveland Indians , spot'"}, "time": 1742564526.1084821}