{"duration": 0.09909462928771973, "input_args": {"text": "'Turkey’s opposition parties are demanding a recount following Sunday’s referendum to install a presidential system of government greatly expanding the powers of President Recep Tayyip Erdogan. [The Republican People’s Party (CHP) the secularist main opposition party, has demanded a recount. On Sunday, the Turkish newspaper Sabah, which typically published   stories, reported that the CHP would seek recounts of up to 40 percent of the votes cast, alleging that bribery and intimidation had occurred to keep the “yes” votes high. Reuters had reported the CHP’s recount demands to be higher  —   a 60 percent vote recount  —   arguing that a number of unverified ballots had made their way into the vote totals.  The Turkish Supreme Election Board (YSK) the electoral oversight agency, had announced it would count as valid unverified ballots lacking an official YSK stamp required from the voting stations, unless individual claims of fraud arose against them. “This referendum will always be remembered as illegitimate,” CHP deputy leader Bülent Tezcan argued on Monda. “The only way to end ongoing discussions over the referendum’s legitimacy is to annul it. What is necessary is the annulment of this referendum. ” Kemal Kilicdaroglu, the head of the CHP, also condemned the move to validate ballots after they are counted. “You cannot change the laws of the game during the match,” he argued. “The electoral body has made the referendum’s legitimacy disputed. ” Hurriyet cites CHP leaders who say they are building a case, including video of suspicious activity at voting stations, to bring to both the YSK and the European Court of Human Rights (ECHR). The Democratic People’s Party (HDP) a   leftist party, will also contest the results. “There were ballot papers without stamps on their backs. This shows no commitment to the laws of the election process,” HDP spokesperson Osman Baydemir protested, estimating that more than 600 ballot boxes that the YSK ended up counting were “illegal” because of their improper lack of stamping. The stridently   HDP entered the referendum vote at a greater disadvantage than any other party. After the Turkish Parliament elected to strip HDP members of legislative immunity, police arrested the party’s   Figen Yüksekdağ and Selahattin Demirtaş, on charges of “aiding terrorism” by allegedly supporting Kurdish separatist groups. Another dozen HDP members were arrested in November along with Yüksekdağ and Demirtaş. The Organization for Security and   in Europe (OSCE) which sent international observers to follow the election, has already condemned the vote as illegitimate. “We observed the misuse of state resources, as well as the obstruction of ‘no’ campaign events. The campaign rhetoric was tarnished by some senior officials equating ‘no’ supporters with terrorist sympathizers,” Tana de Zulueta, who observed the election on the group’s behalf, said. Cezar Florin Preda, another observer, argued the referendum “took place on an unlevel playing field and the two sides of the campaign did not have equal opportunities. ” Even before Sunday’s election, Erdogan had reportedly condemned the OSCE for meddling in Turkish affairs. “The Organization for Security and Cooperation in Europe says if the result is ‘yes,’ that means there are a lot of problems. Who are you?” Erdogan asked on Saturday, according to Iran’s   PressTV. “First of all, you should know your place. This is not your duty. ” Official Turkish government numbers showed Erdogan’s push for a presidential system won by 51. 4 percent of the vote, with an estimated 48. 6 percent of the country voting “no. ” Electoral maps showed Erdogan winning big in the nation’s heartland and suburban areas, but the “no” vote sweeping the big cities  —   Istanbul, Ankara, Izmir  —   and the largely Kurdish Southeast. Following his victory, Erdogan delivered a speech praising the country: “For the first time in the republic’s history, Turkey changed its governmental system through civilian means. ” He added that efforts to “belittle” the election results would “be in vain. ”'"}, "time": 1742561908.0995939}