{"duration": 0.03350424766540527, "input_args": {"text": "'A dentist who caters to celebrities in Hollywood was reportedly kicked off a flight for making an   comment to a flight attendant. [Shawn Sadri, a    immigrant from Iran, who practices in Los Angeles and Manhattan, was returning to New York from Hollywood after a week of performing cosmetic dental procedures for his clients attending the Oscars, the New York Daily News reported.  He sat next to an unaccompanied “  or    boy” of Latino descent, who was crying and nervous before takeoff. “I asked the boy, ‘Are you OK? Are you traveling alone? ’” says Sadri, who has served   clients such as actor Aaron Paul and athletes Jose Canseco and Gabby Douglas. “He didn’t speak a word of English and no one was with him,” Sadri said. “Out of nowhere, he runs down the aisle and starts screaming!” When a flight attendant came over to assess the situation, Sadri told the flight attendant jokingly that “maybe Trump is trying to deport” the boy. “Don’t say that,” the flight attendant snapped back at him. Sadri, who moved to Iran from the U. S. when he was three, thought that by making a “joke” he might diffuse the situation, but things only escalated even further. “Fine, you must be a Trump supporter,” he told the flight attendant. “And she said, ‘What if I am?’ So I said ‘If you are, you are, but you’re also incompetent and need to do your job. Why am I dealing with this kid? ’” Two other flight attendants came to the aid of their colleague, and an argument between Sadri and the flight attendants ensued, according to Sadri. “I wasn’t yelling, I wasn’t swearing, it was 6 a. m. I hadn’t been drinking,” he said. “I’m a New Yorker  —   I’m not going to back down  —   and I was born a Muslim in Iran. I do think all those things played into it. ” Sadri said security was “nice” when they kicked him off American Airlines Flight 292 and put him on the next flight to New York leaving an hour later. American Airlines said he was asked to leave the flight because he failed to follow crew members’ instructions. Sadri said he has flown by private jet in the past but did not get lucky enough to do so Sunday, the Daily Mail reported.'"}, "time": 1742561855.066793}