{"duration": 0.04278159141540527, "input_args": {"text": "'Amy Schumer has lashed out at Internet “trolls” she claims launched an online campaign to tank the reviews of her latest comedy special. [One week after its March 6 debut, The Leather Special had received hundreds of   reviews from Netflix members. Schumer responded to the backlash Wednesday on her Instagram account, quoting a news report from Splitsider that claims hundreds of trolls purposefully flooded her comedy special with negative reviews.  “The alt right organized trolls attack everything I do. Read the @splitsider article,” the Trainwreck star wrote. “They organize to get my ratings down. Meeting in sub Reddit rooms. They tried on my book and movies and tv show. And I want to thank them. ” Schumer also chided journalists for reporting on the news that her Netflix special is a critical dud. “I am only alarmed by the people printing their organized trolling as ‘news.’ [T]his is what the current administration wants,” she said. “Journalists do better it’s embarrassing. ”  I am so proud of my special and grateful to all the people spreading love on line about it. I am the first female comic who is selling out arenas all over the world and so grateful for that. I am embarrassed for the ”journalists” who report on trolls activities as if it’s news. It’s indicative of administration right now. Anyone who reported that ”viewers aren’t happy” with my special, it would have been cool if you did a moment of research before posting. The alt right organized trolls attack everything I do. Read the @splitsider article. They organize to get my ratings down. Meeting in sub Reddit rooms. They tried on my book and movies and tv show And I want to thank them. It makes me feel so powerful and dangerous and brave. It reminds me what I’m saying is effective and bring more interest to my work and their obsession with me keeps me going. I am only alarmed by the people printing their organized trolling as ”news” this is what the current administration wants. So this post has nothing against the trolls. I thank you trolls so much. It fills me with hope and power to see you all furiously posting so as always accuse me of whatever lies you want. Call me a whale. Call me a thief and I will continue to rise and fight and lead. I know who I am. I am strong and beautiful and will use my voice my whole time on this earth. Journalists do better it’s embarrassing. Trolls see you on the next one! 😘😘😘 A post shared by @amyschumer on Mar 15, 2017 at 9:28am PDT,  “I thank you trolls so much,” the comedian added. “It fills me with hope and power to see you all furiously posting so as always accuse me of whatever lies you want. Call me a whale. Call me a thief and I will continue to rise and fight and lead. I know who I am. I am strong and beautiful and will use my voice my whole time on this earth. ” While Schumer says the Netflix members who called her special “awful,” “unfunny,” and “unwatchable” were organized by Reddit users who mounted a troll campaign against her, negative reviews for The Leather Special could be readily found on other online rating platforms. For example, Schumer’s Netflix special currently holds a 4. 4 out of 10 rating on The Internet Movie Database (IMDB)  —   down from 5. 5 less than a week ago. The Leather Special is also showing a 22% audience score of viewers who “liked it” on Rotten Tomatoes. Reviews from television critics have also been lukewarm. The Los Angeles Times‘ Lorraine Ali writes that the special features Schumer’s signature brand of dirty humor, but “ironically, the dirtier it gets, the less daring it feels. ” “‘The Leather Special’ not only relies on many of those familiar and explicit themes, but kicks it all up a notch so there’s more of it  —   with more frequency and extremities. And as it turns out, that’s not a good thing,” she wrote. Meanwhile, Newsday’s Verne Gay gave the special a “C” grade. “It’s all there. She’s all there. Every bit of her,” Gay wrote. “As usual, it’s mostly also all one subject, or variations on that subject, along with every imaginable word to describe that subject, along with some physical pantomime or gesture to add texture and meaning to this subject, just in case the words themselves didn’t quite suffice. As if. ”   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742628527.8416843}