{"duration": 0.10118651390075684, "input_args": {"text": "'GoldSwitzerland October 27, 2016 \\nThere are a lot of people who are concerned about the performance of gold and the fact that the price after four years of correction is still so far from the high. The mistake that most people make is to measure gold in US dollars. We are seeing currently very temporary dollar strength. But the US$ is a weak currency in a mismanaged economy. Just look at the dollar in Swiss Francs. Since 1970 the dollar has lost 77% against the Swissy. That can hardly be called dollar strength. \\nThe dollar is a very weak currency \\nIf we measure the dollar in real money which is gold, of course, the not so mighty dollar has lost 80% in this century. \\nSo to talk about a strong dollar is totally ridiculous. The dollar is in a long-term downtrend which will continue for many years until it reaches zero. The temporary dollar strength gives the appearance that gold is currently weak. But we must remember that gold should be measured in your home currency and not only in dollars. It is pure laziness that makes non-Americans quote gold in dollars. International media don’t make it easier since they always show the dollar price. \\nThe US population is less than 5% of world population and most of the remaining 6.7 billion people are not linked to the dollar. If we instead use GDP as a measure, the US represents around 25% of global GDP but that still leaves 3/4 of global GDP which is not dollar based. My point is that gold in dollars is only relevant to a minority of the world and the rest of us should measure gold in our home currency. \\nGold in pounds up 47% in 2016 \\nLet us look at gold in the UK pounds for example. Any Brit who has kept his money in gold since December 2015 had gained a staggering 47% in the last ten months. Had he instead kept his money in the UK stock market, he would have made just 13% which is 1/4 of the gain he could have made in gold. \\nThe chart of gold in pounds below is an excellent example of the wealth preservation properties of gold. When a currency weakens, most investors don’t realize how much real value this is costing them. As opposed to most governments, gold tells the truth and the truth is that for UK citizens, their currency has lost a huge 1/3 of its purchasing power in the last 10 months measured in gold. \\nBut it is not just gold’s performance in pounds this year which is significant. Since 1999, gold in pounds is up 6.6x. That means that the pound has lost 85% of its purchasing power when measured in gold. During the same period, the FTSE100 index has gone nowhere since it is today at the same level as it was in 1999. \\nUK stock market investors are deluding themselves when they believe they have preserved capital with a market that has gone sideways for 17 years when in real money – gold – they could have made almost seven times their investment. Also, since most investors around the world only look at the gold price in dollars, they believe that gold is far from the 2011 highs. But looking at the chart above, gold in pounds, for example, is only 8% from the September 2011 peak. \\nFew UK investors, and that includes institutional investors, realize that if they had just kept their funds in real money – gold – for the last 17 years, they would have outperformed all other asset classes. That trend will continue for many years as all the bubble assets such as stocks, bonds and property will lose another 50-90% against gold.'"}, "time": 1742562271.7650104}