{"duration": 0.04789614677429199, "input_args": {"text": "'Multiple polls show that the GOP’s Ryancare healthcare plan is even more unpopular than the perpetually unpopular Obamacare plan or the Democrats’ 1993 “Hillarycare” plan, says FiveThirtyEight. com, which analyses polls, surveys, and data. [The GOP overhaul “is much more disliked than the ACA [Obamacare] and [President Bill] Clinton’s health care reform bill were when they were first introduced,” the site reported. March 23. “Across nine surveys, the [American Health Care Act] has garnered an average of just 32 percent in favor compared with 45 percent opposed. ”   Clinton’s 1993 healthcare plan was dubbed “Hillarycare” by GOP opponents because first lady Hillary Clinton played a central role in designing the doomed proposal for a   healthcare network. Opponents are also more enthusiastically opposed to Ryancare than its supporters are supportive, says the site, adding: enthusiasm is on the side of those against change  —   just as it was in 1993 and 2009. In the most recent Fox News poll, only 17 percent of Americans strongly favored the AHCA  …     Forty percent strongly opposed it. SurveyMonkey and YouGov polls show comparable splits. These numbers look a lot like an NPR poll from late July 2009, in which only 25 percent of Americans were strongly in favor of Obama’s health care bill and 39 percent were strongly against it  …     Even in early November 1993, a Wirthlin Group survey found that those strongly opposed (27 percent) [to Hillarycare] outnumbered those who were strongly in favor (21 percent). The new report was backed up by a Quinnipiac poll released March 23, which showed that swing voters and GOP supporters dislike the bill, which was drafted under the supervision of House Speaker Paul Ryan.  : Whites   a college degree (Trump’s base) oppose AHCA by 26 points. https:  .  pic. twitter.   —   Dave Weigel (@daveweigel) March 23, 2017,  Read it all here.  '"}, "time": 1742563715.3270934}