{"duration": 0.09914326667785645, "input_args": {"text": "'A growing number of radical Muslims are flocking to move from France to Britain, where generous welfare payments, lack of scrutiny from the authorities, and the ease with which families can practice strict Islam have earned the UK a reputation as a halal paradise for Salafists who are unable to secure visas for Saudi Arabia. [French newspaper L’Obs reports that Small Heath, a neighbourhood of Birmingham where 95 per cent of residents practise Islam, is one of the most popular spots for French Muslims seeking a new home where women can wear the full face veil. The garment has been banned since 2010 in France.  “Daesh [ISIS] isn’t here, and no one is looking at you,” explained Dounia, a woman of Moroccan origin who moved to Small Heath from France with her husband Karim and his four children a year ago. Life in the area is “cool” for Muslims, she said, telling L’Obs how there are single sex gymnasiums and pool schedules with segregated swimming, that shops contain prayer rooms and how, in hospitals, women can ask to be seen by a female doctor. Another reason the pair settled in Small Heath was to “blend in with the masses” Dounia said. A big draw of the UK for Muslims seeking to leave France, L’Obs reports, is the lack of scrutiny in comparison to France and other countries in Europe, where security services often closely monitor Salafists. Earlier in May, Karim, a    Muslim convert, spoke at his    daughter’s school to explain that the family moved to Britain seeking “freedom”. “The children were not aware that [in France] girls are not allowed to wear the veil at school, or that there are no halal dishes in the canteen. They were shocked,” he told L’Obs. And the threat of Brexit accelerated the Salafist exodus to Britain, according to Hussein, who stated that there are around 100 families living in Small Heath who have moved from France, “at least 300 in Birmingham”. The migrant, described by L’Obs as a “pillar of the community” in Birmingham, said other UK “hotspots” prized by Salafists such as Luton, Leicester, and a number of suburbs in London have seen similar movements. Britain has received an influx of Salafists from across Europe, reports L’Obs, noting Salafists from across Europe, especially from “Paris, Roubaix, Marseilles, Bordeaux   …     Belgium, the Netherlands and Spain” have migrated to the UK. The magazine tells readers that for Muslims in the UK: “Life is cheap, unemployment is low and mosques and madrasas are plentiful. ” Young Muslims who have made the move from France to Britain find themselves missing family members, their neighbourhood, and aspects of France such as “the climate and the cheese”. But, as Hassan explained to L’Obs, each migrant has his own anecdote as to why Britain’s   environment means ‘they have no regrets’. “When a Muslim friend has suffered a racist insult, he has complained about it and the manager has been fired,” he said. “We would have no chance of that happening in France. ” “In France it is impossible to tell your boss that you have to pray, but here, you can do it everywhere. “At Ikea, at the factory   …     It is the manager who comes to propose it to you,” Hassan added. Not everything in Small Heath is rosy according to Selma, an English convert to Islam, complaining that far right groups have held protests in the area before. “But it’s a minority,” she said, and highlighted how even state schools “encourage the practice of rigorous Islam”. “It is the teacher who calls up to make sure the little girls don’t forget to wear their headscarves,” she told L’Obs. And schools played a large part in Hussein’s decision to move to Britain with his family, too, reporting they fled “the homosexual propaganda” in French state schools. “We were rejected in France, and it was reciprocal, we built ourselves in religion, and we find ourselves here because we are accepted. ” “I wanted my wife to be able to wear the veil, and for the children to get an education in keeping with our values,” he said. “This gay marriage. How can we accept that?” Asked why   Salafists in France move to Britain rather than a Muslim country, Paris emigrant Hassan told L’Obs that whilst a move to Saudi Arabia would be “ideal” the country makes it difficult for families to get work or visas. “We are caught in the crossfire, Europe does not like us, but we are not really welcome [in the Gulf states] either,” he said. “They say to you, ‘Go home, brother. You have nothing to do here. ’” But for Salafists wanting to live in accordance with strict Islamic teachings, “there is nothing easier for [Muslims with European passports] than to settle in Britain” where there is “a generous welfare package, public services delivered free, plenty of available work, and all with no visa or residence permit required”. according to L’Obs. “Hijra is the call to emigrate to a land that’s welcoming to Muslims,” Hussein told the French weekly. “For us, it is. ”'"}, "time": 1742563278.8014705}