{"duration": 0.06975579261779785, "input_args": {"text": "'Department of Homeland Security Secretary John Kelly visited Arizona border counties and their sheriffs to get a broader look at the nation’s border security problem. [Kelly toured the U. S.  southern border with Arizona Gov. Doug Ducey ( ). afterwards meeting withAfter the tour, he conducted a roundtable of Arizona’s border county sheriffs where they collectively agreed that more security at the nation’s border was necessary.  Kelly’s meeting included Yuma County Sheriff Leon Wilmot, Santa Cruz County Sheriff Tony Estrada, Cochise County Sheriff Mark Dannels and Pima County Sheriff Mark Napier. Napier praised Kelly, telling AZ Central, “I think the bottom line is we finally have a receptive ear of someone who is taking notes, very engaged, very willing to listen to us. ” “We talked about the value of technology in some areas and physical structures in others, but there’s a lot to be vetted out in that,” Napier said. “There’s a whole lot of distance between an executive action and some political rhetoric and actual policy implementation at the local level. ” Dannels echoed Napier’s call for not only a border wall, but more local security and cooperation. “The fencing along is not the   to this border problem,” Dannels said. “We need to help get [local law enforcement] at the table, and number two is fund the programs that we’re taking on as a result of the federal government not doing it. ” Dannels said one of the issues Kelly and the Arizona sheriffs all agreed on was the reinstatement of what’s known as the “Stonegarden” program, where federal grant money is given to local authorities to help them be equipped with handling border security issues. Stonegarden, according to Dannels, is a “force multiplier when it comes to community and highway interdiction to those that smuggle drugs and smuggle humans. ” Wilmot, on the other hand, asked Kelly to have President Donald Trump’s administration bring back Operation Streamline, which allowed for immigration judges to criminally charge illegal immigrants in large groups, rather than by an individual basis. Estrada, the lone Democrat in the meeting, was the only law enforcement official during the meeting to question the validity of a border wall, versus other solutions. “I think that’s still an open question, being that we’re unique all along the border from San Diego to Brownsville,” Estrada told AZ Central. “It requires different approaches. In some places, you may not even need a wall. ” Trump has long made immigration one of his top priorities, and has often called for programs which were previously cancelled by the Obama administration to be reinstated to modernize the nation’s border crisis. John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742564220.5296197}