{"duration": 0.15576863288879395, "input_args": {"text": "'LOS ANGELES  —   Last month, when the      of Hostess Brands plunked down $100 million for the Playboy Mansion, the snickering was instant: Hugh Hefner’s pleasure palace had sold to the maker of snack cakes like Twinkies and Ho Hos. The buyer, J. Daren Metropoulos, heir to a fortune built on Chef Boyardee meatballs, Pabst Blue Ribbon beer and Bumble Bee tuna, sure seemed to fit the playboy bill. He was the kind of guy who, judging by a quick web search, could put even Mr. Hefner to   shame. One photo showed the young tycoon posing with a P. B. R. tall boy on a private jet while wearing sunglasses and a trucker hat. Another found him whooping it up at the Playboy Mansion with Snoop Dogg and several Playmates. A sordid TMZ moment resurfaced  —   a former girlfriend, the 2002 Playmate of the Year, claimed in a 2009 lawsuit (since dismissed) that Mr. Metropoulos had assaulted her  —   and a close relationship with his older brother only appeared to complete the picture. As Evan Metropoulos once told a night life reporter for The New York Times, as Daren lounged nearby, “I’ve been with more chicks than any fat guy you know, except Pavarotti. ” Classy. But something didn’t quite add up. For a start, none of the usual suspects in Los Angeles knew this supposed mover and shaker. I called party promoters, paparazzi, neighbors (Daren Metropoulos has lived next door to the Playboy Mansion in Holmby Hills since 2009) and Hollywood agents who make it their business to know everyone in town with money to burn. Their repeated response: “Daren who?” Mr. Metropoulos and his family, including the patriarch, C. Dean Metropoulos, declined interview requests. So did Mr. Hefner. Two real estate agents who worked on the sale, which includes a stipulation that Mr. Hefner, 90, and his wife, Crystal Harris, 30, can continue to live in the mansion until his death, did not respond to queries, although a third agent involved, Jeff Hyland, added an interesting tidbit: The Metropouloses had tried to buy the Playboy Mansion six years earlier and failed. “The offer then was for about $75 million,” Mr. Hyland said. Adding to the mystery, the few people who did agree to speak on the record about Mr. Metropoulos (pictured on his company’s website in a pinstriped suit against a row of   books) described him as a saintly homebody. “He’s not some bratty billionaire’s son in any way, shape or form,” said Andrew van der Vord,   of consumer investment at Royal Bank of Canada, who helped the Metropouloses sell Pabst Brewing for $700 million in 2014. (They bought it for $250 million in 2010 Daren and Evan Metropoulos, rather controversially, served as   executives.) “Daren is a quiet, unassuming guy,” Mr. van der Vord continued. “He’s very polite and considerate. There’s a really nice demeanor to him, actually. ” Bill Toler, the chief executive of Hostess, told me that Mr. Metropoulos had worked in the family food businesses since he was a teenager. “I was always impressed by the way Daren wanted to learn how to do things the right way,” Mr. Toler said. “He would go spend a day working at retail. He would delve into marketing and then go learn how the sales department operated. ” Mr. Toler added: “I assure you, his interest in the Playboy Mansion is very pure. He’s not the new Hugh Hefner. That’s just silly. ” But I still had unanswered questions. What are his interests? Sports? Art? Travel? Nobody seemed to know. A spokeswoman for the Metropoulos family did confirm that Mr. Metropoulos, who grew up in Greenwich, Conn. did not graduate from college, having dropped out after his sophomore year to work for his father. He had been studying business at the University of Connecticut. If Mr. Metropoulos, who has never married and has no children, is as ordinary as family friends insist, preferring a night at home to hanging at Chateau Marmont  —   and yet still has an unruly public image  —   he may be the perfect fit for the Playboy Mansion. Purchased by Mr. Hefner in 1971 for about $1 million, the     estate (replete with a zoo license and   fireworks permit) now bears little resemblance in reality to its mythic reputation. The stone house was built in 1927 for an heir to the Broadway and Bullock’s department store fortune. Located a few hundred feet off Sunset Boulevard, the property is valuable because it abuts the Los Angeles Country Club. Neighbors include the music mogul Jimmy Iovine the Google kingpin Eric Schmidt and Alexandra von Furstenberg and her husband, Dax Miller, who has become a friend to Mr. Metropoulos. (Mr. Miller did not respond to an interview request.) The Playboy Mansion’s history as a den of iniquity is true, but most of the more libidinous stories date from the distant past. These days, the parties are primarily of a corporate nature, and upkeep has been slight. A few years ago, for an article on Mr. Hefner, I was given a daytime tour of the house and grounds. It was gross. The famous grotto pools, linked in 2011 to an outbreak of Legionnaires’ disease, reminded me of one of those fetid animal enclosures at a   marine exhibit. Don’t get me started on the bathroom off the mansion’s main hall. There is a separate house that contains arcade games and has bedrooms with carpeting I could only describe as crispy. Whether hipster doofus or titan of industry  —   or a bit of both  —   Mr. Metropoulos may have plans for the Playboy Mansion that go beyond what has been reported. The official line is that Mr. Metropoulos, with a passion for architecture and history, wants to restore the estate and connect it to his adjacent compound. Mr. Metropoulos bought his current home from Mr. Hefner for $18 million in 2009 the previous occupants were Mr. Hefner’s former wife Kimberley Conrad and their two sons. “The heritage of this property transcends its celebrity, and to have the opportunity to serve as its steward would be a true privilege,” Mr. Metropoulos said in a statement last month. (The deal had not closed escrow as of Friday.) But living quietly on Charing Cross Road may not be the intention. “If there is anybody who can make Playboy more interesting, more relevant, it’s Daren,” Mr. van der Vord said. “It will be fascinating to watch what he does with that brand. ” Wait a minute. Mr. Metropoulos did not buy Playboy Enterprises, which continues to run a licensing business and publish its flagship magazine. But the struggling company has been for sale. And it would seem like a perfect fit for the Metropouloses, who specialize in taking timeworn products  —   albeit mostly edible ones  —   and dusting them off. The young Mr. Metropoulos is skilled, according to his corporate biography, in developing marketing campaigns that “connect brands with contemporary audiences and regain relevance, both in the marketplace and pop culture. ” When the family owned Chef Boyardee, Mr. Metropoulos contributed to a successful ad campaign featuring pro wrestlers. At Pabst, he promoted the company’s   brews with celebrity endorsements. (Hence the Snoop Dogg party.) Whatever his plans for the mansion, Mr. Metropoulos will have to contend with the Holmby Westwood Property Owners Association. “Our antennae are up,” said Sandy Brown, the group’s president. “Any new uses  —   a private club, some kind of hotel  —   will certainly get community pushback. ” One reason for the trepidation: Mr. Metropoulos has been a hotelier before. In 2003, Dean Metropoulos spent $10. 9 million for the tattered Castle at Tarrytown in New York. Daren took a particular interest in the refurbishment, pouring himself into plans for a spa, the overhaul of a restaurant and minutiae like drapery selection, according to Gilbert Baeriswil, the hotel’s former general manager. “I remember him saying over and over, ‘I want to see more carpet samples,’” said Mr. Baeriswil, who now runs the Trapp Family Lodge in Stowe, Vt. When he found out that Mr. Metropoulos was buying the Playboy Mansion, Mr. Baeriswil said he reached out to his former boss. “I told him: ‘Wow! What a purchase! With all of those rooms, you’re going to need an innkeeper,’” Mr. Baeriswil recalled. “And he said: ‘Sounds like a great idea. Let’s put a plan together. ’”'"}, "time": 1742628402.8185997}