{"duration": 0.05603337287902832, "input_args": {"text": "'By Jason Easley on Fri, Oct 28th, 2016 at 10:57 am It is a cruel reality of American electoral politics that the losers of presidential campaigns get banished from national discourse, and that process has already begun for Donald Trump. Share on Twitter Print This Post \\nIt is a cruel reality of American electoral politics that the losers of presidential campaigns get banished from national discourse, and that process has already begun for Donald Trump. \\nDespite the fact that Trump has been claiming that the presidential election is going to be rigged, stolen, or unfair, his cries are beginning to fall on deaf ears. The latest Washington Post tracking poll found that confidence that votes will be counted correctly grew by 12 points from 31%-43%. The number of respondents who believed that voter fraud occurs somewhat often has dropped from 47%-37%, and those expressing concerns that all votes will be counted accurately dropped from 34% to 28%. Even Trump supporters are split 50%-49% on whether or not votes will be counted accurately. \\nPart of the shift is likely due to the effective job that President Obama did in addressing these concerns, but it is most likely that voters are treating Trump like the candidate who is going to lose the election. \\nOne of the best indicators of a presidential election’s outcome as election day draws near is the question of who voters think will win. \\nHillary Clinton is dominant on the question of who voters believe will win the election, which is a hint of the way that people are voting. \\nThe process of tuning out the losing candidate has a long history in the US two party system. Losing candidates who refuse to go away, like Sarah Palin, are viewed as annoying relics who refuse to acknowledge that their time is up. \\nTrump’s fifteen minutes of fame on the national stage appear to be coming to an end. His words can still poison and damage our country at a cultural level, which is why he still needs to be discussed, but as far as changing minds and winning an election, it looks voters are in the process of banishing Trump from the political island.'"}, "time": 1742561924.9699695}