{"duration": 0.053164005279541016, "input_args": {"text": "'by Alliance for Natural Health – USA \\nAnother in a long list of reasons to avoid this drug. \\nA recent study found that boys exposed to acetaminophen (Tylenol) before birth were more likely to have symptoms of autism during childhood. \\nThis isn’t the first time that scientists have reported a connection between using this drug during pregnancy and brain and behavior abnormalities in children. Other studies show that exposure to acetaminophen raised the risk of developing ADHD (attention deficit hyperactivity disorder) by 40%. Another study found that women taking it increased the risk of their child having behavioral problems by 70%. \\nPregnant mothers aren’t the only ones who should avoid acetaminophen and other common painkillers like NSAIDS (non-steroidal anti-inflammatory drugs)—a class that includes drugs like Advil, Celebrex, and Aleve. \\nConsider the following: By the FDA’s own calculation , acetaminophen was the leading cause of liver failure in Americans between 1998 and 2003, and there’s no reason to think that this has changed in the years since. Every year, 78,000 people go to the emergency room from acetaminophen overdose , whether accidental or intentional. The problem is so bad that the FDA asked doctors to stop prescribing any medication that has more than 325 mg of acetaminophen per dose. Of course, this ignores the fact that if people feel the prescribed dose isn’t cutting the pain, many think nothing of taking an extra tablet or two. \\nNSAID pain relievers like aspirin or ibuprofen are similarly problematic: One study conservatively estimated that 107,000 people are hospitalized each year for NSAID-related gastrointestinal complications and “at least 16,500 NSAID-related deaths occur each year among arthritis patients alone.” Another study showed that patients who take NSAIDs have a 90% greater likelihood of dying from all causes. Daily or long-term use of aspirin doubles the risk of internal bleeding and does not reduce heart attack risk for people with no history of heart problems. \\nGetting back to acetaminophen in particular—given all of its terrible side effects, why does the FDA remain silent? The most likely answer is simply that it is a very profitable drug to sell. \\nRead the full article at ANH-USA.org. Published on November 1, 2016'"}, "time": 1742561904.976249}