{"duration": 0.05786275863647461, "input_args": {"text": "'Man coolly gets to ATM machine after flashing Samsung Galaxy Note 7 to queue Posted on \\nThe Delhi Police have arrested an 18-year old boy, Samarth Sanghi, on charges of creating panic and endangering public safety. The arrest occurred after Sanghi inadvertently ended up dispersing a long ATM queue by flashing his Samsung Galaxy Note 7. ( Image via intoday.in ) \\nSam Sang, as he is colloquially known, was petrified during his police interrogation. “I have no idea what’s going on. I was waiting at this long ATM queue at Khan Market and out of sheer boredom, I decided to take a selfie with my Samsung Galaxy Note 7. I signaled to those gathered to pose for my selfie, but the moment they saw the device, they let out loud shrieks and ran helter skelter and a mini-stampede ensued. Some even screamed ‘ Bhaago!’ . (Escape!) I was stunned to see the queue vanish. I coolly walked into the unguarded ATM and drew my 2000 bucks for the day. The next thing I know, the Delhi police are at my doorstep and here I am, all locked up,” a teary-eyed Sanghi sobbed to The UnReal Times . \\nSang, however, was soon visited by Congress Vice President Rahul Gandhi, who carried his own Note 7 to the police station. “ Mere paas sirf aloo ki factory nahin, Note 7 ki factory bhi hai! Mujhe bhi giraftaar kar lo bhaiya !” ( Not only do I have a potato factory, but also a Note 7 factory. Arrest me too! ) the Nehru-Gandhi scion thundered squealed, rolling his sleeves up. “If we empower the villages, we can wipe out Note 7s in 7 minutes,” Gandhi added. \\nDelhi Chief Minister Arvind Kejriwal tore into PM Modi and Lt. Gov Najeeb Jung over Sang’s arrest. “As it is, the psychopath Modi has full control over the Delhi thullas . The whole world knows about the LG vs Samsung rivalry, so it’s no surprise that our LG has taken special interest in this case and asked the thullas to arrest Sang. Modi ji , if you have the guts, arrest me! Yeh Kejriwal aapse darne wala nahi !” (this Kejriwal isn’t scared of you!) the AAP chief bellowed. \\nFinance Minister Arun Jaitley voiced his concerns over the incident in an exclusive interview to NDTV’s Barkha Dutt. “Barkha, I appeal to the people of the country to avoid the inadvertent sabotaging of what could be a historic, pervasively successful scheme. Coming to the specifics of this case, I would urge all my fellow citizens of this great nation, in possession of Note 7s to switch them off before arriving at the ATM queues, taking into consideration, the larger public interest. Failure to do so will have me introduce a new Note7 Cess and impose it among the device owners,” the Finance Minister winked. \\nThe final word, however, went to the PM Modi himself. “NOTE stands for Nefarious, Outrageously Threatening Explosive,” the PM tweeted. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742564044.9883187}