{"duration": 0.06913614273071289, "input_args": {"text": "'Get short URL 0 6 0 0 Amid escalating tensions in Eastern Europe, the US Army will soon arm its Stryker combat vehicles with a laser weapons system. \\nThe laser, developed by General Dynamics Land Systems, is currently being tested and is expected to be ready within the next 11 months. © AP Photo/ Alik Keplicz US General Reveals Details on NATO Troops Deployment in Poland \\n\"The idea is to provide a solution to a capability gap which is an inability to acquire, track and destroy low, slow drones that proliferate all over the world,\" said Tim Reese, director of strategic planning, according to Business Insider . \\nMounted on US Army Stryker vehicles, the lasers will likely be used to shoot down enemy drones. The weapon could also be fine-tuned to target incoming munitions. \\n\"The energy of the laser damages, destroys and melts different components of the target,\" Reese said. \"We’ve clearly demonstrated you can take out UAVs pretty effectively,\" Mary Miller, Deputy Assistant Secretary, Research and Technology, added. \"Now we are not only working on how we take out UAVs but also mortars and missiles – and eventually cruise missiles.\" Scared of Russian BMPs, US Strykers in Europe to Get 30mm Guns \\nLaser weapons offer a number of benefits. Ammunition, for instance, is virtually unlimited, so long as enough power can be generated to create a beam. The USS Ponce was one of the first US military units to be fitted with a mounted laser weapon, since a ship can easily mobilize the large power generators necessary. Stationary laser weapons have also been placed at military bases for the same reason. Shrinking these power sources to fit a vehicle as small as a Stryker was a unique challenge. \\nEven with the high-energy requirements, lasers are comparatively cost-effective. \\n\"The shot per kill (with lasers) is very inexpensive when the alternative is sending out a multi-million dollar missile,\" Miller said. \\nA number of US Strykers are based in Europe as part of the US Army’s 2nd Cavalry Regiment. Those units have already undergone upgrades to the 30mm cannon, at a cost of $3.8 million per vehicle. © REUTERS/ Agencja Gazeta/Adam Stepien \\nThe Stryker squadron, based in Germany, will play a role in NATO’s increased presence in Poland and the Baltics. \\n\"This is credible deterrence,\" NATO Secretary General Jens Stoltenberg said on Tuesday, according to Stars and Stripes. \"Concrete proof that NATO can and will deploy thousands of forces to support our allies. And a clear demonstration of our transatlantic bond.\" \\nSince 2014, NATO has been building up its military presence in Europe, especially in Eastern European countries neighboring Russia, using Moscow\\'s alleged interference in the Ukrainian conflict and its potential for \"aggression\" against neighboring states as a pretext. \\nMoscow has repeatedly denied the claims and warned NATO that the military buildup on Russia\\'s borders is provocative and threatens the existing strategic balance of power. ...'"}, "time": 1742561890.8900692}