{"duration": 0.13222789764404297, "input_args": {"text": "'Sitting on a bar stool, the glass in front of him mostly drained, the actor Richard Roxburgh leaned in to make a point. It was early afternoon on a Tuesday, but the muscles in his jaw were slack, his blue eyes vague. He spoke with quiet urgency, his words faintly misshapen, and when he gestured for emphasis, he didn’t seem to notice that his hands were right in my face. The sober boundaries of social behavior had dissolved, abruptly, in an alcoholic haze. That was the idea, of course. Perched in the window of an espresso bar on West 47th Street, drinking nothing stronger than a cortado, Mr. Roxburgh, 55, was demonstrating a   skill: playing drunk. “In terms of the study of alcohol and its effects, I probably have an unfair advantage in that I am, A, Australian, and, B, an actor,” he said, his eyes perfectly clear now, glinting with humor. “I’ve had probably an unhealthy overexposure to the shenanigans of booze over time. ” If so, he’s putting it to good use. Through March 19 at the Ethel Barrymore Theater, he’s starring opposite Cate Blanchett in “The Present,” a Chekhov adaptation that floats along on a vodka tide, gradually snaring his character, Mikhail, in the undertow. (It does not help that Mikhail downs a whole bottle of the stuff in Act III.) Back home, on the Australian television series “Rake,” Mr. Roxburgh has spent several seasons playing a different sort of alcoholic, a lawyer determined even in middle age to keep the party going. Performing drunkenness requires striking what is, for many actors, an elusive balance  —   somewhere between sloshy and straight. “Seeing bad drunk acting is probably like watching an actor trying to squeeze out tears,” Mr. Roxburgh said. “It’s kind of     excruciating. ” This is his advice for getting it right. “That would be my first question always: Why are you doing it?” Mr. Roxburgh said. “Because we all do it for a reason. ” How to play the character, and the drunkenness, depends in part on the answer. “A lot of what I do is instinctual in a way,” Mr. Roxburgh said, “and it’s based on observations that I made over a life of being surrounded by Australian actors, and stealing from it. ” Well, that and muscle memory a family man these days, he drinks less than he used to. But he’s familiar with the moment when a pleasant buzz gives way to a loss of control, and he recognizes the difference between sanguine drunks and the darker sorts, like Mikhail, whose vodka demons keep him company. Mr. Roxburgh stood up, planting his feet some distance apart. “There’s a stance that might happen at a certain point, which is a kind of slightly wider leg stance. If your legs are together, your center of gravity is a much more dangerous element, and you will literally fall over. A very drunk person, the room is doing this for them,” he said, tilting his arms from one side to another. “It’s as if they’re on a ship at sea. ” That doesn’t mean they will lurch or clutch, but they might rest a hand on a chair, “just for a little bit of support,” a fixed point of physical reference. “The more you try and stand up straight, there’s always a part of you that has to know the world is spinning. ” “There’s also a very subtle kind of tipping that might happen in the body,” Mr. Roxburgh said, and as he leaned, his eyes clouded over. For a moment, he might have been utterly wasted. “Another element is the gaze, which is that famous   thing where somebody is talking to you, but they’re not quite there. The world is bleary to them, and your face at a certain point becomes, to all intents and purposes, pixelated. So they’re not looking with any clarity into your eyes. ” “It’s fascinating reading things like the police studies into blood alcohol levels and what they actually do to your response times” behind the wheel, Mr. Roxburgh said. “The same thing obviously applies in terms of your conversation, your responses, the way you inhale and feed out information just in the normal sense of conversation when you’re drunk. “But it can be very subtle stuff, I suppose the way you might slightly stutter on a word or rethink the way that you’re going to go into a sentence. It blocks clear thinking that’s a fact. ” Counterintuitive, yes, but Mr. Roxburgh was adamant that this is an essential part of playing drunk: struggling against the sloppier effects of inebriation rather than giving in to them. “Remember that the person that you’re playing almost invariably doesn’t want to appear drunk,” he said. “In bad drunk acting, you see somebody wobbling around all over the place and slurring their words in a very overt way. ” In the real world, though, the   try to get their minds and bodies to obey the normal rules: speaking clearly, making sense, not falling over. And it’s precisely that extra focus that can give their game away. The more determined they are not to seem drunk, Mr. Roxburgh said, the more clearly drunk they will seem.'"}, "time": 1742563246.975782}