{"duration": 1.399719476699829, "input_args": {"text": "'This article was first published in 2002. The author, a longtime Times photographer, died on Saturday. I STARTED photographing people on the street during World War II. I used a little box Brownie. Nothing too expensive. The problem is I’m not a good photographer. To be perfectly honest, I’m too shy. Not aggressive enough. Well, I’m not aggressive at all. I just loved to see wonderfully dressed women, and I still do. That’s all there is to it. As a kid, I photographed people at ski resorts  —   you know, when you got on the snow train and went up to New Hampshire. And I did parties. I worked as a stock boy at Bonwit Teller in Boston, where my family lived, and there was a very interesting woman, an executive, at Bonwit’s. She was sensitive and aware, and she said, “I see you outside at lunchtime watching people. ” And I said, “Oh, yeah, that’s my hobby. ” She said, “If you think what they’re wearing is wrong, why don’t you redo them in your mind’s eye. ” That was really the first professional direction I received. I came to New York in 1948 at 19, after one term at Harvard. Well, Harvard wasn’t for me at all. I lived first with my aunt and uncle. I was working at Bonwit’s in the advertising department. Advertising was also my uncle’s profession. That’s why my family allowed me to come here and encouraged me to go into the business. I think they were worried I was becoming too interested in women’s dresses. But it’s been my hobby all my life. I could never concentrate on Sunday church services because I’d be concentrating on women’s hats. While working at Bonwit’s, I met the women who ran Chez Ninon, the custom dress shop. Their names were Nona Parks and Sophie Shonnard. Ailsa Mellon Bruce was the silent partner. Those two women didn’t want me to get mixed up in fashion either. “Oh, God, don’t let him go near it. ” You have to understand how suspect fashion people were then. But finally, when my family put a little pressure on me about my profession, I moved out of my uncle’s apartment. This was probably in 1949. I walked the streets in the East 50’s, looking for empty windows. I couldn’t afford an apartment. I saw a place on 52nd Street between Madison and Park. There was a young woman at the door, and I said: “I see empty windows. Do you have a room to rent?” She said, “What for?” And I said, “Well, I’m going to make hats. ” She told me to tell the men who owned the house that I would clean for them in exchange for the room on the top floor. So that’s where I lived, and that’s where my hat shop was. Elizabeth Shoumatoff, the artist who was painting President Franklin D. Roosevelt when he died, brought in Rebekah Harkness, Mrs. William Hale Harkness. She and the ladies from Chez Ninon sent clients over. They had to climb all those stairs, and the stairs were narrow. The place had been a speakeasy in the 1920’s. There was a garden in the back with a lovely old Spanish fountain, all derelict. That’s where I had my first fashion show. The only member of the press who came was Virginia Pope of The Times. I got to know her very well years later  —   saw her almost every Friday for tea. But anyway, her rule was to go herself to see any new designer. So there was this lovely, gracious lady at my first show, and the next day in The Times there was a little paragraph: “William J. ” See, I didn’t use my last name. My family would have been too embarrassed. They were very shy people. This was maybe 1950. To make money, I worked at a corner drugstore. At lunchtime, I’d stop making hats and run out and deliver lunches to people. At night, I worked as a counterman at Howard Johnson’s. Both jobs provided my meals, and the dimes and nickels of my tips paid for millinery supplies. Society women were coming to get hats. It was a good education, but I didn’t know it. I didn’t know who these people were. It didn’t mean anything to me. And then, of course, you get to realize that everybody’s the same. I made hats until I went into the Army. I was drafted during the Korean War. When I came out in 1953, I was still looking for empty windows. I found one on West 54th. John Fairchild had just come back from Paris to run Women’s Wear Daily in New York, and he knew the ladies of Chez Ninon. John said to me, “Why don’t you come and write a column for us. ” Of course, the ladies at Chez Ninon were thrilled: “Oh, good, get him away from fashion. Make him a writer. ” They didn’t realize what John was really up to. He thought, Now, I’ve got the inside track on the clients at Chez Ninon, which was every Vanderbilt and Astor that there was. Plus Jackie Kennedy. What John didn’t realize was that the people at Chez Ninon never discussed the clients. Private was private. I had never written anything, but John was like that. He wanted to turn everything upside down. He just said, “Write whatever you see. ” He was open to all kinds of ideas  —   until I wrote a column about Courrèges. When I saw his first show, I thought, Well, this is it. But John killed my story. He said, “No, no, Saint Laurent is the one. ” And that was it for me. When they wouldn’t publish the Courrèges article the way I saw it, I left. They wanted all the attention on Saint Laurent, who made good clothes. But I thought the revolution was Courrèges. Of course, in the end, Saint Laurent was the longer running show. So Fairchild was right in that sense. After that, I went to work for The Chicago Tribune, for Eleanor Nangle. She had been there since the 1920’s. A wonderful woman. The best of the best. The Tribune had an office in New York, in the Times building. One night, in about 1966, the illustrator Antonio Lopez took me to dinner in London with a photographer named David Montgomery. I told him I wanted to take some pictures. When David came to New York a few months later, he brought a little camera, an Olympus    . It cost about $35. He said, “Here, use it like a notebook. ” And that was the real beginning. I HAD just the most marvelous time with that camera. Everybody I saw I was able to record, and that’s what it’s all about. I realized that you didn’t know anything unless you photographed the shows and the street, to see how people interpreted what designers hoped they would buy. I realized that the street was the missing ingredient. There’s nothing new about this idea. People had been photographing the street since the camera was invented. At the turn of the 20th century, the horse races were the big thing. Lartigue was just a boy then. But the Seeberger brothers in France were taking pictures. They, and others, were commissioned by lace and fabric houses to go to the grand prix days at the Longchamp, Chantilly, Auteuil and Deauville racetracks and photograph fashionable women. The resulting albums were used as sample books by dressmakers. Vogue and Harper’s Bazaar were doing a similar thing, but they photographed only name people at society events. And Women’s Wear has been photographing socialites and celebrities for years. But the difference for me is I don’t see the people I photograph. All I see are clothes. I’m only interested in people who look good. I’m looking for the stunners. I started taking pictures for The Times in the early 70’s, though my first street fashion appeared in The Daily News. Bernadine Morris, whom I had known since the 50’s, said to Abe Rosenthal: “Take a look at his work. You have all these sections to fill. ” Then I got to know Arthur Gelb, and one day I told him about this woman I had been photographing on the street. She wore a nutria coat, and I thought: “Look at the cut of that shoulder. It’s so beautiful. ” And it was a plain coat, too. You’d look at it and think: “Oh, are you crazy? It’s nothing. ” Anyway, I was taking her picture, and I saw people turn around, looking at her. She crossed the street, and I thought, Is that? Sure enough, it was Greta Garbo. All I had noticed was the coat, and the shoulder. Arthur was marvelous. I came in that morning in late December 1978, and no one was in the department except Mimi Sheraton, the restaurant critic. I showed her the Garbo picture. She stopped typing, got up, and away she went with the picture. Minutes later, the phone rang, and Mimi said: “Come down here, Bill. Arthur’s desk. ” Arthur looked at the picture and said, “What else do you have like this?” I had been hanging out at the corner of 57th and Fifth, and I said, “A picture of Cornelius Vanderbilt Whitney, the king and queen of Spain, a Kennedy in a fox coat. ” I also had a picture of a woman who turned out to be Farrah Fawcett. I didn’t know. See, I never go to the movies, and I don’t own a television set. Arthur said, “Let’s run these. ” The next day, Dec. 30, there was a half page of pictures in the Metropolitan Report. I never bothered with celebrities unless they were wearing something interesting. That’s why my files wouldn’t be of value to anyone. I remember one April in Paris Ball when Joe DiMaggio came with Marilyn Monroe. But I was mesmerized by Mrs. T. Charlton Henry of Philadelphia. So chic. She’d take the train up in the morning to Penn Station and walk to Bergdorf, to be there when it opened. And when she came in, she’d say, “Good morning, Miss Ida,” “Good morning, Miss Elizabeth. ” She knew everyone’s name. Back in the 60’s, I remember that Eleanor Nangle and I were sitting at one of Oscar de la Renta’s first shows in New York when she heard antiwar protesters down in the street. She said: “Come on, Bill, we’re leaving. The action isn’t here. ” We got up and skipped out of the show. I knew from photographing people on the streets that the news was not in the showrooms. It was on the streets. At The Times, when Charlotte Curtis was covering society, she called me one Easter Sunday and said, “Bill, take your little camera and go quickly to Central Park, to the Sheep Meadow. ” That morning I had been on Fifth Avenue photographing the Easter parade. So I got on my bike and went up to the Sheep Meadow, and there before me were all the kids  —   the flower children. All these kids dressed in everything from their mother’s and grandmother’s trunks, lying on the grass. It was unbelievable. It was all about the fashion revolution. And it was because Charlotte Curtis had called me on the phone. MOST of my pictures are never published. I just document things I think are important. For instance, I’ve documented the gay pride parade from its first days. It was something we had never seen before. I documented every exhibition that Diana Vreeland did at the Met, but every picture is of her hand on something. I do everything, really, for myself. I suppose, in a funny way, I’m a record keeper. More than a collector. I’m very aware of things not of value but of historical knowledge. I remember when Chez Ninon was closing in the  ’s. I went in one day, and the files were outside in the trash. I said to the secretary, “Well, I hope you gave all the letters from Jackie Kennedy and Mrs. Rose Kennedy to the Kennedy Library. ” And she said, “No, they kept a few, but they felt that the rest were too personal, so they threw them out. ” I rescued everything I could and still have it. I go to different places all the time. And I try to be as discreet as I can. My whole thing is to be invisible. You get more natural pictures that way, too. The only place where I really hung out was the old Le Cirque on 65th Street. My friend Suzette, who did the flowers there, has been with Sirio Maccioni since he got off the boat from Europe, when he was a captain at the old Colony restaurant. Everyone said Suzette tipped me off, but she couldn’t have cared less about who was there. Most people wouldn’t believe that anyone would be so dumb to come every day and stand for two hours without knowing whether somebody was coming out. But I like the surprise of finding someone. Most photographers couldn’t do what I do because of deadlines. You spend days, weeks, years waiting for what I call a stunner. I think fashion is as vital and as interesting today as ever. I know what people with a more formal attitude mean when they say they’re horrified by what they see on the street. But fashion is doing its job. It’s mirroring exactly our times. The main thing I love about street photography is that you find the answers you don’t see at the fashion shows. You find information for readers so they can visualize themselves. This was something I realized early on: If you just cover the designers in the shows, that’s only one facet. You also need the street and the evening hours. If you cover the three things, you have the full picture of what people are wearing. I go out every day. When I get depressed at the office, I go out, and as soon as I’m on the street and see people, I feel better. But I never go out with a preconceived idea. I let the street speak to me.'"}, "time": 1742563642.8154087}