{"duration": 0.046988487243652344, "input_args": {"text": "'California State Senate President Pro Tem Kevin De Léon (  Angeles) said last Tuesday that “half his family” was in the country illegally, using false documents, and eligible for deportation under President Trump’s new executive order against “sanctuary” jurisdictions. [De Léon, who introduced the bill, made his remarks at a hearing in Sacramento on SB54, the bill to make California a “Sanctuary State. ”  He said (at 1:27:34 in the video that follows):   …     I can tell you half of my family would be eligible for deportation under [President Donald Trump’s] executive order, because if they got a false Social Security card, if they got a false identification, if they got a false driver’s license prior to us passing AB60, if they got a false green card, and anyone who has family members, you know, who are undocumented knows that almost entirely everybody has secured some sort of false identification. That’s what you need to survive, to work. They are eligible for massive deportation. Testifying before the Senate Public Safety Committee, De Léon defended the widespread practice by illegal aliens of using fraudulent documents to work and obtain   benefits, dismissing any concerns California citizens may have about being the target of identity theft. In an interview the following day on KPCC 89. 3’s Air Talk with Larry Mantle, De Léon expressed outrage that President Trump’s executive order would include those who possess fraudulent documents or committed identity theft to obtain a Social Security number. “Someone simply who received or purchased a [fraudulent] Social Security card down at McArthur Park, or elsewhere in my district would be eligible immediately for mass deportation,” De Léon said (at 11:45 in the link above). “He’s trying to deputize police officers  —   and with the suspicion of someone being a criminal or having a broken taillight, that they themselves, as a local police officer, could call the ICE agents immediately and have that person deported without even legal due process. ” Host Larry Mantle asked him: “  …     First of all, I just  —   I want to make sure I understand correctly: You don’t think purchasing a phony Social Security card and number should be a deportable offense?” De Léon replied: “I don’t think so   …     the vast majority of immigrants  —   hard working immigrants  —   have done that.  I can tell you I have family members specifically who came here as undocumented immigrants, and they did the same thing. That’s what you need to do to survive in this economy. ” Mantle objected: “But of course the problem is,  —   and I know people too  —   who’ve had their Social Security numbers and identities stolen as a result of that  …    . ” De Léon minimized the problem, saying it was not the same as “Russian” hacking. Breitbart News’ calls to the President Pro Tem’s office were unreturned. Tim Donnelly is a former California State Assemblyman. Author, Patriot Not Politician: Win or Go Homeless,  '"}, "time": 1742561967.7558694}