{"duration": 0.03729128837585449, "input_args": {"text": "'Actress Lindsay Lohan hit the beach in Thailand last week in a “burkini” swimsuit, as she vacationed in the Southeast Asian country to take a break from her refugee advocacy and studies of Islamic scripture. [According to the Daily Mail, the    Mean Girls star donned the hybrid   swimsuit for a paddleboarding session in Phuket, where she spent two weeks on vacation.  The actress previously spent time visiting family in Dubai, according to snapshots posted to her Instagram account. Lindsay Lohan wearing a   in Thailand, part of her upcoming modest fashion line pic. twitter.   —   bella vita (@drugproblem) April 5, 2017,  Oh Good Lord! Lindsay Lohan has lost her mind —   Well, more of it anyway!😂 There wasn’t much left. Here she is👇sporting a Burkini in Thailand. pic. twitter.   —   Boston🇺🇸Bobblehead (@DBloom451) April 5, 2017,  In a February interview with the Daily Mail, Lohan said she had been studying the Koran for “some time,” but that she had not yet fully converted to Islam. “It’s a process to convert to anything,” she told the outlet. “I respect all religions  …     it’s a beautiful religion and I am a very spiritual person  …     it’s something I’ve been studying. You can’t just convert overnight to a religion. ” That month, Lohan told the New York Post that she was racially profiled for the first time in her life at London’s Heathrow Airport, where she was traveling while wearing an Islamic headscarf. The actress said she wears the headscarf out of “respect” for certain countries to which she travels. In recent months, Lohan has been busy with her advocacy work on behalf of Syrian refugees. The actress met with Turkish President Recep Tayyip Erdogan inside the country’s presidential palace in January, and has previously visited with refugees in hospitals and homes in Istanbul. The “burkini”  swimsuit has previously been at the center of some controversy last year, authorities in the French town of Nice banned the garment, reportedly claiming it posed a risk to public order. A court in Nice later overturned the ban.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563142.3721118}