{"duration": 0.09242796897888184, "input_args": {"text": "'Excerpted from War Is A Lie by David Swanson. \\nW ars are not fought against flags or ideas, nations or demonized dictators. They are fought against people, 98 percent of whom are resistant to killing, and most of whom had little or nothing to do with bringing on the war. One way to dehumanize those people is to replace all of them with an image of a single monstrous individual. \\nMarlin Fitzwater, White House press secretary for Presidents Ronald Reagan and George H. W. Bush, said that war is “easier for people to understand if there’s a face to the enemy.” He gave examples: “Hitler, Ho Chi Minh, Saddam Hussein, Milosevic.” Fitzwater might well have included the name Manuel Antonio Noriega. When the first President Bush sought, among other things, to prove he was no “wimp” by attacking Panama in 1989, the most prominent justification was that Panama’s leader was a mean, drug-crazed, weirdo with a pockmarked face who liked to commit adultery. An important article in the very serious New York Times on December 26, 1989, began “The United States military headquarters here, which has portrayed General Manuel Antonio Noriega as an erratic, cocaine-snorting dictator who prays to voodoo gods, announced today that the deposed leader wore red underwear and availed himself of prostitutes.” Never mind that Noriega had worked for the U.S. Central Intelligence Agency (CIA), including at the time he’d stolen the 1984 election in Panama. (U.S. outrage at interference in elections is extremely new.) Never mind that his real offense was refusing to back U.S. war making against Nicaragua. Never mind that the United States had known about Noriega’s drug trafficking for years and continued working with him. This man snorted cocaine in red underwear with women not his wife. “That is aggression as surely as Adolf Hitler’s invasion of Poland 50 years ago was aggression,” declared Deputy Secretary of State Lawrence Eagleburger of Noriega’s drug trafficking. The invading U.S. liberators even claimed to find a big stash of cocaine in one of Noriega’s homes, although it turned out to be tamales wrapped in banana leaves. And what if the tamales really had been cocaine? Would that, like the discovery of actual “weapons of mass destruction” in Baghdad in 2003 have justified war? \\nFitzwater’s reference to “Milosevic” was, of course, to Slobodan Milosevic, then president of Serbia, whom David Nyhan of the Boston Globe in January 1999 called “the closest thing to Hitler Europe has confronted in the last half century.” Except, you know, for all the other ones. By 2010, the practice in U.S. domestic politics of comparing anyone you disagreed with to Hitler had become almost comical, but it is a practice that has helped launch many wars and may still launch more. However, it takes two to tango: in 1999, Serbs were calling the president of the United States “Bill Hitler.” \\nIn the spring of 1914, in a movie theater in Tours, France, an image of Wilhelm II, the Emperor of Germany, came on the screen for a moment. All hell broke loose. \\n“Everybody yelled and whistled, men, women, and children, as if they had been personally insulted. The good natured people of Tours, who knew no more about the world and politics than what they had read in their newspapers, had gone mad for an instant,” according to Stefan Zweig. But the French would not be fighting Kaiser Wilhelm II. They would be fighting ordinary people who happened to be born a little ways away from themselves in Germany. \\nIncreasingly, over the years, we’ve been told that wars are not against people, but purely against bad governments and their evil leaders. Time after time we fall for tired rhetoric about new generations of “precision” weapons that our leaders pretend can target oppressive regimes without harming the people we think we’re liberating. And we fight wars for “regime change.” If the wars don’t end when the regime has been changed, that’s because we have a responsibility to take care of the “unfit” creatures, the little children, whose regimes we’ve changed. Yet, there’s no established record of this doing any good. The United States and its allies did relatively well by Germany and Japan following World War II, but could have done so for Germany following World War I and skipped the sequel. Germany and Japan were reduced to rubble, and U.S. troops have yet to leave. That’s hardly a useful model for new wars. \\nWith wars or warlike actions the United States has overthrown governments in Hawaii, Cuba, Puerto Rico, the Philippines, Nicaragua, Honduras, Iran, Guatemala, Vietnam, Chile, Grenada, Panama, Afghanistan, and Iraq, not to mention the Congo (1960); Ecuador (1961 & 1963); Brazil (1961 & 1964); the Dominican Republic (1961 & 1963); Greece (1965 & 1967); Bolivia (1964 & 1971); El Salvador (1961); Guyana (1964); Indonesia (1965); Ghana (1966); and of course Haiti (1991 & 2004). We’ve replaced democracy with dictatorship, dictatorship with chaos, and local rule with U.S. domination and occupation. \\nIn no case has a U.S. war clearly reduced evil. In most cases, including Iran and Iraq, U.S. invasions and U.S.-backed coups have led to severe repression, disappearances, extra-judicial executions, torture, corruption, and prolonged setbacks for the democratic aspirations of ordinary people. \\nThe focus on rulers in wars is not motivated by humanitarianism so much as propaganda. People enjoy fantasizing that a war is a duel between great leaders. This requires demonizing one and glorifying another. \\nThis article was originally published at DavidSwanson.org . Share:'"}, "time": 1742564466.7749643}