{"duration": 0.0674896240234375, "input_args": {"text": "'A student at Amherst College in Massachusetts accused of sexual misconduct is being refused the right to defend himself on the basis that it could cause “psychological harm” to his accuser. [The unnamed student was expelled from Amherst College despite arguing that his accuser had actually assaulted him, while a judge blocked his attempt to subpoena his accuser into releasing text messages on the grounds that   the case “would impose emotional and psychological trauma” on her.  “[The student] was blackout drunk at the time —  a detail that Amherst administrators deemed ‘credible,’ on subsequent review,” wrote Reason, who used the “John Doe” placeholder name for the student, before adding, “Of course, it’s questionable whether a blackout drunk student can actually provide the level of consent that Amherst’s sexual misconduct policy requires. ” The incident in question took place years ago, during the late night   early morning hours of February   2012. Jones was Doe’s girlfriend’s roommate at the time. Jones went to Doe’s dorm room and sexual activity ensued: Jones performed oral sex on Doe. But Doe was blackout drunk at the time —  a detail that Amherst administrators deemed “credible,” on subsequent review. Of course, it’s questionable whether a blackout drunk student can actually provide the level of consent that Amherst’s sexual misconduct policy requires. Other factors cast doubt on the idea that Jones was the victim and Doe the perpetrator. After leaving Doe’s dorm room, Jones texted another male student and asked him to come to her dorm room for sex. She also texted a residential advisor about her “stupid” decision to engage in sexual activity with her roommate’s boyfriend. In these text messages, Jones admitted that she was “not an innocent bystander. ” She also complained about how long it was taking this second male student to do anything sexual with her. She did not file a complaint against Doe until two years later. Based upon the “preponderance of the evidence” standard that was established by the Obama administration, Doe was expelled from Amherst. Legal scholars KC Johnson and Stuart Taylor of The Volokh Conspiracy at The Washington Post argue that the preponderance standard established by the “Dear Colleague” letter of the Obama administration “told all of the more than 7, 000 colleges that receive federal money to use the lowest possible standard of proof” in determining the outcome of sexual assault cases on college campuses. President Trump’s Secretary of Education nominee Betsy DeVos was harshly criticized by the left for donating to the Foundation for Individual Rights in Education (FIRE) which supports the notion that the burden of proof in campus sexual assault cases should be higher and that all accused should be afforded proper due process. Tom Ciccotta is a libertarian who writes about social justice and libertarian issues for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742562014.9570646}