{"duration": 0.0752115249633789, "input_args": {"text": "'A sports writer for ESPNW used her recent column on women’s college swimming to scold America for being “obsessed” by gender, all while pushing the genderqueer or   political ideology on readers. [In a discussion of University of Michigan women’s swim team member G Ryan, ESPNW writer Katie Barnes notes that Ryan “identifies as genderqueer or  . ” She goes on to insist that the pool is “an oasis in a society obsessed with gender. ”  That “obsession,” Barnes claims, creates “issues for Ryan where there do not need to be. ” Indeed, Ryan goes on to complain about her sport, saying, “It’s still hard to get up and put on a suit some days. It’s not the best sport. You’re wandering around half naked for hours at a time. ” Barnes seems to find the subject difficult too, as throughout the piece she refers to Ryan  —   who was born female  —   as “they” every time a personal pronoun is needed in the article. Barnes notes that Ryan demands that people call her “they” or “them” when talking of her, according to Newsbusters. org, As Barnes notes,   is used as a “  option to the more common   or   pronouns because they better reflect their identity as genderqueer. ” The University of Michigan bent over backwards to accommodate Ryan’s demands for the use of  . Barnes writes: Ryan came out to the team as   nearly a year ago  …     Over the past year, the team has made adjustments to the language it uses because, frankly, Ryan’s presence challenges the very binary that governs classification in athletics. The team Ryan swims on is commonly referred to as “Team 42” rather than the women’s team (it is the 42nd edition of the “women’s” team) and emails are addressed using   language such as “Blue” or “All Michigan athletes. ” Barnes’ revelations of how Coach Mike Bottom is dealing with all this is typical of the tortured logic and grammar employed to bend to Ryan’s demands (my bold): “We sing about their growth,” Michigan swimming and diving coach Mike Bottom said of Ryan. “As they begin to understand themselves, there’s been a strength that’s moved into the water, and out of the water. That’s been the excitement. ” Naturally, Barnes had to shift from Ryan’s complaints, and the Michigan swim team’s reaction, to politics. It is a simple change but not an easy one. Ryan’s presence asks the complicated question, of what does inclusion of   athletes look like in an athletic system defined as a binary? There is no simple answer to that question, and it is one being grappled with across the United States. At times the lack of understanding of trans identity is used as a cudgel to ostracize trans people, as seen in North Carolina with HB2 and more recently in Texas with Mack Beggs and the consideration of SB6. But as Newsbusters’ Jay Maxson notes, there has been a lot of use of the “cudgel” to “ostracize” Americans who want to continue recognizing biological and traditional gender identifications, not to mention those who have safety and religious concerns. So, while ESPN’s Barnes slams the country for this “obsession with gender,” she indulges her own obsession with rewriting the rules for how we address gender. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742564424.6060452}