{"duration": 0.08352184295654297, "input_args": {"text": "'Email \\nI was living in New York City when Patty Hearst was kidnapped in February 1974. Like millions of others at the time, I followed the unfolding story with interest. At a time when news was relayed via the radio, newspapers and a daily evening news show, there was plenty of time to speculate what lay behind the actual story. In other words, there weren’t self-appointed experts on every 24-hour news channel telling the viewer what to think. A few months later, I watched the murder of six of the kidnappers on live television. Many media historians consider that event to be the beginning of the 24-hour news cycle we live with now. As Brad Schreiber points out in his newly published investigation of the group responsible for the Hearst kidnapping titled Revolution’s End: The Patty Hearst Kidnapping, Mind Control, and the Secret History of Donald DeFreeze and the SLA , it was a new technology that first made this live coverage possible. \\nYet, this is not the focus of Schreiber’s text. Indeed, Revolution’s End is about much more than the kidnapping or its coverage. Instead, it is an investigation into the creation of the Symbionese Liberation Army (SLA), its roots in various law enforcement agencies and its intention to destroy the underground armed left of the early 1970s in the United States. While not a new theory by any means, Schreiber’s narrative is the first such attempt to examine this possibility for the general public. \\nFrom the moment the public—including the Left—became aware of the SLA’s existence; doubts about their origins were expressed. In large part, at least on the Left, this was due to the group’s confused and nebulous politics. Claiming to be an anti-racist organization, the first public attack they made was on the African-American superintendent of schools in Oakland, California, Marcus Foster. Popular among progressives for some of his pedagogical approaches and his relatively forward thinking on issues of race and class, the SLA gunned him down in 1973. Their rationale was that he was instituting a pass system for students similar to the pass system in use by the South African apartheid authorities. In reality, Foster was opposed to the plan and was working to limits its reach in terms of accessibility by the Oakland Police department. Schreiber describes the assassination, writing that the two men convicted of the murder were not actually the gunmen in the crime. In fact, according to Schreiber and his research, it was the leader of the SLA, Donald DeFreeze aka Cinque, who along with a female member, actually committed the murder. \\nThe persona of DeFreeze is the linchpin to the claims about the SLA’s connection to law enforcement investigated in the book and previous investigations. The primary investigation was conducted by the Los Angeles-based Citizen’s Research and Investigation Committee in the 1970s. The Black Panther Party newspaper published some of this research, showing the connections between DeFreeze, well known LAPD informant/provocateur Louis Tackwood, and California law enforcement agencies in Sacramento. In addition, it is alleged that DeFreeze also worked for the FBI and was a participant in various drug and mind control experiments during his imprisonment in Vacaville California Prisons Medical Facility. \\nLike millions of others in the 1970s, I was fascinated by the story of the SLA as it played out in the media. From the kidnapping of Patty Hearst to the distribution of the food ransom to poor people in various California cities to Hearst’s conversion to an urban guerrilla, the unfolding drama was certainly better than most shows on TV. In addition, as a new left activist who was looking (along with many others) for an effective means to make a difference in a political milieu whose numbers were diminishing, I participated in numerous discussions about the SLA and its meaning for the rest of the left. While much of the Left dismissed the group as adventurists, crazy or police provocateurs, the fact of their existence left others wondering if maybe they weren’t sincere, albeit somewhat misreading the political climate both on the Left and in the greater public. \\nEven more fascinating than the publicly known story of the SLA, Schreiber’s text takes an extended and serious look at a possible deep narrative regarding the genesis of the SLA. As noted above, it is a narrative often suspected by many leftists and others regarding the group’s beginnings. By accepting Schreiber’s work, it makes it easier to understand why its members did some of what they did. In essence, Revolution’s End describes a covert operation undertaken by various law enforcement agencies that went off the rail. Succinctly put, Revolution’s End postulates (and does a fairly good job of proving) that the group that became the Symbionese Liberation Army was begun in part as an attempt to ferret out potential violent radicals in California while simultaneously attempting to discredit the revolutionary left. Donald DeFreeze played a role as both patsy and organizer while in Vacaville Prison. His role as provocateur raised suspicions, but somehow he was able to belay them. In the meantime, he took advantage of the leeway given him in the prison to sleep with various women on the outside. According to Schreiber, one of these women was Patty Hearst, who was involved in the prisoner rights movement in the period during which the SLA was originally formed. Schreiber describes the SLA as a group with three distinct phases. The first was set up by informants for the above reasons, the second went from this entity to a genuine, albeit confused political group, and the third came after the deaths of members in a police attack on their hideout. It was the last of the formations that included Patty in a more fundamental role than before, as she hid out in communes and hideouts around the United States until she was finally captured with Wendy Yoshimura in 1975 in San Francisco. \\nSchreiber’s text covers all the manifestations of the SLA except the last. In doing so, he provides the reader with a look at the nature of an element of the radical underground left in 1970s United States. Even more so, though, is the detailed and convincing examination he provides the reader of how police agencies can and do work to destroy the political enemies of the corporate state. It is this latter aspect that seems most important today, when the intelligence capabilities and legally granted powers to law enforcement agencies are so much greater than they were forty years ago. One need only look at the various entrapment schemes arranged by the FBI and other agencies that have cornered various folks into terror plots that would probably never have existed without the financial, logistical and motivational assistance of those government agencies.'"}, "time": 1742628321.1409147}