{"duration": 0.04753565788269043, "input_args": {"text": "'Comments \\nThe alt-right’s nastiest bad-boy, Milo Yiannopoulos, has been circulating a false rumor on Facebook about Michael Moore’s longtime support for Democratic nominee Hillary Clinton, claiming that Michael Moore in Trumpland was a pro-Trump movie. His ill-conceived lie has propelled the progressive filmmaker’s ‘October Surprise’ movie straight to the very top of the iTunes charts with almost 8 million views today, prompting the famed filmmaker to embark on a tweetstorm mocking the Trump supporters for helping shine the spotlight on his film. Righties\\'ve doctored clip from my film 2 make it look pro-Trump. 7.9M views! Sending millions 2 iTunes! TrumpLand #1 pic.twitter.com/LHqPO07Va6 \\n— Michael Moore (@MMFlint) October 26, 2016 \\nEven the Trumps were fooled by the Breitbart writer’s bald lies, as Donald Trump Jr. himself tweeted out links to Moore’s movie, which the New York Times reviewers said was not actually an attack on Trump but is really, “a paean to his opponent in the presidential contest, Hillary Clinton.” Hey everyone – Trump, Jr. & right wing thinks my movie called \"TrumpLand\" is pro-Trump! Haha. Pls don\\'t tell them otherwise! #satire #irony pic.twitter.com/difR93uzTg \\n— Michael Moore (@MMFlint) October 26, 2016 \\nSnopes had already busted Milo’s gross misrepresentation, which used audio from Moore’s movie without context or follow through to make it appear as if Moore had endorsed Trump – a charge which Moore has loudly debunked. \\nFirst of all, I make it very clear: I wrote a chapter in my very first book 20 years ago [1996’s Downsize This! ] called “My Forbidden Love for Hillary.” There’s nothing to come around on. I was for Hillary before Hillary was for Hillary. I didn’t go to convert Trump people. I did not want the racists or the crazies in there or we would have never gotten the show done. But we went to union halls and guys that I grew up with — people who normally vote Democrat who are thinking of voting for Trump. That is a huge chunk of the population, especially where I’m from. So I wasn’t there so much to convert them away. I don’t think a lot of them necessarily decided for sure that they were going to vote for him. But I want them to think about the damage they could do by being a legal terrorist on November 8th. \\nThat didn’t stop Milo from broadcasting this video containing a clip from Moore’s movie which has gotten over 6 million views, but without publishing the entire narrative which explained how a vote for Trump might feel good in the short term like Brexiteers imagined their votes might feel this past summer. Moore’s point is that Trump’s populist rhetoric sounds good, but his economic ideas and 19th century tariffs would be terribly damaging to American business, and ultimately to workers. \\nIf you keep watching the movie immediately after the part that Milo cited, then you would actually hear this dire warning by Michael Moore about the abject danger of electing the Republican candidate who’d like to end the First Amendment, destroy America’s economy and bring Jim Crow out of the dark past of the deep south and parade him around the entire United States. This is how Moore described the severe buyer’s remorse felt by Brexit voters: \\n[Voting for Trump will feel good] for a day. Maybe a week. Possibly a month. And then. Like the Brits, who wanted to send a message, so they voted to leave Europe only to find out that if you vote to leave Europe you, actually have to leave Europe. And now they regret it. All the Ohioans, Pennsylvanians, Michiganders and Wisconsinites of Middle England, right, they all voted to leave and now they regret it. \\nAnd over 4 million of them signed a petition to have a do-over, they want another election, but It’s not going to happen. Because you used the ballot as an anger management tool. And now you’re fucked. And the rest of Europe. They’re like, Bye Felicia. So when the rightfully angry people of Ohio and Michigan and Pennsylvania, and Wisconsin find out after a few months in office that President Trump wasn’t going to do a damn thing for them, it will be too late to do anything about it. \\nBut I get it. You wanted to send a message. You had righteous anger. And justifiable anger. Well, message sent. Goodnight America. You’ve just elected the last president of the United States. \\nOnce again a simple fact check shows that a widely conservative writer is lying to his audience by taking video out of context to make an argument that is entirely divorced from the actual facts. Michael Moore would never endorse a candidate like Donald Trump or his Republican friends that share his values and lie to America’s working people about their multi-decade campaign to deliver more money to the top 1% of American households at the expense of 99% of our country’s population.'"}, "time": 1742628457.4872878}