{"duration": 0.039278507232666016, "input_args": {"text": "'Conservative columnist and bestselling author Ann Coulter tweeted her take on Kathy Griffin’s gruesome   video posing with a   bloody severed head of the President of the United States Tuesday. [Coulter poked fun at Griffin, who has based much of her public image on being an irreverent   “gay icon,” described as such by the likes of Gawker and TMZ. Coulter found the gory video an odd choice for Griffin, given its similarity to images popularized by violent Islamists like ISIS, who not only post pictures of themselves with the severed heads of allegedly gay men, but have been known to throw gay men from buildings to their deaths in the name of Sharia Law.  Whoa!  How does Kathy Griffin’s sole employer (Gay America, Inc.) feel about this tribute to Sharia Law? https:  .   —   Ann Coulter (@AnnCoulter) May 31, 2017,  Commenting on a Breitbart News report on the incident, Coulter inquired after Griffin’s gay fanbase, calling them “Gay America, Inc. ” and Griffin’s “sole employer. ” She then dismissed Griffin’s attempts to excuse her actions by reference to comments President Donald Trump made about Megyn Kelly during a debate nearly two years ago. Kathy Griffin’s excuse for beheading Trump: His remarks @ Megyn Kelly (  ). After almost 2 YEARS, this is the best she can come up with? https:  .   —   Ann Coulter (@AnnCoulter) May 31, 2017,  Coulter went further in pointing out the hypocrisy of the “gay icon,” mocking Griffin’s pandering to gays in light of her readiness to crib the style of those who wish them dead: Kathy Griffin’s entire career: Guilting an entire sexual subculture into pretending to find her funny. https:  .   —   Ann Coulter (@AnnCoulter) May 31, 2017,  As the controversy over Griffin’s video stretched into Wednesday, Coulter continued to engage in the roiling fracas. Coulter retweeted, for example, Sen. Al Franken ( )’s decision to stand by Griffin after she issued a video apology Tuesday night saying, “I beg for your forgiveness. I went too far. I made a mistake. And I was wrong. ”'"}, "time": 1742561676.0364175}