{"duration": 0.08653545379638672, "input_args": {"text": "'Former Gawker CEO Nick Denton claimed that the   establishment will have to adopt a nicer “Zen Buddhism response” to beat Breitbart News during a SXSW interview last week. [“In some degree there’s a difference between Gawker and Breitbart,” claimed Denton during an interview with Digiday. “Gawker is sensational, shameless news that is grounded in truth, a dramatic version of the truth, but it is the truth. While Breitbart and fake news on Facebook are further escalation: They are not just sensationalization of the truth, but also go beyond the truth. ”  Denton went on to add that the left needs to adopt a nicer approach to beat Breitbart News and the rise of conservatism, before falsely associating Breitbart with Nazism. “I think the answer to Breitbart is not going to be, ‘Let’s do more aggressive fake news on the left,’” Denton explained. “There might be some Zen Buddhism response to Breitbart. It is going to be hard because the sensation is you want to punch the Nazi, but they have the guns. ” Gawker Media became infamous for publishing news that often ruined or negatively impacted people’s lives before it was bankrupted and shut down following a lawsuit from one of its targets. “Facebook makes me despise many of my friends, and Twitter makes me hate the rest of the world,” said Denton during his SXSW panel, before praising Reddit as the model of the future. “Even if we’re full of despair over what the Internet has become, it’s good to remind yourself when you’re falling down some Wikipedia hole or having a great conversation with somebody online —  it’s an amazing thing,“ he concluded. ”In the habits that we enjoy, there are the seeds for the future. That’s where the good Internet will rise up again. ” Last year, Denton and Gawker were forced to pay out $140 million to Hulk Hogan following a lengthy lawsuit over the gossip outlet’s unauthorized posting of Hogan’s private sex tape. The lawsuit was backed by PayPal   and billionaire Peter Thiel, who himself had been affected in the past by the outlet after being outed as gay, and forced Denton to file for bankruptcy. At SXSW on Sunday, Denton claimed that Thiel had become a “national figure” and “extremely prominent” in American politics and culture. “Peter Thiel, through his financial support of litigation and his support for political disruption through Donald Trump, has become a national figure,” Denton proclaimed. “He has become extremely prominent and an avatar, an embodiment, of the merger of the reactionary elite with a kind of populist celebrity in Donald Trump. ” Thiel is not the first homosexual that Gawker outed, while the gossip media empire also mocked the death of Vice President Mike Pence’s dog, accused actor James Franco of being a rapist, encouraged readers to pirate Quentin Tarantino’s film The Hateful Eight, published several celebrities’ nude photos, and refused to remove an uploaded video of the potential rape of a girl in a bathroom. When former Gawker editor A. J. Daulerio was asked in court what the limits would be in deciding not to publish a sex tape, he replied that the video would have to feature someone aged four or under. Following the controversy, Gawker Media was bought by Univision, who made it their first act to shut down the media company’s flagship site, Gawker, and rebrand themselves as Gizmodo Media. Since filing for bankruptcy, Denton was denied the ability to lease his $4. 25 million apartment in Manhattan, and he has since moved into a cheaper property. Hogan has since purchased a $1. 6 million beach house. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742564120.1651921}