{"duration": 0.032248735427856445, "input_args": {"text": "'Marching around without any clear direction, mission or destination  —   and without any clearly stated goal  —   the   women marchers in downtown Washington, DC, threatened to never leave the nation’s capital as they protest newly inaugurated President Donald Trump. [“We won’t go away, welcome to your first day,” women marchers chanted near the White House.  It’s ironic that they’re threatening to never leave, since many of the protesters are actually leaving tomorrow or the next day after having been bussed in from around the country and even from Canada.  For them to actually stay and occupy Washington, D. C. would cost millions per day —  an unrealistic possibility. It’s much more likely these protesters are going to catch their bus or their flight home in the next day or so and depart the national political stage without gaining any real ground. Part of the reason for their looming irrelevancy was evident in the disorganized nature of the march —  which was actually more of a giant gathering downtown. Protesters did not have a clear message of what they were asking for —  other than venting anger at the fact Donald Trump is the duly elected and inaugurated president of the United States —  and did not even march in a coordinated way in any particular direction throughout DC other than to just wander around in groups of a few hundred chanting one thing or another like the aforementioned threat to never leave or another age old Democratic Party protester chant “This is what Democracy looks like. ” Sure, celebrities like Madonna and Ashley Judd and top Democrats like newly elected California Sen. Kamala Harris joined in with speeches but the largely incoherent message that asks for nothing reasonable —  the only thing they seem to be demanding is that President Trump go away, something that will not happen —  leaves the women marchers against Trump leaving Washington empty handed.'"}, "time": 1742562063.8657384}