{"duration": 0.05709528923034668, "input_args": {"text": "'Share This \\nA man was pulling out of his driveway when his wheel suddenly got stuck. Initially, he thought he had accidentally driven up on his flower bed, but once he took a closer look, he realized there was a hole in the ground. There was also a ladder in the hole, but nothing could have prepared him for what he’d find when he daringly went down. \\nSimon Marks was pulling out of his driveway in Luton, England, when he thought he had accidentally driven into one of his flowerbeds. When he got out to inspect the damage to the flowers, he quickly realized that he had been mistaken. He hadn’t driven onto his flower bed at all. Instead, there was a gaping hole in his driveway. \\nEven more unbelievable than the sudden hole that appeared, he also saw that there was a ladder in the hole, where the driveway collapsed. Wanting to know what the odd discovery was all about, he bravely took a look and was shocked to find a two-roomed shelter. Simon Marks next to the air raid shelter (Source: The Sun ) \\n“This massive hole appeared. I thought it was a sinkhole or a badly constructed garden,” Simon explained, according to The Sun . “I was just terrified the whole house was going to vanish. I took some pictures and sent them to my dad. When I moved a few of the slabs out of the way, I found a ladder. I got my selfie stick and put it down the hole where I saw two rooms.” \\nWhen his dad Gerald saw the pictures, he instantly knew what it was – an air raid shelter. After looking on the internet for some more information, Simon and his father learned that there were quite a few of these bomb shelters in the area and that this particular one had probably been built after a German bomb landed nearby during World War II. Bottles and newspapers were found inside \\n“The previous owner must have known it was there, and when he built the house and put a garden in, he must have filled it in,” he explained. “He clearly wasn’t very worried about it and it just sat there until the hatch fell through. I think it’s great and I want to clear it out and preserve it if it’s structurally sound.” \\nThe shelter is nearly 10 feet deep and was full of mud. As Simon and Gerald began excavating the shelter with buckets, they found various items along with glass bottles and old newspapers. “It’s incredible to think it has all been made by hand,” Simon admitted. “It’s part of our history so it should be kept.” \\nThis just goes to prove that you never know when you’ll accidentally stumble on a piece of history hidden in your own backyard or your driveway. I can guarantee that Simon had no idea that his property held a treasure of the past – so you never know what you might stumble on someday and what it could reveal about the history in your area.'"}, "time": 1742561778.9320776}