{"duration": 0.06747794151306152, "input_args": {"text": "'Wednesday on the “Tom Joyner Morning Show,” while discussing President Donald Trump’s Supreme Court nominee, Judge Neil Gorsuch,   activist Al Sharpton quoted a James Brown song to urge Senate Minority Leader Chuck Schumer to give the Republicans the “big payback,” for refusing to give Judge Merrick Garland a hearing.  Sharpton said, “As I watched last night President Trump nominate Judge Gorsuch be in the Supreme Court  —   first of all let’s be clear, Gorsuch is a very conservative, go by the Founding Fathers kind of interpretation of how you deal with Constitutional law and would sit on that court and would rule in a way that would be against the interests of those of us that clearly when the Founding Fathers wrote the Constitution, was not considered full human beings and full citizens. So when you deal with the mentality and the legal profile of Judge Gorsuch, it is not a good one. But even beyond that, let us not forget he is not sitting, and being nominated to sit in Scalia’s seat, he’s being nominated to sit in Garland’s seat. President Barack Obama nominated Judge Garland, who has got as much or more qualifications as this nominee, to have been the Supreme Court judge. ” “Nominated him almost a year ago, Febuary of 16 when Scalia died,” he continued. “They stalled, they filibustered, they would not even give a hearing to Judge Garland. It is time for the Democrats now to say since you changed the rules, you’re going to have to live by the rules you applied to President Obama’s nominee, and we are not going to allow you to change it and we will use those rules to block this nominee, Gorsuch. The Bible says that you sow that  —   that same thing shall you also reap. But Bill Bellamy had a better idea —  they should come in the Senate and replay “The Big Payback,”  James Brown song. Bill was right, just take one of them old blasters, Chuck Schumer, and blast out The Big Payback. You took my judge. That ain’t right. Wouldn’t give a hearing. You know that I’m tight  —   the big payback. ” Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742563782.8047142}