{"duration": 0.15241551399230957, "input_args": {"text": "'Veteran political strategist Pat Caddell talked about the American Health Care Act (AHCA) and its possible effect on the 2018 midterm elections with SiriusXM host Matt Boyle on Monday’s Breitbart News Daily. [“All these smart people in Washington, who have not understood politics for some time, these are the same people who said, ‘Well, it wouldn’t hurt the Democrats. The country will love it,’” Caddell said of conventional media wisdom about Obamacare at the time of its passage.  LISTEN: “Then we had several elections, and now we’re saying, ‘Oh, of course, the Republicans are doomed,’” he continued, referring to predictions that as many as 20 House Republicans could be facing tougher   campaigns in 2018 because of the AHCA. “No, they’re not. It depends on what they do,” Caddell argued. “So far, I’ll tell you as a fairly competent person, I have no idea what’s in this bill. That’s because, other than the talking points, the headlines thrown out by Trump administration and congressional people, I have no clue what’s in it. I don’t know how it answers the problems that have been raised. ” “But at the same time, the failure of the Republicans and the White House and the entire operation to set a narrative, made important what had to be done  —   to have ceded all of that ground to their opponents on the basis of, ‘Well, you know preconditions are going to be hurt, are going to be cut out of this, and we’re going to destroy Medicaid,’ whatever. To have conceded that ground is to have conceded a lot,” he continued.  “But I’m not sure the next election is going to be about health care, one way or the other,” Caddell added. “It depends on whether or not they can get something fixed, and whether or not people perceive that Donald Trump has kept his word, or whether this is just seen as another partisan battle. So I’m not so sure. ”  “I don’t see any great movement in the polls, in terms of party support for either party, since they’ve been doing this for several months or raising this. I’m somewhat skeptical. I think the election in 2018 is going to be on much larger grounds than merely a healthcare revolt. It may or may not work to Donald Trump’s benefit  —   we will yet see  —   or detriment. I think that we’re going to see some other things raised. But the single most important thing is the economy and what happens to it,” he predicted.  “Let me just add another thing: whether or not Donald Trump starts representing, in this White House, the voters who put him over the top,” he said, criticizing the Trump team for “failing to show much interest or clarity” in using their 2016 election victory to shape a new political majority. Caddell agreed with Boyle that House Speaker Paul Ryan was a major force pushing Trump in that conventional Republican direction. He said Ryan was the paramount example of what he calls “the Chamber of Commerce Republican Establishment party,” which was “slaughtered in 2016. ” Caddell said those establishment Republicans “managed to spark an uprising after the victory of the Republicans in 2014 and their immediate decision in December to go into conference and sell out everything the Republican candidates had campaigned on. ” “This group of people has never wanted Donald Trump. They don’t want Donald Trump now. The longer he keeps letting them stab him in the back, which is what’s happening  —   whether it’s on this, it’s what’s happening at the FCC, on privacy rights,” he warned.  “And by the way, where is Donald Trump taking on the massive disaster of the airlines in this country?” Caddell asked. “Nowhere! They leave so much hanging. Partly it’s because I fear it’s because they failed to have an organizing principle of this White House. They are then susceptible to their quote ‘allies’  —   enemies!  —   who want to push their agenda, an agenda that the American people have never wanted. That is a real danger. ” Caddell faulted the Trump administration for failing to use “the bully pulpit of the White House” to influence America’s political culture, with the healthcare debate serving as an acute example. With a caveat about how polling has become unreliable because much of it is conducted by universities, and university polls can no longer be conducted in a truly unbiased manner, he said he doubted the level of energetic support for the House Obamacare replacement bill exceeded 25 percent. “How did they get in that fix? And most of all, how did they do it when, in fact, the market, I think, is collapsing?” he marveled. “Part of the problem is there is no place for ordinary people, or even sophisticated people, to go to find out what the truth is. All we’re getting is propaganda from MSNBC and CNN, the mainstream media. We don’t have enough places for people to go and sort the facts, and it certainly isn’t coming out of the House leadership. ” Boyle noted the White House could spend more time touting its successes, such as achieving the lowest unemployment figure last month in more than a decade. Caddell responded that he did not want to “start throwing around unemployment numbers” he was denouncing as “cooked, in the sense that they no longer reflect the real reality of what unemployment is” last year. “Those people who cannot get   work and whatever, that number is still higher, and we shouldn’t repeat the mistake the Obama people and the Bill Mahers of the world” made by overemphasizing the importance of the headline unemployment figure. “This is still not a good economy. It’s getting better,” he pronounced. “But it’s Trump’s opportunity. That, and standing up for people, and shaking Washington to its foundations. That’s why I said something like the airlines. The entire reason our airline industry is so much worse than Europe is because everyone in Washington has been bought off by these people, including those pathetic congressmen I saw question witnesses last week, who complain about their own trips but do nothing about it because they get too much money. ” “When he starts draining the swamp, rather than inviting the swamp to eat him, then he will begin to turn this,” Caddell advised. “But I have to stay it. It’s just a true statement: this White House has no strategy. They could have done   things in health care, gotten a bill passed with two things: how about dealing with drug prices, and also allowing interstate competition? Just laying a marker down would have been good. ” “Doing the same thing on tax reform by taking away the hedge fund money, proving he’s not going to be the pawn of these big billionaire rich people  —   I mean, Trump needs to take charge,” he continued. “They could get successes, but they won’t, as long as they allow themselves to be led by their enemy allies. ” Boyle suggested some of President Trump’s problems stemmed from the enormous permanent bureaucracy, which is prone to undermining dramatic reforms. He said there were some hopeful signs that Trump is beginning to make progress against this obstacle. “I agree with you, Matt. It’s not lost. It’s just got to be kind of frustrating because already, things should be happening,” said Caddell. “I’ll tell you, I don’t mean to be just critical because they have done good things,” he added. “And they are surrounded. Remember, they’re at war with an entire political class. The White House sometimes looks like Fort Apache under attack. I mean, the Indians are everywhere. ” “We have a national media that is literally proving itself to be the enemy of the American people, and it will not put out any news that is true or factual that will help Trump,” he said, accusing the media of banding together “in such negativity to undermine him. ”  “Then you have the political class itself, which are the lobbyists, lawyers, money of both the Republican Party and the Democratic Party  —   who are united because they so desperately need to go back to normal, to further their corruptions,” he added. “Trump needs to strike the high ground. This is the most unique challenge a president has ever had. He has got to figure the unique ways to do it. I think they’re capable of it, but so far, somebody needs to tell them they’re not doing it,” Caddell said. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the full audio of the interview above.'"}, "time": 1742562053.8234696}