{"duration": 0.1307692527770996, "input_args": {"text": "\"3 Thoughts On Steve Bannon As White House 'Chief Strategist' By: Ben Shapiro November 14, 2016 \\nSo, in a not-unexpected move, Donald Trump has elevated former Breitbart News CEO Steve Bannon to chief strategist of the White House. \\nWhen I left Breitbart back in March, I accused Bannon of turning Breitbart News into Trump Pravda ; as I wrote, “Indeed, Breitbart News, under the chairmanship of Steve Bannon, has put a stake through the heart of Andrew’s legacy. In my opinion, Steve Bannon is a bully, and has sold out Andrew’s mission in order to back another bully, Donald Trump; he has shaped the company into Trump’s personal Pravda, to the extent that he abandoned and undercut his own reporter.” \\nThat decision paid off for Bannon – in August, he became Trump’s campaign “CEO.” At that point, I wrote this piece describing who Bannon was , and this one for The Washington Post describing his probable impact on the campaign . \\nWith Bannon’s accession to a top White House role, it’s time to answer some brief questions about the man and what he’s likely to do. \\nIs Bannon Anti-Semitic And Racist? I have no evidence that Bannon’s a racist or that he’s an anti-Semite; the Huffington Post’s blaring headline “WHITE NATIONALIST IN THE WHITE HOUSE” is overstated, at the very least. With that said, as I wrote at The Washington Post in August, Bannon has openly embraced the racist and anti-Semitic alt-right – he called his Breitbart “ the platform of the alt-right .” Milo Yiannopoulos, the star writer at the site, is an alt-right popularizer , even as he continuously declares with a wink that he’s not a member. The left’s opposition to Trump, and their attempts to declare all Trump support the alt-right have obfuscated what the movement is. The movement isn’t all Trump supporters. It’s not conservatives unsatisfied with Paul Ryan, nor is it people angry at the media. Bannon knows that. He’s a smart man, not an ignorant one. The alt-right, in a nutshell, believes that Western culture is inseparable from European ethnicity . I have no evidence Bannon believes that personally. But he’s happy to pander to those people and make common cause with them in order to transform conservatism into European far-right nationalist populism. That means that the alt-right will cheer Bannon along as he marbles Trump’s speeches with talk of “globalism” – and that Bannon won’t be pushing Trump to dump the racists and anti-Semites who support Trump anytime soon. After all, they love Bannon – actual white supremacists like Peter Brimelow called his August appointment “great news,” and Richard Spencer explained, “Breitbart has elective affinities with the Alt Right, and the Alt Right has clearly influenced Breitbart. In this way, Breitbart has acted as a ‘gateway’ to Alt Right ideas and writers. I don’t think it has done this deliberately; again, it’s a matter of elective affinities.” That doesn’t mean Bannon will push racist or anti-Semitic policy, or that he’ll be anti-Israel himself – unless it serves his interests. \\nWhat Does Bannon’s Accession Mean? Bannon has goals. One of those goals is maximization of personal power, which is why he spent the last decade and a half glomming onto powerful right-wing personalities (Bachmann, Morris, Palin), kissing their asses, and then moving on up the chain. With Breitbart and Trump, he picked two winners in a row – and that means he’s now at the pinnacle of American power. \\nSo, what will he do with that power? He’ll target enemies. Bannon is one of the most vicious people in politics, which is why I’ve been joking for months that should Trump win, I’d be expecting my IRS audit any moment. That wasn’t completely a joke. He likes to destroy people. \\nBut more importantly, Bannon’s interested in turning the Republican Party into a far-right European party. Because Republicans will like some of the policy that comes with that, it could happen. Here’s what I wrote in March about the Trump movement : \\nTrump is a European-style response to the European-style leftism of Barack Obama. He’s a soft European-style populist, from his interventionist economics to his closed-borders foreign policy. As I wrote in December, “Compare Trump’s platform with that of Marine Le Pen, whose French National Front poses a significant threat to the national political establishment. She calls for harsher penalties for criminals, significant restrictions on Muslim immigration to France, protectionism on trade, a restoration of the Franc as the national currency rather than the Euro, and big government in terms of health care. This sounds a lot like Trump.” But the European right is not the American right. The American right believes in Constitutional ideas about checks and balances and federalism and negative rights from government. The European right doesn’t believe any of these things. Should Trump win, we could watch American conservatism lose the only party it has ever had. \\nThat’s the plan. Yesterday, The Daily Beast reported that Bannon reached out to Le Pen for “global ultra-right coalition.” Over the weekend Le Pen met with Nigel Farage of the UK Independent Party. And Trump met with Farage shortly after being elected. Bannon has always wanted to burn down the GOP. That’s still his goal. He wants it replaced with an American National Front party in fact if not in name. \\nWhich War Will Bannon Lead? Bannon considers himself a wartime consigliore – always at war. Always. So the only question left is this: what will Bannon’s actual role be? It’s difficult to tell, since Trump announced the Bannon hire at the same time he announced that former RNC chairman Reince Priebus as his chief of staff. What will their relationship be like? Ed Morrissey of HotAir thinks that Bannon will lead the anti-media fight, and Reince will coordinate with Congress. That would be the best possible scenario. \\nOthers have speculated that Bannon has been added to the team as a sop to the populist base, which would be angry at Trump hopping into bed with the most establishment-y fellow in Washington. That, too, would be fine. \\nIt’s hard to tell from the outside what’s happening, but here’s a third theory: Reince is the bagman for Trump, and Bannon’s whispering in Trump’s ear. That would fit the fact pattern here, given Reince’s outsized praise for Bannon this morning: “wise and smart…very, very smart, very temperate.” Bannon is anything but temperate to those who disagree. He’s a consummate bully to anyone who disagrees; he's actually malevolent. Priebus may not have seen a lot of disagreement because he’s the one catering to Bannon’s agenda. \\nIf Bannon’s leading and Reince is following, that bodes ill for the Republican agenda. Bannon opposes the Republican Party, hates Paul Ryan – minutes after the joint Bannon/Priebus announcement, Breitbart News approvingly tweeted about a Congressional rebellion against Speaker Ryan – and wants to watch it all “burn.” Bannon loves the firefight. The only question is which direction he’ll turn his fire. Tags\""}, "time": 1742563310.0291889}