{"duration": 0.2198026180267334, "input_args": {"text": "'Dienstag, 22. November 2016 Cleverer Schachzug: SPD schickt ebenfalls Angela Merkel als Kandidatin ins Rennen Berlin (dpo) - Nur zwei Tage nach der Union hat nun auch die SPD ihre K-Frage geklärt. Wie heute bekannt wurde, wollen die Sozialdemokraten ebenfalls mit Angela Merkel als Kanzlerkandidatin zur Bundestagswahl 2017 antreten. Offenbar ist man in der Partei der Überzeugung, dass nur Angela Merkel die Sozialdemokraten siegreich durch den Wahlkampf führen kann. \"Wen sollen wir denn auch sonst aufstellen?\" so SPD-Generalsekretärin Katarina Barley auf Anfrage des Postillon. \"Sigmar Gabriel etwa? Andrea Nahles? Ich bitte Sie!\" Zudem zweifle ohnehin niemand daran, dass die Große Koalition auch nach 2017 bestehen bleiben wird. \"Wieso sollten wir da plötzlich auf Biegen und Brechen einen eigenen Kandidaten ins Rennen schicken und so tun, als wären wir anderer Meinung als die Union? Das kauft uns doch ohnehin keiner ab.\" Beobachter begrüßen es, dass die SPD mit Angela Merkel erstmals in ihrer Geschichte eine Frau als Kandidaten für die Kanzlerschaft aufstellt. \"Hier werden die Sozialdemokraten wieder einmal ihrer Vorreiterrolle in Sachen gesellschaftlicher Fortschritt voll und ganz gerecht\", erklärt Politikwissenschaftler Uwe Laumann aus Rostock. \"Zudem hat Merkel als sozialdemokratische Spitzenkandidatin den Vorteil, dass im Falle eines SPD-Wahlsiehihihi- … entschuldigen Sie bitte, ich musste gerade selbst lachen. Vergessen Sie den letzten Punkt einfach.\" Spannend dürfte es bei den TV-Duellen vor der Wahl werden, wenn Angela Merkel mit sich selbst wichtige grundsatzpolitische Fragen ausdiskutiert. Es ist davon auszugehen, dass Merkel versuchen wird, sich selbst mit ihrer betont ruhigen Art aus der Reserve zu locken und einen Wutausbruch zu provozieren. fed, dan, ssi; Foto: Armin Linnartz , CC BY-SA 3.0 Artikel teilen:'"}, "time": 1742563533.6286056}