{"duration": 0.04195404052734375, "input_args": {"text": "'Editor’s Note Protest music alone cannot change the world. However, protest music can fuel a culture of resistance. Growing a culture of resistance is needed now more than ever.\\nThe following are songs from 2015 and 2016 that speak to the political moment and can be seen as the soundtrack for movements fighting for social, racial, economic, and environmental justice. \\nNow, please enjoy this mixtape — the first of many “Stop Trump” playlists we expect to feature here at Shadowproof. \\n“R.E.D.” by A Tribe Called Red (feat. Yasiin Bey, Narcy, and Black Bear) An anthem for the decolonization of culture and solidarity among colonized populations across all continents \\n“T5” by Swet Shop Boys A sardonic take on post-9/11 security culture from Riz MC and Heems, rappers of British Pakistani and Punjabi-Indian descent who have experience with racial profiling at airports “Old Man Trump” by Ryan Harvey feat. Ani DiFranco and Tom Morello The lyrics of legendary folk singer Woody Guthrie are put to music in this song about Donald Trump’s father, Fred Trump, and how he excluded people of color from his Beach Haven housing project “Retribution” – Tanya Tagaq Throat singing from an indigenous throat singer who crafts a foreboding warning to global citizens about their non-consensual relationship with Mother Earth. “FDT” by YG A basic message from a young black rapper to reject and not stand for any of Donald Trump’s bullshit “Blk Girl Soldier” by Jamila Woods Calls upon the tradition of strong black women who engaged in freedom fighting for dignity, justice, and human rights while at the same time praising the power of black women with “black girl magic” “MariKKKopa” – Desaparecidos Implicates disgraced Maricopa County Sheriff Joe Arpaio and his legion of white supremacists who promote hate of immigrants—the kind of people glomming on to a Trump administration “The Comin’ Round Is Going Through” by Bonnie Raitt A foot-stomper on what’s coming around for the corporate class who have hijacked elections “In the River: A Protest Song” by Raye Zaragoza Ode to the water protectors standing against the oil barons set on poisoning water and the future of not only indigenous people but the entire planet “We The People…” by A Tribe Called Quest Rap song that uses Trump’s exclusionary rhetoric as a hook, rejects the law and order waging war on black bodies, and preaches hard truths about the dominant culture in which we find ourselves enveloped “True Trans Soul Rebel” by Against Me! Anthem for transgender people to help them find the strength to proudly stand up for dignity, equality, justice, and human rights “Big Box (Live)” by Neil Young & The Promise of the Real An indictment of capitalism, the song pleads for resistance to the corporate takeover over all aspects of government, the rule of law, and all facets of daily life, especially through the rise of Big Box stores. “How I Feel” by A Tribe Called Red Acknowledges the pain that indigenous people can see in eyes of other indigenous people, as they struggle to maintain the fight against colonialist oppression and not burn out. The message applies to all: keep listening to others and never give up. “America Back” by Jill Sobule Requires no additional description. When they say they want their America back, what the fuck do they mean? ***\\nStop Trump Mixtape on Spotify \\n\\n[*Note: Missing Jill Sobule’s “America Back” because that song is not available on Spotify.]\\nThe post Stop Trump Mixtape: A Protest Song Collection appeared first on Shadowproof .\\n'"}, "time": 1742628291.4836624}