{"duration": 0.03152036666870117, "input_args": {"text": "'Hillary’s Bizarre Spanish Birthday Bash, Tells Illegal Aliens SECRET Message Posted on October 26, 2016 by Rebecca Diserio in Politics Share This \\nIt’s Hillary Clinton’s birthday, and unfortunately, no one is shocked that she spent time on Univision on some ridiculous talk show, pandering to illegal aliens during a bizarre Spanish birthday bash. However, what is leaving many in disbelief is what she promised illegal aliens off the record if she gets elected. Unfortunately for her, Univision let everyone know her secret message to them, and it’s pissing Americans off. Hillary’s birthday cake (left), Hillary samples cookies (right) \\nHillary is on her final leg of her ill-fated campaign, and it’s perfect that she showed her true colors on Univision’s Spanish-language talk show called “Gordo & Flaca” (Fat & Skinny) with a little person called Producer Carlitos who led Hillary around like a pet pony. It was so pathetic as they made her repeat words like “vote” and “president” in Spanish while the crowd laughed at her bad accent. \\nIt’s cringe-worthy enough when a 69-year-old grandmother panders to a bunch of buffoons in any language, but the fact that it was an American woman running for president makes it disgusting. However, let’s look past the idiotic looking birthday cake coming from what is supposed to be an unbiased news source, albeit a Hispanic one. Instead, let’s learn what Hillary said directly to illegal aliens that have so many Americans pissed off today. It’s Hillary pandering at her best, or it’s the worst optic ever, and she should have canceled. “I want to be a really good president for you,” she said in one outtake posted by the show online. “I want to give you every opportunity to be successful in our country.” Clinton announced a free concert Saturday with latin pop stars Jennifer Lopez and Marc Anthony. [via Daily Mail ] Did you catch that? Hillary wants to give illegal aliens every opportunity to be successful in our country, and this was an outtake because her campaign wanted none of that talk to get posted online. Hillary is struggling badly with the heavily Cuban areas in Florida, where they routinely vote Republican, and the one thing she needs is Florida. At the end of this one minute video, you can hear Hillary say to Gordo (Fatty), “ You’ll make the difference not just here in Florida , but everywhere.” The Cuban-Americans don’t take kindly to illegal aliens of any race, so where they might watch Univision, they will not like Hillary looking ridiculous, and they will especially not like her encouraging illegal aliens in that message that was supposed to be off the record. Now for the other stupid Hillary moment, which was another bad optic for her. Producer Carlitos gave Hillary an expensive bottle of tequila as Hillary looked all bugged eyed wanting to down a shot. Producer Carlitos led Hillary like a pet pony onto the stage (left), Carlitos gave Hillary tequila (right) The path to Hillary’s White House runs through non-white voters. Think about that. Yes, America is a melting pot, but we want a legal melting pot. Wanting those in America to actually be legal Americans isn’t racist since “illegal” isn’t a race. What Donald Trump said was that it’s okay to be proud to be American. In fact, it’s vital we be proud to be Americans once again — and all races in the United States can and should feel that way. Hillary needs to pander to those minorities who, unlike Cuban-Americans, believe illegal aliens have the same rights in America as Americans . It’s crazy and proves that Hillary cares nothing about America. She is a pure globalist, who is working for those who want open borders everywhere. I truly believe that Americans are smarter than Hillary and her cabal of globalists know. Let those at Univision and those who hate America get this message loud and clear: America is not Hillary’s country to give away. It’s every Americans’ country, and we each have one vote to make sure she can never give our birthright away.'"}, "time": 1742628477.235324}