{"duration": 1.435938835144043, "input_args": {"text": "'Department of Homeland Security Inspector General John Roth, an Obama appointee, is treating the February 24 leak of a draft DHS document central to the separate decisions by two federal judges revoking President Trump’s travel ban on March 15 differently than he did the April 2, 2015 unauthorized leak of private information about Rep. Jason Chaffetz from the employment files of the Secret Service. One day after the Chaffetz leak, DHS announced an OIG investigation. More than one month after the leak of the draft DHS document, published in a February 24 Associated Press story written by Vivian Salama and Alice C. Caldwell, DHS is silent as to whether an investigation has been or will be launched. On April 2, 2015, the Daily Beast reported that “House Oversight Committee Chairman Jason Chaffetz, who oversees the Secret Service, never disclosed that he had applied for and was rejected from the agency in the early 2000s,” in an article written by reporter Tim Mak. Mak did not disclose in the article how he first learned of Chaffetz’s application to the Secret Service, which has been a part of the Department of Homeland Security since 2003. One day later, on April 3, 2015 CNN reported, “Senior staff from the House committee that oversees the Secret Service have asked the Department of Homeland Security Office of the Inspector General to look into allegations that U. S. Secret Service employees circulated private personnel information about committee Chairman Jason Chaffetz. ” “Chaffetz’s office confirmed that the House Oversight Committee chairman applied unsuccessfully to a job with the Secret Service in 2003,” CNN reported, adding: The Secret Service referred CNN to the investigation being conducted by the Department of Homeland Security Office of Inspector General as to whether any policies were violated. Homeland Security Secretary Jeh Johnson apologized to Chaffetz in a phone call Thursday night for the congressman “being put in the situation that he had to acknowledge a matter that should have been kept confidential,” according to DHS spokeswoman Marsha Catron. Johnson also called for an investigation into the matter, Catron said. “We conducted this investigation from April 2, 2015 to August 21, 2015,” the final report, “Investigation into the Improper Access and Distribution of Information Contained Within a Secret Service Data System,” made public on September 25, 2015 by DHS Inspector General John Roth —  an Obama appointee who has held over into the Trump administration —  noted. DHS Inspector General Roth’s quick pursuit of an investigation into the unauthorized leak of Congressman Chaffetz’s employment application to the Secret Service stands in stark contrast to his silence, and the department’s silence, on its reaction to the unauthorized leak of a draft DHS document, published in a February 24 AP story written by Vivian Salama and Alice C. Caldwell, that was cited as key evidence in the separate decisions by two federal judges on March 15 to revoke President Trump’s travel ban. “As a matter of policy, DHS neither confirms nor denies the potential existence of ongoing investigations,” DHS spokesperson Gillian Christensen tells Breitbart News.  While that silence on “the potential existence of ongoing investigations” may be the current policy, it was apparently not the department’s policy on April 3, 2015 when a spokesperson for the Secret Service confirmed the existence of a DHS OIG investigation into the Secret Service leak about Rep. Chaffetz. Nor does that policy appear to apply to a recent highly publicized DHS OIG investigation related to the implementation of President Trump’s Executive Order 13769 —  the initial temporary travel bans for citizens of seven Middle Eastern countries —  Iran, Sudan, Somalia, Syria, Yemen, Libya, and Iraq (the only one of the seven countries not included in the subsequent Executive Order 13780). On February 1, four days after President Trump signed Executive Order 13769, “The Department of Homeland Security Office of Inspector General (DHS OIG) announced that it will review DHS’ implementation of the recent Executive Order,“Protecting the Nation from Foreign Terrorist Entry into the United States. ” The review is being initiated in response to congressional request and whistleblower and hotline complaints: In addition to reviewing the implementation of the Executive Order, the OIG will review DHS’ adherence to court orders and allegations of individual misconduct on the part of DHS personnel. If circumstances warrant, the OIG will consider including other issues that may arise during the course of the review. The leaked draft DHS document published in the February 24 AP story was three pages in total, and had no letterhead nor any other markings to indicate it originated in the DHS, nor did it bear the name or signature of any current DHS employee. The authors of the story, however, asserted that it originated within the DHS Office of Intelligence and Analysis, an assertion not disputed by a spokesperson for DHS, who did note, however, that it was an “incomplete” and “draft” document and not an authorized official position of DHS. The leaked document did however, cite another DHS document in an end note as the source of the data described within it, ” DHS IA   Activities Study: 16 FEB 17 DOI 01 Mar 11  —   31 Jan 17 DHS IA   Activities Study. ” Breitbart News asked DHS to obtain a copy of this document, as well as a description of its classification status, but did not receive a response to that request. Information about the classification status of that cited document may play a key role in determining the potential level of criminality involved in the leaking of the draft document. If, for instance, it is a classified document, federal laws have clearly been broken. If it is “classified but sensitive,” federal laws have likely been broken. If it is completely unclassified, prosecutors would have a more difficult time proving violation of federal laws, but the leak would certainly be cause for termination at DHS. “Generally speaking, DHS employees are held to the highest standards of professional and ethical conduct. Any allegations of misconduct are taken seriously and addressed appropriately,” Christensen adds. In the case of the unauthorized leak of Rep. Chaffetz’s employment application, those allegations were addressed more than a year later, on May 27, 2016, when Homeland Security Security Jeh Johnson announced, “The U. S. Secret Service has punished 41 employees in the improper access and leak of House Oversight Chairman Jason Chaffetz’s personnel files during his committee’s investigation of the beleaguered agency,” as Law 360 reported. Johnson’s statement from the U. S. Department of Homeland Security, which oversees the Secret Service, referenced a September DHS Office of Inspector General report that found records from the Utah Republican’s 2003 application with the agency were accessed around 60 times. From there the decision was one of accountability, Johnson said, with the conduct of 57 Secret Service staff reviewed, and 41 of those being punished. “This discipline includes a letter of reprimand to one individual, suspended discipline contingent on no further misconduct for a period of five years, and suspensions from duty without pay for periods of up to 45 days,” Johnson said. “The one individual found by the Inspector General to have disclosed the private information to an outside source, the Washington Post, has resigned from the Secret Service. I found no basis to take any action with respect to the Director or Deputy Director. ” The apparent lack of curiosity displayed by the DHS Inspector General as to the origins of the leaked draft DHS document that played such a central role in the constitutionally significant decisions made separately by Judge Derrick Watson of the U. S. District Court of Hawaii and Judge Theodore Chuang of the U. S. District Court of Maryland on March 15, revoking President Trump’s Executive Order 13780, raises further questions about the conduct of the federal bureaucrats in the new Trump administration. “Democrats own the Deep State, that network of embedded bureaucrats, academics and media, judicial activists, and spooks that is operating to stymie, discredit, and ultimately remove from office a president that is a threat to their mutual agenda. They are agreed that government should control more of life’s essential functions, and that benign rule of the enlightened can reshape society to match their visions,” Thomas Lifson writes at American Thinker about this leak. “The draft report [leaked to the Associated Press and published on February 24] came from DHS’s Office of Intelligence and Analysis, which was headed by David Grannis, an Obama holdover bureaucrat. Grannis is a partisan Democrat who previously worked as a staffer for Democrats Dianne Feinstein and Jane Harman. A DHS spokesman “would neither confirm nor deny that Grannis was the author of, or had reviewed, the leaked document  …    . ” ” John Hinderaker writes at Powerline Blog: How about the reporters? It pretty much goes without saying that AP reporters are Democrats. But Leahy also points out [in a March 27 article at Breitbart] that Vivian Salama formerly worked for Rolling Stone, where she wrote that Yemen —  one of the countries covered by the travel order —  “holds a special place in my heart. ” She has bitterly denounced U. S. drone strikes in Yemen. So it appears that what happened here is that Democratic Party activists in the Department of Homeland Security either created a bogus document or dug up a   draft document that had never been issued, and fed it to Democratic Party activists at the Associated Press. The Democratic Party activists at the AP published a story based on the anonymous document, which two Democratic Party activists on the bench used as a pretext for orders enjoining the president’s travel order. Those orders should be viewed as purely political acts that have no basis in any valid judicial reasoning or authority. “I suspect that we will see many more examples of the Deep State in action because we are getting more aware of them, as they are getting more desperate, careless, and  . Naming it, defining it, and documenting it are important aspects of the fight against it. The Deep State does not like the light for good reasons,” American Thinker’s Lifson concludes. DHS Inspector General Roth’s conduct of the office’s earlier investigation into the Secret Service leak was questioned in a September 28, 2015 Washington Post article written by Jerry Markon. “John Roth is the top watchdog at the Department of Homeland Security, a position shielded by law from outside pressure so he can conduct independent inquiries of the government’s sensitive internal workings,” the Post reported. But during a nearly completed investigation of the Secret Service, Roth’s office has taken the unorthodox step of allowing officials from the service to work alongside his agents as they tried to determine how unflattering information about a congressman was disclosed from the agency’s files, according to half a dozen people familiar with the inquiry. Legal experts and former government investigators said the approach threatens the integrity of the investigation of who at the Secret Service uncovered and leaked material showing that Rep. Jason Chaffetz ( )  —   chairman of a House committee overseeing the agency  —   had once been rejected for a job as an agent. Chaffetz has been an outspoken critic of the Secret Service, which has been rocked recently by   security breaches. Secret Service staff members  —   inspectors from the agency’s internal affairs office who examine possible misconduct among employees  —   sat in on interviews with some of the more than 40 agents and officers questioned about the unauthorized disclosures, the people said. In some cases, the Secret Service inspectors contacted witnesses directly and questioned them along with investigators from the DHS Inspector General’s Office headed by Roth, who is responsible for examining alleged wrongdoing across the breadth of Homeland Security. “In one instance, Roth’s agents and Secret Service inspectors jointly questioned an agent about Carol D. Leonnig, a reporter for The Washington Post who has uncovered security missteps by the service, according to the agent’s attorney. Investigators asked about stories related to Chaffetz and other subjects and confronted the agent with his personal cellphone records, showing alleged calls and texts with Leonnig, the lawyer said,” the Post noted: The service’s involvement in investigating itself is problematic, experts say, because top officials at the agency had an incentive to embarrass Chaffetz. The participation of the service’s inspectors also could deter internal whistleblowers from coming forward with additional allegations of misconduct for fear of retribution by their bosses, the experts said. You just don’t do it. You don’t have the agency you’re investigating involved in the investigation,’’ said Eric Feldman, who held   posts in inspector general’s offices at four federal agencies in Democratic and Republican administrations and now advises companies on ethics. “That’s why you have an independent inspector general: to avoid the potential for conflict. ’’ The agent’s cellphone records were obtained through an administrative subpoena issued by the DHS inspector general, people familiar with the probe said. Such subpoenas are a device that lawyers and former government officials say federal agencies increasingly use to force people and companies to turn over personal records and other documents without the prior approval of a judge. Breitbart News asked Department of Justice if it intended to launch its own investigation into the leak of the draft DHS document, but has not received a response. “There are laws regarding the unauthorized disclosure of classified materials and a process by which agencies can report unauthorized disclosures to the Department of Justice,” the FBI spokesperson tells Breitbart News. “You should direct your questions to DHS to determine whether such a disclosure has occurred. Typically, documents would contain portion markings indicating classification,” the spokesperson said. “Ethics or policy violations would also be reviewed by the appropriate office within DHS, not the FBI,” the spokesperson added.'"}, "time": 1742562509.4463966}