{"duration": 0.015731096267700195, "input_args": {"text": "'LA2024 Chief Executive Officer Gene Sykes told Southern California Public Radio’s 89. 3 KPCC last Thursday that President Donald Trump had been more helpful than President Barack Obama in helping to secure the 2024 Olympics for Los Angeles. [Last month, as Breitbart News reported, President Trump gave his strong support to L. A.’s Olympic bid after meeting with the International Olympic Committee: “I would love to see the Olympics go to Los Angeles. I think that it’ll be terrific. The United States committee’s members have asked me to speak up about it, and I have, and I think I’ve helped them, and let’s see what happens. ”  In contrast, Sykes said, President Obama had been noncommittal, following his lackluster role in Chicago’s failed bid to host the 2016 games. “He [Obama] never went to an Olympic games, never met with the IOC [International Olympic Committee] leadership, never talked to them by phone, and showed sort of a disregard and that was deeply frustrating to the leaders of the IOC,” Sykes told KPCC. Sykes also acknowledged that Trump’s role was a “  sword,” given global opposition to some of his policies, as well as bad media coverage. In February, former L. A. mayor (and 2018 gubernatorial candidate) Antonio Villaraigosa worried openly that Trump’s immigration policies would hurt the city’s Olympic bid. 2024 would mark the 40th anniversary of the highly successful 1984 Summer Olympics, dominated for Americans by memories of Carl Lewis’s    sweep (and only somewhat marred by a Soviet bloc boycott). The other contender to host the 2024 games is Paris. The vote is scheduled for September. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak. This article has been corrected to reflect Budapest’s withdrawal from contention on March 1. '"}, "time": 1742628469.381387}