{"duration": 0.1776742935180664, "input_args": {"text": "'James Baldwin died in 1987, but his moment is now. His books are flying off the shelves. He has inspired homages like Raoul Peck’s documentary “I Am Not Your Negro” and   Coates’s memoir “Between the World and Me. ” Baldwin’s prophetic essays on race read like today’s news. And yet a full understanding of this pioneering gay   artist remains elusive. While Baldwin’s books are in print, there’s one revealing work that admirers long to read but have mostly been unable to: his letters. The Baldwin estate has held tight to hundreds in its possession, letting only a few scholars see them. It has almost never allowed any of Baldwin’s correspondence to be published, or given biographers permission to quote a single word. Now, Baldwin’s papers have landed in one of the nation’s leading archival institutions, the Schomburg Center for Research in Black Culture, a division of the New York Public Library, in Harlem. But, in a striking twist, many of his personal letters will remain off limits for another generation  —   a byproduct of complicated negotiations between the library and the estate, and a reminder that family members are not always comfortable with the spotlight’s falling on a loved one, even decades after death. The acquisition is a   coup for the Schomburg, which announced the surprise news at a event there on Wednesday night. It’s also a kind of homecoming for Baldwin, a preacher’s son who grew up not far from the center’s landmark building on Malcolm X Boulevard. “Even though it’s taken 30 years, it’s the perfect time,” Kevin Young, who became the director of the Schomburg in December, said in an interview. “It’s like he never left. ” The archive  —   the bulk of which is open to researchers immediately  —   contains a wealth of manuscripts, drafts and notes relating to Baldwin’s sprawling output, most of which have rarely been seen by scholars. There are also letters from luminaries including Lorraine Hansberry, Nina Simone, Bobby Seale, William Styron and Jacqueline Kennedy Onassis, a testament to the sociability of a man who seemed to go everywhere, and know everyone. Still, Baldwin’s correspondence with four of his closest intimates is under   seal, part of a set of restrictions that suggest that his famously protective estate is not quite ready for the world to see the private Baldwin in full. Those confidants include Baldwin’s brother David and three lifelong friends, among them Lucien Happersberger, a bisexual Swiss painter Baldwin once called “the one true love story of my life. ” William Kelly, the New York Public Library’s director of research libraries, described the restrictions, including the seal on roughly half the personal correspondence in the archive, as complicated but “fairly modest. ” “There’s always a balance in guaranteeing access for scholars, while at the same time being sensitive to the family,” Mr. Kelly said. (Gloria   Baldwin’s sister and executor, declined through the library to be interviewed for this article.) Other limitations  —   like a   waiting period on any public display of all but a handful of items  —   seem puzzlingly out of step with current trends at archives, which tend to make as much freely available and visible online as copyright will allow. (The library also declined to let The New York Times photograph anything beyond eight items the estate had approved for display.) But Mr. Kelly said the restrictions were outweighed by the sheer richness of the archive, which sheds light on how Baldwin navigated different aspects of his identity  —   gay,   political, artistic. “I was dazzled by it,” he said, referring to the collection. The library declined to disclose the purchase price, which was paid with donations from the Ford Foundation, the Knight Foundation, New York Life and three individual donors. (One donor, Mr. Kelly said, contributed the last $500, 000.) For its money, the Schomburg got some 70 boxes of material  —   about 30 linear feet, in  . It spans the full range of Baldwin’s career, from typescripts of his teenage poetry to handwritten drafts of “The Welcome Table,” his final, unfinished play about an imaginary dinner party featuring an   Panther, a professor and a Josephine   dancer. (It was inspired by visits Baker made to Baldwin’s house in the South of France, where he spent the last decades of his life.) “He went where his muse went,” said Steven G. Fullwood, the Schomburg’s associate curator of manuscripts, archives and rare books. “He was always questioning himself and the world. ” The eight preapproved items from the collection will be on view through Monday, in a small   exhibition. When I visited the Schomburg earlier this month, archivists had laid out a much larger selection that spoke to the archive’s range and depth. There was a typescript of unpublished notes on Beauford Delaney, a gay   painter whom Baldwin met at the age of 15 and came to see as his “spiritual father. ” It was from Delaney that he learned about “the light contained in every thing, in every surface, in every face,” Baldwin wrote. (Correspondence with Delaney is covered by the   seal.) One folder held an unproduced play script based on “Giovanni’s Room,” Baldwin’s   1956 novel about an American expatriate in France, torn between his love for a man and societal pressure to marry. (The novel was dedicated to Happersberger.) There were character notes for his novel “Just Above My Head” (1979) scrawled on a card for a jazz club, and a draft of an unproduced screenplay about Malcolm X, written out longhand in an orange notebook labeled “Homework. ” There were also clarion blasts of the prophetic Baldwin, like an unpublished 1978 note recalling the day 10 years earlier when he had learned that the Rev. Dr. Martin Luther King Jr. had been assassinated. “Ten years! The mind and the heart refuse that knowledge,” Baldwin wrote. “I really feel, as I write this now, the same, unbelieving wonder, the same shocked and helpless rage. ” That passage echoes a scene in the new documentary “I Am Not Your Negro,” which was based on notes for “Remember This House,” a book about King, Malcolm X and Medgar Evers that Baldwin planned but never wrote. In a recent essay, Mr. Peck, who said he gained full access to Baldwin’s papers, recalled the eureka moment when Ms.   handed them to him. (Those notes, now at the Schomburg, are sealed for 10 years.) But for others, the real buried treasure is the correspondence. In 2007, the critic Hilton Als wrote that there was “one great Baldwin masterpiece waiting to be published, one composed in an atmosphere of focused intimacy, and that is a volume of his letters, letters his family does not want published. ” One person who has seen some of the most intimate letters is Ed Pavlic, a poet and professor at the University of Georgia. In 2010, Ms.   gave him access to some 120 letters from Baldwin to their brother David, written over the course of 40 years and totaling some 70, 000 words. Ms.   suggested that Mr. Pavlic try to find a book in them. But when he sent her a manuscript and asked for permission to quote, Mr. Pavlic said, he got no response and was unable to publish it. Mr. Pavlic, who has written about his experiences with the letters, said the lack of access to Baldwin’s correspondence had made it difficult for scholars to make full sense of  —   or even create an accurate record of  —   a life spent constantly on the move. And the letters he saw, far from damaging Baldwin’s reputation, would burnish it, he said. “The private record, for me, just amplifies and confirms and makes more dramatic the public messages he was out to convey,” he said. In addition to David Baldwin and Happersberger and Delaney, the   seal also covers Baldwin’s correspondence with Mary Painter, a longtime friend to whom he dedicated his 1962 novel, “Another Country. ” Oddly, some of Baldwin’s letters to these intimates (who are all dead) are accessible in other archives, like the Beinecke Rare Book  Manuscript Library at Yale, which has even posted some of its Baldwin collection online. As for the restrictions at the Schomburg, Mr. Young emphasized that a vast majority of the collection was open for   research, and that the rest would be available “in due time. ” “I take the long view,” he said. “Archives move by decades and generations. We’re here to keep it forever. ”'"}, "time": 1742563863.7893195}