{"duration": 0.08315157890319824, "input_args": {"text": "'As Venezuela enters year eighteen of the Bolivarian Socialist Revolution, the international community is finally paying attention, as Venezuelans struggle to find food, medicine, and an outlet for their frustration that will not trigger rampant state violence. [There is no short version of the story of how South America’s wealthiest nation, which boasts the world’s largest known oil reserves, became a nation where 15 percent of people need to scavenge through garbage to eat while the nation’s dictator dances on state television. Venezuela’s decline is the inevitable endgame of socialism, told by the deterioration of its streets, the abuse of its opposition politicians, and the use of the military to maim and kill Venezuelan children as young as 14.  Below, 20 images show the true toll of socialism in Venezuela. December 2011: While the death of Hugo Chávez allowed for socialist leaders to rapidly develop the cult of personality around him as a saint and martyr of socialism, the North   cult worship of Chávez began during his lifetime. In 2011, chavista government officials put together a Christian “nativity scene” depicting Chávez as the baby Jesus figure, surrounded by founding fathers such as Simón Bolívar. (L’encre Noir)   May 2011: As violent drug and gang activity flourished under Chávez, Venezuelans grew to fear murder at the hands of thugs so much that they prayed to dead thugs to protect them, creating idols known as “santos malandros” —  ”holy thugs“ —  and offering them small sacrifices in exchange for safety on urban streets. (AP Photo) May 20, 2017: Protesters flood the streets of San Cristóbal, the capital of westernmost Táchira state, where resistance to socialism has been often the most aggressive. (Luis    Images) May 20, 2017: Caracas is also no stranger to giant peaceful opposition mobilizations, with the below protest occurring on the same day as the Táchira march. (Federico    Images) July 2016: Táchira residents cross the border between Táchira and Colombia by the tens of thousands to purchase necessary home goods unavailable in Venezuelan stores. Families crossed to buy detergent, paper towels, food, and other needs. (George  ) August 2015: To prevent Venezuelans from fleeing, and in protest of objections to human rights violations in the country from Colombia, Maduro shut the border down and violently deported all Colombian citizens on the border. Homes where Colombian citizens used to live were marked “D” for “demolition,” to erase any trace of Colombians there. Colombian President Juan Manuel Santos denounced the move as using “Nazi ghetto tactics” against a friendly neighboring country. (Foto:Blu Radio) February 2014: Long before Táchira residents found themselves scrambling into Colombia for basic foods, however, they began demanding free exercise of political rights. Táchira was the first state to take down a likeness of dictator Hugo Chávez, nearly a year after the late dictator died. (Twitter) WARNING: GRAPHIC February 15, 2015: San Cristóbal residents gather around the lifeless body of Kluivert Roa, 14, shot and killed by Venezuelan soldiers while walking home from school. Witnesses say Roa saw a protest while walking home and shouted “stop the repression!” before soldiers shot him in the head. (George Castellanos   via Clarín) WARNING: GRAPHIC May 20, 2017: Due to the presence of armed soldiers and armed chavista gangs known as colectivos, protesters have grown extremely concerned that infiltrated government agents have joined the protests. During this protest, young protesters surrounded Orlando Figuera, accused of being a thief and chavista, and burned him alive. (AFP) April 1, 2014: While the government has reserved its most intense violence for the average protester, it has not relented on attacking government members of the opposition, either. Below, lawmaker Maria Corina Machado (center) —  illegally ousted from the National Assembly —  flees as soldiers attack her with tear gas during a peaceful protest. (Twitter) April 2017: Maduro has rounded up and arrested many opposition leaders. The most prominent among them is the head of the Popular Will party, Leopoldo López, who was banned from seeing family for a month this year. Below, wife Lilian Tintori points up at her husband’s prison cell in the notorious Ramo Verde military prison, surrounded by soldiers ensuring she could not meet him. (Ronaldo   Images) January 11, 2010: The violence that Bolivarian Socialism has brought to Venezuela only tells half the story. The other half is one of extreme poverty, where the value of the currency, the bolívar, has been in freefall for years. Even those with money struggle to find a store that is properly stocked. During the Chávez era, finding junk food and unhealthy soda in supermarkets was still possible, but not without encountering   soldiers posted to prevent visitors from photographing the shortages or attempting to buy more than “necessary. ” During the Maduro era, the government implemented a strict ration card system. (Juan    Images) May 2016: The below image is not an uncommon find in Venezuelan supermarkets. (Juan  ) June 2016: The cities of Caracas are lined with garbage, and up to 15 percent of the population need to dig through garbage to eat. The crisis is particularly affecting children, who are growing and have specific nutrition requirements impossible to meet with the average Venezuelan diet. (Sumarium. com) March 2017: While human families struggle to feed themselves, Venezuela’s zoos have been almost completely unable to fulfill the needs of their animals. In March, rare images inside a Venezuelan zoo (the Venezuelan military severely limits the public’s photographing rights) surfaced showing Ruperta, a    African elephant, showing clear signs of malnutrition. The Venezuelan government denied that the elephant was suffering. (Twitter) September 2016: Hospitals are faring little better than Venezuela’s supermarkets. Shortages of drugs and medical supplies have plagued the country for years, sending infant and maternal mortality rates skyrocketing. Below, a hospital uses cardboard boxes as cribs for their newborns. ( ) May 8, 2017: The staggering shortages have triggered waves of protests, like the one above in Táchira and daily protests in Caracas since March. Maduro has had two   responses to the protests: extreme military violence against civilians  …     [Federico    Images] November 2016:   …    and dancing. The dictator dances on the set of his new radio program, Salsa Time. (  government) November 2016: Maduro has also done nothing to successfully improve the economy. In November, the pile of bolivares, shown below, was worth $100. The value has decreased significantly since. (Ben   News) December 16, 2016: Maduro attempted to improve the ease of use of the bolívar by outlawing the   note and replacing it with larger denominations. The larger denominations were not printed in time, so the value of Venezuela’s   notes went to zero overnight. Venezuelans began burning the bills or ceremonially tossing them in trash cans. (George    Images.) Follow Frances Martel on Facebook and Twitter.'"}, "time": 1742562306.531766}