{"duration": 0.14272165298461914, "input_args": {"text": "'In the past, Virgil has taken note of various Main Stream Media tricks, such as the false “argument from authority” and the “assertion of a false conflict. ” [Well, the MSM is at it again.  This newest trick can be called, “build him up so as to try to knock him down. ”  A case in point is the lead editorial in The New York Times on January 31, entitled, “President Bannon?”  That editorial was mostly the usual lefty litany of attacks against Stephen K. Bannon, the former executive chairman of Breitbart News, now serving in the White House as President Donald Trump’s Chief Strategist.  Indeed, the utter familiarity of the   attacks makes Virgil conclude that Times writers must think that Times readers never get tired of reading the same “golden oldie”  .  However, there was one thing new in that latest attack. And that was the headline, “President Bannon?”  Even people a lot younger than old Virgil can plainly see what the Times was trying to do here namely, build Bannon up into sort of giant existential threat.  In this telling, he’s a threat not only to liberalism, but also, a threat to the constitutional order of the Republic.  The   reader is thus supposed to think to himself or herself, “Steve Bannon is bad enough.  But President Bannon?  Yikes!”  The   goal is to provoke ever more outrage from   readers.  And the   goal, of course, is to somehow knock out Bannon, as a way of somehow knocking out President Donald Trump. The latest flashpoint of MSM angst is Bannon’s participation in the National Security Council (NSC).  On January 28, President Trump issued a   memorandum outlining his update to the structure of the NSC it’s typical for any  new president to do this at the beginning of his term. In the course of all the legalese, the new presidential document assigned Bannon a place on the “Principals Committee” of the NSC.  That is, Bannon will participate in NSC deliberations —  under the direction, of course, of the President.  Other members of the NSC include Vice President Mike Pence (who is to preside over NSC meetings in the President’s absence) the Secretary of State, the Secretary of Defense, as well as six others, including Bannon.  In addition, another   senior figures in the government are mentioned as frequent, or likely, participants.  In other words, the most that one can say is that Bannon is one of ten regular “Principals,” and nearly a score of total attendees.   And yet since the MSM mantra is All   All The Time, obedient journos have gone into overdrive.  For example, veteran   Jonathan Alter, a fixture on MSNBC, has tweeted: Breaking: obscure law requires Sen confirmation for WH aide like Bannon to serve on NSC. 50 U. S. Code § 3021   Wow.  Citing an exact legal code makes Alter’s claim sound so official.  But then, a lot of fake news sounds official.  Yet as Jack Landman Goldsmith —  who served as a   appointee in the Bush 43 Justice and Defense Departments, and is now a professor at Harvard Law School —  tweeted in response: Bannon is not on the NSC.   Order says he is invited to attend as   attendee.  Lots and lots of people not on NSC attend. Goldsmith has it right: According to federal law —  the National Security Act of 1947, as amended —  the National Security Council, and also, the more recent Homeland Security Council, have a very few “statutory” members that is, formal memberships, enumerated in the underlying statute.  And nothing that Trump decided last week changes that such a change would require an act of Congress.   In other words, while Bannon certainly has a high position in the Trump White House, he has no statutory role in the NSC.  He is not, for example, in any way a part of the National Chain of Command that’s another matter of statute.  Bannon is simply a valued member of the President’s team —  and we all already knew that.  And yet the reality of the situation notwithstanding, the Times went to work.  In that editorial, “President Bannon?” the purported newspaper of record attempted to whip Bannon’s elevated role into some sort of coup d’etat: A new executive order, politicizing the process for national security decisions, suggests Mr. Bannon is positioning himself not merely as a Svengali but as the de facto president. Got that, Times readers?  Bannon isn’t merely some sort of wickedly hypnotic figure, he’s on his way to being the “de facto president. ”   As we have seen, there’s not a scintilla of truth to any of this, but as we have also seen, the Times loves  .  And with that in mind, the editorial made the same fallacious point a second time:  While Mr. Trump long ago embraced Mr. Bannon’s politics, he would be wise to reconsider allowing him to run his White House. You get the idea: “de facto president,” “run his White House. ”  As they say, sometimes a falsehood, repeated often enough, becomes persuasive —  at least that’s the result that the Times is striving towards.  This repetitive technique is sometimes called “The Big Lie. ”  Or, as Virgil likes to say, magnum mendacium.   Of course, the Times is hardly alone on the   bandwagon right now, a hashtag campaign on Twitter, #StopPresidentBannon, is going full blast.  Indeed, much of the MSM is joining in this attempted stampede.  Here, for example, is a headline from the   Beltway publication, Foreign Policy: “Steve Bannon Is Making Sure There’s No White House Paper Trail, Says Intel Source: The Trump administration’s chief strategist has already taken control of both policy and process on national security. ”  Got that?  The goal of all this reportorial alarmism is to make you afraid, very afraid. In this instance, the supposed issue of import is NSC  .  Given that the Trump administration is not even two weeks old, it’s unlikely that any sort of precise precedent for records has been established, and yet that didn’t stop reporter Kate Brannen from declaring, “The lack of a paper trail documenting the   process is also troubling. ”  Brannen’s source for all this ominousness, we might add, was an “intelligence official. ”  Ah yes, the   “intelligence official,” always ready to give a reporter a juicy   quote.  We might note that is the modus operandi of the Deep State.  In the past, Virgil has chronicled the Deep State’s effort against the Trump administration, as well as, of course, the MSM campaign waged against Bannon.  So this latest is just another blast from the Deep State, dutifully trumpeted by the MSM.     Amusingly, that Foreign Policy article held up the Bush 43 administration as the gold standard of NSC  .  That might be a source of amusement —  albeit bitter amusement —  for those who remember the follies of, for example, the Iraq War.   And yet for veterans of that vainglorious conflict, and for the families of the fallen and the wounded, it’s no comfort to know that the Bush NSC was careful to write up a thorough “summary of conclusions” after every meeting.  The rest of us, too, can quickly see: the critical issue is the quality of the decision, not the quantity of the paperwork. Yet as we know by now, the MSM attacks —  grabbing any available hammer, no matter how ridiculous —  will never stop.  The same Foreign Policy, we might add, made ample room on the same day for another   this one from dedicated #NeverTrumper Max Boot:  “President Bannon’s Hugely Destructive First Week in Office: The puppet master is leading the Trump administration down a road of carnage. ”  For his part, Virgil has always figured that hardcore supporters of the Iraq War, such as Boot, ought to be a little more circumspect before throwing around phrases such as “road to carnage. ”   Still, the real issue isn’t Bannon.  Instead, the real issue is Trump.  And Foreign Policy gave that game away in yet another story, headlined, “3 Ways to Get Rid of President Trump Before 2020. ”  That piece, written by Rosa Brooks, a former under secretary of defense in the Obama administration,   raises the idea —  Virgil kids not —  of a military coup d’etat against Trump.   Okay, so Brooks is showing a high degree of kookiness that should forever disqualify her from future public service.  And yet, of course, the Trump administration is young, and so there’s plenty of time for other “progressives” to join Brooks’ extremity.  Meanwhile, the rest of us can watch these antics with a combination of bewilderment and bemusement.  The only thing we should always bear in mind is that the MSM’s real target is Trump.'"}, "time": 1742562344.2286873}