{"duration": 0.1966712474822998, "input_args": {"text": "\"It was rare for poet and singer-songwriter Leonard Cohen to venture into the realm of politics, however, quite a few of his songs, including some of his love songs, were infused with a bleakness that confronted morality and the darkness of humanity. He also wrote a song of hope and possibility about the experiment of democracy in the United States that, perhaps, takes on a new kind of resonance in the wake of the election of Donald Trump.\\nCohen was asked in 2014 if songs can offer solutions to political problems. He replied, “I think the song itself is a kind of solution.”\\nAnd so, to pay tribute to a troubadour who died at 82 and whose artistic work only seemed to get better as he aged and his voice grew deeper, here is a retrospective on some of the more philosophical and sociopolitical songs he composed.\\n“Joan Of Arc” (1971) Cohen declared in an interview for Rolling Stone in 1971, “Women are really strong. You notice how strong they are? Well, let them take over. Let us be what we’re supposed to be – gossips, musicians, wrestlers. The premise being, there can be no free men unless there are free women.” He believed it was just for women to gain control of the world.\\nWith that context, this elegiac narrative takes on greater gravitas. It consists of a dialogue between Joan of Arc and the Fire, as she is burnt at the stake. The women’s movement was flourishing at the time, and Cohen saw Joan of Arc as a symbol of courage. Yet, he also recognized she may have been lonely because she had to disguise herself as a male soldier, and he imagined what it was like to fight English domination of France and in her final moments face down the fact that she would never return to what could be considered an ordinary life.\\n“Dance Me To The End Of Love” (1984) During a CBC radio interview in 1995, Cohen said the song came from “hearing and reading or knowing that in the death camps” during the Holocaust “beside the crematoria” the string quartet would be “pressed into performance” while “this horror” unfolded. Cohen sings in the opening, “Dance me to your beauty with a burning violin. Dance me through the panic ’til I’m gathered safely in. Lift me like an olive branch and be my homeward dove.” The song represents an embrace of passionate acts in the face of atrocities and death.\\n“If It Be Your Will” (1984) This is a truly grim song in which Cohen is probably using the specter of a benevolent oppressor or fascism as a metaphor for the next stage of a relationship. And yet, the lyrics are subtle enough that Cohen may be addressing morality and how easy it is to convince men to carry out heinous acts. He sings, “All your children here in their rags of light/In our rags of light/All dressed to kill/And end this night/If it be your will.”\\n“First We Take Manhattan” (1987) The song is about terrorism or militant extremism. It is told from the perspective of an individual who tried to work within the system in order to change it. That failed. Now the individual has taken solace in the “beauty of his weapons” and turned to Manhattan and to Berlin to make his or her mark.\\nIn a 2007 interview for XM Radio, he said, “There’s something about terrorism that I’ve always admired. The fact that there are no alibis or no compromises. That position is always very attractive. I don’t like it when it’s manifested on the physical plane. I don’t really enjoy the terrorist activities, but psychic terrorism. I remember there was a great poem by Irving Layton that I once read, I’ll give you a paraphrase of it. It was ‘well, you guys blow up an occasional airline and kill a few children here and there’, he says. ‘But our terrorists, Jesus, Freud, Marx, Einstein. The whole world is still quaking.'”\\nWhat Cohen meant, albeit in a very cynical way, is the philosophies of these people have such a history of being used to justify horrible acts. He never engages with the subject fully (and probably never wanted to do so), but Cohen’s song clearly approaches the issue of state-sponsored political violence versus political violence of the individual.\\n“Everybody Knows” (1988) It is one of the most well-known songs he ever recorded. The wry cynicism diagnoses the realities of a cruel world. In the neoliberal age of austerity, the opening lyrics are exceptionally appropriate, “Everybody knows that the dice are loaded. Everybody rolls with their fingers crossed. Everybody knows that the war is over. Everybody knows the good guys lost. Everybody knows the fight was fixed. The poor stay poor, the rich get rich. That’s how it goes. Everybody knows.”\\nCohen sings, “Everybody knows that you’re in trouble.” Those in charge of the social order are indifferent to the pain and suffering of the masses. But are the owners and politicians capable of maintaining control? Because everybody also knows that it is coming apart.\\n“Democracy (1990) Cohen described in an interview with Paul Zollo that he wrote the song after the Berlin Wall came down. “Everyone was saying democracy is coming to the east, and I was like that gloomy fellow who always turns up at a party to ruin the orgy or something. And I said, ‘I don’t think it’s going to happen that way. I don’t think this is such a good idea. I think a lot of suffering will be the consequence of this wall coming down.'”\\nThat seems strikingly backward. But it motivated Cohen to ask, “Where is democracy really coming?” He thought there may be more democracy coming to the United States. From a love of America, he wrote a song that is really about the irony of America, “a song of deep intimacy and affirmation of the experiment of democracy in this country.” He added, “This is really where the experiment is unfolding. This is really where the races confront one another, where the classes, where the genders, where even the sexual orientations confront one another. This is the real laboratory of democracy.”\\nGiven the American exceptionalism of Cohen’s statement, he could have easily produced something with lyrics Lee Greenwood would have proudly belted out on stage. However, each time Cohen sings, “Democracy is coming to the USA,” there is a raw irony it, like he does not believe the forces running this nation are capable of democracy. Then, there’s the inimitable line, “I’m sentimental, if you know what I mean. I love the country but I can’t stand the scene.” It makes it clear Cohen was a disappointed idealist. Like so many, he liked the idea of America but seeing it play out on that “hopeless little screen” was never quite what he had in mind.\\n“The Future” (1990) For this song, Cohen’s character looks into the future, and it is not good at all. It is so frightening, in fact, that he thinks he would be willing to see fascist society restored. “Give me back the Berlin wall. Give me Stalin and St Paul. Give me Christ or give me Hiroshima.”\\nThe song hurdles onward into more nostalgia for familiar horror, “Destroy another fetus now. We don’t like children anyhow. I’ve seen the future, baby: it is murder.” He has no hope that humanity can right itself. Civilization can try and erect a social order with a tyrant or it can unravel tyranny and push for something more just. Yet, inevitably, to Cohen’s character, there will be murder. In which case, what really is the right thing to do?\\n“On That Day” (2004) Cohen wrote this as a response to the September 11th attacks. It is an artifact that represents reactions to what happened. He sings, “Some people say it’s what we deserve for sins against god, for crimes in the world.” There are others who blame it on the fact that women live “unveiled” or because the country has its fortunes as well as people who are subjugated. Whatever the case may be, Cohen does not seek to settle the discussion. Rather, he seems more interested in whether those who survived were able to press onward. So he poses a rhetorical question: “Did you go crazy or did you report on that day?” Then the song abruptly ends.\\n“Amen” (2012) This song comes from the latter era of Cohen’s life, where the sultry nature of his music took on a much more wistful and brooding characteristic. He wrote about love but love in a time of war or love with inescapable horror all around.\\nIn “Amen,” the character Cohen channels desperately wants to love. He must first see through the terror around him. He does not think he can love until the “victims are singing and laws of remorse are restored.” He does not think he can love until the “day has been ransomed and night has no right to begin.” He awaits some kind of redemption and only then will he be able to feel wanted again, but there is too much despair and destruction right now for the character to indulge in pleasure.\\n“Almost Like the Blues” (2014) We live in a world of permanent war, and so, in this gorgeously layered piece of music, Cohen grapples with atrocities he witnessed. “I saw some people starving. There was murder, there was rape. Their villages were burning. They were trying to escape. I couldn’t meet their glances. I was staring at my shoes. It was acid. It was tragic. It was almost like the blues.”\\nFew of Cohen’s songs are as profound. The song, which appears on “Popular Problems,” could easily be grappling with what goes through the minds of war criminals. He sings, “I have to die a little between each murderous thought, and when I’m finished thinking, I have to die a lot.” The soldier witnesses torture or is party to it. He witnesses killing or is party to it. “And there’s all my bad reviews.” It seems his superiors are unhappy with his performance. Maybe, they do not think he is killing enough. Whatever the case may be, he has lost his grip on morality entirely and finds himself confronting the scope of his sins.\\n“A Street” (2014) To Cohen, “Popular Problems” was all about dealing with defeat . He told the Telegraph the lyrics were about facing down failure, disappointment, bewilderment—especially the “dark forces that modify our lives.” What is a person to do?\\n“Recognize that your struggle and your suffering is the same as everyone else’s,” Cohen suggested. “I think that’s the beginning of a responsible life. Otherwise, we are in a continual savage battle with each other with no possible solution, political, social, or spiritual.”\\nWhile referring to “A Street,” which is about a faltering romance during war, he added, “When I say ‘the party’s over but I’ve landed on my feet\\u2009. I’m standing on this corner where there used to be a street,’ I think that’s probably the theme of the whole album. Yeah, the scene is blown up, but you just can’t keep lamenting the fact. There is another position. You have to stand in that place where there used to be a street and conduct yourself as if there still is a street.”\\nIn a very basic sense, the master of romantic despair, the high priest of pathos, has now gone up to that Tower of Song, meant people have to find ways to keep living. They have to exist, and by existing, that is in and of itself an act of resistance to all the depravity that unfolds around them.\\nThe post The Political Songs Of Leonard Cohen appeared first on Shadowproof .\\n\""}, "time": 1742563591.6903589}