{"duration": 0.04900932312011719, "input_args": {"text": "'Hillary Emails: “Taken Care Of” October 28, 2016 Hillary Clinton waves to the crowd after delivering her \\'\\'official launch speech\\'\\' at a campaign kick off rally in Franklin D. Roosevelt Four Freedoms Park on Roosevelt Island in New York City, June 13, 2015. \\nRecently released email show a Clinton campaign manager pretty confident that \"everything was taken care of\", It is believed he referred to Clinton\\'s email usage. \\nMembers of what would become Hillary Clinton’s campaign team discussed her use of a private email account as secretary of state in Summer 2014, months before her email practices were publicly revealed. But an email released on Thursday shows that Robby Mook, Clinton’s campaign manager, was not overly concerned about the issue at that time because he was told that “everything was taken care of.” It is not clear what Mook meant by the cryptic statement, which he made in an exchange with Clinton campaign chairman John Podesta. \\nThe email, which was hacked from Podesta’s Gmail account and released by WikiLeaks, is the first to show that the Clinton team was caught almost completely off guard by The New York Times’ March 2, 2015 story about Clinton’s email usage. The late-night email exchange happened within hours of the New York Times breaking the news that Clinton exclusively used a private email account in a way that may have broken records rules. \\n“Did you have any idea of the depth of this story?” Podesta asked Mook in the email. \\nAt 1:32 a.m., Mook wrote back: \\n\"Nope. We brought up the existence of emails in research this summer but were told that everything was taken care of.\" \\nThe exchange appears to show that even Clinton\\'s most senior aides were initially unprepared for the scale of revelations about Clinton\\'s email practices, which would end up dogging her campaign all the way through to the final weeks leading up to the Nov. 8 election. After a yearlong investigation, James Comey, the director of the Federal Bureau of Investigation, said in July that Clinton and her staff were \"extremely careless\" with classified information, but that no reasonable prosecutor would bring charges.'"}, "time": 1742561863.8114207}