{"duration": 0.09900259971618652, "input_args": {"text": "'The mainstream media’s reaction to Breitbart News’ expanded influence has run the gamut from bewildered hostility to turgid hysteria, and not much in between. [Media sites are struggling to frame the news of Breitbart’s recent high profile hires, plans to open new bureaus in Europe, and the departure of former Breitbart employees to work in the Trump White House. We summarize their findings here for the amusement of our 45 million unique monthly readers.  First up, the Washington Post is upset that Breitbart is not racist. While falsely labeling us an “ ” site, the Washington Post’s Callum Borchers speculates on Breitbart’s future in an article titled: “How Breitbart could lose its   street cred. ” The Post moans: “Breitbart has, in fact, looked increasingly mainstream since Election Day. ” After weeks of disingenuously associating us with “white supremacists,” “white nationalists,” and “” the Post appears frustrated to learn that we’re not cross burners after all. But, of course, the Post couches their disappointment by feigning concern for our “street cred. ” If we “go mainstream,” the Post warns that we “risk alienating readers who were drawn to the website because it seemed to be by and for outsiders. ” When reached for comment, Breitbart senior management thanked the Post for the warning and shared the following image from Alexa. com’s top US website rankings: The Atlantic’s Rosie Gray claims we’re trying “to go Mainstream. ” She describes Breitbart News as a “scrappy, outsider publication” that “has never enjoyed this much prominence —  but it’s discovering that success brings its own challenges. ” Like the Washington Post, Gray expresses concern that the more Breitbart “becomes part of the mainstream, the more its outsider cred is threatened. ” Ironically, Gray mocked Breitbart just a few days ago for running an oversized headline framing Trump’s inaugural address as  : Breitbart going with the   font pic. twitter.   —   Rosie Gray (@RosieGray) January 20, 2017,  When reached for comment, Breitbart senior management thanked the Atlantic for its concern and shared the following image from Alexa. com’s top US website rankings: Meanwhile, Salon labels Breitbart News a “fringe news site” and “  propaganda organ. ” Salon’s Gary Legum writes that the recent White House hiring of former Breitbart employees ranks high on the list of the “many tragedies   …     set in motion by the nascent Donald Trump administration. ” And as a “fake news” bonus, Salon used a headline photo purporting to show the former Breitbart employees who left to join the Trump White House. They included an image of former Breitbart Executive Chairman Steve Bannon, former Breitbart Senior National Security Editor Sebastian Gorka, and a woman they claim is former Breitbart reporter Julia Hahn. Breitbart    Alexander Marlow, when reached for comment, said, “Scoreboard. Oh, and I have no idea who that woman is. ” Legum describes in lurid detail the horrors of “a fully   White House”: With Bannon in the West Wing, it was inevitable that the administration would bring in a few of the propagators of the racist, isolationist, nativist swill that over the last few years has made Breitbart the   “news” site for the sort of white people who berate Mexican restaurants for printing their menus in Spanish. But even recognizing the likelihood that Bannon would poach some of his former employees was not enough preparation for the   ugliness we will likely hear on a daily basis from a fully   White House. We offer no comment about “  ugliness,” but Breitbart National Security Editor Frances Martel, when reached for comment, said this about the Mexican restaurant menus: Ojalá que tenga razón Salon que los americanos que no hablan español le estén dando tanto negocio a los restaurantes mexicanos, porque la comida mexicana es deliciosa (aunque, claro, no mejor que la cubana). The Associated Press  —   the mainstay of establishment journalism  —   is perhaps understandably miffed that Breitbart is now treated with the same respect as their own hallowed organization at White House press briefings. Two weeks ago, they offered a snarky aside that only Breitbart got a reserved seat at Trump’s January 11 presser. “Other reporters scrambled to save their seats. Reporters shouted and waved their arms at Trump to get his attention, rather than the president calling on questioners from a list, as is often the practice,” the AP sniffed. Breitbart CEO Larry Solov was unavailable for comment.'"}, "time": 1742564302.4050715}