{"duration": 0.1944568157196045, "input_args": {"text": "'WASHINGTON, D. C.  —   President Donald J. Trump told Breitbart News in an exclusive Oval Office interview that the “intent” of the New York Times in its negative coverage of him is “so evil and so bad” and that “they write lies. ”[“If you read the New York Times, if you read the New York Times, it’s —  the intent is so evil and so bad,” President Trump said in the interview on Monday afternoon. “The stories are wrong in many cases, but it’s the overall intent. Look at that paper over the last two years. In fact, they had to write a letter of essentially apology to their subscribers because they got the election so wrong. ”  He went on to say about the newspaper that “they write lies. ” Trump’s comments came in a discussion about the media generally, in a part of the exclusive Oval Office interview focused on “fake news” and “fake media” versus journalists who are trying to get it right. The president specifically praised this reporter, and Steve Holland of Reuters, as two examples of journalists who do try to accurately report the news —  and made a distinction between “fake” media and the media as a whole. Trump said that the “fake” media has made a concerted effort to conflate his distinction between “fake media” and the media generally, and that “there’s a difference” between the two. He said that his comments about the “opposition party” and the “enemy of the American people” were specifically about the “fake media,” not the media as a whole. This is a point that the president made in his speech to the Conservative Political Action Conference (CPAC) hosted by the American Conservative Union (ACU) last Friday in National Harbor, Maryland, just outside Washington, D. C. Hope Hicks, the director of Strategic Communications at the White House, joined in part of the conversation with the president. The president also specifically singled out the New York Times for one embarrassing and egregious error the newspaper made during the course of the campaign, when it posted an article —  and printed it on the front page —  containing allegations from several women against him. The piece, by Michael Barbaro and Megan Twohey, was actually challenged by women quoted therein, prompting even the vehemently   CNN to question the authenticity of the Times’ reporting, with CNN’s Kate Bolduan saying the piece was “concerning” to her “as a journalist. ” President Trump also declined to comment specifically on the looming   Warner potential merger, a deal that would boost CNN’s parent company significantly, but did say generally speaking he believes there should be “competition in the marketplace” —   especially in the media industry. Read a full transcript of this section of President Trump’s interview with Breitbart News, including the section with Hicks: BREITBART NEWS NETWORK (BNN): “The big thing I kind of wanted to zone in on right off the bat is ‘the opposition party,’ the media —  “ PRESIDENT TRUMP (POTUS): “Well, it’s not the media. It’s the fake media. ” BNN: “That’s what I was going to —  “ POTUS: “There’s a difference. The fake media is the opposition party. The fake media is the enemy of the American people. There’s tremendous fake media out there. Tremendous fake stories. The problem is the people that aren’t involved in the story don’t know that. ” HOPE HICKS: “Just the fact that they didn’t report that accurately proves your point. ” POTUS: “Which accurately?” HICKS: “They said ‘Oh Donald Trump said the press is the enemy of the American people. ’” POTUS: “Right. They take ‘fake’ media off. They say ‘the media is the enemy of —  well, they didn’t say the ‘fake media.’ I didn’t say the media is the enemy —  I said the ‘fake media.’ They take the word fake out and all of a sudden it’s like I’m against —  there are some great reporters like you. I know some great honorable reporters who do a great job like Steve [Holland] from Reuters, others, many others. I wasn’t talking about that. I was talking about the fake media, where they make up everything there is to make up. ” BNN: “Right and that’s what I wanted to zone in on with you because I know you made that very clear in your CPAC speech. Can you kind of more clearly define what standards and quality we should expect from those who are doing reporting?” POTUS: “It’s intent. It’s also intent. If you read the New York Times, if you read the New York Times, it’s —  the intent is so evil and so bad. The stories are wrong in many cases, but it’s the overall intent. Look at that paper over the last two years. In fact, they had to write a letter of essentially apology to their subscribers because they got the election so wrong. They did a front page article on women talking about me, and the women went absolutely wild because they said that was not what they said. It was a big   article, and the Times wouldn’t even apologize and yet they were wrong. You probably saw the women. They went on television shows and everything. ” BNN: “Yes, it was pretty embarrassing for the Times. ” POTUS: “[They said] ‘we really like Donald Trump and he [the Times reporter] totally misrepresented us. He said he was going to say good and it was absolutely bad.’ This was a front page article, almost the entire top half of the New York Times, and it was false. It was false. Did they apologize? No. I call them the failing New York Times and they write lies. They write lies. Nobody would know that. For instance, when people read the story on the women —  first of all, the reporter who wrote the story has a website full of hatred of Donald Trump. So, he shouldn’t be allowed to be a reporter because he’s not objective. It’s not all, but it has many negative things about Donald Trump. But he shouldn’t be allowed to write on Donald Trump. And, he writes that story. But that’s one of many. So, when you read the Sunday New York Times, it’s just hit after hit after hit. And honestly, I think people are wise to it because if you look at the approval rating, you see it’s down. You know, it’s gone. There’s very little approval. ” BNN: “Now, during the campaign, one of the things you and a lot of your campaign guys like Peter Navarro talked about was breaking up some of these oligopolies in the media. If you look at the media, part of the problem seems to be that a vast majority of the media companies are owned by just a handful of different companies. Obviously, there’s a looming merger between ATT and Time Warner. I wanted to see what your thoughts are on that and if CNN’s pretty bad behavior over the course of —  they really don’t seem to be making an effort to get it right —  does that give you hesitation in terms of approval of the deal?” POTUS: “I don’t want to comment on any specific deal, but I do believe there has to be competition in the marketplace and maybe even more so with the media because it would be awfully bad after years if we ended up having one voice out there. You have to have competition in the marketplace and you have to have competition among the media. And I’m not commenting on any one deal, but you need competition generally and you certainly need it with media. ” Specifically, this part of the interview came in the wake of the president’s CPAC speech, in which he delineated the difference between fake news and real news. At CPAC on this topic, Trump said:  I want you all to know that we are fighting the fake news. It’s fake, phony, fake. A few days ago I called the fake news the enemy of the people. And they are. They are the enemy of the people. Because they have no sources, they just make ’em up when there are none. I saw one story recently where they said, “Nine people have confirmed. ” There’re no nine people. I don’t believe there was one or two people. Nine people. And I said, “Give me a break. ” Because I know the people, I know who they talk to. There were no nine people. But they say, “Nine people. ” And somebody reads it and they think, “Oh, nine people. They have nine sources. ” They make up sources. They’re very dishonest people. In fact, in covering my comments, the dishonest media did not explain that I called the fake news the enemy of the people. The fake news. They dropped off the word “fake. ” And all of a sudden, the story became the media is the enemy.  They take the word “fake” out. And now I’m saying, “Oh, no, this is no good. ” But that’s the way they are. So I’m not against the media, I’m not against the press. I don’t mind bad stories if I deserve them. And I tell ya, I love good stories, but we don’t get —  I don’t get too many of them. But I am only against the fake news, media or press. Fake, fake. They have to leave that word. I’m against the people that make up stories and make up sources. They shouldn’t be allowed to use sources unless they use somebody’s name. Let their name be put out there. Let their name be put out. “A source says that Donald Trump is a horrible, horrible human being. ” Let ’em say it to my face. Let there be no more sources. And remember this  —   and in not  —   in all cases. I mean, I had a story written yesterday about me in Reuters by a very honorable man. It was a very fair story. There are some great reporters around. They’re talented, they’re honest as the day is long. They’re great. But there are some terrible dishonest people and they do a tremendous disservice to our country and to our people. A tremendous disservice. They are very dishonest people.  And they shouldn’t use sources. They should put the name of the person. You will see stories dry up like you’ve never seen before. So you have no idea how bad it is, because if you are not part of the story  —   and I put myself in your position sometimes. Because many of you, you’re not part of the story. And if you’re not part of the story, you know, then you, sort of, know  —   if you are part of the story, you know what they’re saying is true or not. This is the second part of President Trump’s exclusive interview with Breitbart News in the Oval Office on Monday. The first focused on the epic fail at the Academy Awards in Hollywood on Sunday night. More pieces from President Trump’s exclusive interview, including details about his Tuesday night address to a joint session of Congress and key matters such as immigration, health care, taxes, trade, and national security are forthcoming.'"}, "time": 1742564222.7582026}