{"duration": 0.08709383010864258, "input_args": {"text": "\"\\nThis article was written by Tyler Durden and originally published at Zero Hedge . \\nEditor’s Comment: Of course everyone knew, deep down, that Obama was fully aware of Hillary’s private emails, but now there is proof that the campaigns sought to cover up and clean up the evidence to it. Team Hillary went so far as to use bleach bit, a ridiculously thorough way of erasing one’s digital footprint. Before she even takes office, she is embroiled in a scandal many magnitudes bigger than Watergate… and yet… nothing. \\nNo one falls on their sword; no one drops out; no one is held accountable. It seems that “Teflon” will out-survive even the cockroaches and nuclear wars… \\nCan all the media spin and vote rigging really hold all this together? Can the FBI get away with looking the other way, and still pretend to uphold a nation of laws? Will the American people accept her “victory” and go on about their daily lives? \\nThe Smoking Gun: Cheryl Mills Tells Podesta “We Need To Clean This Up – Obama Has Emails From Her” \\nby Tyler Durden\\nRecall that in a March 2015 interview with CBS, just after the NYT reported of Hillary’s use of a private email server, president Obama told the American public he had only learned about Hillary’s “unusual” arrangement from the press.\\nAs we further reminded readers one month ago, CBS News senior White House correspondent Bill Plante asked Mr. Obama when he learned about her private email system after his Saturday appearance in Selma, Alabama. “ The same time everybody else learned it through news reports ,” the president told Plante. “ The policy of my administration is to encourage transparency, which is why my emails, the BlackBerry I carry around, all those records are available and archived ,” Mr. Obama said. “I’m glad that Hillary’s instructed that those emails about official business need to be disclosed.”\\n\\nUnfortunately, the “transparency” of the Obama administration was severely tarnished in late September , when in the FBI’s interview notes with Huma Abedin released by the FBI it was first revealed that Obama had used a pseudonymous email account: “Once informed that the sender’s name is believed to be pseudonym used by the president, Abedin exclaimed: ‘How is this not classified?'” the report says. “Abedin then expressed her amazement at the president’s use of a pseudonym and asked if she could have a copy of the email.”\\nTo be sure, this was not definitive evidence that Obama was aware of Hillary’s email server, nor that there may have been collusion between the president and the Clinton campaign.\\nThat changed today, however, when in the latest Podesta dump we learn that in an email from Cheryl Mills to John Podesta, the Clinton aide upon learning what Obama had just said…\\nI have some questions here pic.twitter.com/ufkeoZCx2m \\n— Katherine Miller (@katherinemiller) March 7, 2015 \\n\\n… countered with something quite stunning:\\nwe need to clean this up – he has emails from her – they do not say state.gov That, ladies and gentlemen, is proof that the president not only lied, but did so with the clear intention of protecting the Clinton campaign.\\n\\nAs a further reminder, Politico previously reported that the State Department had refused to make public that and other emails Clinton exchanged with Obama. Lawyers cited the “presidential communications privilege,” a variation of executive privilege, in order to withhold the messages under the Freedom of Information Act. It is therefore unknown what the president’s “alternative” email account was, or who hosted it.\\nThis also explains why in a prior Wikileak, Podesta told Mills in an email titled “Special Category” that she thinks “ we should hold emails to and from potus? That’s the heart of his exec privilege. We could get them to ask for that. They may not care, but I(t) seems like they will. ” Mills did not respond by email.\\nThe Clinton-Obama emails were turned over to the State Department, which later announced it would not release them.\\n* * *\\nSo just how did Mills and Podesta “clean up” the fact that Obama lied to the American people, a tactic some could allege is evidence of an attempt to cover up a presidential lie to protect Hillary Clinton.\\nWhat we do know, and we assume this is completely unrelated, between March 25-31, just a couple of weeks after Mills said “we need to clean this up,” Bleachbit was used to wipe Hillary’s private server clean. But of course, that is purely a coincidence.\\nSince we are confident others will also demand an answer, in light of the latest revelation hinting at a collusive cover up extending to the very top of US government, or as Cheryl Mills dubbed it a “clean up”, perhaps it is time for the State Department to unveil just what was said between the president and the Clinton campaign?\\nThis article was written by Tyler Durden and originally published at Zero Hedge . \\n\""}, "time": 1742561635.9937801}