{"duration": 0.16909170150756836, "input_args": {"text": "'Here’s a look at the most memorable moments from the 2017 Golden Globes, including Meryl Streep’s acceptance speech, Jimmy Fallon’s lackluster hosting, funny presenters and awkward flubs. Meryl Streep campaigned on behalf of Hillary Clinton, so expectations were high that when she took the Golden Globes stage to accept the Cecil B. DeMille lifetime achievement award, she would comment on the recent election. But how political would she be? Pretty political, as it turned out. She used her speech to call out   Donald J. Trump for seeming to mock a disabled New York Times reporter, and to warn that a free press would need to be defended. “This instinct to humiliate, when it’s modeled by someone in the public platform, by someone powerful, it filters down into everybody’s life, because it kinda gives permission for other people to do the same thing,” she said. “Disrespect invites disrespect, violence incites violence. And when the powerful use their position to bully others, we all lose. ” The room roundly applauded her remarks, but on social media some conservative commentators immediately criticized her and the target of her remarks had his own take. In an interview with The Times, Mr. Trump dismissed Ms. Streep as “a Hillary lover” and said that while he had not watched the ceremony, he was “not surprised” to come under attack from “liberal movie people. ”  —   Daniel Victor and Patrick Healy Read the full text of Meryl Streep’s remarks and read more about the  ’s comments. Jimmy Fallon, generally an ebullient cruise director for awards shows, wasn’t a presence so much as a nuisance. The “La La Land” intro only really worked if you’d already seen “La La Land,” and the segment lacked the pep and fun of, for example, his “Glee”  musical intro to the 2010 Emmys. There was barely a monologue, but a teleprompter snafu probably shouldn’t derail a comedian who hosts a TV show five nights a week. The rest of his material was tiny  —   and not funny  —   interstitials introducing the presenters with strained wordplay. Does this show need a host? Maybe not.  —   Margaret Lyons Read a review of the telecast. Even cynical   watchers had to smile when the songwriting duo Benj Pasek and Justin Paul, ages 31 and 32, came bounding onto the stage to collect their Globe for the moody “La La Land” tune “City of Stars. ” The young men had clearly not yet received the show business memo that awards are to be accepted with practiced (false) modesty and coolness. “We need to calm down!” shouted Mr. Paul. “We’re so nervous!” They charmingly dedicated their best song award to “musical theater nerds everywhere. ” (Mr. Pasek and Mr. Paul also wrote the music for the celebrated “Dear Evan Hansen. ”) The same kind of emotion could also been seen whenever the cameras passed the “La La Land” table, where the two producers who shepherded the film the longest, Fred Berger and Jordan Horowitz, ages 35 and 36, could be seen melting down with joy as their film racked up one prize after another. Add in multiple trips to the stage by the film’s director, Damien Chazelle, 31, and it felt like an arrival moment for a new set of Young Turks. On to the Oscars?  —   Brooks Barnes Read about the making of “La La Land. ” There’s no movie called “Hidden Fences. ” There’s “Fences,” starring Viola Davis and Denzel Washington, and there’s “Hidden Figures,” starring Taraji P. Henson, Octavia Spencer and Janelle Monáe. First Jenna Bush Hager said it on NBC’s red carpet show when she was interviewing Pharrell Williams (who is a producer of “Hidden Figures”) and then Michael Keaton said it onstage. Look alive out there, folks.  —   Margaret Lyons Read about Pharrell Williams’s reaction. Donald Glover’s two acceptance speeches for his work on the FX show “Atlanta” were touching and personal (“I grew up in a house where magic wasn’t allowed”) and also hilarious (“I’d like to thank the Migos  —   not for being on the show, but for making ‘Bad and Boujee.’ That’s the best song ever”). “Atlanta” was one of the best, most distinctive shows of last season, and everything about the show’s win, and Mr. Glover’s velvet suit, and the cast’s   portrait felt unique and just right.  —   Margaret Lyons Read the complete list of Golden Globe winners. It was a night of facial hair and sparkles, fairy princess frocks and character dressing, with the characters, and the (Hollywood) royals, dressed straight from the silver screen playbook. Of course, some costumes are less obvious than others. And when it comes to the red carpet, at least pretending to dress as yourself as opposed to, say, a cut flower or Disney caricature, has power. Ruth Negga, for example, in a   sequined   gown (who doesn’t love the idea of a   gown?) by Louis Vuitton, took the idea of dressing for the award you want, a popular seasonal trope, and gave it a dose of futuristic cool. Evan Rachel Wood, channeling Marlene Dietrich and David Bowie (and Julie Andrews in “ ”) in an exactingly cut Altuzarra tux with white vest, offered absolute proof of her words that when it comes to awards season, there was no dress required. And Thandie Newton, in    white Monse, flames picked out in paillettes licking up her hem, just hinted at the idea of an avenging angel come to earth. Also on the   list, though in a more classical mode: Emma Stone, in     (pink was a trend) Valentino, metaphor obvious but still undeniably enchanting Brie Larson, in strapless red Rodarte with a draped and beaded bodice, matching lips and Veronica Lake hair Natalie Portman, in ’  chartreuse Prada maternity gown, a little “Jackie,” but not too much and Viola Davis in sunshine yellow   sequined Michael Kors, so bright she gave off her own light. For good or ill, Fashion with a capital F dresses can often look overdone or out of place on what has become a pretty visually safe space, and such was the case with Nicole Kidman’s Scottish shipwreck of a   corseted Alexander McQueen. Ditto Sarah Jessica Parker’s white   Vera Wang, with its echoes of both wedding dresses past and Princess Leia. And ditto Janelle Monáe’s   Armani: short in front, trailing in back, sequined on top. Just when you had taken one detail in: whoa! There was another. The red carpet just doesn’t reward risk. At least the very boring  —   all those sequined columns, yawn  —   doesn’t linger long in the brain.  —   Vanessa Friedman Read a review of the night’s looks and see a red carpet slide show. In “Nocturnal Animals,” Tom Ford’s twisty drama, Aaron   plays a sadistic thug who menaces a family on a deserted highway. Critics singled out the terrifying performance but on the awards circuit so far, the actor had garnered just one award (from the Santa Barbara International Film Festival) before his surprise Golden Globe for best supporting actor. Left   were favorites like Mahershala Ali (“Moonlight”). On the red carpet, Mr.   said he watched movies about Ted Bundy and Jeffrey Dahmer to prepare, while his wife, the director Sam   confessed, “It wasn’t my favorite part. ”  —   Stephanie Goodman  Read a review of “Nocturnal Animals. ” Tracee Ellis Ross’s acceptance speech was an elegant combination of meaningful ideas and gleeful spontaneity. Winning the Globe for best actress in a comedy (“ ”) Ms. Ross said that her award was also for “all of the women, women of color and colorful people whose stories, ideas and thoughts are not always considered worthy and valid and important. ” She said that it’s “an honor” to be on a show that tells stories “outside of where the industry usually looks. ” She also seemed absolutely delighted to have won. Isn’t this what we want from an acceptance speech? A little humor, a bit of thoughtfulness, some seemingly true human emotion.  —   Margaret Lyons Read more about Tracee Ellis Ross’s speech. It’s time to retire “Sofia Vergara is not a native English speaker” as a comic premise. She came out and said “anal” twice and then “anus,” the big joke being that she can’t pronounce “annual. ”  —   Margaret Lyons Steve Carell and Kristen Wiig’s introduction for best animated feature was hilarious. And thank God  —   the otherwise abysmal banter segments were draining every iota of energy out of the ceremony.  —   Margaret Lyons The actors who really stole the show were, for the most part, under the age of 15: the kids from “Stranger Things” and Sunny Pawar, the   Indian actor who played a lost child in “Lion. ” The “Stranger Things” boys  —   Finn Wolfhard, Gaten Matarazzo, Caleb McLaughlin and Noah Schnapp  —   arrived together, charming the red carpet  with their sharp outfits and snappy moves. Caleb later grabbed a selfie with Ryan Gosling during a commercial break. And onstage during the show, when Sunny was hoisted up to the mic by Dev Patel, who plays the older version of their character in the drama “Lion,” the entire ballroom erupted in awws and coos, the sound of hundreds of hearts melting.  —   Cara Buckley Read a review of “Lion” and a review of “Stranger Things. ”'"}, "time": 1742563301.3050275}