{"duration": 0.08244085311889648, "input_args": {"text": "'For the country’s most prominent political spokesman, Sean Spicer is not spending a whole lot of time in front of the camera. Monday was the seventh straight day that Mr. Spicer, President Trump’s press secretary, declined to hold a televised White House press briefing, an unusually long drought for someone whose role is traditionally to be the most visible face of a presidential administration. Instead, Mr. Spicer  —   who since the inauguration had become a highly rated, if   staple of daytime television  —   conducted a    session with no cameras allowed, over the objections of the White House Correspondents’ Association. The briefing was certain to be contentious. For the first time, Mr. Spicer addressed explosive and unproven allegations Mr. Trump made over the weekend that his predecessor, Barack Obama, had wiretapped his phones at Trump Tower during the presidential campaign. The public was not given a way to watch the briefing but was able to listen via an   broadcast by PBS. At one point, when a CNN reporter tried to interject with a question, Mr. Spicer pushed back, saying: “You’re not on camera. You don’t need to jump in. ” (He called on the reporter later.) Past press secretaries said it was unusual that they would stay off television for a full week. And Mr. Spicer’s absence from the airwaves coincides with a rough period: He was criticized by Mr. Trump in a Fox News interview, and his closest ally in the administration, Reince Priebus, the chief of staff, is under fire from rival factions within the White House. On Friday, Mr. Spicer was among the group of Mr. Trump’s senior aides temporarily banished from Air Force One after Mr. Trump erupted at his staff in frustration during an Oval Office meeting. Mr. Trump’s West Wing is awash in palace intrigue, and people in and around the administration noted that two other representatives  —   Mr. Spicer’s deputy, Sarah Huckabee Sanders, and the White House counselor, Kellyanne Conway  —   appeared on morning television shows on Monday to speak on the president’s behalf. The president has also privately expressed frustration with the performance of his press office. Press secretaries do not always perform their duties on TV. Like his predecessors in Democratic and Republican administrations, Mr. Spicer speaks with journalists in more informal,    settings several times a week  —   when the president is traveling, for instance. But these   gaggles are typically interspersed among more formal briefings carried live on cable news. The former press secretaries Ari Fleischer and Mike McCurry have argued that cameras should not be allowed in the briefings at all  —   the thought being that the presence of cameras has helped turn the briefings into spectacles rather than considered discussions of policy. In an email, Mr. Spicer said he had lived up to his pledge to hold briefings with reporters on a   basis, “some on camera, some off. ” He noted that the White House had rolled out its revised executive order on immigration on Monday  —   a nod to a past practice in which the press secretary forwent an   briefing on days featuring a major announcement. Mr. Trump’s secretary of state, secretary of Homeland Security and attorney general held an event with journalists on Monday, but the three officials did not respond to questions. And Mr. Trump signed his executive order without photographers or reporters   to record the event, a break from typical practice. When reporters at Monday’s briefing raised concerns about openness, Mr. Spicer defended his administration. “I’ve heard from several of you that we have gone above and beyond allowing the press into events,” Mr. Spicer said, adding, “I think this president has been extremely transparent. ” Hours after the briefing, Mr. Spicer was approached by reporters on a driveway outside the West Wing, where he acquiesced to answering a few questions  . Mr. Spicer did make one scheduled television appearance in the last week, on “Fox  Friends,” the   morning show, which ran a feature about the press secretary’s life at the White House. When the Fox interviewer, Abby Huntsman, asked Mr. Spicer whom he feared more  —   the president or the news media  —   Mr. Spicer, unsmiling, replied, “I don’t fear anybody. ” He added, “I don’t want to disappoint this president. ”'"}, "time": 1742562960.098891}