{"duration": 0.06497764587402344, "input_args": {"text": "\"Bellwether? Trump kippas outselling Hillary yarmulkes Company sees preference as 'early exit poll of Orthodox Jews' Published: 9 mins ago Print \\nWASHINGTON – The campaigns of Donald Trump and Hillary Clinton are looking for signs anywhere and everywhere that might suggest who will move into the White House in January. \\nA company that makes Trump and Hillary kippas or yarmulkes has some good news for one of the presidential hopefuls – Trump head coverings are winning in a landslide among the Orthodox Jewish clientele. \\nSo far, the company, Pic-A-Kippa, has sold 331 Trump yarmulkes to 65 for Clinton. \\n“My kippa (yarmulke) company sells Trump and Hillary kippas and are keeping track of who is selling more,” Uri Turk, founder and “chief kippa officer,” told WND. “We see it as an early exit poll of the Orthodox Jews, a type of bellwether of where this important community is leaning. Once the first debate came around, the orders started flying in, with much more interest in the Trump kippas.” \\nPic-A-Kippa is the brainstorm of two former elite red beret IDF soldiers from Miami. Turk says the company is the leader in the kippa market and has been selling Trump and Hillary custom kippas on its site since August, all the while keeping a running tally of which one has sold more. \\n“Our mission is to help Jews everywhere show and wear their Jewish pride, with our beautifully unique and completely customizable picture kippas,” the company says on its website. \\nIt donates 10 percent of every kippa sale to the Lone Soldier Center in Israel, assisting young lone soldiers during difficult times. \\nTurk said while American Jews have leaned heavily Democratic for decades, the past few presidential races have seen Orthodox Jews, who make up over 10 percent of American Jewry, vote Republican in ever increasing numbers. He attributes that fact to the Democrats putting “daylight between America and Israel.” \\nA number of influential Jewish pro-Trump organizations have emerged, chief among them “Jews Choose Trump” and “Jewish Democrats For Trump.” A recent poll of Florida Jews showed Orthodox voters are leaning toward Trump by a 3-1 margin. \\nAccording to Turk, Pic-A-Kippa has sold many Trump kippas to a congregant of Ivanka Trump’s synagogue on the liberal Upper East Side of Manhattan and has gotten orders for Trump kippas from Israel, Australia, Britain and even Mexico. Pic-A-Kippa has also gotten hate mail from Jews unhappy they are selling the Trump designs, he says.\""}, "time": 1742563538.9319735}