{"duration": 0.08677077293395996, "input_args": {"text": "'Donald J. Trump will visit Mexico on Wednesday for a private meeting with President Enrique Peña Nieto  —   a trip that will take him to a nation he has repeatedly scorned  —   before quickly flying back for what is billed as a major immigration speech in Arizona. Mr. Peña Nieto’s office said Tuesday night that the meeting would take place at the presidential palace in Mexico City, and Mr. Trump, on Twitter, said he looked “very much forward” to the visit. The Mexican president’s office said Mr. Peña Nieto had sent invitations last week to both Mr. Trump and Hillary Clinton. The negotiations for both trips were first reported by The Washington Post. The Clinton campaign said Mrs. Clinton last met with the Mexican president in 2014 and would talk again with him “at the appropriate time,” without elaborating. Mr. Peña Nieto is reaching out to Mr. Trump in the face of the Republican candidate’s antagonistic attitude toward Mexico in his policies and campaign rallies. He has said many Mexican immigrants who enter the United States illegally are rapists, and he has repeatedly insisted that Mexico will pay for his proposed wall along the southern United States border. He is widely reviled in Mexico, where the wall proposal has revived deep grievances over sovereignty and respect that have historically dogged Mexico’s relationship with the United States. “They are not our friend, believe me,” Mr. Trump said in a speech last year in which he accused Mexico of treating the United States unfairly, “but they are killing us economically. ” “When Mexico sends its people, they’re not sending their best,” he added. “They’re bringing drugs, they’re bringing crime. They’re rapists, and some I assume are good people. ” Politicians in Mexico have largely remained silent on Mr. Trump, though there have been outbursts, including from Mr. Peña Nieto himself. In March, he compared Mr. Trump to Hitler and Mussolini for what he called Mr. Trump’s strident remarks and populism, though he later tried to soften his words without quite taking them back. The trip will take place hours before Mr. Trump is to give a speech in Phoenix that is expected to clarify his stance on immigration, which has plagued his campaign over the past few weeks as he has wavered on key elements of his platform. His campaign has given conflicting signals over whether he will stick to the   positions he took during the Republican primaries, particularly on deportations, and he suggested recently that he was open to “softening” some of his proposals. But his calls to have Mexico pay for the wall have continued. “From the first days of his campaign, Donald Trump has painted Mexicans as ‘rapists’ and criminals and has promised to deport 16 million people, including children and U. S. citizens,” Jennifer Palmieri, the Clinton campaign’s communications director, said in a statement. “What ultimately matters is what Donald Trump says to voters in Arizona, not Mexico, and whether he remains committed to the splitting up of families and deportation of millions. ” The trip is the latest gamble for Mr. Trump and his struggling campaign. But for all the risk it poses, it offers an image Mr. Trump relishes: of a wily negotiator willing to do the unexpected  —   meeting with a perceived enemy  —   to advance his agenda. It will also be his first official meeting with a head of state as the Republican presidential nominee. Despite Mr. Trump’s routine scolding of Mexico and its leadership, several of his closest allies have warm ties with the country and its president. Gov. Chris Christie of New Jersey, a top Trump adviser and confidant, traveled to Mexico in 2014 to meet with Mr. Peña Nieto, arguing that it was imperative for the United States to put Mexico at the center of its foreign relations. During that trip, Mr. Christie offered lavish praise for Mr. Peña Nieto’s   policies and, unlike Mr. Trump, spoke of the need to cultivate stronger ties with Mexico. “Too often, our neighbors in Mexico and Canada have felt that they were an afterthought in U. S. foreign policy,” he said. “My view is that they should be our first thought. ” A person briefed on the trip discussions said that Mr. Christie, who leads Mr. Trump’s transition team, had helped with them. Mexico’s disaffection with Mr. Trump began early in his campaign, when he said, among other things, that the immigrants entering the United States illegally from Mexico were criminals. From that point on, columns, articles and public forums have been filled with   tirades, his words galvanizing Mexicans across the social spectrum. Artisans have fashioned Trump piñatas, and former President Vicente Fox has made it his mission to rebuke Mr. Trump’s every word, to name but two of the rejoinders from Mexican society. Last year, writers, intellectuals and scientists from across the   world wrote a public letter denouncing Mr. Trump and accusing him of xenophobia. Mr. Peña Nieto’s finance minister has said that under no circumstances would Mexico pay for a border wall. Andrew Selee, the executive vice president of the Woodrow Wilson International Center for Scholars and a Mexico expert, said Mexico’s motivation to invite Mr. Trump might simply have been pragmatic. “I think the Mexican government wants channels with whoever is going to be president of the U. S. next, and Trump is a legitimate candidate,” Mr. Selee said. “And from a political perspective, Peña Nieto getting Trump to come to Mexico shows that Trump has been forced to shift some of his rhetoric and take Mexico seriously. ” But considering how often Mr. Trump comes up in conversation in Mexico, and the uniform insult felt by the nation every time he talks about the wall, the government has remained disciplined in their public statements. That is in part a political decision: Officials feel that any responses will do little but provide more publicity for the candidate. For Mr. Peña Nieto, though, the politics could be difficult. His poll numbers are the lowest of any Mexican president in a  .'"}, "time": 1742561777.779828}