{"duration": 0.028431415557861328, "input_args": {"text": "'First-World Problems. Poor Anna Kendrick… \\nIn 2015, Kendrick showed her support for Hillary in such an eloquent way. She tweeted , “Madonna kissed Drake, Hilary’s running for president, but HBO STILL hasn’t shown this dude’s dick (with a picture of an actor) ?? #FeministPriority ” \\nFrom Daly Mail : Her nomination for a Best Supporting Actress Academy Award for 2009’s Up In The Air catapulted her to stardom. But Anna Kendrick revealed on The Ellen DeGeneres Show Wednesday that at the time she was completely broke. \\n‘It was this weird combination of like all these great things are happening but at the same time nothing has changed,’ the actress, 31, said. \\n‘My stylist told me I had to wear the perfect shoes for an outfit, and because the movie isn’t out yet, she said, nobody really knows who you are. The shoe places don’t want to loan you the shoes so can you buy a pair of Louboutins? ‘ Kendrick explained. ‘And I’m like, I’m so poor….’ she said. \\nThe horror didn’t stop there either. \\nShe recalled how she was sent by the film distribution company to New York to promote the film that also starred George Clooney and Vera Farmiga, and they put her up in a very nice hotel. \\n‘At one point I was like, if we do another trip to New York can you put me up in a less nice hotel room and then I could keep some of the cash ,’ she recounted. ‘And they were like, ‘no this is not how this works!” \\nKendrick was on Ellen to promote her new book Scrappy Little Nobody and also to promote her new film Trolls. \\nIn the animated feature, she worked with Justin Timberlake who also provided one of the character voices. The two also sang together including recording a version of True Colors for the soundtrack. \\n‘It was a career highlight for me watching him do his thing,’ she gushed of the former NSync’er. \\nDCG'"}, "time": 1742562922.284565}