{"duration": 0.07913565635681152, "input_args": {"text": "'LOS ANGELES  —   Gov. Jerry Brown on Friday signed legislation that would impose new restrictions on assault weapons and regulate the sale of ammunition in California, cementing the state’s reputation for enacting some of the most stringent gun regulations in the country. Propelled by the reaction to mass shootings in San Bernardino, in Southern California, and Orlando, Fla. the gun regulations are the latest example of how this state, where the Legislature is under Democratic control, has been able to enact a legislative agenda on issues that have deadlocked Congress. The legislation in Sacramento was passed with overwhelming Democratic support, and was largely opposed by Republicans who make up a small minority in the Senate and the Assembly. Even as he signed six measures, Mr. Brown, a moderate Democrat with a history of resistance to some measures of gun control, vetoed five others that he described as overly regulative. Among them was a bill that would have restricted gun purchases to no more than one per person in a   period. “My goal in signing these bills is to enhance public safety by tightening our existing laws in a responsible and focused manner, while protecting the rights of   gun owners,” Mr. Brown, who himself owns guns, said in his signing message. The enactment of the legislation leaves little doubt to the standing of California, which in 1989 became the first state to ban assault weapons, as a leader in gun control at a moment when Congress has rebuffed such efforts and numerous   states are moving in the other direction. States like Texas, in the name of promoting safety, have in recent years expanded the locations where people can carry concealed weapons, including bars and college campuses. “This makes California the most   state in America,” said Amy Hunter, a spokeswoman for the National Rifle Association. In a statement, she called the legislation a “a draconian gun control package that turns California’s   gun owners into   citizens. ” “The governor and Legislature exploited a terrorist attack to push these measures through even though the state’s   laws did nothing to stop the attack in San Bernardino,” she said. Amanda Wilcox, legislative advocate for the Brady Campaign to Prevent Gun Violence, hailed the governor’s action as a step forward in efforts to curb gun violence. She highlighted one bill sponsored by Senator Kevin de León, the Senate’s Democratic leader, requiring background checks for ammunition purchases as particularly crucial. “It is really   and bold, and really has the potential to save a lot of lives,” Ms. Wilcox said. “It can give us a handle on who has illegal guns in the state, as well as limiting access to ammunition by dangerous people who may have illegal guns. ” The new laws would prohibit the possession of   magazines  —   those holding more than 10 rounds of ammunition  —   for assault weapons. “These     magazines are not for target shooting or hunting,” said Senator Loni Hancock, a Democrat who sponsored the bill. “Their sole purpose is to kill as many people as possible in the shortest period of time. ” A separate bill banned semiautomatic weapons with “bullet buttons,” which make it easy to quickly remove a magazine and replace it with another. Among the bills Mr. Brown vetoed was one that would have expanded the definition of a firearm. “While I appreciate the author’s intent, the actual wording of the bill is unduly vague and could have   and unintended consequences,” Mr. Brown wrote in his veto message. Shannon Grove, a Republican Assembly member who spoke out against the bills during the debate, said that none of those signed would reduce gun violence or prevent mass shootings. Instead, she said, the restrictions compromised the rights of California families to protect themselves. “I think it’s death by 1, 000 paper cuts for our Second Amendment rights,” she said. “Nowhere in this nation do you give up your rights under any other amendments. ” The signing was not the end of gun control measures that might be enacted here in the wake of a wave of violence that has traumatized the world and the nation, including the shooting  in San Bernardino that killed 14 people at a holiday party in December. A separate set of gun control measures will appear before voters in November some of them have been passed by the Legislature, but Mr. Brown vetoed those, saying they should be left to voters to decide. That initiative is being championed by Lt. Gov. Gavin Newsom, a Democrat who is running for governor after Mr. Brown’s final term ends in 2018. His initiative would, among other things, make firearm theft a felony and require ammunition vendors to report lost or stolen supplies within 48 hours. “Today’s steps in the right direction will grow into a giant leap forward for public safety if voters pass the Safety for All initiative to keep guns and ammo out of the wrong hands,” Mr. Newsom said. Gun death rates fell 56 percent in California from 1993 and 2010, a larger decline than in the nation as a whole, according to a study by the Law Center to Prevent Gun Violence. Gun control advocates pointed to that as evidence that such laws were effective. “Gun laws work,” Ms. Wilcox said. “California gun sales are really high. We are not deterring   people from buying guns. We’re doing a better job of making sure dangerous people don’t have guns. ” But Ms. Grove pointed to the ammunition law as an example of a measure that would hurt the interests of gun owners without doing anything to curb gun violence. “Criminals who are not authorized to have firearms in the first place are not going to register to buy ammunition,” she said. “It’s absurd. ”'"}, "time": 1742561883.0909925}