{"duration": 0.03170633316040039, "input_args": {"text": "'Email \\nThis month, the Pentagon admitted it has used uranium weapons in attacks inside Syria — violating its public promise last year that it would not use DU there, and contradicting the claim that US bombing is done in defense of the Syrian people, according to the Int’l Campaign to Ban Uranium Weapons . \\nLike the Pentagon’s past denials of the dangers of the chemical weapon Agent Orange, US military officials still claim publicly that its uranium weapons are not known to cause health problems. Made from waste uranium-238 — left from H-bomb and reactor fuel production — it is called “depleted” uranium (DU) but is only “depleted” of U-235. Ironically, the best evidence that it is dangerously toxic and radioactive — contrary to press pronouncements — comes from the Pentagon itself. A June 1995 report to Congress by the Army’s Environmental Policy Institute (AEPI) concluded: “Depleted uranium is a radioactive waste and, as such, should be deposited in a licensed repository.” \\nMilitary studies done in 1979, ‘90, ‘93, ‘95 and ‘97, make clear that uranium weapons are chemically toxic, alpha-radiation-emitting poisons that are a danger to target populations and to invading/occupying US forces alike. In spite of this cautionary written record, the military has been shooting its radioactive waste all over the world: into population centers in Iraq in 1991 (380 tons), in Afghanistan in 2001 (amounts unknown); in Bosnia in 1994-‘95 (five tons); in Kosovo in 1999 (10 tons), in Iraq again in 2003 (170 tons); and now in Syria. \\nThe AEPI report above also says that DU has the potential to generate “significant medical consequences” if it enters the body. The Army’s Office of the Surgeon General, in its Aug. 16, 1993 “Depleted Uranium Safety Training Manual,” says that the expected effects of DU exposure include a possible increase of cancer, and kidney damage. The manual also warns, “When soldiers inhale or ingest DU dust, they incur a potential increase in cancer risk … (lung or bone) and kidney damage.” \\nThe Army’s Mobility Equipment, Research & Development Command reported way back in 1979 that, “Not only the people in the immediate vicinity but also people at distances downwind from the fire are faced with potential over exposure to air-borne uranium dust.” This uranium “dust” is generated when DU shells hit and burn through hard targets like tanks or armored vehicles. The uranium is spread for miles by the wind, contaminating everything is its path including food, water, soil, schools, hospitals, etc., and DU is radioactive forever, or ten times 4.5 billion years, whichever comes first. \\nIn 1990, the Army’s Armaments, Munitions and Chemical Command radiological task group said that DU is a “low level alpha radiation emitter … linked to cancer when exposures are internal, [and] chemical toxicity causing kidney damage.” It added that “there is no dose so low that the probability of effect is zero.” \\nWith evidence of its radio-toxicity so clear and redundant, any use of uranium weapons today appears to flaunt the military’s own Field Manual prohibition — absolute and universal — against the use of poison or poisoned weapons. \\nHistorical Disregard Revisited \\nThe military has a long history of deliberately exposing US citizens and others to deadly risks without their knowledge or consent, beginning with the open-air nuclear bomb tests it knew would contaminate vast areas. The Atomic Energy Commission (AEC) chose not to evacuate or even warn downwind populations it knew would be hard-hit by radioactive fallout. (“Fallout risk near atom tests was known, documents show,” New York Times, March 15, 1995) These bomb tests exposed Nevada Test Site workers to levels of radiation that the AEC knew could cause harm, but the agency chose not to reduce workers’ exposures or to even inform them of the risks because doing so would have scandalized and halted the bombing tests. (“Records say workers faced high radiation: Suit contends US used no safeguards,” St. Paul Pioneer Press, Dec. 14, 1989) \\nLikewise, the government refused to inform some 600,000 H-bomb factory workers that workplace radiation exposures posed serious health risks, although enough was known about radiation to warn them in 1948. (“N-plant workers not told of risks: Report says US arms program exposed many to radiation,” Associated Press, Dec. 19, 1989) Between 1944 and 1974, “medicalized” human radiation experiments were even conducted on unwitting US citizens, 16,000 of them (The Plutonium Files, by Eileen Welsome). \\nToday, the Pentagon extends this ghastly history into Syria where it is deliberately exposing human beings to weaponized radiation that it knows can cause cancer and other diseases. As if the undeclared, unconstitutional war in Syria weren’t unlawful enough, now add the crime of using poison in violation of military law and the Hague Regulations of War on Land. \\nIt is so easy to prove that DU is poison, that a group of four non-lawyers, myself included, convinced a Minneapolis jury in 2004 that AlliantTechsystems’ manufacture of the shells is unlawful enough to excuse an otherwise illegal trespass; our minor offense was justified in order to prevent the greater harm of DU weapons production. Like torture, the use of such poison in war is always criminal, akin to gas war. This latest US government war crime must be condemned in the harshest terms. \\nFor more information on DU weapons and the global effort to have them banned, see ICBUW.org.'"}, "time": 1742628586.8578105}