{"duration": 0.07249116897583008, "input_args": {"text": "'Talk show host Chelsea Handler tweeted a joke mocking President Donald Trump’s unborn grandchild Monday afternoon, but appeared to misspell the word “genes,” leading Trump’s sons to reply with the correct spelling. [“I guess one of @realDonaldTrump’s sons is expecting a new baby,” Handler tweeted. “Just what we need. Another person with those jeans. Let’s hope for a girl. ”  I guess one of @realDonaldTrump’s sons is expecting a new baby. Just what we need. Another person with those jeans. Let’s hope for a girl.  —   Chelsea Handler (@chelseahandler) March 20, 2017,  Handler had apparently attempted to use the word “genes. ” Donald Trump Jr. replied to Handler’s post to correct the mistake, writing: “Jeans? ?? I guess I’m not at all surprised  …     but really? !?! #genes” Jeans? ?? I guess I’m not at all surprised  …     but really? !?! #genes https:  .   —   Donald Trump Jr. (@DonaldJTrumpJr) March 20, 2017,  A short time later, Eric Trump  —   who announced earlier Monday that he and wife Lara are expecting a boy in September  —   also replied to correct the tweet and remind Handler he is expecting a son. Somewhat ironically, Handler mocked Melania Trump’s English skills in a recent interview at Sundance, during which she said she would never interview the First Lady on her Netflix talk show. “No. Melania? To talk about what? She can barely speak English,” she told Variety in January. The First Lady, who was born in Slovenia, reportedly speaks five languages. Handler apologized for the spelling error in a   tweet Monday evening, saying she was a “little stoned. ” Sorry about spelling mistake. I meant ”genes,” not ”jeans.” I’m a little stoned. What’s your excuse?  —   Chelsea Handler (@chelseahandler) March 20, 2017,  The    Chelsea star  —   who supported Hillary Clinton in the 2016 presidential race  —   has been a vocal critic of Trump since well before the November election. In April, the comedian posed   with the phrase, “Trump is a butt hole” scrawled across her back. “It’s always a good thing to be able to look at somebody and be like, ‘That’s the worst thing that could happen,’” she told Variety in September. “And I think we should keep him in the spotlight. Not as president, obviously, but, you know, as The Apprentice or whatever that show is called. ” In January, Handler led the Women’s March on Main in Park City, Utah, a sister march of the larger   Women’s March on Washington that occurred simultaneously in the nation’s capital. “Women are under a   political assault, and I intend to fight back with all my might against a Republican president, a Republican Congress, and the radical, religious right who are drooling to defund Planned Parenthood health services nationwide,” she wrote in a guest column for the Hollywood Reporter at the time.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742561719.128235}