{"duration": 0.02329540252685547, "input_args": {"text": "'Chancellor Angela Merkel is setting aside €90m (£76m) in taxpayers’ money to create a fund which will pay migrants to withdraw their asylum applications and leave Germany voluntarily. [The handouts will form part of a   plan to speed up the removal of rejected asylum seekers, after Tunisian migrant Anis Amri murdered a Polish lorry driver, hijacked his vehicle and drove it into a Christmas market in Berlin while awaiting deportation.  U. S. president Donald Trump told The Times that Merkel made a “catastrophic mistake” when she opened the doors to an unlimited number of migrants in 2015. Her   Sigmar Gabriel, later admitted that his superior had underestimated how difficult it would be to integrate migrants on such a grand scale, and that Germany had been plunged into a kulturkampf, or “cultural war” as a result. Germany rejected 170, 000 asylum claims in 2016 but, according to the Mail, just 26, 000 were repatriated. 55, 000 more decided to leave voluntarily  —   apparently leaving 81, 000 bogus applicants unaccounted for. “We rely heavily on voluntary departures,” admitted Chancellor Merkel, who was announcing the package after falling behind the Social Democrats in polls for Germany’s upcoming elections. Martin Schulz, the former President of the European Parliament who has been nominated as the Social Democrat challenger to Merkel, said he backed the proposals to speed up deportations. Schulz has previously insisted that “the people who are arriving [in Europe] are refugees who have been threatened [and] we should welcome them”  —   a statement which is at odds with the   of the European Commission’s admission that at least 60 per cent are economic migrants. As a leading figure in the European Union, Schulz was a strong supporter of the compulsory migrant quotas. These were forced through by the bloc despite strong opposition from central and eastern European   which did not agree with Germany’s unilateral decision to throw open the borders. Schulz hit out strongly at these countries in 2015, accusing them of “national egotism in its purest form”. Polish interior minister Mariusz Blaszczak described at Schulz’s words as “an example of German arrogance”.'"}, "time": 1742628351.879841}