{"duration": 0.12620115280151367, "input_args": {"text": "'La crisis de Twitter: nada es para siempre No es un hecho que Twitter quiebre y desaparezca, pero sí es algo que podría suceder: un recordatorio para todos de que no es bueno establecer su estrategia de comunicación únicamente en las redes sociales. Así como las computadoras se hacen obsoletas más rápido que antes, las aplicaciones (apps) y las redes sociales también tendrán una existencia más efímera, incluido Facebook que hasta el momento parece invencible, como en su momento lo parecían IBM y también Microsoft.\\nSocios | 7 de noviembre de 2016 Gonzalo Monterrosa\\nTodo lo que sube tiene que bajar. Al principio nadie entendía Twitter. Al poco tiempo parecía indispensable; pero la lección es que nada es realmente indispensable, así que podría seguir el mismo camino que su app de videos cortos, Vine.\\nHace un par de semanas Twitter se cimbró con la caída de sus acciones, derivada de que se hizo público (seguramente con esa intención) que existía un desinterés generalizado de grandes empresas por la red social de los 140 caracteres.\\nRecién se anunció que eliminarían Vine, su plataforma de videos cortos que hace 4 años anunciaba con bombo y platillo y que logró llamar la atención de millones de personas. “Un paso en la dirección correcta”, decían todos.\\nAhora se encuentra en una franca reestructuración con despidos que afectarán aproximadamente al 9 por ciento de sus trabajadores, el tipo de problemas de cualquier empresa que está perdiendo su capital y el ingreso de ganancias no es claro. La publicidad avanza lenta y no es fácil para los pequeños negocios utilizarla, a diferencia de Twitter que además de llevarte de la mano insiste sobre los posibles beneficios a sus usuarios.\\nLa red social cuenta con millones de usuarios registrados pero no todos se encuentran activos, no los que necesita Twitter para seguir brillando. Nos encontramos en un momento histórico en el que podría quebrar uno de los productos insignia que representaron por mucho tiempo el concepto de red social.\\nLa app de video Vine se enfrentó a Snapchat y a Instagram y no ha podido competir con ellos a pesar de haber recibido mucho apoyo. Facebook ha ingresado a cada nuevo nicho que aparece en redes sociales, adquiriendo empresas o clonando conceptos que ofrece con algunas variaciones a sus miles de millones de usuarios.\\nSnapchat es una app para compartir fotografías y videos que se autodestruyen; comparte la misma circunstancia que vivió Twitter cuando surgió: nadie entendía para qué servía, aun así, Snapchat se está convirtiendo en el enemigo a vencer.\\nVine no terminaba de posicionarse cuando Twitter comenzó a promocionar Periscope, que representa la posibilidad de la transmisión de video en vivo y que se hizo famoso por que los usuarios transmitían eventos deportivos de pago por evento desde países donde ese mismo evento aparecía en televisión abierta sin costo alguno. Vine estaba limitado a grabar unos cuantos segundos. Se percibió que lo habían abandonado a pesar de que para muchos fomentaba una creatividad visual para narrar historias en seis segundos (que después se incrementaron), al igual que Twitter lo hace al limitar lo que escribimos, lo que presenta un reto muy a pesar de sus detractores generacionales.\\nFue en 2015 cuando la app poco a poco dejó de ser popular, desapareció de los listados de las 100 más descargadas tanto en la plataforma de Apple como en la de Android. Se acusa también a quienes generaban contenido de ser repetitivos y copiar las mismas historias, la gente se aburre. Quizá un aviso para los sitios que clonan notas todo el tiempo y generan la sensación de que todos los medios y los agregadores de noticias traen la misma información. Un aburrimiento que provoca que se busque otras fuentes, otros contenidos. Y con ellos se llevarán a los pocos anunciantes.\\nY son los anunciantes un factor para la migración de los denominados influencers de Vine, que poco a poco se fueron a Instagram o Youtube, porque además de más herramientas que les facilitaban el trabajo, existían mejores posibilidades de monetizar su trabajo. Como ya se mencionó, Twitter no tiene una buena estrategia para monetizarse. Vine no es diferente, no cuenta con un sistema de monetización sencillo como sí lo tienen Instagram y Youtube.\\nDentro de la debacle que sufre Twitter, aparece la noticia de que el sitio de pornografía Pornhub ofrece comprar la app como una propuesta que permitiría a Twitter obtener dinero que ya considera perdido. No se sabe qué tan serio sea el ofrecimiento pero sí genera dudas sobre el contenido final y sobre todo el contenido existente: se mezclará con pornografía o qué contenido planean subir. Lo más extraño será que las personas que subieron videos a la app, ahora pertenecerán y serán relacionados a una empresa de pornografía.\\nGonzalo Monterrosa\\n[BLOQUE: OPINIÓN][SECCIÓN: SOCIEDAD BETA]\\nContralínea 513 /del 07 al 12 de Noviembre 2016'"}, "time": 1742562462.1184475}