{"duration": 0.1412215232849121, "input_args": {"text": "'Imagine if the former Mafia boss John Gotti, who went to prison for murder and cultivated the public’s fascination with his flamboyant New York lifestyle and menacing charm, had a YouTube channel. Imagine if he used that channel to become a video star by portraying himself as a penitent hit man and regaling viewers with tales of violence while seeking forgiveness for homicides past. For Colombians, the   equivalent of such an unlikely YouTube sensation can be found in John Jairo Velásquez. He is a former enforcer for the Medellín drug cartel who has boasted of committing hundreds of murders on behalf of his boss, Pablo Escobar. Mr. Velásquez spent more than 20 years in prison for plotting the killing of a Colombian presidential candidate in 1989 and goes by the nickname Popeye. Now, Mr. Velásquez, 54, is trying to rebrand himself as a sort of   evangelist in a series of   videos he began posting on YouTube last year.  The underlying message (there were 81 videos as of Sunday) is one of forgiveness. Now, he is known as Popeye Arrepentido, or Remorseful Popeye. “It’s not about monetizing my life story but about telling the stories, the things that happened,” he said in an interview on Sunday. “I’ve been famous for 30 years. I only want to have an opinion because I am an activist. I am against the Venezuelan and Colombian government. I am against Donald Trump because of his hatred of Latinos. I just want my opinion heard. ” His audience cannot seem to stop watching. The videos have gained more than 117, 000 subscribers and 9. 5 million views. The comments are filled with praise and admiration. One person signed off with “Hugs. ” But not all people are enthralled by Mr. Velásquez’s budding stardom  —   least of all the victims touched by the cartel’s acts of mayhem. The son of one victim  —   a man who was among 107 people killed by a bomb planted by the cartel on a plane that exploded over Bogotá, Colombia, in 1989  —   said Mr. Velásquez’s popularity overshadowed the harm he had unleashed, The Guardian reported. The son, Gonzálo Rojas, said that the former hit man had shown no real remorse and that he was trafficking in a perverse sort of celebrity because of his crimes. Most hit men do not turn up on YouTube seeking a second act by spilling secrets about past misdeeds. (Mr. Gotti died in 2002 while serving a life sentence.) But one expert described Mr. Velásquez as “an astute  ” who had capitalized on his infamy by claiming to have been reformed while glorifying  . Mr. Velásquez, however, said he felt reborn after being released  on parole in 2014, according to a description of his YouTube account. “I created this channel with the intention to be able to talk day to day about my process reintegrating into society as well as my process with true remorse,” he wrote. “Being an assassin is not normal,” he said in the interview. Now, he said, he “respects life and society. ” “I was resocialized: When I changed my way of thinking, I changed my way of being,” he added. In one video, he seeks forgiveness from a relative of one of his victims. When a viewer asked, “When can the victims of the drug war of the Medellín cartel meet you  —   the ones who lost brothers or fathers in the police force?” Mr. Velásquez said he found the question painful. But he asserted: “It was the war that killed your brother, but I am not going to justify that. I am going to assume responsibility because your brother was defending a country, an institution, and we were murderers paid by the cartels. ” If Mr. Velásquez, who uploads videos out of his apartment in Medellín, is troubled that his stated contriteness is at odds with the opening graphics of gunfire and bullet holes in his videos, he is not showing it. And he revels in the limelight. Some viewers have responded by welcoming him back to society. “Hello, Popeye,” one wrote. “I love all of your statements because they are full of honesty and courage. Hugs. ” Others celebrate his flair and ability to talk directly to the people: “You have the personality to be able to tell the truth to the Colombian society. ” Vincent T. Gawronski, a professor of political science at   College in Birmingham, Ala. said in an email: “In a twisted way, we celebrate ‘successful’ criminals, even   killers in Hollywood movies, cable television shows and soap operas: ‘Scarface,’ ‘Blow,’ ‘Breaking Bad,’ ‘The Sopranos,’ Netflix’s ‘Narcos. ’” Dr. Gawronski noted that nearly a dozen “narconovelas” had aired on   television and that there were many “narcocorridos,” or ballads, celebrating drug traffickers. “We mythologize those that challenge authority and do whatever they want and get away with it,” he said. He added: “Of course, Velásquez’s fame is directly tied to his relationship with Pablo Escobar. The stories he can tell will keep him popular, but they might also get him killed. ” In an interview published in The Telegraph in 2014, Mr. Velásquez, who said he had a wife and son living in the United States, declared that he could take care of himself if anyone came after him. In a video, Mr. Velásquez recalled where he was in 1993 when the authorities killed Mr. Escobar, the ruthless cocaine trafficker who ran the Medellín cartel. When one viewer wanted to know what Mr. Escobar had written in his notepads, Mr. Velásquez said: “Those notepads were simply to write the names of the people who he wanted to kill. If he wrote your name in those notepads, you were a dead man. ” If the mobsters from Mr. Gotti’s day had a strict code of silence about criminal activity, Mr. Velásquez seems unconcerned about revealing the inner workings of the cartel. In a video posted in October, he said he would always be an assassin. He boasted about his reputation on the streets, calling himself the living memory of the cartel. He said he would never speak ill of Mr. Escobar. “For me, Escobar was a terrorist, a drug dealer, a kidnapper  —   but he was also my friend he treated me with kindness and respect,” he said. “He was the kind of man that would look you in the eyes and do what he says. Everyone knows what he was, but with me he was good. ” “I loved Pablo,” he said. “He never owed me money for any of my hits. ”'"}, "time": 1742564260.3076785}