{"duration": 0.11123180389404297, "input_args": {"text": "'Home / Be The Change / Government Corruption / Senator NUKES Clinton Foundation, Calls it “Largest Money Laundering…Operation in the World” Senator NUKES Clinton Foundation, Calls it “Largest Money Laundering…Operation in the World” Jack Burns November 2, 2016 3 Comments \\nSenator Tom Cotton (R-AR) lambasted the Clintons and their foundation, equating the former first family to corrupt money launderers. Cotton, a Harvard Law School graduate, and former paratrooper with the 101 st Airborne division of the U.S. Army knows a thing or two about the law regarding classified information and corruption. And, he has some harsh criticism for both the Clinton Foundation and the former secretary of state herself, Hillary Clinton. \\nCotton was a guest on Hugh Hewitt’s radio show, The Hugh Hewitt Show Tuesday. The talk show host asked Cotton about FBI Director James Comey’s re-opening of the investigation into Clinton’s email scandal after potential classified information was found on a computer belonging to Anthony Weiner. Weiner, estranged husband of Huma Abedin, was being investigated for sexting a 15-year-old North Carolina girl when the discovery was made. In all, a reported 650,000 emails were found supposedly belonging to Abedin and may have contained classified emails sent and received by former secretary of state Clinton. \\nCotton said, “650,000 emails is a lot of emails. But then again, when you use modern searching techniques, you might be able to winnow it pretty quickly.” But he’s cautiously optimistic that the FBI can do the winnowing down quite quickly saying, “You would think that even if it’s in the thousands, or tens of thousands, the FBI has enough agents that they could review them pretty quickly. A lot of these agents are pretty familiar with the subject material, having investigated the Clinton email server to begin with. Some of them, apparently, have been investigating the Clinton Foundation now for months.” \\nThe senator from Arkansas stressed the seriousness of the discovery by saying, “what Director Comey has said he found in the emails from Hillary Clinton’s server and devices, which is that she was extremely careless with the handling of classified information, now so much so that classified information of the United States government may be found on the computer of a man under investigation for underage sex abuse.” \\nAs The Free Thought Project reported, speculation exists as to whether or not the discovery was an intentional attempt by Weiner to cut a deal with federal prosecutors to avoid a longer prison sentence if he’s convicted of felonious sexting a minor. \\nCotton scoffed at the Democrats’ blaming Comey for re-opening the investigation. He pointed the finger squarely at Clinton saying, “Hillary Clinton only has one person to blame for all of this. She is the one that set up that private server. She is the one that used it for classified information. She’s the one that violated U.S. government security in handling materials. She’s the one that always thinks she can get away with it. This is not an FBI or a Director Comey problem. This is a Hillary Clinton problem, and this is why so many Americans view her as untrustworthy and dishonest.” \\nLater in the interview with Hewitt, Cotton turned his attention to the Clinton Foundation and called it a massive money laundering front. He said, “We now know there were no fewer than four FBI investigations into the Clintons and their close associates — the Foundation, the emails, Abedin and Weiner and Terry McAuliffe, the governor of Virginia.” \\nGoing further he stated, “And I suspect that that was a very high-ranking Department of Justice political appointee who was carrying water for the Clinton machine and wanted to shut down an investigation into the Clinton Foundation, which increasingly looks like one of the largest money laundering and influence peddling operations in the world.” \\n“This is why if Hillary Clinton wins this election and they don’t shut down the Clinton Foundation and come clean with all of its past activities, then there’s no telling the kind of corruption that you might see out of the Clinton White House,” the outspoken senator from Arkansas declared. \\nEven if classified information is found on Weiner’s computer, the case against Clinton is likely dead in its tracks and is just a ploy to win back the trust of the American people toward the FBI. As The Free Thought Project reported Tuesday, The Justice Department’s Assistant Attorney General Peter Kadzik is believed to be John Podesta’s best friend. \\nPodesta is, of course, Clinton’s campaign manager. So, it’s highly unlikely Clinton will ever be indicted. But thanks to Wikileaks, Podesta may now also become the target of an investigation after it was revealed this week that he ordered Clinton’s emails be “dump(ed)” as soon as the news broke she was using an unauthorized private email server based out of her home. Dumping emails, while a subpoena for those emails was being issued, could result in obstruction of justice charges against Podesta. But wait, that’s right — his best friend would have to be the one to bring charges against him. \\nSo what you apparently have is a corrupt campaign manager, a corrupt candidate, a corrupt investigator, a corrupt FBI (who refuses to prosecute the former first lady for mishandling classified information), a corrupt Justice Department, and a corrupt president, whose cabinet and staffers reportedly “ALL” use private email to conduct official business and skirt around the Federal Records Act. No wonder this country is facing such massive problems; broken educational system, unjust wars, massive deficits, out of control spending, and police brutality, to name a few. Its leaders are gangsters. Share'"}, "time": 1742562301.0055676}