{"duration": 0.16665959358215332, "input_args": {"text": "'Writing in an encrypted chat room, Islamic State sympathizers and militants celebrated the   anniversary of the terrorist organization’s capture of Mosul, Iraq’s   city. [Despite losing most of Mosul to the U. S.  international coalition, the IS supporters vowed that they would return and take control over the entire city once more.  IS completed its takeover of Mosul from Iraqi forces on June 10, 2014. Over the last eight months, the group has been fighting a difficult battle against Iraqi forces supported by an international coalition led by the United States and has lost control of most of the city except for a few pockets of resistance. Nonetheless, the IS members in the chat room marked the   anniversary, with Abi Aisha Almosulawi writing, “Thank Allah who blessed us with the blessing of Islam. Thank Allah who granted us the Islamic State that rules through Allah’s sharia. The campaign of conquests began here in Mosul and now we’re dealing with a brutal crusader Shi’ite war, but we have not surrendered and will not surrender. We will continue to harm the infidels and continue to disturb their peace even if we lose Mosul three years after liberating it. This isn’t over. We will continue to trust in Allah and the victory he is expected to grant us one day. ” Abi Huzaifa Almosolawi wrote, “Today marks three years since the capture of Mosul and its liberation from the hands of the blasphemous Shi’ites. This glorious conquest that Allah gave his warriors and gave them the opportunity to implement sharia was the beginning of the fulfillment of Allah’s promise to the loyal mujahedeen.    “We may lose the land but we will never lose the desire to enforce holy sharia on every meter in our control. We will return to Mosul again as liberators and we will liberate Baghdad, Syria, Egypt, Palestine and all the land to impose holy sharia. Even Rome will be liberated and when we enter it we will yell Allah is great, with the help of Allah. ” Abi Talha Almagrebi (the Moroccan) wrote, “From the pulpit of the mosque in Mosul, the Caliph Abu Bakr (Al Baghdadi) came out and declared the Caliphate. From here, the land of Mosul. From Mosul, we went forth to liberate Fallujah, Al Anbar and other places. Today we come back to the desert but we do so while clinging to the divine promise. We cling to holy sharia and we won’t compromise with the infidels. The right and justice lies with us. We will come back here as liberators. When we return as liberators, with the help of Allah, we will remember our mujahedeen brothers Abi Ali Alanbari (a senior military commander in IS who was killed) and the Sheikh Abo Mohamad Aladnani (an IS spokesperson who was killed). ” The U.  offensive in Mosul began about eight months ago, with the terrorist group losing most of the city to Iraqi forces except for an area at the western section of the Tigris river. On Saturday, U. S.  Iraqi forces repelled an IS offensive in the Sunni town of Shirqat, just south of Mosul.'"}, "time": 1742561729.201243}