{"duration": 0.04759669303894043, "input_args": {"text": "'As a Republican,   administration prepares to take office in Washington, D. C. this week, abortion provider Planned Parenthood has released an animated video of its own   history narrated by celebrities including Lena Dunham, Meryl Streep and Mindy Kaling. [Dunham, the creator and star of HBO’s Girls and a   activist, shared the Planned Parenthood anniversary video on her Twitter account Tuesday morning.  “This is the story of the incredible women who sacrificed everything to bring us safe and affordable reproductive health care,” the video’s opening title card reads. I made this video   @mindykaling, @amyschumer, @TessaThompson_x, Meryl Streep  more because we show up for @PPFA: https:  .   —   Lena Dunham (@lenadunham) January 17, 2017,  The video guides viewers through the early days of the organization and details the life of its founder, Margaret Sanger. “Margaret knew how to work the press,” narrates Mindy Kaling, the star of Hulu’s The Mindy Project. “When she chose jail time over fines for running a birth control clinic, her case became a national sensation. ” After reeling off a few statistics about Planned Parenthood today, Dunham recalled that Sanger had “aligned herself with eugenicists. ” “It doesn’t seem to make sense,” Dunham says. “But way back in the early 20th century, eugenics was an immensely popular social movement, one with the kind of widespread legitimacy Margaret craved for her own birth control campaign. ” “Let’s make something clear,” Dunham adds. “Racism and ableism do not have a place at Planned Parenthood, and sure as hell don’t represent the organization’s commitment to equality. While there’s no question that Margaret left behind a conflicting legacy, it’s also true that she was a champion of progress. ” The video discusses the invention of the birth control pill and the significance of 1973’s Roe v. Wade Supreme Court decision, before ending with a pledge to continue providing abortion care to women across the United States. “In our first 100 years, Planned Parenthood helped establish what reproductive rights are and why they’re so critically important,” the video concludes. “In the next 100, we will keep fighting until we make sure they’re available to everyone. ” Other celebrities lending their talent to the clip include Amy Schumer, Tessa Thompson, America Ferrera, Jennifer Lawrence, Gina Rodriguez and Constance Wu. J. J. Abrams is listed as an executive producer, while Dunham’s boyfriend, guitarist Jack Antonoff, provided the music. Watch the clip above.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563957.421252}