{"duration": 0.048288583755493164, "input_args": {"text": "'The Face to Face blog has some good advice for yall muffugguhs: \\nIn order to push back against attempts at demoralization, particularly from the media, and to rally people heading down the home stretch, it’s time to start wearing Trump markers in public every day until the election is over. \\nThat will manifest our greater enthusiasm in an everyday setting, not just what people see from rallies on TV or comments on the internet. It puts a human face on the movement, which does not come across so much from a yard sign (although put up one of those too). \\nIt is also more likely to have a contagious effect at the grassroots. Even if onlookers don’t wear Trump gear of their own, at least they’ll be more likely to talk positively about voting to others, assuming they were roughly on our side. \\nThe goal is not to appear confrontational, as though we were about to man the barricades (that would come only if the Establishment tries to steal the election). Everyday people around you are not the immediate enemy. Those who are uncertain about turning out, or are genuinely undecided, are on the wimpy and cucky side — they just want to be reassured that Trump voters are normal people. \\nI guarantee that no one from the enemy’s side will try to shame or ostracize you in public, in order to send a message to undecided onlookers. Only paid activists bother attempting this, and they only concentrate at Trump rallies or on the internet. Even the strongly committed Hillary voters are too demoralized to confront a stranger. The only responses you will get will be from fellow travelers, especially ones who were uncertain whether they were the only one leaning toward Trump, and are relieved to see someone being the first to break the silence in public. \\nTrump has been taking so much public abuse, slander, and libel on our behalf — the least we can do is put ourselves out there, too, whether we get a few sideways glances or not. \\nAt this stage, giving our public support matters more than giving financial support. The polls are not so tight because of insufficient advertising. It’s because a handful of people are still uneasy about either turning out, or choosing Trump if they do. Making those people feel more comfortable by seeing real-life support for Trump in public will go farther than hearing an ad on the drive to work. \\nAnd some of them truly have no preference other than joining the in-group. With no visible signs of support from Hillary voters, that only leaves the Trump side for the conformists to join. Who would want to join a group that is weakly held together, when there’s a more emotionally connected group as the alternative? \\nYou don’t have to go all-out all day long, but at least wear a hat or shirt out for an hour or so in normal public places. High-traffic retail spaces are best, like a supermarket. \\nIt’s simple to find places selling Trump hats if you don’t already have one. \\nThere’s no excuse to stay sitting on the sidelines with less than two weeks to go. We need to make our presence known — not just as a warning to the enemy, but more importantly to motivate anyone who doesn’t like Crooked Hillary to show up and vote Trump with the rest of the crowd. \\nThis election is now 100% about demoralization – on both sides. \\nWe have to keep our morale up, so that our people will go out and vote on the 8th. Huge portions of Hillary’s people aren’t going to bother, especially with new scandals dropping every minute.'"}, "time": 1742628469.54087}