{"duration": 0.08656740188598633, "input_args": {"text": "'At 2:30 p. m. on Thursday, Representative Maxine Waters was on the floor of the House of Representatives, arguing for the importance of the Securities and Exchange Commission. “At this time,” Ms. Waters, Democrat of California, said, “with a bill that would basically take our cop on the block, the S. E. C. and literally obliterate  —   —  ” Alas, politics junkies, news editors and anyone else who was watching the broadcast online did not learn how that sentence ended. Ms. Waters was cut off. Instead, they heard the jangling music of a feed from RT, a   Russian television network that has been accused of helping its government interfere in the American election. Some on social media immediately assumed that the interruption, which lasted about 10 minutes, had nefarious implications.    in a statement, had a simpler explanation: It was probably a technical error.  ’s television broadcast continued uninterrupted. Noting that RT is among the news feeds it regularly monitors, it said: “We don’t believe we were hacked. Instead, our initial investigation suggests that this was caused by an internal routing error. We take our network security very seriously and will continue with a deeper investigation, which may take some time. ” RT America, which is broadcast by cable companies within the United States, did not respond to an email requesting comment on Thursday afternoon. A recent declassified intelligence report accused Russia of interfering in the election and said that RT “aimed at undermining viewers’ trust of U. S. democratic procedures. ”    —   a private company that, according to its website, is available in 100 million American homes  —   receives no government money but broadcasts all live congressional proceedings, providing a direct feed of the daily stuff of politics to Americans who find themselves interested in what their representatives are doing. Howard Mortman, a network spokesman, said he could not provide numbers for  ’s online viewership at the time of the interruption.  ’s newsroom monitors many other channels for breaking news, including domestic networks like CBS and CNN as well as various international networks. Its statement suggested that a routing error had caused the RT feed it regularly monitors to be broadcast accidentally. Mr. Mortman said the network’s early explanation for the interruption came from an internal analysis. He said that he was not aware of any previous such interruption. Timothy Burke, the video director at Deadspin, who regularly monitors 20 to 30 online news feeds from his home in Tampa, Fla. was among the first to comment on Twitter about the sudden interruption. He said he had assumed “somebody just flipped a wrong switch somewhere. ” Had Mr. Burke and others who were watching   online at the time not been interrupted, they would have heard Ms. Waters mention Russia and   Donald J. Trump several times before she ended her turn on the floor. In a phone interview Thursday, she was perplexed. She said no one had satisfactorily explained “how this happened or why it happened, or if it’s happened before. ” “I just think it’s strange,” Ms. Waters said. “At a time when our intelligence agencies are very confident and basically have confirmed that Russia hacked the D. N. C. and other political interests, and then we have, while I’m on the floor of the House, talking about Trump and Russia, I get interfered with and interrupted by Russia Today. ” “It’s strange. It’s odd,” she said.'"}, "time": 1742563595.1190987}