{"duration": 0.1381065845489502, "input_args": {"text": "'MEXICO CITY  —   If President Enrique Peña Nieto invited Donald J. Trump to visit Mexico for a dialogue in the interest of democracy, the message has fallen on deaf ears. Instead, the predominant feeling here in the Mexican capital is one of betrayal. “It’s a historic error,” said Enrique Krauze, a   historian. “You confront tyrants. You don’t appease them. ” On Mexico’s most popular morning television show on Wednesday, a livid Mr. Krauze likened the president’s meeting with Mr. Trump to the decision by Neville Chamberlain, then the British prime minister, to sit down with Hitler in Munich in 1938. “It isn’t brave to meet in private with somebody who has insulted and denigrated” Mexicans, Mr. Krauze said. “It isn’t dignified to simply have a dialogue. ” Yes, many Mexicans say, it was Mr. Trump who offended the people of Mexico with his disparaging comments about migrants and his promises to build a border wall paid for by Mexico. But for many Mexicans, the surprising invitation from Mr. Peña Nieto  —   who has likened Mr. Trump’s language to that of Hitler and Mussolini in the past  —   is even worse. Newspapers, television stations, social media and all manner of national communications were awash in vitriol at the idea of a meeting between the two men, while political analysts on both sides of the border said they were mystified about why Mr. Peña Nieto invited Mr. Trump. “It is Peña Nieto’s worst mistake so far and one we still don’t understand,” said Vidal Romero, the head of the political science department at the Autonomous Technological Institute of Mexico, a university in Mexico City. “This would only hurt him. ” But as others pointed out, Mr. Trump is the Republican presidential candidate, and not the first to visit a Mexican president. John McCain came to Mexico when he was running against Barack Obama. “At the end of the day, this is the Republican candidate,” said Rafael Fernández de Castro, a professor at Syracuse University and former foreign policy adviser to Felipe Calderón, the previous Mexican president. “The U. S. electorate put him in this position, and Peña is respecting that. ” Ultimately, he said, foreign policy cannot always be guided by public opinion, no matter the political consequences. “He has everything to lose in the media, but this is about governing,” Mr. Fernández de Castro said. “He had no other choice  —   a good relationship with the U. S. is essential for the   of Mexico. ” From that perspective, with his approval ratings already low, Mr. Peña Nieto may have less to lose than is commonly thought. If the goal was to ensure national interests in the event Mr. Trump wins, then the furor over the visit seemed a political cost the government was willing to take. Still, there is “unanimity that this is a giant farce,” said Jesús   Márquez, a professor at the Tecnólogico de Monterrey in Mexico City and columnist for Reforma, a Mexico City newspaper. Mr. Peña Nieto “compared Mr. Trump to Mussolini and Hitler,” he added, “and now we invite Mussolini, we are going to negotiate with Hitler when he hasn’t even won the election. ” After the men met, in what Mr. Trump described as an “excellent” occasion, they spoke at a very civil news conference. Mr. Peña Nieto promised to work with whichever candidate was elected and emphasized the importance of ties with the United States. “I shared with him the fact that there have been misunderstandings or affirmations that hurt and affected Mexicans in their perception of his candidacy,” Mr. Peña Nieto said he told Mr. Trump. “The Mexican people felt aggravated for comments that were formulated, but I am certain that he has a genuine interest in building a relationship that would lead us to provide better conditions for our people. ” While Mr. Trump hardly offered Mexicans the sort of apology many had hoped for, he was a far more chastened candidate than they had come to expect. He repeatedly lauded their hard work, and spoke of his “tremendous feeling” for Mexicans. “They are amazing people,” he noted. In the end, he called Mr. Peña Nieto a friend. Citing Mr. Trump’s more respectful tone, the government described the meeting as a success. “It was a different Trump,” said Eduardo Sánchez, the president’s spokesman. “The attitude of this Trump is different from the ones we have seen before today. ” But Shannon K. O’Neil, a Mexico expert at the Council on Foreign Relations in New York, said: “I don’t see how that helped Peña Nieto. If the reason Peña was inviting Trump was to stand up to him and show his strength in front of somebody who has attacked Mexicans, then he failed. ” Other critics were less kind. “To put it mildly, I think it was the biggest humiliation a Mexican president has suffered on his own territory in the last 50 years,” said Esteban Illades, editor of Nexos, a magazine in Mexico. “He not only managed to make Donald Trump look presidential, which is an incredibly hard thing to do, he managed to forgive Donald Trump even though he didn’t actually offer an apology in the first place. ” Mexican officials did not clearly articulate the reasons for the visit at first. Later, in a news release, the president explained the rationale for the meeting as being in the interest of democracy and to create a dialogue. In his remarks, Mr. Peña Nieto suggested that he wanted to fortify the nation’s ties with its most important global partner, while standing up for Mexico. “I also made him notice and feel the great responsibility I have as president of Mexico, to defend the Mexican people, both those who are here and abroad,” Mr. Peña Nieto said after the meeting. Some argued that the invitation was a distraction from the domestic problems that have gnawed at the president. Violence is rising, new scandals seem to emerge regularly and the impunity that lies at the heart of discord in Mexico remains undisturbed. Most recently, the president was accused of plagiarizing a third of his law school thesis, which his office explained as an error in citation. Others were not convinced by that explanation, contending meeting with Mr. Trump hardly made the other problems go away. “I do not see this as a distraction to his problems the visit will only add to the problems he faces in Mexico,” said Jason Marczak, a director in the Atlantic Council’s Adrienne Arsht Latin America Center, a research center. “Donald Trump will come out of this meeting carrying the message of the meeting. ” “He will use Peña Nieto as a political pawn in his campaign,” he added.'"}, "time": 1742562105.1863503}