{"duration": 0.0685567855834961, "input_args": {"text": "'  Edmondo Burr in Weird // 0 Comments A male Chinese boss has come under fire for ordering his female workers to perform a daily kissing ritual. \\nThe female workers of a Beijing company are forced to line up every morning and give their boss a kiss. \\nThe creepy Chinese boss forces his female employees to kiss him every morning, claiming that it fosters good relationships among colleagues. \\nDaily Trends reports: \\nWomen working at a company that sells home brewery machinery, in Tongzhou District, Beijing, are required to line up between 9:00 and 9:30 each morning to kiss their boss. And we’re not talking about a little, innocent smooch on the cheek, although that would be pretty weird as well, but a kiss on the lips. China Press reports that while the women were initially reluctant to accept the bizarre daily ritual, they eventually gave in to the boss’ demands in order to keep their jobs. Only two of the company’s female workers refused to kiss their boss on the mouth and chose to resign instead. According to Chinese media reports, over half the unnamed company’s staff members are women. \\nFacing increasing pressure from both the media and the general public, the boss explained that he picked up the idea for the daily morning kiss while visiting a company in the United States, and claimed that the disgusting daily ceremony helps “foster good relationships among colleagues”, allowing him and his female staff to get along “like fish and water”. Not only that, but he says that some of his women worker genuinely miss him when he is away, and send him messages on WeChat. \\nNeedless to say that the boss’ explanation didn’t really satisfy the millions of social media users outraged by the viral video of him kissing his female staff. \\n“How can these female workers accept this? Do their boyfriends or husbands know?” one person commented on Weibo, China’s version of Twitter. “I want to ask these female workers: Do you have no money? Would you starve if you changed jobs?” another added. \\nAnd while all of them condemned the man for his sleazy rule, some said that the women carried some of the blame as well, just for putting up with the situation. “The boss is a perv, but the workers are foolish,” someone wrote.'"}, "time": 1742563140.7928274}