{"duration": 0.06508350372314453, "input_args": {"text": "'Genius Kid Trolled White House Halloween Party, Idiot Obama Didn’t Notice Posted on November 1, 2016 by Robert Rich in Politics Share This \\nDuring certain holidays, Barack and Michelle Obama invite a few kids to the White House to join them in the festivities. However, the most recent incident wasn’t like all the rest as one kid decided to troll everyone there with a genius costume idea – and our idiot president didn’t even seem to notice what he did. \\nYesterday, a few kids were invited to the White House Rose Garden in order to dress up for the annual Halloween trick-or-treat event. Although most kids were there for the candy and games, there was one costume that stood above the rest – a duck. \\nNow, this wasn’t exactly your typical duck costume with a kid inside, and he wasn’t your ordinary kid either. As can be seen in a picture posing with Obama, the duck was actually bandaged with its arm in a sling, thereby actually making it a “ lame duck .” Obama meets kid dressed as \"lame duck\" for Halloween at WH pic.twitter.com/5q4l04b5pM \\n— Jim Acosta (@Acosta) October 31, 2016 \\nOf course, Obama is about to adopt that name after the election as he begins the home stretch of his presidency. Although he hasn’t done anything except for forcing his legacy down America’s throat, these are the few months where slacking off is actually accepted from a man in his position. \\nAt this point, a few things are unclear, including whether this kid was suggesting that Obama was a lame duck for his entire presidency or if our so-called Commander-in-Chief actually caught the genius pun. While some say he took the comedic jab with a bit of humor, others suggest the moron missed the subtle trolling entirely as it was just one of the endless droves of children in costumes that he took a picture with. \\nIt’s unknown who was actually in the costume or if the idea came from the child or their father, but it’s being shared around social media for good reason. Obama has been nothing but a lame duck for the past 8 years after idiot voters actually believing the “hope and change” spiel voted for the man twice. \\nFortunately, his days of freeloading and kicking back are about to become a thing of the past. Although nothing will change during his “lame duck” months, freeloaders of our nation are about to get a kick in the backside when Donald Trump is elected. We have been doing nothing for far too long – it’s time we kick things into high gear and actually do some great things, just like we used to do.'"}, "time": 1742563085.902875}