{"duration": 0.056511878967285156, "input_args": {"text": "'  3:18 pm The Democratic dream team of Hillary Clinton and First Lady Michelle Obama teamed up to fire up North Carolina Democrats and get   Share   \\nThe Democratic dream team of Hillary Clinton and First Lady Michelle Obama teamed up to fire up North Carolina Democrats and get   \\nHillary Clinton spoke first and delivered a speech that was offered glowing praise for President and First Lady Obama. Clinton’s happiness and relaxed nature have never been more obvious on the campaign trail. \\nClip of Hillary Clinton talking about Michelle Obama: \"No one knows more about what\\'s at stake in this election than our first lady.\" #ImWithHer pic.twitter.com/dYoYdQuyJK \\n— Barrier Breakers (@nobarriers2016) October 27, 2016 \\nFirst Lady Obama said of Clinton, “She is absolutely ready to be commander in chief on day one, and yes, she is a woman.” \\nClip of First Lady Obama touting Clinton’s experience: \\n— Barrier Breakers (@nobarriers2016) October 27, 2016 \\nMrs. Obama went on to call Trump’s vision of America grounded in hopelessness and despair. She said Trump calls on us to build walls and to be afraid. \\nThe First Lady said that voters have a choice between those who divide the country between us and them and those who encourage us to embrace our better angels. \\nFirst Lady Obama said that the election is about who will shape our children and the country we leave for them. \\nObama devasted Trump by reminding America that the president is the most powerful role model for children in the world. \\nThe enthusiasm and positivity pulsed through the building. Democrats are hungry for victory. Democrats can feel it in their bones. They are so close to electing Clinton that they can taste it. \\nThe tone of Clinton and Obama’s speeches told the story of where the election stands. Trump is increasingly becoming an afterthought as Democrats are transitioning towards healing the damage that Trump did to the country. \\nMichelle Obama called out Trump’s strategy of calling the election rigged to depress voter turnout. Obama said, “Voters decide who wins election. Period. End of story.” \\nHillary Clinton and Michelle Obama both offered inspirational speeches for Democrats and the American people. \\nDemocrats have one job left to do, and that is to go out and vote for Hillary Clinton to be the next President Of The United States.'"}, "time": 1742562829.2840002}