{"duration": 0.22621703147888184, "input_args": {"text": "'Tweet Widget by Rick Sterling \\nWarmongers in the U.S. Congress -- Democrats and Republicans – are in a mad dash towards war with Russia in Syria. A “No Fly Zone” resolution passed the House with little debate, cloaked in “humanitarian” language that blames the besieged Syrian government for the totality of the deaths in the U.S.-backed proxy war. The bipartisan regime changers are desperate to complete their mission before the regime change that will occur in Washington, on January 20. Congressional Hawks Rush to Intensify War in Syria by Rick Sterling \\nThis article previously appeared in Dissident Voice . \\n“ They are desperate to prevent the Syrian government from finally eliminating the terrorist groups which the West and allies have promoted for the past 5+ years.” \\nHawks pass HR5732 \\nLate in the day Tuesday November 15, Congress convened in special session. With normal rules suspended, they passed House Resolution 5732 the “Caesar Syria Civilian Protection Act.” The resolution calls for intensifying already harsh sanctions on Syria, assessing implementation of No Fly Zone in Syria and escalating efforts to press criminal charges against Syrian officials. \\nHR5732 claims to promote a negotiated settlement in Syria but, as analyzed by Friends Committee for National Legislation, imposes preconditions which would actually make that more difficult. \\nThere was 40 minutes of “debate” with six representatives (Royce, Engel, Ros-Lehtinen, Kildee, Smith, and Curbelo) speaking in favor of the resolution. There were few other Congressional representatives present in Congress. The House Foreign Affairs Committee stated that the resolution was passed “unanimously” without mentioning the special conditions. \\nThe “Non Controversial” Resolution that could lead to World War III \\nAccording to wikipedia “ Suspension of the rules is a procedure generally used to quickly pass non-controversial bills in the United States House of Representatives ….such as naming Post Offices…” In this case, the resolution calls for evaluating and developing plans for a “No Fly Zone” which is an act of war. This is obviously controversial and it seems clear the resolution should have been debated and discussed under normal rules with a normal amount of Congressional presence and debate. \\nThe motivation for bypassing normal rules and rushing the bill through without debate was articulated by the bill’s author and ranking Democrat Eliot Engel: “We cannot delay action on Syria any further…. if we don’t get this legislation across the finish line in the next few weeks, we are back to square one.” The current urgency may be related to the election results since Trump has spoken out against “regime change” foreign policy. As much as they are critical of Obama for not doing more, Congressional neoconservatives are concerned about the prospect of a President who might move toward peace and away from war. \\nThe Caesar Fraud \\nHR5732 is titled the “Caesar Syria Civilian Protection Act”. Foreign Affairs Committee Chair Ed Royce (R-Ca) explained that the resolution is named after “the brave Syrian defector known to the world as Caesar, who testified to us the shocking scale of torture being carried out within the prisons of Syria.” \\nIn reality, the Caesar story was a grand deception involving the CIA with funding from Qatar to sabotage the 2014 Geneva negotiations. The 55,000 photos which were said to show 11,000 torture victims have never been publicly revealed. Only a tiny number of photos have been publicized. However, in 2015 Human Rights Watch was granted access to view the entire set. They revealed that almost one half the photos show the opposite of what was claimed: instead of victims tortured by the Syrian government, they actually show dead Syrian soldiers and civilian victims of car bombs and other terror attacks! The “Caesar” story, replete with masked ‘defector’, was one of the early propaganda hoaxes regarding Syria. \\nFalse Claims that the US has been doing nothing \\nOne of the big lies regarding Syria is that the US has been inactive. Royce says: \\nThe administration has decided not to decide. And that itself, unfortunately, has set a course where here we sit and watch and the violence only worsens. Mr. Speaker, America has been sitting back and watching these atrocities for far too long. Vital U.S. national security interests are at stake. \\nThe ranking Democrat Eliot Engel said: \\nFour years ago I thought we should have aided the Free Syrian Army. They came to us in Washington and begged us for help… they were simply looking for weaponry. I really believe if we had given it to them, the situation in Syria would have been different today. \\nThis is nonsense. The US was actively coordinating, training and supplying armed opposition groups beginning in late 2011. When the Qadaffi government was toppled in Fall 2011, the CIA oversaw the theft of the Libyan armories and shipment of weapons to Syrian armed opposition as documented in the Defense Intelligence Agency report of October 2012. \\nThese weapons transfers were secret. For the public record it was acknowledged that the US was supplying communications equipment to the armed opposition while Saudi Arabia and Qatar were supplying weaponry. This is one reason that Saudi purchases of weapons skyrocketed during this time period; they were buying weapons to replace those being shipped to the armed opposition in Syria. It was very profitable for US arms manufacturers. \\nHuge weapons transfers to the armed opposition in Syria have continued to the present. This past Spring, Janes Defense reported the details of a U.S. delivery of 2.2 million pounds of ammunition, rocket launchers and other weaponry to the armed opposition. \\n“The US has done everything short of a direct attack on Syria.” \\nClaims that the US has been inactive are baseless. In reality the US has done everything short of a direct attack on Syria. And the US military is starting to cross that barrier. On September 17 the US air coalition did a direct attack on the Syrian Army in Deir Ezzor, killing 80 Syrian soldiers and enabling ISIS to launch an attack on the position. Claims that it was a “mistake” are highly dubious. \\nThe claims by Congressional hawks that the US has been “inactive” in the Syrian conflict are part of the false narrative suggesting the US must “do something” which leads to a No Fly Zone and full scale war. Ironically, these calls for war are masked as “humanitarian.” And never do the proponents bring up the case of Libya where the US and NATO “did something”: destroyed the government and left chaos. \\nCongress as a Fact-Free House of Propaganda \\nWith only a handful of representatives present and no debate, the six Congress members engaged in unrestrained propaganda and misinformation. The leading Democrat, Eliot Engel, said “We’re going into the New Year 2017, Assad still clings to power, at the expense of killing millions of his citizens.” That number is way off anyone’s charts. \\nRep Kildee said “The world has witnessed this terrible tragedy unfold before our eyes. Nearly half a million Syrians killed. Not soldiers – men, women, children killed.” \\nThe official text of the resolution says, \\nIt is the sense of Congress that– \\n(1) Bashar al-Assad’s murderous actions against the people of Syria have caused the deaths of more than 400,000 civilians… \\nThe above accusations – from “millions of citizens” to “half a million” to “400,000 civilians” – are all preposterous lies. \\nCredible estimates of casualties in the Syrian conflict range from 300,000 to 420,000. The opposition supporting Syrian Observatory for Human Rights estimates the documented 2011-2016 death toll as follows: \\nkilled pro Syrian forces – 108,000 \\nkilled anti government forces – 105,000 \\nkilled civilians – 89,000 \\nIn contrast with Congressional and media claims, civilians comprise a minority of the total death count and the largest casualty group is those fighting in defense of the the Syrian state. These facts are ignored and never mentioned because they point to the reality versus the propaganda narrative which allows the USA and allies to continue funding terrorism and a war of aggression against Syria. \\nThe Congressional speakers were in full self-righteous mode as they accused the Syrian government of “committing crimes against humanity and war crimes against civilians including murder, torture and rape. No one has been spared from this targeting, even children.” A naive listener would never know that the Syrian government is primarily fighting the Syrian branch of Al Qaeda including thousands of foreigners supplied and paid by foreign governments. \\nThe Congressional speakers go on to accuse the Syrian military of “targeting” hospitals, schools and markets. A critical listener might ask why they would do that instead of targeting the Al Qaeda terrorists and their allies who launch dozens and sometimes hundreds of hell cannon missiles into government held Aleppo every day. \\n“The White Helmets actively promote US/NATO intervention through a No Fly Zone.” \\nThe Congressional propaganda fest would not be complete without mention of the “ White Helmets “. House Foreign Affairs Committee Chairman Ed Royce said: \\n“We (previously) heard the testimony of Raed Saleh of the Syrian White Helmets. These are the doctors, nurses and volunteers who actually, when the bombs come, run towards the areas that have been hit in order to try to get the injured civilians medical treatment…They have lost over 600 doctors and nurses.” \\nThis is more Congressional nonsense. There are no nurses or doctors associated with the White Helmets. The organization was created by the USA and UK and heavily promoted by a “ shady PR firm .” The White Helmets operate solely in areas controlled by Nusra and associated terrorist groups. They do some rescue work in the conflict zone but their main role is in the information war manipulating public opinion. The White Helmets actively promote US/NATO intervention through a No Fly Zone. Recently the White Helmets has become a major source of claims of innocent civilian victims in east Aleppo. Given the clear history of the White Helmets, these claims should be treated with skepticism. What exactly is the evidence? The same skepticism needs to be applied to video and other reports from the Aleppo Media Center. AMC is a creation of the Syrian Expatriates Organization whose address on K Street, Washington DC indicates it is a US marketing operation. \\nWhat is really going on? \\nThe campaign to overthrow the Syrian government is failing and there is possibility of a victory for the Syrian government and allies. The previous flood of international jihadi recruits has dried up. The Syrian Army and allies are gaining ground militarily and negotiating settlements or re-locations with “rebels” who previously terrorized Homs, Darraya (outer Damascus) and elsewhere. In Aleppo the Syrian army and allies are tightening the noose around the armed opposition in east Aleppo. \\nThis has caused alarm among neoconservative lawmakers devoted to Israel, Saudi Arabia and U.S. empire. They are desperate to prevent the Syrian government from finally eliminating the terrorist groups which the West and allies have promoted for the past 5+ years. \\n“Pro Israel” groups have been major campaigners for passage of HR5732. The name of Simon Wiesenthal is even invoked in the resolution. With crocodile tears fully flowing, Rabbi Lee Bycel wrote “ Where is the Conscience of the World? ” as he questioned why the “humanitarian” HR5732 was not passed earlier. \\nIsraeli interests are one of the primary forces sustaining and promoting the conflict. Syria is officially at war with Israel which continues to occupy the Syrian Golan Heights; Syria has been a key ally of the Lebanese resistance; and Syria has maintained its alliance with Iran. In 2010 Secretary of State Clinton urged Syria to break relations with Hezbollah, reduce relations with Iran and come to settlement with Israel. The Syrian refusal to comply with these Washington demands was instrumental in solidifying Washington’s hostility . \\nCongressional proponents of HR5732 make clear the international dimension of the conflict. Royce explains “It is Russia, it is Hezbollah, that are the primary movers of death and destruction…it is the IRGC fighters from Iran”. Engel echoes the same message: “Yes, we want to go after Assad’s partners in violence…along with Iranian and Hezbollah forces”. \\nThese statements are in contrast with the analysis of some writers who believe Israel is not deeply opposed to the Damascus government. For example, Phyllis Bennis recently wrote that belief in an “arc of resistance” has been “long debunked” and that “the Syrian regime …. often plays a useful role for US and Israeli interests.” \\nIt’s remarkable that this faulty analysis continues to be propounded. In words and deeds Israel has made its position on Syria crystal clear. Israeli Ambassador Michael Oren explained in an interview: \\n“We always wanted [President] Bashar Assad to go, we always preferred the bad guys who weren’t backed by Iran to the bad guys who were backed by Iran … the greatest danger to Israel is by the strategic arc that extends from Tehran, to Damascus to Beirut. And we saw the Assad regime as the keystone in that arc.” \\nThese statements have been fully backed up by Israeli actions bombing Syrian positions in southern Syria and providing medical treatment for Nusra/Al Qaeda and other armed opposition fighters. \\nWhat Will Happen Now? \\nIf the Syrian government and allies continue to advance in Aleppo, Deir Ezzor, outer Damascus and the south, the situation will come to a head. The enemies of Syria – predominately the USA, Gulf Countries, NATO and Israel – will come to a decision point. Do they intervene directly or do they allow their regime project to collapse? \\nHR5732 is an effort to prepare for direct intervention and aggression. \\nOne thing is clear from the experience of Libya: Neoconservatives do not care if they leave a country in chaos. The main objective is to destabilize and overthrow a government which is too independent. If the USA and allies cannot dominate the country, then at least they can destroy the contrary authority and leave chaos. \\nWhat is at stake in Syria is whether the USA and allies Israel, Saudi Arabia, etc. are able to destroy the last secular and independent Arab country in the region and whether the US goal of being the sole superpower in the world prevails. \\nThe rushed passing of HR5732 without debate is indicative that: \\n* “regime change” proponents have not given up their war on Syria \\n* they seek to escalate US aggression. \\n* the US Congress is a venue where blatant lies are said with impunity and where violent actions are advanced behind a cynical and amoral veneer of “humanitarianism” and crocodile tears. Rick Sterling is an investigative journalist and member of Syria Solidarity Movement. He can be reached at [email protected]'"}, "time": 1742563918.3403604}