{"duration": 0.15248465538024902, "input_args": {"text": "'WASHINGTON  —   President Trump’s proposal to add $54 billion to the Pentagon budget next year sounds huge at first  —   a 10 percent increase for a department that already receives more of taxpayers’ money than any other part of government. But the outgoing Obama administration had forecast a $35 billion increase for the Defense Department in fiscal year 2018, so Mr. Trump’s share of the proposed increase over and above that figure is $19 billion, according to budget analysts. Even so, the proposed Pentagon increase has been greeted with criticism from military spending hawks, in part because White House officials say Mr. Trump will call for a significant cut in foreign aid, including programs that military officials say contribute to global stability and are seen as important in helping avoid future conflicts. Senior administration officials acknowledged on Monday that there were few specifics attached to the bigger budget number proposed for the Pentagon  —   so it is not yet possible to assess how many more troops, warships or   the Pentagon will be able to field with the $54 billion. “Where we’re at in this process is that the number’s going to the D. O. D. today, and over the course of the next 10 days to two weeks, we’ll be coming up with those types of details,” Mick Mulvaney, the president’s budget director, said when pressed on plans for Department of Defense spending. Broadly speaking, Mr. Trump has said his military priorities include buying more warships and warplanes, increasing the number of American ground troops and modernizing the nuclear arsenal. Even so, he will face difficulty in getting such a proposal through Congress, where the threat of mandatory spending cuts known as sequestration has acted as a brake on military spending. “This is a symbolic gesture,” said Todd Harrison, the director of defense budget analysis at the Center for Strategic and International Studies. “What Trump is proposing is increasing defense spending and paying for it by cutting nondefense spending. There’s no way Democrats are going to go for that. ” Under sequestration rules, Republicans would need Democrats to increase the military budget, a requirement that is likely to stymie Republican efforts to pay for increases in the Pentagon budget with cuts in other spending, including social programs. At the Defense Department, where military leaders always welcome more money, officials were muted about Mr. Trump’s budget proposal. What is more, Mr. Trump joined his call for increased military spending with a critique of the military, implying that the nation’s armed forces need more money because they have failed at winning wars. “We have to start winning wars again,” Mr. Trump said. “I have to say, when I was young, in high school and college, everybody used to say we never lost a war. We never lost a war, remember?” He continued: “And now we never win a war. We never win. And don’t fight to win. We don’t fight to win. We’ve either got to win or don’t fight at all. ” Mr. Trump was born in 1946, the year after World War II ended. The only wars fought when he was young were not American victories  —   he was 7 when the Korean War ended in a stalemate, and he was in college when American forces were bogged down in Vietnam. When he was in his 40s and 50s, the United States conducted a successful military operation in Panama, reversed Iraq’s invasion and occupation of Kuwait, and drove Serbian forces out of Kosovo. But Mr. Trump was channeling public exhaustion after more than 15 years of warfare since the Sept. 11, 2001, attacks, including the still unresolved conflicts in Afghanistan and Iraq. Mr. Trump gave no indication of how he would have ensured victory in either of those places or what he planned to do. Defense Secretary Jim Mattis briefed the president’s team on Monday on potential strategies for defeating the Islamic State, which has operated in Iraq and Syria. Still, even the wars believed to be outright American victories by the public are not necessarily so, according to Andrew Exum, a retired Army Ranger and a Defense Department official in the Obama administration. “Those victories were not as decisive as we remember: It took another 100 years, after the civil rights acts of the 1960s, before the North truly won the Civil War, while the peace that ended the First World War begat the Second World War, and the peace that ended the Second World War begat the Cold War and its many constituent conflicts,” Mr. Exum said. “What Trump is saying resonates because it’s based more on the myths we tell ourselves than the histories written down in long, dense books. ” Former and current American military officials agreed. “The wars today don’t deliver battlefield victories along the lines of what we saw in World War II, with the surrender on the deck of the battleship Missouri,” said David W. Barno, a retired Army lieutenant general and former commander of American forces in Afghanistan. “We’re fighting enemies with no navies, no air forces or even conventional armies in some cases. Applying only conventional armed forces to these conflicts is not always going to be adequate. ” Several former Pentagon officials, including a number of retired generals and admirals, cautioned against cutting the State Department and foreign aid budgets to help pay for increases in Pentagon spending. In a letter to top congressional leaders, the retired military officers wrote that “elevating and strengthening diplomacy and development alongside defense are critical to keeping America safe. ” “We know from our service in uniform that many of the crises our nation faces do not have military solutions alone,” the generals and admirals wrote. “The military will lead the fight against terrorism on the battlefield, but it needs strong civilian partners in the battle against the drivers of extremism  —   lack of opportunity, insecurity, injustice and hopelessness. ” James G. Stavridis, a retired admiral who signed the letter, said on Monday that most senior military leaders believed it was unwise to cut development aid and diplomacy funding. “So often, the far less expensive ‘soft power’ tools  —   humanitarian relief, medical diplomacy, foreign aid, strategic communications  —   are under sister agencies such as state and A. I. D. ,” said Mr. Stavridis, a former NATO commander who now serves as the dean of the Fletcher School of Law and Diplomacy at Tufts University, referring to the State Department and the Agency for International Development. “Cutting them harshly would be a mistake. ” Even Mr. Mattis expressed those views before being named defense secretary. “If you don’t fully fund the State Department, then I need to buy more ammunition,” he said during congressional testimony in 2013, when he was head of the military’s Central Command. Senator John McCain, Republican of Arizona and the chairman of the Armed Services Committee, recently released a report calling for an increase in military spending to $640 billion in the next fiscal year, not the $603 billion that Mr. Trump proposed. In a statement on Monday, Mr. McCain said Mr. Trump’s proposal was insufficient. “With a world on fire, America cannot secure peace through strength with just 3 percent more than President Obama’s budget,” Mr. McCain said. “We can and must do better. ” After the Pentagon budget number was released on Monday, the stocks of the largest military contractors rose 1 percent to 2 percent during trading. Lockheed Martin, Boeing, General Dynamics and Northrop Grumman, which pay relatively high dividends, had already seen their stocks rise to record levels in a rally that began last summer. Investors will now want to see how any budget increases would be divided among weapons programs to determine which companies would benefit the most.'"}, "time": 1742561861.590028}