{"duration": 0.03160858154296875, "input_args": {"text": "'Documentary filmmaker and   activist Michael Moore plans to take on President Donald Trump in an original   Broadway show. [“I’m in a ‘take no prisoners’ mode,” Moore said Monday during a press conference at Sardi’s in New York City, according to the Hollywood Reporter. “We’ve seen newspapers take down presidents, TV shows bring down CEOs, books have taken down the powerful  —   art forms have contributed to making things better. Why don’t we see if every night  —   and twice in the afternoon for 12 weeks  —   if a piece of theater could raise enough of a ruckus to discombobulate a man sitting in the Oval Office?”  “I don’t know, but I’d like to find out. Hey, stranger things have happened in the last year,” he added. The Terms of My Surrender will reportedly run for 12 weeks at the Belasco Theater, and will be directed by   Michael Mayer. Tony   David Rockwell will design the set. Production for the show is being led by IMG Original Content. “I operate with the hope that he won’t be president for very long,” Moore said Monday. “This is a limited   run, I guess I would like Trump to have the same thing. Should he not be President by the end of the run, if you have tickets for the last week, it’ll still be as good as the first week. ” Moore, who was one of the first celebrities to successfully predict Trump’s election, made his announcement standing next to a production prop that poses the question: “Can a Broadway show bring down a sitting president?” Michael Moore (@MMFlint) unveils   Broadway play, including   excursions to Trump Tower https:  .  pic. twitter.   —   Ashley Lee (@cashleelee) May 1, 2017,  In an interview with the New York Times, Moore described the play as a humorous take on a “country that’s just elected a madman  —   I mean, there’s really no other way to put it. ” “We’re 10 blocks from Trump Tower, we’re in the corporate capital of America, we’re in the financial capital of America, we’re in the media capital of America,” Moore told the Times. “If one was going to stand on a stage and do the things that I’m going to do, there’s only one place to do it, and it’s here in this city and it’s right here at the epicenter of creative expression and free speech. ” Moore told reporters at Monday’s press conference that he hopes President Trump or Vice President Mike Pence will come see the Broadway show. The      also assured that his show will include a message that will appeal to Republicans and middle America. “I have found that Republicans or conservatives often will come to my films in part because I speak the language of the Midwest the people who voted for Trump are my neighbors,” Moore said. “I’m always excited to talk to them. I’ve noticed since the election that people who voted for Trump will stop and talk to me on the street because before the election, I was the only liberal who said he was gonna win. I took it seriously. I didn’t think it was just a joke. ” “As far as preaching to the choir, it’s been rough for tens of millions of Americans since the 8th of November,” Moore added. “Sometimes the choir needs a song to sing, and this is a necessary and important moment to provide that. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628556.305683}