{"duration": 0.1441361904144287, "input_args": {"text": "'WASHINGTON  —   The Obama administration said on Thursday that it would begin to phase out the use of private   prisons to house federal inmates. The Bureau of Prisons had resorted to such prisons to ease overcrowding as the incarceration rate soared, but the number of federal inmates has been dropping since 2013. In announcing the policy shift, the Justice Department cited that decline, as well as a critical recent report by the department’s independent inspector general about safety and security problems in private prisons. “Private prisons served an important role during a difficult period, but time has shown that they compare poorly to our own bureau facilities,” Sally Q. Yates, the deputy attorney general, wrote in a memo to the bureau. Such prisons, she said, “do not save substantially on costs,” and they provide fewer rehabilitative services, like educational programs and job training, that are “essential to reducing recidivism and improving public safety. ” Ms. Yates instructed the Bureau of Prisons not to renew contracts to use private prisons as existing ones expire, or to at least “substantially reduce” the number of beds that future contracts will provide. By May 2017, Ms. Yates wrote, the bureau is projected to house just 14, 200 inmates in private prisons, down from about 30, 000 in 2013. There are about 195, 000 federal inmates they make up a small percentage of the roughly 1. 5 million prisoners in state and federal facilities. As a first step, Ms. Yates said, a pending contract solicitation will be scaled down from 10, 800 prisoner slots to a maximum of 3, 600. Also, the bureau recently declined to renew a contract for a private prison that had provided beds for up to 1, 200 federal inmates. Advocates of prisoner rights applauded the policy shift  —   part of a broad effort by the administration to overhaul the criminal justice system  —   and called on state prison agencies to follow suit. The change was first reported on Thursday by The Washington Post. This month, Michael E. Horowitz, the Justice Department’s inspector general, issued a report on the bureau’s use of privately operated prisons, which it said began on a small scale in 1997 to alleviate overcrowding. It found that private prisons were more violent and problematic than public prisons by many measures, including discovery of contraband like cellphones, reports of assaults, and lockdowns. The inspector general report said that the Bureau of Prisons spent $639 million on prison contracts in 2014, and it identified three corporations as running the private prisons used by the federal government: Corrections Corporation of America, GEO Group, and Management and Training Corporation. Issa Arnita, a spokesman for Management and Training Corporation, expressed disappointment in the administration’s move and pushed back. He wrote in an email that if the decision was “based solely on declining inmate populations, there may be some justification, but to base this decision on cost, safety and security, and programming is wrong. ” He cited a 2015 Bureau of Prisons report showing that it costs about $63 a day to house an inmate in a privately operated prison, compared with about $80 a day to house an inmate in a   public prison. While acknowledging the inspector general’s finding that private prisons have had a higher rate of violent episodes, Mr. Arnita said that was misleading “because it doesn’t take into account the vastly different inmate populations in contract and public prisons. ” The bureau has tended to house in private prisons noncitizen inmates linked to gangs, he said. Jonathan Burns, the director of public affairs for Corrections Corporation of America, also criticized the impression left by the inspector general report, saying it “failed to account for the impact of elements such as population demographics or the scope and efficacy of efforts to mitigate contraband. ” “The findings,” he added, “simply don’t match up to the numerous independent studies that show our facilities to be equal or better with regard to safety and quality, or the excellent feedback we get from our partners at all levels of government. ” But David Fathi, the director of the National Prison Project at the American Civil Liberties Union, called the policy change “an important and groundbreaking decision,” and he called on state prison agencies “to stop handing control of prisons to   companies” as well. The step joins previous efforts the Obama administration has made to overhaul the criminal justice system. A generation ago, amid a rise in crime rates, state and federal lawmakers began passing “tough on crime” laws, including mandatory minimum sentences for drug possession. That led to a huge increase in incarceration rates at the federal level, the inmate population swelled nearly 800 percent from 1980 to 2013, when it peaked at 220, 000. As crime rates have now fallen to or near   lows, political leaders at the state and federal levels and across the ideological divide  —   some focused on the cost to taxpayers, some on human costs  —   have increasingly agreed that too many people are behind bars. The Obama administration in its first term worked with Congress to reduce the disparity in sentencing for crack versus powder forms of cocaine. And in 2013, Eric H. Holder Jr. the attorney general at the time, announced several changes intended to reduce incarceration, including a policy of not listing specific quantities of drugs in indictments, to avoid bringing mandatory minimum sentencing laws into play. Ms. Yates said that and other changes made in 2013 had helped reduce the federal inmate population, making it possible to start phasing out the use of private prisons. “This is the first step in the process of reducing  —   and ultimately ending  —   our use of privately operated prisons,” Ms. Yates wrote in a blog post published on the Justice Department’s website, adding that the steps put the department “on a path to ensure that all federal inmates are ultimately housed at bureau facilities. ”'"}, "time": 1742563417.435164}