{"duration": 0.09641790390014648, "input_args": {"text": "'Trump\\'s Foreign Policy Is Sane While Clinton\\'s Is Belligerent \\nAt least on Syria and Russia relations there\\'s no contest Originally appeared at Moon of Alabama \\nSome highlights of a recent Donald Trump interview with Reuters: U.S. Republican presidential nominee Donald Trump said on Tuesday that Democrat Hillary Clinton\\'s plan for Syria would \"lead to World War Three,\" because of the potential for conflict with military forces from nuclear-armed Russia.\\nIn an interview focused largely on foreign policy, Trump said defeating Islamic State is a higher priority than persuading Syrian President Bashar al-Assad to step down,.. \\nTrump questioned how Clinton would negotiate with Russian President Vladimir Putin after demonizing him; blamed President Barack Obama for a downturn in U.S. relations with the Philippines under its new president, Rodrigo Duterte;... \\nTrump\\'s foreign policy talk is far more sane than Clinton\\'s and her camp\\'s. It is ludicrous to event think about openly attacking Russian (or Syrian) troops in Syria with an al-Qaeda supporting \"no-Fly-Zone\". Russia would respond by taking down U.S. planes over Syria. The Russian government would have to do so to uphold its authority internationally as well as at home. \\nThe U.S. could respond by destroying all Russian assets in and around Syria. It has the capabilities. But then what? If I were Putin my next step would be a nuclear test shoot in Siberia - a big one - to make a point and to wake up the rest of the world. I would also provide secret support to any indigenous anti-U.S. movement anywhere. China would support Russia as its first line of self defense. \"What we should do is focus on ISIS. We should not be focusing on Syria,\" said Trump as he dined on fried eggs and sausage at his Trump National Doral golf resort. \"You’re going to end up in World War Three over Syria if we listen to Hillary Clinton.\\n\"You’re not fighting Syria any more, you’re fighting Syria, Russia and Iran, all right? Russia is a nuclear country, but a country where the nukes work as opposed to other countries that talk,\" he said. ...On Russia, Trump again knocked Clinton\\'s handling of U.S.-Russian relations while secretary of state and said her harsh criticism of Putin raised questions about \"how she is going to go back and negotiate with this man who she has made to be so evil,\" if she wins the presidency. \\nOn the deterioration of ties with the Philippines, Trump aimed his criticism at Obama, saying the president \"wants to focus on his golf game\" rather than engage with world leaders. \\nThe last two points are important. Trump, despite all his bluster, knows about decency. What is the point of arrogantly scolding negotiation partner who have the power to block agreements you want or need? \\nWhy blame Russia for hacking wide open email servers when no Russian speakers were involved? Why blame Duterte? It is the U.S. that has a long history of violent racism in the Philippines and FBI agents committed false flag \"terrorism\" is Duterte\\'s home town Davao. Bluster may paper over such history for a moment but it does not change the facts or helps solving problems. \\nTrump\\'s economic policies would be catastrophic for many people in the U.S. and elsewhere. But Hillary Clinton would put her husband, the man who deregulated Wall Street, back in charge of the economy. What do people expect the results would be? \\nThe points above may be obvious and one might be tempted to just pass them and dig into some nig-nagging of this or that election detail. But the above points as THE most important of any election. The welfare of the people is not decided with some \"liberal\" concession to this or that niche of the general society. The big issues count the most. Good or evil flow from them. Trumps principle, and I think personal position, is leaning towards peaceful resolution of conflicts. Clinton\\'s preference is clearly, as her history shows, escalation and general belligerence. It is too risky to vote for her. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire'"}, "time": 1742563909.0984032}