{"duration": 0.0510709285736084, "input_args": {"text": "'Videos More Than 1 Million ‘Check In’ On Facebook To Support The Standing Rock Sioux Most of the \"visitors\" are not actually at the protest camp in North Dakota, where the tribe and its supporters are gathering to oppose the pipeline. The planned route crosses the Missouri River just upstream of the reservation, and the tribe says it could contaminate drinking water and harm sacred lands. | November 2, 2016 Be Sociable, Share! A protesters is arrested by police near the Dakota Access pipeline at a construction site in North Dakota, Oct. 22, 2016. (Photo: YouTube) \\nMore than 1 million people have “checked in” on Facebook to the Standing Rock Indian Reservation page , in a show of support for the tribe that has been rallying against construction of the Dakota Access Pipeline. \\nMost of the “visitors” are not actually at the protest camp in North Dakota, where the tribe and its supporters are gathering to oppose the pipeline. The planned route crosses the Missouri River just upstream of the reservation, and the tribe says it could contaminate drinking water and harm sacred lands. Facebook allows people to check in to places even if they are not physically present. \\nA broadly circulated rumor on social media over the weekend suggested that local police were using Facebook check-ins to track activists protesting the pipeline. \\nActivists then called for supporters of the protest to check-in en masse, in a move designed to confuse police. \\n“Water Protectors are calling on EVERYONE to check-in at Standing Rock, ND to overwhelm and confuse them,” one widely shared post said, according to The Guardian . \\nIt’s not clear who started the rumor, but the response was immediate. “The number of check-ins at the Standing Rock reservation page went from 140,000 to more than 870,000 by Monday afternoon,” the Guardian reports. Now, that number stands at more than 1.5 million. \\nHowever, the Morton County Sheriff’s Department said in a Facebook post Monday afternoon that it “does not follow Facebook check-ins for the protest camp or any location” and called the report “absolutely false.” \\nThe demonstration of solidarity from these Facebook users comes days after “police and National Guard troops arrested more than 140 protesters near a construction site,” Inside Energy’s Amy Sisk reported on All Things Considered . On Friday, there were reports of police using pepper spray against protesters they removed from land owned by the pipeline company, as we reported . \\nHere’s more from our previous coverage: \\n“Members of the Standing Rock Sioux tribe and their supporters have been protesting the pipeline since it was approved by the U.S. Army Corps of Engineers over the summer . They are specifically trying to block the portion that is slated to run under the Missouri River near the Standing Rock Sioux Reservation.” \\n“Earlier this month, the Standing Rock Sioux lost a bid in federal court to halt construction, paving the way for work on the $3.8 billion pipeline to continue, as we’ve reported . Almost immediately afterward, three U.S. agencies ‘announced a halt to work in one area significant to the tribe.\\'”'"}, "time": 1742562036.9669735}