{"duration": 0.213578462600708, "input_args": {"text": "'WASHINGTON  —   In the Virginia suburb of McLean, where the local diner is a C. I. A. breakfast hangout, Gen. Michael V. Hayden, who ran the agency for George W. Bush, is playing career counselor these days. With   Donald J. Trump attacking the intelligence community, the general says his “old tribe’’ is feeling “a special angst. ” In   Takoma Park, Md. a “  zone” since 1983, a   resistance movement is taking shape. Nadine Bloch, an activist and artist, is running   training on nonviolent protest  —   complete with mock police officers wielding rolled up newspapers as batons. And here in the District of Columbia, where 91 percent of voters cast their ballots for Hillary Clinton, “  panic” is setting in, said John Feehery, a Republican strategist and Trump enthusiast. Leslie Harris, a liberal Democratic lawyer, uses war imagery: “I feel like my city is about to be invaded. ” Washington has always been a chameleon of a city, accustomed to remaking itself when the White House changes hands. But as Mr. Trump’s inaugural draws near, in a nation so deeply divided that it seems the political middle has entirely disappeared, perhaps no place in America feels as unsteady and on edge as the capital, which Mr. Trump calls “the swamp. ” With his 6 a. m. Twitter blasts and   style  —   and a roster of conservative Cabinet picks eager to do an   on President Obama’s policies  —   Mr. Trump has upended the city’s rhythms and jangled its nerves. The White House press corps is fighting to keep its work space in the West Wing.   lobbyists worry their clients will turn up in his Twitter feed. Civil servants, many of them working class, say he knows nothing about running a bureaucracy. “We don’t know exactly what to expect from Trump, except that he’s combative,” said Robert Dallek, a presidential biographer, who has lived here for 20 years. And furthermore, Mr. Dallek complained, “It’s offensive to be called a swamp. ” At their core, Washington and its   suburbs are company towns, populated by people who live and breathe policy and politics, or work in the sprawling federal bureaucracy. The region is “one of the largest and wealthiest economies in the world,” the Brookings Institution recently reported  —   one reason much of America, which suffered greatly during the recession, resents those in the capital. But like the rest of America, Washington is also a real place, with real people, who have lived here for decades. The permanent occupants of “the swamp” see presidents come, and see them go. And no matter what their politics, people agree with Mr. Feehery that this transition “feels different” from any in recent memory. Ms. Harris is an archetypical northwest Washingtonian. A   policy wonk, she grew up somewhere else, Atlanta, and got a taste of politics as a student. When Jimmy Carter won the presidency, she was in the unusual position of being 26 and knowing a lot of powerful people here. She attended law school at Georgetown, married a doctor and raised a daughter and a son. Now semiretired, she used to run the Center for Democracy and Technology, which advocates internet freedom. She has often worked with Republicans they are her friends. But when Mr. Trump was elected, suddenly America’s divisions hit home. When Mike Pence, the vice   rented a house nearby, his neighbors decorated their homes with gay pride rainbow flags. When a white supremacist group hosted a dinner at a nearby Italian restaurant, Maggiano’s, protests erupted outside. Then Comet Ping Pong, a pizzeria where Ms. Harris takes her grandchildren, was targeted by a fake news story involving Mrs. Clinton. Ms. Harris, savvy about the media, organized community support. Soon after, a gunman turned up at the restaurant and fired shots inside. “It was beyond my imagination,” she said. Just over the Maryland line, Takoma Park is a “sanctuary city,” which refuses to prosecute undocumented immigrants. Mr. Trump does not look kindly on that. Days after the election, Ms. Bloch, 55, the organizer, helped pull together Takoma Park Mobilization, a new   group aimed at “standing up for our neighbors,” she said. More than 500 people attended the first meeting. They have since divided themselves into committees and subcommittees, with titles like “Immigration” and “Women” and “Civil Rights,” and have been holding weeknight meetings in the firehouse and the airy historical society headquarters, next door to Bikram Yoga and down the street from the food  . Next up: sessions aimed at liberal civil servants agonizing about whether to quit their jobs. “It may be better for us for people to stay,” Ms. Bloch said, “and figure out how to resist within the system. ” In northeast Washington, a heavily   quadrant of the city, such discussions seemed ludicrous people there don’t plan to protest. They just want to stay out of harm’s way. On a snowy Saturday morning at Perfection Unisex Salon, the stylist Chante Watts, 37, urged some of her clients, who are teachers, to come in for cuts on Inauguration Day. They all intend to stay home. She was running a hot comb through the hair of Chris Vera, who helped explain why. Ms. Vera, 32 and a city employee, has been asked to help with the inaugural she fears violence will erupt that day. “Nobody wants to be within a   radius,” she said. “Nobody’s feeling quite safe. ” Yet in the Virginia suburb of Fredericksburg, about an hour’s drive from here and home to many military people and religious conservatives, Tina Whittington, vice president of an   group, has noticed a pickup in home building. “I think there is huge anticipation that this transition is going to be good for our community,” she said, though she confessed that even there, in the heart of Trump country, the feeling is “still a little apprehensive, wait and see. ” In transitions past, Washington has filled with talk of Georgetown parties and the first lady’s ball gown, and how the city’s culture might change. When President Carter left, the capital traded a Georgia peanut farmer and   nuclear engineer for an actor turned politician from California, Ronald Reagan. Bill Clinton brought a touch of Arkansas. George W. Bush ushered in Texas swagger and cowboy boots, and made McLean, where General Hayden lives, the hot neighborhood for that era’s Republican elite. The Obamas honored Stevie Wonder at the White House, and brought in   art and culture. They made the city, where blacks now account for 49 percent of the population  —   down from 60 percent in 2000, a decline that reflects gentrification  —   their own. In black neighborhoods, Michelle Obama will be missed, perhaps more than her husband. (They are not going far. They have rented a lavish home in Kalorama, an exclusive section of the city where Mr. Trump’s daughter Ivanka and her husband, Jared Kushner, will also live.) But with his wife, Melania, and son Barron keeping their primary residence at Trump Tower at least until the school year is out, Mr. Trump may not be spending much time here. That is fine with Mark Salter, a former aide to Senator John McCain, Republican of Arizona, who is Mr. Trump’s nemesis on Capitol Hill. “The less he’s here the better, as far as I’m concerned,” Mr. Salter said. Movement conservatives, though, are ecstatic. After eight years in the policy wilderness, scholars at the Heritage Foundation, a policy organization, are helping guide the new Trump administration on ideas and personnel. “Folks were pretty happy,” said Wesley Denton, the Heritage spokesman, when Mr. Trump gave them a   during his recent news conference. But in Democratic policy circles there is little lightness this time around. Neera Tanden, a former adviser and strong ally of Mrs. Clinton, has little patience for questions about the city’s mood. She now leads the Center for American Progress, a leading progressive think tank, a job that makes her a de facto leader of the Democratic resistance. “He’s going to deport undocumented people,” she wrote in an email. “How Washington responds is low on the totem pole of problems with this administration. ” The unease runs especially deep among those General Hayden calls “Republican internationalists,” who advocate engagement with other nations but possess a hawkish suspicion of Russian and Chinese intentions. Having described Mr. Trump as Russia’s “useful fool” on the opinion page of The Washington Post, the general, 71, would never be offered a job. But with Mr. Trump openly questioning the “high confidence judgment” by the C. I. A. about Russian hacking, he has been entertaining a steady stream of visitors wary of joining the new administration. “I say, ‘Yeah, by all means, if the   asks you to serve, consider it seriously,’ ’’ he said. “But don’t think of it as a lifetime commitment you remain a free agent. ’’ If there is a historical parallel to this moment, it may be to President Reagan, said Kenneth M. Duberstein, a former Reagan chief of staff. He recalled how liberal Reagan critics sniffed, “How do you trust this actor with his finger on the nuclear trigger?” conveniently forgetting he had been a   governor of California. (Mr. Trump, by contrast, has never held public office.) And if the denizens of the swamp appear to be in some kind of defensive crouch, Mr. Duberstein says, there is perhaps good reason for that: “Donald is saying there’s a new sheriff in town. ”'"}, "time": 1742564568.201275}