{"duration": 0.06591486930847168, "input_args": {"text": "'Dateline: Posted By On November 4, 2016 ABOVE: Cover of a 1947 Anti-Communist propaganda comic. (Wikimedia Commons / Catechetical Guild) The attacks on the planet, civil liberties and human rights are at the core of the American profit-driven, hierarchically-based governing system. While the ultra-rich keep prospering, large swaths of the population are disenfranchised. The tenures of Republican President Ronald Reagan and Democratic President Bill Clinton largely fortified and accelerated these assaults, exemplifying the bipartisan collusion of the elites against regular Americans. Much has been written about the unprecedented inequality in the United States. An additional marker of a society in crisis is the status of the mental health of its population [10] . With policies that have led to the privatization of prisons and health care, the deregulation of an already privatized pharmaceutical industry and a defunding of public mental health clinics, the nation is currently plagued by a mental health crisis that is reflected in a devastating heroin epidemic. But how can a system maintain legitimacy while riddled with such gross corruption and inequality? State means of control T he modern state relies on several techniques to control its populace. Data emanating from research in social psychology, linguistics and behavioral neuroscience has coalesced into a grasp of the workings of the human mind, and how it can be manipulated, i.e. the science of propaganda. This knowledge can be used by commercial corporations to encourage consumption of their products, and is often employed by the state as a means to present a convincing alternative truth, when the real truth is deemed inadequate. Whether it is to promote racism and scapegoating, war or the virtues of a particular politician, the techniques are the same: present biased or partial information to the public to promote a political cause and/or to divert attention from failings that have led to injustice and are likely to rouse dissent that would threaten the regime. In America as in many other parts of the world anticommunist propaganda is embedded in solid, media cultivated ignorance. The anticommunist brainwash afflicting a huge section of the American population produces displays like this—a complete inversion of truth. Here, the Right —playing on the hatreds and fears of the white underclass—proclaims Obama, a loyal servant of Wall Street and the reigning plutocracy, a sneaky communist. Only the dumbest and most confused of the population can believe that, and yet though mass propaganda, a substantive segment of the population believes such idiocies. But propaganda does not work on everybody. Some people see past the lies and distortions and are either complicit or discontent with the status quo. The latter are either victims of state repression that cannot be ignored or explained away, or intellectuals who study the mechanisms of state repression and propaganda. In order to quell these dissidents, the state enacts policies of surveillance, scapegoating, and criminalization that may lead to incarceration or even assassination. A useful way of assessing the legitimacy of a democratically-elected regime is to examine the extent to which it relies on propaganda to maintain control. It is clear that with growing injustice comes more dissent, which forces the state to either confront the roots of injustice or increase its propaganda to subdue the populace. The militarization of American police forces signifies an acknowledgement of the limitations of repression by propaganda and a shift by the state toward reliance on traditional violence for control. Red-baiting: Then and now One infamous American propaganda campaign was red-baiting, which reached its zenith during the term of Senator Joseph McCarthy in the 1950s. Red-baiting served the American profit-driven capitalist state well, as any persons categorized as communists/socialists, i.e. advocates for worker rights, were silenced in one way or another. It is no coincidence that Hillary Clinton’s campaign has been recently ramping up the use of anti-Russian rhetoric [11] , a close relative of red-baiting. This form of propaganda evokes visceral fear reactions in Americans, who share a collective memory of its disastrous effects on individuals and society during the cold war. Fear typically drives people to seek guidance and protection from a strong man/woman. Currently, it is meant to prepare Americans for the possibility of confrontation with Russia and to divert attention from the incriminating information that WikiLeaks is releasing about Hillary Clinton and her shady dealings. In just a few days, the highly stratified American society of 2016, in which lying is idealized [12] , truth-telling villainized [13] , and selfishness hailed as a virtue [14] will choose its next President, which will likely be one of two of the most unpopular candidates ever to run for President. It is evident that in any scenario, Americans can expect a bombardment of propaganda aimed at frightening and rupturing attempts at creating democratic collectives that may serve as alternatives to the corporate state. As the events at Standing Rock Sioux demonstrate well, when traditional propaganda fails, the state will resort to violent repression. SIDEBAR Anti-communist propaganda has always been crude, grotesquely dishonest and unceasing. Here’s a sampler, from around the world as the ruling classes of Britain, Germany, France and other nations made sure their populations did not entertain notions of actual equality. Article printed from MyMPN: http://www.mintpressnews.com/MyMPN URL to article: http://www.mintpressnews.com/MyMPN/election-2016-the-rise-of-propaganda-in-america/ PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP CLICK HERE ABOUT THE AUTHOR YOAV LITVIN IS A NEW YORK-BASED PHOTOGRAPHER AND WRITER. IN HIS WORK, HE IS INTERESTED IN PROMOTING CREATIVE AND PROGRESSIVE CAUSES WITH A FOCUS ON DOCUMENTING URBAN CULTURE, ARTS AND PEOPLES. Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. \\nWhat will it take to bring America to live according to its own propaganda? =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742628441.2202265}