{"duration": 0.03192496299743652, "input_args": {"text": "'Email Print It’s no secret that Obama and his puppets are doing everything they possibly can to rig the election against Trump. Positive Trump polls are coming all the time, so it’s all hands on deck from the Democrats to do whatever it takes to hand the election to Hillary. Obama’s latest move involves registering immigrant voters who will most likely be voting for Hillary in November and he’s spent TONS of your taxpayer money doing it. From Judicial Watch : Months after the Obama administration spent $19 million to register new immigrant voters that will likely support Democrats in November, it’s dedicating an additional $10 million in a final push as the presidential election approaches. The money is distributed by U.S. Citizenship and Immigration Services (USCIS), the Homeland Security agency that oversees lawful immigration, to organizations that help enhance pathways to naturalization by offering immigrants free citizenship instruction, English, U.S. history and civics courses. Officially, they’re known as “citizenship integration grants.”[…] Judicial Watch went on to say… The Department of Homeland Security (DHS) has been aggressive in promoting its citizen integration grant program this year, offering large sums to recruit new groups that can offer immigrants the services they need to become citizens. Clearly, the ultimate goal is qualifying as many immigrants as possible to vote since they tend to cast ballots for Democrats. “We intend to award about $1 million to first-time recipients in the Citizenship and Integration Grant Program for fiscal year 2016,” the agency’s grant announcement states. “If you represent one of these organizations, or know of an interested organization, we strongly encourage that organization to consider applying. Additionally, another $9 million will fund programs that provide both citizenship instruction and instruction and naturalization application services.” Some might consider this a cash giveaway.[…] Practically every federal agency is participating in the effort by contributing resources and creating programs to help immigrants. For example the Department of Labor (DOL) is implementing “new workforce programs” for the “new Americans” and the Department of Education is promoting “funding opportunities” to assure that the immigrants “are provided the tools they need to succeed.” The Department of Health and Human Services (HHS) is collaborating with other agencies to release a career and credentialing toolkit on “immigrant-focused career-pathways programs.” The Department of Justice (DOJ) and USCIS are making sure the new Americans have worker rights and protections and the Department of Housing and Urban Development (HUD) is launching a two-year pilot to assure that non English speakers have “meaningful access to housing programs” subsidized by American taxpayers. Obama likes to pretend that he’s doing this for the greater good of America, but the truth is it’s just part of the overall agenda to do whatever it takes to make sure Democrats run Washington and continue to drive our country into the ground. SHARE this on Facebook below…America needs to know! Join us on Facebook to Stop The Takeover. Click on the button to subscribe. Leave a comment... '"}, "time": 1742628605.8540053}