{"duration": 0.13036251068115234, "input_args": {"text": "'Many believe burglaries are crimes that occur out of desperation, but this isn’t always the case. In fact, the motivation that drives many criminals is simply opportunity. Such is the case for why home break-ins occur around Christmas time while homeowners are away at work. All a criminal needs to do is make a quick entry, grab all the gifts perfectly surrounded by a Christmas tree and they are out the door faster than you can blink. Here are some facts to gain a better perspective on what you are facing:\\nAccording to the U.S. Department of Justice, every 15 seconds a home in America is burglarized and the homeowner typically suffers a loss of nearly $2,000 in stolen goods or property damage. Most burglaries take place between 10:00 a.m. and 3:00 p.m. The majority of break-ins are committed by burglars who live nearby. Burglars tend to avoid homes with security systems. Most criminals can burglarize a home in less than ten minutes. Almost 30% of burglars enter a home through an unlocked door or window. An astonishing 34% of burglars enter through the front door. Burglars usually go to the master bedroom first. The average property dollar loss per burglary is a staggering $2,251. Someone is home during nearly three out of every ten burglaries. Only 13.6% of burglaries in 2014 resulted in arrests. Given these startling statistics, break-ins can be avoided altogether by using common sense and mindfulness. Here are some simple security measures to take to ensure your home stays out of the watchful eye of an intruder.\\n1. Keep security layers in mind Having security layers in place is the best possible preventative measures to deter possible criminals from marking your home as an easy target. These security layers will advertise to intruders that they should avoid your home altogether. Designing a home defense system that includes multiple security layers is a proactive way to protect your home, family, and belongings. Fortunately, there are plenty of tools at your disposal for keeping your property safe. Most of them cost significantly less than an alarm system, and all together can provide several layers of security to your home. Below are seven awesome tools for keeping your place safe during the holiday season. These affordable items are a great start to beefing up your home security.\\nDoor club Wireless LED spotlight Fake TV burglar deterrent Digital lamp timers Sentry security bolt safe Hidden safes Security system Curtains and/or blinds on windows Use a wooden dowel on sliding doors and windows Read more about these \\n2. Keep security supplies near vulnerable areas Those that are preparedness-minded are always vigilant about ensuring the safety of their family members. In that same vein, children should know the basics of the family emergency plan and safety rules like not opening the door to strangers.\\nAs well, having some basic safety/security supplies near the most vulnerable areas of the home (key entry points, garages, etc.) would be advantageous if you find yourself face to face with someone attempting to break-in. For examples, near the entry points in my home, we have a decorative basket that blends into the decor but has items such as flashlights, an emergency whistle, multi-tools and/or a knife. As well, if you do not have children in the home, you can also strategically place a handgun, clips or a non-lethal weapon if you choose. You can strategically place these items near vulnerable spots of the home.\\nThe front door The backdoor The bedroom Living room Another vulnerable part of the home is windows. Burglars love to “window shop”. If you keep your curtains or blinds open, this will give them an opportunity to take a peek into the home. Moreover, if you have picturesque bistro tables and chairs, they can easily be used against you. Criminals will throw them against windows for fast entry. Installing shatter-proof window film on windows will help prevent this.\\nWhile we love a beautifully landscaped yard with shrubs and bushes cut low, this can also make for easy entry into the home. You can add bushes and landscaping to help deter criminals from marking your home. Plants with thorns such as roses, bougainvillea or blackberry bushes are great choices for securing the outer perimeter of the home. At the very least, secure the windows from becoming entry points with window alarms to alert you or your neighbors to a break in.\\nSpeaking of yard and landscaping, how many of you have a ladder that you forgot to bring in? Criminals will look around for tools they can use to gain entry. The second story of a home is typically more lax when it comes to security. If you are guilty of this one, lock up your ladder in your garage.\\n3. Focus on the entry points The most common way for an intruder to get into your home is through the door. Make this your first priority in reinforcing your security. The best method is to install door frame and hinge reinforcements on the front and back doors. This security solution is made of galvanized steel and can prevent single entry door kick-ins and stop intruders before they are inside. Moreover, you might also want to consider installing a deadbolt . Even the strongest reinforced steel door can be neutralized by one swift kick if your lock does not extend deep enough into the door frame.\\nAs well, gaining entry into a garage is another essential entry point to secure. It takes less than six seconds to break into a garage if the criminal knows how. Here are step-by-step instructions on how to prevent this.\\n3. Be aware and know thy neighbors Having a pleasant relationship with neighbors who stay at home is a beneficial relationship to have. They can keep an eye on your home while you are at work and you can reciprocate in a way that helps them out. Knowing who your neighbors are, what type of cars they drive and usually the time they are home, creates a neighborhood that is actively practicing OPSEC and awareness .\\n4. Don’t draw unwelcome attention to your home We typically assume those living around us are respectful of property, but this isn’t always the case. Those living in residential areas bring unwanted attention to themselves when they rid their home of the large boxes marked with brand names or pictures of products. This happens frequently during Christmastime. That new flatscreen television box or video game system packaging will scream, “Come steal me!” to criminals. Be mindful and load up boxes and drop them off at a recycling center. This will reduce the eyes on the prize. As well, boxes are one the easiest items to repurpose . On a personal note, I have broken down boxes and used them to create a lasagna-style garden . This cut down on my trash load and helped me create a more sustainable lifestyle.\\n5. Let there be light! Illuminating the perimeter is single-handedly one of the easiest security measures to take. Simply put, dark or poorly lit areas make it easier for burglars to go unseen. Motion sensing security measures will quickly signal you to trouble if it’s out there. As well, indoor timers for lamps and indoor lighting can help to fool anyone creeping around where they shouldn’t be. Remember, the main goal of burglars is to get in and get out unseen. If they think someone is home, they will think twice before entering.\\nEveryone wants to believe that they are safe and sound when they latch the windows and lock the doors. With the increase in crime, jobless rates, and increased food prices, home break-ins are likely to be on the rise. Take some incentive to review your family preparedness plans and beef up your home security measures! The investment in your home security will pay off for years to come.\\n \\nAdditional Resources: \\nPrepper’s Home Defense: Security Strategies to Protect Your Family by Any Means Necessary \\nThe Prepper’s Blueprint: The Step-By-Step Guide To Help You Through Any Disaster \\nHome Security: Securing the Doors \\nHome Security: Securing the Windows \\n\\nTess Pennington is the author of The Prepper’s Blueprint , a comprehensive guide that uses real-life scenarios to help you prepare for any disaster. Because a crisis rarely stops with a triggering event the aftermath can spiral, having the capacity to cripple our normal ways of life. The well-rounded, multi-layered approach outlined in the Blueprint helps you make sense of a wide array of preparedness concepts through easily digestible action items and supply lists. \\nTess is also the author of the highly rated Prepper’s Cookbook , which helps you to create a plan for stocking, organizing and maintaining a proper emergency food supply and includes over 300 recipes for nutritious, delicious, life-saving meals. \\nVisit her web site at ReadyNutrition.com for an extensive compilation of free information on preparedness, homesteading, and healthy living. \\nThis information has been made available by Ready Nutrition \\nOriginally published November 25th, 2016 10 Cheap Yet Effective Home Security Tips 5 Ways to Better Secure Your Home in an Emergency Seven Great Ways to Keep Your Home Safe for the Holidays They Bound Her Wrists In Duct Tape – What She Did Next… Tips On How To Fortify And Prep Your Home Or Apartment '"}, "time": 1742561884.4288347}