{"duration": 0.05487775802612305, "input_args": {"text": "'Subscribe \\nJohn Pilger did an interview with Assange and is planning to use this material for his next documentary about Wikileaks founder! We are going to report with every major info from this interview in the next few days! Assange once again made an astonishing statement, and he confirmed his statement from a couple of days ago that Wikileaks will release election day bombshell, but also added that they are doing this for a reason! \\nAssange offers several predictions and analyses, most quite revealing. He also hinted that he would expose the whole truth about Hillary on election day! Assange notes the most significant email in an entire load of emails may well be the one in which Hillary (2014) contacts John Podesta. This email states that “the governments of Qatar and Saudi Arabia which are providing clandestine financial and logistic support to ISIL and other radical Sunni groups in the region.” Assange notes that the backing is from “the governments of Saudi Arabia and Qatar.” \\nHowever, he also gave his view about the election day bombshell with surprising statement: \\nWe Are Purposely Holding The Emails Back Until Election Day So They Cannot Have Time To Replace Hillary.” \\nPilger observes,”… ISIL or ISIS is created largely with money from the very people who are giving money to the Clinton Foundation, will the election day bombshell contain similar material .” Assange did not confirm this but just answered that would be very valuable information that could change everything. \\nThe slant of this interview is evident, but that does not make it incorrect. The challenge is to determine, logically and with the information at hand: is there sense and feasibility to Assange’s conclusions?(video below part 1 of the interview) \\nAssange: The Global Elites Will Not Allow Donald Trump To you can read the full article on the following link http://www.usasupreme.com/assange-trump-will-not-global-elites-winvideo/ \\nPosted by USA Supreme on Friday, November 4, 2016 Facebook Comments '"}, "time": 1742561995.2038112}