{"duration": 1.6616387367248535, "input_args": {"text": "'Share on Facebook Tweet Short stories told by water protectors at Standing Rock, North Dakota. Part 1 - Introduction: Since mid-August 2016, thousands have set up camp near the Standing Rock Sioux Reservation in North Dakota. They stand in opposition to the Dakota Access Pipeline and its planned crossing of the Missouri River. This is the largest gathering of Native Americans in over 100 years. Many plan to make... read more \\nShort stories told by water protectors at Standing Rock, North Dakota. \\nPart 1 - Introduction: Since mid-August 2016, thousands have set up camp near the Standing Rock Sioux Reservation in North Dakota. They stand in opposition to the Dakota Access Pipeline and its planned crossing of the Missouri River. This is the largest gathering of Native Americans in over 100 years. Many plan to make this their home until DAPL is stopped. (4mins) \\nPart 2 - Frank from Standing Rock, ND. \"Tears do heal people. They help you learn. They help you move on.\" (5mins) \\nPart 3 - Helen from Wounded Knee, SD. \"I still couldn\\'t sit there and pray freely, until I had to get up and pick up a gun, and fight for my rights. I fought in Wounded Knee.\" (5mins) \\nPart 4 - Tyger from Gaffney, SC. \"When I was 17 I went into the army. My first unit was the Army Corps of Engineers. And I thought I was fighting for my country. And I was. And now I\\'m fighting for my country again.\" (7mins) \\nPart 5 - Darwyn from Omak, WA. \"Something was telling me... you need to go, you need to go, you need to go.\" (5mins) \\nPart 6 - Audrey De La Rosa from Kayenta, AZ. “If you’re a young able person, your back better be straight. You better be sitting in a position where if you have to get up and start running, you better go. I\\'m here. I\\'m able. As an academic scholar I’ve written my own papers on how social change begins on the reservation… and it’s happening.” (6mins) \\nPart 7 - Alvin C Jacobs Jr from Charlotte, NC. \"I\\'m a photojournalist. This is hard work. I mean, what the hell are we doing out here? Waking up angry. Going to sleep frustrated. Seeing people brutalized. Seeing racism flourish. Seeing people go through a living hell, just for simply existing.\" (6mins) \\nPart 8 - Duane from Standing Rock, ND. \"To understand one another brings unity. We need to share our lives. Without fear. Without judgement. And that will create unity that will be unbreakable.\" (6mins) \\nPart 9 - David from Denver, CO. \"The first interaction that Christopher Columbus had with any Indian on this hemisphere was with the Taíno Nation. Both sides of my family have Taíno blood in them. I say that I am a Boricua before I say that I\\'m a Puerto Rican.\" (5mins) \\nUnless otherwise stated:'"}, "time": 1742564117.4404194}