{"duration": 0.14001083374023438, "input_args": {"text": "'Death stalks Don DeLillo’s characters  —   be it in the form of terrorism, the atomic bomb, assassination, suicide, war, earthquakes, murderous cults or “an airborne toxic event” passing over the landscape “like some death ship in a Norse legend. ” To try to stave off their fear of death, his people compulsively reach for belief systems, drugs, hobbies, organizing principles (from football to mathematical equations to stories) housekeeping rituals  —   anything that might hold the inevitable fact of mortality at bay. “All plots tend to move deathward,” the narrator of “White Noise” says. “This is the nature of plots. Political plots, terrorist plots, lovers’ plots, narrative plots, plots that are part of children’s games. We edge nearer death every time we plot. It is like a contract that all must sign, the plotters as well as those who are the targets of the plot. ” Mr. DeLillo’s haunting new novel, “Zero K”  —   his most persuasive since his astonishing 1997 masterpiece, “Underworld”  —   is a kind of bookend to “White Noise” (1985): somber and coolly futuristic, where that earlier book was satirical and darkly comic. In “Zero K,” two central characters seek to conquer death not by outrunning it but by submitting to it: They plan to be “chemically induced to expire” and frozen at a supersecret cryonics compound so that one day they might be resurrected  —   through a     science involving cellular regeneration and nanotechnology. One day, humans (at least rich ones) will have the option of being reborn as new and improved beings implanted with memories of their choice  —   music, family photographs, philosophical writings, “Russian novels, the films of Bergman, Kubrick, Kurosawa, Tarkovsky. ” “Zero K” gets off to a stilted start  —   with unfortunate echoes of Mr. DeLillo’s recent novels “Point Omega” (2010) “Falling Man” (2007) and “Cosmopolis” (2003) which exchanged his jazzy, tactile feel for contemporary life for strangely stylized, almost abstract musings on identity and fate. A third or so of the way in, however, this new novel kicks into gear as Mr. DeLillo begins to actively use his radar for the incongruities and chimeras of modern life. His story gradually opens outward to examine the ways science and religion have come to clash and converge in a world fearful of terrorism and war and eager to look to technology for solutions, even salvation. At the same time, “Zero K” opens inward to draw a portrait of the narrator Jeffrey’s emotionally fraught relationship with his chilly and controlling father  —   reminiscent of Nick Shay’s filial relationship in “Underworld,” one of the few DeLillo novels to delve beneath the brittle surface of its characters’ lives. At the beginning of “Zero K” Jeffrey is whisked off to a remote compound somewhere vaguely near Kazakhstan, where his billionaire father, Ross, has funded the Convergence project, which freezes and preserves the dead in anticipation of the day when both mind and body can be restored. A special unit called Zero K is for patients who make a conscious decision to “transition to the next level” before their natural deaths. Ross’s beloved wife, Artis, who has several disabling illnesses, has opted for this form of assisted suicide, and Ross, who is perfectly healthy, announces that he intends to accompany Artis on her journey into the afterlife. Jeffrey is understandably perturbed, wondering if his father has been brainwashed into some kind of dangerous cult, or whether his decision is a perverse manifestation, as an immensely wealthy man, of wanting to exert control over his life  —   in this case, by choosing to end it. He realizes that his reaction is complicated by his ambivalent feelings toward his father, who, decades ago, abandoned him and his mother. And that his own alienation (that state of mind shared by so many DeLillo protagonists) has roots in this Oedipal conflict. Mr. DeLillo’s depiction of the Convergence compound will trigger all sorts of associations for the reader. There are labyrinthine hallways with inaccessible rooms behind mysterious doors, reminiscent of those portals that Lewis Carroll’s Alice had difficulty entering in Wonderland. There are also odd, Kafkaesque exchanges with Convergence escorts who speak a New Agey bureaucratese that masks their sinister work and    glimpses of Artis and other patients being groomed for the next stage of their journeys, when their bodies will be placed in superinsulated pods (their brains and other vital organs having already been harvested for separate preservation, like those of Egyptian mummies). If there are echoes in these pages of Stanley Kubrick’s classic 1968 movie, “2001: A Space Odyssey,” Mr. DeLillo’s vision turns out to be considerably darker. He is skeptical of those who might regard human life as a step on an evolutionary ladder between the apes and a futuristic race of star children. In fact, “Zero K” suggests that the hope that technology will supply a solution to the problem of mortality (as religion once did) is both delusional and a dangerous distraction from the here and now. Film footage of natural and   catastrophes play on screens at the Convergence, and its robotlike employees seem to welcome the impending   as a new beginning. All the themes that have animated Mr. DeLillo’s novels over the years are threaded through “Zero K”  —   from the seduction of technology and mass media to the power of money and the fear of chaos. This novel does not possess  —   or aspire toward  —   the symphonic sweep of “Underworld” it’s more like a chamber music piece. But once the novel shakes off its labored start, “Zero K” reminds us of Mr. DeLillo’s almost   powers as a writer and his understanding of the strange, contorted shapes that eternal human concerns (with mortality and time) can take in the new millennium.'"}, "time": 1742562864.0115848}