{"duration": 0.09888553619384766, "input_args": {"text": "'So much media, so little time. Consumers face a dizzying array of entertainment choices that include streaming video such as Amazon Prime Video, Hulu and Netflix cable channels and apps from outlets like HBO and Showtime YouTube and as many as 28, 000 podcasts. With them all offering uncountable hours of addictive programming, how is a listener or viewer supposed to keep up? For some, the answer is speed watching or speed listening  —   taking in the content at accelerated speeds, sometimes two times as fast as normal. While speed viewing does save time  —   devotees say it can save hours over the season of a series  —   others raise concerns that it undermines the rhythm of a production and can dilute some creative elements. Jan Rezab said in an article in Forbes last year that his viewing eventually progressed from 1. 2 times to two times as fast. “As you continue to speed watch, higher speeds get easier and easier to comprehend,” he wrote. “I’ve been speed watching for the last 2 years, and I now feel comfortable watching at 2x the normal viewing speed. ” He watches some even faster. Be prepared to jump through a few hoops if you want to speed up your content, though. While some players make it easy to change your playback speed, others make it more difficult. On YouTube, it lives under settings. On Apple’s native podcast app, it’s right next to the play button, and other podcast players have a similar function. Audible, the major audiobook app, offers the option as well. Netflix, Hulu and HBO, however, don’t offer higher speeds on their players, but there are workarounds available. It’s possible to speed up online video through a Google Chrome extension, and an   media player called VLC will play many formats of digital media. Some   boxes like TiVo allow   playback of recorded programs. It’s not clear how widely the practice has been adopted. In an informal poll on Twitter, David Chen, a host and producer of the movie and television podcast “Slashfilmcast,” asked, “Do you ever listen to podcasts or watch   at a faster speed than intended?” Of 1, 505 responses, 79 percent chose the response “No, it’s an abomination,” while 16 percent said they did so for podcasts, and a total of 5 percent said they did so for films, television and podcasts. On a recent episode of the podcast, Mr. Chen and his   Jeff Cannata and Devindra Hardawar, took up the question of speed viewing. A listener asked, “In this increasingly     world, I wonder, how much of a crime against culture I am committing by speeding through these shows?” The podcast hosts seemed aghast. “How dare you,” Mr. Cannata, said, adding that the practice “cheapens your entertainment. ” Mr. Hardawar said speed viewing did not allow time to soak in what was happening. “I feel like you are not even actually watching it,” he said. “You’re consuming it. You’re not actually like absorbing it or letting it work on you in a creative way. So yeah, this is bad. This is bad. ” Speed viewing waters down the emotional impacts of a movie, Peter Markham, senior    at the American Film Institute Conservatory in Los Angeles, said in an interview last week. “If you were watching a play by Pinter, for example, the pause could carry the greatest meaning,” he said. “I can’t imagine watching a movie at twice the speed. ” Renan L. Borelli, 31, who is director of audience growth and engagement at MTV News and who has a   commute from Park Slope in Brooklyn to the West Village in Manhattan, is a big fan of podcasts. He listens to as many as three or four a day and subscribes to about 30. Mr. Borelli estimated he could save about five to 10 minutes per podcast. “Even if it’s a couple of minutes, it’s a help,” he said in an interview, noting that he has “many gigabytes” of podcasts stored on his phone. Nicholas Quah, who writes Hot Pod, a newsletter about podcasts, said in an email that it was unclear how widespread speed listening was, but that anecdotally, it appeared to be “an established behavior” among   listeners. He said he saw no harm in it. He wrote, “Speed listening might be more offensive to folks who make highly produced, preciously crafted and   podcasts (vs. a loose conversational one, like the Slate gabfests) but what we’re actually confronting here is that tension in the relationship between artist and consumer: Which is more important, the artist intent or the consumer’s preference?” Mr. Chen, of “Slashfilmcast,” said in an email that speed listening was a consumer’s way of saying: “I don’t care how you wanted me to experience this work you’ve created. I just care about the information exchanged. ” Lost are elements of dramatic or comedic timing and intentional silences, he said. “It becomes a fundamentally different experience that disregards what the creator intended” at an accelerated speed, he wrote. He said the practice was like trying to eat twice as many meals as normal to avoid missing any culinary treats. “Sure, you might actually be consuming more, but you’re probably having a worse, more grotesque experience,” he wrote. “And you’re certainly not doing it in a way that the chef intended. ”'"}, "time": 1742564309.3462596}