{"duration": 0.05325508117675781, "input_args": {"text": "'Legendary Green Bay Packers football coach Vince Lombardi taught his players not only about football but lessons about life. “Perfection is not attainable, but if we chase perfection we can catch excellence,” he once instructed his team. [Legendary college basketball coaches Mike Krzyzewski of Duke and Roy Williams of North Carolina teach their players about basketball and offer life lessons too —  like on correct bathroom usage. The two voiced their disdain for the state of North Carolina’s  law that requires people use the bathroom that corresponds to their biological gender in government buildings and   universities.  The law reads, “Public agencies [and local boards of education] shall require every multiple occupancy bathroom or changing facility to be designated for and only used by persons based on their biological sex. ” As a result of the Tar Heel state’s legislation, the NCAA pulled the University of North Carolina as a venue for the popular March Madness tournament for 2017. Coach Williams explained to USA Today his contempt for the law and the state’s unwillingness to repeal it, saying, “I’m very sad, very disappointed about the whole thing, which apparently is something that’s really, really hard to change. ” Coach K preached his words of wisdom on March Bathroom Madness while criticizing his home state and complimenting NCAA replacement venue, Greenville, South Carolina. “They have the right to host it whether our state is smart enough to have it,” he said. “It shouldn’t be a contest of one against another. “It would be nice if our state got as smart and also would host not just basketball tournaments but concerts and other NCAA events. But maybe we’ll get there in the next century, I don’t know. We’ll see. “Look, it’s a stupid thing. That’s my political statement. If I was president or governor I’d get rid of it. And I’d back up my promises. As unusual as that might be. Anyway, I don’t want to get too political. ” South Carolina knows well the ramifications of the NCAA’s political agenda. For fourteen years the home state of Fort Sumpter, where soldiers fired the first shots of the Civil War, were denied hosting the premier NCAA basketball tournament for flying the Confederate flag on the capitol grounds. In July 2015   Nicky Halley ordered the flag removed. '"}, "time": 1742562879.4970722}