{"duration": 0.04350876808166504, "input_args": {"text": "'A group of military veterans protested at a private Massachusetts college over the weekend, objecting to a decision by the college to allow the American flag to be removed from its main flagpole, and adding their voices to a debate on a campus that has seen the flag lowered, removed and even burned since the election. Organizers estimated that 400 people attended the veterans’ protest on Sunday afternoon at Hampshire College in Amherst, billed as a “peaceful demonstration of freedom” and “a show of solidarity and respect” for the flag and for veterans. Video taken at the event by Derek Cloutier, 34, a Marine veteran and a founder of the New England Veterans Alliance, showed American flags being waved on a campus green as protesters chanted “raise our flag. ” “It’s really two demographics clashing in a sense,” Mr. Cloutier said in a phone interview on Monday. “There are people that have family that have served or are veterans themselves, and then you have people who might not have anyone in their lives who might have served or don’t know anyone like that. ” Students at Hampshire had lowered the flag to   on Nov. 9, in a “reaction to the toxic tone of the monthslong election,” the college said in a statement. The following day, it said, officials decided to allow the flag to remain lowered for a period of time while students and faculty members at the college discussed and confronted “deeply held beliefs about what the flag represents to the members of our campus community. ” Some on campus perceived the flag as “a powerful symbol of fear they’ve felt all their lives because they grew up in marginalized communities, never feeling safe,” the college’s president, Jonathan Lash, said in a statement. Sometime the evening of Nov. 10 or in the early morning on Nov. 11, the flag was burned, an episode that campus police are still investigating. The flag was immediately replaced, and the college’s board of trustees voted to continue to fly it at   “to mourn deaths from violence in the U. S. and around the world,” it said in an email. “If it was a political act, it was pretty craven and ineffective since people did it in secret and no one knows what it was meant to state,” Mr. Lash, 71, said in a phone interview on Monday. “And we replaced the flag the next day. ” But within a week Mr. Lash had sent an email announcing that the flag was to be taken down altogether, noting that “some have perceived the action of lowering the flag as a commentary on the results of the presidential election. This, unequivocally, was not our intent. ” He added that there was not a campuswide ban on the flag, as had been mistakenly reported. Mr. Cloutier, who served in Falluja, Iraq, in 2006, said that he initially found the college’s decision to fly the flag at   “disturbing. ” “To us who have been there and have friends that have died, it’s like a spit in the face to us,” he said. “It’s disrespectful for the college to blatantly do that without even considering the effect on veterans and people who have respect for the flag. ” Mr. Cloutier characterized the protest as fun and patriotic, and after attending it, he said, he thought more about the differing perspectives between the veterans and some students. Mr. Lash, whose father was an Army officer in the Pacific during World War II, became the president of Hampshire six years ago. He said that while he was not initially equipped to understand objections to the flag, his tenure at the private liberal arts college of 1, 400 was slowly teaching him to better understand those grievances. “So something that I have been learning about over the six years but I saw with incredible intensity after the election was the genuineness and depth of the fear of people who have grown up with racism,” he said. “Who look at the deaths on city streets and say, that could easily have been me. ” “For me the flag is still a really positive symbol,” he added. “But I’m coming to be able to maintain both ideas in my heart at the same time. ”'"}, "time": 1742628522.4554145}