{"duration": 0.08161067962646484, "input_args": {"text": "'October 29, 2016 \\nTo most men, it is a simple daily routine that they barely think of. Spraying fresh white foam over their face and taking it off with a 28-blade razor – how utterly ordinary. \\nBut for Omar, an intelligent, fit, and attractive 22-year-old young man, shaving off his beard is a remarkable act of freedom. Because Omar has been living under one of the most oppressive regimes the world has ever seen. At last, that regime is on the verge of being broken and Hoxton will soon be free of the Hipster State. \\nAs the forces of reason, justice and sanity close in on Hoxton, Dalston and trendy Whitechapel, Omar is one of the first young people to benefit. \\n“It has been hell,” he said. “The hipsters began moving in during the 80s on a wave of Acid Jazz and beer with lemons in the neck of the bottle. Of course, I was not even born then. But by the time I was, Hoxton was drowning in hipsters with their artisan small furniture manufacturers, silk-screened candle warehouses and eventually, internet start-ups.” \\nOmar was terrified of the fashion police, who beat up one of his friends for wearing the wrong shade of burgundy retro Farahs. So like everyone else in the area, he grew a beard. Omar was only nine at the time: he has suffered 13 years of facial hair, Adidas Stan Smith trainers and feigning an interest in stunt kites. “It has been hell,” he said. \\nBut the first signs of liberation arrived with a girl bravely walking through the streets without a tattoo. She was dragged away and quickly inked with an image of the logo from Moog synthesisers. But soon more followed her, bravely flaunting their unadorned skins. Known as “cleans”, they were at the vanguard of the forces of sanity. Then Greggs opened a branch in Hoxton High Street and more normal people arrived to eat its hand-finished non-craft pies. The final straw was a pub which didn’t have a trendy name and did not brew its own beer. Faced with the uncowered march of normality, hipsterism began to capitulate. \\nWhile there is still a bearded rump of diehards, they are being rounded up and shot or made to become drones at Amazon’s HQ, and trendy East London is on the way to becoming an ordinary part of the world once more. Immacagain'"}, "time": 1742561737.236661}