{"duration": 0.060900211334228516, "input_args": {"text": "'Subscribe \\nA dumbfounded Canadian — Richard Brunt of Victoria, British Columbia — wrote an open letter to Americans who don’t seem to realize how very good we actually have it. This image doesn’t need a lot of commentary, so I’ll let you just read it and allow it to sink in. \\nThis has gone completely viral over the last few days and it needs to. \\nTranscribed: Many of us Canadians are confused by the U.S. midterm elections. Consider, right now in America, corporate profits are at record highs, the country’s adding 200,000 jobs per month, unemployment is below 6%, U.S. gross national product growth is the best of the Organization for Economic Cooperation and Development (OECD) countries. The dollar is at its strongest levels in years, the stock market is near record highs, gasoline prices are falling, there’s no inflation, interest rates are the lowest in 30 years, U.S. oil imports are declining, U.S. oil production is rapidly increasing, the deficit is rapidly declining, and the wealthy are still making astonishing amounts of money. America is leading the world once again and respected internationally ? in sharp contrast to the Bush years. Obama brought soldiers home from Iraq and killed Osama bin Laden. So, Americans vote for the party that got you into the mess that Obama just dug you out of? This defies reason. When you are done with Obama, could you send him our way? Richard Brunt Victoria, British Columbia About Tiffany Willis \\nTiffany Willis is a fifth-generation Texan, a proponent of voluntary simplicity, a single mom, and the founder and editor-in-chief of Liberal America. An unapologetic member of the Christian Left, she has spent most of her career actively working with “the least of these\" -- disadvantaged and oppressed populations, the elderly, people living in poverty, at-risk youth, and unemployed people. She is a Certified Workforce Expert with the National Workforce Institute , a NAWDP Certified Workforce Development Professional, and a certified instructor for Franklin Covey\\'s 7 Habits of Highly Effective Teens . Follow her on Twitter , Facebook , or LinkedIn . She also has a grossly neglected personal blog , a Time Travel blog , a site dedicated to encouraging people to read classic literature 15 minutes a day , and a literary quotes blog that is a labor of love . Find her somewhere and join the discussion. Click here to buy Tiff a mojito. Connect'"}, "time": 1742561812.9257376}