{"duration": 0.06714105606079102, "input_args": {"text": "'A national sport in Russia. Habibah Agianda, Creative Common s \\nWhy are the Russians Exposing their Pre Election Links with the Trump Campaign? \\n(Washington, DC) A senior Russian diplomat announced that the Russian government had ongoing ties to the presidential campaign of Donald J. Trump. \\nA centerpiece of the Clinton presidential campaign was Russian interference with the 2016 United States election. From charges that Russians hacked the Democratic National Committee email server to horror show claims that the Russians would somehow hack election voting machines, Clinton and her cadre were clear about the threat posed by Russia. In addition, there were charges that Trump had ties to Russian oligarchs as a source for business funding. Worst of all, there was the general claim that somehow Donald Trump was under the sway of Russian President Vladimir Putin, who rose to power through the Russian intelligence apparatus known as the KGB. \\nThe U.S. mainstream media supported the Clinton campaign charges. In late September, ABC investigative reporters ran a detailed article about the “hundreds of millions of dollar” in investments Trump has received from Russian businessmen. The Daily Beast ran a comprehensive four part series on consecutive days starting on November 3. The series outlined Trump’s alleged role as a useful idiot for Putin and business entaglements exposing him to Russian influence (parts one , two , three , and four ). The series culminated with a description of former Trump campaign chairman Paul Manefort’s ties to the deposed pro Russian president of Ukraine, Viktor Yanukovich. \\nTrump denied “any relationship with Vladimir Putin” and any influence due to business conducted with Russian business interests. Trump surrogates denied any Russian influence and countered with charges that as Secretary of State, Hillary Clinton gave a sweetheart deal to Russian oligarchs in return for donations to the Clinton Foundation. \\nThe lines seem clearly drawn. The Clinton storyline argues that Trump endorses policies favored by Russia likely in return for financial and mind control influence by Putin and Russian business interests. \\nWhy did the Russian’s give credence to the Clinton campaign charges? \\nThe Washington Post headlined a story on November 10 about a statement by senior Russian diplomat, Sergei Ryabkov: \\n“Obviously, we know most of the people from his [Trump’s] entourage,” Ryabkov said. \\n“We have just begun to consider ways of building dialogue with the future Donald Trump administration and channels we will be using for those purposes,” Ryabkov was quoted as saying. \\nRyabkov provided no further details, and his remarks drew a swift denial from Trump spokeswoman Hope Hicks, who said the campaign had “no contact with Russian officials” before Tuesday’s election. Washington Post, November 10 \\nFor just a moment, let’s assume the veracity of the Clinton campaign and mainstream media claims of Russian influence on the Trump campaign. Why would the Russians go out of their way to admit this? Why would the Deputy Foreign Minister, of all the possible Russian sources, provide this information? \\nEven a cursory review of Russian diplomacy over the past several years demonstrates a high degree of discipline and caution. Unlike the U.S. government, the Russians speak with one voice. Russian diplomatic efforts are couched in international law. President Putin, Foreign Minister Sergey Lavrov, and other Russian diplomats are precise in their language and proposals. They don’t shoot from the hip. This may be difficult to grasp for the politically motivated Clinton campaign and media sources that benefit from demonizing Putin but these are the facts nevertheless. \\nThis statement by Deputy Foreign Minister Ryabkov was no accident. His remarks clearly opened the way for speculation that the Trump campaign was somehow in collusion with Moscow. Ryabkov’s claim that these were routine contacts is an explanation without an audience. \\nOf special interest is the timing of the reported contacts with Trump. The Russians didn’t respond to allegations of contact. They announced the relationship with the Trump campaign. They also announced that a similar offer of contact to the Clinton effort was turned down. \\nWhy did the Russian’s initiate this announcement knowing it could hurt Trump at a critical post election juncture? He’s losing the popular vote and demonstrations are emerging all over the country protesting his policies. The New York Times estimates a 1.2% popular vote victory by Clinton when all the votes are tabulated. Trump will be subjected to the battle accusation of imposing extreme changes in policy based on a minority mandate. \\nWhy would Russia deliberately release this information? \\nThe information is potentially devastating to Trump’s legitimacy as the new president. The Post story is showing up in major national and regional media outlets. \\nGiven the calculated, mistake-free style of Russian diplomacy, how do we interpret this outcome in light of the supposed capture of Trump as a tool of the Russian government?'"}, "time": 1742628400.4820316}