{"duration": 0.030391931533813477, "input_args": {"text": "'Whiten Your Face By Using One Ingredient Wrinkles Will Disappear Ξ [November 2, 2016] BLOG “Mommy am I Going To Die?” Mom Calls 911 For Paramedic, Cop Shows Up, Shoots 4 Year Old Daughter posted by Eddie A mother’s attempt to get medical help for a cut on her arm turned into a nightmare after a trigger happy cop showed up. The dramatic 9-1-1 recordings were just published, detailing this insane incident that happened back in June. The nightmare began after Andrea Ellis had cut her arm on some glass and her sister dialed 9-1-1 for medical help. “She’s bleeding all over the place!” her sister said in the call. “I need a paramedic!” As she was on the call, her sister saw a police officer nearby and called him over for help. “Sir, can you get me a paramedic?! I need a paramedic here!” she said. According to the report by Inside Edition: But as the cop approached the house , events took a horrific turn. Cops said the family pet – a boxer terrier mix named Patches, charged at the officer. The cop fired his gun, and the bullet hit Andrea’s four-year-old daughter, Ava, in the leg, shattering the bone. “She asked me several times, ‘Mommy, am I gonna die?’” Andrea Ellis told INSIDE EDITION. The next 9-1-1 call would come from Ellis’ neighbor to report the cop shooting a child. “ My neighbor across the street had an officer at her door and she’s screaming that he shot a child,” said the neighbor. “They had started to cut her pants off her and I just see blood everywhere,” her mother said, describing the horrific scene. Luckily, the bullet didn’t hit Ava a few inches higher in the stomach, which could’ve proved fatal . The shot did, however, shatter her bone. The officer involved has not been disciplined , but the Columbus police department assures the public that the incident is under investigation. Source:'"}, "time": 1742562255.271409}