{"duration": 0.08771944046020508, "input_args": {"text": "'VIDEOS Citizens in these 3 US states took action on water fluoridation bans In the spring of 2015, the U.S. government lowered fluoride levels in drinking water for the first time in 50 years By Julie Fidler - Thursday, November 17, 2016 11:17 AM EST \\nVoters in Kennebunk, Kennebunkport, and Wells Water District in Maine; Healdsburg, California (Sonoma County); and Greenville, Texas went to the polls on November 8 to voice their views on whether to ban fluoride in their drinking water . \\nFluoride was added to the U.S. water supply purportedly to ward off cavities . However, some research does suggest that water fluoridation does nothing to improve dental health . In fact, countries with fluoridated water do not have less tooth decay than non-fluoridated countries. [1] \\nFurthermore, about 40% of American teens show signs of fluoride over-exposure, or dental fluorosis . Fluorosis is a tooth enamel defect that makes the teeth look like they are covered in cloudy spots and streaks. In more severe cases, fluorosis results in brown stains and tooth erosion. \\nNobody wants to get their teeth drilled or have a root canal, but the health risks associated with fluoride are far worse than holes in your teeth: Arthritis Thyroid disease Acute toxicity \\nIn the spring of 2015, the U.S. government lowered fluoride levels in drinking water for the first time in 50 years, after researchers at Harvard University and other institutions found that exposure to high levels of fluoride can cause numerous health problems and lower IQ. \\nLet’s take a look at how these communities voted. Maine \\nResidents of 7 towns – Kennebunk, Kennebunkport, Wells, Ogunquit, Arundel and parts of Biddeford and York – voted to stop treating drinking water with fluoride . All of the communities get their drinking water from the Wells Water District. [2] \\nDistrict superintendent Norm Labbe said in a statement: “The Water District is pleased with the outcome of the fluoride referendum. It’s evident that the voting public is now more informed about the subject than they were back in 2002, when fluoridation was voted in. The water district thanks the Campaign to Reconsider Water Fluoridation volunteers and in particular the voters for their knowledgeable decision to cease the addition of fluoride to our water. We look forward to staying true to our mission of providing the highest quality of water at the lowest reasonable cost.” The ballot referendum was the work of the Campaign to Reconsider Fluoride, a small group of concerned residents who are concerned that water fluoridation equates to mass-medicating and over-fluoridation. \\nThe water district started adding fluoride to water in 2004 as part of a 2002 referendum. Healdsburg, Sonoma County \\nIt was a different story in Healdsburg, California. \\nFor the 2nd time in 2 years, residents there appeared to vote down a measure to remove fluoride from city drinking water. The vote has yet to be finalized, but as of November 9, Measure T was failing, 59% to 41%. [3] \\nShawn Widick, a Healdsburg dentists running the No on Measure T campaign, said: “I’m pretty ecstatic the citizens got it right again. It’s ridiculous because it’s a public health issue and such a benefit to our community. We shouldn’t have to be dealing with this again.” \\nMeasure T called for a moratorium on adding fluoride to city water until the manufacturer could prove it was “safe and effective.” Fluoride has been added to Healdsburg water for the last 60 years. \\nFluoride opponents rejected a similar measure in 2014 by a majority 66%. \\nAbout 2/3 of Californians have fluoridated water. Greenville, Texas \\nThe Greenville City Council voted to affirm an earlier decision to resume fluoridating the local water supply , despite several people speaking out against the practice. One of the opponents was Kory Watkins, who argued the measure was an unconstitutional violation of individual rights . [4] \\nHe said: “Fluoride is poisonous. If you ingest too much of it, it is going to be a problem. There is no control. There is no doctor looking over the dose of the medication.” \\nGreenville stopped fluoridating its water in September 2013 after it was determined that fluoridation was causing too much wear and tear on equipment.'"}, "time": 1742562860.943229}