{"duration": 0.08844685554504395, "input_args": {"text": "'Anna Jaunger Correspondent, Inside Syria Media Center R ecently, the White House has repeatedly accused Syria and its allies of killing civilians in Aleppo, deliberate airstrikes at civilian infrastructure and so on. But it should be mentioned that usually these allegations are completely baseless. Ironically, in the midst of this immense uproar about the cruelty of the Syrian government and its Russian allies, Washington keeps carrying out notorious military ops resulting in casualties not among terrorists but mostly among civilians. \\nOn October 25, Amnesty International published a statement according to which in the space of two years at least 300 people were killed by the US-led coalition’s airstrikes. \\nLynn Maalouf, Deputy Director at Amnesty International’s Beirut regional office, stated that analysis of available evidence suggests that in each of these cases, Coalition forces failed to take adequate precautions to minimize harm to civilians and damage to civilian targets. \\nDespite the fact that AI bases its assessments on the data received from Syrian human rights organizations, local monitoring organizations and satellite images and footage, an AI expert, Neil Sammonds, claimed that it was just statistics, and that there might be many more casualties. \\nAlthough John Kerry commented on the report, the US isn’t accustomed to recognizing its “mistakes”. For instance, the airstrike e.g. bloodbath, conducted by the US-led coalition against government troops in Deir Ezzor in mid-September. After numerous excuses and denials, Washington eventually claimed then that it was a mistake. This “mistake” looked rather suspicious as ISIS militants started their offensive towards the Syrian army position immediately after the airstrikes. M oreover, Lieutenant General Stephen J. Townsend, the commander of Operation Inherent Resolve, has admitted that due to the Command’s strategic mistakes by Iraq’s troops and their US-backed allies they still haven’t been able to surround and block Mosul. Unfortunately, these “accidental” lapses allow the terrorists to freely leave the city and penetrate Syria. Of course, this development entails the creation of new flashpoints in the country, with further endangerment of the lives of civilians.\\nIt bears repeating that in Mosul the US-led coalition is doing the same things that Washington now is trying to blame Damascus and its allies for. Only in the last three days, the coalition airstrikes have killed 60 civilians. Just since October 21, US warplanes conducted an airstrike against a school in the south of Mosul, and the next day attacked residential neighborhoods in the east of the city, and on October 23, air strikes destroyed a house of civilians in northern Mosul. \\nThus, it is clear that the United States, while claiming it is fiercely fighting terrorists in the Middle East, a claim heavily disseminated throughout its corporate media, it is in actuality doing the opposite, while preparing more devious mayhem and endless chaos in these tormented nations. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP INSTALLATION Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week. ALL CAPTIONS AND PULL-QUOTES BY THE EDITORS, NOT THE AUTHORS. Print this post if you want. Share This:'"}, "time": 1742563595.9135587}