{"duration": 0.17564034461975098, "input_args": {"text": "'Every Friday, pop critics for The New York Times weigh in on the week’s most notable new songs and videos  —   and anything else that strikes them as intriguing. You can listen to this playlist on Spotify here. Like this Playlist? Let us know at theplaylist@nytimes. com, and sign up for our Louder newsletter (coming soon!) here. The electronic musician who calls himself Burial deals in blurry, melancholy, ominous implications. His first release since 2013 is a pair of tracks that are never far from dissolving into entropy. “Young Death” can be glimpsed from the farthest fringe of dance music most of it has fairly steady but nearly subliminal beats, though they are submerged deep in the mix. Much closer to the foreground are crackly sounds  —   a storm? a burning city?  —   and voices singing words that would be soothing if they didn’t sound so utterly lost: “Don’t fear,” “Don’t cry,” “I will always be there for you. ” The beat is absorbed by the static, to be replaced by one that’s slower and even less supportive. “I’ll be there, promise I’ll be,” a voice offers before the haze swallows it, too. “Nightmarket” is an even more shadowy, attenuated travelogue. Its passages of blippy arpeggios are separated by lengthy stretches with echoes of wind chimes, distant keening voices, screams, whispers and stray spoken words  —   “Come with me,” “the frontier,” “over here!”  —   that only lead deeper into the void. JON PARELES The title of Laura Marling’s ravishing new song isn’t meant as a descriptor, but rather a note of anguish  —   like the word “water” as rasped by someone crawling across a desert. “Oh my hopeless wanderer,” she sings at the start of the track, tracing an upward arpeggio in a minor key. “You can’t come in, you don’t live here anymore. ” Still, Ms. Marling toys with aspects of seduction in the song’s arrangement, which leans heavy on a sinuous electric bass, and in the video, which she directed herself. Inspired by a series of dreams she had while making her new album  —   “Semper Femina,” due out in March  —   it’s a vision of human bodies as sculptural forms, and also an argument for physical intimacy as just another mode of performance. NATE CHINEN If you are the sort of person who expends much energy stressing about the fact that rapper du jour Lil Yachty had not, until recently, listened to the music of the Notorious B. I. G. then little in this   freestyle  —   on the Beats 1 radio show of his longtime antagonist Ebro Darden  —   will change your mind. Rather than concede to the beat  —   Craig Mack’s “Flava In Ya Ear,” the remix of which featured B. I. G.  —   and perform a flow that recalled the original, in an act of homage, Yachty goes rogue, rapping in elongated sentences that stretch past the ordinary beat boundaries. It’s not quite virtuoso, but it’s intriguing  —   the sound of a rapper following the beat in his head, not his earphones: I’m in a Benz and I’m getting a BentleyI’m reading texts from last night, she said ‘I love how you bent me’I just bought a Benz and it said ‘please take me’You wanna buy it but you can’t, so you’re rentingYou take it back in six months, if there’s no denting JON CARAMANICA “Arkansas,” by the rising Texas country singer Troy Cartwright, is wonderfully patient. On this song, from his recent EP, “Don’t Fade,” he muses about the stability of a relationship (“Is this love or is this convenience? ”) and, after a couple of minutes, comes to no conclusions. And yet his voice is remarkably free of anxiety  —   he’ll wait as long as it takes, play it as it lays. That’s clearest when he’s not singing at all: the   at the song’s end that’s just melancholy, stretched out ambient notes with cricket noises screaming for attention in the background. J. C. You won’t hear Paul Simon’s voice until after the   mark on “Stranger,” a hypnotic new track featuring elements of his recent songs “The Werewolf” and “The Clock. ” Made by Nico Segal and Nate Fox of the Social Experiment  —   a Chicago group best known for its affiliation with Chance the Rapper  —   it’s a remix and   but also an imaginative new creation. Those first two minutes involve some sharp, brooding horn playing by Mr. Segal, who until recently went by the name Donnie Trumpet. The production on the track is dreamy but also clearly drawn, so that Mr. Simon’s voice, when it does surface, practically crackles in the mix. N. C. “When and where did we go cold?” Oliver Sim of the xx wonders in “On Hold,” the single previewing the xx’s album “I See You,” due Jan. 13. It’s a familiar sentiment for the xx, an English band known for   introspection and dialogues of estrangement sung by Mr. Sim and Romy Madley Croft. But now the band is visible by daylight, and they even smile now and then. The video clip for “On Hold” is set under the cloudless blue skies of Marfa, Tex. the town known for Donald Judd’s Chinati Foundation, a Minimalist monument. When Mr. Sim and Ms. Madley Croft aren’t trading recriminations and regrets (via landlines) the video shows glimpses of   life, including a romance between a football player and a cheerleader. Meanwhile, the song presents the xx as no longer rigorously minimalistic. A dance beat periodically surges in the mix, echoing what Jamie xx has been doing as a solo act and club D. J. meanwhile, a sample from Hall  Oates’s “I Can’t Go for That” suggests that the xx isn’t entirely isolated from pop after all. J. P. The new album by the cornetist and composer Taylor Ho Bynum is “Enter the PlusTet,” a rich textural odyssey featuring a   orchestra. It’s a grand statement, but hardly the only thing Mr. Bynum has been working on. A couple of months ago, at Pioneer Works in Brooklyn, he introduced a smaller band he calls Rank Sentimentalist, whose ranks include the electric bassist Stomu Takeishi and the cellist Marika Hughes. This video captures the opening song in the set: a   hallucinatory cover of “Black Lake,” by Björk. Stick with the clip for the full     minutes, and you’ll begin to understand how improvisers like Mr. Bynum can turn a brief scrap of melody into something as churning and vast as an oceanic swell. N. C. Jamire Williams is a drummer with a   capacity for groove, which has served him well as a sideman. He also has his own band, Erimaj  —   but on “      EFFECTUAL,” he pares down almost entirely to solo drum kit, creating a series of poetic experiments in rhythm and tonal color. The album, produced by Carlos Niño, recalls jazz precursors like Max Roach as well as   loops and West African folk drumming. And while there isn’t much in the way of melody, the closing track, “Collaborate With God,” features some atmospheric keyboard work by Chassol, the French soundtrack composer who can also be heard on Frank Ocean’s recent visual album, “Endless. ” N. C. A technological collapse is just the entry point to a personal one in “A Lost Machine,” from a Grandaddy album due in March. The music unites fragility and majesty, placing Jason Lytle’s high, quavery voice atop a piano hymn that swells into a vastly reverberant processional, like Neil Young leading Pink Floyd. The lyrics start out by sketching a   landscape, where wandering people desperately seek shelter in a “canyon land” littered with old, obsolete gadgets. But that’s their problem: Halfway through, Mr. Lytle turns his voice into a chorale and laments: “Everything about us is a lost   about we is a forgotten dream. ” A broken world can’t compare to a broken heart. J. P.'"}, "time": 1742561756.684531}