{"duration": 0.06693553924560547, "input_args": {"text": "\"Email \\nIn perhaps the most tortured presidential answer since Bill Clinton parsed the word “is,” Barack Obama offered a response in a Friday interview that many say gives illegal aliens a green light to vote. Worse still, there may be reason to suspect he was fed the question in advance and gave a premeditated, Machiavellian answer. \\nWhile talking to actress and rapper Gina Rodriguez on the Latin-oriented YouTube channel MiTu, Obama was asked, “Many of the millennials, dreamers, undocumented, um, citizens — and I call them citizens because they contribute to this country — are fearful of voting. So if I vote, will immigration know where I live? Will they come for my family and deport us?” Here was Obama’s answer (video below): Not true. And the reason is, first of all, when you vote, you are a citizen yourself — and there is not a situation where the voting rolls somehow are transferred over and people start investigating, et cetera. The sanctity of the vote is strictly confidential in terms of who you voted for. \\nMany Americans, such as Arizona governor Jan Brewer, were taken aback. As Breitbart reports , “‘Shocking. Absolutely shocking,’ Brewer said to [Fox] TV host Neil Cavuto. Obama ‘should have absolutely set [the interviewer] straight that if you’re not a citizen, you don’t get to vote. And just because you’re in our country “undocumented,” you’re not a citizen. The [Democrats] want to blur the lines.’” \\nAnd no one was more shocked than Cavuto himself (video below; relevant portion starts at 34 seconds). As WND.com related : “I can’t believe that I heard what I heard,” Cavuto said on his broadcast. “The president isn’t even questioning whether the person who is an illegal is voting, outside of reminding people that if you’re a citizen, you vote. But it’s very clear that the question that is being asked was about illegals voting and afraid that they might be reported to Border Security. You’re illegal. You cannot vote.” “The President of the United States is saying, ‘Don’t worry, no one will be spying on you, catching you,'” Cavuto added. “You’re ignoring the fact that you are being questioned about illegal voting, which you can’t do. Why? Because you’re not a citizen of this country!” \\nSome observers say there’s more to this, pointing out that Fox didn’t play Obama’s follow-up remarks. The president had gone on to say, “If you have a family member who maybe is undocumented, then you have an even greater reason to vote.” Rodriguez then chimed in, “This has been a huge fear presented especially during this election,” prompting Obama to add: And the reason that fear is promoted is because they don’t want people voting. People are discouraged from voting and part of what is important for Latino citizens is to make your voice heard, because you’re not just speaking for yourself. You’re speaking for family members, friends, classmates of yours in school ... who may not have a voice, who can’t legally vote. But they’re counting on you to make sure that you have the courage to make your voice heard. \\nOne outlet offering a more benign interpretation is Breitbart , which writes, “Obama’s reply was clumsily worded, but he appeared to say that if a U.S. citizen with illegal alien family members who continue to stay in the U.S. in defiance of the law votes, immigration authorities will not use that voters’ information to begin deportation proceedings against their illegal alien relatives.” And, truth be known, Obama’s reply was clumsy. \\nOr brilliant. \\nIn a Machiavellian sort of way. \\nWhile Breitbart’s is one interpretation, another is that Obama was cleverly giving a green light for illegal voting while giving himself plausible deniability that he was not doing so. Note that he didn’t take issue with Rodriguez’ absurd notion that the mere fact of being present in the country and “contributing,” whatever that means (others would say “leeching”), makes one a “citizen.” Given this, Obama’s statement that “when you vote, you are a citizen yourself” could be taken to mean that the mere act of “participating” in our civic life makes you a citizen in spirit. \\nNote also that Obama subsequently said that you have even more of a reason to cast a ballot if you have relatives who “can’t legally vote” (emphasis added). Does this imply that they “can”— a word denoting capability , not what one should do ethically — vote illegally? After all, they certainly can , given that illegals can obtain driver’s licenses in many states, and proof of citizenship may not be a prerequisite for voting . Realize, too, that Obama has been flooding the US with illegals, ordering they not be deported and that the border patrol stand down. It’s logical to assume he’s doing this for a reason. \\nThe obvious answer to Rodriguez’ question was, “Only citizens may vote, and if you’re a citizen, why would the government be interested in investigating you for not being one?” That Obama didn’t thus respond is suspicious. \\nIt’s also a distinct possibility that Obama had been told of the question in advance and that this was why he could craft a Machiavellian response. WikiLeaks has exposed a shocking amount of collusion between the media and Democrat Party, with a New York Times reporter giving Hillary Clinton veto power over quotations and media figures feeding her debate questions ahead of time. Then there are the even more recent revelations that CNN and the Democratic National Committee colluded in devising questions to be asked of Donald Trump and Senator Ted Cruz, and that a Washington Post journalist asked the DNC for anti-Trump research for an article. \\nAs to possible Rodriguez/Obama collusion, please observe the host’s reaction, at 22-23 seconds in the first video, when Obama replies “when you vote, you’re a citizen yourself,” an answer which begins at 18 seconds. She appears as if she may be suppressing a self-satisfied smirk. \\nIf so, there are only a few possible explanations. She might have simply been kvelling at being seated with the president — yet this doesn’t explain why she registered that reaction at that particular moment. She might have been thoroughly pleased that Obama appeared to affirm her notion that “contributing” equals citizenship. \\nOr she might have been reveling in helping to orchestrate a well-oiled con, in being a facilitator of clever, agenda-advancing wordplay. \\nOf course, this is conjecture. Readers can review the relevant portion of the video a number of times and draw their own conclusions. \\nWhatever the case — whether the answer was off-the-cuff or calculated — it reveals Obama’s heart. He’s a president who has repeatedly trampled the Constitution, the supreme law of the land. In opposing voter ID, the absence of which shocked the UN observers who monitored our 2012 election, Obama has signaled that he wishes to facilitate illegal voting. We also have seen Project Veritas videos in which a Democrat operative boasted that liberals have been committing vote fraud for “50 years.” Moreover, a recently released WikiLeaks e-mail shows that the Clinton campaign believes that in 2008 Obama operatives “flooded the caucuses with ineligible voters.” And the best predictor of future (mis)behavior is past (mis)behavior. \\nIf there is any doubt about Obama’s MiTu answer, he certainly hasn’t earned the benefit of it.  \""}, "time": 1742628458.6574545}