{"duration": 0.054012298583984375, "input_args": {"text": "'Pope Francis has refuted the idea of Christianity as a philosophy or political ideology, proposing rather that it is a journey of faith with its roots in the life, death and resurrection of Jesus. [In his weekly “General Audience” before thousands of pilgrims Wednesday, the Pope underscored the interpersonal aspect of Christianity as faith in the person of Jesus Christ as savior and revealer of the Father.  Reflecting on the witness of Saint Paul, Francis noted that Christian faith is not the outcome of a reflection of some wise person, but a simple fact that intervened in the lives of some people. Christianity, he said, “is not an ideology or a philosophical system, but it is a journey of faith which starts from an event, witnessed by the first disciples of Jesus. ” “Paul sums it up this way: Jesus died for our sins, was buried, and on the third day he rose again and appeared to Peter and to the Twelve,” the Pope said. “This is the fact: he died, was buried, is risen and has appeared. That is, Jesus is alive!” “This is the core of the Christian message,” Francis said. The Pope insisted that Christ’s resurrection was central to the preaching of the early Christian community, because it highlighted the sense that death did not have the final word. If everything were over with Christ’s death, Francis reasoned, he would have given an example of supreme dedication, but he would not move us to faith in Him. He would have been one more hero to admire. “No!” Francis said. “He died but rose again. ” Faith, he said, “is born from the resurrection. To accept that Christ died on the cross is not an act of faith it is a historical fact. Believing that he rose, on the other hand, is an act of faith. ” The Christian faith “was born on Easter morning,” Francis asserted. For his part, Saint Paul “was a persecutor of the Church, proud of his convictions he felt like a man who had made it, with very clear idea of \\u200b\\u200bwhat life was about and what his duties were. ” But, in this perfect picture “one day something happened that was completely unpredictable: the encounter with the Risen Jesus on the road to Damascus,” he said. This event revolutionized his life, and “the persecutor became an apostle. ” The reason for Paul’s  ? “Because I have seen Jesus alive! I have seen the risen Jesus Christ! This is the foundation of Paul’s faith, of the faith of the other Apostles, of the faith of the Church and of our faith,” Francis said. “So, even though we are sinners —  as we all are —  and if our good intentions have remained on paper,” Francis said, all is not lost. Like those people mentioned in the Gospel, we can “go to the tomb of Christ, see the large overturned stone and think that God is preparing an unexpected future for me, for all of us. ” “God is bigger than nothingness, and you just need a candle to defeat the darkest of nights,” he said. Paul cried, “Where, O death, is your victory? Where, O death, is your sting?” In these days of Easter, we carry this cry in our heart, Francis said. “And if we are asked the reason for our smile and our patient sharing, then we can answer that Jesus is still here, and continues to live among us,” he said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742561978.5059526}