{"duration": 0.05726456642150879, "input_args": {"text": "'Rudolph W. Giuliani, the former mayor of New York, lashed out against the Black Lives Matter movement on Sunday, accusing it of ignoring    crime, inspiring violence against the police and promoting racism. “When you say black lives matter, that’s inherently racist,” Mr. Giuliani said in an appearance on CBS’s “Face the Nation. ” “Black lives matter. White lives matter. Asian lives matter. Hispanic lives matter. That’s   and it’s racist. ” His comments came as the country grappled with pain, confusion and anger after last week’s two fatal shootings of   men by the police and the killing of five police officers in Dallas, the deadliest assault on American law enforcement since the Sept. 11, 2001, attacks. As members of the Black Lives Matter movement and other concerned citizens pushed forward on Sunday with protests over police shootings, politicians, law enforcement officials and   leaders took to the airwaves, most of them with messages of hope, unity and understanding. Mr. Giuliani, a longtime promoter of aggressive policing, struck a different chord, saying the Black Lives Matter movement had targeted police officers. “They sing rap songs about killing police officers, and they talk about killing police officers, and they yell it out at their rallies and the police officers hear it,” he said. Mr. Giuliani said the movement unfairly focused on killings at the hands of the police when it should be focusing on murders committed by civilians in black neighborhoods. “When there are 60 shootings in Chicago over the Fourth of July and 14 murders, and Black Lives Matter is nonexistent,” he said, “and then there’s one police murder of very questionable circumstances and we hear from Black Lives Matter, we wonder: Do black lives matter, or only the very few black lives that are killed by white policemen?” Terrence Cunningham, the president of the International Association of Chiefs of Police, who appeared on the same show, was quick to dismiss Mr. Giuliani’s comments. “I wouldn’t make that connection,” he said. “I wouldn’t say that it’s Black Lives Matter that put a target on those police officers,” Mr. Cunningham continued, adding, “Unfortunately, I think, you know, people have really polarized this issue. If we really want to work towards solutions, we need to work together. ” Sherrilyn Ifill, the president of the NAACP Legal Defense and Educational Fund, who also appeared on the show, suggested that Mr. Giuliani was partly to blame for the rift. “He actually presided over one of the most discredited areas and periods of policing in the City of New York,” she said, “which is, in fact, responsible for a lot of the tension that exists between police officers and people in   communities. ” They were not the only ones to point fingers. In an appearance on ABC’s “This Week,” retired Lt. Gen. Michael Flynn, who is considered a potential running mate for Donald J. Trump, criticized Hillary Clinton for saying on Friday that white people needed to start listening to “legitimate cries” from  . Mr. Flynn said that Mrs. Clinton was “totally irresponsible when she talked about white people being to blame. ” William J. Bratton, the New York police commissioner, who appeared on Sunday on multiple shows, was among the many who emphasized unity. “This is a shared responsibility, trying to bridge these differences that are becoming quite evident through many of these videos,” Mr. Bratton said on ABC’s “This Week. ” “We have come a long way we have come a very long way. And I can speak for New York, but quite clearly events this past week show we have really almost just begun the journey. ” Separately on Sunday, as Mr. Trump has faced skepticism from some Republicans over his stances on abortion and other social issues, General Flynn, a Democrat, indicated a willingness to break from his party affiliation. During his appearance on “This Week,” he voiced support for abortion rights and brushed aside the issue of   marriage on the grounds that it was less important than matters like education and immigration.'"}, "time": 1742564468.202028}