{"duration": 0.05514883995056152, "input_args": {"text": "'U.S. \\nRemember the last Super Bowl and Beyoncé’s half-time performance? Remember how it seemed reminiscent of the Black Panthers? Well, she is at her anti-cop rhetoric once again, and there have been some deleterious results. \\nHours after Beyoncé called on black people to take a stand, someone got the memo and massacred police officers at a protest, as per Downtrend. Although this actually happened last July, it takes on added significance considering more police officers were ambushed over the last few days. \\nThis seems to be a recurrent theme, and it needs to stop. Our police officers deserve respect and to be safe from targeted violence! \\nDon’t get me wrong, racism is still a problem in our country, but race-baiting isn’t helping. In fact, it’s hurting! \\nRace-baiting is, of course, old hat to individuals like Beyoncé, who gain part of their fame from their status as famous black artists, not just as famous artists. \\nHowever, liberals such as Beyoncé have yet to realize a couple of key principles. When you stoke the flames of racial tension, things invariably get worse. \\nYou promote a double standard when you call on people to rise up. This double standard led to a San Antonio police detective getting shot and killed just a few days ago. The perpetrator of the crime even admitted a few things about the motivation for his crime, which has raised concerns across the nation. \\n“I lashed out at somebody who didn’t deserve it,” this perpetrator said. While most people will celebrate the holidays, the San Antonio Police Department is going to be arranging a funeral for the latest victim of violence. A family will be in mourning. \\nThis tension has been brewing for a few decades now. This type of victim mentality has started with the liberalism that has infiltrated every institution in our country. \\nNowadays, people are happy to cry racism even at the smallest slight. It has led to an inevitable conclusion: the violence against police officers has increased. However, while these men are just doing their job and getting killed for it, the true perpetrators of the crime will never be charged. \\nThose who incite violence against police officers deserve some serious consequences. \\nThis definitely includes the racist Beyoncé, who has contributed to violence against innocent, honorable Americans. '"}, "time": 1742561782.185416}