{"duration": 0.038747549057006836, "input_args": {"text": "'\\nVIA Conservative Tribune \\nIn 2000, computer programmer Clinton “Clint” Curtis was ordered to design an undetectable computer program that could flip the results of a close election, according to ClashDaily and the St. Petersburg Times, now the Tampa Bay Times . \\nCurtis testified before the U.S. House Judiciary Committee that his employer, Yang Enterprises Inc., told him, “We need to steal an election.” The program was intended for the computerized voting machines to which Florida would be transitioning starting in 2002. \\nYou can watch the video here: \\nCLICK HERE TO SEE THE VIDEO \\nThis is it, folks. Despite the liberal media’s efforts to convince us all otherwise and paint naysayers as conspiracy theorists, Republican presidential candidate Donald Trump is right. Rigging an election has never been easier. \\nThe left painted Clint Curtis as a nut, a conspiracy theorist, a disgruntled ex-employee. They published photoshopped images of him wearing a tinfoil hat and did everything possible to discredit one man who was standing up for the truth. \\nCurtis voluntarily took a polygraph test, alleging that one of the consultants at his employer was a Chinese national and convicted spy. Yang Enterprises denied ever knowing consultant Hai Lin Nee, while in fact they had been assisting him for years in repeatedly extending his U.S. Visa. \\nThe Florida Department of Transportation inspector investigating the ballot tampering allegations, Raymond Lemme, was found dead in an apparent suicide. Both Curtis and Lemme’s family members believe he was murdered. \\nIn 2005, computer experts demonstrated for officials in Leon County, Florida, how simple it was to flip election results while leaving no detectable trace of their efforts. \\nWhere is the liberal media in all this? Where are the Democrats who are supposedly so concerned with our fundamental rights? \\nThey’re in a back room, preparing to steal an election if the people’s voice isn’t heard on Election Day. On Nov. 8, be that decent person standing up for truth. \\nWhat are your thoughts on this? Do you think that the election is rigged? \\nShare us your thoughts in the comments section below. '"}, "time": 1742628287.9480193}