{"duration": 0.08241105079650879, "input_args": {"text": "'ATLANTA  —   At least 18 people were killed and 43 more injured in Georgia and Mississippi after thunderstorms and tornadoes roared through the South this weekend, leaving some things standing and some things fallen, some lives whole and others blown to bits. Charles McDowell, pastor of Barney United Methodist Church in Barney, Ga. was safe at home in nearby Valdosta on Sunday. So was the modest church where he preaches to his flock of a few dozen. But many of his members were suffering  —   their homes damaged, including roofs torn away, and their electricity off. There was little for him to do but try to reach out to them on their cellphones. “As a church,” Mr. McDowell said, “we’re praying for each other. ” Catherine Howden, a spokeswoman for Georgia’s emergency management agency, said 14 people had died and 23 had been injured in central and southern parts of the state. She said there had been up to 20 reports of tornadoes. Gov. Nathan Deal declared a state of emergency on Sunday for seven counties: Atkinson, Berrien, Brooks, Colquitt, Cook, Lowndes and Thomas. “The state is making all resources available to the impacted areas,” Mr. Deal said in a statement. He added that he was prepared to expand or extend the emergency declaration, and that he was likely to seek federal help. On Sunday afternoon, during a ceremony to swear in senior White House staff members, President Trump said he had spoken with Mr. Deal, and noted that Florida and Alabama had also been hit. Mr. Trump said he had expressed to Mr. Deal “our sincere condolences for the lives taken” and promised to help Georgia. He added that he planned to reach out to Florida’s governor, Rick Scott. George Wetzel, a National Weather Service meteorologist in Peachtree City, Ga. said that in the past three days, a strong   system had moved east across the South, which had been unseasonably warm, with moisture moving north from the Gulf of Mexico. A statement from Mississippi’s emergency agency said a tornado had caused extensive damage in the southern part of the state early Saturday, killing at least four people in or near Hattiesburg and injuring more than 20 others. Gov. Phil Bryant called for a state of emergency as power lines and debris littered roads. In Georgia, an intense round of thunderstorms that started Saturday morning produced a number of tornadoes, and a second round overnight produced flooding rains, including more than six inches in 24 hours just east of Albany. A third wave of storms began in some parts of the state early Sunday. On Sunday morning in Adel, Ga. Jeff Lane, a county commissioner, surveyed the wreckage at the Sunshine Acres trailer park, where he said all of the county’s deaths had occurred. (He said eight had died, but Ms. Howden said later that the toll was actually seven.) Search and rescue crews were still making their way through the community. Photographs showed an open field surrounded by thin trees, strewn with splintered wood, metal sheeting and destroyed cars. “It’s like a bomb had been dropped out here at ground level,” Mr. Lane said by phone. “You’ve got   frames that look like spaghetti noodles. We’ve tried to evacuate as many as we can. But it’s raining real hard, and we’re getting ready to start another round of storms. ” Mr. McDowell, the pastor in Barney, a small community known for its peaches, said he had canceled Sunday services because of power failures and the continuing storms. “A lot of my people have physical damage,” he said. “Some of the roofs are ripped off, trees are down, and of course the power is off now. ” The weather also caused damage in Alabama, Louisiana and Texas, but it was not clear Sunday whether anyone had been killed or injured in those states. NOAA warned of a “high risk” of severe weather in Georgia and parts of Alabama and Florida. Since Saturday morning, 30 tornadoes were reported in Alabama, Georgia, Louisiana and Mississippi, the agency said.'"}, "time": 1742563814.0493555}