{"duration": 0.036588191986083984, "input_args": {"text": "'“The humanity of the unborn child is obvious on any ultrasound machine,” writes Philadelphia Archbishop Charles Chaput in an invigorating new book. [A redoubtable evangelizer and culture warrior, Chaput lays out a road map for living the Christian faith in a   world in his new work Strangers in a Strange Land, due for release on February 21.  Though the Archbishop deals with a multitude of topics from the decay of modern democracies to millennials’ dread of commitment, his words on abortion ring with particular force on a day when tens of thousands march on Washington DC in defense of the right to life. Chaput notes that important strides have been made in the past half century and that today “many American young people are more committedly   than their parents and even their grandparents. ” “This seems ironic, but it shouldn’t surprise,” he observes. “They’ve seen what abortion does. They’ve lived with the fact that they could have been aborted. The humanity of the unborn child is obvious on any ultrasound machine. ” Still, Chaput argues, a fear of living “outside the cone of public approval” leads many to shirk their personal responsibility for changing society. In the case of abortion, “many of us are happy to live with   and ambiguity rather than risk being cut out of the herd. The culture of lies thrives on our own complicity, lack of courage, and   deception. ” The Archbishop also assails “chronic newsroom prejudice” in the shaping of certain kinds of news, especially in the abortion debate, as evidenced by the wildly imbalanced coverage of the   Women’s March on Washington this week as compared with the annual March for Life. Thus, “Planned Parenthood is assumed good, while critics who secretly film its cynicism, profiteering, and barbarism are assumed bad,” he notes. Meanwhile, “the language of ‘abortion rights,’ common in most newsrooms, has the familiar Orwellian ring of avoiding an unpleasant reality (killing a child in utero) by calling it something else,” he notes. “Thus does the magic of words rework the sinews of the universe. ” The Archbishop reserves some choice expressions to summarize the last eight years under the Obama administration. “The White House elected to power in November 2008 campaigned on compelling promises of hope, change, and bringing the nation together,” he said. “The reality it delivered for eight years was rather different: a brand of leadership that was narcissistic, aggressively secular, ideologically divisive, resistant to compromise, unwilling to accept responsibility for its failures, and generous in spreading blame. ” Nowhere was the aggressively secular agenda more evident than in the matter of abortion and religious freedom. “The same intolerance marked the administration’s fight to coerce abortion and contraceptive services as part of national health care,” Chaput contends. “It tenaciously refused reasonable compromise on exemptions for religiously affiliated providers and organizations and deliberately sought to break any opposition —   prompting a sardonic Wall Street Journal editorial renaming the Little Sisters of the Poor ‘the Little Sisters of the Government. ’” And thus, we live in an age “when almost every scientific advance seems to be matched by some new cruelty in our entertainment, cynicism in our politics, ignorance of the past, consumer greed, subtle genocides posing as rights like the cult of abortion, and a basic confusion about what —  if anything distinctive at all —  it means to be human,” he argues. Fortunately, the book deals not only with diagnosing our diseases but also in prescribing remedies for them —  mostly in the form of more authentic engagement with the deeper truths of human existence and a bracing evangelism capable of rendering the Christian message winsome and liberating in a world jaded by disbelief. Follow Thomas D. Williams on Twitter  Follow @twilliamsrome'"}, "time": 1742628467.1815226}