{"duration": 0.04799604415893555, "input_args": {"text": "'As of a few weeks ago, advertisements for JPMorgan Chase were appearing on about 400, 000 websites a month. It is the sort of   number that has become the norm these days for big companies that use automated tools to reach consumers online. Now, as more and more brands find their ads popping up next to toxic content like fake news sites or offensive YouTube videos, JPMorgan has limited its display ads to about 5, 000 websites it has preapproved, said Kristin Lemkau, the bank’s chief marketing officer. Surprisingly, the company is seeing little change in the cost of impressions or the visibility of its ads on the internet, she said. An impression is generally counted each time an ad is shown. The change illustrates the new skepticism with which major marketers are approaching online ad platforms and the automated technology placing their brands on millions of websites. In recent years, advertisers have increasingly shunned buying ads on individual sites in favor of cheaply targeting groups of people across the web based on their browsing habits, a process known as programmatic advertising  —   enabling, say, a Gerber ad to show up on a local mother’s blog, or a purse in an online shopping cart to follow a person around the internet for weeks. But as the risks around the far reaches of the web have been cast into stark relief, some advertisers are questioning the value of showing up on hundreds of thousands of unknown sites, and wondering whether millions of appearances actually translate into more sales. “It’s only been a few days, but we haven’t seen any deterioration on our performance metrics,” Ms. Lemkau said in an interview on Tuesday. She added that the company had also pulled ads from YouTube in the past week after reports showed other major advertisers like Verizon unintentionally appearing on videos promoting hate speech and terrorism. JPMorgan aims to restrict its ads on the platform to a “ ” list of 1, 000 YouTube channels, which it expects to be able to do by the week of April 10, she said. Much of the promise of online advertising hinges on the vast reach of the web, and the ability to reach people on niche sites at low prices. Index Exchange, an ad exchange, has estimated that the titles owned by the top 50 traditional media companies account for 5 percent or fewer of the trillions of ad impressions available for sale each day. Google’s display network alone includes more than two million websites. YouTube has more than three million   channels, according to the analytics company OpenSlate, which says the average $100, 000 campaign on the platform runs on more than 7, 000 channels. If more advertisers follow JPMorgan’s lead and see similar results, it could hurt the operators of smaller sites that make up the   long tail of the internet, as well as the advertising technology companies that profit from funneling trillions of ad impressions from brands to consumers through systems that mimic a stock exchange, according to Eric Franchi,   of the ad technology firm Undertone. “If you charge a percentage of all of the ads that run through your platform, then the prospects can be pretty dim if all of a sudden your volume has been cut by 95 percent,” Mr. Franchi said. “So many of these companies, and some of them are public, tout the number of ads they deliver per second, per day. If you start seeing more marketers move in this direction, it will be pretty interesting. What are the metrics then that those companies start to report?” JPMorgan started looking into preapproving sites, a strategy known as whitelisting, this month after The New York Times showed it an ad for Chase’s private client services on a site called Hillary 4 Prison. It was under a headline claiming that the actor Elijah Wood had revealed “the horrifying truth about the Satanic liberal perverts who run Hollywood. ” Of the 400, 000 web addresses JPMorgan’s ads showed up on in a recent   period, said Ms. Lemkau, only 12, 000, or 3 percent, led to activity beyond an impression. An intern then manually clicked on each of those addresses to ensure that the websites were ones the company wanted to advertise on. About 7, 000 of them were not, winnowing the group to 5, 000. The shift has been easier to execute than expected, Ms. Lemkau said, even as some in the industry warned the company that it risked missing out on audience “reach” and efficiency. JPMorgan had already decided last year to oversee its own programmatic buying operation, and it works with Google and AppNexus to show its ads, she said. It was not a difficult decision to extend whitelisting to YouTube, given that Chase was already making that shift across its display advertising, she said. “Before the YouTube thing happened, we were just looking at programmatic,” she said. “Now the question is, what else is out there that we should be looking at whitelisting?” She added, “At some point, a human is going to take a look. ”'"}, "time": 1742628505.2899942}