{"duration": 0.047489166259765625, "input_args": {"text": "\"As Flint Suffers, Nestlé Plans Dramatic Expansion of Water Privatization in Michigan What's more, the biggest food company in the world gets to pump that water at no cost . Be Sociable, Share! Nestle brand Arrowhead water bottlers. (Screenshot) \\nThe state of Michigan has reportedly issued preliminary approval for bottled water behemoth Nestlé to nearly triple the amount of groundwater it will pump, to be bottled and sold at its Ice Mountain plant, which lies roughly 120 miles northwest of the beleaguered community of Flint. \\n“Nestlé Waters North America is asking the Michigan Department of Environmental Quality (DEQ) for permission to increase allowed pumping from 150 to 400 gallons-per-minute at one of its production wells north of Evart,” MLiv e reported on Monday. \\n“The DEQ Water Resources Division conducted a site review and signed-off on the pumping increase in January, but the Office of Drinking Water and Municipal Assistance is approving the permit,” the report continued. The agency is accepting public comment on the proposal (pdf) until Thursday, Nov. 3. \\nWhile Nestlé and other bottled water companies have rankled many communities for privatizing their public water supply, the news particularly stung in Michigan, where citizens have faced a years-long nightmare over lead contamination in their drinking water. Many residents of Flint are still forced to rely on bottled water for cleaning, cooking, and bathing as government delays have hampered efforts to replace the corroded pipes. \\nMeanwhile, the report notes that company representatives defended the need to expand the facility because “U.S. market for bottled water in general is driving the bid for more Michigan groundwater.” \\nWhat’s more, Nestlé, the biggest food company in the world, gets to pump that water at no cost. As MLive reports, “Michigan law allows any private property owner to withdraw from the aquifer under their property for free, subject only to a nominal $200 annual paperwork fee. The interstate Great Lakes compact prohibits water diversions outside of the Great Lakes basin, but a bottling exemption within the law allows water to be sold outside the region if it’s shipped in bottles smaller than 5.7 gallons.” \\n“The issue is the privatization of a critical resource. How much is too much?” said Jeff Ostahowski, vice president of the Michigan Citizens for Water Conservation, which for years fought against Nestlé’s expansion in the state. \\nWhen contacted by MLive for comment, Ostahowski said he wasn’t even aware of the new proposal. But as news spread on social media, the outrage was palpable: \\nPeople in Detroit are having their water cut off, and Flint has to pay for poison water but Nestle gets water for free and makes a profit? \\n— Wendy Harless (@wendyharless) November 1, 2016 ” Bottled water is the leading growth industry of the beverage market”. Yup – especially here in Flint. Anyone… https://t.co/XsBMl6nnID \\n— kristen senters (@kristensenters) November 1, 2016 Where does that bottled water #Flint is STILL using & paying for come from? https://t.co/IeBnRpCWin \\nThis work is licensed under a Creative Commons Attribution-Share Alike 3.0 License . Be Sociable, Share!\""}, "time": 1742561931.8271945}