{"duration": 0.15096664428710938, "input_args": {"text": "'Monkeyball is on the steep decline. \\nPeople would rather watch a super-violent show about a masculine White man destroying his enemies. \\nDeadline : \\nEven after one of the bloodiest and darkest episodes in the AMC seriesâ\\x80\\x99 history, The Walking Dead really does have something to celebrate about its Season 7 debut â\\x80\\x93 and weâ\\x80\\x99re not talking a fantasy sequence. With 17 million watching the October 23 premiere to discover who Negan would kill and 10.7 million among adults 18-49 for an 8.4 rating, the zombie apocalypse blockbuster had a very good night as the No. 1 show on broadcast and cable. \\nHow good? \\nWell, TWD knocked the stuffing out of the often-dominating Sunday Night Football demo-wise this weekend , left the Season 3 debut of Big 4 heavy hitter Empire Season 3 in the dust, and solidly bested its own Season 6 premiere last year. Add to that, the show based on the Robert Kirkman comics basically matched its all-time series highs of the Season 5 opener of October 12, 2014 in both viewers and the demo. And, with maybe a slightly aging fanbase after all these years, pile on that the Season 7 opener set a series high among adults 25- 54 (10.5 million), making it clear that The Walking Dead is alive and kicking at this point deep into its run, when most other shows are DOA. \\nNFL ratings are collapsing completely. \\nAwful Announcing : \\nThe NFLâ\\x80\\x99s downturn in ratings has been the dominant sports media storyline of the fall of 2016. And unfortunately for the league, itâ\\x80\\x99s not getting any better, especially when it comes to the primetime windows. And while there are a number of factors at play in whatâ\\x80\\x99s ailing the NFL right now, the quality of the primetime games isnâ\\x80\\x99t helping. \\nIn spite of featuring the gameâ\\x80\\x99s most storied rivalry in Bears-Packers, Thursday Night Football was down 17% versus last year. The abysmal 6-6 tie between the Cardinals and Seahawks was unsurprisingly down 15% from last year, proving that not all close games are guaranteed to drive viewership. The Monday Night Football matchup between Houston and Denver was also uninspiring and down 13% from last year . \\nFox Sports exec Michael Mulvihill has been tweeting out numbers throughout the season and through seven weeks now, itâ\\x80\\x99s obvious that Fox and CBS coverage on Sunday afternoons are being affected much less by the NFLâ\\x80\\x99s ratings challenges than in primetime. With all three primetime windows dropping this week, TNF, SNF, and MNF are all down AT LEAST 18% in viewership from this time a year ago. \\nThis is a massive drop. \\nMassive. \\nThough the kike media is coming up with all sorts of excuses (you see the above quoted article blaming the quality of the games, lel – others are blaming the election ), none of them are looking at the most obvious thing that has changed in America over the last couple of years, and that is race relations. \\nSportball Americans AKA “The Blacks” have become insanely hostile toward the White population of this country, so it makes absolute sense that people are now less interested in watching these vicious apes throw balls at one another. Nigga ah be botta frow dis ball over der, dat oder nigga botta be catch dis ball, din he gunna run ober der. nigga nigga nigga fugg wite ppl muffugguh ah keel u nigga fu shii t. \\nThe Colin Kaepernick hate-protest against America itself – which many of his fellow apes have joined in – certainly isn’t helping the situation any. Yes, Mr. Grossman, please, please take it to the next level . I simply cannot express to you how much I want you to do exactly that. \\nAs I have always said, racial tension is good for the White movement. Polarization is always good for revolutionaries. Black Lives Matter is doing our work for us. When White people see Blacks rioting and attacking Whites, when they witness this hateful rage against them (for something they never did), it triggers an instinctive, tribalist reaction. \\nHence, collapsing monkeyball ratings. \\nFor their part, Jews are totally incapable of understanding the concept of “going too far.” As long as there is room to push it further, they will keep pushing it further, and they are oblivious to potential backlash. We see this with the sexual liberation. Some people would have chilled out once gay marriage was solidified, but they moved on to trannies and now they’re headed for pedophilia . \\nBecause we are the underdogs in this race war against the kikes, it is necessary to always understand and exploit their weaknesses. They biggest weakness is this incapacity to stop pushing everything as far as it can be pushed. This is why they were kicked out of over 100 European nations/territories, and why they will eventually be rounded-up and expelled from the United States of America. \\nLook for rap music sales to drop next. You can take that prediction to the bank. \\nThe Walking Dead as Implicit Fascist Propaganda \\nOkay, so nobody liked seeing Rick f that n last season. I get that. \\nAt the end of season 5, I was working on a very long essay about the show, and then ended up canning it because I knew there would be outrage over the season six sex act. \\nBut even with that element, The Walking Dead remains a type of implicit fascist propaganda, due to the themes themselves. It is almost like they have to include these multicultural elements in order to avoid open accusations of fascism. \\nThe setting is one of survivalism, during a zombie apocalypse, where the only way to survive and protect your people is to be ruthless. And the hero, who began the show as a bright-faced golden boy trying to help everyone is now an unrepentant mass-murderer, who will kill anyone who messes with his people. If you ignore the racial element, the show is utterly fascist, as it denies the concept that Jews have pushed in their media since they founded Hollywood that “the ends never justify the means” and unrepentantly shows its hero – a masculine blue-eyed White male – justifying the most violent of means to the end of protecting his people. \\nThis is, I believe, why the show has been so overwhelmingly popular. It touches the same longing for primal masculinity that Fight Club touched. It justifies the thing that all men, at the heart of their being, know to be true: that every aspect of the basic order of nature will ultimately be reduced to physical violence. \\nThis season opened with the enemy tribe engaging in extreme acts of physical violence against the heroes of the show ( so brutal that television watchdog groups are complaining ), and the only possible response to this is going to be physical violence. There will be no Jewy “overcoming adversity by being the better man.” Our hero Rick will hunt down and slaughter his enemies, and he will feel no guilt. Because this is the way you take care of your people: by destroying your enemies. \\nThere is also an implicit theme relating to immigration and Black revolt, with the zombies themselves representing the non-White hordes overrunning our countries. I have written about that before . Zombies in TWD Migrants in Slovenia \\nJust for the record, I believe there is approximately zero chance that any of the shows creators are consciously promoting these themes (conversely, I have argued that the creator of Breaking Bad was probably at least partially aware that he was promoting fascist themes). However, though the show’s creator Robert Kirkman is probably something of a cuck, given that he has put all of this multiculturalism in the show (though there are no gays or trannies), he isn’t a Jew, meaning his Aryan racial soul is capable of expressing itself subconsciously. Robert Kirkman: definitely looks a bit cucky, I must say. \\nYou can also check the show’s Wikipedia page and see that there are apparently no Jews involved in production at all (I only see Jew names in the editors column, and only two of them) – which is something of a miracle just based on statistics, given the number of Jews that work in television. \\nAnyway, maybe you hate the show, maybe you like it, maybe you don’t know anything at all about it. I personally watch it, as well as a few other popular shows (always while doing other things, usually answering email or commenting on the bbs – I ain’t got time to just sit around and watch shows, fam), because it’s important to me to understand what is going on with popular culture – TWD is the most popular of popular culture. And I have to say that I think that overall, this shows popularity among young White men says something very good about the current state of the collective unconscious of our people, in the same way that the dropping popularity of monkeyball says something good about the collective unconscious of our people.'"}, "time": 1742561798.9013925}