{"duration": 0.18863964080810547, "input_args": {"text": "'The soaring spires, the sloping shores, the straitjacket of the street grid  —   many things give form to the great metropolis. The skyline may be our most recognizable feature, despite how unrecognizable it can often be. Its transformation has been nothing less than astonishing over the past decade. Even when it seems as if there were nowhere left to go, the city, with its manifold appetites, could not be contained. Thanks to new concrete technologies, we have witnessed an eruption of very slender, very tall (some might say very crass) buildings. But for every heroic skyscraper, there are more than a few more humble,   ventures  —   a salt shed, a library, a residential hyperbolic paraboloid (see No. 10, above). Today, apart from the Empire State or Chrysler Building, there are few icons of the skyline. The buildings outlined above, however, may someday be worthy of appearing in a Times Square souvenir snow globe. These are the projects that have captured the imagination of more than a dozen shapers and observers of the city consulted by The New York Times for their perspective on the new standouts. You may not recognize these silhouettes, but in time, you will. 1. 432 PARK AVENUE Manhattan, 2016 Rafael Viñoly Architects Though it is the tallest apartment tower in New York City, at 1, 396 feet, the   building was originally laid out with only 125 apartments, ranging in price from $7. 2 million to $88 million. “This building is all about seeing forever. As for its design, it has this pure elegance, something that’s simple and won’t go out of style. It’s the sort of building  —   it’s not popular with everyone, but it represents what the real estate demand was at a moment in time. The demand right now is for high in the sky, for ‘see everywhere.’ Many people don’t like it because they see it as an eyesore, because you can see it from everywhere. On the other hand, that’s what people thought of the Eiffel Tower. ” Elizabeth F. Stribling, Founder, Stribling  Associates real estate brokerage 2. TIMES SQUARE PLAZAS Manhattan,   Snohetta Closing off a section of Broadway in 2009 has been a boon for the area: Travel times improved on Seventh Avenue by 4 percent even as pedestrian counts have grown as high as 480, 000 a day from 320, 000 a decade earlier. “Taking out the five Broadway blocks and pedestrianizing them flew in the face of all the thinking: Traffic would back up to Albany, and so on, which didn’t happen. And it immediately filled with pedestrians. So you can design streets where the space is shared. Times Square’s not exactly my favorite place in the world, but it spawned the city’s plaza program. That is where you can have a real impact on the social capital of a city. If you look at Astor Place, where all sorts of things are going on, creating plazas and widening sidewalks, it’s transformative. There’s so much potential all across the city, and it’s good for the local economies, too. ” David J. Burney, Former commissioner of design and construction Pratt architecture professor 3. THE SPRING STREET SALT SHED Manhattan, 2015 Dattner Architects and WXY Architecture  Urban Design Resembling a    salt crystal, the Spring Street shed houses 5, 000 tons of salt for use during snowstorms. It is part of the city’s Design and Construction Excellence program, which has seeded more than 100 projects since 2005. “The salt shed is a totally unexpected thing for a very municipal, prosaic,   function, like the infrastructure for salting the roads in winter. It is a   thing it draws attention to itself when you’re flying by in a taxicab. It’s got a good location on the West Side, it’s unusual and it makes you wonder, ‘What is that?’ It has a toughness to it architecturally that’s right. It’s interesting to have that level of care and value and investment into something municipal and often overlooked. It’s just salt storage. But why not?” James Corner, Landscape architect and founding partner, Field Operations 4. QUEENS LIBRARY AT HUNTERS POINT Queens, 2017 Steven Holl Architects The branch in Hunters Point follows six new or expanded libraries that have opened in the borough since 2000, part of a plan to create hubs for the diverse, digital needs of a   Queens. “At a moment when most additions to the skyline of New York City seemingly need to scream ‘bigger, better, best,’ there is one that is just quietly and powerfully beautiful. From the vantage point of the East River, the new public library designed by Steven Holl sits squatly amid a backdrop of tall residential towers on the Long Island City waterfront. But its strong geometry  —   a concrete cube with purposefully placed cutouts  —   establishes it as a dominant structure and the organizer of the buildings around it. Through its unusual openings, it expresses the quintessential experience of a library: the mysteries and reveals one encounters when searching the stacks for a book and finding not only it but an unexpected relative. ” Gina Pollara, President, Municipal Art Society 5. 1 WORLD TRADE CENTER Manhattan, 2014 Skidmore, Owings  Merrill Its profile is not the only big thing about 1 World Trade Center. The construction of the 2.    tower also had the largest budget of any modern building: $3. 8 billion. “One World Trade Center has had such an impact. The architecture is really wonderful, and then there’s the symbolism of the rebuilding. Downtown is back, the city is back and the country is back. It’s an icon again, and one that’s visible again, from so many parts of the city. Whenever you see it, it reminds us of our rebirth, and the recovery and revitalization of Lower Manhattan. This building has such a presence, with the plaza and its tapering sides. It has a majesty. It’s big without being massive. ” Bill Rudin, Chief executive, Rudin Management chairman, Association for a Better New York 6. CHELSEA MODERN Manhattan, 2009 Audrey Matlock Architect The rippling facade of the   apartment building is meant to evoke the artistic energy of the neighborhood  —   and helped win design honors from the New York State chapter of the American Institute of Architects. “Because of the rising consciousness of architecture as a cultural artifact, and a goad to sales, the quality of everyday architecture is getting better in New York. In particular, some small midblock apartment buildings that used to just be generic redbrick monstrosities are now getting designed with some character. Chelsea Modern is just a very solid piece of architecture that exceeds the ordinary. It’s an interesting facade that pushes and pulls you. It’s assertive without being aggressive, well controlled and disciplined  —   a standout background building, the kind we should see more of in New York, and are. And I think the parenthesis of this is that   practitioners like Audrey’s firm are finally making it. ” Michael Sorkin, Critic and designer 7. VIA VERDE The Bronx, 2012 Grimshaw, and Dattner Architects Via Verde has been praised for housing New Yorkers across a range of incomes, with 151 rentals available from $730 to $1, 090 a month when it opened in 2012, as well as 71     available for less than $200, 000. “In Europe, there’s a lot of good architects involved in public housing, and there isn’t so much of a disconnect between design and affordable housing that you see in New York and the U. S. Via Verde is a good example of design contributing to making housing more special. Design shouldn’t just be limited to the   brackets. I liked the diversity of housing types here, from the   sections at the neighborhood scale that steps up into this tower. With the facade, there was a lot of research, too, into durability, so you could maybe spend a little more knowing it would last. ” Amale Andraos, Dean, Columbia University Graduate School of Architecture   WORKac 8. WYTHE HOTEL Brooklyn, 2012 Morris Adjmi Architects The   hotel has also become a cultural hub. It goes well beyond lobby art to promoting residency programs with new pieces for each room, as well as hosting openings and film screenings. “If you get off the subway at Bedford, it can almost feel like Stockholm or Paris because of the tourists. This hotel is an entry point for a lot of folks, even those coming from Manhattan. Reclaimed wood and exposed bricks may be played out, but the designers got it just right. As far as a beacon, you could do far worse. It’s not fake, either, but an exemplar of adaptive reuse. Most people who are visiting the Wythe, they have no use for an old barrel factory. You’re not displacing people, but you do have this very   waterfront area that is very recognizably Williamsburg. Here they maintained the old brick facade and the beautiful old wood beams, but by and large, the entire building is very new. It’s elevated to a place that doesn’t just feel like Brooklyn pastiche. When you’re working with beautiful, heavy, honest materials, I’d wager to say this building will stand the test of time. ” Kelsey Keith, Editor in chief, Curbed 9. BARCLAYS CENTER Brooklyn, 2012 SHoP Architects The home of the Nets and Islanders was built across the street from Robert Moses’ unrealized Dodgers stadium, though the arena was almost unrealized, too, after years of lawsuits over the use of eminent domain. “Barclays Center has become one of the most important new public spaces and landmarks in the city, part of a larger narrative of the transformation of Downtown Brooklyn and the Brooklyn Cultural District. Despite all the criticism about Atlantic Yards and the history of the development, the Atlantic Avenue and Flatbush Avenue crossroads is an important part of the city’s future and growth. Part of that is a network of   public spaces that connect people, transit and multiple uses. ” Justin Garrett Moore, Executive director, Public Design Commission 10. VIA 57 WEST Manhattan, 2016 Bjarke Ingels Group The   building may resemble an   pyramid, but the architects prefer to describe it as a hyperbolic paraboloid. The shape developed from taking a typical apartment block and stretching out the northwestern corner to increase views of the Hudson River. “Many of the new towers currently going up are those pencil shapes. The Bjarke Ingels project on the West Side is especially interesting because it is beginning to show that when there’s collaboration between architects, designers, developers and the city, you can start to do different things. This mashing of the conventional skyscraper and a typical courtyard building generated this rather unique shape that’s standing out in the skyline rather nicely. And it includes affordable units, as well, which is obviously important. The lesson would be to start experimenting on all levels. Our city is so interesting because of the diversity of its people and opinions, and you want to see that reflected in the built environment. ” David van der Leer, Executive director, Van Alen Institute 11. NEW YORK BY GEHRY Manhattan, 2011 Gehry Partners This   luxury tower may be an unusual symbol of Lower Manhattan’s rebirth, but with roughly $200 million in  . 11 bond financing, the   edifice is a reminder of the many ways the area has been reshaped since 2001. “I have no claims for aesthetic competence, but the Gehry building certainly looks nice enough to me as an economist who loves cities. The fact that it’s residential matters a lot. If anything, New York, and particularly downtown New York, has a mismatch between its residential needs and an abundance of commercial space. New York is at its healthiest when it is profoundly mixed use, when it is residential and commercial and recreational all at once. I like the fact that the apartments aren’t just apartments for billionaires. They’re not particularly cheap  —   it’s still New York  —   but it’s rental. They’re midsized, a lot are under 1, 000 square feet. The fact that it has a school on the bottom floors is nice as well. Edward Glaeser, Author of “Triumph of the City” Harvard  economics professor 12. THE NEW MUSEUM OF CONTEMPORARY ART Manhattan, 2007 Sanaa Exquisite execution with simple materials is one of the chief attributes of Japanese design, which helps explain how Sanaa turned some offset boxes of aluminum mesh into a beloved museum. And all for a mere $50 million (the new Whitney Museum of American Art cost almost nine times that). “The jagged skyline of the building, surrounded mostly by brownstones and tenements, really creates a stunning contrast that so speaks to what it is. In that neighborhood, I think it creates a real beacon of what’s new. The first band of it does still line up with the building to the north, a totally brilliant way to be a part of that neighborhood and still be totally different. And the storefront is a direct continuation, too. Instead of a gentle weave into the city, it still connects, but in a very different way. It’s very simple and detailed and not at all gaudy. ” David Rockwell, Founder, Rockwell Group'"}, "time": 1742562880.0924435}