{"duration": 0.07909941673278809, "input_args": {"text": "'It is too soon to know whether the unexpected outcome of Hillary Clinton’s presidential candidacy will inspire more women to run or dampen their aspirations. But either way, it is clear that she has, through her campaigns and career, helped create a political environment in which a woman could come so close to winning the presidency. What is less known is that Mrs. Clinton started changing that political culture for women as far back as the early 1970s  —   not through a candidacy of her own, but through a series of small, but crucial, networking moves. The number of women who labored in basement meetings, in   groups, in boardrooms, in unions, in news organizations and in their own kitchens to expand possibilities for women are far too many to count. Far fewer, however, worked specifically to put women into elected office. Prominent among those who did were a few key friends of Mrs. Clinton whom she helped find paths to the cause, including a Texan political player named Betsey Wright, who Mrs. Clinton introduced to a classmate of hers from Wellesley College, Jan Piercy. “In 1972, I was working at a temporary job at Filene’s Basement, trying to figure out what I was going to do next, when I got a call from Hillary,” recalled Ms. Piercy, who had devoted herself to antipoverty work at Wellesley, but not to feminism, per se. “And Hillary said, ‘We have to go to Washington tomorrow.’ So we jumped on a plane, and I’m ushered in to the National League of Women Voters headquarters, and Hillary tells them, ‘This can be your youth director. ’” Ms. Piercy, representing the league, went on to attend the Republican and Democratic conventions in 1972, a key inflection point for female activists. “We realized that the only way we could be accepted as equals was to be in office,” she said. “But the parties were not interested in cultivating women. So we realized we would have to train them ourselves. ” Ms. Piercy was too inexperienced to do that so was Elisabeth Griffith, another friend of Mrs. Clinton’s and Ms. Piercy’s from Wellesley, who had joined Ms. Piercy in the early stages of a project with that ambition. But while Mrs. Clinton was a law student supporting the presidential candidate Senator George McGovern in San Antonio, she met Ms. Wright, the person she thought could galvanize and prepare potential female candidates. She soon became close to Ms. Wright, a seasoned political operative whose experience of sexism on the McGovern campaign was having a somewhat radicalizing effect on her. Often when Ms. Wright tried to raise an issue with a male staff member on the campaign, “It elicited some kind of crazy response about hormones,” Ms. Wright, now 73, recalled. “I was already a feminist, but that turned me into a raving feminist. I would go home and play Helen Reddy and go to sleep. ” Bill Clinton, who helped coordinate McGovern’s Texas campaign, had his own feminist aha moment while working on the race, when McGovern’s staff did not pursue Mrs. Clinton for a job for which Mr. Clinton had recommended her. “But she’s better than me,” he told Ms. Piercy at the time. In meeting Mrs. Clinton, Ms. Wright said, she no longer just imagined a woman could be president, but believed she had met the very woman who would first reach that milestone. Many friends tried to talk Hillary out of marrying Bill for the sake of her political future Ms. Wright went so far as to try to talk Bill out of marrying Hillary, for the sake of the feminist cause. “I told him it was always going to be a struggle for her to carve her own political direction,” Ms. Wright said. Ms. Wright had previously worked on individual women’s campaigns. Yet it was Mrs. Clinton who suggested that Ms. Wright move to Washington to spread her expertise, by joining Ms. Piercy and Ms. Griffith to work for what would become known as the National Women’s Education Fund, an unofficial training arm of the National Women’s Political Caucus, with no formal affiliation. “Hillary was saying they really did need to get somebody who understood local races,” Ms. Wright said. “And she strongly urged me to go. ” It was not an easy sell: Mrs. Clinton was asking Ms. Wright, a Texan, to move to Washington for a job that did not yet have the funding to support it. But persuaded by Mrs. Clinton, Ms. Wright ultimately accepted the position of executive director, backed by a national board of women working in politics. Ms. Wright recalled driving around a frigid Midwest in the winter of 1973, “sleeping in bunk beds at Y. W. C. A. s, with the bathroom down the hall,” trying to recruit women from local churches, gardening clubs and political caucuses for seminars and training sessions that Ms. Wright created to teach women how to maneuver within the political process. She also formed a powerful partnership with Ruth Mandel, who had recently created the pioneering Center for American Women and Politics at Rutgers University. It was not just that they needed to train women, Ms. Mandel said they needed to “help women overcome their own resistance to gaining political power in their own right. ” Ms. Wright knew that revolutions start with pragmatics: She created a training manual that the Education Fund and the Political Caucus relied on heavily for years, a guidebook that broke down the logistics of opinion polling, reaching the news media and recruiting a staff. The training sessions offered advice on every aspect of campaigning, including details specific to women. “We told them, ‘Put your name tag high up on your right lapel, so people could see your name without staring at your chest,’” said Ms. Griffith, who was associate director under Ms. Wright. They also told women, Ms. Wright remembered, “Never to say anything in a ladies’ bathroom you don’t want to see in a newspaper. ” Vivian Houghton, now a    Democratic political activist in Delaware, attended a training session in the  ’70s that gave her the confidence, she said, to run several women’s campaigns at the state and local level. Eventually, in 2005, she ran for attorney general of Delaware, for the Green party. “From that training, we carried out a message that women were just as competent or even more competent than men to run for office,” Ms. Houghton said. “And it gave us the instructions on how to do it, because we were at that point completely uneducated about it. ” Judith Lichtman, a senior adviser to the National Partnership for Women and Families, recalled that in 1974, “the N. W. E. F. was already an important presence on the scene. ” She credited Ms. Wright for that: “She turned the glimmer of an idea into an institution that catapulted untold numbers of women into public life. ” But she credits Mrs. Clinton with pairing the right political powerhouse with the right cause. “She had a   moment,” Ms. Lichtman said. “That was pretty early for that light bulb  —   not a lot of people were thinking about women in politics. ” Ms. Wright’s political talents were such that she became the chief of staff for Bill Clinton when he was governor of Arkansas. “In the Capitol, you had to go through Betsey if you wanted to drink a glass of water,” said Sara Ehrman, the Clinton friend who famously drove Hillary Rodham to Arkansas. But the role Ms. Wright played in Mr. Clinton’s 1992 presidential primary has largely overshadowed the work for which she was once well recognized within the women’s movement. It fell to Ms. Wright, the proud,   raving feminist, to squelch what she once called, dismissively, the “bimbo eruptions” that threatened to derail Mr. Clinton’s candidacy. “It was my job to defend the Arkansas record and Bill Clinton personally,” Ms. Wright said. As for the derogatory phase she coined, she said, “That was just a brain freeze, and it’s something I’ll go to my grave regretting I ever said. ” The race “tore Betsey apart,” said Ms. Piercy, who saw that her friend’s role was significantly limited once the campaign team made it past the primary. “Betsey was there in the beating heart of a   presidential campaign, before we fully understood exactly what it meant for women to be in the cross hairs of that kind of power,” Ms. Piercy said. Ms. Wright is still hopeful that a Democratic woman will be elected president in her lifetime. Certainly, the prospect is far from the pipe dream it seemed like when she first met Mrs. Clinton. “I told Hillary I thought she could be president,” Ms. Wright said. “She would just laugh. Back then, it was pie in the sky. ” Out of politics for years, Ms. Wright is now contemplating ways she could once again engage in causes in Texas, where she has been dismayed by, among other things, the state’s decision to ban Medicaid funding for Planned Parenthood. “I have to do something,” she said. “We have to create a sense of outrage  —   to get more women elected, and to scare the hell out of the men who are there. ”'"}, "time": 1742628575.362564}