{"duration": 0.03681683540344238, "input_args": {"text": "'Last month, about 50 new movies opened in New York and Los Angeles. Some, like a Robert De Niro vehicle called “The Comedian,” showed up in one or a handful of theaters to qualify for Oscar consideration. Some showed up everywhere. (Hi, “Assassin’s Creed. ” Hello, “Rogue One. ”) Who’s got time to see them all? But just in time for Sunday’s Golden Globes broadcast, we plucked four movies from the glut to discuss on “Still Processing”: “Fences,” directed by and starring Denzel Washington the    romance “Passengers,” with Jennifer Lawrence and Chris Pratt the Los Angeles romantic musical “La La Land,” starring Emma Stone and Ryan Gosling and “Patriots Day,” about the 2013 Boston Marathon bombing, starring a bunch of people but especially Mark Wahlberg. Jenna calls that one “the perfect movie for our time. ” We like a couple. We’re mixed on another. And one we   hate. That’s life  —   at the movies, anyway. We also had to take a minute to express our heartfelt sympathies for  —   and total bafflement about  —   Mariah Carey’s New Year’s Eve debacle: so uncomfortable, so funny, so, so her. From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a preloaded app called “Podcasts” with a purple icon. (This link may help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “Still Processing” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a preloaded app called “Play Music” with an    icon. (This link may help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for “Still Processing” and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742562345.7753222}