{"duration": 0.20804691314697266, "input_args": {"text": "'‘Informed Rant’: The Violence of Borders, Racist Mascots and The Real News Posted on Nov 4, 2016 Detail from the cover of Reece Jones’ book, “Violent Borders.” (Verso Books) \\nIn this week’s episode of “Informed Rant,” the podcast of Joshua Scheer, Scheer speaks with Reece Jones, associate professor of Geography at the University of Hawaii, Manoa, about Jones’ book, “V iolent Borders: Refugees and the Right to Move ” and the human cost of borders. \\nScheer also speaks with Paul Jay, co-founder and editor in chief of The Real News, about the site’s significance, and Robert Holden, deputy director of the National Congress of American Indians, about racism and sports mascots after the world series. \\nA rushed transcript follows. \\nAdvertisement Square, Site wide \\nJoshua Scheer: My guest right now is Professor Reece Jones, he’s a geopolitical expert. He teaches geography at the University of Hawaii Manila. His book is “Violent Borders”. We’re discussing refugees. Thank you for joining me. \\nReece Jones: Thanks for having me on. \\nScheer: You ask this question in the book, and obviously every day there’s some big story about migrants and refugees and what’s happening in the world. We just saw it yesterday with the so-called jungle being torn down in France. This morning I woke up to the BBC saying 238 migrants may have drowned outside of Libya. You study this, talking about limiting the movements of the poor and you ask this question in the beginning of your book. Talk about this. The limiting of the movements of these refugees and what you’ve seen, both in your field research, but also in the media reports and everything else that we’re all seeing right now. We’ve seen over the last, certainly the last few years, but this is not a new movement as you write about in your book. \\nJones: I’ve been studying borders for about 15 years now, and over that period of time, I’ve seen two big changes happening at borders. The first is the construction of a lot of border infrastructure that is designed to limit the movement of people across border spaces and to deter people from trying to make trips across borders. This infrastructure is both the deployment of a lot more border agents at borders, the use of new surveillance technologies and military technologies in border spaces, but it’s probably most evident if you look at walls. \\nWalls are a good way to symbolize the hardening of borders that’s happened in the past 15 years. In 1990 there were about 15 border walls around the world, so relatively few. Today there are almost 70 walls on borders around the world, so there’s been a dramatic increase in the number of walls. Those walls symbolize all of the other infrastructure that goes along with that. The militarization of the security in these spaces. \\nThe second trend that I’ve noticed that goes along with that is a dramatic increase in the number of people dying at borders. If you look at the edges of the European Union, in the 1990s there were less than a hundred deaths per year at the edges of the EU, whereas in the past decade, those numbers have gone up dramatically. We’re talking about in the last 3 years in a row, over 3,500 people have died at the edges of the EU every single year. \\nThat’s part of a global trend. From 2005 to 2014, 40,000 people globally died trying to cross the border. In the last 2 years, as you mentioned during your introduction, that’s increased even more. Over 10,000 people have died trying to cross a border in just 2015 and 2016. \\nScheer: Yes, and you have the number in ... A lot of numbers in your book, and it’s very interesting walls. Can you explain, we’re going to get into the violence aspect, but explain this concept that was foreign to me, humanitarian fencing which you saw in Spain and elsewhere. What is humanitarian fencing? How does that relate? \\nJones: In some border areas, there’s an effort to construct fencing that is meant to deter people from crossing rather than injure them in the crossing process. If you look at the US fence, the one that was built after the Secure Fence Act passed in 2006, it doesn’t have a lot of barbed wire on it, instead it’s a wall, it prevents movement, but it doesn’t have the ways to injure people crossing. The EU fencing in Spain for example, is also similar in that respect. It doesn’t have all the barbed wire that we see in other borders around the world. \\nThat doesn’t mean that it doesn’t have a dangerous effect on people’s lives, because what we see over and over again is that as particular border crossing routes are closed, fences are always built in the easier places for people to cross between cities, it diverts people to ever more dangerous routes. That’s why there’s been this dramatic increase in deaths, because as borders become harder to cross, we’ve seen that it doesn’t deter people from crossing as it was predicted to do. Instead, it forces them to cross in these very dangerous places, which means the deserts of the US Southwest. \\nIn Arizona for example, where the number of deaths increased dramatically as fences were built on the US border. At the edges of the EU it means the people are crossing in the Mediterranean. They’re having to go to Libya, and having to use smugglers and are put in these very dangerous situations, which results in these really high death rates of people trying to cross into Europe. \\nScheer: My guest is Reece Jones, he’s a geography professor at the University of Hawaii Manila, and his book is Violent Borders, Refugees and the Right to Move. This is not a new concept as you write about though. The Great Wall of China you write about, Hadrian’s wall, it created a defensive control. Good taxes, and let’s get into that a little bit. The walls that were created, like for the Great Wall of China, and then with feudal lords and common lands using hedges and other mechanisms. \\nWe start to shift the conversation into the state’s responsibility, because as you write in your book, this is not ... One, as you write or as other geographers have also written, to be modern is to be ... Modern citizen it to be a mobile citizen, and also we have been always in migration. Our history’s in migration. Let’s talk about the history of basically creating walls and then where we have reached today in which states are protecting us and we have this national identity based on borders. \\nJones: What I argue in the book, the broader argument that I make in the book is that the walls that we see today and all of the security infrastructure that goes along with them at borders, the idea of citizenship, the use of passports, the imposition of border patrols, is new in the way that it’s happening at borders, but I argue that it’s part of a much longer term history that’s part of this contest between people moving around and states’ efforts to try to control that movement. \\nI argue that a powerful historical process is the state using movement restrictions to contain the poor to particular places to lower their wages to to make them have no wages. What we see today is part of that longer history. In the past it was things like slavery, or serfdom, or vagrancy laws or poor laws, that kept the poor locked into particular places and allowed the wealthy to access their wages to they work at low wages or no wages. Today we see that with borders. \\nThe poor are restricted to the countries of their birth and this creates pools of low-wage labor that lets corporations move factories to locations where it’s advantageous to them, but doesn’t allow workers to move to places where they could demand higher wages. What I argue in the book is that the violence we see at borders today is part of that effort to contain the poor to particular places to protect the privileges and wealth that have accrued in other places.'"}, "time": 1742562519.8761806}