{"duration": 0.022284269332885742, "input_args": {"text": "'Rock legend Billy Joel says when it comes to politics, entertainers are “more like court jesters than court philosophers. ”[In a lengthy interview with Rolling Stone, the “Piano Man” crooner said people don’t come to his concerts to hear him preach politics.  “I try to stay out of politics. I am a private citizen and I have a right to believe in my own political point of view, but I try not to get up on a soapbox and tell people how to think,” Joel said. “I’ve been to shows where people start haranguing the audience about what’s going on politically and I’m thinking, ‘You know, this isn’t why I came here,’” the singer explained. “As a matter of fact, one of the biggest cheers of the night comes when we do ‘Piano Man’ and I sing, ‘They know that it’s me that they’re coming to see to forget about life for a while,’ and the audience lets out this huge ‘ahhhh’ and I say, ‘OK, yeah, don’t forget that. ’” The     who’s scored   hits and has toured the world for five decades, did say that he is “still flabbergasted” that Donald Trump won the White House. Joel joins the likes of actor Mark Wahlberg and  Transformers: The Last Knight star Josh Duhamel, who recently told Fox News: “I don’t like to get involved politically at all. Nobody cares what I think politically. ” Joel has a residency at Madison Square Garden, a post he calls the “greatest gig in the world. ” “I’m doing a residency at the world’s greatest arena  —   I mean what’s better than that?” he said. “This is our fourth year and it’s still selling out. I thought it would kind of dissipate. But so far there hasn’t been any indication of that. When there is then we’ll probably stop. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742561802.3781898}