{"duration": 1.3340983390808105, "input_args": {"text": "'The film critics of The New York Times  —   Manohla Dargis, A. O. Scott and Stephen Holden  —   share their picks for the best movies of the year.  It was the best of times, it was  —   well, you know. “Captain America: Civil War” and “The Purge: Election Year” may sound like the zeitgeist, but if you’re looking for the defining movie of 2016, look no further than the new “Ghostbusters. ” It was hardly my favorite, but it made me laugh. And while its transformation into a target of misogynist and racist vitriol was surprising, it was not especially shocking. It was just another reminder that female power remains deeply threatening, even in the realm of the imaginary. As usual when it came to this year in movies, it was sometimes good if also hard, lean, bad and familiar times, both critically and commercially. “Box Office Meltdown,” a Variety headline shrieked in July by Nov. 25, the trade was reporting “U. S. Box Office Tops $10 Billion”  —   “the   that it’s reached the milestone. ” It turns out that after the acrimonious presidential election, people were coming together at the movies. Then again, packed theaters could also be chalked up to the number of solid mainstream releases, including “Arrival,” “Almost Christmas,” “Doctor Strange” and “Moana. ” It’s worth noting that even the most   popular movies  —   as I write, Pixar’s “Finding Dory” tops the yearly box office  —   are unlikely to show up on many   lists or scoop up critics’ awards. The Los Angeles Film Critics Association (I’m a former member) for instance, recently gave Barry Jenkins’s “Moonlight” best picture, best director and best supporting actor (Mahershala Ali). Its other honorees included releases that, according to the website Box Office Mojo, opened in a limited number of theaters: “Krisha” (26 theaters) “The Handmaiden” (125) and “Certain Women” (138). The divide between what most Americans see and what critics reward is not new or surprising. Yet it seems worth repeating that this gulf remains as vast and seemingly unbridgeable as the one that characterized the electorate. This is less about taste (or   elites versus Jill Popcorn) than the bottom line of today’s conglomerate cinema. As of early December, the six major studios have an 83. 4 percent market share of the domestic box office. Disney alone enjoys a staggering 24. 2 percent, a number that will increase with the release of “Rogue One: A Star Wars Story. ” It’s Disney’s world, after all. Though not only: By the time the Academy Awards roll around in February, the United States will have a new president. A few critics I know are trying to name the most Trumplike release of 2016 one suggested Clint Eastwood’s “Sully,” which I see more as an exemplar of classic Hollywood’s heroic individualism. Viewing movies through the lens of today is a favorite game, never mind that most titles are in the works long before the real world catches up to them. A more fruitful game may be to weigh how this year’s releases  —   be they “Moonlight” or “Deadpool,” “Manchester by the Sea” or “Suicide Squad”  —   signify the end of the Obama era. As to my own favorites, well, they just keep on changing, depending on mood, both personal and national. 1. ‘NO HOME MOVIE’ This was the final feature from Chantal Akerman, who died of an apparent suicide in 2015. Akerman explained that “No Home Movie” was about rooms and faraway places but “above all” about her mother, Natalia, a Holocaust survivor, “but not only. ” It was also, Akerman wrote, about love and loss. She was presumably speaking about her mother, although of course she was also speaking for us, those who loved the daughter. [Read the review] 2. ‘TONI ERDMANN’ The filmmaker Maren Ade’s latest is a perfectly directed and performed movie about a father, his daughter and the ludicrous gag teeth that help close this pair’s generational, economic and social divide. It couldn’t be timelier in how it considers the consequences of neoliberalism, wherein all human interactions are reduced to market relations, but it also has a beat you can dance to. [Read a review] 3. ‘MOONLIGHT’ Bathed in blue and anguish, Mr. Jenkins’s elegiac film traces a single life across three chapters. There’s much to love and admire about this haunting movie, including its lapidary visuals. Here, every moment  —   light flooding a darkened room, an oceanic baptism and a halo of shampoo crowning the head of an abandoned child  —   speaks more eloquently than most of its dialogue, though the words are very fine, too. [Read the review] 4. ‘O. J.: MADE IN AMERICA’ There’s a tradition of documentaries that dig into their subjects episodically, sometimes at monumental length. Such is the case with Ezra Edelman’s “O. J.: Made in America,” which for close to eight hours takes up the case of O. J. Simpson  —   his football glory years, infamous murder trial and tawdry aftermath  —   to create a titanic inquiry into race, class and celebrity in the United States. Race may be a construction, but it is one that Americans continue to live and die by. [Read the review] 5. ‘MY GOLDEN DAYS’ The director Arnaud Desplechin beautifully transcends the usual romantic clichés with a deeply moving, exquisitely directed tale of young love and the lessons never learned. [Read the review] 6. ‘I AM NOT YOUR NEGRO’ In his thrilling documentary, Raoul Peck closes the divide between the personal and political through a portrait of James Baldwin. Expressively narrated by Samuel L. Jackson, the movie largely draws on Baldwin’s own writing  —   as well as material like his F. B. I. files  —   to create a portrait of a man that turns into a harrowing indictment of his country. 7. ‘ARRIVAL’ The E. T. s in Denis Villeneuve’s twisty   heartbreaker don’t want to phone home, but they would really like to get someone on the horn. As she often does, Amy Adams comes to the rescue. Among the movie’s pleasures is a creature design that at last breaks with H. R. Giger’s slavering aliens. [Read the review] 8. ‘THE HANDMAIDEN’ Set in Korea in the 1930s, the latest from Park   involves two women, one a Japanese heiress and prisoner, the other an impoverished Korean con artist who could pick pockets for Fagin. Their delectable relationship takes them and the movie to places you might not imagine, while advancing an argument about gender, desire, erotica and pornography that is more complex than the movie’s slickness suggests. [Read the review] 9. ‘13TH’ In her ferocious, intellectually galvanizing activist documentary, Ava DuVernay takes a hard look at race in the United States through the 13th Amendment of the Constitution. You may think you’ve heard it all before you haven’t. [Read the review] 10. ‘FROM THE NOTEBOOK OF   …    ’ One of the high points of this year’s New York Film Festival, this   masterwork from Robert Beavers is quite a few years old but new to me. (It was apparently finished in 1971 and reworked in 1998.) Here, Mr. Beavers considers the nature of cinema using light and shadow, various mattes and apertures  —   including a window spilling sun on a desk  —   a meditation that at times has the quality of a holy confession. “Aquarius” (from Kleber Mendonça Filho) “Autumn” and “The Dreamer” (Nathaniel Dorsky) “Bagatelle II” (Jerome Hiler) “Certain Women,” especially Kristen Stewart (Kelly Reichardt) “Creepy” (Kiyoshi Kurosawa) “The Fits” (Anna Rose Holmer) “The Illinois Parables” (Deborah Stratman) “Into the Inferno” (Werner Herzog) “Jackie” and “Neruda” (Pablo Larraín) “Krisha” (Trey Edward Shults) “La La Land,” if mostly its finale (Damien Chazelle) “Loving” (Jeff Nichols) “Mountains May Depart” (Jia Zhangke) “Paterson” (Jim Jarmusch) “Sunset Song” (Terence Davies) “20th Century Women” (Mike Mills). Last spring, with #OscarsSoWhite in the rearview mirror and Donald J. Trump’s victory on the    horizon, I reviewed Jeremy Saulnier’s “Green Room. ” It struck me at the time as a smart, brutal, slightly contrived thriller about members of a rock band battling a gang of   punks in the Northwest. In retrospect, though, it seems possible that this scrappy little indie (which just missed making the list below) was something more than a bit of nasty fun. Maybe it was a harbinger, an unheeded political signal amid the   noise, a   allegory of battles to come. Am I reading too much into it now, or was I not paying close enough attention then? If so, I’m hardly the only one. Relevance is one of the great shibboleths of criticism, and after a   event as dramatic and complex as this year’s election, the temptation to seek clues and answers in works of popular art is almost overwhelming. Think pieces promising to tell us “How [insert title here] Explains Trump” popped up after Nov. 8 like mushrooms after a rainstorm, and entertainment has been mined for signs and symptoms of   disaffection,       gullibility and every other real and imaginary affliction of the American body politic. But cinema is better at exploring than explaining, and the screen is more like a prism or a kaleidoscope than a mirror or a window. We seldom get the news from movies. Which is not to deny that they are useful tools for reckoning with reality. In a time of confusion, the best films can offer clarity, comfort and a salutary reminder of complexities that lie beyond the bluster and expedience of political discourse and conventional journalism. We go to the movies  —   and we still go quite a lot, by the way, in spite of the seductions of the couch and the streaming queue  —   in search of escape from reality. We’re also looking for alternative routes to the truth, for sparks of imagination that can ignite or illuminate our own thinking when it gets muddled or stale. The 11 releases listed below were not only my most memorable   experiences of the year they were also, in ways I can’t always specify, helpful. They stirred my curiosity, troubled my sleep and increased the range of my understanding. Sometimes they just made me feel better. 1. ‘MOONLIGHT’ Much has been written about Barry Jenkins’s luminous second feature, based on a play by Tarell Alvin McCraney, which depicts three phases in the life of a young man named Chiron. And much of that writing has drawn out the film’s complicated themes  —   of race, place, sexuality and manhood  —   and the exquisite artistry Mr. Jenkins and his cast bring to them. But the most eloquent testimony comes when words fail, when I run into someone on the street or at a party and they say, “‘Moonlight,’” and I say “yeah, ‘Moonlight,’” and we take a deep breath because nothing more really needs to be said. [Read the review] 2. ‘O. J.: MADE IN AMERICA’ History, biography, sports, celebrity, race, gender, police brutality and media insanity  —   Ezra Edelman’s   documentary touches on nearly everything horrible and fascinating in the last   of American life. A triumph of archival research, it’s also a masterpiece of insight, a rare documentary with the heft and sprawl of great literature. [Read the review] 3. ‘TONI ERDMANN’ Maren Ade’s sublime and squirmy comedy will change the way you think about a lot of things, including (but hardly limited to) fatherhood, daughterhood,   false teeth, Bulgarian folklore, German humor, workplace sexism,   exercises, petit fours and   global capitalism. [Read a review] 4. ‘CAMERAPERSON’ Kirsten Johnson, a prolific and widely traveled cinematographer, makes her living shooting other people’s films, many of them dealing with war, injustice and sexual violence. She assembled this memoir from outtakes and home video, and the result is revelatory testimony to the simple, mysterious power of the camera to bridge the chasm between personal experience and public history. [Read the review] 5. ‘AFERIM!’ Radu Jude’s Romanian western  —   a      epic set in the mountains of Walachia in the   century  —   was barely released in the United States, which is a shame for several reasons. For one thing, its rugged humor, high adventure and ethical seriousness pay tribute to an enduring and often misunderstood genre. For another, it takes up the moral and political problem of slavery (in its Balkan rather than its Southern manifestation) with unsparing honesty and startling nuance. [Read the review] 6. ‘AMERICAN HONEY’ The British director Andrea Arnold leads a raw and ragged adventure into the heartland, discovering it to be a strangely innocent zone of greed, lust, youthful idiocy and startling natural beauty. Sasha Lane, a fearless nonprofessional, is thrilling to watch, as is Shia LaBeouf. There is also a single shot  —   of Riley Keough (who happens to be Elvis Presley’s granddaughter) standing in a motel doorway, wearing a   bikini with the price tag still attached  —   that just might say more about the state of the nation in 2016 than the words of a thousand pundits. [Read the review] 7. ‘AQUARIUS’ The United States was not the only country undergoing a wrenching political upheaval this year. In his generous and angry second feature, the     Kleber Mendonça Filho tracks the changes shaking Brazil as they play out indirectly in the daily life of Clara, a retired music critic played by the great Sônia Braga. A mother, a cancer survivor and an avatar of culture, sensuality and intellectual independence, Clara is a fittingly embattled and indomitable heroine for our times. [Read the review] 8. ‘SAUSAGE PARTY’ This animated feature, with the voices of Seth Rogen and Kristen Wiig, is a profoundly religious film that explores, with devastating rigor, a stark and scary existential predicament. What if you woke up one morning and found out that everything you had always believed in was a lie? Not for kids, obviously. [Read the review] 9. ‘A BIGGER SPLASH’ Commissioned to remake a    ’60s thriller, Luca Guadagnino composed a gorgeous   meditation on sex, rock ’n’ roll and the enduring decadence of European art cinema. Tilda Swinton is silent, Ralph Fiennes never stops talking and the gorgeous volcanic island of Pantelleria plays host to a divine and lethal vacation from hell. [Read the review] 10. ‘ELLE’ AND ‘THINGS TO COME’ (TIE) Paul Verhoeven’s lurid thriller and Mia  ’s meditative domestic drama are complementary portraits of Frenchwomen in middle age, both of them played by Isabelle Huppert. Each movie has its flaws of directorial perspective  —   reflexive sexism in Mr. Verhoeven’s case, generational condescension in Ms.  ’s  —   but Ms. Huppert transcends all limitations. She’s at once the most ferociously intuitive and the most serenely intelligent actress working in movies today. [Read the reviews: ‘Elle’ | ‘Things to Come’] 1. ‘MOONLIGHT’ Kindness and tenderness, as opposed to   melodrama, are traits not commonly associated with movies that aim primarily to thrill and excite. Genuine intimacy is so rarely encountered in film that when you come upon it, your tendency is to suspect that somehow you’re being played. But in Barry Jenkins’s “Moonlight,” my pick for the best movie of the year, there are moments of generosity and selflessness that take your breath away. This is an entirely human story in a medium enthralled by technology, violence and fantasy. As I watched the film, based on a play by Tarell Alvin McCraney, it held me in a state of awed recognition and remembrance of the times I was touched by transformational acts of gentleness and caring. These radiant moments soften an otherwise tough movie, about Chiron, a gay black youth played by three different actors, growing up in a Miami housing project where he acquires the armor of a street thug to survive. Along with “Brokeback Mountain” and “Boyhood,” it is one of the three finest movies of the last decade or so. Is it a coincidence that all three have male protagonists who instinctively resist patriarchal brutishness? In its brokenhearted examination of race, class, privilege and inequality in modern America, “Moonlight” is one of several excellent movies set in places beyond the country’s affluent enclaves. When I raved about “Moonlight” to several    white liberal friends and described Chiron, they politely took note but behaved as if I were telling them to eat their spinach. These same people couldn’t wait to see films like “The Big Short” and “The Wolf of Wall Street,” about the financial chicanery and decadence of rich white crooks. This, then, is the America we’re living in: The haves would rather not contemplate the suffering of the  . And we are shocked to discover that our indifference has consequences. [Read the review] 2. ‘O. J.: MADE IN AMERICA’ The obverse of “Moonlight” in its focus on O. J. Simpson, a rich, entitled black star athlete, the   documentary directed by Ezra Edelman is an epic examination of race, class, sex, celebrity and the cult of sports heroism in America. It is an   of the American psyche focused on the place where all those themes converge to create what some would call the American dream. Or is it a nightmarish orgy of bloodlust? [Read the review] 3. ‘AMERICAN HONEY’ Star (Sasha Lane) the    at the center of Andrea Arnold’s pungent road movie, flees a broken home and a sexually abusive father figure to join a band of teenagers roaming the heartland selling magazine subscriptions door to door. On one level, “American Honey” is a grimy travelogue that shows you the poverty and hardship in a Middle America where the social safety net has frayed, families are ravaged by poverty and drug addiction, and young children are left unattended. The wanderers are the photonegative opposites of ’60s hippies who deserted comfortable   homes in search of adventure. Most of these   stragglers have no place to go back to. [Read the review] 4. ‘EMBRACE OF THE SERPENT’ Viewed largely through the eyes of an aggrieved shaman whose tribe is on the verge of extinction at the hands of Colombian rubber barons in the 19th and 20th centuries, the director Ciro Guerra’s fantastical mixture of myth and historical reality challenges lingering illusions of   culture as more advanced than any other. Beautiful isn’t a strong enough word to describe scenes of the heaving waters of the Amazon and its tributaries, on which two explorers, separated by more than 30 years, navigate in canoes, accompanied by the shaman, Karamakate, the last survivor of an Amazonian tribe killed off by European invaders. Along the way they encounter Conradian horrors. [Read the review] 5. ‘MANCHESTER BY THE SEA’ In Kenneth Lonergan’s sad, powerful film, Casey Affleck plays an embittered janitor in Boston who, after the death of his older brother, reluctantly returns to the fishing village where he grew up to be the guardian of his teenage nephew. The residents of the town may not be poor, but most are struggling. There are no easy answers and pat resolutions in a movie that feels absolutely authentic. [Read the review] 6. ‘NEON BULL’ This Brazilian movie, directed by Gabriel Mascaro, immerses you in the intensely pungent world of vaquejada, a rodeo sport in which two cowboys on horseback, seek to tug a bull to the ground by the tail. Iremar (Juliano Cazarré) is a handsome cowboy who dreams of being a fashion designer. In this deep, sexy reflection on man and animal, the riders use fancy colognes to camouflage barnyard scents. The movie is a celebration of animal smells. [Read the review] 7. ‘FIRE AT SEA’ The Italian director Gianfranco Rosi’s documentary is set on the small island of Lampedusa, whose residents  —   fishing families that have lived there for generations  —   help rescue desperate African migrants arriving by sea. [Read the review] 8. ‘ELLE’ Isabelle Huppert may be the only living actress brave enough to play the   heroine of a diabolical black comedy about rape and perverse desire. [Read the review] 9. ‘AQUARIUS’ In the politically pointed “Aquarius,” the great Brazilian actress Sônia Braga gives a towering portrayal of a retired movie critic who refuses to move out of her apartment when her building is sold to a developer. [Read the review] 10.   “Fireworks Wednesday,” “Krisha,” “Sunset Song,” “” “The Beatles: Eight Days a Week  —   The Touring Years,” “Chronic,” “Best Worst Thing That Ever Could Have Happened,” “20th Century Women,” “13TH,” “Paterson” and “Things to Come. ” More highlights from the year, as chosen by our critics: Television, Pop Albums, Pop Songs, Classical Music, Dance, Theater, Art, Podcasts and Performances'"}, "time": 1742563472.460735}