{"duration": 0.03396153450012207, "input_args": {"text": "'LONDON  —   The   “Harry Potter and the Cursed Child” shattered records at the Olivier Awards for London theater here on Sunday night, picking up nine prizes, including best new play, and honors for the actors playing Harry, Hermione Granger and Draco Malfoy’s son, Scorpius. The previous   were “Matilda the Musical” and “The Curious Incident of the Dog in the ” both hits in London before opening on Broadway. Those shows each won seven Oliviers, which are Britain’s equivalent of the Tony Awards. Jamie Parker took best actor for his portrayal of Harry, while Noma Dumezweni won supporting actress honors as Hermione and Anthony Boyle supporting actor honors as Scorpius. “Harry Potter” also won for best director (the Tony winner John Tiffany) and for its lighting, sound, costumes and set design. The production had tied the record for the most nominations for any show in Oliviers history, with 11. Other winners on Sunday included “Groundhog Day,” which won best new musical and best actor, for Andy Karl “Jesus Christ Superstar,” which won for best musical revival and “Yerma,” which picked up the prize for best play revival and best actress, for Billie Piper’s performance. “Harry Potter,” a   play that audiences can watch over two days or in a single, marathon day, takes place about two decades after Harry’s years at Hogwarts, as a   Harry ships off his son Albus for his first year at the wizarding academy. J. K. Rowling wrote the story for the play with its playwright, Jack Thorne, and Mr. Tiffany. In going    the show missed only in the categories of theater choreographer, which Matthew Bourne won for his stage adaptation of “The Red Shoes,” and outstanding achievement in music, which it lost to the Andrew Lloyd Webber musical “School of Rock. ” In his acceptance speech, Mr. Bourne apologized to “Harry Potter” fans, apparently referring to the fact that he had broken the show’s winning streak. “Harry Potter and the Cursed Child” is running in London and is expected to open at the Lyric Theater on Broadway in the spring of 2018. No casting has been announced. “Groundhog Day” is in preview performances on Broadway.'"}, "time": 1742563140.82984}