{"duration": 0.0917367935180664, "input_args": {"text": "'A little darkness serves John Legend well. Without it, the love songs that regularly place him in the Top 10  —   megahits like “All of Me” from 2013  —   are anodyne enough to work as wedding songs they’re a worthy and lucrative enterprise that can leave an unctuous, saccharine aftertaste. But “Darkness and Light,” his fifth studio album, treats love as something far more complex than a panacea and a fount of perpetual reassurance, with music to match. In his new songs, love can be a counterattack on mortality, a dangerous compulsion, a realm of sweaty adventures, a legacy from father to daughter, an escape from social media and a bulwark against forces of divisiveness. With a producer and   from outside the usual precincts of pop and    —   the guitarist Blake Mills, who has worked with Alabama Shakes and Fiona Apple  —   Mr. Legend’s music turns less glossy: earthier and often spookier. Drum tones are often woody and hollow keyboards and strings open up hazy spaces, sometimes without a beat. Among the songwriters, along with   names like Julia Michaels and John Ryan, is Will Oldham, who’s also known as the   Bonnie Prince Billy. “Love Me Now,” already a hit, is a    song with an overt sense of doom about the relationship: “I know it’ll kill me when it’s over. ” Its track revolves around an insistent,   piano figure, and its chorus first arrives with Mr. Legend nearly alone, singing over simple, fading chords: pop with all of its misgivings built in. The album begins with a manifesto: “I Know Better,” a gospelly hymn that has Mr. Legend declaring, “Some folks do what they’re   baby, this time I won’t” and adding, “My history has brought me to this  ’s power in the color of my face. ” It’s a connection to the socially conscious side Mr. Legend showed on “Wake Up! ,” his 2010 album with the Roots, and in “Glory,” his   song for “Selma” with the rapper Common. So is the song that closes the album, “Marching Into the Dark,” which moves from   gospel roots into surreal modern production and ponders individual sacrifice and the course of history. But for the rest of the album, Mr. Legend quickly pivots back to love and pleasure with the rhetorically awkward yet undeniably catchy “Penthouse Floor,” which has a touch of Stevie Wonder in its dance beat. It starts out with allusions to Black Lives Matter and taking pride in upward mobility but ends up, after an appearance by Chance the Rapper, with the singer settling into hedonism, enjoying “my favorite mix, a little ignorance and   the penthouse, baby. ” Through most of the album, romance has as much to do with conflict and obsession as with comfort. “Right by You (for Luna)” is addressed to Mr. Legend’s daughter it’s a ballad, not a lullaby, posing unanswered questions and veering into dissonance. In “What You Do to Me,” anger seesaws with lust  —   “Make me love and hate you at the same time”  —   pitting a low synthesizer against a stomping beat. “Same Old Story,” with wavering, unstable keyboard chords and eerie sustained strings, is a tender accusation: “Promising we’ll stay   in your heart, you know better. ” In “Overload,” a   duet with Miguel that wanders between guitar chords and   jazz, there’s a collision of love, fame and social media that leaves Mr. Legend wondering, “Must we make a spectacle of love?” Even when Mr. Legend plays his old, smoother self, making a pickup in a club in “Temporarily Painless,” there’s a hint of doubt and defensiveness. The title track, “Darkness and Light,” is a duet with Brittany Howard of Alabama Shakes, the perfect choice for a song that reclaims an old, slow soul back beat and revels in dynamics, with slinky verses that give way to an explosive chorus. His falsetto and her belting push themselves into the same space sometimes they trade verses, sometimes they split single lines. It makes desire a force of nature, ungovernable and irresistible and anything but simple.'"}, "time": 1742563252.1924555}