{"duration": 0.1032564640045166, "input_args": {"text": "'MELBOURNE, Australia  —   Rafael Nadal completed a slate of throwback singles finals at the Australian Open, beating Grigor Dimitrov,       (5)   (4)   in a battle of 4 hours 56 minutes that started Friday evening and ended at 12:44 Saturday morning. In Sunday’s final, Nadal, 30, will face his longtime rival Roger Federer, 35, a nostalgic counterpoint to the women’s championship match between Venus Williams, 36, and Serena Williams, 35. Nadal and Federer have not met in a Grand Slam final since the 2011 French Open. Against Dimitrov, Nadal saved three break points in a tightly fought fifth set, including two at  . With a backhand winner down the line, he earned the crucial break in the next game to go up by   and serve for the match. On Nadal’s third match point, Dimitrov’s final backhand landed long to end a   rally, and Nadal fell to the ground in relief. “Difficult to describe the emotions,” he said in his   interview. “First of all, I was tired. ” That last point was emblematic of how the   Nadal managed to outlast the   Dimitrov, time and again showing his superior physicality in the longest exchanges. The two were more evenly matched on shorter points, but of the 64 points that lasted nine or more shots, Nadal won 39. Dimitrov, 25, had reached only one previous Grand Slam semifinal, at Wimbledon in 2014, but he rarely seemed daunted by the occasion. Already   to start the year and a title in Brisbane to his name, Dimitrov frequently displayed improved power and consistency in the match, even as it wore on into the fifth set, striking 79 winners to 45 for Nadal. But he could not match Nadal’s ability to turn defense into offense few can. Dimitrov’s   backhand was particularly exposed by Nadal’s attacks and counted for the majority of his forced and unforced errors. “It’s never easy to lose a match like that,” Dimitrov said. “I’m happy, though, with a lot of things. I’m going to stay positive and keep my head up high. For sure, Rafa deserves pretty much all the credit right now since he’s such a fighter, such a competitor. At the same time it was an honor for me to play a match like that against him. It also shows me that I’m in a good way, I’m on the right path. ” Nadal started the match with dominant serving, winning 90 percent of points on his serve in the first set. But in the second set, Nadal dropped serve three times and Dimitrov twice. Dimitrov, former   player who tumbled to 40th last summer, held firm after Nadal won the third set in a tiebreaker. Neither player faced a break point in the fourth set, won by Dimitrov in another tiebreaker. Nadal, a   major champion, last reached a Grand Slam final at the 2014 French Open, which he won. He last reached a final in Melbourne earlier that year, losing to Stan Wawrinka. Nadal has missed large stretches of competition in recent years because of various injuries, including a wrist ailment that forced him out of the French Open and Wimbledon last year. “I never, ever dreamed to be back in a final of the Australian Open, the second tournament of the year, after a lot of months without competing,” Nadal said on the court after the match. “But here I am, and I feel lucky, and I feel very, very happy. ” Sunday’s match will be the ninth Grand Slam final between Federer and Nadal, and their second here. In their previous one in 2009, Nadal beat Federer,       (3)     a match perhaps best remembered for Federer’s tearful   speech in the trophy ceremony. That final was also preceded by an epic semifinal for Nadal, who needed 5 hours 14 minutes to put away Fernando Verdasco in five sets. Federer, the No. 17 seed, needed five sets Thursday to take his semifinal against Wawrinka, but that match was nearly two hours shorter than Nadal’s win Friday. Nadal has won 23 of 34 matches against Federer, and 9 of 11 meetings at Grand Slam events. Nadal’s 14 Grand Slam titles is second among active players, behind Federer’s 17. Federer has not won a major tournament since Wimbledon in 2012. “It’s special to play with Roger again in a final of a Grand Slam,” Nadal said. “I cannot lie. It’s great. It’s exciting for me, and for both of us, that we’re still there and we’re still fighting for important events. ” The women’s final Saturday night also will feature the two active players with the most Grand Slam singles titles, with the   winner Serena Williams meeting her sister, the   winner Venus Williams. This is the first Grand Slam tournament in the Open era in which all four singles finalists are 30 or older.'"}, "time": 1742564571.1141264}