{"duration": 0.13016510009765625, "input_args": {"text": "'It took Alison Wright 34 years to land her first big role, as poor Martha Hanson, the   F. B. I. secretary on FX’s “The Americans. ” And another four  —   after Martha made the shattering discovery that her marriage to Clark Westerfeld, an alias of the K. G. B. agent Philip Jennings (Matthew Rhys) was mostly a sham  —   to break viewers’ hearts and be jettisoned off the series (maybe to Moscow). But Ms. Wright’s career was just starting to soar. After roles in “The Accountant,” the Ben Affleck feature, and “Sneaky Pete,” the Bryan Cranston series for Amazon, she will make her Broadway debut in Lynn Nottage’s “Sweat,” beginning performances at Studio 54 on Saturday, March 4, which is transferring from the Public Theater. Ms. Wright plays Jessie, a factory worker in Reading, Pa. who finds herself pitted against her friends as jobs become scarce and society crumbles. “These are the people who maybe voted for Trump, or chose not to vote at all today,” Ms. Wright said of the play, set in 2000 and 2008. “Lynn has put real people behind the numbers of whole cities evaporating, in a way. ” Ms. Wright, a subversively witty native of England’s Lake District who lives in Harlem with her maltipoo, Luigi, talked about blooming late. These are edited excerpts from the conversation. Will Martha be back this season? No comment. They’ve told me that I can say something they’ve said many times themselves: She’s alive  —   and if you’re alive on “The Americans,” there’s always hope for you. Which is fair enough, but it’s certainly something that everybody is dying to know. I’m asked on a daily basis. Are you sick of the questions? No, it’s  . I’ve noticed just this real tenderness when they talk to me about her, their genuine concern and sympathy and empathy. It’s quite lovely, because it didn’t start out like that. Does a part like Jessie in “Sweat” give you empathy for people whose politics may not reflect your own? With these people’s stories, you can’t help but see how they just did what they needed to do to survive, because nobody was listening to them. Nobody was going to help them. O. K. I now can understand and have empathy for this part of society. That’s tremendous, right? That’s what theater is supposed to do. And now you’re making your Broadway debut at 40. [Sings] Yesss! I set the benchmark for myself about a year ago, actually, at the end of Season 4 of “The Americans. ” “OK, when I’m in a real part  —   not a bit part  —   on Broadway, that’s when I can feel that I’ve made it as an actor. ” It has been a long time coming. And some  —   in fact, most  —   never get to Broadway. This is true. That’s a good attitude. Or on a Ryan Murphy show. You have another timely role, as Pauline Jameson, playing opposite Jessica Lange and Susan Sarandon in his FX series, “Feud: Bette and Joan,” which begins Sunday. I am perhaps the single composite regular  —   a little bit of all the women in the studio systems who were girl Fridays and very competent and able. She can hold her own with Joan Crawford and Bette Davis, and she wants to have a future in the business. But it’s 1962, so she’s not in control of that for herself. I’m not sure how far we’ve come in 2017. It’s funny  —   I have a very big fourth episode, and the first part of it we filmed before the election, and there was a lot of this stuff that was very tongue in cheek at the time: “You know, some guys don’t like the idea of a woman in charge. ” Then we went back [the day after the election] to shoot the rest, and it had a whole different gravitas to it. You’ve described the show as a very   examination of aging in Hollywood. Susan Sarandon said that when she started, 40 was the cutoff, the hard line. That’s it  —   roll over and die. And that’s certainly been pushed, specifically by people like Ryan Murphy. He’s a real champion of women. I think there were 15 roles in this show for women over the age of 40. Keri Russell and Matthew Rhys of “The Americans” got awards love this year, though they didn’t win. Whatever the competition is, it’s not always the best person or the best work that wins. Meryl’s only got three Oscars. It’s clearly a flawed system. But I don’t want to say anything here that’s going to make sure I never get an award  —   because I really want one! How do you get those amazing eyebrows? They’ve had this much attitude since I was 5 years old.'"}, "time": 1742564269.9056454}