{"duration": 0.16216135025024414, "input_args": {"text": "\"Jails and prisons across the country struggle to tamp down the sale and use of contraband cell phones. But for many prisoners, especially those involved in the national prison strike against slave labor, access to such technology is considered a lifeline.\\nPrisoners in Alabama, South Carolina, New York, and other states use contraband phones to communicate with family, supporters, and members of the media about their work, and to document the violence, deteriorating and filthy facilities, and the testimonies of other incarcerated people. If prisoners did not have access to these cell phones, it’s possible the public would know even less about the prison strike than they do today.\\n“A lot of people have phones in prison. But a lot of them are scared to use them the way we use them. It’s complicated,” said a prisoner, who was granted anonymity to prevent retaliation from prison officials. “Being able to stay in contact with our families is helpful as far as rehabilitation goes.”\\n“Cell phones are part of the day to day life that we live in today. To say that you’re preparing someone to re-enter society and to rehabilitate them [and then] say that they can’t have access to a cell phone is contradictory,” the prisoner argued. “This serves as a supplement to rehabilitation but also it allows us to be connected to society, to the actual world that we’re going to be entering back into when we go back out there.”\\n“They don’t let the media inside of any prisons in any state. If they do allow the media to come in, it’s a dog and pony show. They walk them where they wanna walk them. They don’t let them talk to nobody they don’t really want them to talk to. So there’s no realistic perspective of what prisons are really all about.”\\n“With these cell phones, it allows us to put the reality out there, and they’re afraid of that. And they should be, because of what’s going on in the prisons.”\\nAnother incarcerated person, who operates the @prisonslavery1 Twitter account, told Shadowproof, “The prison system slave drivers want to muffle our voice, dehumanize us through silence.”\\n“With them allowed to control the narrative and the prisoners silenced under brutal repression tactics, it’s a win-win for the enslavers. These phones level the playing fields. These (weapons) will go down in history as an essential tool used by 21st century slaves,” they said. “These weapons will cause their collapse. As we continue to expose them and push for human rights”\\nGoing back to the prisoner, who spoke about cell phones as a connection to society, the phones may be especially useful to incarcerated parents eager to play a role in their children’s lives.\\n“Children live in households that they’re not in control of. They can’t just call collect to reach someone else’s house. They may be able to get a phone and let’s say their child acts out and they’re going through something. Well, that child can call their parent, their daddy or their momma on the cell phone and say, ‘Dad I’m in a bad situation. What do I do?'”\\n“But the wall phone, [the child] can’t call the wall phone. That’s a problem that [the parent] can’t offer advice, that he can’t help.”\\nThe prisoner pointed out that many of these phones are smuggled in by the officers and sold at a high price to the incarcerated. But he argued the primary motivation for prison officials to clampdown on contraband phones is that it deprives them of a revenue stream.\\n“They’ll say, ‘Well, if you got the money to pay for the cell phone, you should be able to pay for the [wall] phone bill. But the cell phone allows us unlimited calls. The wall phone you have to pay every time you use the phone.”\\n“So if I pay $60 a month and I get unlimited calls, well that may be five or ten phone calls on a wall phone. And after that it’s over with. It’s not an unlimited amount of time on the phone call.”\\n“You get 15 minutes—that’s a $6 phone call,” they added. “You got to hang up and call back. Fifteen more minutes, six more dollars, so you can run through your 10 phone calls in just a few hours and that’s it. You can’t talk to anyone else for the rest of the month ’cause they don’t have money.”\\n“So [cell phones] just make it easier, it makes everyone more accessible. They can check on their cases, if they cant find information they can call a lawyer or they can seek legal help. You can’t do that on a wall phone, you really can’t help yourself on a wall phone.”\\n“If they allowed us to have cell phones and they told us they were gonna monitor our calls, no one would care,” the prisoner argued. “The issue is not that they’re monitoring our phone calls, we’re not on the phone trying to get in touch with ISIS or no shit like that. We’re trying to call our brothers and see how their day was at school.”\\nThe prisoner mocked the argument by prison officials that the phone are how they get drugs in the prison. He noted drugs have been in prisons since their inception.\\n“They had drugs and shit, since the first time the prison doors open. So the cell phones do not facilitate anything. If the individual wants to commit crime, they’re gonna do it regardless. So the cell phone is not a part of that.”\\nThe post For Incarcerated, Contraband Cell Phones Are Lifeline To Outside appeared first on Shadowproof .\\n\""}, "time": 1742564291.4699807}