{"duration": 0.10667729377746582, "input_args": {"text": "'SINGAPORE  —   Brandon Vera was recently pinned in a corner by an excited mob at a shopping mall in the Philippines, and briefly thought that he might have to fight his way out. But instead of brandishing weapons, the crowd was armed with pens and cellphones, hoping to get autographs and selfies with Vera, one of Asia’s most popular mixed martial arts fighters. The incident is a common occurrence for Asian celebrities as varied as athletes and actors and Korean boy bands, but Vera’s presence at the center of a fan frenzy made it different: he is an American, a former college wrestler from Norfolk, Va. who moved to his ancestral homeland three months ago, ahead of the first defense of his mixed martial arts heavyweight title, which he won in December in the Philippines. “It’s been overwhelming, wondering why I get so much attention,” Vera, 38, who fights for ONE Championship, Asia’s largest mixed martial arts promoter, said at a recent M. M. A. function in Singapore. “And most of the time I’m thinking, Whoa, whoa  —   what’s going on here? Honestly, that is the question that goes through my head every day. ” While mixed martial arts is one of the   sports in the world, and most of the top M. M. A. fighters in Asia were born on the continent, an increasing number  —   including two current   champions  —   have returned to their ancestral homelands to compete, some with great success and huge fan bases. “I see that their success is that they are very humble and accessible to fans,” said Matt Eaton, editor of The Fight Nation, a leading online M. M. A. news site based in Hong Kong. He said that many young fans “can go out and meet a Brandon Vera, so they don’t feel disconnected from the athletes like they are with other international sports. ” Eaton added: “And they are embracing their heritage, which a lot of people feel is very genuine. People feel they can connect to them. ” Among those projected for international fame are Vera and Angela Lee, the reigning Asian female M. M. A. fighter of the year. Lee, a    atomweight fighter (105 pounds or less) who grew up in Hawaii, was crowned the ONE Championship’s first female titlist in May. Unlike Vera, a heavyweight who bears a striking resemblance to the actor Vin Diesel, Lee has lightning speed that she uses to tackle opponents before forcing them to submit with her wrestling and jujitsu skills. Five of her six professional wins with One Championship have come by submission. But with her new belt and a series of magazine covers, her profile has risen so quickly, she said, that she cannot make it home from training on Singapore’s commuter trains without being surrounded by   admirers. For now, this is her home. Although she comes from a multiethnic family, Lee enters the cage for her fights draped in a Singaporean flag. “I, myself, am a   American, raised in Hawaii, but of Korean and   ethnicity,” Lee said. “How can you wrap your head around that? “So who do you really represent? I’m equally proud to represent everywhere  —   all my ethnicities, all my nationalities, because it makes me who I am. I’m not just one thing. You can’t just live with me as Singaporean, as Canadian, as American. I’m everything together. ” So is Aung La N Sang, a Burmese middleweight contender who, along with his mother and two siblings, was granted political asylum in the United States after he moved there in 2003 to attend Andrews University in Michigan. Aung graduated with an agricultural degree in 2007 and worked as a migratory beekeeper while keeping up his training. Eventually he turned professional, and he became an American citizen last December. Aung does most of his training in Baltimore, but on Oct. 7 he will fight for the second time in Yangon, Myanmar. He said he hoped to earn a title shot next year. Still, he is taking his sudden celebrity  —   he says he has trouble using restaurant bathrooms without people approaching him for selfies  —   with a grain of salt. “The way society is set up there, they don’t promote sports as much,” Aung said. “Parents in Myanmar don’t really tell you to be a football player they tell you to be a lawyer, doctor or businessman. So it’s hard to develop sports stars, in that sense, and all the industries promote singers, models, actresses  —   those people are always on the front of the magazine covers. They look up to them, not athletes. ” Yet that may only add to the appeal of foreign fighters. Since many Asian M. M. A. fighters, in particular those from developing countries, are still developing the skills to compete for major international titles, promoters have found that fans in the Philippines, Singapore, Myanmar and elsewhere are eager to support   fighters who have embraced their heritage. “Because there is a lack of homegrown stars,” said Marcus Laur, the founder of the sports marketing company Total Sports Asia, “these foreign imports grab that vacant space and the fans jump on it. ”'"}, "time": 1742562040.3662236}