{"duration": 0.10156679153442383, "input_args": {"text": "'posted by Eddie Most school kids watch the clock during the last few classes of the day, watching the time steadily tick until they can run home and play, hang out, or sleep, depending on the age. Watching the clock is not a sign of immaturity since we understand it can sometimes be difficult to sit in one place and concentrate on difficult tasks for an extended period of time. This habit often follows us through life as we settle into jobs and careers. It could be that we love our work, but around three and four o’clock, we begin to fidget. We start thinking about the things we will have to do when we get home, like shop, go to the gym, make dinner, or attend a special event. The last two hours tick away more slowly than the first two. This innovative Swedish company has found the solution to this problem. You will be so jealous! The 6 Hour Work Day for Sweden Filimundus is a Swedish mobile app developer where this idea was originated. The board of directors analyzed their employees and noted the difficulties in maintaining efficiency and concentration for eight hours. It was almost impossible for most of the workers. They had to take breaks to clear their heads and try to muster up more focus for the remainder of the day. This wasted a lot of potentially productive time. \\nThe board of directors found the perfect solution, a six hour work day, with wages left unaffected. They tried it out and discovered that the employees could complete the same amount of work within six hours which they were originally doing within eight. This new practice increased their efficiency at their jobs and left more time and strength for their home life. Overall, the employees agreed that they felt happier and more successful with this new arrangement. The Ripple Effect \\nThis newly improved schedule is being looked into by medical workers of some clinics . That is no surprise figuring how exhausting their job must be. According to The Independent , the six-hour working day will soon be implemented in the whole country. (1) 6 Hour Day for America? \\nFor most employees who have the 9 to 5 shift, not all of that time is optimized for working. According to studies from The Atlantic , an estimated 1.5 to 3 hours per day is used for online shopping, checking social media and emails, personal phone calls, and chatting with colleagues. It seems that the average employee works a solid six hours anyway, but without the benefits of enjoying free time and rest. A shortened work day means less stress, and we all know how important that is for our health. (2) We would all appreciate a shorter work day, but most of us are not moving to Sweden, and no one should hold their breath for this new schedule to come to their office anytime soon. Sources: (1) Bright Side brightside.me Published: September 5, 2016. Accessed: October 27, 2016. (2) S. Kumar. What the U.S. could learn from Sweden’s 6-hour work day fortune.com Published: October 6, 2015. Accessed: October 27, 2016. From Around the Web Founder of WorldTruth.Tv and WomansVibe.com Eddie ( 8938 Posts ) \\nEddie L. is the founder and owner of www.WorldTruth.TV. and www.Womansvibe.com. Both website are dedicated to educating and informing people with articles on powerful and concealed information from around the world. I have spent the last 36+ years researching Bible, History, Alternative Health, Secret Societies, Symbolism and many other topics that are not reported by mainstream media.'"}, "time": 1742563099.120747}