{"duration": 0.09948253631591797, "input_args": {"text": "'CLEVELAND  —   The start of the Republican National Convention on Monday instantly inspired dueling protests, with both supporters and critics of Donald J. Trump pressing their cases in neighboring demonstrations as Republicans strained to project party unity. But amid the twin national reckonings over police violence and violence against the police, officers here seemed determined to avoid provoking those who gathered. Though the police presence was felt at every turn, where uniformed officers often waited on rows of bicycles, they intervened in the protests sparingly, to enforce security perimeters or, in a handful of instances, to separate protesters and counterprotesters. “It’s a little scary,” Kim Moran, the wife of an Illinois delegate, said as she recorded a video of an   rally. “There’s just a lot of hate going on. ” Yet for most of the day, rival demonstrators appeared to have achieved a relative peace, however fleeting it might prove. The proceedings began around noon, when about 200 Trump supporters gathered in a park for an “America First” rally, hauling lawn chairs and, occasionally, carrying firearms for an event intended to exhibit the breadth of Mr. Trump’s followers. Subgroups drawn to the rally included Bikers for Trump, Truckers for Trump and Students for Trump. “He’s never said anything racist,” said Eric Smith, 36, who is black and was wearing a Trump  . “He means just to say, ‘Make America great again as itself.’ It’s like, ‘Build yourself up and then you can build up the people around you. ’” Soon, Roger J. Stone Jr. a longtime Trump confidant, regaled the crowd with attacks on Hillary Clinton. Meeting at a public square less than a mile away, hundreds of   protesters marched through downtown Cleveland, hoping to move as close as possible to the Quicken Loans Arena, the site of the convention. When they arrived at the low concrete barriers outside the arena, they chanted: “Shut it down!” After a few hesitant moments, people began climbing over the barriers. The police did not interfere. As marchers approached the main security checkpoint for the convention grounds, where delegates pass through Secret Service screenings, a phalanx of officers on bicycles rode tire to tire, preventing the protesters from reaching the inner security perimeter. “There are all kinds of different groups here for different reasons, but we’re united to shut this down,” said Holly Counterpane, a protester from Chicago. “Nobody’s trying to hurt, get hurt or get arrested. ” The officers, like urban cattle wranglers, steered the marchers along a row of downtown restaurants. Bryan Hambley, a Cleveland doctor who is organizing a protest march against Mr. Trump planned later this week, said the news media had exaggerated the potential for violence and chaos. “The Trump supporters are having their rallies across town,” he said as the first   gathering began. “They didn’t send any counterprotesters here. ” He added, “We didn’t send counterprotesters to antagonize them. ” At times, officers positioned themselves between small groups of   protesters and counterprotesters as the dueling groups exchanged insults. Before the convention began, the shooting deaths of three police officers on Sunday in Baton Rouge, La. promised to cast a pall over the first day. Mr. Trump has taken pains to present himself as the “law and order” candidate  —   the theme of Monday’s convention program is “Make America Safe Again”  —   and the campaign has made clear its plans to capitalize on the national sense of unrest. The smattering of demonstrations on Sunday had been mostly tame. But with the convention officially beginning, the slate of protests on Monday produced a measure of tumult. Around 3 p. m. the band Prophets of Rage, which includes veterans of Rage Against the Machine, highlighted a second   march, which later joined with an antipoverty march. “Thank you for coming out today with your joy and your militancy,” Tom Morello, a guitarist with the group, told the crowd. His hat bore a message: “Make America Rage Again. ” While organizers had expected thousands of people at the antipoverty march, the total was closer to a few hundred, shouting slogans like “Cleveland means we got to fight back” and “they think it’s a game, they think it’s a joke. ” Some demonstrators expressed mixed feelings about the conspicuous police presence. Rodrigo Starz, part of the   duo Rebel Diaz, surmised that there were “more police than people,” calling the officers’ approach menacing and unnecessary. But, he said, he was grateful that the march had been peaceful. The attack in Baton Rouge on Sunday had prompted urgent calls from one local police union to restrict   gun laws near the convention site. Gov. John Kasich of Ohio, a Republican, said he could not legally intervene, given the state’s gun laws. Calvin D. Williams, Cleveland’s chief of police, told reporters on Monday that the shooting in Baton Rouge had not altered the city’s security plans. After five officers in Dallas were killed this month, the police here began dispatching patrol cars with at least two officers at a time. “Our officers are told to be especially cautious,” Chief Williams said. At another briefing in the early evening, Chief Williams said one person had been arrested on Monday, a woman with a felony warrant. He did not say what the warrant was for. He said officers had confiscated several items, including a small knife, gas masks and a slingshot. Still, some attendees seemed a bit skittish about their security, wondering aloud about the state’s   designation. One Trump supporter, John Nadler, 63, said he feared his Trump apparel made him a target. “Even Governor Kasich said he’s not going to stop open carry,” said Mr. Nadler, one of the few Trump admirers from Chappaqua, N. Y. where Mrs. Clinton lives. “They got cops, I’m afraid they are going to get me. I got a Trump hat and a Trump  . Why not pick me off?”'"}, "time": 1742561754.86915}