{"duration": 0.09558558464050293, "input_args": {"text": "'The Huffington Post has refused to remove an article on its Arabic website that claims the Islamic prophet Muhammad was poisoned by a Jew. [The article was published on November 29, but has remained live on the website for nearly seven weeks. Once the article drew criticism, the editors changed the headline from “‘Arsenic’: The Poison Which a Jewish Woman Put in the Food of the Prophet, Peace Be Upon Him” to “Did the Prophet Die From Being Poisoned With Arsenic?” but the content reportedly remains the same.  In a statement, the   League said: “It is troubling that an   screed cleared The Huffington Post’s editorial review process and that our concerns so far have been ignored,” said Jonathan A. Greenblatt, ADL CEO. “We call on The Huffington Post to immediately remove this offensive entry and to ensure that the proper safeguards are in place so that the Arabic site is free of   and incitement against Jews. ” The Jewish Telegraphic Agency adds that the Huffington Post’s Arabic website has also been hit with other recent accusations of bigotry: “The Huffington Post’s Arabic edition was also criticized late last month for calling attention to late pop singer George Michael’s ‘homosexual tendencies.’ A   blog, Israellycool, points out that the argument in the article is based on widely accepted Islamic sources, and that the Huffington Post is having difficulty confronting the fact of widespread   prejudice in the Muslim world: You can, if you wish, plough through rebuttals of whether the woman’s poison actually killed Mohammed, but the act of the poisoning remains pretty much undisputed. It is the efficacy and specific detail of which poison was used which the HuffPo blog post addresses and which the ADL has decided to get upset about. More important, however, than whether any of this happened as described is what do many Muslims teach their kids. And in this there is little doubt. The story of Mohammed being poisoned by a Jewess is commonly told and commonly believed. The ADL recently made, then backed away from, claims that Breitbart News is the “premier” site of the   and that Breitbart News Executive Chairman Stephen K. Bannon, now entering the Trump administration, is an antisemite. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563098.5916212}