{"duration": 0.04865455627441406, "input_args": {"text": "'Legendary guitarist Carlos Santana weighed in on Adele’s sweep of the Grammy Awards earlier this week, telling the Associated Press in Australia on Tuesday that Beyoncé should not have won the night’s most prestigious prizes because “she’s not a singer. ”[Adele took home five Grammys Sunday night, including Album of the Year for her smash hit 25, plus Song of the Year and Record of the Year for the album’s single, “Hello. ” Beyoncé, meanwhile, picked up two awards, for Best Music Video (“Formation”) and for Best Urban Contemporary Album.  “I think that Adele won because she can sing, sing,” Santana told the Australian AP. “With all respect to our sister Beyoncé, Beyoncé is very beautiful to look at and it’s more like modeling kind of music  —   music to model a dress  —   she’s not a singer, singer, with all respect to her. ” Adele and Beyoncé both performed during Sunday night’s ceremony, the latter employing visual effects and a large crew of backup dancers for her songs “Love Drought” and “Sand Castles,” off of her Black Lives   album Lemonade. Adele opened the show with a performance of her eventual   “Hello,” and later returned to the stage to perform “Fastlove, Part 1” in a tribute to the late pop icon George Michael. “Adele can sing, sing,” Santana said. “She doesn’t bring all the dancers and props, she can just stand there and she just stood there and sang the song and that’s it, and this is why she wins. ” Not everyone was thrilled with Adele’s sweep Sunday night Beyoncé’s devoted fans, known as the “Beyhive,” were outraged that the Lemonade singer wasn’t awarded the top honor. In her acceptance speech, an emotional Adele praised Beyoncé’s album as “monumental. ” “I can’t possibly accept this award,” she said. “The Lemonade album was just so monumental, Beyoncé. It was so monumental and well   and beautiful and    …     we appreciate that. All of us artists here adore you. You are our light. ” Beyoncé is the most nominated female artist in Grammy history, with 62 nominations, and has won 22 of those awards, but failed to claim Album of the Year in three straight nods.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564013.2579827}