{"duration": 0.05181741714477539, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump has selected Representative Mick Mulvaney of South Carolina, a conservative Republican member of the House and a fierce advocate of deep spending cuts, to be his budget director. “He’s a tremendous talent, especially when it comes to numbers and budgets,” Mr. Trump said in a statement. Mr. Mulvaney, 49, helped found the House Freedom Caucus, the group of conservative lawmakers who pushed for Speaker John A. Boehner to resign. As budget director, Mr. Mulvaney would help guide the  ’s promise of a repeal of the Affordable Care Act, a tax overhaul and a huge investment in the nation’s infrastructure. An early backer of Mr. Trump’s during the campaign, Mr. Mulvaney has taken a hard line on spending during President Obama’s term, vowing not to raise the nation’s debt limit and embracing the term “Shutdown Caucus” because of his willingness to shut the government down instead. Mr. Mulvaney was elected in the Tea Party wave of 2010, when he defeated John Spratt, a veteran Democratic congressman who had been chairman of the House Budget Committee. He won by branding his opponent a   liberal, unconcerned about fiscal prudence. Once on Capitol Hill, Mr. Mulvaney joined a conservative bloc that pressed for slashing federal spending more deeply than House Republican leaders preferred, and became a prominent face of the   movement on Capitol Hill. He was one of several dozen House Republicans who refused to back the deal to raise the statutory debt limit. Mr. Mulvaney has repeatedly opposed some of his own party’s budget proposals, and quickly established himself as one of the most outspoken members of that 2010 class of Republicans. By 2013, at the outset of his second term, he declined to support Mr. Boehner’s   as speaker, abstaining from the vote in protest. Strongly   Mr. Mulvaney, who has a degree in international economics from Georgetown and a law degree from the University of North Carolina at Chapel Hill, chafed as much at the Republican leadership in the House as he did at Mr. Obama’s direction from the White House. If confirmed by the Senate to run the Office of Management and Budget, Mr. Mulvaney will be responsible for helping to shepherd the president’s spending requests through a   Congress.'"}, "time": 1742561683.2395432}