{"duration": 0.031714439392089844, "input_args": {"text": "'More fake news from the Washington Post: turns out that the Environmental Protection Agency (EPA) has helped save Americans from a substance which kills 4. 2 million people every year  —   air pollution. [No really. If you believe WaPo it’s the fifth deadliest killer known to man:  The researchers concluded that exposure to particulate pollution was the fifth deadliest health risk of all 79 they studied, ranking behind high blood pressure, smoking and high blood sugar, and about matching high cholesterol  —   conditions many people upend their lives in order to mitigate. Air pollution exposure was deadlier than having high body mass index or alcohol use. So clearly, WaPo’s message runs, President Trump would be mad to rein in this vitally important agency. Except the claims just aren’t true. As Steve Milloy explains in lavish and incontrovertible detail in his book Scare Pollution: Why and How to Fix the EPA this whole scare story is based on the flimsiest of junk science. In a chapter called EPA Fails Every Test  —   because it describes how the EPA fails every test  …      —   Milloy describes failings in the EPA’s methodology so spectacular you’re left gasping in disbelief that this could be the handiwork of a real government agency. Surely, you tell yourself, this must be some kind of Manchurian EPA, a sort of parody organisation designed and funded by some sinister   cabal with the express intention of satirising Big Government lunacy and discrediting the Obama administration which relied on it so heavily to advance its war on capitalism. But no the Environmental Protection Agency really is as useless as its critics say  —   and nowhere is this more evident than in the way it concocted a completely dishonest air pollution scandal involving particles classified as PM2. 5. If you believe WaPo’s editorial, this is the fifth biggest killer of our age. But that’s only because they’ve taken at its word a big new report State of Global Air  —   which was part funded by the Environmental Protection Agency and which used the same suspect methodology the EPA used to finger PM2. 5 as the major environmental problem it simply isn’t. Milloy who has testified before a number of Congressional hearings on the subject describes it as the “biggest government science fraud of our time. ” What the EPA and its useful idiots in the media have done is to take the public’s perfectly natural concerns about pollution and air quality  —   but then demonise air particles so tiny and ubiquitous that it’s quite impossible to regulate against them without damaging whole swathes of US industry. Which is exactly what the EPA has done. Its ozone rule  —   introduced to combatPM2. 5 has lumbered the US economy with an estimated $1 trillion in compliance costs and more or less destroyed the US coal industry, wiping out 90 per cent of its value during the Obama years. So there must be some evidence to justify all those job losses and all that massive economic damage? Nope. None at all. You can read the full details on this fact sheet. Not one single epidemiological study, not one toxicological study, not one clinical study has EVER demonstrated that PM2. 5 is capable of causing death either in the short term or due to prolonged exposure. If these tiny particles (which by the way are produced by dust, pollen, mould, pet dander, forest fires, sea spray and volcanoes, among other natural sources, as well as from cigarette and dope smoking, wood fire burning and fossil fuel burning) were as deadly as the EPA claims, people would be dropping like flies from London to New York to Beijing. But they’re not. The whole problem is an EPA fabrication. Another fakenews scare, eagerly promoted by the liberal media, in order to stop the Trump administration doing what needs to be done to Make America Great Again.'"}, "time": 1742628427.8901536}