{"duration": 0.07577013969421387, "input_args": {"text": "'WASHINGTON  —   The White House press secretary, Sean Spicer, has taken to slapping journalists who write unflattering stories with an epithet he sees as the epitome of   New York   gossip: “Page Six reporter. ” Whether the New   spokesman realizes it or not, the expression is perhaps less an insult than a reminder of an era when Donald J. Trump mastered the New York tabloid terrain  —   and his own narrative  —   shaping his image with a combination of    bluster and    gossip. He’s not in Manhattan anymore. This New   of politicians, now an idiosyncratic,     president, has stumbled into the most conventional of Washington traps: believing he can master an entrenched political press corps with far deeper connections to the permanent government of federal law enforcement and executive department officials than he has. Instead, President Trump has found himself subsumed and increasingly infuriated by the leaks and criticisms he has long prided himself on vanquishing. Now, goaded by Stephen K. Bannon, his chief strategist, Mr. Trump has turned on the news media with escalating rhetoric, labeling major outlets as “the enemy of the American people. ” His latest swipe  —   pulling out of Washington’s   nerd prom  —   came via Twitter on Saturday. “I will not be attending the White House Correspondents’ Association Dinner this year,” Mr. Trump wrote. “Please wish everyone well and have a great evening!” He has made a sharp break from previous presidents  —   and from his own comfortable   tango with the tabloids. “New York is extremely intense and competitive, but it is actually a much smaller pond than Washington, where you have many more players with access to many more sources,” said Howard Wolfson, who has split his career between New York and Washington, advising former Mayor Michael R. Bloomberg and Hillary Clinton’s 2008 presidential campaign. “In New York, you can create a manageable set of relationships in a smaller universe,” Mr. Wolfson said. “In Washington, that becomes a lot more complicated. ” There is another fundamental difference: During his Page Six days, Mr. Trump was, by and large, trafficking in trivia. As president, he is dealing with the most serious issues of the day. They involve the nation’s safety and prosperity, and it is the role of news organizations to cover them. If Mr. Trump’s    relationship with reporters had a model back then, people close to him say, it was the gregarious,    style of Edward I. Koch, the   New York mayor. But his mood in Washington has turned darker, and over the last week he has executed, alongside Mr. Bannon and Mr. Spicer, what amounts to the most sustained White House campaign against the news media since Richard M. Nixon’s second term. “It’s like Nixonian times again,” said George Rush, a veteran New York gossip columnist who has covered Mr. Trump for decades. “I just thought he would have a thicker skin. ” Linda Stasi, who chronicled Mr. Trump’s    marriage to Marla Maples in the 1990s for two New York papers, said she could have predicted the presidential agita. “He would plant stories and he would get mad if they didn’t come out exactly as he wanted,” she recalled of earlier dealings with Mr. Trump. “It never occurred to him that he couldn’t control everything. ” Now, Ms. Stasi said, “he is shocked that he is not in control of the press. ” Attacking the news media, which has an abysmal approval rating among Republican voters, is sound politics in the short term. But Mr. Trump’s fury is less strategic than heartfelt. He watches cable TV at night and exhorts aides like Mr. Spicer and his policy adviser Stephen Miller to be tougher, according to White House aides. His anger is compounded by his belief that he should still be able to plant and steer stories. That was a lot easier to do when he was running a   real estate and branding business with an aggressive legal team that demanded that nearly everyone in his orbit sign nondisclosure agreements. For the first time in his life, Mr. Trump is on the public payroll and subject to a tangle of laws and rules no businessman  —   especially one accustomed to overseeing every aspect of a relatively small family business  —   would tolerate. To some extent, the clash with the press was inevitable. Mr. Trump may be noisier and more confrontational than many of his predecessors, but he is being   lessons all presidents eventually learn  —   that the iron triangle of the Washington press corps, West Wing staff and federal bureaucracy is simply too powerful to bully. Mr. Trump’s relationship with the press during the 2016 campaign was rocky and paradoxical. He was, at times, accessible  —   frequently calling reporters to kibbitz, complain or make news. But as the resentments piled up, his staff, led by Corey Lewandowski, his first campaign manager, made a point of snubbing journalists it did not like and confining reporters to a small pen at rallies. Mr. Trump quickly realized, aides said, that his attacks on the “dishonest” news media were as popular as his hits on “crooked” Hillary Clinton. The addition of Mr. Bannon to the campaign team last summer gave the jostling hostility a sharper edge. Last month, Mr. Bannon described the   relationship as “a war” in an interview with The New York Times. “I want you to quote this,” he said. “The media here is the opposition party. They don’t understand this country. They still do not understand why Donald Trump is the president of the United States. ” Things have deteriorated since then. The White House, on the defensive last week after a series of missteps and leaked stories, sought to shift to offense, targeting the news media as an enemy, in the absence of any more formidable foil in a city now firmly controlled by Republicans. Mr. Bannon, a former Goldman Sachs executive and Hollywood producer who made a fortune from the syndication of TV shows, described the “corporatist media” as the “opposition party” in a speech on Thursday. The next day, Mr. Spicer excluded selected news organizations, including The New York Times, Politico and CNN, from a   version of his daily briefing. Then there was Mr. Trump’s   attack on “fake news” during his speech at the Conservative Political Action Conference on Friday, which was met with shouts of approval from the conservative faithful. Reporters back in New York, however, knew that the president’s call for an end to “sources”  —   meaning anonymous sources leaking damaging details of his campaign’s relationship with Russian officials  —   did not jibe with his onetime role as a   gossipmonger, trumpeting his business dealings and romantic life in   phone calls. “I’m against the people that make up stories and make up sources,” Mr. Trump said. “They shouldn’t be allowed to use sources unless they use somebody’s name. Let their name be put out there. Let their name be put out. ” “He used to be the one leaking!” Ms. Stasi pointed out on Friday from her office at The Daily News, where she is a columnist. “He was leaking about himself. He would call up with fake accents and pretend it wasn’t him. He would tell us 100 times: ‘Now listen, I’m going to tell you something, but it didn’t come from me. ’” Mr. Trump, who taunted his   critics on Friday  —   “Let ’em say it to my face!”  —   hid his own identity to push   stories in the 1980s, posing as his own   man under the fake names John Miller and John Barron. Despite his dominance of social media, Mr. Trump still retains a slightly anachronistic view of the press. He prefers ink to pixels, asking staff members to print out online articles and reviewing the day’s newspapers  —   black Sharpie in hand  —   with Mr. Spicer in the Oval Office at the end of each work day. Mr. Trump reads bylines and remembers them. He also keeps obsessive track of his presence in the press. During an interview at Trump Tower last spring, the future president proudly showed off a boardroom filled entirely with stacks of magazines and newspapers featuring his visage. The publications, which covered an entire conference table, ran the spectrum from The Wall Street Journal to The Hollywood Reporter to Newsweek and Time. Framed copies of Playboy, TV Guide and Variety hung on the walls. It was a living, expanding shrine to his political rise  —   and a physical manifestation of his media fixation. Still, for a sophisticated consumer of news, Mr. Trump retains a brutally simple, almost Manichaean view of his coverage: good stories are good, bad stories are evil. It could prove an untenable attribute for the most scrutinized man in the world. “He loves the press he lives for it,” Howard Stern, a frequent Trump interviewer and friend, said this month. “He wants to be liked he wants to be loved. ” Being president, Mr. Stern added, is not “going to be a healthy experience. ”'"}, "time": 1742628517.5576046}