{"duration": 0.19013381004333496, "input_args": {"text": "'  George Mason Univ. Gets Their Fascism On – Who Knew It Was A Crime To Hang Anti-Terrorism Posters? George Mason Univ. Gets Their Fascism On – Who Knew It Was A Crime To Hang Anti-Terrorism Posters? November 17, 2016, 2:00 pm by Terresa Monroe-Hamilton Leave a Comment 0 \\nNoisyRoom.net \\nMy friend and compatriot Oleg Atbashian found that out the hard way. Imagine my surprise this morning to find out he had been roughed up and arrested in Fairfax, Virginia. His crime was hanging anti-terrorism posters on the university campus. Oh, and bonus… he wasn’t even read his rights. He is now out on $8,000 bail for putting up pro-Israel posters to combat a pro-Islamist conference at George Mason University. He faces the very real prospect of five years in prison for allegedly committing a “class 6 felony.” \\nOleg is an artistic genius. His satirical site, The People’s Cube , is one of the very best out there. Oleg did the graphics for NoisyRoom and has done work for Trevor Loudon and Cliff Kincaid as well. He is a member of a small circle of commie hunters out there. We all have very long memories and we take it very personally when one of our own is treated like this. \\nOleg: “Back in my Soviet dissident days, when I was collecting signatures in defense of Andrei Sakharov, I was screamed at, threatened, and lectured by the KGB and Communist functionaries,” Oleg says. “What I never imagined was that in the United States, the land of the free, I would not only be subjected to similar treatment, but go to jail .” \\nDaniel Greenfield of FrontPage Mag and Sultan Knish fame had this to say regarding Oleg: \\nOleg’s mixture of art and satire took off with Communists for Kerry. He’s the mastermind behind The People’s Cube and his tweaking of the radical left and its alliance with Islamic terrorists allowed him to continue the same fight he had pursued in the days of the Soviet Union. But as the US comes to resemble the USSR, political satire and activism carries a serious price. \\nThis is what happened to Oleg when he put up some of his Freedom Center posters challenging the anti-Semitic environment created by the left’s alliance with Islamic terrorists on campus. \\nThis was supposed to be a two-day poster campaign, to counteract the George Mason University hosting an official national conference for Students for Justice in Palestine (SJP), which is an anti-Semitic organization with well-documented ties to Hamas – a terrorist group whose stated goal is to exterminate the Jews. The GMU poster campaign was conceived by the David Horowitz Freedom Center. \\nIn every communist regime or despotic hellhole throughout history, one of the first groups of people they go after are the artists. They are considered especially dangerous. That’s when they aren’t going after Jews of course. Oleg went to GMU to hang posters and stickers against Justice in Palestine. A group that has terrorist connections. Instead he was treated like a domestic terrorist himself. \\nThe police knew which rental car he had and as they were putting up three posters with wheat paste, the police arrested them for destroying property… it’s totally water soluble and the posters would have washed off with the first rain. Instead of giving Oleg and his partner a citation or a warning, the campus police frisked them, cuffed them and took them in. They wanted to make an example of him. \\nHere is the first part of Oleg’s story about persecution for doing nothing more than hanging anti-terrorism posters in defense of Israel and Jews in Virginia: \\nMy part in it was to create provocative artwork for the posters and to hang them around the GMU campus, as well as to distribute flyers in order to raise awareness among the students, faculty, and the administration about the true meaning of their support for the SJP conference. \\nOn the first day, my friend and I placed a few stickers on walls, poles, and signs around the GMU campus. We also placed paper flyers inside and outside the university buildings. We had decided to hang the larger posters on the following night, right before the start of the SJP conference. \\nArriving at the campus in the evening, we noticed a large police presence everywhere, including the campus Starbucks. From what we overheard at the tables, the police were on the lookout for people posting “disturbing” flyers. At one point we considered canceling our mission due to this higher risk, but then decided to hang a few posters in new locations, in order to get the message out more effectively. \\nWe only had time to hang three large posters when, at about 4am, our car was pulled over by a GMU PD cruiser with flashing lights. As we found out later, they already had a description of our rental KIA Optima. Officer M.J. Guston and his female partner, Officer Daniels, requested to see our drivers’ licenses, which they took away. Then they inquired if we had any weapons and proceeded with the visual search, noticing our bucket with mixed wheat paste and some rolled posters on the back seat, covered with towels. \\nThe police officers took pictures of the contents of our car and retrieved some of the loose fliers from the floor as evidence. They claimed that since we were covering the posters and flyers with towels, we intended to conceal our wrongdoing. We explained that the towels were needed to wipe our hands, to prevent the bucket from spilling, and to stop the papers from rolling around the car, which was the honest truth. \\nThe officers said we had been photographed while attaching the flyers, but never showed us the actual pictures. They ordered us to give them our car key and to step out of the car. Then we were told to put our hands behind our backs and to spread our legs. Officer Guston then held my thumbs behind my back with his left hand, while his right hand gave me a complete and very thorough pat-down and searched the content of my pockets. He repeated the same procedure with my friend, repeatedly asking us if we had any kind of weapons on us or in the car. \\nMy friend and I tried to be as friendly and cooperative as the situation allowed, but that had no effect. We were ordered to sit on the curb, as Officer Daniels told us that the content of our posters was violent and disturbing to some students, especially the one with the Hamas terrorist standing in pools of blood over his dead victims. Such interpretation flipped our message on its head entirely, turning it from sympathy for the victims of violence into a threat of violence. \\nIt dawned on me that the reason they kept searching us and asking about weapons was that they were convinced we were members of some violent militant group of “domestic terrorists” who meant to do harm to the students – a stereotype largely created by the “progressive” media and unscrupulous politicians. And now we, defenseless artists, armed with nothing but brushes and paper, became victims of this manipulative mythology, which caused the police to treat us with extreme prejudice. At the same time, the officers who handled us as if we were terrorists, seemed to be blissfully unaware of the true nature of the SJP they were defending, and their organization’s very real ties to a known terrorist organization with a record of mass murder, kidnappings, and targeting innocent civilians. \\nSince they couldn’t find any weapons and our message was protected by the First Amendment, the officers decided to charge us with “destruction of property worth of at least $2,500,” which was a “class 6 felony.” (Editor’s note: According to VA law, intentional destruction of property that is worth $1,000 or more is a class 6 felony, punishable by up to 5 years in prison and a maximum of $2,500 in fines.) They claimed we had “super-glued” our fliers to school signs and it was impossible to peel them off. \\nIt didn’t matter that we never used permanent glue, or that there could be other volunteers on campus who posted the stickers they could have downloaded online. Our wallpaper paste was made of wheat and water; we only used it on three large posters, which could be easily removed with water and would be washed off by the first rain. The rest were stickers, printed on regular self-adhesive paper found in any office store. They, too, could be easily removed with a tissue soaked in Goo Gone, a common household cleaner found in any dollar store. We even offered to remove any posters and stickers for them, then catch our flights in the morning and never bother them again. But the officers weren’t interested in that. They seemed to have a rather inflexible phantom image of us as dangerous felons and “right-wing extremists” who belonged in jail. \\nA phone call that Officer Guston made inside his cruiser seemed to reinforce their determination. Stepping out into the street, he ordered us to put our hands behind our backs and then handcuffed us so tightly that our bruises were painful to the touch even on the following day. Then he emptied our pockets, took away my hat, and placed everything in two plastic bags. \\nWe were then taken to the back of his police car. Officer Guston never read us our rights ; he simply declared that we were under arrest for committing felony and were going to jail. The partitioned space in the back of his police cruiser was extremely narrow, which forced my friend and I to contort our bodies in order to avoid additional pain from leaning on our tightly handcuffed hands behind our backs. \\nThe full account can be found at American Thinker… please go there and read it all . It was Oleg this time, but it could be any of us next. \\nThe arresting officer told them they could never come to GMU again. What happened to free speech and your constitutional rights? These charges should not stick… they were not read their rights and therefore the charges should be dismissed. But with the Progressive courts and judges we have now, who knows what will happen. \\nOleg quoted George Orwell: “If you want a vision of the future, imagine a boot stamping on a human face – forever.” He adds: “that is what the future of America also will look like if progressivism and political correctness continue to expand their grip on every sphere of life.” \\nOleg survived the Soviet Union and persecution there. He’ll survive this. But it is just disgraceful that in the Land of the Free that someone would be treated this way for exercising free speech. Just shameful and it figures it is in Terry McAuliffe’s state. There was no permanent damage done as claimed… but a man who is an acclaimed Soviet dissident was treated like a domestic terrorist, while the real terrorists were giving lectures on campus. Or is it a crime now to stand up to Islamic extremists and speak out in defense of Israel? \\n#StopCampusSupport4Terrorism'"}, "time": 1742562079.22927}