{"duration": 0.0652165412902832, "input_args": {"text": "'Email \\nDo you remember that scene in the old Frankenstein movie when the villagers descended on the castle with burning stakes and pitchforks? The hounds were baying, people were shouting incoherently, and ignorant, fearful villagers watched the whole thing? \\nListen in particular to the speech at the beginning of this. That’s about what the person leading the charge against James Comey is saying. \\nThat’s pretty much what is happening to FBI Director James Comey, who is in for a bumpy, maybe even death-defying, ride after i nforming Congress that an investigation into Hillary Clinton’s email server debacle was being reopened, against the advice of Loretta Lynch , Attorney General. \\nAccording to Harry Reid, a US Senator and one of the head honchos of the Democratic Party, James Comey “may” have broken the law by announcing that emails on devices associated with Hillary Clinton are under renewed investigation. \\nHe’s referring to the Hatch Act, a law passed in 1939. It was officially called “An Act to Prevent Pernicious Political Activities” and was adopted to prohibit executive branch federal employees (except the President and Vice President) from engaging in certain political activities, such as: using their “official authority or influence for the purpose of interfering with or affecting the result of an election”; soliciting, accepting, or receiving political campaign contributions from any person; running “for election to a partisan political office”; soliciting or discouraging participation in political activity of any person who either has an application for a grant, contract, or other status pending before the employing agency or is the subject of an ongoing audit, investigation, or enforcement action by the employing agency; engaging in partisan political activity on official duty time; on federal property; while wearing a uniform or insignia identifying them as federal officials or employees; or while using a government vehicle. ( source ) \\nWill he be investigated for exposing a potential crime or will he be investigated for the timing of exposing a potential crime? It seems to me that keeping his mouth shut could also be in violation of the act – if he knew something and did not disclose it, wouldn’t that also affect the outcome of the election? The other villagers are joining in. \\nReid isn’t alone in the monster hunt. He’s joined by some other villagers with torches, pitchforks, and hounds too. \\nTake former Attorney General Eric Holder, for example. In a letter to the Clinton campaign, he wrote: \\nMany of us have worked with Director Comey; all of us respect him. But his unprecedented decision to publicly comment on evidence in what may be an ongoing inquiry just eleven days before a presidential election leaves us both astonished and perplexed. \\nWe cannot recall a prior instance where a senior Justice Department official—Republican or Democrat—has, on the eve of a major election, issued a public statement where the mere disclosure of information may impact the election’s outcome, yet the official acknowledges the information to be examined may not be significant or new.” ( source ) \\nPerhaps Comey’s decision had something to do with the fact that, as Zero Hedge reported , the DoJ stifled an FBI investigation into the Clinton Foundation donating money to the political campaign of the wife of an FBI investigator. (I know, it’s sort of like my brother’s sister’s cousin’s husband’s uncle.”) \\nRichard Painter, a University of Minnesota Law School professor and the chief White House ethics lawyer for a couple of years during the Bush Administration, wrote an op-ed for the New York Times . He said he’s filing a complaint. \\nThe F.B.I.’s job is to investigate, not to influence the outcome of an election.< Such acts could also be prohibited under the Hatch Act, which bars the use of an official position to influence an election. That is why the F.B.I. presumably would keep those aspects of an investigation confidential until after the election. The usual penalty for a violation is termination of federal employment. That is why, on Saturday, I filed a complaint against the F.B.I. with the Office of Special Counsel, which investigates Hatch Act violations, and with the Office of Government Ethics. I spent much of my career working on government and lawyers’ ethics, including as the chief White House ethics lawyer for George W. Bush. I never thought that the F.B.I. could be dragged into a political circus surrounding one of its investigations. Until this week. ( Source ) The Mainstream Media (MSM) will not be kind to Comey. \\nOf course, when are they ever kind to people who oppose the Clinton Monarchy? The so-called journalists have armed up with self-righteousness and propagandist pitchforks. \\nHere are some related headlines: In Releasing Email News, FBI Director Ignored Justice Department Advice, Tradition – Slate FBI’s James Comey under fire after jolting presidential race – MSNBC Harry Reid: FBI Director James Comey might have broken federal law – Washington Times Clinton Allies Target Comey as Probe Scrambles Campaign – Bloomberg Basically Everybody Thinks James Comey Has F***ed Up – Mother Jones \\nAnd of course, everyone knows how much I love (cough) Huffington Post , which was a trove of ridiculous headlines like: Former Attorney General Eric Holder: FBI Director James Comey ‘Violated’ Justice Department Policies Harry Reid Blasts FBI Director James Comey Over Handling Of Clinton Email Probe First Poll Since James Comey Announcement Shows No Effect On Hillary Clinton — Yet Dozens Of Former Federal Prosecutors Sign Open Letter Criticizing James Comey James Comey Just Unmasked Himself The director of the FBI is between a rock and a hard place. \\nIf he had said nothing, he would have been pilloried for remaining silent. Today he is being pilloried because he did. \\nThe man had a stack of resignation letters on his desk from angry FBI agents who knew what was going on. Comey was not alone in the belief that something had to be done to allow the American people to know who they are actually voting for. He’s just the one who is taking the hit for it. \\nA leaked memo to FBI employees probably gives the best picture of Comey’s mindset when he made the decision to put himself in the line of fire. \\nIn a memo explaining his decision to FBI employees soon after he sent his letter to Congress, Comey said he felt “an obligation to do so given that I testified repeatedly in recent months that our investigation was completed.” He admitted that he broke with custom in alerting lawmakers that the investigation into Hillary Clinton’s private email server was being reopened because of its political sensitivity. \\nHe further explained to FBI employees that “Of course we don’t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed . I also think it would be misleading to the American people were we not to supplement the record.” \\n…“At the same time, however, given that we do not know the significance of this newly discovered collection of emails, I don’t want to create a misleading impression,” Comey’s letter continued. “In trying to strike that balance, in a brief letter, and in the middle of an election season, there is significant risk of being misunderstood, but I wanted you to hear directly from me about it.” ( source ) \\nHe is in a lose-lose situation, and I’m sure he knew this. It seems to me that knowing he’s going to be dead the ex-director of the FBI sooner rather than later, he has done what he believes is the right thing. \\nPersonally, I can’t fault Comey for doing what he did. Maybe he was trying to undo the wrong he did in letting her off in the first place. He’s taking one for the team and most likely sacrificing his career – if not also his life – by taking the action that he took, considering how things tend to go for people who run afoul of the Clintons . It’s anyone’s guess what will happen between now and November 8th. \\nGrab some popcorn, my friends. We’re in for an eventful week. \\nArticle reposted with permission from DaisyLuther.com'"}, "time": 1742628464.2240064}