{"duration": 0.2760446071624756, "input_args": {"text": "'With spring in the Texas air, some Baylor University students were navigating the social challenges of another   party, chatting and dancing while trying not to spill their drinks. Amid the swirl, a petite freshman named Jasmin Hernandez lost sight of her friends. Then Tevin Elliott, a    Baylor football player dating someone she knew, appeared. Earlier he had been pouring hard liquor for Ms. Hernandez and other underage students now he was insisting that her friends had gone outside. When Ms. Hernandez expressed doubts, she said, he began pulling her by the wrist toward the door, telling her they had gone outside. But the farther they strayed into the darkness, the more she argued that her friends were back at the party, and that they should return. Without a word, she later said in a lawsuit, the      linebacker picked up the   freshman and made his violent intentions clear. Panicking, Ms. Hernandez told him that she was sorry if she gave him the wrong impression that they should just go back to the house and forget this ever happened that she was, in fact, gay. He acted as though he did not hear. When Mr. Elliott finished raping her behind a secluded shed, an angry Ms. Hernandez used an expletive in demanding her shirt back. “He tossed it over to me,” she later recalled. “And that was the end of the interaction. ” Ms. Hernandez, who has appeared on ESPN and who spoke to The Times for this article, assumed that her rape was a horrible but isolated incident at Baylor, a private university of nearly 17, 000 students that takes pride in its Baptist foundation. And she wasn’t alone in believing that: Even after Mr. Elliott was convicted and sentenced to 20 years in 2014, Baylor officials said they considered him to be a solitary bad actor preying on a campus of goodness. As three leading members of Baylor’s Board of Regents later described their sense of him at the time: “an isolated case. ” Mr. Elliott has subsequently been accused of sexually assaulting several other women, and since the rape of Ms. Hernandez in 2012 the allegations of sexual assault by Baylor football players have multiplied, causing incalculable damage to the university’s reputation and leading to resignations and firings, including those of the president, the football coach and the athletic director. The crisis has left alumni apoplectic, students outraged, donors turning on one another, and the Board of Regents bracing for the next blow. Lawsuits clutter the courts, with more than a dozen women, including Ms. Hernandez, claiming that they had been assaulted amid a campus culture that put them at risk. Two months ago, John Clune, a Colorado lawyer who specializes in cases of campus assault and who had already resolved three other women’s claims against Baylor, filed a lawsuit on behalf of an alleged victim that sought, in part, to quantify the crisis. It made the startling claim that at least 52 rapes by at least 31 players had occurred from 2011 through 2014  —   a period when the   Baylor football program became a dominant force in the highly competitive Big 12 Conference. Baylor’s interim president has said in a statement that he cannot confirm Mr. Clune’s numbers, which followed other troubling figures that Baylor’s board gave to The Wall Street Journal in October: assaults on 17 women by 19 players, including four gang rapes. Collectively, the cases have become a cautionary parable for   college athletics, one in which a Christian university seemed to lose sight of its core values in pursuit of football glory and protected gridiron heroes who preyed on women. In a statement to The New York Times on Monday, Baylor officials said the university was committed to “doing the right thing”  —   through   repeated apologies and making 105 recommended changes to its policies and structure. “Our mission statement calls for a caring community based on Christian principles, and any act of sexual violence is inimical to these standards,” the statement said. Even so, the scandal has not sat well in Texas. Last week, the Texas Rangers, the statewide law enforcement agency, confirmed that it had begun a preliminary investigation into Baylor. That announcement came days after a state representative, Roland Gutierrez of San Antonio, filed a resolution urging Gov. Greg Abbott to have the Rangers investigate “the obstruction of justice surrounding the sexual assault of young female students at Baylor University. ” And this week, a federal judge rejected Baylor’s request to throw out a lawsuit filed against the university by 10 women who say they were sexually assaulted while they were students. Judge Robert L. Pitman of Federal District Court ruled that each plaintiff had “plausibly alleged that Baylor was deliberately indifferent to her report( s) of sexual assault, depriving her of educational opportunities to which she was entitled. ” For most of her freshman year, Ms. Hernandez was passionate about the Baylor green and gold. A native of Southern California, she came to the university’s verdant campus in Waco to study nursing on an academic scholarship. She loved her teachers and friends, and enjoyed cheering on the ascendant football team  —   a sudden powerhouse, thanks in part to the likes of her future attacker, Mr. Elliott. She arrived at a time of athletic excellence so bountiful that the   school year came to be known as the Year of the Bear. The football team had its first Heisman Trophy winner in the quarterback Robert Griffin III the men’s basketball team reached the N. C. A. A. tournament’s round of eight for the second time in three years and the women’s team went   for the national championship. This run of success was all the more extraordinary for what had come before: decades of mediocrity in major sports, with the lows far outnumbering the highs. Then, before the 2008 season, the university hired Art Briles as its football coach. And things changed. Mr. Briles was Texas to the core  —   a quarterback for his father at Rule High School, a wide receiver at the University of Houston and a coach at five Texas high schools before he entered the college ranks. Along the way, he devised an explosive offensive system that seemed to attack the end zone on every snap. He inherited a Baylor program that had not had a winning season since 1995. What’s more, schools like Baylor, then a   choice for top recruits in one of the country’s most   states, rarely experience quick turnarounds. But the new coach pulled it off by his third year, the Bears were winning more than they lost. The university and its alumni responded, reportedly paying the charismatic Mr. Briles one of the highest salaries in college sports and embarking upon a   campaign that led to the $266 million construction of McLane Stadium  —   a breathtaking football cathedral that abuts the Brazos River and Interstate 35. Just before the 2014 season, Mr. Briles marveled at the visual and emotional power of the stadium, saying, “Show me something better. ” Mr. Briles imagined the impression the sight would leave on an    child looking out the window of a passing car. “They’re going to say, ‘Momma or Grandmother, man, look at that place,’” he said. “‘That place is beautiful. Where is that?’ And she’s going to say, ‘Baylor.’ “And then so for the rest of their lives they’re going to associate Baylor with excellence. And that’s hard to come by and the only way to get it is through the production of image. “So our image is good. ” The promise of McLane  —   named after Drayton McLane Jr. Class of ’58, who made his fortune with a   business  —   helped stimulate capital campaigns that focused on a new scholarship fund and a new campus for the business school. “Success in athletics means that all boats rise,” Kenneth W. Starr, then the university’s president, told The Times in 2014. Mr. Starr had arrived at Baylor in 2010 with a formidable résumé and a clear vision. A former solicitor general, federal judge, law school dean and independent counsel  —   the Javert in the President Bill Clinton sex scandal  —   he promised an administrative stability that the university had lacked in recent years. He raised Baylor’s academic profile and presided over ambitious   efforts, all while endearing himself to undergraduates. He was the avuncular “Judge Starr,” leading freshmen on a pregame sprint across the field to invigorate the crowd at each home game. The dynamic pairing of Mr. Starr and Mr. Briles signaled to students and alumni alike that, with the twinning of their respective strengths, Baylor was going places. Along the way, the university’s football players appeared on giant posters, on computer screen savers  —   just about anywhere you looked on campus. A    bronze statue of Mr. Griffin, midthrow, greeted visitors to McLane Stadium when it opened in 2014. The message was clear: Our heroes. But myriad court cases suggest that as the boats of Baylor rose, to use Mr. Starr’s analogy, standards fell overboard. Baylor and its football program, it seemed, began to value   talent above all else. Baylor’s football team signed up transfers with disciplinary issues in their pasts. There was Shawn Oakman, for example, a huge defensive end dismissed from Penn State’s team for stealing a sandwich and grabbing a female store clerk by the wrist. And Sam Ukwuachu, a former Freshman   defensive end kicked off Boise State’s team for reasons that were left publicly unclear at the time his   later testified that he had assaulted her. (Mr. Briles has said that he was unaware of the assault accusation.) According to the lawsuit filed by Mr. Clune, the lawyer from Colorado, the football staff at the Baptist institution employed a “‘Show em a good time’ policy,” in which current players offered alcohol and drugs to high school prospects visiting the campus and introduced them to female students. The lawsuit also alleged that the university unofficially used its hostess program, the Baylor Bruins, to further entice recruits. It said that “attractive female students” in the Bruins were expected to ensure that recruits had a good time on campus by, for example, engaging “in sexual acts with the recruits to help secure the recruits’ commitment to Baylor. ” The university’s interim president, David E. Garland, has called these allegations “disappointing and horrifying,” and has said that “none of the activities described in the filing align with our past or current institutional recruiting practices. ” A particularly notorious allegation in the lawsuit is that Kendal Briles, a former assistant coach and Art Briles’s son, enticed one recruit by saying: “Do you like white women? Because we have a lot of them at Baylor and they LOVE football players. ” The younger Mr. Briles declined to comment through a spokeswoman for his current employer, Florida Atlantic University. As for the assault accusations, Baylor’s Board of Regents later concluded that the football program’s coaches and staff “reinforced an overall perception that football was above the rules, and that there was no culture of accountability for misconduct. ” Baylor, they wrote, “failed to take sufficient action to identify, eliminate, prevent and address a potential hostile environment in individual cases. ” As Jasmin Hernandez would learn. Visiting the Baylor campus in the spring of 2011, Ms. Hernandez found the thrill of a rising university to be contagious. Everyone “seemed really excited to be there,” she recalled, the sense being “If you go here, there are good things ahead. ” Nothing embodied that excitement as much as the football team. Ms. Hernandez attended several games her freshman year, and participated in some   rituals, such as wearing a football jersey with the number of her graduation year and cheering on the players and coaches as they took the field. “Really cool,” she recalled. But after Ms. Hernandez was raped, she would allege in a lawsuit filed last year, she encountered an indifference on campus  —   even a callousness  —   that baffled and wounded her. Her friends at the party immediately took her to a nearby hospital, where she recounted the assault for a Waco police officer. Her worried mother arrived from California and, almost immediately, asked the university’s counseling center to provide her daughter with mental health services. But, the lawsuit claimed, the counseling center was too busy to see her daughter  —   and so was the student health center. “I went in, told them I’d been sexually assaulted by another student, and asked if there was someone I could talk to, like a medical doctor,” Ms. Hernandez said. “They told me all their appointments through the end of the semester were taken. I went back several times. Every time they denied me  —   told me there was nothing they could do. ” The academic services department also said there was nothing it could do, the lawsuit claimed. No accommodations could be granted, the Hernandezes were told. According to the lawsuit, Ms. Hernandez’s mother reached out to Mr. Briles and was told by his secretary that his office had heard of the alleged rape by one of his budding stars and was looking into it. But Mr. Briles did not return several   calls from Ms. Hernandez’s father, the lawsuit claimed, adding that the university “did not take any action whatsoever to investigate. ” Baylor has disputed Ms. Hernandez’s narrative in a court filing, but it did not respond to questions seeking elaboration. University officials have said in another court filing that Ms. Hernandez was Mr. Elliott’s fifth alleged assault victim at Baylor  —   her lawsuit said she was the sixth who had reported a sexual assault to Baylor  —   and that Mr. Briles was indeed apprised of her alleged assault. In addition, they said, only extraordinary interventions by Mr. Starr and Mr. Briles kept Mr. Elliott from suspension or worse because of academic misconduct. Mr. Briles, in a written statement released last week, said that he “did not cover up any sexual violence” and “had no contact with anyone that claimed to be a victim of sexual or domestic assault,” and that whenever alerted of an alleged assault, he would send the clear message that “the alleged victim should go to the police. ” All the while, Ms. Hernandez was determined to follow through with her Baylor career. But she could not. “I was extremely emotionally unstable,” she said. “It’s not that I couldn’t live my daily life, because I could, but it was very interrupted by turbulent emotions that I couldn’t exactly predict and that I didn’t know how to deal with. ” After posting poor grades during the   school year  —   a decline that she attributed to her trauma  —   Ms. Hernandez was informed by Baylor that she had lost her academic scholarship. She dropped out of the school she once loved, returned to California and began therapy. That fall, the Baylor Bears were   and won the Big 12. In early 2014, Mr. Elliott was convicted of sexually assaulting her and sentenced to 20 years in prison. That fall, the Bears were again   and shared the Big 12 championship with Texas Christian. Baylor was moving on. The first clear signal that the Elliott case was more than a Baylor aberration came in the late summer of 2015  —   two years after a damaged Ms. Hernandez quietly dropped out  —   when Texas Monthly published a disturbing account of the alleged rape of another Baylor woman by another football player: the troubled transfer from Boise State, Sam Ukwuachu. This episode was said to have occurred nearly two years earlier, in October 2013, while Mr. Ukwuachu was sitting out the football season as a   transfer student. According to Texas Monthly, Baylor officials had conducted only a cursory investigation in deciding not to pursue the sexual assault claim against Mr. Ukwuachu, who was eventually convicted and sentenced to 180 days in jail and 10 years’ probation. Testimony in the case against the      Mr. Ukwuachu was devastating. “He was using all of his strength to pull up my dress and do stuff to me,” said the victim. Baylor’s president, Mr. Starr, promptly issued a letter addressed to “Baylor Nation. ” It began: “By God’s grace, we are living in a golden era at Baylor University. However, today we are filled with profound sadness. ” He expressed grief for the victim, asserted that those who engage in sexual violence would “find no shelter” on campus, and announced that a faculty member with prosecutorial experience would investigate the circumstances of the Ukwuachu case. That professor’s weeklong inquiry convinced Mr. Starr of the need for a more comprehensive investigation. The Board of Regents soon hired Pepper Hamilton, a Philadelphia law firm with experience in investigating potential violations of Title IX, the federal law mandating gender equity in higher education. Pepper Hamilton’s inquiry lasted several months. The complete results of its investigation, which included interviews with central figures and access to a million pieces of information, have never been made public  —   because, the university said, they were delivered orally to the Board of Regents. Releasing all of them in written form, several regents later said, would have taken an additional six months. University officials have said they limited public information in deference to federal privacy law, confidentiality agreements and victims’ presumed feelings. But critics say that asking only for an oral report is a standard tactic for avoiding full accountability. The board’s public summary of that Pepper Hamilton briefing, in May 2016, was still damning. In a   report, the board excoriated its own institution  —   and itself  —   for failing to adhere to a federal requirement that victims of campus sexual assault receive a “prompt and equitable response” from their college. In one instance, it reported, a student was retaliated against for reporting an assault other students, it added, may have feared being stigmatized for reporting assaults that involved underage drinking or premarital sex. Investigations, they wrote, “were conducted in the context of a broader culture and belief by many administrators that sexual violence ‘doesn’t happen here. ’” Most of the report addressed the entire university  —   though a few pages near the end focused squarely on the football program. Football officials, it charged, had set up a parallel justice system for their players, did not properly report complaints to the rest of the university and in some cases tried to keep law enforcement authorities out. Mr. Briles, the revered coach who had led Baylor to gridiron glory, was effectively fired. Mr. Starr, the affable president who reveled in that glory, was demoted he later resigned. Ian McCaw, the athletic director, was placed on probation with sanctions by the university for mishandling sexual assault allegations he, too, later resigned, and now holds the same position at Liberty University. The board also vowed institutional changes. And it apologized to Baylor Nation. “We were horrified by the extent of these acts of sexual violence on our campus,” Richard S. Willis, then chairman of the Board of Regents, said. “This investigation revealed the university’s mishandling of reports in what should have been a supportive, responsive and caring environment for students. ” The board’s confessional housecleaning may have been intended, at least in part, to begin putting this episode in the past. Instead, the scandal has continued to define  —   or redefine  —   Baylor. Other women have followed the lead of Ms. Hernandez, filing lawsuits claiming sexual assault by Baylor students, athletes and  . One recounts the alleged gang rape of a young Bruins hostess by two football players, one of whom supposedly tried to “stare down” a worried young man who had dared to interrupt the moment. Implicated football players have left or been expelled. Mr. Oakman, the     defensive end who had transferred to Baylor from Penn State, became at least the third former player to be indicted on sexual assault charges. His criminal case, in which he has pleaded not guilty, is pending. Some changes have come. Outsiders have taken over as football coach and athletic director, and a search committee is engaged in finding a permanent president. A few of the 105 recommendations concern the board itself, a structurally insular institution whose voting members are primarily determined by current membership. In addition, the Big 12 took the rare, if largely symbolic, step of withholding a quarter of Baylor’s payouts  —   about $6 million this year, according to The Associated Press, and more in years to come  —   until promised changes are actually made and, as the Big 12 board chairman said in a statement, “systems are in place to avoid future problems. ” In its statement to The Times, Baylor said: “There should be no doubt that, rather than worrying about its ‘brand,’ Baylor leadership has been focused on doing the right thing. ” The university went on to say that its efforts to address and repair the damage done far surpass those taken by any other educational institution. “No other college or university has, at its own initiative, undergone such a thorough ” it said. “No other college or university has made such wholesale leadership changes based on that  . No other college or university has eagerly embraced an ambitious slate of 105 recommended changes. And, despite the accusations of some, no other university has been as transparent about its failings. ” But some critics say that the university should not be so quick to flatter itself  —   pointing out that, among other things, it was slow to make a clean break from the Briles era. Although it hired an acting football coach last year, it retained nearly all of Mr. Briles’s staff, including his son and   . These Briles loyalists made known their continued allegiance to those accused of presiding over a football culture in which sexual violence seemed to thrive. The university has also been criticized for not being fully forthcoming about the scandal. A group of alumni and donors, Bears for Leadership Reform, has demanded full transparency, beginning with the release of all material related to the Pepper Hamilton briefing. Its members include Mr. McLane, after whom the football stadium is named. Last month, the reform group called on the university to reveal how much it was paying in legal fees to have recommendations from the Pepper Hamilton report carried out. The group estimated that the scandal had cost Baylor $223 million in expenses such as legal fees and settlements as well as in lost revenue from projected contributions. The developments are so numerous and the media attention so intense that Baylor’s website has a page called, simply, “The Facts”  —   as in “The Facts About the Sexual Assault Crisis at Baylor. ” Here you can find links to “Latest Updates,” “University Improvements” and “Setting the Record Straight. ” The “Facts” page reflects how Baylor’s embattled Board of Regents, after months of silence, has adopted a new public relations strategy that is less opaque and more aggressive in a bid, officials acknowledged, to make the public narrative accurate. For example, in responding to a lawsuit filed by a dismissed football staff member, university officials recently released text messages that seem to demonstrate how Mr. Briles sought to cover up various misdeeds by some of his players. Those text messages presumably came from the trove of information accumulated by the Pepper Hamilton investigation  —   the very information that reformers and others are demanding be made public without prejudice. Mr. Briles sued for defamation  —   he dropped the suit just before the text messages were released  —   accusing Baylor of making a “scapegoat” of him, perhaps to make a case that the problem had been solved, like a limb amputated before gangrene has spread. University officials replied in a court filing that Mr. Briles was “not a ‘scapegoat’” but “part of the larger problem. ” Several donors asked last June that Mr. Briles, 61, be reinstated or at most suspended unless the Regents could offer more evidence of his complicity, which the regents declined to do at the time, university officials said in a court filing. After Mr. Briles’s text messages were released, Bears for Leadership Reform said it was “appalled. ” Then there are the likes of John Eddie Williams Jr.: a member of the Class of 1976, a former nose guard for the Baylor football team, a successful Houston lawyer and a benefactor so generous that the field at McLane Stadium was named after him. He is also a member of Bears for Leadership Reform, and he is furious at what he said was the university’s mismanagement of this crisis  —   including its lack of transparency. “When you have horrible events like occurred at Baylor, you need to have transparency, and that’s the only way we’ll move forward,” Mr. Williams said. “Let the word come out. Let it come out, the good, the bad, the ugly. Put it all on the table. “That’s how we learn from our mistakes and move forward. ” The steady stream of revelations would seem only to have helped the case of Jasmin Hernandez, who, in pressing charges against her rapist, struck the first powerful blow against Baylor’s disturbing culture. This week, her lawyer secured court permission to incorporate new information into her lawsuit  —   including the allegation of 52 sexual assaults by at least 31 players over four years. (A prime defense cited by the defendants in her case  —   Mr. Briles, Mr. McCaw and Baylor  —   is that her claims are   by a   statute of limitations.) She is now a junior at California State University, Fullerton. And, yes, she remembers some of the good experiences she had at Baylor: the supportive friends, the passionate teachers, the many engaging activities. But Ms. Hernandez said that the Baptist university in Waco simply was not ethical when dealing with allegations of sexual assaults by its revered football players  —   or, for that matter, when dealing with the traumatized victims of those sexual assaults. As new revelations have come out, she said, she has been “shocked”  —   yet, at the same time, “not surprised. ” She does not closely follow the many news accounts of the continuing scandal, especially those that concern her case. “I don’t care to see myself through that light,” said Ms. Hernandez, once a scholarship member of Baylor University’s Class of 2015.'"}, "time": 1742628533.764037}