{"duration": 0.0634765625, "input_args": {"text": "'JewTube Shuts Down Bill Clinton’s Black Son Danny Williams \\nAndrew Anglin Daily Stormer October 27, 2016 \\nThe filthy Christ-killing Jews who run YouTube have shut down the account of Bill Clinton’s Black son Danney Williams AKA America’s Favorite Clinton AKA The Greatest Clinton Generation AKA The Good Clinton AKA D’Jamal Clinton AKA My Favorite Black Guy. \\nSeriously. \\nWND : \\nYouTube on Wednesday suspended the account of Danney Williams, the 30-year-old man who has claimed since the 1990s to be the black son of former President Bill Clinton. \\nYouTube, citing â\\x80\\x9crepeated or severe violations of our Terms of Use and/or Community Guidelines,â\\x80\\x9d declared the account â\\x80\\x9ccannot be restored.â\\x80\\x9d \\nThe YouTube decision blocked the nine-minute feature â\\x80\\x9cBANISHED â\\x80\\x93 The Untold Story of Danney Williams,â\\x80\\x9d which had received 1.2 million views since Williams posted it last week. Produced by filmmaker Joel Gilbert, it drew nearly 100,000 views per day and more than 1,000 viewer comments, with the overwhelming majority expressing support for Williams and outrage at the Clintons for not being willing to allow a DNA test to determine paternity. \\nLike the reporting you see here? Sign up for free news alerts from WND.com, Americaâ\\x80\\x99s independent news network. \\nâ\\x80\\x9cMy YouTube account has been deleted, but the same video appears in 50 other places on YouTube alone,â\\x80\\x9d Williams said on his Facebook page after being notified of YouTubeâ\\x80\\x99s decision. â\\x80\\x9c[YouTube] canâ\\x80\\x99t handle the truth! Please share #BillClintonSon.â\\x80\\x9d \\nTwitter also continues to allow Williams to post the â\\x80\\x9cBanishedâ\\x80\\x9d video on Danney Williamsâ\\x80\\x99 page, but the Twitter link to YouTube displays the message: â\\x80\\x9cThis video is no longer available because the YouTube account associated with this video has been terminated. Sorry about that.â\\x80\\x9d \\nThis young lad has bravely come out and confronted his evil father who won’t even give him any money. The media has attacked him as a Trump plant. \\nDanney has been raising kids since he was 16. He needs money. His kids need money. But old grandpa Bill the rapist won’t give a cent. \\nThe least Bill could do is dip into his quarter-billion dollar fortune and buy these Black grandkids some friggin bikes. I mean come on. \\nHere’s the video. \\nI highly recommend this video. It is a fantastic voyage with great music. \\nMake sure to download it and reupload it for when this copy gets shoah’d. \\nAlex Jones also interviewed him recently and his Vegas press conference was spectacular. \\nDanney Clinton should be running for President. At least he’s a good person. He raises his own kids and takes them to church. \\nWhen Trump is in control and Bill and Hillary are in prison, Danney should be given control of the Clinton Foundation. And least then his kids can get bikes. \\nFollow Danney on Twitter and support him.'"}, "time": 1742562201.4611337}