{"duration": 0.045480966567993164, "input_args": {"text": "'This post was originally published on this site \\nResidents in the small Russian town of Ryazan, apparently excited by the election of Donald Trump in the United States, have started a petition to have a street in their town renamed “Street of Donald Trump.” The petition was started on “ change.org ,” and, among other things, advocates for the name change because “recently elected U.S. President Donald Trump is a big friend of Russia and is a supporter of traditional values.” \\nPer HeatStreet , the petition has already gathered enough support to be officially reviewed by authorities which means residents are well on their way to “making Ryazan great again.” \\nThe petition for a Trump Street has turned out to be quite popular. It’s gathered enough signatures to be officially reviewed by the authorities. \\n“With a street named after Donald Trump we can make Ryazan great again,” said one of the supporters of the petition. \\n“I’m signing because I was born in Ryazan and Trump is a great person and will change everything for the better,” said another. \\nHere is a loosely translated version of the petition from Google translate: \\nDespite the enthusiasm among many, some residents were slightly less supportive of the “Street of Donald Trump” idea and suggested that the town would end up “looking like idiots” if Trump imposed sanctions against Russia. \\nSome commenters, however, expressed caution: “You should have waited to see Trump’s first moves. What if he will support the sanctions against Russia? You will look like idiots then.” \\nDespite the petition’s popularity, a city official thinks it’s unlikely the street will actually be renamed. “According to Ryazan city regulations,” the official said, “the street can be named after a famous person, Russian or foreign, only five years after the death of this person”. \\nMeanwhile, here in the U.S., a 15-year-old student at Richard Montgomery High School in Rockville, Maryland had to be rushed to the hospital after being beaten up by 4 other students for wearing a “Make America Great Again” hat. \\nHundreds of students from Richard Montgomery High School were carrying signs reading, “Love Trumps Hate,” and chanting near the Rockville courthouse on Maryland Avenue in a protest that began at about 10 a.m. when a 15-year-old boy wearing one of the Trump campaign’s “Make American Great Again” hats was attacked by about four students. \\nThe group surrounded the teen, punching him repeatedly, then threw him to the ground and kicked him repeatedly in the ribs. \\n“They jumped him and beat him up pretty bad,” Max Stucky, a bystander who witnessed the attack, told WTOP. \\nThe teen, who wasn’t seriously hurt, was seen clutching the back of his head in pain. He was helped to his feet by medics and taken to a hospital in an ambulance. \\nAnd still no word from Obama and Clinton on this senseless violence…we’re still waiting… Related '"}, "time": 1742564492.3814466}