{"duration": 0.09573960304260254, "input_args": {"text": "'WASHINGTON  —   The Trump administration defended on Sunday a reorganization of the National Security Council that elevates the president’s chief strategist, Stephen K. Bannon  —   a political adviser with no direct national security role  —   to full membership and downgrades the director of national intelligence and the chairman of the Joint Chiefs of Staff. The alteration was contained in a memorandum issued late Saturday defining the organization of the National Security Council and the Homeland Security Council, the top   bodies inside the White House on everything from diplomacy to counterterrorism to crisis management to nuclear and cyberpolicy. Mr. Trump’s document drew from organizational precedents in the Obama and George W. Bush administrations. But the ascension of Mr. Bannon, who until last year was the head of Breitbart News, and the diminishment of the president’s top intelligence and military advisers took Democrats and Republicans by surprise. The new memo said that the intelligence director and the Joint Chiefs chairman would attend the “principals meetings”  —   the meeting of   officials  —   only when “issues pertaining to their responsibilities and expertise are to be discussed. ” Sean Spicer, the White House press secretary, said Sunday that Mr. Bannon’s past service as a Navy officer merited his attendance at all meetings, as part of a “streamlining” of  . He did not explain the downgrading of the   general who heads the Joint Chiefs, Joseph F. Dunford Jr. who rose through the Marine Corps and served in Iraq and Afghanistan. “Well, he is a former naval officer,” Mr. Spicer said of Mr. Bannon on ABC’s “This Week. ” “He’s got a tremendous understanding of the world and the geopolitical landscape that we have now. ” He added, “Having the chief strategist for the president in those meetings, who has a significant military background, to help make, guide what the president’s final analysis is going to be, is crucial. ” When pressed on General Dunford’s role, Mr. Spicer said, “The president gets plenty of information from the chairman of the Joint Chiefs of Staff. ” Current and former military officials said they suspected that the decision, in part, was prompted by the national security adviser, Michael T. Flynn, who retired as a   general after he was dismissed during the Obama administration as the head of the Defense Intelligence Agency. It was the previous director of national intelligence, James R. Clapper, who delivered the news to Mr. Flynn that he was being removed from his post. Throughout the transition, Mr. Flynn was reportedly hesitant to place many people around the National Security Council table who had outranked him in the military. Nonetheless, there are two in the cabinet: Defense Secretary Jim Mattis, who retired as a   general, and the secretary of homeland security, John F. Kelly, a retired   Marine Corps general who served for 45 years, ending his military career as the commander of United States Southern Command. Both men remain principals on the council. The C. I. A. director, Mike Pompeo, is not mentioned at all in the reorganization order. A week ago, Mr. Trump went to C. I. A. headquarters to assure officers there that he had their backs and valued their contributions. But Mr. Pompeo’s predecessor, John O. Brennan, was also not a formal member of the council, though he often attended meetings to provide intelligence assessments. Susan E. Rice, Mr. Flynn’s predecessor as national security adviser, denounced the downgrading of the intelligence director and the Joint Chiefs chairman. “This is stone cold crazy,” she wrote on Twitter. “Who needs military advice or intell to make policy on ISIL, Syria, Afghanistan, DPRK,” she said, using abbreviations for the Islamic State and North Korea. Former Defense Secretary Robert Gates, also appearing on ABC, questioned the wisdom of the move. John Bellinger, who was the counsel to the National Security Council during Mr. Bush’s administration, noted in a commentary on the Lawfare blog that Mr. Bannon’s role was highly unusual, because “the N. S. C. function usually does not include participants from the political side of the White House. ” He noted that Karl Rove, Mr. Bush’s top political strategist, did not attend council meetings. But in the early days of the Obama administration, David Axelrod, also a top political strategist, did attend many meetings resetting policy on Afghanistan and Pakistan  —   as a guest and an observer, but not as a full member of the council.'"}, "time": 1742561805.908073}