{"duration": 0.18804359436035156, "input_args": {"text": "'  \\nBy Jerri-Lynn Scofield, who has worked as a securities lawyer and a derivatives trader. She now spends most of her time in India and other parts of Asia researching a book about textile artisans. She also writes regularly about legal, political economy, and regulatory topics for various consulting clients and publications, as well as writes occasional travel pieces for The National . \\nAll right, all right. I can’t take it any more. Yesterday I read a Facebook post that blamed the current US electoral predicament on the “pointless” 22nd Amendment. For those of you without a US Constitution handy, the 22nd Amendment is the one that limits US presidents to serving two terms. \\nThat Facebook post implies that without the 22nd Amendment we’d get to see a third term for the Obamamometer . That risible suggestion, combined with the incessant legacy-burnishing that he’s indulged in– at least until he realized that HRC might be in trouble and started to hit the campaign trail in earnest– made me realize the time for shredding aspects of that legacy is way overdue. \\nWhen the Obamamometer finally settles on what he’ll do next– whether that would be run a sports team, become a venture capitalist, found a new religion, cure cancer, or merely hob nob with the global elite and play lots of golf, I’m sure he’ll make a fine job job of it– just as he’s done with his Presidency. Over the next couple of months, I intend to post occasionally on this legacy: but rather than burnishing that record, I’ll indulge in a bit of legacy busting. \\nFirst up, the rule of law and corporate crime. \\nThe Holder Doctrine \\nFederal prosecutors, and regulatory agencies, have turned into toothless tigers when it comes to prosecuting C-suite types, and pursuing corporations seriously, for economic crimes. Both financial institutions and their management got virtually a free pass for their activities that led to the Great Recession. And not only for those, but for subsequent foreclosure abuses, LIBOR and other market manipulations, money laundering, tax scams, and doing business contrary to US sanctions policy. Yet to date, not a single C-suite type has been indicted. \\nIt’s not just financial institutions that’ve received a free pass. Big Pharma, for example, has also been lucky, as have companies that have engaged in creative tax minimization strategies (Apple, anyone?). And if looked at from the perspective of legal topics, rather than corporate actors, entire areas of law– antitrust, for example– are not really relevant anymore. \\nYou don’t have to take my word for it. No less a source than the NY Times’ DealBook column– not a venue, incidentally, renowned for its trenchant, timely critiques of either Wall Street or other corporate behavior– in September lamented, Law Enforcement ‘Not Winning’ War on White Collar Crime . I wrote about this article in a September post and so won’t rehash all the arguments I made then here. But a few points are in order. \\nThe lack of enforcement not only means that the guilty don’t pay. It also determines what corporate strategies get pursued, which business models are developed or rejected, what attitudes corporations take to risk, and how resources get allocated to name just a few consequences. And as I’ll discuss below, it also shapes how attorneys practice law, and the impact their advice carries in deterring certain types of corporate behavior. \\nI never thought I’d be nostalgic for President George W. Bush’s Department of Justice (DoJ). Now, I’m well aware of the scandal that ensued over Attorney General Alfred Gonzales imposing ideological litmus tests on assistant US attornies. Nonetheless, in the wake of the collapse of the dotcom bubble, the Bush DoJ actually enforced the law. It prosecuted cases and claimed scalps. Companies such as Adelphi, Enron and WorldCom all saw top-level management prosecuted, and malefactors sent to jail. \\nChange We Can’t Believe In \\nThose who voted for Hope and Change in 2008 certainly got the change part– at least with respect to the DoJ. But when we look at the DoJ’s enforcement priorities and the track record that followed, it’s perhaps not the change they were hoping for. The Obamamometer’s first Attorney General, Eric Holder, outlined and followed what came to be known as the Holder doctrine. \\nAllow me to quote from my September post: \\n[Under the Holder doctrine the DoJ eschewed corporate charges against companies and executives, instead opting for negotiated settlements (often imposing de minimis, slap-on-the wrist penalties that were significantly undersized compared to the magnitude of damage done, especially by TBTF banks and other financial predators, to name just a few). \\nThe DoJ under Obama’s second AG, Loretta Lynch, originally followed the Holder doctrine, until that was superseded when Deputy Attorney General Sally Quillian Yates authored a memo outlining a new approach in September 2015. Under this approach, the DoJ intended to increase accountability for corporate wrongdoing, and this included an increased focus on pursuing criminal charges against responsible individuals. The DoJ sought to drive a legal wedge between individuals and the corporations for whom they worked by only allowing corporations to receive “cooperation credit” that would reduce their potential exposure (including penalties) if the corporation cooperates in surrendering as early as possible comprehensive detailed information concerning the individual misconduct. \\nThere’s much more in a similar vein in that earlier post, for those with an interest. But the bottom line for purposes of this post is what has this supposed policy shift, from Holder’s doctrine to Yates’s memo, meant in practice. The short answer: bupkis. We’re still waiting for the more robust enforcement approach the Yates memo supposedly heralded to kick in. As an attorney I know who specializes in white collar defense work summed it up to me, “The DoJ’s walking a new walk, and talking a new talk, but nothing’s really changed.” \\nIn fact, in only two areas have we seen the DoJ take a muscular approach toward enforcement during the Obamamometer’s administration, insider trading, and offenses under the Foreign Corrupt Practices Act (FCPA). \\nInsider Trading \\nUS Attorney for the southern district of New York Preet Bharara has compiled an undefeated string of convictions for insider trading (some of which may be at risk of being overturned due to some appellate decisions, which are beyond the scope of this post). But as I wrote last month in The SEC Fiddles While the System Burns: Insider Trading Enforcement As Securities Law Theater , focusing on insider trading as an enforcement priority constitutes a form of securities law theater. Scare prosecutorial resources are expended on insider trading abuses, rather than being deployed to investigate, punish, and (hopefully) deter, far more serious systemic problems. \\nThe insider trading focus provides the illusion that the DoJ is doing something about high-level cheating. Yet it has little broader deterrent effect on stymieing the wider corporate scams that misallocate resources and erode confidence in the integrity of the system. Insider trading enforcement is usually directed at individuals, and doesn’t implicate wider considerations of corporate strategy or policy. Prosecuting insider traders maintains the myth that the greatest threats to US capitalism are individual bad corporate actors, rather than anything more sweeping or systemic. Catch the bad actors, fine them or throw them in jail, and never think about any deeper problems. \\nForeign Corrupt Practices Act \\nAnother area highlighted as an enforcement priority is bribery and foreign corruption, with prosecutions undertaken under authority of the FCPA. Allow me to quote from a speech made by assistant attorney general Leslie R. Caldwell last week: \\nThe effects of foreign corruption are not just felt overseas. In today’s global economy, the negative effects of foreign corruption flow back to the United States. American companies are harmed by global corruption when they are denied the ability to compete in a fair and transparent marketplace. Instead of being rewarded for their efficiency, innovation and honest business practices, U.S. companies suffer at the hands of corrupt governments and lose out to corrupt competitors. \\n…. \\nThis is why the fight against international corruption has been, and continues to be, a core priority of the Department of Justice. It has been a core priority for the Criminal Division, and our commitment to the fight against foreign bribery is reflected in our robust enforcement record in this area, which includes charges against corporations and individuals alike from all over the world. Since 2009, the Criminal Division’s Fraud Section has convicted more than 65 individuals in [FCPA] and FCPA-related cases, and resolved criminal cases against more than 65 companies with penalties and forfeiture of approximately $4.5 billion. \\nSounds reasonable, right? I mean, after all, no one would come right out in favor of more international corruption? \\nBut when we unpack it, we butt up against a few problems. First, to quote my contact the white collar defence specialist again. The lack of an effective DoJ deterrent has enormously complicated his practice and his ability to get his clients to understand and act on prudent legal advice. “What I’ve seen happening more and more in the last couple of years is the chairs of audit committees of major companies openly mocking the DoJ’s enforcement capability.” This leads the companies to pursue courses of action that they wouldn’t dare to undertake if they worried that the DoJ would aggressively pursue securities law violations. \\nWhere does this leave their lawyers? Well, it often means that they must either moderate their advice, or risk losing their clients. Clients who want to do something will resist their impulses and continue to listen to what they hear as their lawyers crying wolf only for so long. Eventually, the less scrupulous among them are going to ignore the contrary advice, or get another lawyer. The lack of effective enforcement at the DoJ hinders the efforts of the best, most prudent, and most ethical members of the legal profession to practice law as we would want them to. \\nSo, what happens instead? Well, the most scrupulous of them will continue to give what they regard as sound legal advice (even if what some privately call the Department of Jokes does not enforce the law in a way that lends credence to that approach). But that means they often have to develop new areas of expertise when their clients beat a path away from their doors. “We have to act sometimes as shoe salesmen, flogging competence in FCPA violations, that occur in subsidiaries or with foreign suppliers,” says my white collar defense specialist contact. “This work leads us to countries and legal systems we don’t know well, to uncover chickenshit violations that occur far from home.” Far better, he believes, would be for the DoJ to focus on law-breaking that occurs in the United States, as that could be effectively deterred by the agency refocusing its enforcement priorities. Now that would be a legacy we could all believe in. \\nBottom Line \\nOn the contrary, one persistent legacy of the Obamamometer is to say one thing and then do another. The DoJ has recently signalled its intention to get tougher on white collar crime. But so far, there’s been no follow through on the rhetoric. Instead, we see federal prosecutors either turning a blind eye to major problems, or conducting various forms of enforcement theater– much sound and fury, but in the end, signifying nothing. \\nSome legacy!'"}, "time": 1742561701.376712}