{"duration": 0.05514335632324219, "input_args": {"text": "'What Does Trump’s Victory Mean For NATO? NPR. Charles flags the close, which is an unusually pointed admission of the basis of our imperialist project. \\nBrexit \\nTurkey is swiftly heading towards a regime of terror Bangkok Post (furzy) \\nTrump Transition. I am trying, and hope you will help in comments, in pulling the noise out of the signal regarding what Trump will actually do when he becomes President and whether it will succeed, “success” consisting first of it being implemented and second, making him and his Administration appear to be legitimate (as in keeping campaign promises, delivering tangible benefits to voters or powerful interest groups he needs on board). Despite all the changes in messaging over the course of his campaign, Trump was consistent on immigration, trade and lack of infrastructure investment, and depicted all three as ways to improve conditions for workers. And political scientist Tom Ferguson says that the data shows that the propensity to vote for Trump was highly correlated with voters giving negative answers to questions like whether the economy or the job situation had gotten better. \\nTrump and Sanders found power lying in the street by virtue of both parities abandoning high employment levels and wage growth as major policy goals. But if Trump is to deliver on his promise of delivering on those goals, he is at odds with much of his own party, which is keen to keep workers weak and preserve free trade (the corporate Republicans, particularly ones whose constituents include globalized businesses like autos, for the obvious patronage reasons; libertarians, out of ideology). Given that trade policy and immigration enforcement are areas in which the President has considerable latitude, whether and how he engages in these fights will be early tests of whether he intends to and is able to execute. \\nFinally bear in mind that Trump not only has a thin bench staff wise, but also intellectually. Many of his sources of advice are ideologues who like the Brexiters in the UK, may cheerily recommend changes which might sound ducky (to them) without having the foggiest clue that the operational implications are nightmarish. For instance, I’m told the Trump transition team on policy is apparently planning on recommending that the US exit Nafta and the WTO on the first day of the Trump presidency. Pray tell, have they looked into what this means for US customs, and for US exporters dealing with foreign customs? \\nIn other words, the right wing think tank types that the Trump team is relying on runs the risk of being as clueless about issues of organizational capacity as the Greeks were who thought they had a trump card (pun intended) in a Grexit (for those new to Naked Capitalism, we had an extensive series of posts on this topic, see here , here and here for some examples). \\nSo for instance, see this BBC story: \\nTrump likes main Obamacare provisions ‘very much’ , specifically, covering pre-existing conditions and letting children up to age 26. The story describes how the Republicans might oppose Trump: \\nComplicating the matter is that a “revise and reform” effort may not fly with Mr Trump’s ardent supporters and the cadre of arch-conservative politicians in Congress, who want to tear up the law “root and branch”. \\nMr Trump often broke with Republican orthodoxy while campaigning and didn’t pay a political price. He may learn that as president he won’t get far without his party establishment’s help. \\nIn WSJ Interview, Trump Says He Is Willing to Keep Parts of Health Law Wall Street Journal. Note the heavy emphasis on job creation. This had been the Democratic party lode star through the Carter era. He also defines Pence’s job, which is to help on health care and sell Trump policies to Congress. This is similar to the role Joe Biden played. And he rejected the Administration “find those moderate Syrians” strategy.'"}, "time": 1742628407.6164372}