{"duration": 0.12851357460021973, "input_args": {"text": "\"Share on Twitter \\nThe seeming perfection we see in online photos can be disheartening when compared to the flaws we see in our own appearance. \\nOne popular blogger recently shared an honest selfie in an attempt to make a statement about happiness and beauty. A photo posted by BECK LOMAS (@becklomas) on Oct 26, 2016 at 3:42am PDT \\nAs Today reports, the Instagram feed for Beck Lomas, an Australian fitness and beauty blogger, usually contains the kinds of images that provoke envy: A photo posted by BECK LOMAS (@becklomas) on Sep 16, 2016 at 3:28pm PDT \\nSo when Lomas shared a decidedly unglamorous photo of herself without makeup, it stood out to her many fans: A photo posted by BECK LOMAS (@becklomas) on Sep 26, 2016 at 5:39am PDT \\nLomas writes that despite appearances, even she struggles with acne and skin problems that leave her feeling insecure: \\n“THIS is my current situation. A pimply, bleeding, sore face. It doesn't look THAT bad, but it feels pre y bad. My skin will always be a journey in itself, I don't think I will ever be one of those girls who feels completely okay without makeup, but that's fine. Even when my skin is at its best, which does happen sometimes, when I don't have any big angry pimples and everything looks quite smooth, I'm still a little self conscious.” \\nIn a separate Instagram post , Lomas reveals just how much her bad skin used to affect her. A photo posted by BECK LOMAS (@becklomas) on Oct 17, 2016 at 6:39pm PDT \\nAt times, she was afraid to go out because she knew that makeup couldn't hide it completely: \\n“I would feel self conscious and ugly around my boyfriend, my family, my friends, everyone. Some nights I would take my makeup off before the gym and look in the mirror and just bawl my eyes out, and I wouldn't even end up working out because I was so worried about how I looked.” \\nLomas goes on to explain that while she lacks confidence in her skin, she doesn't lack confidence in herself. Learning the difference, she says, was the key to feeling better about her flaws: \\n“I've come a long way from the girl who used to cry every single night about the way her skin looked. These days my skin is just a minor downer for me sometimes. This post is just to show you all that you should be confident despite your little flaws.” \\nBy sharing her flaws with her fans, Lomas hopes that she can inspire them to be more forgiving of themselves. A photo posted by BECK LOMAS (@becklomas) on Sep 14, 2016 at 4:23pm PDT \\nShe also wants to make a point about beauty. Beauty, she says, isn't bound up in your skin or your physical flaws, but in your outlook: \\n“Happy people are the most beautiful people, and I know it's hard to feel happy when you're focusing on your imperfections— but I just want to let you all know that you are beautiful EVEN if you have acne, or bacne, or cellulite, or your thighs touch or you've got stretch marks. You are beautiful and unique and amazing as you are, and being confident and happy and that will shine through and make you even more beautiful!” \\nLomas concludes the post by urging her followers not to let their imperfections destroy their confidence in who they are. A photo posted by BECK LOMAS (@becklomas) on Aug 18, 2016 at 7:42pm PDT \\nHer honesty was appreciated by those who saw the photo, many of whom thanked her or spoke about how much they could relate to Lomas' struggle with her flaws. One commenter writes: \\n“You're a beautiful girl inside and out. I'm sure you know this but I just wanted to tell you to be certain. Thanks for your authenticity. In a world full of fake, it's very refreshing.” \\nBeck Lomas wants to remind her fans of an important lesson: \\n“To anyone else who is struggling with skin issues— you aren't alone and things will get better, so just hang in there!” \""}, "time": 1742563177.0558772}