{"duration": 0.04239821434020996, "input_args": {"text": "'A group of 200 locals expressed their displeasure during the opening prayer and Pledge of Allegiance at Sen. Bill Cassidy’s ( ) town hall in Louisiana Wednesday night, Independent Journal Review (IJR.) reported.[  Some constituents began shouting, “Pray on your own time” and “let’s get on with it” at the chaplain while others chanted, “Separation of church and state”: As a local veteran took the stage to recite the Pledge of Allegiance, the crowd continued shouting, “We want answers” and “Do your job,” National Review reported. Despite the heckling, the veteran managed to remain on stage until he was finished. By the time Sen. Cassidy arrived at the town hall 20 minutes late, he was met with a    reception from the crowd. Sen. Cassidy received a tense reception from the crowd throughout the speech, especially when President Trump or Education Secretary Betsy DeVos was mentioned, the   reported. “If all you want to do is vent, this will not be profitable,” Cassidy warned the audience. By the time Cassidy called an end to the meeting an hour later, the audience’s mood had not changed, and the constituents once again shouted, “Do your job. ” Townhall ends, @BillCassidy says, and crowd starts chanting ”do your job” pic. twitter.   —   Caitlin Owens (@caitlinnowens) February 22, 2017,  After the event concluded, Cassidy sought out the pastor who gave the opening prayer, Michael Sprague. “Thanks for doing that,” Sen. Cassidy said. “Wow, they booed the name of Jesus. ” Despite the hostile reception from his constituents, the senator kept his cool and did not get discouraged. “I assume they’re Americans who care about our country, who feel differently about Trump than most folks in Louisiana do,” Sen. Cassidy said. “But they’re coming out with their constitutionally protected right to assemble and speak. And isn’t that a good thing?”'"}, "time": 1742561782.9864998}