{"duration": 0.06779170036315918, "input_args": {"text": "'From the archives: Here’s one of our favorite stories with helpful tips for Smarter Living. Now that nearly every airline is charging baggage fees, travelers are motivated to pack as efficiently as possible. And who knows more about packing than professional flight crews? In interviews with a dozen flight attendants and pilots, one theme emerged: to pare down and still have everything needed at the destination, think strategically. Where you’re going and what you’ll do there should guide packing, but it is most important to know your absolute essentials. “I try to pack everything I’ll need to survive,” said Leigh Johnson, a retired American Airlines captain. The ability to wash shirts and underwear is important to him, so Mr. Johnson brings laundry soap. And because he often arrives at the airport for a flight before the restaurants open, he packs food. “I’m not wasting my hour of preflight looking for something to eat,” he said, explaining that he seals bananas, bread and plastic containers of olive oil in plastic bags and tucks them inside his packed shoes. A surprising number of pilots and flight attendants say they always carry food. “More flight attendants carry food than don’t,” said Heather Poole, a flight attendant and travel blogger at www. heatherpoole. com. Professional travelers also pack personal electronics like   readers and laptops. Patrick Smith, an airline pilot who writes the Salon column Ask the Pilot, often brings a camera so he can post his travel videos online. “I have a   relationship with my electronic gadgets,” Mr. Smith said. “On one hand, they are eminently useful. On the other hand, I resent the amount of hardware that I’m forced to carry, and I particularly resent the fact that every gadget has its own proprietary recharging device. ” To make room for these new travel necessities, many flight attendants roll their clothes rather than fold them to save space. Nerea   an attendant with Air Europa Líneas Aéreas in Majorca, Spain, has taught friends and relatives to   clothes. “The    tip is the basis of my entire company,” said Don Chernoff, an engineer and frequent traveler, whose www. skyroll. com offers a line of luggage that encourages rolling rather than folding. “It’s a more efficient use of the space. ” Weather and terrain create the biggest packing challenges. Coats, hats and umbrellas are cumbersome. Jay Abramson, a captain with Continental Airlines, avoids bringing heavy garments even in winter. “A thermal   and long underwear will allow you to wear a sweater and a fleece or lined windbreaker down to the   degrees,” he said. If Sara Keagle, a flight attendant, can’t get by with the coat her airline issued, she’ll pack several   sweaters and layer them. Fred Arenas, a corporate pilot, travels with just one pair of shoes, the ones on his feet in the cockpit. If you need more, follow the advice of Ms. Poole, the Los Angeles flight attendant. Select shoes, then coordinate outfits around them. Three pairs should be the maximum, she said: “Shoes take up so much space. ” Mr. Johnson, an avid outdoorsman, wears his hiking boots onto the plane rather than pack them. Pilots are often teased about repurposing the trousers from their uniforms. But minus the   blazer, a pilot’s or flight attendant’s uniform pants in a basic solid color are easy to pair with a shirt or sweater. Mr. Laurie’s   flight attendant uniform is all black. By planning to wear part of his uniform in   he opens space in his bag for something else. Of course, travelers don’t have uniforms, but they can adopt a uniformlike mentality by wearing onto the airplane the blazer or suit they’ll need at their destination. Select garments that travel well. “Usually a   percent   blend combo is best,” Mr. Arenas said. Mr. Smith said: “  apparel isn’t always the most stylish, but it’s lightweight, washable in a hotel room sink and takes up little room. Think REI or Travelsmith. ” Another uniformlike concept is   separates that can go together in different ways. Ms. Keagle, who podcasts about flying with Mr. Laurie, said she brings a few basic pieces like black pants that don’t wrinkle and black tops, then packs small accessories like scarves and jewelry. Ms.   takes a similar approach. “I always pack the same clothes because I go with different people they don’t know what I wore the last time,” she said. While deciding between what’s essential and what’s extra is highly personal, Mr. Chernoff, the luggage designer, has advice that’s universal. “Think hard about what you are doing,” he said. “Pare down what you are going to bring. Then, when you’re done, pare it down again. ”'"}, "time": 1742563965.2490506}