{"duration": 0.14365100860595703, "input_args": {"text": "'BAGHDAD  —   Long before Falluja was known the world over for deadly jihadists, it was known all over Iraq for its kebab  —   fatty lamb, ground and mixed with onion, grilled on a skewer over an open fire and served with a pinch of sumac  —   at a joint called Haji Hussein. Everyone, it seemed, ate at Haji Hussein: locals, soldiers, tourists and businessmen traveling the    highway that runs through the city. Starting in 2003, journalists covering the war ate there, and so did American soldiers and the insurgents who fought them, perhaps even at the same time. The restaurant was damaged by bombs multiple times, and entirely flattened once by an American airstrike. It was rebuilt, embraced as a symbol of Falluja’s own rebirth after years of war, only to be abandoned when the city fell to the Islamic State more than two years ago. Now the   kebab restaurant has been reborn again, this time in Baghdad, in a modern,   building in the upscale Mansour neighborhood. A new entrant on the capital’s thriving restaurant scene, it offers great kebab and a dose of nostalgia for a time when Baghdadis thought nothing of zipping off to Falluja for lunch at Haji Hussein. “This was the craft of my grandfather,” said Mohammed Hussein, who runs the business that has been in his family since the 1930s, when Falluja was a city of agriculture, smuggling and tribal traditions, not a jihadist haven. The restaurant, shiny and well lit, is packed most nights, and patrons wait for tables  —   15 to 20 minutes or so, something almost   in Iraq. There are two   televisions on the first floor, tuned to news channels reporting on the military campaign to retake Falluja from the Islamic State. “I can’t bear to watch the news,” Mr. Hussein said. There was one news flash recently that did not escape his notice: The Iraqi Air Force, like the Americans 12 years ago, announced that it had struck his restaurant site in Falluja because leaders with the Islamic State, also known as ISIS or ISIL, were meeting there. A statement from Iraq’s Joint Operation Command appeared on the television: “Based on intelligence information about a meeting for ISIS leaders in Haji Hussein restaurant inside the center of Falluja an airstrike was launched on the restaurant, which led to the killing of tens of ISIS terrorists. ” But the restaurant, Mr. Hussein said, has been deserted for two and a half years. When Iraqi forces recently made gains inside Falluja, people almost immediately began talking about Haji Hussein. The federal police released a combat video saying they were fighting near the restaurant, and a glimpse of the   facade showed it damaged but not destroyed. On state television, commentators expressed hope that Haji Hussein might reopen soon in Falluja. In 2004, the Americans bombed the restaurant based on intelligence that insurgents loyal to Abu Musab   the founder of Al Qaeda in Iraq, the forerunner of the Islamic State, were eating there. After the bombing, a member of Mr. Hussein’s family defiantly told The Boston Globe that “the mujahedeen and the insurgents prefer my restaurant and come to me for their three meals. ” Patrick Graham, a Canadian journalist who covered the Iraq war, likened Haji Hussein to a Nova Scotia branch of a popular Canadian doughnut chain. “It probably had been an insurgent meeting place,” he wrote in an online column last year, “but only in the way that the local Tim Horton’s in Antigonish, N. S. is a Conservative Party meeting place. Everyone went to Haji Hussein, insurgents included. ” This being the holy month of Ramadan, the Baghdad restaurant has been busy lately serving iftar, the evening meal to break the day’s fast. The parking lot is also a beehive of activity: a security guard checking cars for bombs a man selling balloons to families children begging. As Mr. Hussein, 49, sat down to chat one recent evening, he was surrounded by   waiters  —   much of the staff from Falluja now works in the new place  —   filling the tables with dishes of mezze, or appetizers, as diners waited to break their fast. In addition to heaping platters of the famous kebab, there were dates coated with sesame paste, watermelon, hummus, cucumber and tomato salad, pickles and soup. There were some new items on the menu that were not served in Falluja: grilled river carp, called masgoof a Yemeni    meal called mandi and maklouba, a dish of chicken and eggplant and rice that is originally Palestinian. As customers streamed in, Mr. Hussein tried to recall how many times his restaurant in Falluja had been damaged or destroyed by the war. “Too many to count,” he said. At times, he said, he would have to call a local windowpane salesman once or twice a week. “It was a funny joke,” he said. “I’d call and he’d say, ‘Which size?’ He would have all the sizes for my windows on hand, ready. ” Mr. Hussein recalled an American officer who used to stop by, and grab his kebab right off the grill with a piece of flatbread. But he kept his distance from the occupiers. “We tried not to become friends with them,” he said. “They would say hi, we would say hi, that was it. ” He said peace would not be easy in Falluja, even after liberation from the Islamic State, without political compromises between the   government in Baghdad and the Sunni community. Speaking of the people of Falluja, he said, “There were reasons they joined ISIS  —   oppression, random arrests. ” At least in his restaurant, Iraq does not seem hopelessly divided by sect. Sunnis and Shiites break their fast at slightly different times, and as sundown approached one of the televisions was tuned to a Sunni channel, the other to Iraqiya, the channel of the   government. When the call to prayer  —   the signal that the day’s fast was over  —   went out on one, the Sunnis began eating. Fifteen minutes or so later, the Shiite customers began eating. Anas   who is perhaps Baghdad’s only restaurant critic, has praised Haji Hussein on his widely followed Baghdad Restaurant Guide on Facebook, for its kebab, cleanliness and service. One Iraqi exile, pining for home, posted a comment on Mr. Sarraf’s site: “I have been out of Iraq for 13 years, and there is no Iraqi food or Iraqi kebab like Haji Hussein. Inshallah, I will come back one day to eat at Haji Hussein in Falluja and in Baghdad. ” In the kitchen, Mr. Hussein’s nephew, Marwan Mohammed, was working the grill. Now 26, he has been working in the family business since he was 8, washing the skewers. Mr. Mohammed said the secret to his kebab is fresh lamb, as opposed to   imported meats that he said many Iraqi restaurants use. The family still raises its own sheep in a   area near Falluja, and usually serves the kebab on the same day the sheep is slaughtered, or the next day. “We only feed them grass and special food,” he said. “We never let them go out in the open and eat garbage. ” The only other ingredient mixed with the minced lamb is onions. Sumac and a squeeze of lemon at the table add more flavor. Mr. Hussein’s fortune may now be in Baghdad, but his heart is in Falluja. His hometown, he said, “is like a sacred place for me. ” He added, “My heart beats faster when Falluja comes to my mind. ” He began to cry as he described what Falluja used to be. “Simple people,” he said. “It was a tribal society. We’ve never even had a hotel. There was hospitality for everyone. All homes were hotels for visitors. ” Recipes:   Kebabs | Adana Kebabs | Lamb and Fig Kebabs with Honey and Rosemary'"}, "time": 1742562949.170173}