{"duration": 0.03377795219421387, "input_args": {"text": "'LOS ANGELES  —   It was a surprise photo finish at the weekend box office, with the   drama “Hidden Figures” and “Rogue One: A Star Wars Story” each selling an estimated $22 million in tickets at North American theaters. Most analysts had expected “Rogue One” (Disney) to easily repeat as the No. 1 multiplex attraction. The “Star Wars” spinoff has now collected about $477. 3 million over four weeks. Overseas, it has taken in another $437 million. But in its first weekend in wide release “Hidden Figures” (20th Century Fox) about unsung black heroines in the NASA space race of the 1960s, was lifted by strong reviews, an aggressive   marketing campaign that included a   appeal to faith audiences, and attention on Hollywood’s annual awards circuit. Fox said “Hidden Figures,” directed by Theodore Melfi and starring Octavia Spencer, Taraji P. Henson and Janelle Monáe, did particularly well in San Francisco, Washington, Chicago and Cleveland. Produced by Chernin Entertainment and Levantine Films for about $25 million, after accounting for tax credits, “Hidden Figures” received an   grade from ticket buyers in CinemaScore exit polls. The movie was most popular with women (64 percent of the audience) and people over the age of 35 (about 56 percent of attendees). The animated musical “Sing” (Universal) was next in line, taking in about $20 million, for a   domestic total of $213. 4 million. The weekend’s other new   movie, “Underworld: Blood Wars” (Sony) only managed $13 million in ticket sales, or nearly 50 percent less than the initial results for its 2012 franchise predecessor. Sony noted that “Blood Wars” also cost half as much to make  —   about $35 million  —   and has already taken in $45 million overseas. Sony also blamed winter storms in the Eastern United States for decreasing turnout. Among specialty releases: “Manchester by the Sea” (Roadside Attractions) sold about $2. 5 million in tickets in 1, 054 theaters, lifting its total to $34 million “Patriots Day” (CBS Films and Lionsgate) about the 2013 Boston Marathon bombing, had $105, 000 in seven locations, ahead of its nationwide release on Friday.'"}, "time": 1742628368.2418542}