{"duration": 0.08323049545288086, "input_args": {"text": "'The State of California issued the first tranche of taxable construction bonds last Thursday for the High Speed Rail Project, making it clear that it is determined to go ahead with the unpopular project despite numerous obstacles, including federal funding roadblocks thrown up by President Donald Trump. [According to a Bloomberg News report, California officials have made a show of faith by moving forward with the $1. 25 billion offering, despite challenges including a lawsuit filed in Sacramento’s Superior Court. According to a Los Angeles Times story, “[t]he suit was brought by John Tos, a farmer Kings County the city of Atherton and several opposition groups,” and focuses chiefly on AB 1889, a bill that alters the way bond money can be spent. Attorneys for the plaintiffs, who oppose the train, state that “the bond act never gave the legislature the authority to alter it. ”  The project is roundly vilified by pundits and talk radio hosts up and down the state  —   every major California GOP politician has denounced it, with the exception of Fresno Mayor Ashley Swearengin —  and now many residents who originally voted for it, no longer support what they see as Brown’s “boondoggle. ”  But none of that has stopped Jerry Brown from making his legacy project the state’s top priority. “California can well afford it, and it will make our state a much better place,” Gov. Jerry Brown said in February in a recorded news conference to which his press office referred in response to questions from news organizations. “I know we’re going up against a very red tide here of opposition. This thing is a   project, and one way or another we’re going to get it. ” Brown is coming off a rough couple of months,  as California’s crumbling infrastructure became front page news  —   highlighting the apparent folly of building a very expensive train with money the state doesn’t have —  while raising gas taxes that will hit the working poor the hardest. Proceeding with the controversial project comes at considerable risk to California’s perennially shaky finances.  If the lawsuit is successful in freezing the original bond funds, that would be a major setback. At issue in the suit is the diversion of $713 million of Proposition 1A Bond Funds  —   specifically designated for the High Speed Rail  —   to act as matching funds for a $2 Billion project to electrify and retrofit a   Silicon Valley commuter rail known as Caltrain. On top of that, if Trump freezes all federal funds, both rail projects will struggle even more. CalTrain officials were banking on a $647 million matching grant from the Federal Transit Administration  —   which Trump has “deferred” indefinitely. If the federal spigot is turned off, California taxpayers might be forced to foot the entire bill, essentially killing the projects by delaying them  —  which can force the return of matching funds already spent. The Washington Post reports that President Trump weighed in on the issue in a note to Congress last month, stating that “localities should fund these localized projects. ” Some political observers believe that Trump’s denial of funds is just playing politics. Christopher Leinberger, chair of George Washington University’s Center for Real Estate and Urban Analysis, told the Post that the cuts suggest Trump is “playing to the base,” because he received much less support in urban areas than in “drivable suburban locations. ” “This is about pure politics,” Leinberger said. Rep. Jeff Denham ( ) who chairs a key House Transportation and Infrastructure subcommittee, disagrees. Denham, who lobbied Transportation Secretary Elaine Chao to deny the grant on the basis that the new Caltrain cars did not meet the definition of   rail, urged Brown to find a different source of state funding for Caltrain, then reapply for the matching federal grants, cautioning that overcommitment puts other priorities at risk. “If you’re going to continue to obligate state dollars that you do not have, then you’re in jeopardy of at some point the federal government calling for those notes to be due, which could then put public safety dollars at risk, other transportation dollars at risk or education dollars at risk,” said Denham according to Bloomberg, who sits on the transportation and infrastructure committee. Brown, who met with Chao last month to discuss the grant, said of Denham in a phone interview with the Post: “That’s called blackmail. ” Californians “voted for a bond issue” for   rail “but envisioned other projects” using the cash, the governor said in the interview. “To go against it is the rawest, stupidest form of politics. ” Tim Donnelly is a former California State Assemblyman and author who is doing a book tour for his new book: Patriot Not Politician: Win or Go Homeless. He ran for governor in 2014. FaceBook: https:  . facebook. . donnelly.  Twitter:  @PatriotNotPol'"}, "time": 1742628406.0119715}