{"duration": 0.06803512573242188, "input_args": {"text": "'Dienstag, 8. November 2016 Frau von Maus aufgefressen, weil sie nicht sofort kreischend auf Stuhl gesprungen ist Remscheid (Archiv) - Es ist eine Tragödie, die leicht hätte verhindert werden können: Eine 43-jährige Frau ist heute im nordrhein-westfälischen Remscheid in ihrer eigenen Wohnung von einer Maus angegriffen und grausam zerfleischt worden. Nach Polizeiangaben hatte es die Frau leichtsinnigerweise unterlassen, rechtzeitig auf einen rettenden Stuhl zu springen und zu kreischen. Wie aus dem Polizeibericht hervorgeht, bereitete das Opfer Susanne B. gerade gemeinsam mit einer Freundin Essen zu, als das Nagetier ohne jede Vorwarnung in der Küche erschien. Daraufhin rettete sich die 38-jährige Freundin der Frau geistesgegenwärtig sofort auf einen Stuhl und versuchte, das Tier mit lautem Kreischen zu verjagen. So kann nichts passieren. Susanne B. hingegen sei unbeeindruckt stehengeblieben und habe erklärt, es handle sich nur um eine \"völlig ungefährliche Maus\", die \"niemandem\" etwas zuleidetue – laut dem Bericht ihre letzten Worte, bevor sie von dem Tier angefallen und vor den Augen ihrer entsetzten Freundin zerfleischt und gefressen wurde. Als die von der Freundin verständigte Polizei in Begleitung eines Notarztes eintraf, waren von Susanne B. nur noch eine Blutlache und einige Kleidungsfetzen übrig. Die Maus war spurlos verschwunden. Um tödliche Mausangriffe wie diesen zu verhindern, raten Experten, beim Erblicken einer Maus sofort ein erhöhtes Möbelstück (Stuhl, Sofa, Schrank) zu erklimmen und dort auszuharren, bis sich die blutrünstige Bestie wieder verzogen hat. Biologen zufolge können Mäuse nämlich nicht klettern, weil ihre Krallen ausschließlich auf das Aufschlitzen und Zerteilen von Menschen ausgelegt sind. Auch möglichst hysterisches Kreischen hilft bei der Abwehr der herkömmlichen Hausmaus, die aufgrund der Größe ihrer Ohren derartige Töne im oberen Frequenzbereich nicht verträgt. In Remscheid wird derzeit noch nach der flüchtigen Maus gefahndet, Polizisten mit Katzenstaffeln patroullieren seit dem frühen Nachmittag in der Nachbarschaft. Der Augenzeugin zufolge ist die Gesuchte grau-braun, etwa ein bis drei Jahre alt und hat dunkle Augen. Sachdienliche Hinweise an die zuständige Polizeidienstelle werden mit bis zu 200 Euro belohnt. fed, ssi, dan; Fotos: Shutterstock; Hinweis: Erstmals erschienen am 5.11.15 Artikel teilen:'"}, "time": 1742562017.909539}