{"duration": 0.06510043144226074, "input_args": {"text": "'China’s state newspaper The Global Times published an editorial criticizing President Donald Trump’s decision to conduct airstrikes in Syria, suggesting it was made “in haste,” but also observed that Trump appears to want “prove to the world that he is no ‘businessman president. ’”[As the Communist Party of China controls the content of the Global Times, its editorials are often interpreted as unfiltered opinion from the government itself, often significantly more belligerent than the diplomatic statements out of China’s Foreign Ministry.  “The US military attack on Friday took place despite no definitive results from the investigation by an international organization, and was carried out in the absence of a UN Security Council resolution. The Trump administration wasted little time in striking its targets, marking a stark contrast with its predecessor,” the Times observed. “The US’ decision to attack the Assad government is a show of force from the US president. He wants to prove that he dares to do what Obama dared not,” the article continues, referring to President Barack Obama’s declaration that using chemical weapons was a “red line” after Assad was accused of using them, but not issuing any military response to the act. Trump, the Times concluded, “wants to prove to the world that he is no ‘businessman president’ and that he will use US military force without hesitation when he considers it necessary. ” The article concludes that the strikes themselves “leave an impression that the decision was made in haste and are not without contradictions. ” President Trump announced late Thursday that he ordered the launch of 59 Tomahawk missiles at a Syrian army airbase believed to house the equipment used for an alleged chemical weapons attack in Idlib province. The Pentagon issued a statement confirming that the objective of the strikes was “to deter the [Assad] regime from using chemical weapons again. ” The Global Times response to the strikes differed significantly from the official Chinese Foreign Ministry statement. Spokeswoman Hua Chunying told reporters that Chinese officials “oppose the use of chemical weapons by any country, organization or person for any purpose and under any circumstance” and that China “supports relevant UN agencies in carrying out independent and comprehensive investigations into all uses or suspected uses of chemical weapons and, on the basis of solid evidence, reaching a conclusion which can stand the test of history and facts. We have noted the latest developments. ” While emphasizing support for a “political solution” to the Syrian Civil War, Hua refused to answer whether China considers Assad’s regime “the sole legitimate government in Syria” and did not directly criticize the U. S. airstrikes, instead stating, “the Chinese side always opposes the use of force in international relations. ”   President Xi Jinping is currently meeting with President Trump in Florida, on a visit scheduled long before the escalation of affairs in Syria. Trump reportedly said of their meeting, “I think,   we are going to have a very, very great relationship and I look very much forward to it,” predicting “lots of very potentially bad problems will be going away. ” According to the Chinese state news outlet Xinhua, Xi invited Trump to visit China and enjoyed “  friendly and   conversation” with Trump.  '"}, "time": 1742563593.84626}