{"duration": 0.11041736602783203, "input_args": {"text": "'FORT WORTH, Tex.  —   The dinner crowd was sparse for a downtown steakhouse, a handful of families and couples lost in conversations. Ryan Lundeby, 32, an Army Ranger with five deployments to Iraq and Afghanistan, took in the scene from his table, seemingly meditative beneath his shaved head and long beard. He was not. “He watches, he’s always watching he notices everything,” said his wife, Mary. “Superman noticing skills, that’s what I call it. Look, he’s doing it now  —   Ryan?” “That table over there,” Mr. Lundeby said, his voice soft, his eyes holding a line. “The guy threw his straw wrapper on the ground. I’m waiting to see if he picks it up. ” He did not. Mr. Lundeby’s breathing slowed. After 14 years of war, the number of veterans with multiple tours of combat duty is the largest in modern American history  —   more than 90, 000 soldiers and Marines, many of them elite fighters who deployed four or more times. New evidence suggests that these veterans are not like most others when it comes to adjusting to civilian life. An analysis of Army data shows that, unlike most of the military, these soldiers’ risk of committing suicide actually drops when they are deployed and soars after they return home. For the 85 percent of soldiers who make up the rest of the service and were deployed, the reverse is true. “It’s exactly the opposite of what you see in the trauma literature, where more exposure predicts more problems,” said Ronald Kessler of Harvard, who led the study. The findings may shed a clearer light on the need of this important group of veterans, whose experience is largely unparalleled in American history, in their numerous exposures to insurgent warfare, without clear fronts or predictable local populations. Researchers are finding that these elite fighters do not easily fit into the classic mold of veterans traumatized by their experience in war. As psychologists and others grow to understand this, they are starting to rethink some approaches to their treatment. The idea that these elite fighters can adapt solely by addressing emotional trauma, some experts said, is badly misplaced. Their primary difficulty is not necessarily one of healing emotional wounds they thrived in combat. It is rather a matter of unlearning the very skills that have kept them alive: unceasing vigilance snap decision making intolerance for carelessness the urge to act fast and decisively. “I don’t even leave my house much,” said Jeff Ewert, who served with the Marines in Iraq and now lives in Utah. “I’m scared not because I’m an   or anything. I just minimize my exposure because I know how easy it is to cross that line, to act without thinking. ” Alan Peterson, an Air Force veteran who oversees two large research consortiums studying combat stress at the University of Texas Health Science Center at San Antonio, is sharply aware of the challenges. “Turning off this   after returning from a deployment is not an automatic function of the brain,” he said. “We have virtually no science to guide us in managing these instincts. We need to figure that out, or we’re going to end up with a generation that struggles for much of their lives. ” Mr. Lundeby’s Ranger battalion specialized in extractions  —   surprise raids on   insurgents. The soldiers usually struck at night  —   vampire work, some called it  —   and often the missions were over within a couple of hours. It is one thing to train for such work. It is another to perform well when something goes sideways. In a 2007 raid in Baghdad, the team blew the front door off a house, leaving a screen door  . The first man inside  —   the point man and team leader  —   tripped on the screen and fell down. Mr. Lundeby was behind him. “You want to help him, you feel this almost tidal pull,” he said. “But that’s someone else’s job yours is to keep the momentum going. ” He next remembers being in the house, the green haze of the   gear, going room to room, watching for anything amiss. And then, a few doors down, “We pulled the guy out, put him in the truck, and were gone, done. ” The military is very good at identifying and amplifying the psychological factors that make a   fighter. The Pentagon has spent hundreds of millions of dollars on testing and analyzing these elements, but its researchers publish very few of their findings and refuse to speak in specifics on the record. Psychiatrists and psychologists who have worked with the military say the   mental profile is based largely on two   kinds of testing. One is a   questionnaire that assesses personality. The other test is intended to gauge performance. People who excel in combat tend to be assertive, active,   and enthusiastic. “I hate to use the cliché, but these are guys who love to be at the tip of the spear,” said a psychologist who works with the military he asked that his name be omitted to protect that relationship. “It’s more than the camaraderie there’s a need to protect life, directly  —   and if necessary, to take life. ” The performance measure has more to do with attention and decision making. It is based in part on a theory of concentration “styles,” developed by researchers studying athletes. “The classic analyst takes in the information and then retreats into their head and wants to think about it, then maybe checks the environment again and thinks some more,” said Dr. Charles A. Morgan III, a psychiatrist at the University of New Haven who has worked extensively with Special Operations forces. The elite combat troops operate much differently, he said. “They immediately take in their surroundings they have a high degree of external focus. But they’re able to switch internally, make a quick decision  —   then act and adjust as they go. ” In training and in combat, this intense awareness and decision making become much sharper. “Essentially the decision making and acting become second nature,” said Bret Moore, the deputy director of the Army’s Warrior Resiliency Program of the Regional Health   in San Antonio. “You do not want these guys thinking too much. ” That may help explain the recent suicide findings. The research team, led by Dr. Kessler of Harvard and Dr. Robert Ursano of the Uniformed Services University of the Health Sciences, analyzed 496 suicides among men in the Army from 2004 to 2009. The risks for two jobs  —   infantryman and combat engineer  —   were higher across the board, at 37 per 100, 000 each year. But the rate was 30 per 100, 000 while deployed, compared with 40 per 100, 000 when back home. The rate across the rest of the Army was much lower at home, 15 per 100, 000, compared with during deployment, where it was 22 per 100, 000. “These are the guys, we think, who are getting into fights, or in trouble with the law, who are impulsive and don’t manage well when they’re back in a civilian world that seems boring and frustrating,” Dr. Kessler said. Mr. Lundeby had the makings of a combat soldier from an early age. Growing up in Modesto, Calif. the younger of two brothers, he was mostly easygoing  —   a Boy Scout, a driven athlete  —   but for a sensitivity to injustices, small and large. “He had this intense sense of what was fair and just, and he would go toe to toe” with anyone, said his mother, Vicky Lundeby. “He had to be the one to make things right. ” That quality left him feeling bored and disconnected after high school, studying graphic arts at a local community college. The news coming out of Iraq in 2003 put him in motion: He signed up for the Army Reserve, then the National Guard. In 2005, Hurricane Katrina landed his Guard unit in New Orleans, working for a month to contain looting and help people evacuate to safety. “I decided, right there,” he said, “I want to do this every day. ” “Katrina changed him,” said his father, Luther. “I feel like it gave him that purpose he wanted. ” Ryan Lundeby joined the Army and soon set his sights on the Rangers, beginning an intense training regimen. In 2007, he deployed for the first time, to Iraq. “It felt like Christmas finally, a chance to do this for keeps. ” But returning home for good in 2010, he was a man on constant patrol. He raged at fellow drivers whom he considered rude or careless. He confronted litterers, often by picking up the offending cigarette butt or   wrapper and throwing it in their faces. When a driver cut off Mary, then his fiancée, on her way home from work, he jumped on his motorcycle in nothing but running shorts and prowled the neighborhood to make the man pay. “I don’t know what I would have done if I’d found him,” he said. “But I feel like that’s what happens to guys. You react  —   and next thing you know, the police are there. ” The combat veterans in this category form “a pretty closed club,” said Ford Sypher, a friend of Mr. Lundeby’s and a fellow Ranger, who deployed five times and, after leaving the Army, has returned to the Middle East, now as a documentary filmmaker. “We don’t talk about this stuff much with anyone. But we’re all trying to figure out ways to manage it. ” For now, there is no therapy that reliably reverses or dials down the instincts acquired in multiple combat tours.   researchers are experimenting with a variety of approaches for these veterans, including virtual reality and biofeedback techniques, in effect to train new instincts that overwrite the old ones. There are psychologists who argue that vigilance, snap decision making and other combat attributes can be helpful in some aspects of civilian life. “You begin by letting people know that they’re not crazy, it’s not at all abnormal to have these reactions  —   it’s normal,” said Richard Tedeschi, a psychologist at the University of North Carolina, Charlotte, who works with veterans. And those skills, he added, “can be turned to a future mission, whether that’s related to family, or helping other vets, or to a job. ” Mr. Lundeby has been lucky. He has a supportive family and group of friends, and a wife who understands his quirks and helps him manage them. She was the one who demanded he visit a veterans clinic, which led to therapy with a former Marine who understood how to get him to think before acting  —   even if the urge was strong. “He got me to ask, ‘Do I have time to do this  —   to right every wrong? ’” said Mr. Lundeby, who several months ago landed his first   job, at a helicopter manufacturer. “And he got me to see the humanity of the people I was confronting. ” “So I may always be a Ranger, in some ways,” he said, “but I’ve stopped trying to be the world’s sheriff. ”'"}, "time": 1742628524.4271142}