{"duration": 0.06796145439147949, "input_args": {"text": "'We Are Change \\nIn this latest Project Veritas video an undercover journalist is offered Huma Abedin’s ballot while wearing a full burka and not even questioned.\\nShe is then told that she can vote via a paper ballot instead of voting with a voting machine. Alan Schulkin, a Democratic Elections Commissioner in NYC then explains on video how voter fraud can be committed when people wear burkas inside polling locations on Election Day.\\nThe video starts with the undercover PV journalist talking to Alan Schulkin, the Democratic Elections Commissioner in NYC in which the journalist says, “Not only just voter ID because of voting twice, but people can cover their faces, you know what I’m saying?”\\nAlan Schulkin responds, “Well the Muslims can do that too. You don’t know who they are.”\\nThe PV journalist then proceeds to test out the information that Alan Schulkin gave to her. An election official then questions the journalist dressed in full burka.\\n“Do you know where you’re going?” The journalist responds, “No.”\\nThe official then asks the PV journalist for her address in which she responds “254 Park Avenue South.”\\nThe election official then gives the PV journalist a number in line. The video cuts back to Alan Schulkin and the PV journalist’s conversation in which the PV journalist says, “Especially, all those burkas someone could claim, oh it’s my religion, but then you don’t know if they are pretending or not.”\\nAlan Schulkin responds “Exactly!”\\nThe journalist then proceeds to vote under the name “Huma Abedin,” after talking to an election official who greets her with “Good morning, last name?”\\nThe PV journalist responds, “Abedin”\\nWhat follows is shocking, “Since we don’t have your name in the book. You can fill out an affidavit ballot. Ok?” the official says.\\nThe official then asks the PV journalist if she is “Democrat or Republican?” The journalist responds troll-fully “Huma Abedin is a registered Democrat.”\\nThe election official then responds “I don’t have your name in the book but you can vote with a paper ballot.”\\nThe segment then cuts back to Alan Schulkin in which he makes a racist comment about Muslims.\\n“They detonate bombs in public schools which we’re using that could disrupt the whole election.”\\nThe PV journalist responds “Yeah but they could do it wearing a burka. But then no one could say oh wait let me see your voter ID because they don’t have ID because they don’t want to discriminate because they are wearing a burka.”\\nSchulkin responds again agreeing with the journalist “exactly” he says.\\nShe then continues to explain. “But no one can do that because your going to offend them, but then it’s like, hey now, I’m not a Muslim but I can go in there you know?”\\nThe video then cuts back to the election official speaking to the PV journalist “But your names not in the book, for some reason it’s not here, but that doesn’t mean you can’t vote by paper ballot. You just can’t vote by machine.” the election official repeats.\\n“Okay so I can vote today by paper ballot?” the PV journalist responds.\\n“Yes, yes,” the election official responds.\\nThe journalist then reiterates that she is voting as Huma Abedin to the official who still hasn’t caught on.\\n“So I can vote today as Huma Abedin, but just with a paper ballot?’\\nThe election official then responds “Whatever you want if that’s you. If that’s the name you voted with last election, and you haven’t changed your name?”\\n“Okay Ill be back. I’m going to go call my husband Anthony.” The PV journalist then walks away and is told to “come back later” by the election official.\\nThe video ends with a final cut back to Alan Schulkin in which he makes the statement, “Your vote isn’t really counting because they can go in there with a burka on and you don’t know if they are a voter.” He adds, “your vote gets discounted because they come in there with a burka on and they can vote. People think it’s a liberal thing to do, but I take my vote very seriously and I don’t want ten other people coming in negating my vote by voting for the other candidate when they’re not even registered voters.”\\n \\n \\n \\n \\n \\nThe post Project Veritas Undercover Journalist in Full Burka Is Offered Huma Abedin’s Ballot appeared first on We Are Change .\\n'"}, "time": 1742561808.9568307}