{"duration": 0.0806431770324707, "input_args": {"text": "'Just like all other types of phones out there, your beloved iPhone comes with some neat “code tricks” hidden within it. A hidden code on a mobile device allows the uncovering of hidden menus, or maybe even acts like a direct command, such as you would use in a terminal based on the Apple OS. Some of the codes may also reveal more information about your specific device. \\nVia AnonHQ \\n\\nBelow, I have provided a list of the top 9 best codes you can use on your iPhone. However, not all of these codes may work. If they don’t, it’s most likely an issue with your carrier, not your Apple device.\\nFor those who are new to “phreaking,” secret codes for mobile devices are often combinations of numbers, the asterisk key (*), and the hash-tag sign (#). These codes are typed directly into your phones ‘call’ or ‘dial’ feature. Just simply open the Phone App and type in the random codes that you see below.\\nOnce you have finished typing the code, the respective operation will automatically start. Don’t try to push the call button, as it will not be able to call the number. If the respective operation does not start right away, double check the code here with the code you typed in. If it still fails, Google-search the code to see if your carrier actually supports it.\\nIMEI Number This is the International Mobile Equipment Identity. Typically, your IMEI number is 15 digits long, and uniquely identifies your phone. You can also find your IMEI number by going to Settings > General > About to find this number, or alternatively use the short cut by opening the phone app and typing in *#06# .\\n\\nField Testing Our Calling This is a hidden feature that allows you to find out any information about live updating your device’s network. With this, you will be able to not only uncover the numerical value of your device, but also read the data transmitting from local cell phone carrier towers. To help you understand these results, those around -50 and less are considered optimized. For the results around -120 and more, they are considered to be extremely poor signals. To access this network feature, simply open your phone app and type in *3001#12345#* + ‘Call’ .\\n\\nThe Call Barring Feature This feature allows you to check any restriction status you may have on any and all outgoing calls, data use and text messages. The call barring feature is often utilized when protecting yourself from ‘accidentally’ calling, while you have the little one playing with your device. You can check the status of your call barring by typing in *#33# . You can turn on the service by typing in *33*pin# , and to turn the service off, type in *33*pin #. Just replace the “pin” with your SIM card pin – not your iPhone’s lock pin.\\n\\nCall Waiting With a simple short code, you can check the status of your call waiting (provided you have it), as well as enable and disable call waiting. For those who don’t know what call waiting is, this services allows you to (while you are already on a phone call) either hang up with your current call and answer whoever is calling you, or allow them to sit in line while you finish your conversation with the current person. If you would like to check the status of your call waiting feature, simply type in *#43#. If you would like to enable it, type *43# or to disable the function, #43#. \\n\\nThe Call Forwarding Feature With call forwarding you can direct phone calls to another phone number while you are busy at a meeting. Outside of voice, you can also utilize the forwarding feature for data and faxes. You can access the call forwarding feature by going to your iOS Settings > Phone > Call Forwarding . If you would like to view all status’, type in *#21# . To make it unreachable, type in *#62# and for when you are busy, use *#67# . If you want to disable all forwarding services use ##002#. \\n\\nAnonymity Often, people ask how to make an anonymous phone call. Anonymity calling is setting an outgoing call to make your phone number hidden from the receiver. In order to set the anonymity of phone calling, we can use Settings > Phone > Show My Caller ID . Alternatively, type in *#31# to check the status, and then use #31#phone number + ‘Call’ . This will send the receiving phone the anonymous “Unknown Caller” display.\\n\\nIncoming Calls You can view the number of incoming calls by typing in *#30# + ‘Call’ .\\nViewing the Carrier’s Text Messaging Center Number We can also obtain our carrier’s text messaging center number by typing in *#5005*7672# + ‘Call’ . This is helpful if you have issues with your text messaging service.\\nThe Enhanced Full Rate (EFR Mode) This is a speech coding standard that improves the overall quality of GSM-based conversations. However, this service also eats into your battery life. However, if you want to enhance your overall voice quality, simply type in *3370# + ‘Call’ to see if your phone qualifies for this service. Note, however, that not all carriers support this enhancement.\\nHere are some more codes: \\n*#5005*7672# : SMS centre number\\n*#31# : Hide your number on calls option\\n*646# : Check minutes left on contract\\n*225# : Find out your current mobile account balance\\n*777# : Find out prepaid account balance\\n*#61# : Number of missed calls\\n*#33# : Find out what mobile services are disabled on your phone\\n'"}, "time": 1742563490.4470296}