{"duration": 0.05882382392883301, "input_args": {"text": "'Comments \\nFormer US Attorney General Eric Holder just wrote an op-ed warning the American people to disregard the FBI Director James Comey’s unprecedented decision to release information about an ongoing investigation during the heat of an election. Comey released a vague memo when he had little more to go on other than a mere suspicion and is now facing bipartisan calls for removal from office. Democratic congressional staffers now claim that their first warning of the Comey memo was when a House Republican tweeted it out with the usual anti-Hillary spin. That alone demonstrates exactly what Holder wrote about preventing “investigations from unfairly or unintentionally casting public suspicion,” which happened nearly instantly on Friday afternoon. \\nFormer Attorney General Holder also pointed out that Comey’s “newly discovered” emails have no known significance and that the FBI Director violated long standing policies in the Department of Justice – which are non-partisan – aimed at upholding the integrity of America’s form of electoral democracy, free from government intervention: \\nI understand the gravity of the work our Justice Department performs every day to defend the security of our nation, protect the American people, uphold the rule of law and be fair. That is why I am deeply concerned about FBI Director James B. Comey’s decision to write a vague letter to Congress about emails potentially connected to a matter of public, and political, interest. That decision was incorrect. \\nThe department also has a policy of not taking unnecessary action close in time to Election Day that might influence an election’s outcome. These rules have been followed during Republican and Democratic administrations. They aren’t designed to help any particular individual or to serve any political interest. Instead, they are intended to ensure that every investigation proceeds fairly and judiciously; to maintain the public trust in the department’s ability to do its job free of political influence; and to prevent investigations from unfairly or unintentionally casting public suspicion on public officials who have done nothing wrong. \\nDirector Comey broke with these fundamental principles. I fear he has unintentionally and negatively affected public trust in both the Justice Department and the FBI. And he has allowed — again without improper motive — misinformation to be spread by partisans with less pure intentions. Already, we have learned that the importance of the discovery itself may have been overblown. According to the director himself, there is no indication yet that the “newly discovered” emails bear any significance at all. And yet, because of his decision to comment on this development before sufficient facts were known, the public has faced a torrent of conspiracy theories and misrepresentations. \\nHigh ranking former Justice Department officials like Eric Holder do not make a career out of slamming their former colleagues, so it’s a very rare break in the ranks to see a former Attorney General publicly slam his former subordinate. The Hatch Act prevents federal officials from interfering in partisan elections and strictly demands that public officials refrain from doing anything that could impact an election. Holder wrote : \\nI served with Jim Comey and I know him well. This is a very difficult piece for me to write. He is a man of integrity and honor. I respect him. But good men make mistakes. In this instance, he has committed a serious error with potentially severe implications. It is incumbent upon him — or the leadership of the department — to dispel the uncertainty he has created before Election Day. It is up to the director to correct his mistake — not for the sake of a political candidate or campaign but in order to protect our system of justice and best serve the American people. \\nFBI Director James Comey knew better than to release a vague memo about an ongoing investigation, which, even under normal circumstances, should never be done. That is why former Attorney General Holder felt compelled to rebuke him in this scathing op-ed. \\nHopefully, the current members of the Justice Department tasked with reviewing the bipartisan complaints read the memo and expedite their decision concerning the future of the FBI Director. \\nIt should not take long for any rational investigator to determine that James Comey’s “cry wolf” memo was little more than a partisan prop handed to a failing campaign — and to remove the FBI Director from his office.'"}, "time": 1742561692.3749237}