{"duration": 0.09616303443908691, "input_args": {"text": "'Ireland became the first country in the world to legalize   marriage by popular vote in 2015, thanks in part to the advocacy of a drag queen called Panti Bliss. A pub owner and longtime fixture on the gay scene, she rose to mainstream fame the year before the vote when her male alter ego, Rory O’Neill, was sued for criticizing a group of activists on TV for their views on homosexuality. The lawsuit sparked a national outcry known as “Pantigate. ” During the controversy, Panti made a speech about homophobia that became a viral video sensation and turned her into a symbol of the gay rights movement in Ireland. The eventual success of the campaign for   marriage seemed to cement her celebrated status. That was a year and a half ago. For many activists  —   or drag queens  —   the story might have ended there, capped off by cheering crowds chanting her name at Dublin Castle when the results of the marriage referendum were announced. But Panti’s cultural footprint has expanded ever since. “He has a radio show, the theater show, he’s absolutely unstoppable,” Conor Horgan, a filmmaker who directed a documentary about Mr. O’Neill. “Panti’s brand is a movable feast. ” Mr. Horgan’s film received critical acclaim in Ireland and Britain in 2015 and made its New York premiere last weekend at the Irish Screen America film festival. It traces the last three decades of Ireland’s gay history through Mr. O’Neill’s life story. “As my mother would say, it’s quite the turn up for the books,” Mr. O’Neill said over lunch in New York. “If you’d said it to me 10 years ago, I would have looked at you. It’s pretty wild how queer Ireland has become. ” Panti is not alone. In recent years, a host of prominent Irish people have come out, including Maria Walsh, the winner of the Rose of Tralee, an Irish beauty pageant, Pat Carey, a former government minister, and Leo Varadkar, a young politician widely seen as a possible future prime minister. For Mr. O’Neill, becoming a symbol of modern Ireland has had its perks beyond the film, which is now playing in American film festivals. He has traveled the world as Panti, performing a   show to   houses in New York, London and Sydney. (He is in two separate shows that are in talks for a North America run.) He also released a memoir in 2014. Panti has interviewed scientists about the meaning of life for her new national radio show, and she even addressed the country last December for a “Queen’s Christmas Message. ” It was a cheeky take on a British tradition, with a towering blonde drag queen earnestly praising the nation for its changing attitudes. Those changes reach beyond   marriage. Ireland’s embrace of gay rights has inspired a new generation of progressive activism on issues like abortion access, said Ailbhe Smyth, who has long campaigned for both causes. Abortion is severely restricted by the eighth amendment to Ireland’s constitution, and has been the subject of multiple referendums since 1983. Many young political activists who came of age during Pantigate and the gay marriage campaign are pushing for another referendum. Ms. Smyth called them “a cadre of people who know how to do things on the ground. ” “The victory in the ‘Yes Equality’ campaign further opened up the path for   change in Ireland. People say ‘we can do this, we won this,’ ” she said. “You get that momentum and dynamism, that sense of optimism that flows from a victory. ” Panti Bliss was a leader in Ireland’s gay scene for more than two decades, an H. I. V.  drag queen who hosted “The Alternative Miss Ireland” pageant for 18 years and mentored a generation of younger performers. Una Mullally, a columnist for The Irish Times, said she was not the first figure in Irish history who, at first glance, seemed like an unlikely icon. “We hold our outsiders up to become Irish heroes, whether that’s people who were queer, like Oscar Wilde, or intellectual, like Beckett, or who hated Dublin, like Joyce,” Ms. Mullally said. “Panti is in that lineage in a way. Despite our social conservatism there is a sense of devilment among Irish people. ” In New York, Mr. O’Neill said he sometimes felt conflicted about his success. The New York premiere of his film was attended by Irish diplomats and Melissa   the speaker of the New York City Council, who hailed him as “a catalyst for change” in a speech. It was a far cry from his roots in the night life of the late 1980s, when he became a drag queen because it was “underground and transgressive and discombobulating,” he said. “To me it’s inherently punk,” Mr. O’Neill said. “Which is then odd for me to suddenly be an establishment figure. ” He said his performances and activism have always been devoted to expanding the idea of Irishness to include the marginalized, like migrants, religious minorities or L. G. B. T. people. He calls it “queering the Irish space. ” Did he think it was working? The question drew a laugh. “Maybe too well!”'"}, "time": 1742563341.093732}