{"duration": 1.024825096130371, "input_args": {"text": "'Mass Fish Deaths: Millions Have Been Found Dead All Over The World In The Past Month   May 20th, 2014 \\nMillions of fish are suddenly dying all over the planet. In fact, there have been dozens of mass fish death events reported in the past month alone. So why is this happening? Why are fish dying in unprecedented numbers all over the world? When more than six tons of fish died in Marina Del Ray over the weekend, it made headlines all over the United States. But the truth is that what just happened off the southern California coast is just the tip of the iceberg. In 2014, mass fish die-offs have pretty much become a daily event globally. Individually, each event could perhaps be dismissed as an anomaly, but as you will see below when they are all put together into one list it truly is rather stunning. So is there a reason why so many fish are dying? Is there something that connects these mass fish death events? Has something about our environment changed? The following are just a few examples of the mass fish death reports that have been coming in day after day from all over the globe… \\n*Over the weekend, thousands upon thousands of fish died just off the southern California coastline … \\nCalifornia Fish and Wildlife workers are still scooping dead sea life from the surface of the harbor Monday after thousands of dead anchovies, stingrays and even an octopus died and floated up over the weekend. \\nSo far officials have cleaned up 6 tons of dead fish , and they still have a long way to go. \\n*The death of approximately 35,000 fish up in Minnesota is being blamed on a “ lack of oxygen “. \\n*The recent die off of thousands of fish in the Shark River near Belmar, New Jersey is also being blamed on “ oxygen depletion “. \\n*Officials in Menifee, California are still trying to figure out what caused the death of thousands of fish in Menifee Lake a few weeks ago… \\nAuthorities continued testing the water in Menifee Lake Friday after thousands of dead fish have been seen floating since last weekend. \\nMenifee city officials first heard reports Saturday of floating fish at the lake, which is located on private property about a half-mile east of the 215 Freeway. \\n*In the Gulf of Mexico, dolphins and sea turtles are dying “ in record numbers “. \\n*Maryland officials are still puzzled by the death of 7,000 Atlantic menhaden last month… \\nState environmental scientists are investigating the cause of a fish kill that left about 7,000 dead Atlantic menhaden in waters that include the Inner Harbor and Fells Point. \\nJay Apperson, spokesman for the Maryland Department of the Environment, said that biologists went by boat on Tuesday to the area of Monday’s fish kill. He says the area extended from the mouth of the Patapsco River, up the Baltimore Harbor to Fells Point and Fort McHenry. \\n*Mass fish die-offs in Lake Champlain up in Vermont are being called “ the new normal ” by government officials. \\n*Along the coast of northern California, seals and young sea lions are dying “ in record numbers “. \\n*Three months ago, farmers in Singapore lost 160 tons of fish to a mass die-off event. \\n*Back in September, approximately 40 kilometers of the Fuhe River in China “ was covered with dead fish “. \\n*Also during last September, close to ten tons of dead fish were found floating on a lake near the town of Komotini, Greece . \\nThe following are some more examples of mass fish death events from just the past several weeks that come from a list compiled on another website … \\n\\n17th May 2014 – Masses of fish turn up dead in a marina in Pultneyville, New York, America . Link \\n16th May 2014 – Mass die off of fish in a river in Aragatsotn, Armenia . Link \\n15th May 2014 – Hundreds of fish dying off ‘due to pollution’ in the wetlands of Rewalsar, India . Link \\n14th May 2014 – Thousands of dead fish washing ashore in Cootes Paradise, Hamilton, Canada . Link \\n13th May 2014 – Tens of thousands of dead fish wash up along coast of Tasmania, Australia . Link \\n12th May 2014 – Mass death of fish in the river Eden ‘is a mystery’ in Cumbria, England . Link \\n11th May 2014 – Thousands of dead Puffer Fish, also dead turtles washing up on various beaches in Colombia and Costa Rica . Link and here \\n11th May 2014 – Hundreds of dead fish found in a pond is ‘a mystery’ in Southborough, England . Link \\n10th May 2014 – Thousands of fish dead due to pollution in spring in Sikkim, India . Link \\n9th May 2014 – Die off of Fish ’causes panic’ in the Luda Yana River in Bulgaria . Link \\n8th May 2014 – Thousands of dead fish appear in a lake ‘shock residents’ in Mangalore, India . Link \\n8th May 2014 – 12 TONS of dead fish removed from lakes in Chisago County, Minnesota, America . Link \\n7th May 2014 – Massive die off of fish in reservoirs in Quanzhou, China . Link \\n7th May 2014 – Thousands of fish found dead on the shores of Roatan, Honduras . Link \\n5th May 2014 – Hundreds of dead fish wash up on a beach ‘a mystery’ in San Antonio Oeste, Argentina . Link \\n5th May 2014 – Mass death of fish found in lakes in Almindingen, Denmark . Link \\n4th May 2014 – Mass die off of fish in a river in Fujian, China . Link \\n3rd May 2014 – 1,000+ dead fish wash ashore along a lake in Ontario, Canada . Link \\n2nd May 2014 – 40,000 fish die suddenly in a dam in Piaui, Brazil . Link \\n30th April 2014 – Mass fish kill ‘worst I’ve seen in 26 years of working here’ in Iowa, America . Link \\n30th April 2014 – Large amount of dead fish found floating along a river in Xiasha District, China . Link \\n29th April 2014 – Dozens of sea turtles are washing up dead in South Mississippi, America . Link \\n29th April 2014 – Thousands of dead fish washing up along the shores of Lakes in Wisconsin, America . Link \\n28th April 2014 – Turtles and other marine life continue to wash up dead in Bari, Italy . Link \\n28th April 2014 – Large fish kill found in the Mogi River in Brazil . Link \\n25th April 2014 – Large fish kill found in a reservoir in Nanchong, China . Link \\n24th April 2014 – Large amount of fish wash up dead along a river in La Chorrera, Panama . Link \\n23rd April 2014 – 2 Million fish found dead in a dam in Tehran, Iran . Link \\n23rd April 2014 – Mass die off of fish in Island lake in Ontario, Canada . Link \\n23rd April 2014 – Thousands of dead fish appear in a lake in Mudanjiang, China . Link \\n22nd April 2014 – 1,000 fish found dead in Oona River, County Tyrone, Northern Ireland . Link \\n21st April 2014 – Large amounts of fish washing up dead along the Panchganga River in India . Link \\n19th April 2014 – MILLIONS of dead fish found floating in Thondamanaru Lagoon, Sri Lanka . Link \\n\\nAnd remember, this list represents events that have happened in just a little over the past month. \\nSo what is causing all of these mass fish death events? \\nPlease feel free to share your opinion by posting a comment below… krinks \\nRev 6: The Fourth Seal: Death 7When the Lamb broke the fourth seal, I heard the voice of the fourth living creature saying, “Come.” 8I looked, and behold, an ashen horse; and he who sat on it had the name Death; and Hades was following with him. Authority was given to them over a fourth of the earth, to kill with sword and with famine and with pestilence and by the wild beasts of the earth. MichaelfromTheEconomicCollapse \\nInteresting parallel. Obviously we are not at that point yet, but without a doubt lots of death is coming in the future. \\nMichael Baby Monster \\nAny baby born in the future during the great tribulation, you should kill it. It will bring A curss it you look at it’s face. Thoes are going to be very evil children born then. People Monster \\nI hope the human race goes next. People are just to rude and evil. Gay Veteran \\nyes, you are a monster highpriestess \\nit’s already here The Fisherman \\nThe Gates of hell might be coming up out of the center of the earth. That might be killing all the fish.Gases are coming up out of hell and killing all the fish. Satan you stay the F in hell where you belong K \\nJust remember oxygen deprivation is what they always claim. When they either don’t know, or do not want you to know. Harry Paranockus \\nHow do turtles and dolphins fit into that scenario? K \\nThat is in the Gulf of Mexico. Still plenty of chemicals from the oil and corexit there. If the various small oil leaks were ever stopped. The gulf would still need a decade, before I would eat anything out of it. Sharon Equality-Now Johnson Mi \\nExactly! I have sworn off anything from the Gulf and because they’re such a large shrimp region, I stopped eating shrimp for the next 15 years. That BP oil spill and the Corexit chemicals they dumped, only destroyed sea life. There is sea life washing up on the shores with all kinds of tumors, never before seen. I’ll pass; growing my own food. K2 \\nIf they say pollution…will you agree with them? K \\nYes, as long as they explain how broad a term pollution can be. Chemical, viral, radioactive. K2 \\nAll those are already considered different kinds of……pollution. K2 \\nAnd what makes you think it might not be oxygen deprivation? Joshua Manevitz \\nIt says in the Talmud that before the Messiah comes that fish will be sought for the sick and none will be found ! The torah’s profound accuracy ! guesto3 \\nFish has been and still is the symbol for Christians….they too are being slaughtered all over the world….or threatened in places like the EU, Canada, and U.S.; places in general un-thought of for such in the past. M Gjerdrum \\nReally? Could you sound any more stupid! Gay Veteran \\nsorry, I only speak English jack nichols \\nDeath is fleeting let us reframe from sinning. Gay Vet is too gay to understand Virginia Lee \\nYou’re a complete idiot! Rodster \\nThe answer is under everyone nose. Does anyone recall all the floating debris floating in the ocean when they went looking for the missing plane? \\nIt turns out that debris was garbage. Gerald Celente has mentioned this for quite some time now that governments are using the ocean as their underwater garbage dumps. You have all kinds of garbage, probably tens of millions of tons of trash which no doubt includes toxins and chemicals dumped in the ocean floors. Sharon Equality-Now Johnson Mi \\nYes you are right, not to mention all the missing oil after the Gulf Oil spill. It didn’t just evaporate like some people want to suggest, which is of course impossible. \\nHow about fracking in the USA. That’s one reason. Off the coast of Somalia, developed countries have dumped chemical wastes off their coast, creating dead-zones. They’ve been begging us for years but they were considered throw away people. They couldn’t feed their families so they captures ships which entered the region; held them for ransom. Developed countries does this around the world. There was an investigation of the electronic wastes that are collected in the USA for recyclying. \\nThey’re then dumped in regions in China and off various African coasts. Now that it’s come home to affect us from our own fracking and nuclear wastes, we’re recognizing the problem. DJohn1 \\nOxygen deprived fish? Most of the world’s oxygen comes from plants in the oceans. If they are suddenly dying off, we are in big trouble. The entire supply for the planet is in jeopardy. The key here is balance between carbon dioxide and oxygen. If that goes south then all the life on this planet could go with it. Sharon Equality-Now Johnson Mi \\nHow about fracking in the USA. That’s one reason. Off the coast of Somalia, developed countries have dumped chemical wastes off their coast, creating dead-zones. They’ve been begging us for years but they were considered throw away people. They couldn’t feed their families so they captures ships which entered the region; held them for ransom. Developed countries does this around the world. There was an investigation of the electronic wastes that are collected in the USA for recyclying. \\nThey’re then dumped in regions in China and off various African coasts. Now that it’s come home to affect us from our own fracking and nuclear wastes, we’re recognizing the problem. We can’t blame anyone but corporations. FirstGarden \\nThe balance of the world’s ecosystems is very delicate. Altho I don’t always agree with the environmentalists, this is one area where I believe they’re correct. \\nI have a hard time believing any official reports regarding this underwater holocaust. In fact, there have been many similar reports of birds falling out of the sky, en masse. Probably not at the magnitude of fish, and other water-dwelling creatures. But this problem seems to have no serious precedence in history. Maybe some isolated cases, but nothing like this. (?) \\nOxygen depletion?? Ok, even if that were possible, what causes global oxygen depletion in our waters??? I don’t know about you, but things like nuclear radiation, or heavy chemical dumping comes to mind. Maybe even some secret spent rod-cooling down deep. Who knows. Sharon Equality-Now Johnson Mi \\nHow about fracking in the USA. That’s one reason. Off the coast of Somalia, developed countries have dumped chemical wastes off their coast, creating dead-zones. They’ve been begging us for years but they were considered throw away people. They couldn’t feed their families so they captures ships which entered the region; held them for ransom. Developed countries does this around the world. There was an investigation of the electronic wastes that are collected in the USA for recyclying. \\nThey’re then dumped in regions in China and off various African coasts. Now that it’s come home to affect us from our own fracking and nuclear wastes, we’re recognizing the problem. \\nOxygen depletion has been happening for awhile. It’s called dead zones when nothing lives in those certain areas; as a result of pollution. Fish die and so do marine plants. marty \\nThe world will shake us off like a bad case of fleas . Oldphartbsa \\nLessee…we’ve got Fukushima radiation washing through the Pacific, cycling around South America and the Horn. In the Gulf we’ve got hundreds of thousands of tons of corexit and a billion or so gallons of oil sludge and that’s cycling into the Atlantic. Pollution in India and China are so off the scale that we, here in America, would have to personally remember the 60’s to fathom (I was a kid in the 60’s and California Smog was what you see in China today). I don’t know why river systems would be affected other than the water flowing to the oceans is constantly picking up contaminants along the way. (In California it is unsafe to drink from any natural source of water.) Between Fukushima, Corexit and Oil sludge…I think we’ve hit the lotto for the spreading die off. K2 \\nIn many areas sewage from cities and industrial refuse is dumped into rivers. Not just in the states but in many countries. jaxon64 \\nI believe I can explain some of the river and bay die-offs from “lack of oxygen” Here in the Chesapeake region we are now seeing “dead zones” in the glorious Chesapeake Bay. The cause?.. ETHANOL… Increased demand for ethanol has caused many local farmers to turn away from traditional crops and convert to farming massive amounts of corn. The corn requires large amounts of nitrate additives to the soil. Nitrate run-offs into the rivers, creeks and tributaries have caused large amounts of algae bloom on the surface of the water–underneath, the natural, oxygen producing sea grasses that grow from the floor of the rivers and bay are dying for lack of sunlight. When the O2 producing seagrasses die off-EVERYTHING in the “dead zone” dies off–sort of like a permanent red tide zone. Crabs, fish, skates, oysters, mussles clams…all die in the dead area….these keep growing in the bay as more nitrates from corn growerss get run off into the tributaries. So there is the cause of the biggest problem in the Chesapeake Bay—our government regulations to increase ethanol levels is killing our Bay–one of the most beautiful and unique estuaries of abundant life on the planet.. chris \\nIt could be bacterial and spread by the wind. It could be many things but the question is what are the government officials with their well equipped microbiological and chemical labs saying it is? Are they not doing any research? Is it really just a case of scooping up the dead fish and not investigating why? jaxon64 \\nThe govt, of course, will blame it on man–then increase his taxes and increase their control and regulation. ( but never actually address the problem) ….OR– option #2–they will place a media ban on mentioning the die-offs and call anyone who is concerned a “conspiracy nut” right wing extremist” or “climate change denier” Sharon Equality-Now Johnson Mi \\nThe government and the EPA has been warning against this for decades. The greedy oil companies and the chemical fertilizer companies have been pushing back. Of course they have their chosen Republican politicians who they pay to block legislation; which would tighten up on the fracking chemicals forced into the ground in their tar sands quest. Reason \\nHow about radiation from Japan’s disaster. I think that alone could contaminate all the waters of the world. Let’s pressure our govs. to get rid of nuclear energy and learn to do without so many plug in gadgets!!! Adrian Johnson \\nToo late ! Nothing done now can undo contamination of the seas from Fukushima’s radiation. Cynical Guy 42 \\nI find it interesting how in the csmonitor article, one die-off is blamed on a heat wave, while the other is blamed on excessive snow. Question: Heat waves and heavy snow have happened for a very long time. Why are they suddenly causing die-offs? Jørn Andreassen \\n  plastic – manmade waste – is to blame. The plastic breaks down to microparticles and enter the gills of every fish in the ocean. Everyone who have thrown plastic in nature is to blame. (The same thing is happening to birds as well. Every bird you find dead will get plastic in their bellies.) RapidRay01 . \\nJust more signs of the end times. Come quickly Lord Jesus! U-Betcha \\nMinnesota? This is normal, especially in shallow lakes. They all recover quickly, and most often better. The die off of rough fish is beneficial to any lake. Don’t fall for this hype. jaxon64 \\nWow, you can refute 1 of the above items on a list of hundreds ( if you go to the full linked website)..and have the deep thought to correlate it as all just “hype”.. Unbelievable…and if you lived in a flood zone you’d probably have water up to your chin saying, ” this is the Mississippi shoreline, we’ve had floods like this before and the water always goes down–telling me to evacuate is a bunch of hype” People like you end up locked in the Superdome when a Hurrican Katrina hits … noname \\nU-Betcha should go eat some Japanese sushi. bmr22 \\nWell all of the other people here sure seem to get it. I get so tired of hearing about some die off or outbreak of disease or other man made disaster and the officials are all left scratching their heads. We dont know what may have caused this we are clueless. We have to study this for another five years before we have an explanation. Well unless you have been living under a rock for the past couple of decades or maybe a brainwashed tv addicted sheeple with no clue as to how nature works and what we have been doing to the earth and our ecosystem the answers is slapping everyone right upside their heads. We have polluted and raped the land we are killing off the bees, butterflies, birds, fish, frogs, and everything else. All of these things work and feed off of each other hence the ecoSYSTEM. You can’t just go around spraying weed killer and insecticide by the millions of tons and not have unexpected results. You can’t raise 100,000 pigs chickens or cows in filth and feed them all gmo corn and antibiotics and expect a good result and a healthy product. Best advice is for all of us who are awake is to grow whatever you can not just so that you can survive the shtf crisis but so that you can eat a healthy diet full of vitamins and natural minerals. The meat you eat can be raised well and healthy and have a good life before it feeds you. We have become way to detached from our food and nature in general turn off the tv go outside grow a garden raise some animals stop supporting the system that is killing us all. B.M. \\nDo you think it may have anything to do with the Chemtrails the DOD has been spraying over the air for 40+ years? Gay Veteran \\nwow, you mean that dumping millions of tons of pollution into the air, water and land actually leads to disaster? noname \\nDon’t be silly. They don’t know why the fish are dying, but it certainly has no connection to any pollutants or possible radiation in the water. “Not even a smidgen” of a connection. Gay Veteran \\nr ght M Gjerdrum \\nKeep your head in the sand as long as possible. Hide from the truth, that helps a lot. brads \\nI know this conversation is 9 months old but I would tend to agree. If we have been polluting for the last 60 years then wouldn’t you have records of mass die offs over the last 50 or so years?? why are ALL of these within the last year or so?? Pollution does not make sense! well, maybe the radiation in the water from Japan.. but if it was the pollution we would have evidence spanning decades and not just the last two years! Sharon Equality-Now Johnson Mi \\nHow about fracking in the USA. That’s one reason. Off the coast of Somalia, developed countries have dumped chemical wastes off their coast, creating dead-zones. They’ve been begging us for years but they were considered throw away people. They couldn’t feed their families so they captures ships which entered the region; held them for ransom. Developed countries does this around the world. There was an investigation of the electronic wastes that are collected in the USA for recyclying. \\nThey’re then dumped in regions in China and off various African coasts. Now that it’s come home to affect us from our own fracking and nuclear wastes, we’re recognizing the problem. Teri \\nYou nailed it! Crowline \\nGeologists said the earth ‘went bonkers’ in April this year with some very large earthquakes all over starting with Peru’s huge quake. Up until that point there was just the usual although in ‘diverse places’. Perhaps the fish have been shocked to death due to underground tremors, cracks etc being amplified through water. Jason7189 \\nGod said this would happen and it’s commonly believed by many Christians, this is a very end time Prophetic event. \\nHosea 4:3 “Therefore the land will mourn; And everyone who dwells there will waste away With the beasts of the field. And the birds of the air; Even the fish of the sea will be taken away.” \\nZephaniah 1:3 “I will consume man and beast; I will consume the birds of the heavens, The fish of the sea, And the stumbling blocks along with the wicked. I will cut off man from the face of the land,” Says the Lord.” \\nEzekiel 38:20 “So that the fish of the sea, the birds of the heavens, the beasts of the field, all creeping things that creep on the earth, and all men who are on the face of the earth shall shake at My presence. The mountains shall be thrown down, the steep places shall fall, and every wall shall fall to the ground.” Dan grizz \\nI like what many of you said. Especially what Jaxson64 has said about ethanol. Our corn crops for food is all being denied by that giant food company, I forgot the name…someone think of it…..oh, something Santo! liberals and their ethanol and yet the stupid republicans do nothing. I also wonder if this santo corp. is working with HARRP, and maybe sending electromagnetic pulses beaming off from space to hit parts of the ocean? They talk about how HARRP, controls weather. someone could be doing this but I believe what many of you said. mankind is out of control and is polluting oceans on all 4 corners. I think if the public really knew what was going on…where is greenpeace and other radical lib organizations crying about all the toxins we are dumping into the greatest creation of all time, our oceans? Where are they? you never hear any news network talk about this that goes on behind our noses. It’s terrible Sharon Equality-Now Johnson Mi \\nMonsanto has been making deadly chemicals for decades. in your mention of party politics, why do Republicans continue to block bills that reign in Monsanto? TheLulzWarrior \\nTest. Bergie \\nYes, oxygen deprived fish. Lakes in Minnesota freeze. Grand Lake MN is very shallow, and we had extremely thick ice this last winter. It does happen! Marco Saba \\nFukushima fall out. Brandon Bowers \\nRev 16:3 And the second angel poured out his vial upon the sea; and it became as the blood of a deadman: and every living soul died in the sea. Faith \\nProphecy,why cant humans stop sinning? stingray \\nhow old earth? maybe earth time Ashley Law \\nMethane – yes I also think methane clusters have been and are continuing to be disturbed. Reason – the massive energy release in March 2011. If you understand what happened and in what order it fits together. It is the reason Germany shut down all of it’s nuclear plants. If interested there is a video in Finnish (English subtitles) that explains much. Claudia \\nWhat is with HAARP and the Chemtrails? May be a answer … Mike Lutterschmidt \\nFor the last 10 years, there has been numerous signs of drastic changes to our planet. The wide spread of die off occurrences correlates to the short period of time and shines a light on the dark secrets of our corporations and governing bodies. If you really want to know how bad it is, look up “Peek Oil” and see how close we are to serious global changing disasters. There is an evil that has literally consumed our planet. Our government knows that effects of there actions. They pay billions of dollars for the research, however, if it effects the goal of profit, that research is swept under the rug by corrupt politics. Remember the last oil spill? There are regulations to put shut off valves on the pipes for each segment of specified distance to avoid these problems. Just like the code states for residential plumbing. But it would have cost too much and took too much time. So evil took over and we raped our planet. Other significant signs would be the number of natural disasters tripled compared to the previous 10 years. There are 12 times more tornadoes occurring now compared to the last decade. UV rays from the sun have become 25% stronger and there is 20% more acidity in our rainfall. 25 years ago we had over 500 major meat suppliers for distribution. Today, we have three which means we are at the mercy of the governing body to fight off corruption and evil. Yet the number of autistic children has tripled. McDonald’s meat has 40% meat and the rest filler. You think you are buying better meat at the grocery store, but it’s still coming from the same distributor with the same practices. Is it odd that in the last 5th. years the northeast has experienced a dramatic and alarming increase of allergens. This is due to changes in our climate that are just not natural. The world has fallen to gluttony and greed. Think about it, you would like to do something to help stop the destruction and leave our children with a righteous coarse, but you can’t do anything because you have to go to work. You need to make that ridiculous car payment because its just too important for you not to have a nicer car than the neighbors. Oh yea, and you don’t have time because you have fantasy football leagues, and Country Clubs to attend. So you turn your back and worry about you and your life. And our government knows it. You think debt is a choice? It is a control tactic to keep you in line like a sheep because gluttony has been ingrained in our souls and no one is willing to sacrifice their time to take control of our world. If just 50 % of our population protested and did not buy gas until the price was lowered to 2.00, we would let serious results. But you can’t do that, you have to drive the fancy car to the vacation house. It’s time we stood up and said enough. It’s time we form a mob with like purpose and use the power to stop this corrupt destruction of our world. If we organize and pull together as a force, we could stop the dumping in our water, we could stop the additives that are put in our children’s food, we can clean the pharmaceuticals out of our drinking water, and we could perhaps salvage our planet for human kind. Enough is enough, it hasto start now. ThomasW \\nThis has been happening as long as there have been fish in water… causes are localised and cannot possibly be connected. This artical is silly, its like saying “there were 100 car accidents world wide today, they were all connected but I don’t know why” Dan \\nThey are a criminal assault on the living. Alive4Jesus \\nFor fish to die in rivers, lakes, and oceans all over the world in such massive quantities over such a brief time, I suspect it has something to do with new technology—perhaps some type of radio frequency transmission to/from a satellite(s), EMF waves, or a new/different type of chemtrail ingredient. joanr \\nNew global threat- a third of the fish will die! Gardeners have long been aware that if you water a pot plant with a small amount of green washing up liquid, then the molecules in the washing up liquid bind together to form a seal which excludes the air and keeps the plant hydrated for a longer period, used by those going on holiday. People have been using green washing up liquid for decades, it has been washing down drains and rivers into the ocean. I wrote to the chairman of one of the leading manufacturers of cleaning products with this information some time ago. Are these sudden deaths among the fish stocks anything to do with this I ask? Rauh \\nOur solar system has moved below the galactic equator after 2012, things are beginning to happen that we don’t know about. Fukushima is spewing radiation into the Pacific Ocean too, nothing can be done about it. Weather changes all over the world like we’ve never experienced before. It’s a matter of time. M Gjerdrum'"}, "time": 1742562986.5968347}