{"duration": 0.12133312225341797, "input_args": {"text": "'MADRID  —   Europe is facing a migration crisis, the threat of Islamic terrorism and the prospect that Britain will exit the European Union. But the big foreign policy issue before Spain’s national elections next Sunday? Venezuela, of course. Candidates have visited Caracas, the capital of Venezuela, to grandstand. Spain’s governing conservative party has met in Madrid with opponents of Venezuela’s leftist government. There have been charges of a virtual Venezuelan infiltration of Spain’s politics. The shadow cast by Venezuela has been so long that its president, Nicolás Maduro, recently invited Spain’s politicians to hold their election debate in Caracas “so that I can also participate, and perhaps I will win the elections in Spain. ” It may seem a little odd, given the host of problems facing Spain. But the reason is simple. After six months of political deadlock and inconclusive elections in December, the only sign of change before Spain’s election redo is the growing strength of Podemos, the   party whose leaders once served as advisers to the former government of Hugo Chávez in Venezuela. The stronger Podemos looks, the more its opponents try to link the party to Venezuela, where the economy is collapsing and Mr. Maduro’s increasingly authoritarian government has declared a state of emergency. The message is meant to be scary and clear: Venezuela is a mess, and it can happen here. “One of the four parties that is competing in the campaign in Spain was hosted and formed in Venezuela, so if they want to bring that model here, they have to explain why,” Albert Rivera, the leader of Ciudadanos, an emerging   party, told a group of foreign correspondents this month, shortly after returning from Venezuela. “It is Podemos which brought Venezuela to Spain, not us. ” The leader of Podemos, Pablo Iglesias, fired back in a televised debate that his opponents were ignoring the issues that could really affect Spain, starting with a possible British exit from the European Union. Podemos had its first electoral success in May 2014, when it won 8 percent of the votes in European Parliament elections. In its early days, Podemos looked to Syriza, the Greek party that came to power in early 2015, as an example of how a new and   party could overhaul the political establishment. Podemos may be poised to do just that. After recently forming an alliance with a radical party, United Left, it could now leapfrog over the Socialists into second place, behind the conservative Popular Party of the caretaker prime minister, Mariano Rajoy, according to recent opinion polls. Such an outcome would overturn the   political order that has prevailed since Spain’s return to democracy in the late 1970s. Given the troubles in Greece, which is negotiating yet another international bailout, opponents of Podemos have made much of the connection to Syriza. But it is the link to the former Chávez government that has been a special focus. A handful of Podemos leaders  —   including Mr. Iglesias, Juan Carlos Monedero and Iñigo Errejón  —   once used their academic credentials as political scientists to work as advisers to the government of Mr. Chávez, who died in 2013. They also did advisory work in Bolivia and Ecuador, while studying how   politics could reshape Latin American nations. Opponents of Podemos have attacked the party over its finances and possible links to foreign governments, particularly Venezuela. Such accusations have been rejected by Podemos, which has instead built part of its campaign on denouncing the corruption of established parties financed by construction kickbacks. Before Podemos entered the Spanish political scene, Mr. Iglesias and Mr. Errejón sat on the board of a Spanish research institute financed by the Venezuelan government. In April 2015, Mr. Monedero resigned from the leadership of Podemos amid ideological differences, but also after he had to pay 200, 000 euros (about $227, 000 under the current exchange rate) in back taxes and fines for receiving €425, 000 as payment for consulting with the Chávez government in 2010 to develop plans for a new regional currency. Mr. Monedero and other Podemos leaders were never charged with wrongdoing. However, during the recent televised debate, Mr. Rivera, the leader of Ciudadanos, repeated previous allegations that Podemos had relied on Venezuela’s money. “It is immoral that a foreign regime finances a party,” Mr. Rivera said. A visibly angry Mr. Iglesias responded that it was a “very serious” offense to accuse his party of illegal financing, particularly since it was an issue that had been already cleared by Spain’s Supreme Court. Mr. Rivera has recently issued the strongest statements over Venezuela during the Spanish election campaign, taking over from Mr. Rajoy, who last month convened his security council to review the safety of the 200, 000 Spaniards living under the state of emergency in Venezuela. With the help of Spain’s conservative establishment, the Venezuelan opposition has also made its presence felt in Spain, led by Lilian Tintori, the wife of Leopoldo López, a Venezuelan politician who was jailed in February 2014. This month, Ms. Tintori, a former television presenter, gave public speeches in Salamanca and Madrid, hosted by the Popular Party as well as a conservative newspaper, La Razón. “Two years and three months ago, we came to Spain and other countries and nobody paid attention to us,” she said before an audience that included three ministers from Mr. Rajoy’s government, as well as Mr. Rivera. Even as Podemos has distanced itself from Venezuela, it has not joined other parties in condemning Mr. Maduro’s policies. This month, the European Parliament approved a resolution demanding the release of Mr. López and other political prisoners in Venezuela. The lawmakers of Podemos abstained, while those of its ally, the United Left party, voted against the resolution, arguing that it was designed to further destabilize Venezuela. Podemos is making “economic proposals clearly similar to those of Venezuela,” Francisco de la Torre Díaz, an economic adviser to Ciudadanos, said. Among those proposals, he said, is “the idea that it would be worth getting out of the euro. ” He also mentioned that Podemos advocates a “massive increase in public spending,” as well as a plan to nationalize some strategic corporations. Mr. Iglesias has denied having any plan to drop the euro, dismissing warnings by Mr. Rivera and others as fallacious scaremongering. Podemos has gradually watered down its demands for an economic overhaul. Its latest party program seeks an increase in public spending of €60 billion, less than its previous proposal of €96 billion. Despite this, some conservative associations have recently been formed to help prevent Podemos from turning Spain into the next Venezuela. “We want to denounce the situation in Venezuela and warn about what could happen in Spain,” said Andrés Redondo, the president of an association called Let Us Save Democracy, which was formed in Madrid last year. “We want Venezuelans to share their experience with Spaniards,” he said, “so as to make voters here, particularly the young, wake up and realize that all the terrible things happening there are now happening here. ”'"}, "time": 1742564137.1100342}