{"duration": 0.11022734642028809, "input_args": {"text": "'Esteban Santiago Ruiz, the gunman who killed five and injured six in Fort Lauderdale Airport last week, had previously booked a flight to New York on December 31, but he canceled the flight and flew to Florida instead. [ABC News cites law enforcement authorities confirming that Santiago bought a ticket to New York City for New Year’s Eve. They do not have a clear reason why he decided to change his   trip, though they suspect that “the highly visible presence of NYPD officers throughout the city on New Year’s Eve could have been an effective deterrent. ” There is no evidence that Santiago went beyond buying the plane ticket, such as arranging for lodging. He did not appear to book lodging in Florida, either, though he has family in the area.  Older brother Bryan Santiago told the Orlando   that Esteban Santiago has a   in Naples, Florida, due west of Fort Lauderdale, and that the two had spoken shortly before the attack. “He called my older brother, and my brother told him ‘Come to Naples anytime you want. There is always a place for you to stay with me,’” Bryan Santiago said. The FBI has yet to confirm a motive for Santiago’s attack. On Saturday, the FBI special agent in charge of the investigation, George Piro, told reporters that they had not found any evidence that Santiago had been consuming jihadist content on social media. “We’re looking over all of his social media, things like that. It’s giving us a picture of the individual, but it’s way too early for us to rule out anything,” Piro said. Santiago had mentioned the Islamic State to authorities before the attack, however. In November, Santiago visited the FBI offices in Anchorage, Alaska, where he had been living, to declare that the U. S. government was forcing him to watch Islamic State videos and fight for the Islamic State. The FBI confiscated his registered firearm and, after a psychological evaluation, eventually returned it. Police have not confirmed whether this weapon was the one used in the attack. Aside from the Islamic State references to the FBI, few leads appear to indicate that Santiago was a radicalized terrorist. Alaska’s only mosque, the Islamic Community Center of Alaska, told the Miami Herald it has “no connection with this guy whatsoever,” and no witnesses have claimed Santiago ever attended the mosque or spoke of Islam to them. Bryan Santiago told the   Santiago has “never been a Muslim. He’s always been a Christian,” and that the keffiyeh scarf he is seen wearing in a photo circulating online was a “souvenir he bought in Iraq when he was serving in the military. ” Bryan Santiago did confirm that his brother had confided in him about his concerns regarding the CIA. “He started talking to me, you know, that he’s seeing   …     weird things, that he’s hearing voices, that the government is using him   …     that the CIA is sending him secret codes to his laptop, and that he don’t want to do that. ” Bryan Santiago said he told his brother to “go to the church or to psychologist or something. ” Santiago served nearly a decade in the U. S. armed forces, first in the Puerto Rico National Guard and then the Alaska National Guard. He was deployed to Iraq in 2010, reportedly diffusing improvised explosive devices, and two of his company were killed in that deployment. Multiple relatives have told various news outlets that his deployment to Iraq appeared to change him.   Michelle Quiñones told ABC News that Santiago sought help from the Department of Veterans Affairs following his return from Iraq in 2011. “We had let veterans know that he was having some mental problems, that he wasn’t feeling alright and they did nothing,” she asserted. Santiago is facing the death penalty for the mass murder he allegedly committed on Friday, and is currently being held on suicide watch. With no more than $10 in his bank accounts, Santiago cannot afford a lawyer, and the government has provided public legal counsel. His family hopes to save him from capital punishment given years of apparent mental illness. “We are struggling to prove that he had mental problems, that he communicated them and asked authorities for help, and due to that these criminal charges are not viable,” Brian Santiago told the   Primera Hora. The mayor of the Santiago family hometown of Peñuelas, Puerto Rico, Walter Torres Maldonado, has offered financial aid to the family should they seek to travel to Florida, as well as psychological counseling should they need it.'"}, "time": 1742563557.3917556}