{"duration": 0.16122865676879883, "input_args": {"text": "'BURBANK, Calif.  —   Behind the beige walls that enclose the Warner Bros. lot here, Kevin Tsujihara has been ruminating on perception versus reality  —   a classic Hollywood subject onscreen, but one that the studio is now experiencing in real life. Mr. Tsujihara, the Warner Bros. chief executive, is on track to deliver record operating profit this year, with film leading the way. Last week, Time Warner said his division  —   home to Batman, Clint Eastwood, Bugs Bunny, “The Middle” and TMZ. com  —   had income of $433 million, a 12 percent increase from a year earlier. Its corporate sibling HBO, by comparison, with $530 million in profit, grew 2 percent. Yet many people consider Warner Bros. a troubled operation, a notion that Mr. Tsujihara thinks is rooted in an underappreciation of the studio’s   businesses and the lingering effect of film pipeline problems that it has moved past. “Quietly, we’ve been having an amazing year,” he said. “The narrative, over all, has not reflected that. ” Warner Bros. sits in the long shadow of HBO, a darling of the news media and Wall Street. When ATT agreed to buy Time Warner for $85 billion last month, Warner Bros. was largely a footnote in the resulting analysis  —   even though the studio, among other things, has promising streaming services in the works involving Harry Potter and Batman that could be supercharged by the telecommunications company. So how does Mr. Tsujihara correct the narrative? The surest way is to deliver a smash hit, and Warner’s film division may be holding one in “Fantastic Beasts and Where to Find Them. ” Arriving in theaters on Nov. 18, the $180 million movie (not including an estimated $150 million in global marketing costs) expands J. K. Rowling’s Harry Potter universe. Ms. Rowling, who wrote the “Fantastic Beasts” screenplay, last month announced four sequels, news that elated fans. Reviews for “Fantastic Beasts” have not yet been published, but people (including this reporter) have been wowed in advance screenings. Set in New York in the 1920s and focused on the eccentric “magizoologist” Newt Scamander, the film could sell $70 million or more in tickets in its first three days in domestic theaters alone, according to analysts. More hits could follow. Over the next year, Warner Bros. will release “Wonder Woman,” “Kong: Skull Island,” “Justice League,” Christopher Nolan’s war epic “Dunkirk” and two animated Lego movies. Salted among those behemoths are   entries from Warner’s New Line Cinema unit, like “Annabelle 2,” a horror movie. When it comes to recasting Warner as the   giant he believes it is, Mr. Tsujihara also knows that the studio needs to do a better job of telling its own story. Warner executives tend to hunker behind those beige walls, which allows others in Hollywood  —   especially those who have left the studio under unhappy circumstances  —   to do the talking for them, at times contributing to bracingly negative news media coverage. This year, for instance, some reporters and bloggers took gleeful delight in beating up Warner over the poor critical response to “Batman v Superman: Dawn of Justice” and “Suicide Squad. ” Lost in the criticism, Mr. Tsujihara and other members of his executive team think, has been the films’ financial success: “Dawn of Justice” and “Suicide Squad” collected a combined $1. 6 billion worldwide. Add the box office success of “Sully” and several modestly budgeted, expertly marketed New Line films this year, including “Central Intelligence,” “Lights Out” and “The Conjuring 2,” and the studio is on pace to have one of its most profitable years ever. At a time when smaller rivals like Paramount Pictures and Sony Pictures Entertainment are struggling, Warner Bros. has been frustrated that its own financial success has not garnered more notice. “People overlook our consistency,” Mr. Tsujihara said. But what about those bad superhero reviews? Analysts worry that the impact of    movies like “Dawn of Justice” could be felt down the line, perhaps when consumers weigh whether “Justice League” is worth their money. Mr. Tsujihara said he was confident that management changes he has been making (putting a pair of executives, Geoff Johns and Jon Berg, in charge of superhero movies, for instance) will make for more satisfied fans. With any luck, even a critic or two could come around. “The thing that really makes me confident is that I’ve seen ‘Wonder Woman,’ and it’s great,” Mr. Tsujihara said. Anthony DiClemente, a media analyst with Nomura, recently raised his   financial estimates for Warner Bros. in anticipation of ticket sales for “Fantastic Beasts. ” But he noted that Time Warner “fielded exactly zero questions” from analysts on last week’s earnings call about its studio, with the attention going instead to the Turner cable networks and HBO. Warner Bros. would most likely contend that investors were not looking at its operation in full. While movies receive most of the attention, they actually make up a small part of Warner’s overall business. The studio produces nearly 80 television series, including “Westworld” for HBO and “The Big Bang Theory” for CBS. Warner has 10 shows airing this season that are based on DC Comics characters those shows alone generate more than $1 billion a year in revenue, according to Time Warner. Warner Bros. is also one of the world’s largest video game makers, cranking out titles that include Mortal Kombat and Lego Dimensions. While most of Warner’s rivals  —   Disney in particular  —   have struggled to develop a lasting gaming business, Warner Bros. Interactive Entertainment is now big enough to pick up the slack when sibling divisions underperform, as happened last year when Warner movies like “Pan” and “Jupiter Ascending” flopped. The studio is a growing digital force, forming a new division in June dedicated to managing investments in online networks like Machinima (dedicated to games) and Uninterrupted (pro athletes) while accelerating the rollout of   services dedicated to superheroes and, perhaps, Harry Potter. “Combining with ATT will allow us to go    with brands like DC even faster,” Mr. Tsujihara said. Finally, Mr. Tsujihara has moved to strengthen the studio’s toys and apparel division, hiring a former Disney executive, Pam Lifford, to remake Warner Bros. Consumer Products. All those “Fantastic Beasts” movies play a big part in Ms. Lifford’s efforts  —   a consistent content pipeline is crucial to retail buyers  —   as do revitalization plans around other Warner brands, including the Looney Tunes cartoons. Mr. Tsujihara says he sees consumer products as “a real growth engine. ” Will such efforts help Warner persuade outsiders to view it more holistically? It’s unclear. But at least Mr. Tsujihara’s boss has noticed. “Kevin has a great understanding of how fast consumer behavior is changing and how the company is changing to meet their expectations,” Jeffrey L. Bewkes, Time Warner’s chief executive, said in an email. “What’s really impressed me is how he’s breaking down silos and driving greater collaboration among the businesses, which is helping the company produce the right kinds of content, for the right platforms, at the right time. ”'"}, "time": 1742563080.1062763}