{"duration": 0.10163688659667969, "input_args": {"text": "'Ronald Gasser, who admitted to the police that he had shot and killed the former N. F. L. player Joe McKnight in Louisiana, was arrested on Monday and charged with manslaughter  —   four days after the authorities faced widespread criticism for initially freeing him. The death of Mr. McKnight, 28, a former player for the New York Jets, after what the authorities described as a “road rage” confrontation has captured wide attention amid a national debate about shootings and race. Mr. Gasser is white, and Mr. McKnight was black. Mr. Gasser was charged after investigators conducted more than 160 interviews and spoke to Mr. Gasser for more than 12 hours, Sheriff Newell Normand of Jefferson Parish said on Tuesday in an   news conference in which he defended the authorities’ actions. The sheriff, bristling over suggestions that officials had been   and had handled the case differently because of the race of the two men, read aloud obscene internet comments that had been directed at elected officials after Mr. Gasser’s release. He repeated two racial slurs for   an   slur and other crude language, and twice banged his fist on the lectern, chastising critics for what he said was a premature demand for justice. “For those who have criticized the men and women of this organization and the strategy decisions that we made relative to that: Tough. I don’t care,” he said. “Because what I know is I can put my head on the pillow every night, knowing that we’ve done the right thing for the right reasons. ” The sheriff also appeared to insinuate that the victim shared blame for the violent outcome, saying: “Two people engaged in bad behavior that day. Why? I don’t know, but they did. ” The sheriff said the charges against Mr. Gasser would be submitted to the district attorney. Mr. McKnight was shot three times at about 2:45 p. m. Thursday in Terrytown, La. about five miles southeast of New Orleans. Sheriff Normand said the confrontation began after both drivers were driving erratically, cutting each other off and zipping in front of each other, according to Mr. Gasser and witnesses. Mr. Gasser said he became irate and engaged in a “verbal altercation” with the football player. When they stopped next to each other at a red light, Mr. McKnight got out of his car and approached Mr. Gasser’s car window. Mr. Gasser then pulled out a handgun from between his seat and the console and shot Mr. McKnight, Sheriff Normand said. Mr. Gasser told the police he had feared Mr. McKnight, but witnesses disputed elements of his account, Sheriff Normand said. Sheriff Normand revealed that Mr. McKnight had a gun in his car, but that both the gun and the car belonged to his stepfather. There was no indication that Mr. McKnight had suggested during the confrontation that he had a weapon, Sheriff Normand said. Local N. A. A. C. P. leaders, former football teammates of Mr. McKnight and social media users expressed anger over officials’ decision to free Mr. Gasser initially without charging him. They said they believed he would not have been freed if he were black and that justice would be less swift because Mr. McKnight was black. “We think a black man was lynched yesterday,” Morris Reed, the president of the New Orleans branch of the N. A. A. C. P. said at a news conference on Friday. “We are demanding some answers. ” Moe Reed Jr. a lawyer, said of Mr. Gasser on Friday, “There is nothing that could’ve happened yesterday at 3 p. m. in broad daylight on a Louisiana highway, in front of many people passing back and forth in front of a gas station, that would make this man feel that he was in danger of losing his life. ” Sheriff Normand said that on Thursday night, investigators had only a statement from Mr. Gasser and no corroborating or contradictory statements from witnesses. A key witness did not come forward until Saturday, he said, and officials were still trying to find others. Charging Mr. Gasser Thursday would have compromised the ability to prosecute him. Mr. Gasser did not have a lawyer at the time, he said. “In this state, whether we like it or not, we have a very   ‘stand your ground’   justifiable homicide laws,” he said. “That creates for us an obligation to make sure that we get it right. ” Investigators have conducted crime scene   talked to more witnesses, located videos and interviewed Mr. Gasser again with the benefit of forensic evidence, Sheriff Normand said. “Justice has no time period,” he said. “Justice is not a sprint. It is a marathon. These investigations are marathons. ” Critics have pointed to a similar case from April, when Will Smith, a former defensive end for the New Orleans Saints who was black, was shot and killed after a vehicle collision. In that case, Cardell Hayes, who is black, was arrested at the scene and charged with   murder. He is currently on trial. The sheriff angrily pushed back at the suggestion that race was a factor in Mr. Gasser’s case. When a reporter asked if he understood the concerns of the black community, he cited statistics on “black on black murders” and said that people should not “make this out to be something that it is not. ” “If we’re just going to look statistically, your fear, what you’re trying to articulate right now, is misdirected,” he said. Mr. McKnight dominated high school football in River Ridge, La. a suburb of New Orleans. His speed and versatility at the University of Southern California impressed the New York Jets enough for the team to select him in the fourth round of the 2010 N. F. L. Draft. Mr. McKnight played three years for the Jets. He was released in 2013, playing two more N. F. L. games for the Kansas City Chiefs in 2014. In February, he signed with the Edmonton Eskimos of the Canadian Football League, and most recently played for the Saskatchewan Roughriders. Mr. McKnight had been in contact with the Minnesota Vikings about a possible N. F. L. comeback and was working at a mental health facility, Jonathan McKnight, his brother, told WGNO, a local TV station. His sister, Johanna McKnight, described him to WDSU as a “family man. ” “We knew our brother touched a lot of people,” she said. “We just want everyone to remember the good that my brother has done, and remember who he was. ” Mr. Gasser is the owner of a telecommunications firm and a real estate business, according to The New Orleans Advocate. In February 2006, he was charged with simple battery after a confrontation with another driver that began at the same intersection in Louisiana where Mr. McKnight was shot. A    man had called 911 to report that a man behind the wheel of a red pickup was driving unsafely. The man turned out to be Mr. Gasser, and a “verbal altercation” ensued. Mr. Gasser followed the man to a service station, where Mr. Gasser “confronted him and began to strike him with a closed fist several times,” the police said. The charge was later dismissed.'"}, "time": 1742564374.8953524}