{"duration": 0.06273961067199707, "input_args": {"text": "'Emmanuel Macron plans to use his first full day as president of France to fly to Berlin to lobby for greater Eurozone integration. Macron wants a common budget and a joint finance minister for all 19 states to have adopted the euro. [In a gesture which will be interpreted by many as a demonstration that Macron’s priorities lie with the European Union rather than France, the new president will meet with German Chancellor Angela Merkel in the hopes of persuading her that greater European integration is in both of their countries’ interests.  “The truth is that we must collectively recognise that the euro is incomplete and cannot last without major reforms,” Macron said in a speech delivered in Berlin in January. He continued: “It has not provided Europe with full international sovereignty against the dollar on its rules. It has not provided Europe with a natural convergence between the different member states. ” Arguing that a dysfunctional euro and ongoing trade surpluses were to Germany’s benefit, Macron said that lack of trust between France and Germany was acting as a roadblock to reforms which would increase solidarity between the 19 eurozone states. “The euro is a weak deutsche mark,” Macron insisted. “The status quo is synonymous, in 10 years’ time, with the dismantling of the euro. ” Macron plans to tackle the problems with the euro, as he sees them, with major reforms at the European level. Amongst his planned reforms is the creation of a common eurozone budget managed by a joint finance minister, and the creation of a ‘two tier’ EU, with the Eurozone countries moving ahead of the other member states. If enacted, the reforms would constitute the biggest step so far toward integration of European states into one entity. Many of the new president’s proposals are still nothing more than vague outlines. But Sylvie Goulard, one of Macron’s foreign policy advisers, says Macron is deadly serious in his ambitions. A series of domestic economic reforms, including a €60 billion cut in public spending over five years, a pledge to keep the country’s deficit to under three per cent of GDP, and a cut in corporation tax from the current rate of 33. 33 per cent to 25 per cent seem to have been designed with Berlin, rather than the French people, in mind. Macron’s hope is that building economic credibility at home will help to persuade Germany to back him on the European stage. “France must carry out structural reforms: it’s good for us and will reassure our partners, and chiefly Germany,” he said in February. “If we don’t have a brave plan of structural reforms, the Germans won’t follow us. ” But he may have a more difficult time persuading the people of France to back him. Only two candidates in the first round of presidential voting  —   Macron and Republican candidate François Fillon  —   made a case for structural reforms during the election campaign. “The good news is that Macron and Fillon won 50% of the vote, but the bad news is that 50% of the French people still have no idea about what needs to be done, and that poses questions about what happens next,” French economist Charles Wyplosz said. “France has been in the slow lane for decades, losing political influence in Europe, largely because there have been these arrangements where everyone has these privileges that they have been skilled at protecting. Macron has to confront powerful forces that often by putting 2 million people on the streets have won every battle in the last decade. ” Macron will be officially sworn in as president on Sunday morning after walking up the red carpet to the Élysée Palace. Amongst his first acts as president will be naming his prime minister, being briefed on the nuclear deterrent by the outgoing Socialist leader François Hollande, and making his first speech. On Monday, he flies to Berlin to meet with Mrs. Merkel, who has welcomed his victory over Front National leader Marine Le Pen in last week’s election. Macron carries “the hopes of millions of French people and also many in Germany and across Europe,” Merkel said.'"}, "time": 1742564216.8263376}