{"duration": 0.14485907554626465, "input_args": {"text": "'LONDON  —   The European Union is accustomed to crises. But it is probably safe to say that none of the 28 leaders who are gathering in Malta on Friday expected the crisis that has overtaken the agenda: the United States of America. Like much of the world, the European Union is struggling to decipher a President Trump who seems every day to be picking a new fight with a new nation, whether friend or foe. Hopes among European leaders that Mr. Trump’s bombastic tone as a candidate would somehow smooth into a more temperate one as commander in chief are dissipating, replaced by a mounting sense of anxiety and puzzlement over how to proceed. If many foreign leaders expected a Trump administration to push to renegotiate trade deals, or take a tough line on immigration, few anticipated that he would become an equal opportunity offender. He has insulted or humiliated Mexico, Britain, Germany and Iraq engaged in a war of words with China and Iran and turned a routine phone call with the prime minister of Australia, a staunch ally, into a minor diplomatic crisis. With the possible exception of NATO, where he has softened his tone, Mr. Trump has expressed disdain for other multilateral institutions such as the European Union. His praise has been reserved for populists and strongmen, like Nigel Farage, the former leader of the U. K. Independence Party, President Rodrigo Duterte of the Philippines and, of course, President Vladimir V. Putin of Russia. Mr. Trump is convinced that the United States has been played for a patsy by the rest of the world and is vowing to set things straight. “We’re taken advantage of by every nation in the world virtually,” he said on Thursday at a prayer breakfast. “It’s not going to happen anymore. ” Against this forbidding backdrop, some European leaders are urging their counterparts to recognize that Mr. Trump may represent a truly dire challenge, one that threatens to upend not only the   European project of integration and security, but just about everything they stand for, including liberal democracy itself. A European official, Donald Tusk, created a stir this week when he wrote a letter to 27 leaders of the bloc’s 28 member states suggesting that the Trump administration presented a threat on a par with a newly assertive China, an aggressive Russia and “wars, terror and anarchy in the Middle East and Africa. ” Intentionally, he left out Britain, because it has voted to leave the bloc and its prime minister, Theresa May, has rushed with what some Europeans consider unseemly rapidity to the side of Mr. Trump, who has derided the European Union and praised Britain’s withdrawal, or “Brexit,” saying, “I don’t think it matters much for the United States. ” In his letter, Mr. Tusk, a former Polish prime minister who is the president of the European Council, made up of the national leaders, wrote of “worrying declarations” from the Trump team, adding: “Particularly the change in Washington puts the European Union in a difficult situation, with the new administration seeming to put into question the last 70 years of American foreign policy. ” Stefano Stefanini, a former Italian ambassador working in Brussels, said that Mr. Tusk “is prone to exaggeration” and that he had a specific Polish fear of Mr. Trump’s apparent coziness with Mr. Putin. But Mr. Tusk “has some justification,” Mr. Stefanini said, because he is also reacting to a complacent Brussels establishment “that he believes is shrugging off Brexit, Trump and   populism and believes it’s business as usual. ” Others say Mr. Tusk is adapting realistically to a series of new dangers posed by the new administration in Washington. Mr. Trump’s open protectionism, his contempt for the European Union and his ambivalence toward NATO are serious and damaging, which Mr. Tusk understands, said Mark Leonard, the director of the European Council on Foreign Relations. “Trump is the first American president since the E. U. was created not to be in favor of deeper European integration,” Mr. Leonard said. “Not only that, but he’s against it and sees the destruction of the European Union as in America’s interest. ” Worse, he said: “Europeans see Trump as the biggest threat to global order and the European ideal of how the world should be organized. The U. S. has been a crucial part of the ballast meant to be upholding the global order in the face of these other challenges Tusk mentions, from Russia and China to Islamic radicalism. ” “But rather than acting as a check on these forces, Trump seems to be amplifying them, and that’s pretty terrifying,” Mr. Leonard continued. “It’s like you suddenly discover that the medicine you’ve been taking is making you sicker than the illness itself. ” For his part, Mr. Trump described his confrontational diplomatic style as a necessity. “The world is in trouble, but we’re going to straighten it out, O. K.?” he said at the prayer breakfast on Thursday. “That’s what I do  —   I fix things. ” He added: “Believe me, when you hear about the tough phone calls I’m having, don’t worry about it. Just don’t worry about it. ” There have been other moments when Europeans judged American policies as harmful, including the Iraq war and the assaults on multilateralism early in the first term of President George W. Bush. “But Trump’s attacks are of a different scale and come when there’s a lot of indigenous turmoil anyway,” Mr. Leonard said. “He seems to be linking up with some of the scariest and darkest forces within European societies,” which all want the European Union to fail, he said. Mr. Trump’s views about Europe and his reluctance to commit to summit meetings with the European Union or even with NATO are deeply troubling for Europeans, said Leslie Vinjamuri, a professor of international relations at London’s School of Oriental and African Studies. “America’s strategy towards Europe has always been highly consequential, but up until now that strategy has been aimed at bolstering Europe,” she said. The United States has provided “that overarching protection and alliance that underpins the whole thing and makes it work,” she said. “But dealing with Russia and China is suddenly a whole different calculus if you don’t have America behind you. ” Then there is Germany and the euro. Traditionally, Europeans view Germany as the bulwark of the European Union, its largest, richest and most influential country, but uncomfortable with open leadership. Chancellor Angela Merkel of Germany, up for   this autumn, is viewed as practical, pragmatic and devoted to the European project, and Germans see the euro as a political sacrifice they made of the revered deutsche mark to please the French. So they deeply resent Mr. Trump’s attacks on Ms. Merkel for her refugee policy and his statements that the European Union itself is a “vehicle” for German  . Ms. Merkel was angry over comments by Peter Navarro, the director of Mr. Trump’s new National Trade Council, that Germany was manipulating a “grossly undervalued” euro to gain trade advantages over other Europeans and the United States. While Germany depends heavily on exports, annoying some of its neighbors, the value of the euro is the same for all that use it, and Ms. Merkel made clear that its value was up to the European Central Bank, not Berlin. But a protectionist America that opposes free trade is certainly unhelpful to Germany. Added to that are the comments by Ted Malloch, who has been advertising himself as Mr. Trump’s top choice to succeed Anthony L. Gardner as ambassador to the European Union. Mr. Malloch, a strong supporter of Britain leaving the bloc, has publicly said that Mr. Trump “doesn’t like an organization that is supranational, that is unelected, where the bureaucrats run amok, and is not frankly a proper democracy. ” Mr. Malloch has also referred to   Juncker, the European Commission president, as “a very adequate mayor of some city in Luxembourg,” predicted that the euro would collapse and compared the bloc to the Soviet Union. “I had in a previous career a diplomatic post where I helped bring down the Soviet Union,” he said on British television. “So maybe there’s another union that needs a little taming. ” Mr. Malloch may not get nominated, and if he does, the bloc may not accept his posting, Mr. Gardner said. Mr. Trump is “getting advice that is a caricature of the E. U. as a dysfunctional entity, not delivering and wholly inaccurate, despite all the challenges,” Mr. Gardner said, citing joint   efforts in counterterrorism, trade, sanctions, security, digital privacy and policing. “Even Mrs. May has said Britain sees a cohesive E. U. in British interests. She doesn’t want to see a disintegrating E. U. on its doorstep and nor do we. Hopefully that will be heard by others in the administration. ” Mr. Tusk, he said, has a point, trying to dissuade other European Union nations, like Hungary and Poland, from rushing to Washington to try to make separate deals, which would be illegal, with the Trump administration. China and Russia, too, have always tried to ignore the European Union and deal bilaterally with member states, something Mr. Trump seems to be encouraging. The French, who are being tough on a British withdrawal and are deeply disconcerted by Mr. Trump, see him as a bigger threat to European cohesion, said Charles Grant, director of the Center for European Reform. “They see the three great world powers  —   Russia, China and now the U. S.  —   wanting to destroy the E. U.,” he said. One impact of Mr. Trump that Mr. Tusk is clearly hoping for, Mr. Grant said, is “to reinforce a feeling of solidarity among mainstream European politicians. ” Another result, said François Heisbourg, a senior adviser with the French Foundation for Strategic Research, may be a more serious European effort at forming its own defense capacity, which may not be in the interests of NATO or the United States. The American commitment to NATO and the European Union has been unconditional since their creation, Mr. Heisbourg said. “But Trump sees alliances as transactional, and once you state that, countries like Poland, Hungary and Japan start to hedge their bets. ” But Mr. Heisbourg also notes the impact of Mr. Trump’s dark view of the world as a helpless America being taken to the cleaners by its allies. “In the Trump world there are no sunny uplands, just darkness and hatred,” he said. “And in a continent that has had its share of hatred, this resonates. ”'"}, "time": 1742562994.416444}