{"duration": 0.0856328010559082, "input_args": {"text": "'Country: China The political situation in Hong Kong (more precisely in the Hong Kong Special Administrative Region of the People’s Republic of China) has once again fallen under the influence of another “ autumn escalation “. One of the most large-scale protests was a mass rally of thousands of students in September-October 2014, which was coined the Umbrella Movement by the Western media. It’s almost a year later and new riots, albeit significantly less serious ones, have taken place. As in 2014-2015, the nature of this stage of political turbulence in Hong Kong is the same. In general, it can be described with the slogan “the price you have to pay for the transition period”. This concerns the difficulties of actual implementing the beautiful concept “One Country – Two Systems” created by Beijing when preparing to regain control over Hong Kong from Great Britain in 1997. Later, this concept was tested out for the possible (hypothetical and elusive) return of the lost province of Taiwan to the bosom of the Motherland. The procedure of transferring Hong Kong to the People’s Republic of China was provided for by the Sino-British Joint Declaration signed in 1984 during a visit of the then Prime Minister Margaret Thatcher to China. The strained relations between Beijing and Hong Kong are entirely based on events that preceded the handover. It’s important to remember that in the mid-19th century, Hong Kong was under the control of Great Britain following the so-called Opium Wars (which can be considered a “crime against humanity” by today’s standards). The following 150 years, Hong Kong formed a community of citizens that were very different from the citizens in modern-day China both in terms of mentality and living standards. Today, the latter is perhaps the major factor, which determines the mood of Hong Kong’s population. However, the Western media describe the wariness of Hong Kong citizens in respect of the gradual integration into China as a mantra on “the strive for democracy and freedom”. However, the same “fraudsters” that appeared during the decline of the USSR, then in the Middle East, and now in Ukraine, are manipulating the situation with fake ideas of “democracy” and “freedom”. There was no democracy in British Hong Kong. It only started to appear after the accession to the People’s Republic of China. According to many Hong Kong citizens, this is not enough as it currently does not allow it to maintain distance from China. But this is another issue that is indirectly linked to the phenomenon of democracy as a specific social and political structure of the society. In terms of Hong Kong, it functions in compliance with the Basic Law of the Hong Kong developed in China in 1990, which came into effect in 1997, i.e. the moment Hong Kong was transferred to the Beijing’s control. Article 104 of this document requires all the representatives of the authorities pledge allegiance to the Basic Law and to Hong Kong Special Administrative Region when assuming office. The same allegiance must be pledged by the Chief Executive, whose powers can be compared to those of the head of the fiercely Presidential Republic. Article 104 is aimed at ensuring China’s control over the entire system of political and administrative management of Hong Kong, including its key structure. Nonetheless, the authors of the Basic Law neglected one very important element. They did not foresee the answer to the question of what would happen to those who distort the letter and intent of Article 104 when assuming office. This question arose on October 12, 2016, when several newly elected deputies of the local Legislative Council (Parliament) took the liberty of not only distorting the content of this Article but also shouting out words and provocative slogans about Beijing during their swearing-in ceremony. Moreover, they unfurled the banner “Hong Kong is not China”. A few days later, during a repeat of the swearing-in ceremony, “pro-independence” deputies left the session hall depriving the Legislative Council of the necessary quorum. On this, the Global Times published an editorial entitled “Defiant Hong Kong legislators must be barred “. It seems that on November 7, this question was answered. This concerns the “interpretation” of Article 104 that was employed that day at the regular session of the Standing Committee of the National People’s Congress (China’s Parliament), which assumes the status of the very same law as the Basic Law of the Hong Kong Special Administrative Region itself. In other words, from now on, violators of Article 104 are subject to the full extent of the law. The reaction on the “streets” of Hong Kong to Beijing’s message proved to be immediate and upon the signing of the Article, events similar to the Umbrella Movement of Autumn 2014 broke out. It is worthwhile pointing out some important issues: – the outlined process of (this certain) “crackdown” on Hong Kong fits into the overall trend of the strengthening role of the Communist Party of China and its leader Xi Jinping in China’s life, which was the main outcome of the 6th Plenum of the 18th Congress of China’s leading party; – the strong statements made by the USA and the EU on the violation of human rights in Hong Kong will hardly affect the degree of the aforementioned crackdown. For example, after producing its latest report on the situation in Hong Kong, Great Britain was strongly advised to refrain from interfering ; – the anticipated “moderate nature” of the policy of tightening control over the social and political life in Hong Kong will be determined by the need to maintain at least something of Taiwan’s positive appraisal of the “One Country – Two Systems” concept. The fact that the resolution of the Taiwanese problem remains a priority task for China’s leadership is confirmed by the deliberate attention on Hung Hsiu-chu who visited Beijing in late October 2016 . She took the charge of Kuomintang after the crushing defeats in the last two general elections in Taiwan ; – it is likely that the current Chief Executive, Leung Chun-ying, will resign as a result of the above-mentioned events as well as others that have taken place in Hong Kong. He has always been pro-Beijing, and according to experts, he is close to a group inside the Communist Party leadership, which is competing with Xi Jinping. Hong Kong can currently be compared with a chicken that Beijing would have wrung the neck of a long time ago (despite any agreements with London) unless it continued laying financial “golden eggs”. In addition, ill-considered harsh measures in respect of Hong Kong may prevent the resolution of China’s key Taiwanese problem. Therefore, Beijing has to exercise patience and carefully plan its steps in respect of the former British colony. Vladimir Terekhov, expert on the issues of the Asia-Pacific region, exclusively for the online magazine “ New Eastern Outlook ” \\n'"}, "time": 1742563209.3728087}