{"duration": 0.027743816375732422, "input_args": {"text": "'The   man in American politics and one of the political mentors of President Donald Trump told Breitbart News Monday the president needs to stay focused on his program in his first address to a joint session of Congress. [“He needs to stick to the agenda,” said Roger Stone, who was one of the first advisers to join Trump’s campaign and remains one of his closest confidantes.  “Avoid    with his critics  —   just stick to the agenda  —   and make at least one good reference to fake news,” Stone said. Less than two months in, Stone said he is impressed by Trump’s performance in the White House. “I think he is doing great. ” Stone spoke to Breitbart News at a   book signing for his latest work: The Making of the President 2016: How Donald Trump Orchestrated a Revolution at Washington’s   Hotel. The diverse crowd of   men of influence, conservative operatives, and Capitol Hill staffers was a pretty strong signal that it is very important in Washington that Stone knows you bought his book. The event was organized by David Urban, the man who led Trump’s campaign in Pennsylvania. “Roger’s always been on the cutting edge,” Urban said. “He is always the guy you want on your team and I think the president was glad to have him on the team this year. ” Standing under a portrait of Lincoln’s trusted aide and biographer John Hay, Stone told the crowd that one of the insights in his book about the 2016 campaign is its similarity to the 1948 race between Republican New York Gov. Thomas Dewey and President Harry Truman. “The more I thought about it, Hillary Clinton is really Tom Dewey without the mustache: Cold, aloof, overconfident,” he said. “While Trump is barnstorming Democratic strongholds in Michigan and Wisconsin and Western Pennsylvania  —   Hillary’s in Chappaqua in her pajamas looking at the swatches to pick out fabric for her Oval Office curtains,” he said. Like Truman, Trump is a closer, he said. “Donald Trump is the greatest closer in American politics,” he said. “It was really a Herculean, superhuman effort. He drove himself  —   largely without sleep  —   on the basis of good data that said we could expand the map, we could win Michigan, we could win Wisconsin, we could win Pennsylvania and thus elect a man that I believe is destined to be one of our greatest presidents. ” Stone, who was a White House aide to President Richard Nixon and later introduced Nixon to Trump, told Breitbart News: “Both Nixon and Trump have obvious advantages and nobody is perfect, everyone has a flaw, but in terms of his intelligence, in terms of his speaking out for people who have been forgotten within our system, in terms of his executive ability, and in terms of his toughness and his pragmatism  —   n all those ways he is like Nixon. ” Like Nixon, Trump is going to figure how to deal with the Washington and Republican establishments. “I did look at a White House staff list yesterday and I had to stop myself  —   I actually recognized a name,” he said. “His greatest danger is not from the liberal Democrats. It’s from establishment Republicans, who like the status quo and might seek to undermine his program  —   unless of course, they determine that their program is so popular that they better get on board quick and claim they were for it the whole time. ”'"}, "time": 1742628443.3559234}