{"duration": 0.10091233253479004, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Donald Trump’s campaign has been buoyed by a torrent of small donations over the past month that nearly evened the financial playing field with Mrs. Clinton. His war chest now boasts $74 million in cash. Still, the Republicans’ disarray was on display as Mike Pence, the   nominee, endorsed Speaker Paul Ryan’s   bid a day after Mr. Trump declined to. _____ 2. Mr. Trump’s rallies often stir strong emotions, but one aspect sets them apart from other political gatherings: the frequency with which his supporters use coarse and violent language. The video sampling above captures a range of the vulgarities and racial and ethnic slurs that have sometimes characterized Trump events. _____ 3. The hacks that infiltrated computer systems on the Democratic side have made “election cybersecurity” a new focus for the Department of Homeland Security. Intelligence agencies have told the White House they have a high degree of confidence that Russia was behind the breaches. Above, Hillary Clinton campaigned in Colorado. _____ 4. From a prison in Germany, a former ISIS member gave our reporter a detailed account of his rapid disillusionment with the group in Syria and his escape from its clutches. (Watch the video, above.) His experience, including being urged by masked men to return to Germany to spearhead attacks there, adds insight into how a unit of the Islamic State, called the Emni, exports terror abroad. For Americans, he said, the unit prefers to recruit over the internet: “They say we can radicalize them easily, and if they have no prior record, they can buy guns. ” _____ 5. India overhauled its tangled tax code, a major victory for Prime Minister Narendra Modi that economists say should significantly boost the country’s growth rate. “This is hugely consequential for the ease of doing business,” an analyst said, “and for demonstrating to the outside world that India is dragging its economy into the 21st century. ” _____ 6. A study of two insular farming communities in the U. S.  —   the Amish of Indiana and the Hutterites of North Dakota  —   strongly suggests exposure to microbes from farm animals can lower asthma and allergy rates. The results were so compelling that a discussion is already underway on developing a microbial spray that could prompt many more children to develop immune systems that can sidestep asthma. _____ 7. Barbra Streisand, 74, may be reclusive, but she’s not idle. The megastar is about to issue a   new album (“Encore: Movie Partners Sing Broadway”) embarking on a   concert tour (“The Music   …     the Mem’ries   …     the Magic! ”) and writing a memoir. Her perfectionist tendencies were in evidence on matters great and small during an interview at her Malibu estate. She said she was dismayed when she heard a fellow singer in conversation with an interviewer, and “They both called me Barbra ” not  . _____ 8. A Florida   called Moon Express won F. A. A. permission to try to land a spacecraft on the moon. Doing so would earn it $20 million Google Lunar X Prize, as the first such private effort. But the Moon Express chairman said the stakes were much higher. “Everything we fight over  —   whether it’s land or it’s fresh water, whether it is energy  —   is in abundance in space,” he said. _____ 9. The value of the digital currency Bitcoin plunged after one of the world’s largest Bitcoin exchanges said it had been hacked. An official with the exchange, Bitfinex in Hong Kong, said that 119, 756 Bitcoins  —   worth tens of millions of dollars  —   had been stolen. _____ 10. Brazil is welcoming a flood of athletes and spectators to the Rio Games amid a   epidemic of the Zika virus. This is the best mosquito repellent in the country. But it’s not the best money can buy  —   because it’s not on the shelves. A military lab makes it for the exclusive use of the Brazilian Army. There is no “plan for external commercialization,” a military statement said. _____ 11. Finally, Happy 90th birthday, Tony Bennett. Thousands of Starbucks outlets played his albums, stars like Willie Nelson and Oprah Winfrey saluted him, and Lady Gaga ceremonially lights the Empire State Building in his honor at 8:30 p. m. Eastern. “It feels great to be 90!” he wrote on Twitter. “Thanks for all the birthday wishes. I’m just getting started. ” _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742563960.1415296}