{"duration": 1.2283329963684082, "input_args": {"text": "'Videos Off-Duty Black Cop Profiled And Beaten By White Officer I went to the ground I kept saying, ‘I’m the police, I’m the police.’ There were two other officers there. I felt their presence and they placed me in handcuffs, and then somebody hit me in the right side of my face.” Be Sociable, Share! Washington D.C. police officer Robert Parker. \\nAn off duty D.C. police officer says he was brutalized by a Prince George’s County police officer who profiled him as a suspect after a shooting at Iverson Mall on Tuesday. \\nA few minutes after a man was shot and wounded at the mall, Prince George’s County police descended on the Temple Hills neighborhood looking for a suspect who was only described as a black male wearing a hoodie and blue jeans, according to Paul Wagner of Fox 5 . \\nRobert Parker, an off-duty D.C. police officer who was also dressed in a hoodie and blue jeans, was walking away from the mall down Iverson Street. That’s when he says a black Prince George’s County officer pulled up alongside him in a police cruiser. \\nObeying what he was told by the officer didn’t do Parker any good. Even though he obeyed, he was still thrown to the floor and punched in the head. “And I can’t remember if I said okay or was just kind of baffled at the moment, and he walked up to me and he started patting me down and I’m just thinking, is this really happening? Because I know the protocol because I’m a police officer,” Parker said. “He reaches around and feels my sidearm, my firearm and I look at him and I see the look in his eye and I say, ‘I’m the police.’ I’m literally slammed. I went to the ground I kept saying, ‘I’m the police, I’m the police.’ There were two other officers there. I felt their presence and they placed me in handcuffs, and then somebody hit me in the right side of my face.” \\nParker says he wasn’t resisting and felt the take down and punch were totally unwarranted. He says he hates to pull the race card, but believes had he been white, the take down and what he views as excessive force would not have happened. \\nParker injured his wrist when he was assaulted and went for treatment at the police and fire clinic as well as a hospital emergency room. \\nPrince George’s County police are defending their officer that assaulted an innocent man. They say he’s a 20-year veteran with a lot of experience, and is a supervisor in that section of the county. They also issued a lengthy statement which reads: “Based on our preliminary investigation and preliminary review of an audio recording of the encounter in question, we believe our officer acted professionally and with restraint. This encounter took place within several minutes of the shooting being reported at the mall and approximately three blocks from the scene. Our officer who was responding to the shooting, which had just prompted the lock-down of two nearby schools – spotted a man walking who matched the description. Our officer, a sergeant assigned to our district 4 station, got out of his cruiser and began an investigatory stop. During a pat down, our officer discovered the man had a gun on his waistband. At that point, our officer took the man to the ground during a brief struggle. Our preliminary investigation reveals that it was only after the man was restrained by the original officer and backup officers did he identify himself as a police officer.” \\nEven off duty officers are not immune to police brutality. Parker had a right to carry a concealed firearm and Maryland allows concealed carry of firearms, so even if he did not identify himself as an officer, there is still no reason to believe he was breaking any laws and still no reason to treat him the way they did. Will these officers be held accountable for assaulting an innocent man? \\nWatch the video below…'"}, "time": 1742562488.2690873}