{"duration": 0.08785748481750488, "input_args": {"text": "'Hungry Venezuelans Try To “Put Maduro On Trial” After Recall Referendum Fails Posted on   Finance News » Hungry Venezuelans Try To “Put Maduro On Trial” After Recall Referendum Fails \\nWhile Maduro and his loyalistas can stave off opposition for now, it only makes the inevitable more potent. \\n\\nFrom Mac Slavo, SHTFPlan: \\nHe won’t go easily. That seems certain enough. \\nThere may be pressure, quietly, from the United States, but that doesn’t change the fact that the Venezuelan people are eager to be rid of their dictatorial leader and return to some sort of functioning normalcy. \\nWhen everyone is hungry, there is no quiet. \\nIn the latest turn of events, President Maduro’s government squashed a referendum in the National Assembly to recall him from office… but now his opponents are attempting to put him on trial. \\nThe measure itself has no chance of passing, but the symbolic gesture is telling enough f or a country that’s increasingly desperate and uneasy. For the past couple of years, pressure from dropping oil prices has exacerbated a weak and failing socialist system – making distribution, infrastructure, electric power and other necessities impossible to maintain. \\nvia Reuters : Venezuela’s opposition-led National Assembly in a rowdy session on Sunday pressed to put Nicolas Maduro on trial for violating democracy, days after authorities nixed a recall referendum against the unpopular leftist president. The measure is unlikely to get traction as the government and the Supreme Court have systematically undermined the legislature on grounds it is illegitimate until it removes three lawmakers accused of vote-buying. But it marked a further escalation of political tensions in the crisis-hit OPEC nation. “It is a political and legal trial against President Nicolas Maduro to see what responsibility he has… The session was briefly interrupted when around 100 apparently pro-government protesters stormed in, brandishing Socialist Party signs and shouting “The Assembly will fall!” before officials herded them out. […] “The Socialist Party is showing what it has left. There are no ideas or arguments, only violence!” said opposition leader and two-time presidential candidate Henrique Capriles. \\n[…] \\n…opposition congressmen chanted “The people are hungry and want a recall!” \\nWhile Maduro and his loyalistas can stave off opposition for now, it only makes the inevitable more potent. \\nAs JFK observed: “ Those who make peaceful revolution impossible will make violent revolution inevitable.” \\nThis appears truer than ever in Venezuela. There is every sense that total chaos is coming . \\nVenezuela has since devolved into a nightmare, prompting many of its people – perhaps regardless of politics – to support his ouster. Maduro has argued that the U.S. is waging economic war against him, and there is truth in the fact that pro-U.S. factions are eager to remove him. Nonetheless, it’s not an argument to allow him to continue wielding power. \\nAlready, Venezuela has reached the point where people must wait in line for hours for their turn to buy goods – if they are available. Otherwise, they must rely upon inflated black market prices, and more desperate measures like poaching, robbery and looting . \\nSome Venezuelans have been traveling to the borders of Colombia and Brazil just to purchase food and stock up on necessities that are too hard to find at home. \\nNormal life has been upended, and significant levels of hunger, malnutrition, violence and unrest are taking hold. \\nMany are unhappy with either the ruling socialist party, or with the pro-American opposition who have wielded power in the past on the basis of its oil-rich resources. Most just want security, and an end to hunger. This entry was posted in Finance News and tagged Mac Slavo , SHTFPlan , Venezuela hyperinflation . Bookmark the permalink . Post navigation'"}, "time": 1742563858.211945}