{"duration": 0.05050158500671387, "input_args": {"text": "'She watched as her friends were killed in gang wars. She knew others who took lives. Dania Williams, 23, grew up around crime in East New York in Brooklyn, trying to resist the calls to join a gang and trying to survive the violence that waited outside her front door. Without attentive parents, the temptations were everywhere. “They weren’t as involved as they should be as parents,” Ms. Williams said. “So I did what I wanted to do. ” That included truancy and the occasional theft and no concerns about securing money in illicit ways. Retail jobs put cash in her pockets, but the work was always seasonal. Selling drugs offered a steadier source of income. “I always had this thing for having stuff that I couldn’t normally have, materialistic things that I didn’t need,” she said. “I just wanted to keep up with the latest fad. ” She remembered the warnings to correct the path she had chosen or she would wind up dead or in jail. She dismissed them as harsh judgments and hollow words from people she did not trust. Change seemed impossible. She accepted her fate. “You don’t want to get too deep, but you don’t know how to get out of whatever deep you’re in,” Ms. Williams said. But there was one person in her life whom Ms. Williams could not just brush off: her grandmother. “She actually put in my head, ‘You need to change,’” Ms. Williams said. “But where do I start? Where do I go? What do I do? Who do I talk to?” In early 2016, she saw a path out. She attended an informational meeting for Green City Force, an AmeriCorps program that prepares young people living in   homes for careers in the renewable energy industry. Green City Force is a partner of the Community Service Society, one of eight organizations supported by The New York Times Neediest Cases Fund. Lawrence Harris, a program operation manager at Green City Force, was a team leader when he met Ms. Williams, an encounter he remembers vividly. Mr. Harris immediately set out to convince her a better life was possible and to break down her apparent skepticism about changing. “I told her I’d never lie, even if I’m joking,” Mr. Harris recalled. “Once they find you told them something untrue or not the whole story, they’ll never listen to anything you have to say. ” He urged Ms. Williams to give the program a chance and worked closely with her to help build her confidence, holding her accountable for her choices and helping her be more accepting of others. On one occasion, Ms. Williams arrived to the program late  —   punctuality has never been easy for her  —   and was quite hard on herself. Mr. Harris knew then she was changing. “Everything they said, they followed through with,” Ms. Williams said. “They never told me anything and then it didn’t happen. ” After completing the Green City Force training, Ms. Williams began a   plumbing training program. She was also offered a   porter’s job. Community Service Society used $349. 50 in Neediest Cases funds to buy Ms. Williams three months of MetroCards last spring for traveling to her job. “I was never a dummy,” she said. “I was always book smart and street smart. I didn’t use it in a good way. I used it to get money in the wrong way. Now, I’m using it to get money in the right way. ” She said she had since quit her illegal activities and was fully focused on getting her plumbing certification and excelling at her porter job. She has even tried to recruit friends into Green City Force. “They made me want to turn my life around,” Ms. Williams said. “They said from the jump, we can’t do anything for you, you have to want to do it yourself. You’ll either take it and run with it or you’ll just leave it at the door. So, I ran with it. I’m running far. ”'"}, "time": 1742628388.3517182}