{"duration": 0.1399698257446289, "input_args": {"text": "'Is Trump the lesser of two evils or are both candidates equally unelectable? \\nTHE GREAT DEBATE BEGINS: We’ll know who is right tomorrow! \\nSARDONICUS (to Flopot) : I know it makes your blood boil to consider the “lesser of two evils” scenario. But LD has always been a conscientious non-voter and is therefore unlikely to be voting for either Trump or Hillary. Nor am I for that matter, since I am a UK resident and do not get to vote in the American elections. \\nYou really must reconcile yourself, Flopot, to the fact that Hillary is held in such visceral loathing that her millions of haters feel they have no option but to vote for her opponent, Donald Trump, even though they are aware of the Donald’s many faults and his Zionist connections. \\nIt’s either not voting at all or voting for the lesser of two evils. \\nFLOPOT : You don’t understand the meaning of “lesser of two evils”. It is a con trick; it doesn’t exist. Donald will pursue the same globalist wars and cultural revolutions as any other Zionist puppet. It is a meme that exists to get your consent to continue the same evil. \\nHARBINGER: Hear hear. Exactly Flopot. As I’ve stated umpteen times, Trump is good cop, Hillary is bad. But sadly, Sardonicus does not see the ‘grand plan’ even though the likes of Zbigniew Brzezinski and Carroll Quigley do, both very much part of that process. \\nThere is not one politician in the west who becomes what they are, without a careful vetting procedure. Classic example is Jeremy Corbin , whom many thought was going to be the saviour of Labour and take it to the Zionists, when he has proven without any shadow of a doubt that he’s a rampant Zionist, even though who goes on pro Palestine marches. \\nTrump is a puppet. Clinton is a puppet. May is a puppet. Merkel is a puppet….. There is not ONE politician in the west who isn’t part of the ‘grand plan’ and it’s why everything works according to plan. \\nSARDONICUS (to Flopot and Harbinger) : Yes, I understand exactly what both you and Harbinger are saying and I can sympathize with your viewpoint. You are saying there is NO LESSER OF TWO EVILS here since both candidates are EQUALLY EVIL. Because both are Zionists and will deliver a program to further Jewish interests. That’s what you’re saying, right? \\nThe only difference, as Harbie indicates, is that one of these two candidates is playing the “bad cop” (Hillary) and the other is playing the “good cop” (Trump). So it’s nonsense to vote for the “good cop” as the “lesser of two evils” when both cops are equally evil when the chips are down. \\nThis is your argument and I can sympathize with it only if you are correct in your initial assumption that Trump has no redeeming features whatever and is a total charlatan and liar who will break every single promise of his if he gets into the White House. \\nYou are entitled to that assumption, but you are NOT entitled to believe that your assumption is universally shared. Kevin MacDonald certainly doesn’t believe that Trump is a thorough scoundrel who will sell all White America down the river as soon as he is elected. Nor do the thousands of White Nationalists and other White Americans who share MacDonald’s perfectly acceptable and intellectually defensible views. \\nThese millions of Trump supporters do NOT believe that Trump is an unmitigated scoundrel who will break his promise to build a wall to keep the Mexicans out. Trump has said he has no intention of starting a war with Russia. Hillary has made no such promise. Trump has said he will crack down on illegal immigrants, especially Muslim immigrants from hostile Muslim states. Well, MacDonald and his White Nationalists are giving Trump the benefit of the doubt. \\nI for one refuse to think that Kevin MacDonald and the millions who are hoping for a resurgence of White ethnic interests are deluded and mistaken in their advocacy of Donald Trump. They could be right. Trump could be their man and actually deliver the goods, i.e., improve the lives of millions of White Americans who are now suffering under Jewish hegemony and a multiculturalism that has gone mad. \\nThe pessimism both of you share in regard to the irredeemable character of Donald Trump is simply a subjective state of mind. It’s an opinion, not a fact. \\nI may choose to say, “I can’t stand garlic and onions.” This makes me a garlic-and-onion pessimist. My subjective viewpoint that garlic and onions are horrible vegetables does not make it a scientific fact that garlic and onions are horrible vegetables. The garlic and onion eaters of the world are entitled to tell me to get lost if I told everyone to give up eating garlic and onions. \\nSo it is with Flopot and Harbinger with their Trump pessimism. They are making a logical mistake in confusing impressions with facts. It is not a FACT that Trump is a scoundrel; at the most it is a subjective opinion. \\nHP : Trump is not a politician who has been a politician who grew up a politician and lived and breathed politics all his adult life. Apart from business/social, of course. \\nHe’s an Alpha businessman who just happens to be waaay more intelligent and personally powerful than 99% of the political mediocres who envy and hate him. \\nHe came from out of nowhere and like a freight train rolled right over them before they could even cry foul or man an offense against him based on their default slime factor M.O. \\nHell, he vetted them ! Even as the entire weight of the political, M$M, Hollywood, Academia, foreigners, etc., etc., set upon him like no other in memory near or far. But they couldn’t even put a dent in him, or scare him off, and you know the vile demons tried very hard. \\nHe didn’t scare. But he did and does scare them. A lot. \\nBeing a uber-quick study, he easily overtook and surpassed the half-bright bureaucrat politicians and within one solitary year he IS The Alpha Politician. \\nPutin (and his 12 time zones full of natural resources) will no doubt enjoy Trump. Putin will respect his intelligence, embrace his personality, utilize his uber-business talents and skills, and very very importantly, hugely importantly.. share their big big patriotism for their nations, their citizens.. \\nIn other words: The world gets an early Christmas present this year! \\nUNGENIUS: Well said, HP! I would add only one statement: Trump is not a murderer, but Killery is a murderer of long standing which should make a choice simple between the two. \\nGILBERT HUNTLY: Sardonicus, thanks for your healthy and sane perspective! Well said! 🙂 \\nLOBRO: Seconding that. And add HP’s perceptive comment [ above ] to the score for level headed reason. \\nARIADNATHEO: Sardonicus, Harbinger and Flopot: You are all wrong, as I used to be, I admit. \\n“Jewish hegemony,” “zionism” …. are nothing but red herrings that distract our attention from the real enemy. It’s not “Jews, Jews, Jews,” it’s Goyim, goyim, goyim. I owe it to Amy Martin to have finally understood who are, to cite her “the two more powerful lobbyists in the US” — the Podesta brothers! \\nAlso who are the real rulers whose vast web of corruption brought them virtually absolute power: the Clintons! No Jews are involved anywhere. \\nAmy is really good (AND good looking). Why did RT get rid of her? \\nKAREN: Ariadnatheo, great satire! \\nFLOPOT: Satire reveals truth, though. We’re our own worst enemy — gullible goy; the malleable toy. \\nARIADNATHEO: This is a prediction I trust [ short amusing video ]. \\nIf you watch, make sure it is BEFORE lunch. \\nJOHN KIRBY: Sounds like the usual shakedown. \\nTHE DOT (having the last word, unedited) : \\n@ darkmooners charlatans \\nyou have been supporting the cretin clown d j dumpy from day one just because that you are sick and mentaly diseased racist pigs just like him your lunatic drivel is just like his . guess what Adriana you sick horny hog ,your Donny will not win ,loser I seen a gifted seer and some mysterious unseen someone ,she can look at the future do some kind of time travel ,I was told that ,but my mind couldn’t accept it ,so i asked for a proof ,the future winning lottery numbers.she asked for my soul then i ran away . before that she said that she visited tomorrow and Donny lost the election . now Adriana and the rest of you dark spirited hyenas ,who is crazier you or me or that witch We’ll know tomorrow (Ed) Like this? Share it now. 7 thoughts on “ Celebrity Deathmatch: Darkmoon Sages Make Their Final Predictions on US Election ” Flopot says:'"}, "time": 1742562016.743833}