{"duration": 0.06348586082458496, "input_args": {"text": "'Verboten! Don’t speak German on the streets of post-Brexit Britain, warns lawyer Verboten! Don’t speak German on the streets of post-Brexit Britain, warns lawyer By 0 108 \\nGermans living in Britain have been cautioned against speaking their native language in public places after the Brexit vote set hate crimes soaring. \\nSpeaking to the German newspaper Die Welt, lawyer Carmen Prem thought it was best to not speak “too loudly” when out and about. \\nRead more \\n“The tone has changed,” said the mother-of-two who has been living in London for 13 years. “No Briton would ever say ‘we do not want you here.’ But it is now ‘we and you.’” \\nShe also recounted how on the bus home she had recently heard the driver tell passengers to “kindly speak English.” \\nIn the piece, other Germans tell of “stronger xenophobia” in the country since the referendum in June. \\nThere is a “new bitterness, an anger which hardly any of the countless non-British on the island expected,” it adds. \\nRace and religious crimes saw a 41 percent rise in the month after the Brexit vote. Nearly 5,500 incidents were recorded by the Home Office in July alone. \\nThe overall hate crime rate was also up 19 percent on last year. Four out of five of the crimes reported were motivated by race hatred, seven percent by religion. \\nKing’s College London professor Mischa Dohler told Die Welt he was now considering moving abroad. \\nThe German academic claimed he had been offered several jobs, including an opportunity at Cambridge, but had to turn them down as he does not know what will follow the Brexit negotiations. \\n“Many non-British academics simply see no future here,” he said. Abuse & insecurities \\nWorries among German citizens come after a Spanish man was knocked down by a passerby with a wooden plank in Bournemouth earlier this month. \\nThe man was reportedly speaking to his girlfriend in his native language when the thug approached him shouting “f***ing Spanish, speak in English” before hitting him with a piece of wood grabbed from a nearby building. \\nREAD MORE: French nationals suffer post-Brexit abuse, claims ambassador \\nThe French were also reportedly reconsidering their future in Britain after being subjected to “negative or aggressive language” following the UK’s decision to leave the European Union. Up to 300,000 French nationals are currently registered as living in the country. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742564474.9452705}