{"duration": 0.16569232940673828, "input_args": {"text": "'by Outis Philalithopoulos By Outis Philalithopoulos, who met an untimely end five years ago, and now “wears the chains he forged in life” as an economist. In the previous episode of this series , the ghost Outis was guided by the Spirit of Liberalism Past to 1996, where a younger Outis had gone to hear a popular liberal speaker. Afterward, his girlfriend Corinne was eager to catch a talk by a postmodern scholar she held in high esteem; eventually, Outis agreed to come along. The speaker was a critical theory/political science professor named Wendy Brown, and she was presenting themes from her recent book, States of Injury . I tried to keep from glancing over at where Corinne and the young Outis were sitting. But my mind kept wandering, and Brown’s style hardly aided my efforts to stay focused on her lecture. The first ten minutes of her talk were spent explaining why her book had notbeen written, the boundaries it would not respect, how not only the first description she gave of her book but also the second were “disingenuous,” with such a cascade of negations that her prefatory remarks alone contained 2 no ’s, 2 neither ’s, 9 not ’s, and 6 nor ’s. To me, it all started to seem hazy, but my ghostly companion must have been enjoying himself. A person listening to Brown might have imagined that human thought was one colossal debate between Marx, Nietzsche, and Foucault, with Max Weber and Jean Baudrillard in supporting roles. Meanwhile, the unappeased menace of Catharine McKinnon lurked on the horizon. But then, something in what Brown was saying started to sound familiar: Postmodern power is often characterized as decentered and diffuse even while it incessantly violates, transgresses, and resituates social boundaries; it […] irrigates through networks rather than consolidating in bosses and kings […] We are today very susceptible to simply getting lost […] insofar as being lost means being without (fixed) means of orientation […] Brown was describing a disorienting world without clear standards of truth. But did she mean that the world was naturally like this, as Foucault seemed to believe, or did she see this “postmodern condition” as something the system had inflicted upon everyone, upon Allan Bloom as well as upon Al Franken? In our efforts to “cope” with our “lost” condition in postmodernity, Brown explained that one strategy was fundamentalism, or “reactionary foundationalism.” Quoting Feher and Heller, Postmodern Political Condition : fundamentalists select one aspect of the dogma, one “text of foundation” with regard to which they declare all attempts at hermeneutics politically subversive. That did sound like the fundamentalists I’d seen on TV. “What’s hermeneutics?” I whispered to Foucault. “Interpretation,” he whispered back. Brown had more to say about fundamentalism. Reactionary foundationalism is not limited to the political or intellectual Right, but emerges across the political spectrum from those hostile to what they take to be postmodern politcal decay and intellectual disarray. What? Apparently others were startled as well, because she immediately followed up on her point. When these precepts “without which we cannot survive” issue from the intellectual or political Right, they are easy enough to identify as both reactionary and fundamentalist. It is fairly clear what they oppose and seek to foreclose: inter alia , democratic conversation about our collective condition and future. But when they issue from feminists or others on the “Left,” they are more slippery, especially insofar as they are posed in the name of caring about political things, caring about “ actual women” or about womens’s “ actual condition in the world” […] So: the Right is trying to stop us from thinking democratically about the future, and the Left cares about real problems and real women – so why is it a problem that we believe that we are right? I want to suggest that much North Atlantic feminism partakes deeply of […] ressentiment and that this constitutes a good deal of our nervousness about moving toward an analysis as thoroughly Nietzschean in its wariness about truth as postfoundational political theory must be. Whoa, whoa, whoa. How are we swimming in ressentiment ? Doesn’t she mean right wingers ? Why should our analysis be thoroughly Nietzschean? Why should it be “wary” about the truth? Why feminists? What [is it about] identity’s desire for recognition that seem[s] often to breed a politics of recrimination and rancor, of culturally dispersed paralysis and suffering […]? I found Brown hard to understand. And the things I did understand, I wasn’t sure I liked. She closed by saying that the Left should give up substituting Truth and Morality for politics. Are we willing to engage in struggle rather than recrimination, to develop our faculties rather than revenge our subordination with moral and epistemological gestures, to fight for a world rather than conduct process on the existing one? The audience began to applaud, who knows with how much sincerity. I was annoyed, and I knew one person who I was pretty sure had understood the talk better than I had. “Michel,” I said urgently. He turned to me. “There are two things I don’t understand. First, Brown criticizes the Left for believing in myths like “truth is always on the side of the damned and excluded,” and “truth is clean of power and always positioned to reproach power,” and advocates instead “living and working without such myths, without insisting that our truths are less partial and more moral than theirs.” “Yes,” Foucault agreed. “But isn’t she insisting precisely that her postmodern, Nietzschean ideas about politics and rhetoric are less mythical, more true than those of the less reflective people she criticizes?” “Ah,” he said. “I understand. And your other question?” “When she says we need to do all these things, give up on ressentiment , make our analysis more Nietzschean, stop talking about absolute truth – why should we? Once you and she demonstrate to everyone that morality and truth are inseparable from power, and people merely engage in ‘wars of position’ and ‘amoral contests about the just and good’ – why would anyone bother to use postmodernist rhetoric?” “Well…” he began. I cut him off, with some heat. “Why wouldn’t they just continue to talk about morality and truth the way they do now? If all that matters is winning, and morality and truth help one side to win, then according to you , why care if they are myths?” “Right,” Foucault said, his eyes sparkling. “About those two questions…” He was not alarmed by my questions in the least, and I feel sure he would have addressed my doubts. But I stopped paying attention to him as Corinne and the young Outis walked toward me. The moment I had been dreading had come. Corinne’s eyes were shining. “Did you see what she was saying? Wasn’t it brilliant? And she’s so courageous, willing to criticize even Left political movements that she identifies with…” Outis looked reluctant to disappoint her. “She’s definitely very intelligent… It’s just that…” Corinne froze. “What?” she said in a suddenly much more subdued voice. He seemed to be gathering his courage. “It’s just that I don’t see why it has to be so complicated. Why can’t she just say what we ought to do?” Corinne retorted, “But don’t you see – that’s the problem. Smart people have always been trying to tell people what is true and what to think. It’s a form of power. And she doesn’t want to fall into that trap.” “Right,” Outis said, “but it feels like she sees the whole world as ringed by traps, so that everything a person could possibly say might somehow be wrong.” “But Outis,” Corinne said, “lots of things people say really are problematic. Lots of times their wording shows habits of thought that are precisely the ones we can recognize as having underpinned horrible things like colonialism.” “Does that mean we’re all going to have to talk like her ?” Outis muttered. “What do you mean, like her ? What’s so bad about the way she talks?” “It’s like she believes we’re all under surveillance by a Great and Powerful Monster. And so she has to speak in code so that that neither the Monster nor anyone else will be able to prove that she’s opposing it.” “You’re making it sound completely childish!” Corinne said with indignation. “Well, maybe it is!” Outis said, his voice rising. I turned to the Spirit in anguish. “Leave me!” I cried. “Take me back, haunt me no longer!” He looked at me with surprising gentleness in his eyes. “There are two shadows more,” he said, “that you must see; and yet, a respite will give you space to consider the points of fixity, of immobilization, in your position, so you can begin to see them as elements in a strategy…” And with these words, he and everything else vanished, and I found myself alone in the abyssal vale. There were things then that I did not wish to remember, and I forced my mind onto other topics. “Postmodernism,” I repeated darkly to myself. Even the word sounds pretentious. What does it mean, anyway? It seemed to be in opposition to “modernism,” which in turn meant how people in the early twentieth century often believed that humanity could work toward absolute truth, and that current Western society represented the culmination of historical progress. For reasons Brown seemed to think were obvious, modernism was not good, and so it had been replaced by the “postmodernism” that had bestrode the academic world like a colossus. Postmodernist irony, cultural relativism, skepticism about objective truth – in various guises, these could be seen not only in Foucault and Brown, but also in Franken, and echoes of it were present in Bloom’s critique. So who killed it? And why was its death a secret? If the most brilliant liberals of the 1990s had been convinced that all attempts to establish absolute truth were fundamentally flawed and problematic, how had we solved the problem and successfully created a set of fixed reference points for orienting ourselves? Had we, paraphrasing Feher and Heller, chosen a dogma and “declared all attempts at interpreting it critically to be subversive”? * * * In the next episode, Outis moves closer to the present, and watches as the outlines of modern progressivism become more discernible. Sources: Wendy Brown’s book is online here . 0 0 0 0 0 0'"}, "time": 1742562981.7013707}