{"duration": 0.10572528839111328, "input_args": {"text": "'Summer arrives, and along with it, rosé and enough wine clichés to float a cruise ship. You may have heard endless odes to “the pink wine” and its “moment in the sun,” how “it’s not just a drink, it’s a lifestyle,” and so on. It’s not just rosé season, it’s silly season. Prepare yourselves for plenty more foolishness about rosé from marketers, who have a product to sell, and from wine writers, who ought to know better. Some will argue that rosé, unlike other wines, is absolved from critical evaluation. It’s fun, it’s carefree, it’s casual. Leave it alone, they will say. Or as Jay McInerney, the novelist and wine writer, once put it, “Anyone who starts analyzing the taste of a rosé in public should be thrown into the pool immediately. ” Here at Wine School, our critical antennas are always tuned in. No wine is immune from evaluation, though situations like pool parties, picnics and casual   are not conducive for critical pontifications. Wine oratory and pretentiousness are never welcome, though judgment always is. Even a lighthearted wine should be earnestly produced and offer some level of interest beyond a pretty color. Why shouldn’t rosé be treated like other wines? Such thinking is an insult to rosé, and to consumers, though a boon for cynical producers, who may take it as a free pass to make bad rosé. You’ll have no trouble finding plenty of that. At Wine School, we always try to separate common sense from nonsense. With rosé, that begins by ignoring efforts to diminish expectations. Educated consumers should demand more from a wine than   labels or celebrity  . Such marketing may well have contributed to rosé’s skyrocketing seasonal popularity, but we’re more interested in which wines we like, which ones we don’t, and why. As many bad rosés as you may find  —   manufactured industrially to create precisely the right shade of pink and just the right fruit aromas, with maybe a little sweetness for the   lovers  —   good rosés abound, too. These are likely to be bone dry, though not always. They will be balanced with aromas, flavors and colors arrived at naturally, without manipulation on the assembly line. For the last month, we have been focusing on rosés from Provence, the region historically associated with rosé and the pastoral images it conjures. While good rosés can be found from almost every wine region in the world, we are dealing with fundamentals, so Provence seemed a good place to start. As usual, I recommended three wines and invited readers to drink them and share their thoughts by commenting at nytimes. . The three bottles I selected were: Commanderie de Peyrassol Côtes de Provence Rosé 2015, Mas de Gourgonnier Les Baux de Provence Rosé 2015 and Château de Pibarnon Bandol Rosé 2015. Not surprisingly, these are very young wines. Almost all the rosé sold each summer is from the most recent vintage. Consumers, for really no particularly good reason, demand it, so producers rush their bottles to market in May. As a result, the vast majority of rosés are made to drink immediately. They are easy, ephemeral, and by the time Labor Day rolls around and wine shops are slashing prices, they are already on their way down. But the most serious rosés will benefit from a little more bottle age. If you see good Bandol rosés from 2014 or even earlier, or bottles from other top Provençal producers like Clos Cibonne or Château Simone, try them. They are likely to be more expensive than the easier rosés, but you may be surprised at the complexity that has developed. I would have wanted to pick older rosés just for fun, but frankly, they are not widely enough available for our purposes. So the 2015s were the choice. The Mas de Gourgonnier, made primarily of grenache but with small amounts of cabernet sauvignon, cinsault, syrah and mourvèdre, was the   tasting of wildflowers, red berries and citrus. It could have been the proverbial   wine: light, lively and fresh. The Commanderie de Peyrassol had a little more going on. It’s made of cinsault, grenache and syrah in proportions that depend on the vintage, and I found it long, deep and earthy, with flavors of lime, anise and hot rocks. That underlying mineral edge made it especially delicious. Yet it, too, was fresh and lively and could fill that poolside role well. The Pibarnon, by contrast, seemed bigger, maybe a little too big for the pool party. It was made mostly of mourvèdre, with the remainder cinsault, and it was deeper and more complex than the other two. I usually love Bandol rosés for their savory chalk and licorice flavors, but this one had an added touch of what seemed to me ripe tropical fruit. Sniffing the wine, it seemed intrusive, though I enjoyed the fruit and gravelly flavors on the palate. Each of these wines went beautifully, I thought, with a dish of wild salmon with garlic butter, from an exceptional and easy recipe by my colleague Melissa Clark. Anchovies and garlic are signature Provençal flavors, and perhaps that accounts for why the dish and the wines seemed such a triumphantly delicious pairing. Not everybody found the rosés to be as versatile with food as their reputation suggests. Jane Montgomery of Washington, D. C. reported that she loved drinking a Whispering Angel rosé from Château d’Esclans. “It was crisp and airy and tasted like you’d just licked a rocky outcropping along the beach,” she said. “Interestingly, it was also the least successful wine pairing experience I’ve ever had. ” She said that the wine didn’t clash with her meal of grilled kebabs and fattoush, but that it added nothing, and she wondered whether all rosés from the region were similarly lacking in versatility. I understand her frustration. A synergy of food, wine and conversation is always my goal at a meal. I’m at a loss to explain the failure of this pairing, though. It seemed to me to be a good one. Other readers reported mixed results. Ferguson of Princeton, N. J. who found all three rosé selections, said that a pairing with winter squash risotto was a dud but that the wines were wonderful with a pizza with anchovies, olives and caramelized onions. Not unexpected. As Ferguson noted, salty foods are very good with Provençal rosés. On the other hand, Brian Hall of Highland Park, Ill. likened rosé to a   utility player in baseball because of its versatility, and suggested that this quality allowed rosé to be enjoyed   rather than just in the summer. Jammer in Vermont has also become a   rosé drinker, and offered an enticing, if novel image: “There is nothing as lovely as having a rustic lamb dinner on a snowy New England winter night accompanied by a lovely   Bandol from Provence. ” I’ve long been in favor of freeing rosé from its summer confinement. Serious rosés transcend the   imagery of marketers, as Jammer suggests, and despite some of the pairing failures, I still believe rosé can complement a variety of foods that people want to eat  . One reader had a particularly innovative idea for rosé. VSB, to honor the 13th anniversary of wiping out   debt, created a Freedom Pink cocktail. I’m not usually one to add anything to wine, but this seemed intriguing. Here’s the recipe: “Muddle 2 sliced strawberries and 8 raspberries in the bottom of a pint glass. Add 6 ounces of the Peyrassol or other rosé. Fill with seltzer, stir gently to float the fruit, add a few ice cubes. Garnish with a sprig of mint. ” Now that’s versatility.'"}, "time": 1742562172.7183409}