{"duration": 0.09094667434692383, "input_args": {"text": "'Three U.S. government officials deemed to be highly reliable reported witnessing two UFOs hovering near a train line. The report of the sightings was filed 61 years ago, but their supporters allegedly covered up the said report.\\nAlien researchers obtained formerly confidential files that detail senior Senator Richard B. Russell and two aides’ account about seeing two flying saucers taking off.\\nDuring a fact-finding mission to Russia, Sen. Russell was on a Soviet-era train. He was a chairman of the Armed Services Committee and considered as one of the most influential U.S. senators. He died after serving for 38 years in 1971.\\nAccording to the documents obtained by the Fund for UFO Research (FUFOR), Sen. Russell was in the Transcaucasus region with his two aides at around 7 p.m. on October 4, 1955, when the incident took place.\\n\\nHe reportedly spotted two disc-shaped UFOs when he looked out of the window. These UFOs were taking off from a place close to the railway tracks, according to the documents.\\nThe documents further reveal that the senator called over aide Lt. Col. Hathaway and interpreter Ruben Efron to look out of the window as well. Both of them also saw the two craft taking off.\\nThe senator and the aides reported the sighting to U.S. Embassy in Prague, in Czechoslovakia, and U.S. Air Force, but the account was apparently kept strictly confidential.\\nThe documents disclose that air attaché at the embassy, Lt. Col. Thomas Ryan, filed a top secret Air Force intelligence report on the senator and aides’ sighting on October 14, 1955, after meeting the trio.\\nThe filed top secret report states that Lt. Col. Hathaway told Lt. Col. Ryan that the trio saw a disc ascending almost vertically at a relatively slow speed. The outer space of the UFO revolved slowly to the right, to an altitude of approximately 6,000 feet. Its speed increased sharply as it flew north. The second unidentified flying disc was seen about a minute later performing similar actions. About 1 to 2 miles south of the rail line was the take- off area.\\nCIA agents also interviewed the trio and a fourth unidentified witness.\\nThe documents reveal that Mr. Efron described the visibility as excellent and the UFOs glide without any noise heard and exhaust glow or trail seen.\\nThe fourth unidentified individual stated that one UFO had a white light on top and a slight dome.\\nAll witnesses claimed that the disc had a pinkish-white glow and ascended in a vertical manner with the glow moving slowly in a clockwise direction around the perimeter, providing a pinwheel appearance.\\nOn October 18, 1955, U.S. Secretary of State John Foster Dulles was briefed, and the FBI penned a memo on November 4, stating that Lt. Col. Hathaway’s testimony would support the existence of a flying saucer.\\nThe men remain their silence publicly, but details were leaked to a Los Angeles Examiner reporter who approached Senator Russell.\\nThe senator’s response to journalist Tom Towers was that he already discussed the matter with the affected government agencies and they thought it wasn’t wise to publicize the issue at that time. The senator refused to divulge further details to the reporter.\\nThe Air Force, FBI, and the CIA documents remained confidential for 30 years before being declassified in 1985, but their details emerged only after FUFOR obtained the documents under a Freedom of Information Act request.\\nFUFOR chairman, Dr. Bruce Maccabee, said these long-secret documents show for the first time that a powerful U.S. senator saw and reported a UFO. He believes that the witnesses were prevented from talking about the incident. The chairman added that these documents reveal the CIA took the UFO report seriously.\\n\\nSource: Latest UFO Sightings \\n'"}, "time": 1742563364.6483688}