{"duration": 0.06868457794189453, "input_args": {"text": "'Pakistan declares nationwide bandh on November 9th in protest against 1-day ban on NDTV Posted on Tweet (Image via ndtv.com) \\nGlobal terror hub Pakistan has called for a nationwide shutdown on the 9th of November, in what it terms a strong protest against the Indian Ministry of Information & Broadcasting’s 1-day ban on satire \\nPakistan Prime Minister Raheel Nawaz Sharif, after firing a stinging letter to UN Secretary General Ban Ki Moon, highlighting India’s 24-hour ban on NDTV, which he termed a cold-blooded murder of democracy and free speech, officially made the announcement. “The people of Pakistan stand shoulder to shoulder in solidarity with the employees of NDTV at this time. To make the world get an idea of what is happening in India as well as about how much dear NDTV means to us, the whole of Pakistan will shut down on the 9th of November. This will teach India a lesson,” Sharif stated. If rumours are to be believed, ORF chief Sudheendra Kulkarni and Congress leader Mani Shankar Aiyar are expected to join the agitation across the border. \\nSharif’s appeal found resonance not only among Pakistan’s citizens, but also among their terrorists. Leading the charge was JuD chief terrorist Hafiz Saeed, who announced a worldwide terror shutdown on the 9th. “Who does India think they are? After I mentioned that I am a big fan of Barkha Dutt, they go all coward and block her channel for 24 hours! I won’t take this insult to our Barkha lightly. I appeal to all my fellow terrorists in Pakistan and in all parts of the world, including the ones in India, to suspend all terror operations on that day to show our solidarity. This way, we will send out a strong message,” Saeed announced. \\nThe clarion call has been uniting all rival factions in Pakistan by the hour. While PTI chief and former cricketer Imran Khan announced that he would not look to marry anyone on the 9th of November, in complete solidarity with NDTV, former Pakistan External Affairs Minister Hina Rabbani Khar has announced that she would not be purchasing any Birkin bags on that day. \\nThe countries standing up for NDTV do not seem to be limited to Pakistan alone. According to NDTV’s Sreenivasan Jain, the Gaza administration has conveyed similar intentions to him. “I’m in Gaza right now and every citizen here, right from the safed dhaadis to the kaala dhaadis feel that this is no chota-mota matter. NDTV and I personally mean so much to these people. Even today, whenever people see me on the streets here, they laud my coverage of Snoopgate,” Jain told The UnReal Times . \\nWhile a few journalists at NDTV are still shell-shocked and clueless over what to do during the day, journalist Sunetra Choudhury has signed up for an alternative reading class at JNU. NDTV India’s Ravish Kumar declared that he would cover himself up with the black screen he previously used, for the whole day, in protest against the government’s move. While Union I&B Minister Venkaiah Naidu is yet to comment on the issue, his predecessor Arun Jaitley is likely to go on leave on November 9th, according to Finance Ministry sources. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742564154.409225}