{"duration": 0.06635737419128418, "input_args": {"text": "'fall of the ussr , Valdai , sochi In days when modern Moscow is being accused of pursuing similar ambitions to the USSR, the assembled experts tried to formulate the basic myths about Russia’s Soviet past. Source: Panthermedia / Vostock-photo \\nThe world\\'s leading scholars and analysts from the Valdai Club have analyzed collapse of the Soviet Union and compared the direction of current Russian foreign policy to that of its predecessor at a meeting of the international discussion forum in Sochi on Oct. 24-27. \\nIn days when modern Moscow is being accused of pursuing similar ambitions to the USSR, the assembled experts tried to formulate the basic myths about Russia’s Soviet past and discussed whether the Kremlin is seeking to re-establish. Deliberately dismantled? \\n\"I do not believe that there is an inevitability that in 1991 the Soviet Union had to collapse. There are plenty of reasons why it did not have to occur then,\" Robert Legvold, Professor Emeritus at Columbia University and director of the Euro-Atlantic Security Initiative, told RBTH, adding that none of the main theories that experts put forward in their search for the causes of the collapse of the Soviet Union in 1991 explain the phenomenon fully. \\nWherever the reasons for the collapse were hidden – in the political and economic system of the USSR or the problem of nationalities that fueled separatist aspirations in some parts of the multinational association – it is still impossible to say with certainty why the Soviet Union collapsed in 1991, said Legvold. \\n13th annual meeting of Valdai Discussion Club in Sochi / Source: Anatoly Strunin / TASS \\nThe failure to completely understand the reasons for the collapse of the Soviet Union fuels the opinion that the Soviet Union was deliberately dismantled. \\n\"In Russia, too many people believe that the Soviet Union was dismantled, rather than that it broke down on its own,\" Andrei Tsygankov, a professor at the departments of political science and international relations at San Francisco State University, told RBTH. \\nThe view that the crisis in the Soviet Union was not of a structural nature is confirmed by the fact that in 1988 the economic situation in the USSR improved, Tsygankov said. \\n\"Perhaps it was not a structural, but a cyclical crisis. If the policies had been different, it would have been possible to change the situation,\" he suggested. \\nHowever, an even more interesting question, according to Tsygankov, concerns the extrapolation of the principles of Soviet foreign policy to modern Russia. Few ambitions \\n\"The train has left,\" said Richard Sakwa, Professor of Russian and European politics at the University of Kent, responding to RBTH\\'s question about whether Moscow is looking for the impact on other countries that it had in Soviet times. \\nIt is a mistake to think that any strengthening of Russian influence in the post-Soviet space should necessarily mean the Kremlin\\'s desire to recreate the Soviet Union, he explained. \\nLegvold agreed, arguing that Russian President Vladimir Putin’s infamous words about the collapse of the USSR being \"the greatest geopolitical catastrophe of the century\" should not be interpreted as his desire to restore the Soviet Union at the earliest opportunity. Putin: Use of \\'mythical\\' Russian military threat a ‘profitable business\\' \\nContemporary Moscow has no ambitions to involve neighboring countries in Cold War-era blocs, believes Legvold. According to the expert, Russia, like any country, wants to have a say in making regional decisions affecting its interests, but this does not mean that Russia is looking for a way to gain full control over its neighbors. \\nThat is why the countries of the Western world should not take Russia as a potential aggressor; Moscow\\'s main task now is to improve the economic and demographic situation in the country, says John Mearsheimer, a professor of political science at the University of Chicago. \\nAt the same time, a number of those gathered in Sochi expressed a belief that criticism of Russian integration initiatives is due to the fact that they call into question the faith of the Western countries that there is no alternative to the modern world order. \\n\"The universal system established by the West after 1991 is trying to […] homogenize political space across the globe,\" said Sakwa. \"The development of BRICS and other alternatives is precisely the argument to say that there is now an alternative force, where this unipolar universalism no longer applies.\" \\nAt the same time, Moscow is not looking for ways to oppose the Western world with an alternative world order deliberately, according to experts, who are convinced that Russia\\'s foreign policy initiatives, including its increasingly close cooperation with China, is due primarily to the U.S. and EU policies toward Moscow. \\n\"Russians tend to react to the Americans […]. It is the Americans pushing the Russians towards the Chinese which, I believe, is not in America’s national interests,\" said Mearsheimer.'"}, "time": 1742628336.7189827}