{"duration": 0.0839700698852539, "input_args": {"text": "'MANCHESTER, N. H.  —   Michelle Obama issued a deeply personal denunciation of Donald J. Trump on Thursday for his lewd comments about women, exhorting voters in scathing terms to reject his candidacy and the campaign’s increasingly vulgar tenor by backing Hillary Clinton as a matter of conscience. “This is not normal. This is not politics as usual,” Mrs. Obama said in a   speech here during which her voice at times quavered with emotion. “This is disgraceful, it is intolerable, and it doesn’t matter what party you belong to,” she added. “No woman deserves to be treated this way  —   none of us deserves this kind of abuse. ” In remarks that were among the most outspoken by a first lady in modern history, Mrs. Obama, who has mostly avoided the political limelight, positioned herself at the center of a campaign she characterized as having devolved into “madness. ” She implored voters to “stand up and say enough is enough. ” “I can’t believe that I’m saying that a candidate for president of the United States has bragged about sexually assaulting women,” the first lady told several hundred voters at a university here. “I can’t stop thinking about this  —   it has shaken me to my core,” Mrs. Obama said, reacting to the emergence last week of a recording in which Mr. Trump was heard coarsely boasting about kissing and groping women without their consent. What followed from the first lady, who has styled herself America’s “mom in chief,” was a message about empowering women to rise up against sexual abuse and harassment in every context. The speech was all the more striking because it was delivered on behalf of Mrs. Clinton, whose experience with her husband’s infidelity all but disqualifies her from speaking in similarly vivid terms. Aides said Mrs. Obama had always planned to reshape her stump speech as Election Day neared to focus more on women and the significance of electing the first female president. But when Mr. Trump’s remarks surfaced on Friday, she ripped up that speech, ultimately settling on one that was all the more biting for its intimate tone. “I feel it so personally,” Mrs. Obama said on Thursday, placing her hand against her heart for emphasis as she spoke about Mr. Trump’s treatment of women. “It’s like that sick, sinking feeling you get when you’re walking down the street minding your own business and some guy yells out vulgar words about your body, or when you see that guy at work that stands just a little too close, stares a little too long so you feel uncomfortable in your own skin. ” “I can tell you that the men in my life do not talk about women this way,” Mrs. Obama added. “To dismiss this as everyday locker room talk is an insult to decent men everywhere. ” The speech was a riveting moment in an already remarkable campaign, coming just before Mr. Trump appeared in West Palm Beach, Fla. to angrily denounce as “false smears” news reports in which several women said he had made unwanted advances on them. The New Hampshire rally was Mrs. Obama’s sixth campaign appearance for Mrs. Clinton in a month, and the first lady broke from her usual approach and did not speak about Mrs. Clinton’s qualifications for the presidency until halfway through her speech. She said the former secretary of state “embodies so many of the values that we try hard to teach our young people,” and ticked off highlights from Mrs. Clinton’s résumé, saying that any parent would be proud to raise a daughter like her. But she also sought to appeal to those unenthusiastic about Mrs. Clinton or politics itself, issuing a call to voters across the political spectrum who have been alienated by a contest dominated by outrageous statements and partisan rage. “We simply cannot endure this, or expose our children to this any longer  —   not for another minute, and let alone for four years,” Mrs. Obama said. “This has got to stop right now. ” She argued that even voters repulsed by the tone of the campaign  —   “we are drowning in it,” she said at one point  —   must consider the norms of behavior they wanted to instill in their children. “In our hearts, we all know that if we let Hillary’s opponent win this election, then we are sending a clear message to our kids that everything they’re seeing and hearing is perfectly O. K. We are validating it. We are endorsing it,” Mrs. Obama said. “We’re telling our sons that it’s O. K. to humiliate women. We’re telling our daughters that this is how they deserve to be treated. We’re telling all our kids that bigotry and bullying are perfectly acceptable in the leader of their country. ” Instead, she framed the decision to vote for Mrs. Clinton as akin to a woman’s choice to speak out in the face of sexual mistreatment or violence. “We need to recover from our shock and depression and do what women have always done in this country,” Mrs. Obama said. “We need you to roll up your sleeves. We need to get to work. ”'"}, "time": 1742563281.22014}