{"duration": 0.01592111587524414, "input_args": {"text": "'New reports are now suggesting that Hillary Clinton is about to step down from the presidential race following the Anonymous release her 33,000 deleted emails this week. A new post on 4chan explains Hillary was warned by superiors that she must step down or there will be another huge leak from Wikileaks. \\nVia AlternativeNews \\n\\nDuring this election, I have steered away from click-bait national polls and media bias polls because I have learned all they do is get my blood pressure up. But I came across some information, and I would clearly be negligent not to share it with you.\\nInfoWars Video Below! It seems D-Day is Tuesday so you know I will be watching and waiting, but if this happens, it could be huge for the entire general election a week later. As you know “everything you read and hear is true on the internet,” but sometimes things are factual. But this needs investigating, however, the cost.\\n\\nThe information below comes from 4chan. 4chan is a simple image-based bulletin board where anyone can post comments and share images anonymously.\\n\\nWith the threat of a massive blockbuster by Wikileaks and Project Veritas coming this week, get your popcorn ready! Now, Hillary could change her mind, or this could be a hoax also, but if you look at the following messages and the dates and put one and one together, you get some crazy stuff. If you are shaking your head, we had the same reaction. Hillary and her campaign have been on borrowed time and the bell tolls for them. It’s time to come clean and step down if that’s the decision. This country needs a leader, and Donald Trump should step into the White House on January 20, 2017, and take command of a nation that was fundamentally transformed into a liberal hellhole. What do you think about this news? Do you think Hillary will step down or do you think she will continue to press her luck with the possibility of the 33K emails to be released and damage her even more? Share you comments below. Help support conservative news and views by sharing this post on Facebook and Twitter.\\n'"}, "time": 1742628502.8713095}