{"duration": 0.050230979919433594, "input_args": {"text": "'Dictionnaire visuel Le prince et l’imposteur : qui est le mystérieux millionnaire d’Instagram ? À la fin de l’été, deux personnages identiques sont apparus sur Instagram : de grands hommes grisonnants, riches, dépensiers, passant tous deux leur temps à voyager et à faire la fête en charmante compagnie. L’un est l’italien Gianluca Vacchi, l’autre le russe Boris Bork. L’un d’entre eux vit vraiment une vie de rêve, l’autre est un imposteur. Par Daria Donina \\nCette semaine, le réseau social russe a été le théâtre de débats acharnés au sujet du faux compte du « riche » retraité russe Boris Bork, lorsque le spécialiste en relations publiques moscovite Roman Zaripov a annoncéêtre derrière l’ Instagram de Boris Bork. \\nEn mars 2016, Roman Zaripov et ses amis ont décidé de faire une expérience : combien de temps et d’argent faut-il pour devenir une superstar d’Instagram ? La réponse : 50.000 roubles (moins de mille euros) et un peu de chance. \\nRoman et Mikhaïl ont trouvé leur héros sur les réseaux sociaux : Boris Bork (le nom est imaginaire), un retraité moscovite de 65 ans. Il était « loin de l’image d’un riche » , ne vivait que de sa retraite et louait un une-pièce dans la banlieue de Moscou, mais il avait l’air « cool » , selon Zaripov. \\nQuelques heures après le premier post sponsorisé sur le réseau social russe vk.com , Boris avait 2000 abonnés. Lorsque le nombre d’abonnés atteignit 8000, Boris fut invité par la chaîne de télévision Russie 1 à un talk-show sur « la vieillesse heureuse », et les marques de mode ont commencéà lui proposer de participer à leurs campagnes publicitaires. Bork recevait des messages privés d’hommes d’affaires lui proposant de coopérer, et même de jeunes femmes. \\nDésormais, l’expérience est terminée, Roman a décidé qu’il était trop difficile d’investir de l’argent dans l’entourage et les accessoires de ces photos truquées. Mis à jour pour la dernière fois il y a 17 semaines, l’Instagram de Boris Bork continue d’attirer les abonnés. Il en a maintenant plus de 18.000.'"}, "time": 1742628402.646355}