{"duration": 0.1324319839477539, "input_args": {"text": "'Posted on October 27, 2016 by Carl Herman \\n“It is no use trying to escape their (Empire’s) arrogance by submission or good behavior. Robbers of the world, having by universal plunder exhausted the land, their drive is greed. If the enemy be rich, they are rapacious; if poor, they lust for domination. Neither rule of the East nor West can satisfy them. Alone among men, they crave with equal eagerness poverty and riches. To plunder, slaughter, seize with false pretenses, they give the lying name ‘empire.’ And where nothing remains but a desert, they call that ‘peace.’ ” – Tacitus, The Agricola and the Germania (analyses here , here ). Tacitus wrote ~ 100 AD, a century into empire. Emperors proclaimed to the public that their government still upheld the highest ideals of their Republic, claiming expanding empire was only and always in “self-defense.” \\n“One Love! Let’s get together and feel all right. Hear the children cryin’ Hear the children cryin’ (One Heart! )” ~ Bob Marley, One Love \\nlanguage warning: Socrates and I speak in the same direct language that caused his execution for “corrupting the young.” \\nSocrates: Carl! \\nCarl: Soc! (bro hug) \\nS: How may I be of service? (genuine smile) \\nC: I just want to talk with an honest person, bro. We last talked 6 months ago . I don’t know if I have anything new to say, but I want to talk with someone who can hear. \\nS: I’ll try. What about? \\nC: We’re finishing a so-called “election” season that’s “jumped the shark” (and here ) with the Left-wing candidate a proven criminal, and Right-wing candidate a depraved Roman Emperor wanna-be . These are Left and Right arms of one illegal rogue state US empire , of course. \\nS: Of course. \\nC: So I keep feeling that we have to be near an endgame, Soc. We have to be, given the open floodgates of evidence about s much criminal activity by the .01% centered in war , looting , and lying . \\nI mean, really, how much longer can this go on?! \\nS: (smiling) Are you asking me, or just pausing for dramatic effect? \\nC: I’m asking if you have any answers. \\nS: (shrugs) I went through a 27-year civil war after almost 50 years of Athenian “leaders” concentrating an empire under their dominion. As we discussed in some detail , Athen’s “love of freedom” and spin that foreign barbarians “hate us for our freedoms” was total inversion of the facts because “freedom” was only meant for us, and not anyone else. Everyone else had to pay tribute or face military invasion. \\nThis hypocrisy in my time produced civil war. Those of us voicing the facts were insufficient to prevent it, or stop it once started. (Pauses to look intensely into my eyes) \\nSo you tell me: how much longer could your struggle go on? \\nC: Fuck. \\nI really don’t want a civil war. \\nS: Fuck, indeed. If it comes, maybe you’ll be lucky. Maybe it won’t last 27 years. \\nC: Fuck. \\nS: But I do have a brighter perspective. I mean, how many of the non-sheeple would care to talk with me if all I ever did is leave them discouraged? (chuckles) Who would converse with Socrates if those who did were asked, ‘Hey, how did your conversation with Socrates go?’ and the responses were all disheartened, ‘Fuck!’ (laughs) \\nC: Alright, go. What’s the higher light? \\nS: You already know it. You tell me. \\nC: Ok, you’re right. Maybe my being on Earth is all about growth, truth, and service, and I have to exercise real-world Faith to the One Life. It’s my job as a guest on this planet to harmonize in service to the Goddess ’ plan for Earth. Those of us who are relative beacons of light are isolated by design, obviously, by the facts of our relative leadership and lack of response from the public. \\n(smile) At least I haven’t been voted by my peers for execution, as you were, Soc, for standing for truth. \\nS: Not yet, anyway. If you had taken other pathways, you would have been assassinated by your oligarchs, such as Martin King , President Kennedy , and others . \\nC: (sigh) I guess I don’t really have anything new to discuss. I just want to win this game. End the empire. Have truth and love. \\nIt’s been a long war, bro. \\nS: Indeed it has. Longer than you know. \\nC: So much bullshit . \\nS: Only bullshit. Any truth has been co-opted, controlled, and used to mask the empire. The only reason I’m allowed onto your history pages is pretense that humanity lives on a planet operated from ideals of virtue. \\nIt’s the same with religious ideals of love. \\nC: I’m ready to win. \\nS: So was I. \\nC: (sigh) Alright. So another day in the empire. Ok. Fine. Real-world exercise of Faith. The Goddess has more evolution to oversee with love and wisdom before we see a breakthrough. I can embrace that. \\nIt’s really stupid to argue with reality. \\nReally stupid. \\nS: (smiling) Apparently, yes. \\nWe have to work with what we have, assuredly. There is no other option. \\nC: We discussed in our previous conversations linked for readers below that the US today compares to your empire in Athens, and the case that perhaps, just maybe, the US is on the verge of breakthrough for Truth and Love. \\nS: Perhaps my history can allow perspective on your world of the present, and encourage Americans today to best use their voice and virtue for a brighter path than the civil war we endured. \\nCertainly for all interested, this consideration is worthy of investing time and attention. History is literally all we know, and what drives our understanding of the present. History is what informs our direction for building the future. \\nAmerica’s history is at war between an awakening We the People and a deeply evil .01% committed to undisclosed vicious empire. \\nYour history could devolve into civil war. (chuckles) As would-be Emperor Trump might say: “Sad.” \\nC: (shaking my head, slight smile). Ok, I gotta’ go to work. Another day in the empire. My vote still stands to planetary management for full fucking truth in a breakthrough. I like a potential trend with revealing e-mails, but want a breakthrough that causes arrests of our .01% leaders in elegant endgame. \\nS: Yes, and I’d like to fly, breath underwater swimming like a dolphin, and have daily dinner parties with wine, music and women! \\nC: (mock agreement) Me, too! \\nOk, our wants aren’t our best guides, necessarily. \\nI do have to go to work. Back to “earning a living.” \\nS: Make the most of it. It’s your given area of self-expression. \\nC: I promise. I’ll lead by example of my best good-faith expression and experience of virtue. \\nAnother day. \\nS: Perhaps just another day. Perhaps you can’t imagine what’s coming. \\nC: Human limitations. I’ll work with what I see. \\nS: That’s all I concluded was possible. That’s all I got for wisdom. I didn’t teach anything other than look for yourself what’s right there in front of you to see. Listen to your small voice within for your best call of virtue. \\nStep-by-step, my brother. In all empathy, live your Faith that you’re loved and guided more than you’re able to imagine. \\n(bro hug) \\nWe’ll do our best. \\n“Interview” series:'"}, "time": 1742563700.8654616}