{"duration": 0.14110732078552246, "input_args": {"text": "'Tuesday on Fox News Channel’s “Hannity,” host Sean Hannity used his opening monologue to address what he called “a     campaign” against him and his show that included targeting his advertisers.  Hannity was criticized over the past few weeks for his willingness to discuss former DNC staffer Seth Rich’s murder, an individual who some have claimed was the source of emails leaked to Wikileaks last year. Transcript as follows: I have to start tonight on a personal note about something that happened last week. Now, I was asked by the family of the DNC staffer that was killed in July to pull back covering the story of the death because their son and their family was hurting. Now, their family out of consideration, seeing the pain that they were going through, they told me a number of times what was happening with them, and I was honestly glad to accommodate them because as a father, I know that I would probably never recover if I lost one of my kids. I honestly don’t think it’s possible. I cannot imagine the pain this family has gone through. Now, out of respect for the family’s wishes, well, I decided for the time being not to discuss it unless there were further developments. But I also promised you, my audience, my loyal audience, that I will not stop investigating. I will not stop asking questions. And at a very high level, the bottom line here is the family wants the truth and I think the country deserves the truth because this impacts so much of what the narrative in this country is now about, which is the left and their conspiracy theory. Now, I can report I am making progress. We will have a lot more coming, probably sooner than later. And I want to address this because, well, I have now been labeled by liberals, members of the destroy Trump media, a conspiracy theorist. Why? Let me explain. Now, as we have been telling you on this program for months, Democrats and the media continue to push the Russia collusion Trump narrative without a shred of evidence. Nothing! Now, if evidence  —   pay close attention. If it ever does become available, we will report it on this program. However, just this past weekend, former Obama director of national intelligence James Clapper said he never saw a smoking gun or smoking gun evidence that collusion with the Trump campaign and Russia ever existed. Listen in here with his own words. (BEGIN VIDEO CLIP) JAMES CLAPPER, FORMER DIRECTOR OF NATIONAL INTELLIGENCE: I have to say that without specific  —   specifically affirming or confirming these conversations since even though they’re in the public realm, they’re still classified  —   but just from a theoretical standpoint, I will tell you that my dashboard warning light was clearly on, and I think that was the case with all of us in the intelligence community. I have to say, you know, at the time I left, I did not see any smoking gun certitude evidence of collusion. But it certainly was appropriate for  —   given all the signs, certainly appropriate for the FBI to  —   and necessary for the FBI to investigate. (END VIDEO CLIP) HANNITY: OK, investigate, no evidence. Now, that’s not all. Let’s go back to January. While testifying under oath, Clapper said there was no evidence that Russia affected the actually vote tallies back in November. Watch this. (BEGIN VIDEO CLIP) CLAPPER: First, we cannot say that  —   they did not change any vote tallies or anything of that sort, and we had no way of gauging the impact that  —   certainly, the intelligence community can’t gauge the impact it had on choices that the electorate made. (END VIDEO CLIP) HANNITY: Wow. Also back in March during an interview, “Meet the Press,” Clapper again said he had not seen any evidence of Russian collusion. Watch this. (BEGIN VIDEO CLIP) CLAPPER: We did not include any evidence in our report  —   and I say “our,” that’s NSA, FBI and CIA, with my office, the director of national intelligence, that had anything  —   that had any reflection of collusion between members of the Trump campaign and the Russians. There was no evidence of that included in our. CHUCK TODD, MODERATOR, “MEET THE PRESS”: I understand that, but does it exist. CLAPPER: Not to my knowledge. (END VIDEO CLIP) HANNITY: Not to my knowledge. And Democratic lawmakers  —   they’ve also admitted, even as late as last week, they’ve seen no evidence of collusion whatsoever. Take a look at this. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: The last time we spoke, Senator, I asked you if you had actually seen evidence of collusion between the Trump campaign and the Russians. And you said to me  —   and I’m quoting you now  —   you said “Not at this time. ” Has anything changed since we spoke last? SEN. DIANNE FEINSTEIN (D) CALIFORNIA: Well, not  —   no, it hasn’t. UNIDENTIFIED MALE: (INAUDIBLE) but just to be clear, we haven’t  —   there has been no actual evidence yet. REP. MAXINE WATERS (D) CALIFORNIA: No, it has not been. UNIDENTIFIED MALE: OK. I just wanted to  …     WATERS: No, it has not been. (END VIDEO CLIP) HANNITY: Dianne Feinstein, Maxine Waters! So we have no vote tallies that were actually changed. One of the top Democrats in the Senate says she has seen nothing to suggest there was collusion between the Russians and President Trump and his campaign. Now, again, if we’re presented on this program with concrete evidence collusion happened, and it hasn’t been out there for months, I promise we will report on it. So tonight, we ask an important question. Why has there been hundreds and hundreds and hundreds of hours of media coverage about the   conspiracy if there’s zero evidence? Now, the funny thing is now I’m being called a conspiracy theorist because I dare to ask questions! Now, I ask my questions based on the comments of the only one person on this earth who actually knows for sure the source of the DNC   to Wikileaks. As far as I know, by the way, I’m the only member of the media who has interviewed Julian Assange multiple times on radio and right here on this TV show. During those interviews, he told me repeatedly Russia was not the source of the DNC   leaks  —   repeatedly. Now, we at this point  —   are we at a point in this country that I can’t ask a question without being called a liar, a conspiracy theorist? You know, and it’s also now gone to a whole other level that is very dangerous. Now my character is being assassinated. I’m being lied about, smeared and slandered. And the worst part is there are many on the left that are now working hard to get me fired, get me off the air. So this voice of ours on the show  —   I don’t force you to watch. I ask you to watch. I want you to watch  —   could no longer be heard. There is now a     campaign against me in this particular case to silence me by attacking my advertisers. Now, this is all put together by in part a   in part,   in part, group. Now, I want to tell you something. This is not hyperbole. What has been happening to me in the last week is a kill shot. They want this show canceled. They want me off the air. It’s also an attempt to silence the FOX News Channel and talk radio. Now, this has been a tactic that has been used against many other conservatives in the past with, honestly, a certain degree of success. And also note, talk radio, FOX News right now represents the only opposition voice, an existential threat to advance everything that the left wants to accomplish in the country. We’re the only opposition, and of course, all of you. Now, we saw what happened to Dr. Laura Schlesinger, Don Imus, Rush Limbaugh, Glenn Beck, and now it’s my head on the chopping block. Now, for the record, I am not and have never been a conspiracy theorist, and asking questions does not make a person a conspiracy theorist. I’m actually curious. And I want to get to the answers as certain families have said publicly they want answers. And by the way, they deserve them. Now, there are conspiracy theorists on TV today, like those that work at MSNBC and CNN and ABC, NBC, CBS. And then of course, we have all the unnamed sources, always in The New York Times, Washington Post, by the way, that are now being debunked regularly. We’ll have more on that in a minute. But first, this effort has really not gone far, and the reason is all of you out there in this audience. You have shown me all of your support, and it has been extremely humbling. And because of you, now, one of my advertisers, USAA, has come back on the show because you stood up for me, free speech and this program. You spoke out. Your voices have been heard. I am beyond thankful. I’m beyond appreciative. I’m beyond humbled. And I want to thank all of these advertisers for sticking with us, the vast, overwhelming majority that did. Only a few didn’t. And as I’ve said many times on this show, I am against boycotts because it’s only an effort to silence speech that other people don’t like. I said if you don’t like someone on TV, on radio  —   like for example, Stephen Colbert, Bill Maher and the horrific, crude, vile things they’ve said, you can turn the on and off switch off. You can change the dial. And the same goes with primetime conspiracy cable TV that is now, like,  . But this Clinton Soros group that is now going after me  —   they have been listing every one of my advertisers. Now, they’re they saying it’s not a boycott. Ostensibly, that’s not really true, in my opinion. Now, it’s gotten to the point where freedom of speech in this country and the continuation of voices like mine here on the FOX News Channel and on talk radio as we know it, as  —   is in real jeopardy. There’s a real risk here. And that brings us to where we are today. My next two guests, Brian Maloney and Melanie Morgan, have come up with a new group to finally fight back and combat all these attacks to silence conservatives. In the past, there’s not one  —   conservatives have never fought back. Now, they’re calling it the Media Equality Project. They’ve started an operation which they call, fight fire with fire. And they’re calling for people to, quote, “stop the conservative scalping. ” Stop the scalpings. And they’re not  —   by the way, they’re not calling for a boycott. They’re just doing what the   group is doing. They are calling for the left and the country that say they’re so for free speech to stop trying to silence conservatives. Now, Brian Maloney earlier today published an article entitled, “While Hannity remains under fire,   counterpart Rachel Maddow escapes scrutiny. ” Now, this report details the extensive history of the MSNBC host, Rachel Maddow. Frankly, it’s funny. I didn’t know about them quoting the most bizarre conspiracy theories, frankly, I’ve ever heard. Now, they’re doing the same thing now to Maddow that this     Clinton group, you know, who’s allegedly not calling for a boycott, is doing against me. This new group has listed the advertisers. They’re not calling for a boycott, and they are pointing out some of the most bizarre, conspiratorial, controversial things that have been said by Rachel Maddow. For example, let’s start with a few headlines courtesy of Newsbusters. Quote, “Maddow, Trump speech sees immigrants as vicious, murdering criminals. ” And then watch this. (BEGIN VIDEO CLIP) RACHEL MADDOW, MSNBC: It will be a notable thing that the president spent a big portion of what was, in effect, a state of the union trying to, you know, tell the country what vicious, murdering criminals immigrants are. And that’s focusing on crimes committed by immigrants  …     (END VIDEO CLIP) HANNITY: No, he actually said some (ph). And Maddow, you know, Trump’s speech could be a gateway drug for the KKK becoming mainstream in the GOP. Really? (BEGIN VIDEO CLIP) MADDOW: A lot of people who I think are critical of Donald Trump generally look at praise like that from somebody like Donald Duke and wonder if he is a gateway drug, if there is something beyond Donald Trump himself that means a much greater transformation of the Republican Party into something that is going to be new to mainstream politics. (END VIDEO CLIP) HANNITY: But there’s a lot more. Back in 2011, Maddow tried to explain away then Congressman  —   this is actually one of my favorite  —   Anthony Weiner’s graphic lewd tweet. Watch this. (BEGIN VIDEO CLIP) MADDOW: If the congressman was hacked, as he said he was, if he was pranked, how would that work? How could a person do that? What would that look like? The Daily Kos writer looks at the image of the congressman’s Twitter account more closely, and judging from the pixelization of the images and some other visual clues, he concludes that the damage (ph) was a composite, saved a number of times, indicating it had been Photoshopped. For a theory with fewer steps, a number of other blogs have different versions of a theory of a potential hacking that looks at the information embedded in this controversial picture. A third, but by no means final theory, has to do with the   service that I was talking about earlier, Whyfrog (ph). It’s not all that hard to generate a program that would try every possible combination using your Twitter name until you got the right   address to use the service to post pictures. (END VIDEO CLIP) HANNITY: No hacking can occur. Not this time. Then in 2013, in order to mitigate the role that radical Islam played in the Boston Marathon bombing, Maddow introduced several kind of bizarre conspiracy theories in this rather strange rant. Watch this. (BEGIN VIDEO CLIP) MADDOW: Pick your poison, right? I mean, it’s the Protocols of the Elders of Zion, which Tamerlan Tsarnaev also apparently had a nice copy of. It’s the Protocols of Zion, or it’s   truth, or it’s what Anwar al Awlaki sold (ph) to Nidal Malik Hasan, who’s now using that argument in his own defense down at Fort Bragg. It’s the Boston bombing was really carried out by the government, and   was really carried out by the government, and Waco and false flags and all the rest, right? Pick your poison. There’s always been an appeal to this necrotizing conspiracy theory radicalism. (END VIDEO CLIP) HANNITY: Now, of course, there was also that time that Maddow theorized that Republicans may be pushing assassinations as an actual political tactic. Wow! Watch this. (BEGIN VIDEO CLIP) MADDOW: Has enough kerosene been poured on the flames that the possibility of violence, even assassination is being posited as a real political tactic in the United States? (END VIDEO CLIP) HANNITY: Now, as I mentioned earlier, this is very important to me. Freedom of speech is. I’m against boycotts. I’ve stood up against them my entire career, even when Bill Maher was on ABC’s “Politically Correct. ” I applaud the fact that our next guests say, OK, if the left stops, they will stop. If the left starts to live up to their standard of freedom of speech, every voice should be heard and the viewers get to decide. Now, I got to tell you, I didn’t notice one single liberal cable host  —   by the way, Lanny Davis was the only one that stood up for me. One cable liberal host that said, Let Hannity say what he wants. Leave him alone, just like I defended  —   I would not be a part of a Stephen Colbert boycott or a Bill Maher boycott or any of these other show boycotts. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742628472.8961031}