{"duration": 0.06506586074829102, "input_args": {"text": "'Why the Left Loves the New Cold War Why the Left Loves the New Cold War By 0 134 \\nThe Clinton campaign’s full-scale effort to turn this election into a referendum on Vladimir Putin is causing liberals like Katrina vanden Heuvel, editor of The Nation , and Glenn Greenwald , the energizing force behind The Intercept , much heartburn. Here is Ms. van den Heuvel wondering what the heck is going on : \\n“How does new Cold War – which ends space for dissent, hurts women & children, may lead to nuclear war – help what Clinton claims she is for?” \\nAccording to both vanden Heuvel and Greenwald, the Clintonian assault on Russia – the crude, J. Edgar-Hooverish smear campaign conducted against WikiLeaks, Julian Assange, and especially Donald Trump – is an opportunistic deviation from “true” progressive values. It’s a corruption of American liberalism that has nothing to do with ideology and everything to do with winning the election. As Greenwald puts it , in answer to vanden Heuvel’s question: \\n“Exploiting Cold War rhetoric & tactics has helped her win the election. I guess the idea is: deal with the aftermath and fallout later.” \\nYet this evades what Mrs. Clinton and her supporters have clearly stated about the alleged immediacy and seriousness of the “threat” represented by Russia under Putin. \\nClinton has likened Putin to Hitler – and hasn’t that always been the prologue to a regime change operation by the United States? Remember that Saddam Hussein was supposed to be the Iraqi incarnation of Hitler . Yugoslav President Slobodan Milosevic was also another “ Hitler .” If we go back far enough, we can recall how George Herbert Walker Bush said that Manuel Noriega was “ worse than Hitler .” \\nInstant Access to Current Spot Prices & Interactive Charts \\nThe ideological underpinning of this nonsense is part and parcel of the American liberal canon, which valorizes World War II as the “good war” – a heroic struggle against fascism by the forces of progressivism and Goodness – which was only opposed by anti-Semitic cretins and Hitler apologists (a.k.a. “isolationist” conservatives). And it goes deeper than that, for progressivism is an ideology that seeks universal moral “uplift” – not only on the home front but on a global scale. \\nWoodrow Wilson’s argument for getting us into World War I – arguably the most futile and unjustifiable conflict ever to be engaged in by the United States – was that it was a “war to end all wars,” a struggle to bring the benefits of democracy and national self-determination to the long-suffering peoples of the world. And this was echoed by the collectivist intellectuals who provided the amen corner for Wilson’s war. One such cheerleader was the philosopher John Dewey, who hailed the war as the beginning of the end of laissez-faire because “private property had already lost its sanctity” and “industrial democracy is on the way.” The revered avatar of American liberalism, Walter Lippmann, in a speech uttered as America was entering the war, enthused: \\n“We who have gone to war to insure democracy in the world will have raised an aspiration here that will not end with the overthrow of the Prussian autocracy. We shall turn with fresh interests to our own tyrannies — to our Colorado mines, our autocratic steel industries, sweatshops, and our slums. A force is loose in America. Our own reactionaries will not assuage it. We shall know how to deal with them.” \\nTied in to the campaign for progressive “reform” was a religious factor: the postmillennial pietist movement that swept the country in the late nineteenth and early twentieth century. Stamping out “sin” and stamping out the alleged evils of capitalism were sentiments inextricably intertwined: thus we saw the advent of the “ Social Gospel .” The Prohibitionist movement was a key source of the early progressive movement. Yet as the educated classes – the political class – shed the remnants of religious belief, their determination to stamp out “sin” was hardly extinguished: it just took on new, secularized forms. \\nThe modern definition of “vice” was shifted to conform to the new religion of political correctness: instead of drunkenness, prostitution, and other avenues of self-gratification, the new vices have been redefined as “racism,” “homophobia,” “xenophobia,” and all the rest of the “phobias” and “isms” denounced by Hillary Clinton in her infamous “basket of deplorables” speech . Indeed, her condemnation of Trump supporters as “irredeemable” is couched in the very language used by the old-time religionists who saw their political and social enemies as instruments of Satan headed straight for the lowest rungs of Hell. \\nAnd this messianic impulse to cleanse humanity of “sin” wasn’t limited to a single country, the United States: if the human race was going to be made ready for the Second Coming it first – according to the postmillennial pietists – had to undergo the reign of virtue for a thousand years. The Kingdom of God on earth – the entire earth – had to be established: then and only then would the redeemed by saved and ushered into Eternity, whilst the “irredeemables” would burn in hellfire forevermore.'"}, "time": 1742628482.2682314}