{"duration": 0.10773038864135742, "input_args": {"text": "'BERLIN  —   Chancellor Angela Merkel of Germany, under siege domestically but widely seen as a pillar of Western liberalism, announced on Sunday that she will seek a fourth term next year. Slightly hoarse but clearly determined after consulting leaders of her conservative Christian Democratic party, Ms. Merkel said the decision to seek a fourth term was “anything but trivial,” for her country, for her party and for herself. A scientist with a   manner, Ms. Merkel rejected the idea that, after the election of Donald J. Trump as president in the United States, she had a lone role in keeping Western liberalism alive. “That is grotesque, even almost absurd,” she told reporters. But she also said that the campaign ahead of the German elections in fall 2017 would be unlike any other she has fought in an increasingly polarized country. She faces stronger challenges on the right and left, while the war in Syria, the arrival of large numbers of migrants and the continuing euro crisis tear at Germany and place new demands on its people. Since the election in the United States, speculation had mounted that Ms. Merkel would bow to pressure to run again and uphold liberal values in a world transformed by Mr. Trump’s victory and Britain’s vote last summer to leave the European Union. Ms. Merkel, 62, has served 11 years as chancellor. She is the first woman and the first person raised in Communist East Germany to hold the post. Since coming to power in 2005, Ms. Merkel has gradually acquired a political stature commensurate with the power of her country, Western Europe’s largest economy and its most populous nation, with about 81 million inhabitants. But her image as the cautious caretaker of her country’s interests has suffered over the past year, after she opened Germany to hundreds of thousands of asylum seekers, many of them Muslim refugees fleeing wars in the Middle East and Africa. The prospect of integrating almost 1 million newcomers into Germany has weakened Ms. Merkel’s standing at home, despite garnering some praise, particularly from President Obama. Visiting Berlin last week, Mr. Obama lavished compliments on his   ally in his eight years in office, saying that if he were German, he would vote for her. Ms. Merkel responded to the election of Mr. Trump with a robust appeal for him to follow Western values and respect human dignity. This, she said, was the basis of any close cooperation. Even as commentators and leaders outside Germany invoked her stature, Ms. Merkel has been eager not to hog the limelight. “One person alone can never solve everything,” she said on Friday at a news conference with Prime Minister Mariano Rajoy of Spain. “We are strong only together. In that, I want to do what my duty is as chancellor. ” In the days before her party leadership met on Sunday, several Christian Democrats said that the next parliamentary elections would be difficult to win with Ms. Merkel, but impossible to win without her. As she entered the atrium of her party headquarters on Sunday, she was applauded by about two dozen people on a   balcony. While Ms. Merkel mentioned several times that her ability to continue would be contingent on good health, she showed little weariness and gradually became almost feisty as she outlined the challenges to German industry and citizens in the 21st century. Germans should stick to their tried and tested concept of “social market economy,” a blend of welfare state and capitalism, as they navigate this new world, Ms. Merkel said. But she acknowledged that even in this conservative and comparatively wealthy country, politics has been thrown into turmoil by the rise of the populist,   Alternative for Germany party. It is now in 10 of the country’s 16 state Parliaments and seems certain to win seats in the federal Parliament next year. That would scramble conventional coalition building, since no mainstream party has been willing to govern with the populists. Frauke Petry, one of the leaders of Alternative for Germany, criticized the idea of Ms. Merkel’s gaining another four years in office. “Germany cannot afford another term for Angela Merkel,” Ms. Petry wrote on Twitter. Ms. Merkel’s role as a beacon of liberal values may also be dented by the power of populism elsewhere in Europe, whose union has been thrown into ever greater doubt since Britain, the Continent’s leading military power, voted in June to leave the European Union. Next month, Italy votes on constitutional reforms that Prime Minister Matteo Renzi considers crucial to his country’s modernity. Austria will choose a president in an election plagued by delays, and may see the first   politician elected as head of state in modern Europe. The Netherlands, France and Germany all hold pivotal elections next year, with the ballot in France being closely watched as a bellwether for the strength of populism as embodied by the National Front of Marine Le Pen. Speaking in Berlin last week, Prime Minister Manuel Valls of France predicted that “Europe can die” as a result of the populist wave and the economic and political dissonance in the   European Union. Ms. Merkel has guided Germany and, increasingly, Europe though myriad crises. She was chancellor during the 2008 financial crisis, and was much criticized for German insistence on austerity during the Greek debt crisis and the subsequent pressure on the euro. Since Russia flexed its military muscle by seizing Crimea and meddling in Ukraine in 2014, Ms. Merkel has been the main Western interlocutor to President Vladimir V. Putin. Ms. Merkel has also led her country in abandoning nuclear power, and has moved her conservative party firmly to the center on social policy. Her personal ratings peaked in 2014 at over 80 percent, when she was handling the Ukraine crisis, according to the Süddeutsche Zeitung’s compilation of readings on the Politbarometer poll since she took office. On that scale, her lowest score was 50 percent in late 2010, when Germany joined European efforts to avert a bankruptcy by Greece.'"}, "time": 1742564606.4681413}