{"duration": 0.05012679100036621, "input_args": {"text": "\"(Mr Smith): You know Mr Main I don't respond very well if people start to pull on my strings... (The Main): ... and still... here you are Mr Smith. (Mr Smith): Indeed ! (The Main): Poor Mr Smith , doesn't know which pill swallow... doesn't he ? (Mr Smith): You weren't completely honest with me Mr Main. I don't like dishonest people dear Mr Main and I certainly want a dishonest person to become my boss. (The Main): So just follow the rules dear Mr Smith. Forget about the letter have some fun some sex and Die of boredom like the rest of the controllers. (Mr Smith): People that talk about rules are very dangerous people my father used to say. (The Main): your father was a wise man. (The Main): Tell me do you like dangerous Mr Smith ? (Mr Smith): Hyperborea... (The Main): I consider that a yes , Applause for you. You've been investigating haven't you? (The Main): Oh I really start to like you Dear young Mr Smith. (Mr Smith,agitated): 58 Billion death , Genocide !, an entire sentient species !!. Sir You're a monster nothing more !!! (The Main,voice calm): ...And yet here you are (Mr Smith): Just the Truth nothing more.... Convince me that you're worth it. (The Main): Oh dear Mr smith I'm worth it. But the truth has to be deserved.... I admit Hyperborea was an mistake that shouldn't be made. (Mr Smith): The truth...Just tell me why... (The Main): Mistakes dear Mr Smith... We have made a lot of mistakes. (Mr Smith,loud voice): don't you mean You made a lot of mistakes... Sir ! (finger pointing). (Mr Smith,loud voice ): Don't blame it on the minor controllers , YOU were the main controller and YOU made a lot of mistakes. (The Main,soft voice): OK OK , Indeed I made a lot of mistakes. I tried to create Heaven and ended up with Hell , it was Hubris at it's finest ! (Mr Smith): .... (The Main): You know what the opposite of love is dear Mr Smith ? (Mr Smith): .... (The Main,crescendo voice): It's isn't hate it is Too much love. I loved too much ! If you want to condemn me condemn me for too much love and not for Genocide. Yes yes I killed 58biljon beautiful people but the source of my demise the one and only real source Mr Smith was ... too much love!! (Silence) (The Main,emotional):It was a beautiful Soul pure as our precious aether. I was obsessed with it. I started it to follow into it's myriad of incarnations. As the Eons went by I saw how the Hyperboreans those beautiful people that I had created started colonize the 5 th planet of sol ,Tia-mat Eons later they even colonized the 3th planet now known as Earth. Their empire grew. Beautiful people that had no hate in their hearth. Yes I was responsible for they extinction by making the greatest mistake a Controller could make... Do you know what that is Mr Smith ? (Mr Smith): .... (The Main,soft-voice): I Entered The simulation. edit on 10272016 by frenchfries because: (no reason given)\""}, "time": 1742562319.8134086}