{"duration": 0.03778362274169922, "input_args": {"text": "'Arnold Schwarzenegger called for a “grassroots revolution” to continue the battle against global warming after President Donald Trump announced Thursday that the United States would withdraw from the Paris Climate Agreement. [In a video posted Thursday via ATTN, a Los   media company, the actor and former California governor urged citizens and elected officials to “rise up” and save Planet Earth.  “One man cannot destroy our progress, one man can’t stop our clean energy revolution, one man can’t go back in time. Only I can do that,” Schwarzenegger said. “Like all the great movements in human history, our clean future starts with a grassroots movement in our communities, our cities and our states,” he said. “We can’t leave it to Washington to lead. We need to do it ourselves. ” “You see, the people will rise up,” the Terminator star said, adding that “local and state governments will rise up   …     and fill the void you are creating. We need to do it ourselves. ” BREAKING: Arnold Schwarzenegger has a blunt message for Donald Trump. #ParisAgreement pic. twitter.   —   ATTN: (@attn) June 2, 2017,  President Trump fulfilled a major campaign promise Thursday when he announced America’s withdrawal from the Paris Climate Agreement in a speech delivered in the White House Rose Garden. “In order to fulfill my solemn duty to protect America and its citizens, the United States will withdraw from the Paris Climate Accord,” Trump declared. “We will see if we can make a deal that’s fair. And if we can, that’s great. And if we can’t, that’s fine. ” Trump’s landmark decision had no shortage of detractors, as it was blasted by   celebrities, liberal lawmakers, and former president Barack Obama, who signed the agreement in April 2016. Schwarzenegger has spent several months leading an   campaign and denouncing the president’s agenda. He even recently offered to switch jobs with Trump “so people can finally sleep comfortably again. ” In April, the actor pushed the idea that Ohio Gov. John Kasich should run for president again in 2020 and challenge Trump in the Republican primary.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742561730.5088482}