{"duration": 0.0688326358795166, "input_args": {"text": "'We Are Change \\nDonald Trump on Saturday was quickly ushered off the stage by Secret Service agents in the middle of a campaign speech in Nevada after an incident in the crowd near the front of the stage. The incident turned out to be a false alarm that spurred the arena into chaos.\\nSecret Service rushes Trump off stage at Reno rally https://t.co/n82d9jXopX \\n— Chrissy (@omgitsmechrissy) November 6, 2016 \\nVideo shows that Trump was in the middle of his speech when the incident occurred. He was looking into the crowd, his hand over his eyes to block the glare from the stage lights, when Secret Service agents grabbed him and escorted him off the stage. Trump ducked his head as he left the stage. The crowd panicked with frightened looks on their faces, as the Secret Service and police tactical units rushed in to quickly arrest the man. Video on twitter shows the moment that the Secret Service and law enforcement took down the man. Got footage of man who was detained by police and Secret Service after @realDonaldTrump was rushed off stage by USSS agents pic.twitter.com/FVEieSYj5w \\n— Jeremy Diamond (@JDiamond1) November 6, 2016 \\nEarly reports suggested a man now known to be Austyn Crites, 33 was potentially armed in the crowd according to some witnesses. Those reports have since been retracted the man was found to unarmed besides with a “republicans against Trump” sign. No weapon found at Reno event where Donald Trump was rushed off stage, senior law enforcement official says – NBC https://t.co/LZffgsYes8 \\n— Breaking News (@BreakingNews) November 6, 2016 \\nOne witness said that they were in the crowd when an unknown guy creeped toward the stage staring at Trump. The witness then proceeded to get the attention of four bigger guys surrounding them and confronted the man. The man then freaked out and reached into his pocket to grab what looked like a gun.” According to the witness the man was mumbling about “the delegates.” “ I was in the crowd, me and my dad saw a guy creeping toward the stage staring at trump. i got the attention of 4 big guys around me and we confronted him and when we did he spurged out and reached into his pocket to grab what looked like a gun. when we tackled him to the ground and between punches he kept saying something about “the delegates”? he must have the delegates. sorry i’m pretty shaken up right now. “ With one person in the crowd shouting “he’s got a gun.” The man was then detained by police officers, Secret Service agents and SWAT armed with assault rifles and taken to a side room for questioning. The man is seen below bei Trump returned to the stage minutes later and proceeded to continue his speech before thanking the Secret Service and police. “Nobody said it was going to be easy for us, but we will never be stopped. We will never be stopped. I want to thank the Secret Service. These guys are fantastic.” \\n~Donald Trump, said.\\nhttps://twitter.com/kellyannepolls/status/795070994956374016\\nLuke broke down the early details in the video below. Austyn has since been exonerated and posted to Facebook the following statement.\\n\\n \\nThe post False Alarm Causes Chaos At Donald Trump Rally In Nevada appeared first on We Are Change .\\n'"}, "time": 1742563930.6979537}