{"duration": 0.11361169815063477, "input_args": {"text": "'Hvordan stemme nei til kjernefysiske våpen? av Manlio Dinucci USA har nettopp forkastet et forslag fra sine allierte i FNs Generalforsamlings første komite som arbeider for å fullstendig fjerne kjernefysiske våpen. Imidlertid kan de statene som huser USAs atombomber kreve at disse fjernes fra sitt territorium ved å vise til artikkel 2 i ikke-sprednings avtalen.\\nVoltaire Network | Roma (Italia) | 7 novembre 2016 français italiano English Español Türkçe «Mange takk, president Obama. Italia vil med stor besluttsomhet forfølge sin tilslutning til kjernefysisk sikkerhet», skrev statsminister Renzi i en historisk twitter. Seks måneder seinere, i FN, stemte Renzi JA til kjernefysiske våpen. Ved sin tilknytning til USA stilte den italienske regjeringen opp sammen med USA mot resolusjonen som ble støttet av det store flertallet i FNs generalforsamlings første komité. Den sa at det skulle innkalles til en FN-konferanse i 2017 for å «forhandle frem et lovlig bindende instrument for å forby kjernefysiske våpen og føre frem mot en fullstendig eliminering av disse.\\nDermed gikk den italienske regjeringen tilbake på det den hadde lovet to år tidligere under Wien-konvensjonen, da den støttet anti-atomvåpen bevegelsen i og med at den forsikret at den var villig til å arbeide for kjernefysisk nedrustning ved å innta rollen som tålmodig mellommann og ved hjelp av diplomati». Dermed blir appellen hul og uten innhold: «Vi krever total kjernefysisk nedrustning», noe som krevet at regjeringen sørget for «en sammenhengende oppfølging av engasjementet og kampen for å fjerne kjernefysiske våpen», i en «humanitær og legal reise mot kjernefysisk nedrustning» hvor Italia kunne spille «en mer aktiv rolle, «muligens (til og med) en ledende rolle.»\\nDet parlamentariske forlaget med den samme hensikten faller også som en konsekvens. Det er enkelt nok å bruke generelle vendinger i kravet om kjernefysisk nedrustning: Vi trenger bare å forholde oss til det faktum at USAs president har satt i gang en kjernefysisk gjenopprustning til en prislapp på 1000 milliarder dollar til tross for at han har fått Nobels fredspris for «sin visjon om en verden fri for kjernefysisk våpen».\\nDen spesielle måten Italia kan bidra til å nå målet om kjernefysisk nedrustning, forkynt i en FN-resolusjon, er å fjerne USAs kjernefysiske våpen fra landet vårt. For å klare dette, trenger vi ikke å appellere til regjeringen, men ( ganske enkelt) å be om at Ikke-spredning-avtale (NPT) respekteres, undertegnet og ratifisert av Italia, hvor det i artikkel 2 heter følgende:\\n«Hver stat som militært er ikke-kjernefysisk og som deltar i denne avtalen, går med på å ikke motta fra noen kjernefysiske våpen og eksplosive anretninger, direkte eller indirekte.»\\nVi må be om at Italia ikke overtrer NPT og må krevet at USA umiddelbart fjerner alle sine kjernefysiske våpen fra vårt territorium og ikke installerer de i de nye B61-12 bombene, som er et springrett for for USA/NATOs kjernefysiske eskalering overfor Russland, og heller ingen andre kjernefysiske våpen. Vi må kreve at treningen av italienske piloter i bruk av kjernefysiske våpen under USA-kommando, opphører.\\nDette er målet til kampanjen som er satt ut i livet av Komiteen « Ikke krig - Nei til NATO » og andre organisasjoner. Kampanjen oppnådde sitt første viktige mål den 26. oktober i regional-rådet i Toskana, hvor det ble vedtatt en uttalelse som «ber regjeringen å respektere ikke-spredningsavtalen for kjernefysiske våpen og for å sørge for at USA øyeblikkelig fjerner alle kjernefysiske våpen fra Italias territorium og avstår fra å installere (på italiensk jord) de nye B61-12 bombene og andre kjernefysiske våpen.»\\nGjennom dette og andre initiativ kan vi skape en omfattende front som med sterk mobilisering tvinger regjeringen til å respektere ikke-sprednings avtalen.\\nFor seks måneder siden ble det gjort henvendelser på sidene til Il Manifesto , på basis av NPT, om noen i Parlamentet kunne reise forslag om at USAs kjernefysiske våpen øyeblikkelig måtte fjernes fra Italia. Vi venter fortsatt på en reaksjon.\\nManlio Dinucci Oversettelse\\nKnut Lindtner\\nKilde\\nIl Manifesto (Italia)'"}, "time": 1742564394.9020433}