{"duration": 0.08260655403137207, "input_args": {"text": "\"Share on Facebook If you only see one astronomical event this year, make it the November supermoon, when the Moon will be the closest to Earth it's been since January 1948. During the event, which will happen on the eve of November 14, the Moon will appear up to 14 percent bigger and 30 percent brighter than an average full moon. This is the closest the Moon will get to Earth until 25 November 2034, so you really don't want to miss this one. So how do you get a Supermoon? As NASA explains , because the Moon has an elliptical orbit, one side – called the perigee – is about 48,280 km (30,000 miles) closer to Earth than the other side (the apogee). When the Sun, the Moon, and Earth line up as the Moon orbits Earth, that’s known as syzygy. (definitely you won't remember the word) When this Earth-Moon-Sun system occurs with the perigee side of the Moon facing us, and the Moon happens to be on the opposite side of Earth from the Sun, we get what's called a perigee-syzygy. That causes the Moon to appear much bigger and brighter in our sky than usual, and it's referred to as a Supermoon – or more technically, a perigee moon. Supermoons aren't all that uncommon – we just had one on October 16 , and after the November 14 super-supermoon , we'll have another one on December 14. But because the November 14 Moon becomes full within about 2 hours of perigee, it's going to look the biggest it has in nearly seven decades. “The full moon of November 14 is not only the closest full moon of 2016, but also the closest full moon to date in the 21st century,” says NASA. “The full moon won't come this close to Earth again until 25 November 2034.” Depending on where you're viewing it from, the difference between a Supermoon and a regular full moon can be stark, or difficult to tell. If the Moon is hanging high overhead, and you have no buildings or landmarks to compare it to, it can be tricky to tell that it's larger than usual. But if you're viewing from a spot where the Moon is sitting closer to the horizon, it can create what's known as ‘moon illusion’. “When the moon is near the horizon, it can look unnaturally large when viewed through trees, buildings, or other foreground objects,” says NASA. “The effect is an optical illusion, but that fact doesn't take away from the experience.” Here Are A Couple Of Incredible Supermoon Photos: The full moon silhouettes the statue of the Virgin Mary on top the University of Notre Dame's golden dome on Monday, Sept. 8, 2014, in South Bend, Ind. (AP Photo/South Bend Tribune, Robert Franklin) The Supermoon rises over houses in Olvera, in the southern Spanish province of Cadiz, July 12, 2014. Occurring when a full moon or new moon coincides with the closest approach the moon makes to the Earth, the Supermoon results in a larger-than-usual appearance of the lunar disk. (REUTERS/Jon Nazca) You'll have some awesome opportunities to take pictures with your phone overnight, but if you want to see it at its absolute biggest, it's expected to reach the peak of its full phase on the morning of November 14 at 8:52am EST (1352 GMT). For those of you in Australia, you'll need to wait until November 15 to see it, and the Moon will hit its full phase at 12:52am AEST. Here's A Taste Of What's To Come: Related:\""}, "time": 1742562616.786763}