{"duration": 0.11066150665283203, "input_args": {"text": "'Before breathing a sigh of relief that, unlike Western Europe, we don’t have Muslim rapists pouring into our country, recall that we have Mexican rapists pouring into our country. [Almost all peasant cultures are brimming with rapists, pederasts and child abusers. Latin America just happens to be the peasant culture closest to the United States, while the Muslims are closest to Europe.  According to North Carolinians for Immigration Reform and Enforcement, immigrants commit hundreds of sex crimes against children in North Carolina every month  —   350 in the month of April 2014, 299 in May, and more than 400 in August and September. More than 90 percent of the perpetrators are Hispanic. They aren’t even counting legal immigrants. Aren’t those worse? Only certain Republicans get excited about the difference between legal and illegal immigrants. The rest of America is trying to understand the point of the last 40 years of legal immigration. Why was this necessary? Below is a very short excerpt from a few days in November 2013. As Stalin is supposed to have said, sometimes quantity has a quality all its own.  —   Bundez, Jose, Juan (  ): Felony Sex Offense  —   Parental Role,  —     Jersson: Felony First Degree Sexual Offense Felony First Degree Rape Felony First Degree Kidnapping,  —   Aguilar, Rafael (  ): Felony Indecent Liberties With Child,  —   Aguilar, Rigoberto, Castellano (  ): Felony First Degree Rape Felony Indecent Liberties With Child Felony Stat   Offn Def&  =6yr Felony Indecent Liberties With Child 13. The list, for a single month in a single state, goes on in the same vein through 87 separate offenders. When not providing North Carolina meatpackers with cheap labor, immigrant workers seem to spend all their time raping little girls. To be fair, there are also Asian names, such as Y’Hon Nie (Indecent Liberties With Child, First Degree Sex   Second Degree Sexual Offense) and David Vo Minh (First Degree Sex   Indecent Liberties With Child). North Carolina’s cheap labor advocates better be paying Sen. Thom Tillis well. It sure isn’t the average North Carolinian demanding that he shill for amnesty. Illegal immigration alone costs North Carolina taxpayers billions of dollars per year. Our nation’s epitaph, with a photo of Sen. Tillis, could be: “We built a powerful economic engine that attracted people, but then some businessmen saw their chance to screw the country and make a pile for themselves. Let’s bring in   workers so we can externalize our costs to the taxpayer!” Except North Carolina’s businesses aren’t just externalizing their costs to the taxpayers. They’re externalizing their costs to little girls. The reason websites like North Carolinians for Immigration Reform and Enforcement are so important is that the government and the media hide immigrant crime from the public. They cite bogus studies that compare immigrants to America’s criminal class. (We didn’t want immigrants who are only slightly less criminal than our worst inner cities.) Or they announce their impressionistic conclusions. (I heard about a crime in Montana  —   that state must have a lot of crime, is not a scientific way to argue.) Or they refuse to count any criminal without an ICE detainer against him as an immigrant, at all. (Is the court translator a hint that the defendant isn’t a   American?) The way to determine how many immigrants are committing crime is to count them. Why does the government refuse to do this? The number of immigrants in prison would be a good start, but that’s only the tip of the iceberg. Immigrant criminals flee back to their own countries after arrest. Prosecutors deport illegals rather than imprison them  —   and then the illegals come right back. Some George   prosecutors allow illegals to plea guilty to some minor offense, to prevent them from being deported. To get the full picture, government investigators will need to talk to crime victims, police and prosecutors, too. And we want honesty  —   not studies that count anchor babies and   immigrants as “the native population. ” The media is the government’s   in hiding immigrant crime. I have approximately 1, 000 examples of media subterfuges on immigrant crime in Adios, America! The Left’s Plan to Turn Our Country Into a Third World Hellhole. Here are a few recent examples from Sen. Tillis’ North Carolina. Headline: “Burke County man convicted of raping    girl,” Charlotte Observer, Feb. 1, 2017 (Ricardo Solis Garcia  —   an illegal whom Mexico refused to take back) Headline: “Burlington man charged with child rape,” The Times News, Jan. 19, 2017 (Felipe Samuel Rivera Rodriguez) Headline: “Angier man accused of having sex with    girl,” The Fayetteville Observer, Aug. 29, 2016 (Estevan Roberto Silva). NOTE TO READERS: The North Carolina Estevan Roberto Silva  —   sex with a    girl  —   should not be confused with the Texas Esteban Villa Silva  —   sex with a    girl about 60 times  —   or the Alabama Esteban Silva Jr.  —      man convicted of sex with a    girl. All these child rapes were revealed in coded headlines like “Man pleads to sexual relationship with girl. ” Other informative North Carolina headlines: Headline: “Man, 42, arrested for sexual offense with girl under 13” (Carlos Gumercindo Crus) Headline: “Man charged with sexual assault of a minor” (Jose Freddy  ) Headline: Man Pleads Guilty in Child Rape Case (Luis  ). It’s too relentless to be a coincidence. There have been more stories in the American media about a rape by white lacrosse players that didn’t happen than about thousands of child rapes in North Carolina that did. I’m pretty sure our media is opposed to rape. But evidently, not as opposed as they are to America.'"}, "time": 1742562631.065567}