{"duration": 0.09923696517944336, "input_args": {"text": "'TEL AVIV  —   Instead of convening a summit on the ongoing civil war in Syria, or the migrant crisis threatening Europe, or the rampant   plaguing its own country, France on Sunday held a convention attended by over 70 nations to affirm the international community’s commitment to creating a Palestinian state. [At the end of the farcical display, and with neither Israel nor the Palestinian Authority in attendance, the Paris summit representatives released a brief concluding declaration unanimously agreed to after negotiations between the countries.  Reports here credited Israeli diplomats with helping to water down the   language of the final declaration, calling the text a “significant weakening” and “less harsh than was initially expected. ” Still, the text was anything but fair. Here are five   offenses in the   final declaration: 1  —   The text draws a moral equivalency between “violence,” which would include Palestinian terrorism targeting civilians, and “settlement activity,” meaning Israelis building homes in the West Bank or eastern sections of Jerusalem. The text states: They emphasized the importance for the parties to restate their commitment to this solution, to take urgent steps in order to reverse the current negative trends on the ground, including continued acts of violence and ongoing settlement activity, and to start meaningful direct negotiations. 2  —   The declaration calls for Israel to “fully end the occupation that began in 1967,” language that seems to mean that Israel would need to withdraw from the entire West Bank and eastern Jerusalem and thus shrink the country to indefensible borders. Those are the territories that Israel captured in the defensive war of 1967.  Withdrawing “fully” would seem to imply that Israel should evacuate those territories in their entirety. Some of the holiest sites in Judaism are located in eastern Jerusalem and the West Bank, including the Western Wall and Temple Mount in Jerusalem’s Old City the Cave of the Patriarchs and Matriarchs in Hebron, which was home to the oldest continuous Jewish community in the world until the Jews of Hebron were massacred and expelled the Tomb of Rachel in Bethlehem and Joseph’s Tomb in Nablus  —   biblical Shechem. The diplomats who convened in Paris, however, seem unaware of the text of United Nations Security Council Resolution 242, which today’s declaration affirms as the basis of a future   deal. After stating that Israel should “fully end the occupation that began in 1967,” the Paris declaration then references Resolution 242. The declaration states: They reiterated that a negotiated   solution should meet the legitimate aspirations of both sides, including the Palestinians’ right to statehood and sovereignty, fully end the occupation that began in 1967, satisfy Israel’s security needs and resolve all permanent status issues on the basis of United Nations Security Council resolutions 242 (1967) and 338 (1973) and also recalled relevant Security Council resolutions. Resolution 242 calls on Israel to withdraw under a future   solution “from territories occupied” as a result of the 1967 Six Day War. The resolution does not call for a withdrawal from “all territories,” a designation deliberately left out to ensure Israel’s ability to retain some territory for security purposes under a future deal. The Jewish Virtual Library explains: The Security Council did not say Israel must withdraw from “all the” territories occupied after the   War. This was quite deliberate. The Soviet delegate wanted the inclusion of those words and said that their exclusion meant “that part of these territories can remain in Israeli hands. ” The Arab states pushed for the word “all” to be included, but this was rejected. They nevertheless asserted that they would read the resolution as if it included the word “all. ” The British ambassador who drafted the approved resolution, Lord Caradon, declared after the vote: “It is only the resolution that will bind us, and we regard its wording as clear. ” 3  —    The declaration patronizes Israel by calling on both parties to “restate” their commitments to the   solution. Only one side has not been committed to peace. Israel has offered the Palestinians a state in much of the West Bank and Gaza Strip with a shared capital in Jerusalem numerous times. These offers were made at Camp David in 2000, Taba in 2001, the Annapolis Conference in 2007, and more offers were made in 2008. In each of these cases, the PA refused generous Israeli offers of statehood and bolted negotiations without counteroffers. The PA has failed to respond to Prime Minister Benjamin Netanyahu’s unprecedented attempts to   negotiations aimed at creating a Palestinian state, including freezing Jewish construction in the West Bank and eastern Jerusalem and releasing Palestinian prisoners. 4  —   The declaration gives credibility to the   Arab Peace Initiative, which threatens Israel’s security. The declaration states: “They underscored the importance of the Arab Peace Initiative of 2002 as a comprehensive framework for the resolution of the   conflict, thus contributing to regional peace and security,” states today’s declaration. This reporter previously exposed the Saudi “peace” initiative: The Saudi Initiative, originally proposed by Saudi Arabia in 2002, states that Israel would receive “normal relations” with the Arab world in exchange for a full withdrawal from the entire Gaza Strip, West Bank, Golan Heights and eastern Jerusalem, which includes the Temple Mount.   …     The Saudi plan also demands the imposition of a   U. N. resolution that calls for   Palestinian refugees who wish to move inside Israel to be permitted to do so at the “earliest practicable date. ” Palestinians have long demanded the “right of return” for millions of “refugees,” a formula Israeli officials across the political spectrum warn is code for Israel’s destruction by flooding the Jewish state with millions of Arabs, thereby changing its demographics. When Arab countries attacked the Jewish state after its creation in 1948, some 725, 000 Arabs living within Israel’s borders fled or were expelled from the area that became Israel. Also at that time, about 820, 000 Jews were expelled from Arab countries or fled following rampant persecution. While most Jewish refugees were absorbed by Israel and other countries, the majority of Palestinian Arabs have been maintained in 59 U. N.  camps that do not seek to settle its inhabitants elsewhere. There are currently about four million Arabs who claim Palestinian refugee status with the U. N. including children and grandchildren of the original fleeing Arabs Arabs living   in Jordan and Arabs who long ago emigrated throughout the Middle East and to the West. According to Arab sources close to the Saudi Initiative, Arab countries are willing to come to an agreement whereby Israel absorbs about 500, 000 “refugees” and reaches a compensation deal with the PA for the remaining millions of Palestinians. 5  —   The Paris declaration “welcomed” UN Security Council Resolution 2334, which passed last month when the U. S. abstained and refers to the entire West Bank and eastern Jerusalem as   occupied Palestinian territories while demanding a complete halt to all Israeli construction in those areas. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742562224.0660908}