{"duration": 0.1688251495361328, "input_args": {"text": "'• Hundreds of thousands of women gathered in Washington on Saturday in a kind of counterinauguration after President Trump took office on Friday. A range of speakers and performers cutting across generational lines rallied near the Capitol before marchers made their way toward the White House. • They were joined by crowds in cities across the country: In Chicago, the size of a rally so quickly outgrew early estimates that the march that was to follow was canceled for safety. In Manhattan, Fifth Avenue became a river of pink hats, while in downtown Los Angeles, even before the gathering crowd stretched itself out to march, it was more than a quarter mile deep on several streets. • Begun as a Facebook post just after the election, the march is the start of what organizers hope could be a sustained campaign of protest in a polarized America, unifying demonstrators around issues like reproductive rights, immigration and civil rights. The movement has also encountered divisions. • The Times had journalists covering the marches in Washington New York Boston Atlanta Denver Los Angeles Phoenix St. Paul and Key West, Fla. Check out what they posted on Twitter and what readers asked of them live. See photos from marches around the world, too. (All times listed below are local.) (Or watch video of the whole event.) • The singer and actress Janelle Monae highlighted the issue of police violence, leading the crowd in a chant of “Sandra Bland! Say her name!” a reference to the   case where a black woman died in police custody in Texas after being arrested in 2015. She then brought the microphone to each of the women in “Mothers of the Movement” who had joined her onstage. One by one, they joined in the chant, each inserting the name of her child who had died at the hands of the police. • The actress Ashley Judd delivered an uninhibited speech that ended with her referencing how Mr. Trump bragged, in a 2005 recording, that he could use his celebrity status to force himself on women, even groping their private parts. They “ain’t for grabbing,” she said. “They are for birthing new generations of filthy, vulgar, nasty, proud, Christian, Muslim, Buddhist, Sikh, you name it, for new generations of nasty women. ” • Gloria Steinem, the feminist icon of the 1960s and 1970s, told the women in the group to get to know one another more personally. “Make sure you introduce yourselves to each other and decide what we’re going to do tomorrow, and tomorrow and tomorrow,” she said. “We’re never turning back!” • “It’s been a   time to be both a woman and an immigrant in this country,” said the actress and activist America Ferrera. “But the president is not America. His cabinet is not America. Congress is not America. We are America! And we are here to stay. ” • After getting to the crowd to repeat a number to call Congress, the filmmaker Michael Moore urged people to run for office: “This is not the time for shy people! Shy people, you have two hours to get over it. ” • The actress Scarlett Johansson told a story about how she had visited a Planned Parenthood clinic in New York City after starting her acting career, and how a doctor there had treated her with compassion, “no judgment, no questions asked. ” “I feel that in the face of this current political climate, it is vital that we all make it our mission to get really, really personal,” she said. “President Trump, I did not vote for you,” she continued. “I want to be able to support you. But first I ask that you support me. Support my sister. Support my mother. Support my best friend and all of our girlfriends. ” Otherwise, Ms. Johansson said, her own daughter, “may potentially not have the right to make choices for her body and her future that your daughter Ivanka has been privileged to have. ” _____ Many participants believed that Mr. Trump expressed misogynistic views during the presidential campaign, with remarks about Megyn Kelly, Carly Fiorina and Hillary Clinton. After the 2005 recording surfaced, several women came forward to accuse Mr. Trump of inappropriate sexual conduct. He dismissed the recording as “locker room banter” and assailed his accusers. In a sly allusion to the crude remarks Mr. Trump made in the recording, many marchers, men and women alike, wore pink “pussyhats,” complete with cat ears. The hats are described on pussyhatproject. com as a way to “make a unique collective visual statement which will help activists be better heard. ” _____ Just after 10 a. m. Mr. Trump and his family headed in the opposite direction of the march in Washington for the National Prayer Service, an inaugural tradition, at the National Cathedral. When he spoke at C. I. A. headquarters in Langley, Va. in the midafternoon, he told his audience that they were his “No. 1 stop” on his first full day in office, because they were “really special amazing people. ” He also ruminated about how big the attendance had been at his inaugural speech, but he did not mention the large crowds of the women’s march, where demonstrators were challenging his administration on a number of policies, or even that the march was taking place as he was speaking. _____ Mrs. Clinton was not expected to attend the march in Washington, The Times reported on Friday, but her Twitter account sent a midmorning note anyway. _____ In a speech in Boston, Ms. Warren, a Democratic senator from Massachusetts, said fundamental freedoms, like abortion rights and gay marriage, could be at stake under Mr. Trump’s Supreme Court. “We can whimper, we can whine or we can fight back,” she said, as demonstrators in pink hats waved American flags. “Me, I’m here to fight back. ” “We believe in science,” Ms. Warren said, adding, “we know that climate change is real. ” A police officer patrolling the rally pumped his fists in agreement. “We also believe that immigration makes this country a stronger country,” Ms. Warren said. “We will not build a stupid wall and we will not tear millions of families apart. ” “You know, I could do this all day,” she added, to laughs and cheers. “But we gotta march. ” Jess Bidgood _____ Notable Signs: “Bend toward justice,” evokeing the work of the Rev. Dr. Martin Luther King Jr. “I’m ready to march again,” said Mr. Lewis, a Democratic representative of Georgia, who chaired the Student Nonviolent Coordinating Committee in the 1960s. “I’ve come here to say to you: Don’t let anybody, anybody, turn you around. ” Citing the demonstrations across the country, Mr. Lewis urged marchers, who flowed onto the street running near the Center for Civil and Human Rights, to “use this unity to organize” future political efforts. ”The next election, we must get out and vote like we never, ever voted before,” said Mr. Lewis, who was embroiled in a public clash with Mr. Trump recently. Alan Blinder _____ The crowds appeared to be huge in most places, with marchers in Washington, New York City and Chicago seeming to stretch to the horizons. Police departments, at times, decline to provide crowd estimates, and crowds are notoriously hard to estimate, even with a good satellite image. But some official and unofficial estimates have given a sense of the turnout. Attendance in New York City was more than 400, 000, according to Mayor Bill de Blasio’s office. The St. Paul police issued an official crowd count of 50, 000 to 60, 000 people. Attendance in Boston was 175, 000, according to Nicole Caravella, a spokeswoman for Mayor Martin J. Walsh. The Atlanta Police Department estimated about 60, 000 people attended a rally there. The Department of Public Safety in Phoenix estimated that some 20, 000 marched, while in Key West, Fla. a town of 25, 000, police said more than 2, 000 people marched. Organizers in Chicago estimated the crowd there at 250, 000, the Chicago Tribune said. The Office of Emergency Management and Communications there said late on Saturday morning that Grant Park, the sprawling area where the   had gathered, had been filled to capacity. Though the official march was canceled, many still chose to walk through downtown holding protest signs. Although the mayor’s office in Washington and organizers declined to provide an estimate of the size of the flagship march, The Associated Press reported that the District of Columbia’s homeland security director, Christopher Geldart, said it was safe to say the crowd at the march there was more than the 500, 000 that organizers told city officials to expect. “The crowd was so heavy, we didn’t know which way to go,” said Sabitha   a psychotherapist who traveled to Washington from Philadelphia with her    child, Sanji, and a friend, Pallavi Sreedhar. “We were squeezed, touching. ” (March organizers offered a worldwide tally for the 673 “sister” marches, but when asked, could not provide an explanation of how the tally had been calculated.) _____ Overheard Chant: “Yes we can” as people walked past the White House. As the sun set downtown, protesters made their way to the White House and assembled in small groups in a park just across from the building’s entrance. There in an area surrounded by temporary gates, people walked single file through one open entrance and one by one laid protest signs across gates set up for inauguration several hundred feet away from the White House. While the temporary gates made walking up to the building impossible, people stood shaking their heads in frustration. Fontella Garraway, a    retired Army veteran who drove three and half hours from her home in Rocky Mount, N. C. sat on a bench staring at the White House with a pin that read “girl power. ” “Even looking at the White House, it’s like I hope he’s looking out here at us,” she said of Mr. Trump. “I hope it’s penetrating to him that we mean business and we are serious. ” Moments later she lay a handwritten sign that read “Love trumps hate Hear our voice,” on the a fence facing the White House. ”That’s his inauguration gift,” she said. Yamiche Alcindor _____ Notable Chant: “Tell me what America looks like! This is what America looks like. ” Notable Sash: “65, 855, 610 votes for a woman,” worn by Sara Powell, 61, of Phoenix, and nine of her friends. Overheard: “My arms are tired. This is a good workout,” said Rima Borgogni, 50, owner of a Pilates studio in Sedona, Ariz. after holding a sign throughout the   march. Ellen Ferreira and her friends felt as if they were fighting for some of the same things they used to. They are mostly retired and many of them are veterans of past protests, including the March on Washington for Jobs and Freedom in 1963, when Dr. Martin Luther King Jr. delivered his “I Have a Dream” speech. “For our right to choose,” said Piya Jacob, 70, a retired elementary school principal. “For equality,” said Mary Helsaple, 67, an artist. “For healing justice,” said Gretchen Vorbeck, 72, who runs a nonprofit that buys grocery gift cards for public schoolteachers. Carol Decker, 70, a retired magazine publisher, jumped in and said, “We’re mad as hell and we’re not going to take it anymore. ” Fernanda Santos _____ Notable Chants: “We are the popular vote!” Notable Shirt: A blue shirt with “Make Sexism Wrong Again” in the same style as “Make America Great Again” campaign shirts. Just off 15th street, a block north of the parade’s official end point, a large flatbed float with big “TRUMP” letters arched along the back parked itself in the middle of the street, drawing the ire of the thousands of marchers, who berated the float with chants of “Shame!” and “We are the popular vote!” Police officers formed a barricade around the float with more than a   sidecar motorcycles. The six or so men and one woman on the float all took pictures of the protesters. Yet some of those who chanted to chase the float away weren’t surprised at its appearance at their march. “I mean the inauguration was yesterday,” said Chrissy Fiore, 39, of Washington, though she said it was “crazy that they made it down here and that now they’re getting police escorted out. ” Officers wouldn’t let reporters approach those on the float or those driving it, but a magnet on the side said “Trump Unity Bridge. ” As the float headed east to move away from the parade, Sheriff David A. Clarke Jr. of Milwaukee County, a Trump supporter, was seen walking along the sidewalk, taking in the scene but remaining silent. He did not respond to a reporter’s question about his opinion of the march or protest. Nick Corasaniti _____ Chant: “Don’t take away our ACA” and “Who’s the boss? We are!” Notable Signs: “Show us your taxes” “you can’t comb over sexism” “1459 days” and “build a bridge not a wall. ” Overheard: One woman speaking at the rally told the story of having an abortion when she was young, making the minimum wage and could not support a child. She said she was fighting for equal pay “not just for white women. ” At the rally in Mr. Trump’s hometown near Trump World Tower, elected officials and celebrities assailed the president. Signs in the crowd mocked his bouffant hair and the size of his hands. The actress Whoopi Goldberg said it would be the first of many protests against the president. “This is how people ended the war in Vietnam,” Ms. Goldberg told the cheering crowd. Grace Huezo, 20, a student at Hunter College, marched with her twin sister holding a “Nasty Woman” sign. She said she was there to defend women’s rights after she was appalled by Mr. Trump’s comments about grabbing women. “We’re here saying, no, people do not have permission to grab women without our permission,” she said. She said she was buoyed by the huge turnout and the camaraderie. “I’m hopeful to see so many people that are not giving up and they’re keeping their spirit,” she said. “We’re all just going to stick together over the next four years. ” Emma G. Fitzsimmons _____ Popular chant: “March! March! March!” Notable signs: “I won’t stop til it rains glass” “You can’t comb over misogyny” (accompanied by a drawing of Mr. Trump’s hair) “Flunk the Electoral College. ” Overheard: “I got to bring my high school punk rock out,” said Emily Hastings, 39, a woman from Denver wearing a black “eat the rich”   and carrying a “Don’t tread on women” sign. “Punk rock is all about resistance. ” The march began in a park at the center of the city with a group singing “You’ve got a friend. ” Marchers blanketed the park nestled between the   state capitol and city hall, hauling strollers, wearing pink hats and often hugging and kissing. Julie Turkewitz _____ Notable Sign: “Make America Compassionate Again,” and “I Love You” Thousands of demonstrators gathered on a drizzly morning clad in rain boots, ponchos and pink knit “pussyhats” to march to the Capitol. “What Trump has said is so based on exclusion and winning and being right versus taking care of everyone,” said Hilary James, 27, a musician from Minneapolis. “Even if he doesn’t listen to us, I feel it’s important to not sit back. ” Christina Capecchi _____ Notable Sign: Make America Think Again Gloria Cole, 66, had turned the protest into a family affair, traveling here with her wife, her daughter, her daughter’s boyfriend, and her brother and   . “I drew a line, it’s like, I’m an old woman  —   I’m not that old, I’m 66  —   I have to stand up for equal rights for everyone, for human rights,” Ms. Cole said. “We’re here, and we’re not going away. ” Aili Shaw, 14, held a white sign that read, “Our arms are tired from holding these signs since the 1920s. ” Ms. Shaw had traveled here, by train and car, with friends from her home in Coventry, R. I. “Women don’t have the rights they should,” she said. Jess Bidgood _____ Popular Chant: “Thank You. ” Women were chanting this to the organizers of the march as they kicked off the day’s events. Notable Clothing: At the corner of C and Third Southwest, many women (and some men) were wearing   “pussyhats” of all shades of pink. Organizers wanted to knit as many as one million hats for this event. People were also getting creative with the signs they carry. Alan and Alison Lewis drove in from Astoria with their    Grace. “You shouldn’t have to have a relationship to a woman to stand up for women,” Mr. Lewis said. “Equality and justice is enough of a reason to be here. ” Katie Rogers _____ Who She Is: Jessica Coleman, 56, of Stone Mountain, Ga. Backstory: A black retired teacher who used to show her daughter documentaries about black history and march with her daughter and church members during Martin Luther King holiday weekends. “I wanted them to know you can be a smart, intelligent black person. You don’t have to sag your pants and follow certain things that became media culture. I wanted them to know that people marched, bled and died for us to be able to vote and be able to go to college and have certain jobs. ” “You can really lose your sense of self if you don’t know where you’ve come from and you don’t have a vision of where you want to go. ” _____ Who She Is: Amber   34, of Bethesda, Md. is Ms. Coleman’s daughter Backstory: Works at a nonprofit focused on civic education “On the evening of election night, after saying, ‘Hey, I’m going to vote and I’m going to get my friends to vote,’ I sat on the sofa bawling trying to figure out what to say to my daughters the next morning because they went to bed certain that Hillary was going to win. ” “Marching is my way of putting my money where my mouth is as far as being an active citizen. ” “I want my daughters to have agency and have control over their bodies and feel comfortable in the country that they are in so this is my way of saying, ‘Hey everybody, I agree with all the people who are out here for different reasons and we don’t agree with what is happening right now and we are taking a stand. ’” _____ Who She Is: Garvey Mortley, 8, of Bethesda, Md. is Ms. Coleman’s granddaughter Backstory: Third grader was named after Marcus Garvey “I think it’s good to share the moment with them and help protest Donald Trump because we want to stand up for our rights because a long time ago, lots of women could not vote. Now we can vote and protest people and stuff. ” “If he affects the world in a bad way  —   like I have lots of friends from different countries and he could make them all move away   …     that makes me mad because all the people from the civil rights movement had a hard time trying to put us together. It’s like a puzzle, all these people came together, piece by piece, and now Donald Trump is coming over and just breaking those puzzle pieces. ”'"}, "time": 1742628495.2293766}