{"duration": 0.10399484634399414, "input_args": {"text": "'26. Oktober 2016 Julia Shevelkina Russia Beyond The Headlines organisierte auf der Buchmesse eine Filmvorführung und eine Lesung zu den Solowezki-Inseln. Quelle:RBTH Hölle und Paradies liegen auf dem Solowki-Archipel nah beieinander, wie der russische Schriftsteller Ewgenij Wodolazkin auf der Frankfurter Buchmesse erklärte. Dort stellte er nicht nur sein neues Buch vor, sondern auch die RBTH-Kurzfilmdokumentation „Das Gedächtnis der Solowezki-Inseln“. \\n„Viele leben gerne hier auf dem Solowki-Archipel. Der Sommer ist warm genug und der Winter ist kalt. Pilze und Beeren sprießen aus der Erde, Fische locken Angelfreunde und die Natur! Vor allem sie ist hier einfach atemberaubend.“ Ein schöner Ort eigentlich, wenn es nicht um die berühmt-berüchtigten Inseln im Weißen Meer ginge, wo sich zu Sowjetzeiten das erste große Häftlingslager befand, und nicht ein Mann spräche, der täglich Touristen hierhin bringt, um sie an die grausame Geschichte des Ortes zu erinnern. Der lange Weg auf die Solowezki-Inseln „Das Gedächtnis der Solowezki-Inseln“ heißt die Kurzfilmdokumentation , die das RBTH-Team vor einem Jahr drehte. Mit Foto- und Kameraequipment im Gepäck begaben sich junge Reporter damals auf eine lange Reise, sprachen mit Mönchen aus dem Solowezki-Kloster, fanden Gärtner, für die das Archipel ein gewöhnlicher Arbeitsort wie jeder andere ist, und besuchten das Fischerdorf Rebalda, wo seit Jahrzehnten Meerkohl gewonnen wird.\\nDer so entstandene Film wurde am vergangenen Samstag am russischen Stand der Frankfurter Buchmesse präsentiert. Die Einführung gab der russische Schriftsteller Evgenij Vodolazkin, der seinen neuen Roman „Aviator“ („Der Flieger“) vorstellte. In seinem Buch, das die vielschichtige Geschichte der Inseln thematisiert, lässt sich ein Häftling des Gulags 1932 im Rahmen eines Experiments einfrieren und überlebt so das Aufblühen und den Niedergang der Sowjetmacht. 1999 wird er entfrostet und fängt an, ein Tagebuch zu führen, in dem seine Erinnerungen an die Vergangenheit sich mit aktuellen Ereignissen verflechten. \\nEwgenij Wodolazkin präsentierte in Frankfurt die Kurzdokumentation von Russia Beyond The Headlines. / RBTH \\n„ Die Solowezki-Inseln spielen eine große Rolle in meinem Roman“, erzählte Vodolazkin dem anwesenden Publikum, „sie sind in gewisser Hinsicht stellvertretend für Russland zu betrachten.“ Einst habe es hier ein Klosterparadies gegeben, das später in die kommunistische Lagerhölle umgewandelt worden sei. „Zumindest dachte ich so, als ich vor fünf Jahren meine Arbeit an einem anderen Buch – den Erinnerungen der Menschen, die auf den Solowezki-Inseln einsaßen – begann. Aber dann stellte sich alles als wesentlich schwieriger heraus“, berichtete Vodolazkin. \\nDenn das Paradies in Reinform habe es auf Solowki nie gegeben. Schon 1667 bis 1676 sei der Archipel Schauplatz einer schrecklichen Periode der russischen Geschichte gewesen, als die Inseln von zaristischen Truppen besetzt waren. Diese Zeit nennt Vodolazkin eine schlimme Form der Barbarei. \\n„Und auch die Hölle war hier nie die Hölle in Reinform“, fügte der Autor hinzu. Sogar im Straflager habe es Beispiele für menschliche Größe gegeben. „Wenn Mönche, die dort lebten, Wärtern das Leben retteten, halfen sie damit eigentlich denjenigen, die ihnen Leid angetan haben“, erklärte Vodolazkin. \\nDie Kurzdokumentation von Russia Beyond The Headlines wurde auf der Buchmesse präsentiert. / RBTH \\nMit diesem einfachen Beispiel zeigte Vodolazkin, wie widersprüchlich die Geschichte der Solowezki-Inseln doch war, und tauchte mit dem Publikum ein in die Welt des Dokumentarfilms. An das Heilige des Ortes erinnert der Film mit Aufnahmen der hölzernen Kreuze und Kapellen. Die kleinen eisernen Grabsteine mit der lakonischen Inschrift „Zwei Personen“ bringen den Zuschauer jedoch schnell in die Gegenwart der Solschenizyn-Bücher zurück. „Die Inseln erinnern sich an alles, was hier passiert ist. Das spürt man“, sagt eine Offstimme am Ende des Films.'"}, "time": 1742563984.5740871}