{"duration": 0.09180712699890137, "input_args": {"text": "'In the early fall of 1923, when Adolf Hitler was still mostly known for his frenzied speeches at Munich beer halls, a slim biography was published that lauded him as the savior of the German nation and even compared him to Jesus. The book, “Adolf Hitler: His Life and His Speeches,” was credited to Baron Adolf Victor von Koerber, a German aristocrat and war hero. Scholars have said that Hitler sought Mr. von Koerber out for the biography because he needed a conservative figure without links to the Nazi Party to help legitimize him as a leader. However, new research says Hitler penned the work himself. This suggests that Hitler had designs on taking power earlier than many historians have previously thought and manipulated public opinion to get there. “Adolf Hitler: His Life and His Speeches” was published two years before “Mein Kampf,” the autobiography and manifesto that historians consider the moment Hitler went from political propagandist to leader in waiting. The von Koerber biography was published shortly before Hitler helped lead a bungled coup in Munich known as the Beer Hall Putsch. “It’s 1923, and Hitler suddenly decides he needs to boost his national profile,” said Thomas Weber, a professor of history and international affairs at the University of Aberdeen, in Scotland, who uncovered documents in Mr. von Koerber’s archival papers that he argues reveals Hitler as the biography’s true author. The documents included a sworn statement by the publisher’s widow. “He brings out a book in anticipation of revolution,” Professor Weber said in a Skype interview this week, “and we see here a political operator who understands the political process extremely well and knows how to produce a narrative for the kind of leader only he feels he can be. “So he does not have to expressly say, ‘I want to be leader.’ He creates the expectation that others will call him to become the leader. ” Professor Weber wrote a book expected to be published in English next year titled “Metamorphosis: How Adolf Hitler Became a Nazi. ” While researching it, he traveled to an archive in Johannesburg where Mr. von Koerber’s papers are stored. Sven Felix Kellerhoff, author of a recent book on “Mein Kampf” and a senior editor at the German newspaper Die Welt, welcomed Professor Weber’s findings. “I’m convinced from the presented sources that Hitler himself wrote this short text or gave at least the basic information to an editor,” Mr. Kellerhoff wrote in an email. “This is important because it shows that Hitler thought about himself as the ‘German savior’ as early as 1923. So I think this is a small but important advance in researching Hitler’s biography. ” Hitler counted on piggybacking to power via the conservative German elite because at the time, his Nazi Party was essentially a small sectarian group in Munich, a far cry from the political juggernaut it would become. Charles S. Maier, a professor of European and international history at Harvard University, said he found the new research “plausible and illuminating,” but not particularly sensational. “Koerber essentially became a type of ‘   author’ without acknowledging the sketch,” Professor Maier said in an email, referring to the biographical section of the book. “But surely this sort of coaching for political biographies must be relatively common in one form or another. ” The difference, Professor Maier argued, is that most subjects of ghostwritten memoirs want their own name on the text. Mr. von Koerber’s life took a variety of twists after the book was published. Like a number of his fellow conservative elites who initially supported Hitler, he became disillusioned and worked against Hitler’s rise. Mr. von Koerber was arrested on July 21, 1944, the day after an unsuccessful plot to assassinate Hitler. He spent the rest of the war in a Gestapo prison and then a concentration camp. He was also known to have passed on intelligence to the British. Mr. von Koerber had been virulently   in the 1920s, but his opinions and politics eventually shifted. He went from writing for conservative newspapers to liberal ones, including some owned by Hermann Ullstein, a Jewish newspaper tycoon and publisher. Papers reviewed by Professor Weber show that Mr. von Koerber even hid Mr. Ullstein in his home and helped him get to England. Mr. Ullstein eventually emigrated to New York, where he died in 1943. Mr. von Koerber died in Johannesburg in 1969.'"}, "time": 1742563504.8247066}