{"duration": 0.03325343132019043, "input_args": {"text": "'BuzzFeed is facing a lawsuit from a technology firm following its publication of an unverified dossier claiming President Donald Trump has close ties to the Russian government. [According to a report by McClatchy DC, XBT Holdings  —   a technology firm named in the dosser with Russian interests  —   is filing a defamation lawsuit against BuzzFeed, its    Ben Smith, as well as former British intelligence spy Christopher Steele, for the publication of what it describes as “libelous, unverified and untrue allegations. ”  “The dossier included libelous, unverified and untrue allegations regarding XBT, Webzilla and Gubarev. The lawsuits seek yet undetermined compensation for the damages suffered by XBT, Webzilla and Gubarev as the result of the publication of the dossier,” a statement from XBT read. “We were shocked to see our good name wrongly included and published in this unsubstantiated report. We are confident that the courts will review the evidence of our   and provide fair and reasonable compensation from the perpetrators of this outrageous allegation,” it continued. Some of the unverified claims included in the dossier were that Donald Trump had worked in collaboration with the Russian government in the hacking of DNC internal emails. as well as that Trump had participated in extremely graphic sexual fetishism in the Moscow  . The dossier also implicated the Russian technology entrepreneur Aleksej Gubarev as being heavily involved in the collaboration, without providing any evidence to substantiate the claim. BuzzFeed has since retracted his name from the dossier and apologized for its publication, although the lawsuit contends that it has left his “personal and professional reputation in tatters,” and presented a threat to his family’s safety. Much of the intelligence provided in the dossier came from the former British spy Christopher Steele, who was hired by Trump’s opponents in both the Democratic Party and the Republican Party to conduct research and investigate his past. Following its publication, Steele went into hiding. CNN also republished the claims, although they are not named in the lawsuit. Responding to the claims last month, Trump described the dossier as “fake news,” adding that BuzzFeed was “a failing pile of garbage. ” You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742563009.31739}