{"duration": 0.02393651008605957, "input_args": {"text": "'Russia, China, Japan & South Korea Planning Solar & Wind Energy Super Grid Nov 13, 2016 4 0 \\nThe world is making a wonderful step forward this latest news. Business people from Russia, China, Japan and South Korea met in September in Tokyo to sign a Memorandum of Understanding that seeks to create the Asia Super Grid. The grid will consist of wind and solar technologies and will distribute clean energy throughout the world. \\nAccording to SolarLove.com , the idea is dependent on development of an ultra-high voltage grid operating at more than 1,000 kilovolts AC and 800 kilovolts DC over thousands of kilometers. It envisions interconnecting grids across regions, nations, and even continents with a capacity of over 10 gigawatts. The Asian Super Grid. \\nThis idea came about as a solution to the devastating Fukushima nuclear fallout in 2011, thanks to Masayoshi Son. Masayoshi is the founder of the Internet business SoftBank Group and he created the Renewable Energy Institute after the Fukushima fallout. \\nHis idea was to tap into the massive amount of available wind and solar possibilities that could come from the Gobi Desert region in China, which is said to be equivalent to thousands of nuclear reactors. \\nHis big vision wasn’t supported by everyone though. “People said it was crazy, too grand a scheme…politically impossible.” \\nHowever, soon after announcing his dream and vision, the Korea Electric Power Company and the State Grid Corporation of China contacted him and showed tremendous interest. Shortly after that, the Russians joined with PSJC Rosseti expressing interest to collaborate on the project as well. \\nThe creation of this super grid will help areas like Southern Africa, Europe, East and Southeast Asia, as well as the four major countries involved in the project. \\nThough there have been political disputes between China and Japan especially, this project is being seen as a means to help usher in a new era of peace and prosperity throughout the Eastern hemisphere of our world. \\nThe project is underway and the group sees more projects like this continuing to pop up everywhere as the projected price efficiency of solar will be better than than fossil fuel energy by 2025, according to the groups calculations. \\nEarlier this year, the well known Bill Nye was on CNN and said in the interview that we could power the world entirely with renewable energy right now if we really wanted. Obviously, political and financial interests are in the way of the goal currently, but perhaps this new Super Grid will not only be a technological example, but a political example that nations can unite in peace and for the common good of the planet and all it’s inhabitants. \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and does health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information and other inspiring articles.'"}, "time": 1742628453.1955462}