{"duration": 0.04259610176086426, "input_args": {"text": "'On Sunday Syrian state media said rebels had used chemical weapons against government-controlled districts of Aleppo. \\n\\nRT reports: \\nScores of civilians, including several children, were killed while hundreds of others were wounded in “relentless and indiscriminate” attacks carried out by opposition groups in the western districts of Aleppo, according to the UN statement. \\n“Those who argue that this is meant to relieve the siege of eastern Aleppo should be reminded that nothing justifies the use of disproportionate, indiscriminate [attacks,] including heavy weapons on civilian areas and it could amount to war crimes,” de Mistura said. \\nHe echoed the condemnation voiced by the UN secretary-general regarding the attacks on schools. The special envoy also criticized the “use of heavy airpower on civilian areas.” \\n“The civilians of both sides of Aleppo have suffered enough due to futile but lethal attempts of subduing the city of Aleppo,” he said. “They now need and deserve a stable ceasefire covering this ancient city of Syria.” \\nEarlier on Sunday, state news agency SANA reported that “shells containing poison gases” had been fired at the residential district of al-Hamdaniya in western, government-held Aleppo. \\nRT Arabic’s crew in Aleppo reported 36 cases of suffocation. Al-Mayadeen reported that all the victims of the attack are civilians. \\nJust recently, the Russian Defense Ministry reported on a number of attacks in Aleppo that targeted schools and claimed the lives of at least three children in the period of 24 hours. Twelve more people died in an attack on a humanitarian aid corridor opened next to a school in the Al-Mashariq district, according to the ministry’s information. Twelve more people were injured. \\nMeanwhile, according to Russia’s Permanent Mission to the United Nations, over 16,000 people have fallen victim to opposition groups meant to be under US control. “From February to September, the opposition groups that are supposed to be under the US control committed 2,031 violations of the [cessation of hostilities], which claimed lives of 3,532 military personnel and 12,800 civilians,” the Mission’s statement, published on the website of the Russian Foreign Ministry, reads. \\nAccording to Dr. Said Sadek, professor of Political Sociology at the American University of Cairo, it’s not likely that Western powers and the Gulf states will end their backing for rebel groups, even if they are found responsible for using chemical weapons in Aleppo. “We have to understand that for six years, the Western countries and the Gulf states invested in those ‘moderate’ or radical groups, and so they cannot abandon them,” Sadek explained. “They cannot pull out now and say, ‘OK we discovered that we are wrong, let’s get out and leave them.’ They have invested in them and they will still use them for bargaining in the future of Syria.”'"}, "time": 1742562304.2563555}