{"duration": 0.06501936912536621, "input_args": {"text": "'Welcome to Our Picks, a guide to the best stuff to read, watch and listen to from around the internet. Check this space for the     article, the next great podcast for your commute, the   tweetstorm. And yes, we’re also tooting our own horn here. We’ll share can’  Times stories from the week and surface some gems you might have overlooked. We want to hear from you! Send us feedback about our selections to ourpicks@nytimes. com. •Lacoste and Izod share a closely linked history and a common reptilian logo. And in the world of men’s fashion, there’s a longstanding battle about which brand rightfully owns the privilege of stitching a crocodile onto a polo shirt. [Highsnobiety] • The world keeps changing: Schools in Boston have introduced the more accurate   projection maps to social studies classrooms around the city. [WBUR] • A 1951 profile in Reader’s Digest called him “Detective X,” a pseudonym for the forensic pioneer who specialized in dental records and handwriting analysis. Now, decades after his work on big cases like the Lindbergh baby kidnapping, we finally know the true identity of this “secret crime fighter. ” [National Geographic] • There’s a lot that Hollywood gets wrong. Toward the top of the list is its depiction of chess. [Atlas Obscura] • Terrence Malick hasn’t granted an    interview in decades, and TMZ calls him Hollywood’s Bigfoot. With so much we don’t know about the secretive director, one Texas Monthly writer decided to shed light on the filmmaker by charting his past and present in Austin  —   the city where he has deep roots and the setting for his latest movie, “Song to Song. ” [Texas Monthly] • Brian Wansink is a celebrated social scientist at Cornell who is a prolific researcher and makes frequent television appearances. Recently, a single blog post called into question the celebrity professor’s methodology and reputation. If you’re interested in how the “  credibility crisis in social science” happens, read on. [Chronicle of Higher Education] • Now that it’s officially spring, you could celebrate with homemade   iced coffee (as Sam Sifton recommends) follow these 12 florists to add some beautiful blooms to your Instagram feed, or read about the death and rebirth of the Duncan grapefruit. And go ahead  —   ignore the price tags and just drink the cheap, delicious wine. • Did you notice the byline on Monday’s crossword? It was a collaboration between the astrophysicist Dr. Neil deGrasse Tyson and Andrea Carla Michaels, part of the Crossword’s 75th anniversary celebration. • Rock ‘n’ roll pioneer Chuck Berry died on Saturday at age 90. He was the genre’s first true superstar (read an appraisal of his work) and also wrote its first great memoir. Here are 15 of his essential songs. Another legend, the New York City newspaper columnist Jimmy Breslin, also died this weekend. • John Donohue, a former New Yorker editor and cartoonist, is on an “intentionally hyperbolic” mission to sketch all the restaurants in New York. Here’s a map of what he’s drawn so far (including the Odeon, Cornelia Street Café, and the Good Fork). A selection of the prints are on display at Powerhouse on 8th, and you can contact Mr. Donohue if you have a place you’d like to see drawn. • The Sideways Dictionary is a site that explains complicated technological terms in    analogies. For instance, it explains how BitTorrent is like photocopying a book . .. and what WPA and the president’s motorcade have in common. [Sideways Dictionary via Imperica] Want Our Picks delivered to your inbox? Sign up for the What We’re Reading newsletter, a   email featuring great stories from around the web selected by members of The New York Times staff.'"}, "time": 1742562332.5713117}