{"duration": 0.06297850608825684, "input_args": {"text": "'In his Contract with the American Voter pledge, President Donald J. Trump, then the Republican nominee, promised to move America in the direction of becoming energy independent through a series of executive orders, actions, agency directives, and guidance. [Under the heading “Seven Actions to Protect American Workers” in the contract, Trump spelled out how he would advance that goal in his first 100 days in office, which concludes on Saturday.  “I will lift the restrictions on the production of $50 trillion dollars’ worth of   American energy reserves, including shale, oil, natural gas and clean coal,” Trump said. He also pledged to “lift the   roadblocks and allow vital energy infrastructure projects, like the Keystone Pipeline, to move forward. ” In a memorandum issued on January 24, 2017  —   four days after taking the oath of office  —   Trump put his seal of approval on the Keystone XL Pipeline that the Obama administration held up for years based on protests from climate change activists and some Native American tribes. On January 26, the State Department announced the Keystone construction could move forward: Acting on behalf of the president under delegated authorities in accordance with Executive Order 13337 and the January 24, 2017 Presidential Memorandum Regarding Construction of the Keystone XL Pipeline, the Under Secretary of State for Political Affairs determined that issuing a Presidential permit to Keystone to construct, connect, operate, and maintain at the border of the United States pipeline facilities for the import of crude oil from Canada to the United States as described in the Presidential permit application for the proposed Keystone XL pipeline project would serve the national interest. Accordingly, the request for a Presidential permit is approved: “A significant milestone for the Keystone XL project,” said Russ Girling, president CEO https:  .  #TimeToBuildKXL,  —   TransCanada (@TransCanada) March 24, 2017,  Also on January 24, Trump issued a memorandum on the Dakota Access pipeline in North Dakota, which Obama put on hold to appease protesters, including Native America tribes and allies who claimed environmental damage would result from the pipeline crossing under the Missouri River. But in the end, the people camping out on the land caused about $1 million in damage to the land that was repaired with American taxpayer dollars. “I believe that construction and operation of lawfully permitted pipeline infrastructure serve the national interest,” Trump said in the memorandum approving the final phase of construction for the Dakota Access pipeline. “We support the   and   direction President Trump has taken on energy with his approval of KXL, DAPL and his actions to streamline regulations,” Sabrina Fang, spokesperson for the American Petroleum Institute, told Breitbart News. “We look forward to working with this administration and Congress on   energy policies that will help ensure the United States continues to lead the world in the production and refining of oil and natural gas and in reducing carbon emissions. ” “With the right policies, we have a     opportunity to create more jobs, continue to help consumers, and improve the environment all at the same time,” Fang said. In February, Trump signed an executive order calling for the review of the Waters of the United States’ rule, part of the Clean Water Plan, which put restrictions on waters on private land, harming farming and ranching operations across the country. “Since its introduction in 2015, the rule has been greeted with frustration and litigation from many farming groups, including the Michigan Farm Bureau, which called the rule ‘a regulatory land grab of Biblical proportions,’” the Lansing State Journal reported. EPA administrator Scott Pruitt joined the president for the announcement of the executive order and issued this statement: EPA intends to immediately implement the Executive Order and submit a Notice to the Office of the Federal Register announcing our intent to review the 2015 Rule, and then to propose a new rule that will rescind or revise that rule. The President’s action today preserves a federal role in protecting water, but it also restores the states’ important role in the regulation of water. The rule, however, was already held up from implementation because of lawsuits filed by 13 states, but Trump’s order makes its implementation virtually impossible in the coming years. On March 28, surrounded by coal miners, Trump signed the “Promoting Energy Independence and Economic Growth” executive order. “My administration is putting an end to the war on coal,” Trump said in a speech prior to signing the executive order. In the order, Trump spells out his vision for America’s energy future: It is in the national interest to promote clean and safe development of our nation’s vast energy resources, while at the same time avoiding regulatory burdens that unnecessarily encumber energy production, constrain economic growth, and prevent job creation. Moreover, the prudent development of these natural resources is essential to ensuring the Nation’s geopolitical security. It is further in the national interest to ensure that the Nation’s electricity is affordable, reliable, safe, secure, and clean, and that it can be produced from coal, natural gas, nuclear material, flowing water, and other domestic sources, including renewable sources. Accordingly, it is the policy of the United States that executive departments and agencies (agencies) immediately review existing regulations that potentially burden the development or use of domestically produced energy resources and appropriately suspend, revise, or rescind those that unduly burden the development of domestic energy resources beyond the degree necessary to protect the public interest or otherwise comply with the law. In addressing coal in the sweeping order, Trump asked Ryan Zinke, secretary of the Interior Department, “to lift any and all moratoria on Federal land coal leasing activities related to Order 3338. The Secretary shall commence Federal coal leasing activities consistent with all applicable laws and regulations. ” The order also calls for review of restrictions on gas and oil production, including regulations on hydraulic fracturing. Trump took dead aim at the Obama administration’s climate change regulations, including ordering a review of the Clean Power Plan, Obama’s Climate Action Plan, and a slew of other actions taken during the past eight years. The order also called for the disbanding of the Interagency Working Group on Social Cost of Greenhouse Gases. “The action I’m taking eliminates federal overreach, restores economic freedom and allows our workers to thrive, compete and succeed on a level playing field for the first time in a long time,” Trump said about the order. “That’s what this is all about  —   bringing back our jobs, bringing back our dreams, and making America wealthy again,” Trump said. And in addition to the public executive orders and memorandums, a leaked working document from the Department of the Interior’s Bureau of Land Management (BLM) reveals how Trump wants to return the vast amount of land held by the federal government to allow not only recreation, hunting, and accessibility for law enforcement and the military, but for energy exploration, development, and production. “Several conservation and government watchdog groups say they’re concerned about the direction the Bureau of Land Management is headed after a draft list of agency priorities under the Trump administration surfaced this week,” Greenwire’s EE News reported. “The draft   ‘BLM Priority Work’ list, first reported on   …     by EE News, calls for the agency to focus on increasing energy development in suitable areas of the 245 million acres BLM manages (Greenwire, April 10),” EE News reported. The document is divided into five sections  —   “Making America Safe through Energy Independence,” “Making America Great Through Shared Conservation Stewardship,” “Making America Safe  —   Restoring Our Sovereignty,” “Getting America Back to Work,” and “Serving the American Family. ” “It also prioritizes streamlining unspecified ‘processes’ mandated by the National Environmental Policy Act (NEPA) as well as ‘land use planning to support energy and minerals development and other priorities,’ including ‘   processing for pipelines, transmission lines, and   projects,’” EE News reported.'"}, "time": 1742628593.4195693}