{"duration": 0.1811220645904541, "input_args": {"text": "'Email \\nWallonia is not alone. Not only has the region been joined by several other Belgian regional parliaments in opposition to CETA (the Canada-EU Comprehensive and Economic Trade Agreement), but now a Canadian constitutional challenge against CETA has been launched in the Federal Court of Canada. \\nOn Oct. 21, renowned constitutional lawyer Rocco Galati filed the statement of claim against CETA on behalf of the Hon. Paul Hellyer (former Minister of National Defence) and two co-plaintiffs, Ann Emmett and George Cromwell (members of the Committee on Monetary and Economic Reform). At the Oct. 25 press conference, Galati referred to the corporate sector as “the new royalty,” and he stated, “What this treaty does is literally revert us back to the divine right of kings, but they are multinational corporations now.” \\nGalati’s statement of claim argues that CETA is unconstitutional for several reasons, including the fact that it was never given Canadian Parliamentary approval, while “the treaty places the rights of private foreign investors over those of the Canadian Constitution and Canadian citizens.” \\nCritics on both sides of the Atlantic maintain that massive trade deals like CETA give far too much power to corporations at the expense of citizens and governments, especially through the investor-state dispute settlement (ISDS) mechanism – or the “investor court system” (ICS) as it was rebranded in CETA – that allows foreign corporations to sue governments (in a private court system) over policy decisions or regulations that harm their future profits. [1] Across the planet, national governments have been sued for billions of dollars by companies claiming “lost future profits” because of regulatory decisions. Walloons (and Europeans in general) have been consistently critical of ISDS tribunals for private arbitration. \\n“It’s ironic that everybody is dumping on the Walloons,” Galati told The Canadian Press in advance of his Oct. 25 press conference. “They have a very similar constitution to ours except they’re respecting theirs. So I don’t know why they’re being criticized for respecting their constitution.” [2] \\nBecause of continued opposition by Belgian regional governments, the scheduled Oct. 27 formal signing of CETA at a summit in Brussels was cancelled at the last moment on Oct. 26. Wallonia’s minister-president Paul Magnette has stated, “We are not against a treaty with Canada. But we won’t have one that jeopardizes social and environmental standards and the protection of public services and we want absolutely no private arbitration [ISDS] mechanisms.” [3] \\nGalati’s statement of claim similarly warns that various articles of CETA “over-ride Charter guarantees that ground Canada’s ability to mount public programs on Health, Education, Social Services and public utilities including the elimination of subsidies, monopolies, and state enterprises for the public welfare.” As Galati put it during the press conference, the only Canadian public services and entities protected in CETA are “tax collection, national security, and cultural industries,” he said. “Everything else is up for grabs” for privatization. As well, CETA encroaches on “exclusive Provincial spheres of jurisdiction” and “guts and extinguishes the constitutionally protected Judiciary in Canada by creating foreign tribunals” for ISDS arbitration. \\nThe Canadian Press asked International Trade Minister Chrystia Freeland whether CETA meets the requirements of Canada’s Constitution and she replied, “Absolutely.” At his press conference the following day, Galati said that “the Trade Minister’s elaborate response – ‘Absolutely’ – doesn’t cut it for me.” \\nGalati also referred to “residual Crown prerogative” – the belief that the Prime Minister of Canada can sign a treaty without Parliamentary debate and voting – and said, “The federal court has already decided that this notion is a serious question to be resolved.” \\nThe constitutionality of CETA is also being challenged in German courts. [4] \\nThe statement of claim gives the Canadian government 30 days to respond, and it also seeks interim injunctions to prevent the federal government from signing, ratifying and implementing CETA. \\nDuring the House of Commons question period on Oct. 26, Canadian Green Party Leader Elizabeth May asked Prime Minister Justin Trudeau if he was willing to change or jettison the controversial investor-protection section of CETA in order to save the trade deal. Trudeau declined, calling CETA “gold-plated,” and said, “We are confident that in the coming days we will see a positive outcome for this historic deal.” [5] Hours later, the Brussels summit was cancelled indefinitely. \\nTrudeau, Freeland, and Canadian foreign affairs minister Stephane Dion had been part of a delegation scheduled to meet with EU leaders Donald Tusk and Jean Claude Juncker yesterday, but the trip was cancelled as “crisis talks” in Belgium continue. [6] While some CETA proponents maintain that a new signing summit could happen within days, Magnette has also said, “This treaty affects the lives of 500 million Europeans and 35 million Canadians for years and years. We can take a few weeks, a few months to analyze the problems and overcome them.” [7] \\nFreeland’s Theatrics \\nMagnette’s statement raises the question of why the rush to approve CETA? The answer for many is that the longer the delay, the more people (especially in North America) will find out about the ISDS clauses and the actual contents of the massive trade deals similar to CETA – the TransPacific Partnership (TPP), the Transatlantic Trade and Investment Partnership (TTIP), the Trade in Services Agreement (TISA) – and as a result, shift their opinion about these deals. \\nIn other words, the rush to approve CETA isn’t really about the so-called “credibility” of the EU to sign an agreement, as Trade Minister Freeland and others maintain. The rush is about the undesirability of the deals themselves – which are unravelling as more people learn what’s in them. \\nOn Oct. 21, Freeland walked out of talks with Magnette and (“appearing to hold back tears”) told the waiting press that the EU is not capable of making an international agreement, “even with a country with European values such as Canada, even with a country as nice and patient as Canada.” [8] \\nBut as Canadian law professor (and former Member of Parliament) Craig Scott recently wrote, “In the last week, Freeland’s focus on her own disappointment and efforts has projected a sense of a noble mission fallen short due to Europe’s spurning of a country sharing its progressive values…Freeland, holding back tears, went so far as to castigate Europeans for failure to do a deal with ‘nice’ Canada. This is all very rich. Based on a European negotiator’s briefing to [New Democratic Party Members of Parliament] during CETA negotiations (the Harper government refused to brief MPs), it was Canada that insisted on some of the most regressive and dangerous provisions in CETA. The provisions in question were – and still are – the investor-state dispute settlement (ISDS) procedures.” [9] \\nFreeland and others like to call CETA and Canada “progressive,” but CETA was never voted on by Canada’s Parliament or by any provincial/territorial legislature. [10] \\nSo under the Harper Conservatives, we had a Canadian federal government that not only insisted on the ISDS provisions in CETA, but refused to brief Members of Parliament on the deal and neglected to have CETA debated and voted on in Parliament. This all happened while Justin Trudeau was leader of the federal Liberals, who Craig Scott says were “100 per cent” behind the deal, “as evidenced by the support Trudeau gave Harper back in the fall of 2013” by “fawning” over CETA’s prospects. [11] \\nScott warns about “the continuation of a Liberal-Conservative tag team pushing old-style [neoliberal] economics” and writes: “Have no doubt that the present Canadian government is keen to resist truly progressive revisions to CETA. Have no doubt that Liberals want to retain a flawed ISDS system that undermines the democratic sovereignty of countries – and one that sets the wrong example for future trade policy.” [12] \\nInvestor Lawsuits \\nThe year 2015 saw a record high of 70 new ISDS corporate lawsuits filed against countries under NAFTA and various bilateral treaties, raising concerns worldwide about ISDS and the ways corporations use it to bleed governments financially while putting a “chill” on any new regulations. Even if a government wins an ISDS lawsuit, it will have spent an average of $8 million in legal fees to defend itself. \\nTo date, the most thorough report on ISDS is called Profiting from Injustice, written by Pia Eberhardt of Corporate Europe Observatory (CEO) and Cecilia Olivet of the Transnational Institute. [13] They revealed that a “small club of international law firms, arbitrators and financial speculators are fueling an investment arbitration boom that is costing taxpayers billions of dollars and preventing legislation in the public interest” across the planet. They found a handful of legal firms “are actively encouraging corporate clients to sue governments” under investment treaties containing the ISDS clause, while “top arbitrators are using their influence to secure investor-friendly rules and sustain the flow of multi-million dollar lawsuits.” \\nAt the heart of this “secretive but burgeoning legal industry,” they found an “inner mafia” of fifteen arbitrators who (as of 2012) had decided on 55% of all known ISDS disputes – earning millions in fees for themselves and billions in ISDS settlements for their corporate clients. That “inner mafia” includes three Canada lawyers: Marc Lalonde, L. Yves Fortier, and Henry Alvarez; four American lawyers: Charles Brower, Stephen M. Schwebel, William W. Park, and Daniel Price; and eight other lawyers from France, Chile, Switzerland, Netherlands, Germany and Belgium. [14] \\nAfter CETA opponents in Europe roundly attacked the ISDS private court system, the trade deal’s investor-protection chapter was rewritten this past February. But a March 2016 report from CEO called the rewrite basically a PR re-branding exercise, giving ISDS a new name: the Investment Court System (ICS). Otherwise, “the proposed ‘new’ ICS is ISDS back from the dead,” Pia Eberhardt wrote in the report appropriately called The Zombie ISDS. [15] Under CETA’s rebranded ISDS, the three for-profit arbitrators (now to be called “judges”) who decide each case would be drawn from a pool of lawyers and would be paid US $3,000 per day, on top of a monthly retainer fee of 2,000 euros per month. As well, they can moonlight as lawyers with the same corporations launching the lawsuits. \\nThis conflict of interest is what the Walloons have been arguing against and resisting, noting that the so-called “Joint Interpretive Declaration” of Oct. 13 does not clarify the situation. Investment law professor Gus Van Harten agrees, informing The Canadian Press that “Such matters should be resolved and subject to discussion and debate well before relevant decision-makers are requested to approve CETA.” [16] But there are other highly controversial aspects of ISDS that are getting little, if any, press – for example, what’s called third-party funding of lawsuits. \\nISDS Gambling \\nProfiting from Injustice revealed that private investment funds have been speculating on ISDS court cases: lending money to companies so they can sue governments, and then taking a percentage of the final financial award. Such a gamble can be very lucrative: in a recent ISDS lawsuit, a national government was ordered to pay a whopping $50 billion to the claimant. \\nSo-called “third-party funders” have become a fast growing industry as corporations outsource financial risk to “litigation finance shops” who receive cash to gamble with. \\nProfiting from Injustice states, “Imagine a multinational company eager to sue a government on the basis of an international investment treaty. It is about to hire a top arbitration law firm as counsel. But the lawyers charge astronomical fees – more than the company is willing to pay. Fortunately for the company, an investment firm offers to invest in the case. It pays parts of the lawyers’ pay cheque in exchange for getting a share of the potential profits at the end. Welcome to the world of third-party funding…A world flush with monumental settlements and glaring opacity, a place where public treasuries are treated like ATMs by arbitral bodies and awards can be enforced globally – this is a world that third-party funders are particularly interested in…Banks, hedge funds and insurance companies also invest in international [ISDS] disputes.” [17] \\nObviously, this little-known world of ISDS litigation – where “public treasuries are treated like ATMs” – needs far more exposure. It operates within most of the trade deals currently being pushed across the planet. So not only are signatory countries losing their sovereignty to the corporate sector, they’re losing their shirts (as the saying goes). \\nWhile CETA would allow thousands of European companies to sue Canada under ISDS for “lost future profits,” some 42,000 U.S. multinationals that have branch-plants in Canada could similarly sue European governments through CETA – a kind of “backdoor” in case the equally controversial Transatlantic Trade and Investment Partnership (TTIP) between the U.S. and the EU collapses. This is another aspect of what the Walloons have been resisting in CETA. At Galati’s Oct. 25 press conference, court challenge plaintiff Paul Hellyer rightly called the trade deal “monstrously immoral.” \\nHigh Stakes \\nBut the stakes are even higher for Canada. As Rocco Galati explained, because of NAFTA “the U.S. and Mexico automatically get all the benefits of CETA that are not present in NAFTA,” while Canada would get no further benefits from those two countries. \\nThe Canadian constitutional challenge against CETA is bolstered by an Oct. 17 “Open Letter” by ten prominent Canadian academics to the Parliament of Wallonia and Belgium voters. They write: “…In Canada, our democracy has suffered because the federal government has insisted on pushing through agreements like the NAFTA and the CETA without legislative votes at the federal and provincial levels. As a result, and without the corresponding endorsements by our elected representatives, we have been left with a foreign investor protection system that binds all levels of government and that will bind all future elected governments in Canada for a very long time. Our experience hints at the dangers faced by European democracy in the case of the CETA….From what we can see, you have shown great courage in opposing the CETA and, based on our observations of how the foreign investor protection system has been pushed on Canadians over the years, we wish to express our support for your democratic choices.” [18] \\nDuring the press conference, Galati pointed to a stack of paper about three-feet tall on the conference table and identified it as the 1,600-page CETA text. “You’re supposed to read and understand this in your spare time,” he joked to those gathered. Fortunately for other Canadians, Galati has read the CETA text and – like the plaintiffs he represents: Paul Hellyer, Ann Emmett and George Cromwell – wants “democratic choices” beyond what Canadian tradition allows. The erosion of democracy is becoming that evident. \\nAs reports of a new CETA compromise in Belgium began to emerge on Oct. 27, the Council of Canadians issued a press release stating, “The democratic exercise that is taking place in Europe right now – where the Walloon government has looked at the text with its citizens, and asked for changes – needs to take place in Canada.” [19] That is exactly why Galati and the co-plaintiffs have filed their constitutional challenge. \\nFootnotes: \\n[1] Joyce Nelson, “Trudeau Bullying on Trade Deal,” Counterpunch.org, October 19, 2016. \\n[2] The Canadian Press, “Toronto lawyer files constitutional challenge against Canada-EU trade deal,” October 24, 2016. \\n[3] Reuters, “Wallonia leader rejects EU-Canada trade deal ultimatum,” October 24, 2016. \\n[4] The Canadian Press, op. cit. \\n[5] The Canadian Press, “Canadian delegation stays put as EU trade deal remains in limbo,” October 26, 2016. \\n[6] Jennifer Rankin, “Canadian PM cancels Brussels trip amid crisis talks to save trade deal,” The Guardian, October 27, 2016. \\n[7] Council of Canadians, “Canada-EU summit cancelled, CETA’s future unknown,” October 27, 2016. \\n[8] Marie-Danielle Smith (Financial Post), “Canada’s trade minister Chrystia Freeland walks out of EU trade talks on verge of tears,” Vancouver Sun, October 21, 2016. \\n[9] Craig Scott, “Don’t Be Fooled by Liberal Spin on CETA Deal,” The Tyee, October 24, 2016. \\n[10] Joyce Nelson, “CETA – No Lawyers Left Behind,” Watershed Sentinel, September-October, 2016. \\n[11] Scott, op. cit. \\n[12] Ibid. \\n[13] Pia Eberhardt and Cecillia Olivet, “Profiting from Injustice: How Law Firms, Arbitrators, and Financiers Are Fuelling an Investment Arbitration Boom,” Corporate Europe Observatory and Transnational Institute, 2012. \\n[14] Ibid. \\n[15] Pia Eberhardt, “The Zombie ISDS,” Corporate Europe Observatory, March 2016. \\n[16] Mike Blanchfield, “Amended CETA declaration not enough to win Walloon support: documents,” The Canadian Press, October 25, 2016. \\n[17] Eberhardt and Olivet, op. cit. \\n[18] David Boyd, et al., “An Open Letter to the Parliament of Wallonia and Belgian Voters on the Proposed CETA and Its Foreign Investor Protection System,” October 17, 2016. \\n[19] Council of Canadians, “CETA cheerleaders shouldn’t break out the bubbly just yet,” October 27, 2016.'"}, "time": 1742628480.780433}