{"duration": 0.18217754364013672, "input_args": {"text": "'Sometimes the Deep State isn’t so deep.  For something that’s supposed to be submerged, it doesn’t always hide very well.  [For example, veteran journalist Nick Denton was unabashedly candid about Deep State doings when he spoke to the South by Southwest conference in Austin, TX, on March 12:   The fact is, most of the liberal media is working to halt Trump.  They’re getting leaks from sympathetic bureaucrats in the federal bureaucracy, and they are acting as the opposition to Trump. Denton, of course, is best known as the former owner of Gawker, the   site that was on the losing end of a lawsuit filed by Hulk Hogan.  And yet before founding Gawker, Denton had worked at The Financial Times and dabbled in various   enterprises he knows his way around.   So if he says that the Main Stream Media and the bureaucracy are “working to halt Trump,” why not believe him?   To be sure, plenty of MSM journalists still stick to their omertà code —  or at least they try to.  Once such is David Remnick, editor of The New Yorker.  In a new piece, headlined, “There is No Deep State,” Remnick told readers that the issue is Trump, not his enemies.  As Remnick put it, “The problem in Washington is not a Deep State the problem is a shallow man. ” Okay, so that’s the official line: No Deep State here.   And yet then, in his very next sentences, Remnick, like his fellow journo Denton, spilled the beans. That is, he urged the Deep State to rise up against the Dreaded Trump: “Only if government officials take to heart their designation as ‘public servants’ will justice prevail. ”  Thus the unmistakable message to the “permanent government”: Get to work on getting rid of the 45th president. So now we can see a paradox that would be amusing, if it weren’t so scary: The Deep State thrives on secrecy —  most of its   activities are, after all, unethical, if not illegal —  and yet at the same time, journalists are a chatty bunch they aren’t secretive, they’re talkative.   They’re proud of what they’re doing, and, in the end, they don’t really care who knows it.   We should note that this paradoxical volubility is not just on the left.  Some chatterers on the right —  at least the Bush 43 alumni Establishment right —  seem just as determined to deny the Deep State, even as they seek to summon it to action.  One such is the fervently Never Trump Michael Gerson, who, after leaving the White House, became, interestingly enough, a columnist for The Washington Post.  In his March 13 column, Gerson dismissed the Deep State —  and then confirmed it.  First, the dismissal:   Trump’s allies, with the White House’s blessing, have alleged the existence of a “deep state,” conducting what talk radio host Mark Levin calls a “silent coup. ” We can note, above, Gerson’s use of the word “alleged. ” That is, the Deep State is only a figment of fevered imaginations.  And yet then, Gerson went on to say that the Deep State was not only real but, also, that he himself endorsed it.  As he wrote, if the Deep State refers to federal employees who are “unhappy” with Trump, “then many would gladly claim such citizenship. ”   To which Virgil might interject: Yes, Mr. Gerson, that is the point, exactly.  Many, perhaps most, federal employees actively dislike Trump, and, in their phobia, they have achieved a common consciousness.   Moreover, that common consciousness is often a predicate to action, mostly of the subterranean and stealthy kind.  Yet for his part, having conceded that the Deep State is, in fact, a real thing, Gerson tries to spin it another way —  it’s Trump’s fault. Quoth Gerson: “Trump does not face a coup, just a government he has attacked and refused to lead. ” Meanwhile, in the same Washington Post, every day, there appears a box, headlined “Share news tips with us confidentially” the link takes the   leaker to a page offering a choice of six different secure apps.  In other words, the Post is bidding a friendly welcome to sneaky federal employees who wish to dump on Trump.  (It’s worth noting that The New Yorker, too, features such a clandestine link, as do many other publications.) Thus we can see that the MSM is doing everything it can to encourage, aid, and abet Deep State operations.  And from its point of view, why not?   After all, the MSM is fully committed to stopping Trump, and so reporters might be saying to themselves, Who cares if a few norms get trampled, or even if a few laws get broken?  After all, everyone knows that reporters are effectively immune from prosecution, so what’s to lose?   A useful perspective on this MSM mindset comes from Nate Silver, the   analyst, formerly with The New York Times, now at FiveThirtyEight.  Silver himself is not exactly on the right, and yet he is detached enough to offer a clinical perspective.  And so in a March 10 piece, he described what we have all been witnessing as a “liberal media bubble. ”  He noted, for example, that just seven percent of journalists identify as Republicans.  In fact, he added, the concentration of power in the hands of the largest MSM outlets —  that is, those that are most   —  is actually increasing. One of these new media power brokers is MSNBC’s Rachel Maddow.  As Virgil noted on March 3, she is an eager   benefiting from the    assistance of the Department of Homeland Security.  (And, on Tuesday night, she released what’s allegedly Trump’s   return for one year, 2005.)  In the meantime, others within the MSM are eager to help her along.  Hence this March 13 story from the Associated Press: “Fueled by Trump opponents, Maddow’s popularity rises. ”  As the article explained, “Maddow has emerged as the favorite cable news host for presidential resistors in the opening days of the Trump administration,” noting that her audience has doubled in the last year.  Indeed, it’s evident that the left as a whole is finding a new kind of community in  .  The New York Times bannered this cheerleading headline on March 13: “For Solace and Solidarity in the Trump Age, Liberals Turn the TV Back On. ”  As the newspaper explained:   MSNBC, after flailing at the end of the Obama years, has edged CNN in prime time. Stephen Colbert’s openly   “Late Show” is beating Jimmy Fallon’s “Tonight” for the first time. Bill Maher’s HBO flock has grown nearly 50 percent since last year’s presidential primaries, and “The Daily Show” has registered its best ratings since Jon Stewart left in 2015.  Traditional television, a medium considered so last century, has watched audiences drift away for the better part of a decade.  Now rattled liberals are surging back, seeking catharsis, solidarity and relief. So we can see: Individual actors within the Deep State may have to operate in the shadows, but when they go home at night from a hard day of   activity, they can bask in the warm glow of lefty togetherness.   Of course, the Deep State offers other, more formal, rewards for meritorious  .  Notably, the media auxiliary to the Deep State is highly organized and full of prizes.  Just the other day, for example, we learned that the Norman Lear Center at the University of Southern California’s Annenberg School for Communication and Journalism has announced the winners of its 2017 Walter Cronkite Award for Excellence in Television Political Journalism.  The winners include CNN’s Jake Tapper, CNN’s “Reliable Sources” (the whole Brian Stelter show) NBC News’s Katy Tur, and Univision’s Jorge Ramos.  The honorees will receive their awards at the National Press Club in Washington, DC, on April 28.   If we step back and take a look, in this single item we can see many key components of the whole MSM   right there: big donors to liberal institutions (Lear, Annenberg) a prominent university (USC) a liberal icon (Cronkite)   journalists (Tapper, Stelter, Tur, Ramos) and an Establishment venue (the Press Club).  In other words, it’s more than a progressive trifecta, it’s a “ . ”  The message to Deep Staters is clear: If you leak to these journalists, you, too, can share in their   even if you yourself must remain in hiding —  at least until the next Democratic president.   Yes, it’s a powerful system we might dub it the Deep State Main Stream Media Complex.  Or, as the words might be rendered in   Washington, the DSMSMC.   Indeed, this Complex is so powerful that journalists and pundits can’t resist talking about it.  On the one hand, they like to deny that it exists, on the other hand, they like to flaunt it, because they feel more powerful in its presence.  So we can see: The Deep State silently overshadows just about everything else in Washington —  except, of course, that it’s not so silent.'"}, "time": 1742562178.9050355}