{"duration": 0.04774165153503418, "input_args": {"text": "'November 5, 2016 at 1:20 am \\nYou know…. \\nWhat amazes me, is that some Australian, can put a video up on YouTube, letting the world know that a woman, the next president’s right hand, is a Jihadi Muslim, hellbent on installing Sharia and wanting to see the end of western civilization, describing her life, her connections and very dangerous people and yet, the CIA & FBI, who are paid billions each year, can’t seem to find out the same? What does this tell me? Well, for starters, it doesn’t tell me that the FBI, CIA, NSA and goodness knows how many other Acronyms, supposedly defending America, are stupid and incompetent, on the contrary, quite the opposite. It tells me that the security services, are working in tandem with those who wish to destroy western civilization and have been lying to you from day one on everything. It’s somewhat amazing, when one thinks that your average American, who steals a bar of chocolate, out of a store, can be banged up for life in prison, if it’s their third offence and yet people like Clinton and Abedin, responsible for the deaths of hundreds of thousands and the barbaric murder of a foreign leader, not forgetting working with people who are no doubt planning the subjugation of the west, under Wahabism, are simply ignored by those, who are paid by taxpayers to not allow this to happen. \\nWhen are people going to wake up? Government IS and ALWAYS has been corrupt and nothing but a den of psychopathic prostitutes, who do the work of the highest bidder. The only way that the western people will ever rid themselves of these demons and of course their Jewish masters, it to smash the system completely and live under an anarchy, where the Jew, WILL NOT be able to build a complex security establishment to protect them. Off with their heads, the whole, damn, lot of them quite frankly. There no use to anyone and waste the oxygen they breathe.'"}, "time": 1742563534.2629328}