{"duration": 0.16094112396240234, "input_args": {"text": "'Edward Albee never expected or even wanted you to like his plays. “Like” is too pale and friendly a word for the   emotions he hoped to elicit. Rage and bewilderment, fear and loathing and that grand old Aristotelian couple, pity and terror: These were all welcome and entirely appropriate responses to have in the theater of Mr. Albee, one of the genuinely great dramatists of the last century, who died on Friday at 88. If you left one of his plays feeling good about yourself, then it would seem that Mr. Albee hadn’t done his job. But the real problem probably would have been that you hadn’t been paying attention. “You don’t listen,” as a character in one of his   plays kept saying to anyone who would  —   sorry, wouldn’t  —   listen. The challenge within that accusation rang through everything he wrote. That play, “Listening,” was the first work by Mr. Albee that I wrote about as a critic for The New York Times. First staged in 1977, it had been revived in New York in the fall of 1993 by the invaluable Signature Theater Company, created by James Houghton (who died in August) which was devoting a season to Mr. Albee’s more obscure work. By that time, New York critics and audiences had mostly turned their backs on Mr. Albee. It had been a decade since he had had new work produced in the city. And the feeling was that he belonged to an earlier, artier generation that took its provocative intellectual postures far too seriously. Sure, the consensus seemed to go, “Who’s Afraid of Virginia Woolf? ,” the marital boxing match of a play that had been made into a movie starring Elizabeth Taylor and Richard Burton, was great. But, be honest now, did anyone really understand such arcane plays as “Tiny Alice” and “The Lady From Dubuque,” with all their cryptic, cosmic talk? Being just another New York sheep, I had probably absorbed that perspective without even thinking about it. But as I left “Listening,” and its companion piece “Counting the Ways,” in 1993, I realized that my mind was still churning, in excitement and agitation and a bit of annoyance, in ways it seldom did at the end of any show. I wrote in The Times that I was certainly glad to be able to listen to Mr. Albee again. He in turn wrote me a crisp and courteous letter, saying it was refreshing to be treated fairly again. As it turned out, New York was more than willing to embrace Mr. Albee again. (O. K. maybe not embrace, since that implies huggability writing about Mr. Albee, the most exacting of semanticists, makes you question every word you use.) That same autumn of 1993 saw, in addition to the Signature season, the New York premiere (Off Broadway, at the Vineyard Theater) of Mr. Albee’s “Three Tall Women,” a portrait of the three ages of a rich and selfish suburbanite who was clearly modeled on the playwright’s adoptive mother. It became the   play of the season for people who no doubt included fashionable, captious,   Americans rather like its title character. It also won the Pulitzer Prize for drama. And so began one of the greatest second acts in any dramatist’s career. Soon, Mr. Albee would be back on Broadway again, first with an exquisite revival of his “A Delicate Balance” in 1996. Plays that had seemed annoying and obscure a couple of decades earlier, including “Tiny Alice” and “The Lady From Dubuque,” were reincarnated to illuminating effect. One of his new works, “The Goat, or Who is Sylvia?” which opened on Broadway in 2002, put to rest any notions that Mr. Albee might have started playing nice with his audiences. The titular animal was the love (and lust) object of the play’s anguished married hero, first portrayed by Bill Pullman. You can listen to Mr. Albee  —   in the “Last Words” interview I conducted with him some years ago  —   contentedly cataloging the different points in the production at which theatergoers walked out. He didn’t even mention the bit of dialogue that made me think, “No, surely he did not say that”  —   a description of a man dandling an infant on his lap and realizing to his distress that he had acquired an erection. In 2002, Mr. Albee was evidently still quite capable of making even jaded critics, who had done their time with the naked fornicators of fringe theater, squirm. But it is never just the shocking detail that unsettles with Mr. Albee. What’s most disturbing, always, is his insistence that our most primitive instincts keep asserting themselves in even the most civilized settings, like a Minotaur at a cocktail party, and usually they wrestle us to the ground. “Violence! Violence!” chants the mousy Honey, with a cheerleader’s delight, in “Who’s Afraid of Virginia Woolf?” And nasty eruptions of the impulse to hurt, and its frequent conflation with the sex drive, were always a part of the    with Mr. Albee. So was death, with and without a capital D, most pointedly in “All Over” and “The Lady From Dubuque,” but its shadow looms large in everything Mr. Albee wrote. That unsentimental insistence on our mortality may have been the biggest turnoff to New York theatergoers of the   century. Mr. Albee repeatedly dared to ask what most of us retire to the closets of our minds for as long as possible: the fact of our inevitable ends, and what it means for our tenuous  . I should say that few dramatists of the 20th and 21st centuries matched Mr. Albee as a spinner of filigree dialogue. It can hold its own with that of Wilde, Shaw, Coward and Stoppard. Mr. Albee loved words and wordplay  —   sometimes to the point of giddiness. But he also made it clear that he fully grasped the inadequacy of language as a means of staving off  —   never mind defining  —   the darkness that waited to claim his characters. Performing his work required, to borrow a title of his, a delicate balance. (“If I am sharp, it is because I am neither less nor more than human,” says Agnes in that play.) And one of the joys of my job as a theater critic has been watching performers, actresses in particular, discover that balance, with an appropriate mix of glee and bitterness, bravura and uncertainty. Kathleen Turner, Rosemary Harris, Uta Hagen, Marian Seldes and Elaine Stritch all created   performances in Albee works. I met Mr. Albee several times, socially and professionally. The first time, he pointed out that, like so many people, I had mispronounced his name. (“It’s   Ben, not  . ”) Generally, he was gentlemanly, polite, reserved and attentive, in a way I associate with a   era. There was power in his gaze, though, an assessing twinkle that you suspected might easily be fanned into a flame that could scorch. Once I saw him, for an interview, the day after I had attended a new play of his at the McCarter Theater in Princeton, N. J. I told Mr. Albee that my   nephew, whom I had taken to the show, had greatly enjoyed the production. “Good,” said Mr. Albee, who then paused and added, “I hope he didn’t enjoy it too much. ”'"}, "time": 1742562922.734117}