{"duration": 0.12006616592407227, "input_args": {"text": "'Wed, 26 Oct 2016 19:45 UTC © The Canary Leaked documents reveal that the Treasury now faces a £16bn financial black hole in our finances. But despite this, the government has promised to reimburse our super-rich Queen £1m for the money she\\'ll lose out on when leaving the EU. The leaked documents A series of leaked documents , posted on the government\\'s website in error , has revealed that the Treasury faces a black hole of up to £16bn this year. Due to a combination of poor economic decisions and increased levels of borrowing, this means that the UK\\'s deficit is well behind the 27% forecasted reduction rate. With the uncertainty of the global financial market, this black hole is only likely to increase. As The Canary previously reported , many global banks are again stockpiling gold. This is to secure their assets and ensure their currency can be backed up in case of an emergency. During Gordon Brown\\'s reign, however, the UK sold off the majority of its gold, meaning the UK\\'s currency isn\\'t supported by any assets. If a global financial crash were to come, this would prove devastating. The Queen Despite these dire circumstances, the government has promised to secure the Queen\\'s wealth and reimburse her for any losses which may occur after Brexit. The Queen, like many other aristocrats, benefits from the EU\\'s Common Agricultural Policy . Initially created in 1962 to help protect farmers against unstable crop prices, it has instead been helping the most wealthy and privileged. Every year, the UK\\'s richest landowners receive payouts, with the Queen bagging over £1m a year . Sandringham Estate receives close to £700,000 a year, while Windsor Castle receives £300,000. Prince Charles also benefits from the EU\\'s policy and gets £100,000 a year just for his estates. Since the announcement of the Brexit vote, the Conservative government has pledged [ paywall ] to pick up the subsidy bill at least until 2020. Sir Gerald Howarth, a former Conservative defence minister who backed Brexit, said : What we all said during the Leave campaign was that all those currently in receipt of so-called EU money will continue to receive the same money because we will be saving £20bn every year. We must reassure the recipients - whether it\\'s Her Majesty or farmers - that they will continue to benefit from the current arrangements. The Queen and the Treasury While money made from the Crown\\'s estates feeds back into the Treasury, the Queen and her family still benefit from a large profit. These estates, known as the \"Sovereign\\'s public estate\", are technically neither government property nor part of the monarch\\'s private estate. But the government still pays the Queen. On top of the Brexit reimbursement, the monarch is set to receive £42.8m from the Treasury between 2016-2017. This figure is £12m more than that in 2012 and means an extra £2.7m will be taken from the taxpayers\\' pocket. So while the Treasury faces a black hole six times the size of the NHS deficit , the government is continuing to spend the taxpayers\\' money to provide for a super-wealthy aristocrat. While many people may still support the Queen, it cannot be denied that the monarchy is losing its appeal. In a recent review , it was discovered that Chester Zoo, Stonehenge, and the Roman Baths are more successful tourist attractions than Windsor Castle. Alongside this, more and more republicans are calling for a referendum on abolishing the monarchy after the Queen dies. If the government continues to prioritise her over the needs of the British public, support for this cause may well increase.'"}, "time": 1742562054.0697834}