{"duration": 0.3370699882507324, "input_args": {"text": "'Andrea Tantaros, a former Fox News host, charged in a lawsuit filed Monday that top executives at the network, including the man who replaced Roger Ailes, punished her for complaining about sexual harassment by Mr. Ailes. The suit by Ms. Tantaros, filed in New York State Supreme Court in Manhattan, is the latest round in a contentious volley that began in late winter, when Fox claimed she had breached her employment contract by writing a book without receiving network approval. “Fox News masquerades as a defender of traditional family values, but behind the scenes, it operates like a   Playboy   cult, steeped in intimidation, indecency and misogyny,” Ms. Tantaros’s suit says. Fox News said it would not comment on pending litigation. Mr. Ailes, the network’s founding chairman and guiding force for two decades, resigned last month after a former anchor, Gretchen Carlson, said in a suit that she was fired for refusing his sexual advances. Mr. Ailes has denied all allegations of harassment. In April, the chief lawyer for Fox charged that Ms. Tantaros had concocted sexual harassment claims to gain leverage in the contract dispute her lawyer, Judd Burstein, said the book dispute was a pretext that Fox was using to silence her. During arbitration, Mr. Burstein said, Fox News offered to pay her a sum “in the seven figures” if she renounced claims against Mr. Ailes and others at the network, including the host Bill O’Reilly. According to the lawsuit, Ms. Tantaros said she had been subjected to unwelcome advances from Mr. O’Reilly, whom she had regarded as a friend and adviser. “Ailes did not act alone,” the lawsuit states. “He may have been the primary culprit, but his actions were condoned by his most senior lieutenants, who engaged in a concerted effort to silence Tantaros by threats, humiliation and retaliation. ” Ms. Tantaros also claimed in the lawsuit that she was the subject of humiliating posts by pseudonymous accounts on Twitter known as “sock puppets” that she says were instigated by the Fox News publicity department. Ms. Tantaros joined Fox as a contributor in 2010, and a year later was named   of “The Five,” which aired at 5 p. m. She said in the suit that she was repeatedly told by Fox executives that she could not wear pants on the air because “Roger wants to see your legs. ” The lawsuit goes on to say that on Aug. 12, 2014, Mr. Ailes called her into his office and asked if she was planning to marry and have children. “Ailes then started complaining about marriage in general, and also made   jokes about being married,” the lawsuit states. It describes Mr. Ailes as speculating on the sexual habits and preferences of 10 Fox News personalities. He asked Ms. Tantaros to turn around “so I can get a good look at you,” the lawsuit charges, adding that Ms. Tantaros refused. Soon after, she was moved from “The Five” to a   show, “Outnumbered,” that aired at midday. Mr. Ailes called her back for similar sessions in December 2014 and February 2015, the lawsuit charges, and when she continued to rebuff him, she encountered hostility from the Fox News publicity department. In the February meeting, she said, Mr. Ailes talked about how she would look in a bikini, and accused her of ending a   relationship because she had been merely using the man. The episode brought her to tears, the lawsuit states. She said the sole interview arranged by the publicity department during that period was with a writer for a blog controlled by Fox, who asked about her breasts and if she was difficult to work with. In April 2015, the lawsuit states, Ms. Tantaros met with Bill Shine, then a senior news executive and close aide to Mr. Ailes. She said that she told him about the meetings with Mr. Ailes and asked if he had told the head of publicity for Fox News, Irena Briganti, to go after her. The lawsuit claims that Mr. Shine “told Tantaros that Briganti is like a rabid dog on a chain that we can’t control. Sometimes that dog gets off the chain. ” Then, pointing to a picture of Mr. Ailes on a magazine cover, the lawsuit charges, Mr. Shine told her that “this powerful man has faith in Irena Briganti” and that Ms. Tantaros “needs to let this one go. ” Mr. Shine, through a spokeswoman, has said that Ms. Tantaros never approached him about Mr. Ailes harassing her. Mr. Shine was named   of Fox News after Mr. Ailes departed.'"}, "time": 1742561621.1546977}