{"duration": 0.1405317783355713, "input_args": {"text": "'A federal judge on Friday gave final approval to a $25 million agreement to settle fraud claims arising from Donald J. Trump’s   education venture, Trump University, rejecting a   objection to the deal. The judge, Gonzalo P. Curiel, in San Diego, issued his order after considering a challenge from Sherri Simpson, a former Trump University student from Fort Lauderdale, Fla. whose lawyers say she should have had a chance to opt out of the   settlement and individually sue President Trump, perhaps forcing a trial. The civil settlement was not enough for Ms. Simpson, who wanted to see Mr. Trump tried on criminal racketeering charges. She also wanted an apology. But Judge Curiel, in his ruling, sided with the   plaintiffs’ lawyers, who had urged him to approve the agreement, saying it was the best possible outcome for roughly 3, 730 students. They could recoup more than 90 cents on the dollar of what they spent at Trump University. “The court finds that the amount offered in settlement is fair, adequate, and reasonable, and accordingly concludes that this factor weighs in favor of final approval,” wrote Judge Curiel, who approved the agreement and dismissed the objection in a   order. It is subject to appeal. The approval of the settlement, assuming it stands, brings to a close a case that garnered outsize national attention during Mr. Trump’s presidential campaign. He faced two suits in California and one in New York brought by Eric T. Schneiderman, the state attorney general. The suits contended that Trump University students had been cheated out of thousands of dollars in tuition through   sales techniques and false claims about what they would learn. Mr. Trump and his lawyers continued to deny those claims, even after the settlement was first announced in November, soon after his election. Mr. Schneiderman, in a statement, said the settlement would provide “relief  —   and hopefully   closure  —   to the victims of Donald Trump’s fraudulent university. ” The plaintiff’s lawyers  —   who said they would waive their fees after years of litigating the case  —   applauded the decision, with one of them, Jason Forge, saying in an interview that it would be “bulletproof” if appealed. Mr. Forge said he was satisfied that former students, some of them elderly, would receive sizable payments as a result of the deal. “Once in a long while, this profession yields some good feelings,” he said. “This is one of those times. ” As they pushed for approval of the settlement, the plaintiffs’ lawyers said that the objection could cause delays in settlement checks being distributed or disrupt the deal by exposing Mr. Trump to individual lawsuits from former students like Ms. Simpson. “What she is looking for is an apology, and you can’t get that,” Patrick Coughlin, another of the plaintiffs’ lawyers, said at a court hearing on Thursday. Ms. Simpson’s lawyer, Gary Friedman, argued in court on Thursday that it was “not fair” for the case to reach “the point of settlement and say, ‘We’re not giving you the chance to opt out. ’” When Judge Curiel reiterated during the hearing that a jury trial could lead to less favorable results, Mr. Friedman said, “That is a risk analysis that Sherri Simpson has the right to make. ” It is unclear if Ms. Simpson will appeal, and Mr. Friedman did not return messages seeking comment. In a court filing last week, Mr. Trump’s lawyers asked the judge to give final approval to the settlement. Mr. Trump was motivated to agree to the sweeping deal because it would resolve the claims and avoid trial. His lawyers did not respond to request for comment. Mr. Trump rebutted the fraud claims during his presidential bid, at one point questioning Judge Curiel’s impartiality based on his Mexican heritage. He pointed to positive reviews of the program and vowed to reopen the university after what he said would be a victory at trial. His political opponents seized on the allegations, and angry former students  —   including Ms. Simpson  —   spoke out, painting Mr. Trump as a huckster who had conned ordinary people for personal profit. After his election in November, Mr. Trump reversed course and agreed to pay $25 million to resolve the litigation. He did not admit fault, and he maintained in posts on Twitter after the settlement announcement that he “did not have the time to go through a long but winning trial on Trump U. ” The case was scheduled to go to trial late last year, setting up a situation in which Mr. Trump would have probably had to testify during his transition to the White House. At trial, Mr. Trump would have faced reams of evidence about the business practices of Trump University. Dozens of students and instructors wrote sworn statements describing their experiences, with some calling it a fraud or describing how they were taken advantage of. Other materials, among them sales playbooks, described a technique that used “the roller coaster of emotions” to persuade students to pay for courses costing as much as $35, 000 for the “Gold Elite” program. The plaintiffs’ lawyers were surprised and disappointed that Ms. Simpson objected to the settlement, fearing that it would delay payments to other students for months, if not years. Judge Curiel, who has overseen the case for the last four years, said at the hearing Thursday that the amount of money the plaintiffs would recover in the settlement was “extraordinary. ” He said there would be significant hurdles to reaching a similar settlement during a trial. Ms. Simpson’s lawyers argued that a 2015 notice to students about the   case gave the impression that they would have an opportunity to be excluded from a settlement at a later date. The   lawyers say that it was abundantly clear that students were required to opt out in 2015, and that Ms. Simpson’s lawyers mischaracterized the notice. Judge Curiel wrote in his decision that t there is “no blanket rule that due process requires a     opportunity. ” In 2010, Ms. Simpson, who is a lawyer herself, spent about $19, 000 on Trump University programs. After the agreement was announced, she submitted a claim to partake in the settlement, before filing the objection. In an interview earlier this week, Ms. Simpson said she hoped her objection would not “blow up the settlement. ” But she said she believed she could fare better at trial. “For him to go out there and say, well, ‘I didn’t do anything wrong,’ it’s disgusting,” she said. “I want an apology. ”'"}, "time": 1742563552.4559557}