{"duration": 0.17117953300476074, "input_args": {"text": "'Print \\nObamacare is once again in the news – this time for the massive rate hikes Americans have to look forward to in a few months. The right is decrying the hikes, as the left desperately tries to down-play them or just deflect and change the subject. \\nCitizens already stretched to their budgetary limits are wondering how on Earth they will ever be able to afford the insurance premiums – some rising well over 50%. I personally fail to see how a family who is struggling to pay their current premiums will ever be able swing even a 15 or 20% increase, much less 50%. \\nCombine the massive rate hikes with the availability of insurers, which shrink every year, and you have a recipe for mass financial disaster. Can you say a record year for personal bankruptcy? Yeah – I think so. And always remember – Obamacare is just shoddy health insurance. It is NOT healthcare, as everyone on the left consistently and purposely sells it. The left does like their word games. \\nBut, as has been said a myriad of times from us on the right – Obamacare is a fiasco by design. It is a premeditated failure. A single-payer, entirely government-run system has always been the end. Obamacare was always intended to be the deceptive means to that end. \\nAs a single-payer healthcare system is the want of the leftist statists, let me site yet another example of what the future holds for many in the good ole U.S. of A. \\nJolly old England is said to have the “best of both worlds” – private and public healthcare; but in fact, only the wealthiest 5-7% can afford the private care, leaving the rest to the public option – which is far from adequate. \\nInadequate care and hopelessly long wait times just to receive the sub-par care is the rule in England, not the exception. \\nIn 2011, the UK Telegraph reported that, “NHS [National Health Service] managers are deliberately delaying operations as they wait for patients either to die or go private in order to save money, according to an official report.” That’s right. In order to cut costs, bureaucrats at the NHS have become defacto “death panels.” Sound familiar? \\nOne such poor sap who just recently ended up caught in the maze of the British healthcare bureaucracy is Paul Dibbins, a former British Army Lance Corporal. The father of three had suffered serious frost bite. After months of trying to heal his toes, he had developed gangrene. \\nThe NHS scheduled surgery to remove his lower leg – below the knee. Without the surgery, the gangrene would spread, eventually killing him. A grim outlook either way, but having no lower leg is better than an agonizing death, he thought. \\nUnfortunately for the former soldier, the NHS made him wait six weeks for the procedure. And then something happened. At the eleventh hour, NHS postponed the surgery yet again, for another six weeks – no doubt, in an attempt to cut costs. \\nMr. Dibbins was desperate at this point and decided to do the only thing he could. He said: “Knowing that it would take at least another six weeks to get me in front of a surgeon again, that’s when I bit the bullet and cut off the toes.” \\nAnd that he did. Using no painkillers at all, Dibbins scraped away the dead flesh from his two blackened toes and proceeded to sever the tendons with the only thing he had available – a pair of nail clippers. The procedure took him about an hour to remove both affected toes. A surgeon later told him he was crazy, but that the home-style operation was “textbook.” \\nSo, as we proceed further down the path of a single-payer, government run healthcare system, home surgery may also be in our future – as Washington bureaucrats and death panels decide which of us is worth saving. \\nI better dust off my old game of “ Operation ” and start practicing. shares'"}, "time": 1742561707.5746083}