{"duration": 0.15541410446166992, "input_args": {"text": "'MOSCOW  —   It was an old Soviet tradition: No national art exhibition in Moscow was complete without at least one work from every region. Never mind that geographical balance often resulted in kitsch. Look at “The People’s Friendship Fountain,” for example, which dominates a major park here that is still called the Exhibition of the Achievements of the National Economy. (Soviet, or what?) The fountain consists of 16 gilded maidens, each in the national costume of one republic of the Soviet Union, proffering local bounty like wheat or corn. So the Garage Museum of Contemporary Art faced a certain quandary as it took on the challenge of assembling the first representative sample of contemporary art today in Russia  —   did it have to be a traditional geographic catalog, or would some other criterion work for a country that covers 11 time zones. “The country is so huge that we do not always understand it,” said Daria Kotova, the spokeswoman for Garage. The museum was developed by the art collector Dasha Zhukova and her oil billionaire husband, Roman A. Abramovich. Six curators scoured some 40 cities, from Kaliningrad to Vladivostok, examining works by hundreds of artists and whittling the selection down to 68 works in seven representative categories. “We discovered criteria, categories, optics and dimensions that we could not have in any way imagined before our trips,” said Tatiana Volkova, one of the curators. The resulting exhibition, given the somewhat ambitious title of the Triennial of Russian Contemporary Art, opened on March 10 for two months to mixed reviews, underscoring just how difficult it is to boil down such a vast, complex country to just one exhibition. Despite the effort to find unknown talent in the hinterlands, there was a high percentage of works from Moscow and St. Petersburg, critics found. At least one argued that a universal theme would have been better than seven. “I would have liked to see more new, but maybe there is none,” Olga Kabanova, the art critic for the Vedomosti newspaper, said in an interview. “The Triennial does give an understanding of contemporary art in Russia  —   there are national stars and there are unknown artists worthy of attention and support. ” A total of 200 portfolios are to be displayed eventually on the Triennial’s website. The Garage Museum has been housed here since 2015 in a former     cafeteria in Gorky Park retrofitted by Rem Koolhaas. The founders helped kindle something of a rage among Moscow tycoons for building private art museums, with about 10 open or under construction. Russian plutocrats buy plenty of pricey Western art, too, but like a dowager who wears only her paste jewels in public, they tend to stash their Picassos, Bacons and Richters abroad. Given the fickle hand of Russian law, expensive art serves not least as   savings accounts out of reach over the border. Instead, these new institutions mostly specialize in Russian art from different epochs. Ms. Zhukova, from the outset, said she wanted to use Garage to explore Russian contemporary art, and from there give it international exposure. The curators excavated some unexpected works in unexpected places. Take Chechnya. That Northern Caucasian republic is best known as the rather brutal fief of Ramzan Kadyrov, the warlord who gained added notoriety this month amid accusations that his security goon squads have been systematically arresting and murdering homosexuals. Yet Ekaterina Inozemtseva, one of the curators, discovered two striking works there. One included in the “Common Language” category is a short video by a budding filmmaker, Zaurbek Tsugaev, 33, titled “ . ” In it, an elderly grandmother runs her hands over an iPhone, seemingly trying to figure out how it works. “What a contrast between the landscape of her hands and the flatness of the new gadget,” Ms. Inozemtseva said during a tour of the show. Another piece from Chechnya in the “Fidelity to Place” category consisted of    metal house numbers from a Grozny street, with half missing at random. The artist, Aslan Gaisumov, 25, said he searched for artifacts from old Grozny and the 50 battered plaques were all he could find from one of the many streets leveled during recent wars with Russia. “To me that was like a   that brought back a certain memory before the war,” said Roxana Marcoci, a senior curator at the Museum of Modern Art in New York, who was in Moscow for the Triennial’s opening. “It was done in a way that was postconceptual, but dealt with history. ” Ms. Marcoci found the “Art in Action” category  —   basically political art  —   especially intriguing because Russian domestic politics rarely make headlines abroad. Much of the art in this section, often created by collectives, focused on the plight of Russian women. For example, a piece by the Nadenka Creative Association in Omsk, in southern Siberia, took everyday objects like pot holders or panties and embroidered them with important dates or facts related to women. The panties, for example, read “1920 1936 1955 my right for an abortion,” referring to the years when abortion laws came into effect. One embroidered oven mitt read: “As a result of domestic violence in Russia more than 14, 000 women die per year. Legislation in domestic violence has been adopted in 140 countries but not Russia. Happy New 2016!” Ms. Inozemtseva said that she had seen so many photography portfolios that by the time she reached Kaliningrad and someone mentioned a talented photographer, her first reaction was, “ Please, God, no!” One portfolio, “My Friend the Street Musician,” focused on Oleg Fomin, a Novosibirsk musician. Here is Mr. Fomin performing in the subway. There he is soaking in his bathtub. “He is a Siberian playboy with a star’s face,” said the photographer, Evgeny Ivanov, 58. “He was the soul of the city, everyone knew him. ” Mr. Fomin died soon after the series was completed, and the next set of photographs showed his apartment swept clean by relatives of all the    he had amassed over decades. “That is the cycle of life,” shrugged the photographer. Given the country’s history, periodic references to Soviet life were inevitable. The choreographer Sasha Pirogova, 31, created the video “Queue,” of a dance piece based on a famous novel by Vladimir Sorokin. The book focused in detail on the almost biological life of the endless lines for everything in the Soviet Union. In “Queue,” some performers inked their position in line  —   No. 1, 227, for example  —   right on their bodies as the line appeared to continue for eternity. Ms. Pirogova will be among the artists representing Russia in the next Venice Biennale. The “Master Figure” category grouped artists with   reputations. Ilgizar Khasanov, 58, from the Kazan in the south, presented a trilogy, “Female, Male, Red,” addressing gender issues. The striking centerpiece, “Red,” was inspired by starkly different gender roles in the Soviet Union. It consisted of a giant mobile made up of dozens of ordinary objects  —   all Communist red  —   used by the two sexes as they matured. Objects like a hairbrush and a dress are on one side male icons like boxing gloves and toy cars on the other. Mr. Khasanov said that he was struck by the growing nostalgia for the Soviet Union despite its many problems, so he wanted to explore why people “want to become Soviet again. ” The plethora of work disguised just how hard it is to become an artist, noted Taus Makhacheva, 33, whose work “The Way of an Object” consisted of three puppets, modeled on museum objects from her native Dagestan, which take on a life of their own. The Soviet Union treated artists well, she noted, granting them subsidized apartments, studios and vacations, and helping to distribute their work. No art scene in any Russian city receives any remotely similar support, she said. “All these scenes exist ‘despite’  —   despite the reality, despite no support, despite everything,” Ms. Makhacheva said. “It is art despite, which makes it incredibly real and incredibly beautiful. ” Over all, both locals and outsiders find the Triennial uneven, but ultimately an engaging start toward exposing contemporary Russian art to the world. Ms. Marcoci, from MoMA, called the exhibition “an  ” with a “conversational feel. ” “It is the first triennial of Russian art, but what is Russia?” she said. “Russia is a place grounded in multiple cultures  —   it is uneven, but it felt like an exhibition with a lot of energy and an element of disruptiveness. ”'"}, "time": 1742561956.74028}