{"duration": 0.05615830421447754, "input_args": {"text": "'The Council on   Relations, aka CAIR, has helped launch a series of protests across the country and plans lawsuits related to President Trump’s recent executive orders on immigration. [The orders are designed to keep Americans safer from terrorism by temporarily barring visitors from Iran, Iraq, Somalia, Syria, Yemen, Libya, and Sudan from entering the U. S. without “extreme vetting” and banning refugees from these countries for at least 30 days.  CAIR has been declared a terrorist organization by the United Arab Emirates and was named by federal prosecutors as an unindicted   in a   operation. The Council on   Relations is also increasingly a part of America’s institutional left infrastructure and was one of the partners behind the recent Women’s March in Washington that drew hundreds of thousands, along with feminist groups like Planned Parenthood. On Saturday, protests broke out at airports around the country, including New York City’s John F. Kennedy International Airport. Saturday morning, two Iraqis were detained at JFK. Over 1, 000 now at Terminal 4 at #NoMuslimBanJFK to say refugees and Muslims are welcome here! pic. twitter.   —   Daniel Altschuler (@altochulo) January 28, 2017, CAIR chapters were actively promoting the protests on social media and acting as spokesmen for the issue. Protests at John F. Kennedy International Airport after #refugees were detained following Trump’s #MuslimBan  …     https:  .   —     (@CAIRMI) January 28, 2017, # : Immigration order halts travelers at DFW airport, Alia Salem, executive director for DFW Chapter of  …     https:  .   —   CAIR National (@CAIRNational) January 28, 2017, ABC News reports on the Chicago chapter of CAIR’s involvement: At least one person was detained at O’Hare International Airport in Chicago today, and it is expected that she will return to Saudi Arabia, according to the Council on American Islamic Relations (CAIR). Sahar Alghnimi, a Syrian woman who came to the U. S. on tourist visa to see her mother who had just undergone cancer surgery, was detained when she arrived from Saudi Arabia at 8:48 AM on Eithad Airlines, CAIR Chicago executive director Ahmed Rehab told ABC News. Meanwhile in Boston, CAIR is is planning another rally for Sunday at 1 p. m. on Boston’s Copley Square.   Executive Director John Robbins said Trump is playing on “religious bigotry and intolerance” and will end up turning away men, women, and children fleeing violence and persecution. Time magazine says that CAIR was behind a protest that happened earlier in the week at New York City’s Washington Square Park: The demonstration, led by the New York Chapter of the Center for   Relations (CAIR) was hastily organized in response to Trump’s executive orders restricting immigration from Muslim countries and efforts to curb undocumented immigration within the U. S. On Wednesday, Trump   the construction of a wall along the southern border, ordered the Department of Homeland Security to build more detention centers, and ended federal grant funding to   “sanctuary cities” that refuse to cooperate with federal   efforts. CAIR has announced on their website that they will hold a news conference at its Capitol Hill headquarters in Washington, D. C. to announce the filing of a federal lawsuit on behalf of more than 20 individuals challenging the “Muslim ban” executive order. CAIR’s news conference will be   on its Facebook page. Follow Breitbart News investigative reporter and Citizen Journalism School founder Lee Stranahan on Twitter at @Stranahan.'"}, "time": 1742563213.367243}