{"duration": 0.1083066463470459, "input_args": {"text": "'In yet another jolt to the auction world, coming just one week after Christie’s top   Brett Gorvy, announced his departure, the house announced that its chief executive, Patricia Barbizet, was also stepping down, as of Jan. 1, after two years at the helm. Ms. Barbizet will hand over the reins to Guillaume Cerutti, who left Sotheby’s in 2015 to join Christie’s as president of Europe, Middle East, Russia and India operations. “I came to do a number of things,” Ms. Barbizet said in a telephone interview. “They are now done. ” François Pinault, the French luxury goods magnate and the owner of Christie’s, will assume the role of chairman. Ms. Barbizet will become vice chairwoman and will remain chief executive of the Artémis Group, the investment company founded by Mr. Pinault. Mr. Cerutti, 50, is taking over at a time when the auction houses are struggling to fill their sales with inventory, given a hesitation among sellers to consign their prize artworks in light of political and economic uncertainty. “The demand is very strong and has remained very strong from new buyers and emerging buyers,” Mr. Cerutti said. “The supply side is more challenging. We have to be ready to face this part of the cycle because we know we are in a cyclical business. ” Mr. Cerutti’s experience in Asia will be important at a time when the region is the focus of increasing attention as fertile ground for new buyers. (Its rival, Phillips, recently had its first full   sale in Hong Kong.) Ms. Barbizet, 61  —   a longtime top aide to Mr. Pinault  —   represented something of what she recently called a “custodian” for the house, after Steven P. Murphy stepped down as Christie’s chief in 2014. “My primary assignment is C. E. O. of Artémis,” Ms. Barbizet said. “I act when it is necessary. I accepted to take charge because of the team, because the team was there and I was sure we could position the team. I kept my function as C. E. O. of Artémis. ” “The time has come for me to go back to different assignments,” Ms. Barbizet continued. “But I will remain close to Christie’s, as I was before. I will support Guillaume. ” Artémis is the controlling shareholder of the   conglomerate Kering, which includes the brands Gucci, Saint Laurent, Stella McCartney, Bottega Veneta and Balenciaga. Ms. Barbizet is   of the Kering Group. In January, Christie’s announced total sales of $7. 4 billion for 2015, down 5 percent over the previous year. The company is not required to report profitability on its sales, which can carry large guarantees, or promised minimum prices. Over the last two years, the teams at the three main auction houses  —   which include Sotheby’s and Phillips  —   have been in flux. Most notably, Mr. Gorvy announced last week that he was leaving to join forces in private sales with the dealer Dominique Lévy, at her Madison Avenue gallery which will now be known as Lévy Gorvy. But Mr. Cerutti said that he had confidence in the remaining team, which includes Stephen Brooks as deputy chief executive and Jussi Pylkkanen as global president  —   and was pleased that Mr. Gorvy would continue to work closely with Christie’s from the outside. “Brett is a great individual but he was also a member of the team and the team remains in place,” Mr. Cerutti said, “I’m confident they will take over. ” Ms. Barbizet ran Christie’s from Europe, where she lives in Paris. Her other residence is in Manhattan on West 57th Street, but she spends much of her time on airplanes, visiting companies from America to Asia. Previous chief executives, including Mr. Murphy, have not been based in New York. Mr. Cerutti said he, too, planned to remain in London, but to travel frequently to New York and to Asia, where Christie’s recently opened a new Beijing office. “London is the historic center of our company,” he said, adding that he would be traveling shortly to New York to meet with the team there. “I love New York,” he said. “I love being in the United States, you can be absolutely sure. ” Mr. Cerutti has served as managing director of the Centre Georges Pompidou and chief of staff to France’s minister for culture and media. He also held positions in the Ministry of the Economy and Finance before joining the auction world in 2007 as chief executive of Sotheby’s France. In September 2011, he was appointed deputy chairman of Sotheby’s Europe. Ms. Barbizet said she has known Mr. Cerutti for more than 20 years and brought him on in part because of his “skills with people as a manager and as a team leader. ” Mr. Cerutti started at Christie’s this year, after a noncompete period. “He’s very   for winning all the battles,” Ms. Barbizet said. “I’d rather have him winning the battles for us. ” Mr. Guillaume said he looked forward to continuing Christie’s strength in a market that is changing. “The company is in a good place,” he said, “and I will try to maintain the company at this level. ”'"}, "time": 1742561935.7463806}