{"duration": 0.04777050018310547, "input_args": {"text": "'0 - items Only Geniuses & Schizophrenics Can Pass This 3 Question Quiz! \\nMany neuroscientists estimate that as much as 98% of all brain activity is unconscious. Just think about that for a second – 98%. \\nAll that unconscious activity is influenced heavily by the world around its subconscious cues. To demonstrate that, we’re going to call on a super cool quiz. The premise is simple; only geniuses and schizophrenics can answer the following three questions. Which one are you? Continue to find out! \\nThere are no hints! You either know it or you don’t! \\nThe test you’ve just done relies on what researchers call the ‘contraposition method.’ This method tests the extent of a person’s awareness and brain processing power. It’s a super complicated method with tons of ‘moving parts,’ so to speak, but here’s what you need to know for the purpose of this article: There are objects which one can reasonably say are unrelated. Most people would assume, for example, that a race car and a hurricane have very little connection. A genius who thinks outside of the box, however, would deduce some sort of connection. A schizophrenic patient would also deduce a connection because of the way the illness makes people see non-existent connections in just about everything. In other words, if the quiz in this article left you scratching your head, you’re normal. If not, one of two things is true – you’re brilliant, or you have schizophrenia. \\nDon’t worry, I won’t leave you guessing. Here are some facts that will help you figure out which one you are: Geniuses will have taken their time to think before blurting a response. Did you get the answers right? What do you think – are you a schizophrenic or a genius? As far as the schizophrenia angle goes, this post is not a diagnostic tool. It can get you thinking about schizophrenia and, if you have concerns, you can see a psychiatrist for a proper evaluation. \\nSources: '"}, "time": 1742564529.1148334}