{"duration": 0.01567363739013672, "input_args": {"text": "'American Mirror October 27, 2016 \\nFor at least the second time in the last several days, cameras captured Hillary Clinton’s eyes acting strangely. \\nThe behavior, which doctors have told The American Mirror appears to be “disconjugate gaze” — a common symptom of increased intracranial pressure, or swelling of the brain — was evident again during a rally on Wednesday in Lake Worth, Florida. \\nHere are several more of the instances from today: \\nDespite getting major coverage on The Drudge Report, no mainstream news outlet has covered the apparent issue with Clinton’s eyes. \\nBut the several instances over the last few weeks, and as recently as last Friday , have been enough for doctors to publicly call on Clinton to undergo a full medical example and release the results. \\n“My rational self would say that they could have defused all this a long time ago by releasing her medical records and having her undergo the same type of neurologic exam that every high school football player in America who ‘gets his bell rung’ on Friday night must undergo before he can suit up for the game next Friday,” Dr. John R. Coppedge, a surgical specialist from Texas, told The American Mirror . A d v e r t i s e m e n t \\n“She needs a full neurology evaluation, neuro-opthalmology evaluation, MRI, cerebral venography and a lumbar puncture,” Dr. Gerald Gianoli, an expert in intracranial pressure, said to this news site. \\n“It is possible that her status could be significantly improved. But at the same time, she risks demonstrating to the public that her medical problems are more serious than she has let on in the past.” \\nGianoli, who believes the condition could be the result of elevated pressure, which can cause other problems. \\n“It can lead to blindness, deafness, progressive vertigo/balance problems, seizures/stroke and continued problems with concentration, memory and ability to mentally focus,” he said. \\n“It could also lead to death if the lateral sinus thrombosis were to progress to include the opposite side.” This article was posted: Thursday, October 27, 2016 at 5:57 am Share this article'"}, "time": 1742628450.8396273}