{"duration": 0.11532711982727051, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. The presidential race headed into its seventh to last weekend. Donald Trump declared that President Obama had been “born in the United States, period,” ostensibly putting to rest a controversy he fostered for years. But he did so in the context of falsely blaming Hillary Clinton’s 2008 campaign for having “started the birther controversy” and claiming credit himself for having “ended it. ” On the equally false pretext that Mrs. Clinton wants to “destroy your Second Amendment,” Mr. Trump said her Secret Service detail should disarm. “Let’s see what happens to her,” he said, raising the possibility of violence against her for a second time in the race. _____ 2. Michelle Obama campaigned for Mrs. Clinton in Virginia, bringing the force of her own popularity to bear on a suddenly shakier bid. Some of Mrs. Clinton’s supporters, dismayed by polls showing a tightened race  —   and some showing Mr. Trump ahead  —   are racked by doubt, fearing that problems like her email troubles and delay in revealing pneumonia could cost her the election. And after a week focused on the candidates’ health, our   podcast looks at the history of such concerns, with a special appearance by Lawrence Altman, a doctor and former Times reporter who was the first to interview presidential hopefuls about their medical profiles. _____ 3. The partial   in Syria that began on Monday night showed signs of fraying. Government forces and opposition fighters blamed each other for reported episodes of sniper fire, bombardments and clashes. About three dozen U. S. Special Operations troops arrived in northern Syria on an “advise and assist” mission. They “are accompanying Turkish and vetted Syrian opposition forces as they continue to clear territory,” a Pentagon spokesman said in an email. _____ 4. Edward Snowden said his disclosures of widespread domestic surveillance in the U. S. had improved privacy for individuals. Speaking via an internet connection from exile in Russia, he told a gathering in Athens, “Being patriotic doesn’t mean agreeing with your government. ” He also said he was grateful that human rights and civil liberties groups are calling on President Obama to pardon him. Oliver Stone’s biopic, “Snowden,” is in theaters now. _____ 5. What can explain the giant Wells Fargo fraud? More than 5, 000 employees and managers have been fired and the bank is under federal investigation for millions of unauthorized accounts opened in the names of their customers, a practice that prompted internal warnings when it first came to light several years ago. Several of those fired blamed desperation to meet the aggressive sales goals the company set. Our Wall Street columnist sees the illegal and unethical behavior as “a symptom of the wider cultural cancer that has pervaded Wall Street for decades. ” _____ 6. Looking ahead: The Emmy Awards are Sunday night. Are you behind on the top nominees? Our TV experts can help you catch up fast. For instance, if you can watch only one episode of “The People v. O. J. ,” make it “Manna From Heaven,” when the defense team discovers audiotapes of an L. A. detective’s hate speech. On the comedy side, you can see what’s great about “Veep” in the episode “Kissing Your Sister,” a season highlight that pretends to be a    documentary made by the show’s first daughter. _____ 7. Be forewarned: Wildlife photographers and conservationists are posting clickbaity animal shots loaded with sometimes disturbing information about the dangers marine mammals face from climate change. In one of the gentler posts, the photographer who put this beluga whale on Instagram noted that the species had “recently been categorized as ‘near threatened,’ due to aggressive hunting by humans and exposure to harmful anthropogenic pollutants over the past several years. ” _____ 8. William  Bratton, one of the most influential figures in American policing for more than 40 years, took leave of the New York Police Department. “It’s got to be kind of bittersweet for him to be leaving the profession that he loved and the profession he made such a huge difference in across the country and in all those agencies,” a former aide said. As part of his farewell, he wrote an   essay that sees his decades of reform efforts taking shape on the streets. _____ 9. Finally, one of our most popular stories today is an essay by a bioethicist specializing in reproduction and sexual health, but it’s about not being pregnant  —   while looking as if you are. The situation tends to underscore how invasive people can be regarding women’s bodies. She relates how a stranger publicly shamed her into taking his seat on the bus to protect her “unborn baby” from bumps, and how he ”put both hands on my belly and rubbed it as we switched places. ” Her advice: Stop at “How are you feeling?” Have a great weekend. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561820.8318417}