{"duration": 0.0814521312713623, "input_args": {"text": "'Email \\nChambers County Clerk Heather Hawthorne announced that all early voting in the county was once again on the iVotronic machines after one day of early voting using paper ballots. The emergency usage of paper ballots took place on Tuesday, October 25 while a software problem was being resolved. The vendor corrected the problem and reinstalled the corrected configuration in time for all ballots the next day, according to Hawthorne in a press release on October 27. \\nThe situation was recounted by ABC 12 News: An error in the voting machine programming by Election Systems & Software (ES&S) caused votes for one statewide court of appeals race not to be entered when a voter tried to vote straight ticket in either party according to a release from Chambers County. \\nChambers County, Texas, is a small county, having only 13 precincts and only four early-voting locations. County Clerk Heather Hawthorne told The New American 1,801 ballots were cast before switching to the paper ballots. Some of those 1,801 voters were warned to double check their ballots due to the software glitch. Because Chambers County is a Republican stronghold, the Republican candidate will be more adversely affected than the Democratic candidate by unintended under-votes. The question is how many unintended under-votes were there for these candidates and how close will that contest be? \\nThere was a similar ballot problem in 2010 in Travis County, Texas, although the 2010 error was made on the paper ballots. A number of military absentee voters who were bona fide Texas residents were accidentally sent ballots for federal overseas voters. The ballots for federal overseas voters did not include local contests, such as ones for the Texas House of Representatives, and it was impossible to vote for that contest using the ballots provided. Republican Dan Neil lost by 16 votes. The final vote total was Donna Howard (D) 25,026, Dan Neil (R) 25,010 and Ben Easton (L) 1,518. Neil challenged the election total for a number of reasons, in addition to the ballot format, but the Texas Legislature, even though it was supposedly solidly Republican, seated Howard even though a very common practice in such close elections is to seat neither candidate, pay both candidates, and give both candidates equal access to the building and caucuses while the dispute is resolved or a new election is called. \\nIn this case in Chambers County, the affected contest is a judicial contest. Hopefully, it will not be as close as the House District 48 race in 2010. \\nThe voters who were affected by the Chambers County computer glitch were fortunate the errors were obvious enough for voters to notice and bring to the attention of the election officials. How many errors go undetected because they are not obvious to the voters or the election processes are not transparent? Errors such as this serve as a reminder of how important it is that voting have a paper trail and be a transparent process with plenty of paper documentation in case it becomes necessary to reconstruct precinct vote totals or other vital election records. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562450.1990647}