{"duration": 0.07989311218261719, "input_args": {"text": "'Fake ID’s: Threat to Elections October 26, 2016 Am election worker checks a voter\\'s drivers license as North Carolina\\'s controversial \"Voter ID\" law goes into... © CHRIS KEANE \\nFormer member of the Federal Election Commission says fake ID\\'s are a “potential way around a state that has a photo ID law in place.\" A quick Google search reveals a plethora of fake ID vendors. Most popular are drivers license and student identification. This ease of availability of fake drivers licenses poses a danger to American national security. Fraudulent identification also increases the threat of voter fraud in certain states. \\n(Vero Beach, FL) The use of fake drivers licenses isn’t just limited to teenagers drinking beer, but can be used by terrorists, illegal immigrants and fraudulent voters to go around barriers set up by law enforcement. The trend also poses a threat to this presidential election in states where voter ID laws are in place. \\nHans von Spakvovsky, former member of the Federal Election Commission and a senior legal fellow at the Heritage Foundation, told The Daily Caller that fake IDs are a “potential way around a state that has a photo ID law in place.” \\nPaul Rozenweig, now a senior adviser to the Chertoff Group and a lecturer at George Washington University School of Law, told theDC that in his “personal view” the security of drivers licenses “has been underemphasized.” \\n“We’ve done a great deal, for example, to make passports harder to forge, we’ve been much less successful in making domestic identification such as drivers license secure,” Rozenweig said. “The fact that 15 years after 9/11, we still don’t have a secure drivers license identification system in the United States that is hard to spoof and applies to all 50 states is a good example of how we haven’t put any emphasis on this.” \\nTRUNEWS contacted four states out 7 arguably considered to have \"strict\" voter photo ID laws. At least in four states the Election Services representative did not express any concern with fake ID\\'s for the coming election. All confirmed however, to not have any technology in place that would verify or decline a fake form of identification. In Wisconsin spokesperson Reid Magney said, \\n\"I\\'m not aware of how much a fake ID would cost, but I don\\'t think someone is going to go through all that just to vote twice\" \\nBut what if voting twice isn\\'t the goal? A person could be ineligible to vote for a number of reasons like criminal history or immigration status and use a fake ID to do so.The easy access to fake ID\\'s provides a solid supporting argument to allegations and even video released by Project Veritas Action investigators depicting Democratic campaign officials encouraging non-citizens to vote. \\nThere is a whole unit of Immigration and Customs Enforcement (ICE) devoted to document fraud, and yet a quick search on Google yields credible fake ID vendors. Narcotics are accessible on the internet as well, but they require the use of software such as Tor in order to get to the “darknet.” Tor allows you to visit websites that are only accessible on the software’s browser and user’s locations and identities are hidden through the use of thousands of relays. On the other hand, there is a large community on Reddit openly discussing which fake ID websites are credible, offering sales and giving reviews on products. Drivers licenses and student IDs are the main types of fraudulent identifications available on the open internet. For passports one can visit a “dark marketplace” and purchase a fake Spanish passport for nearly $3,000. The subreddit “fakeid” has over 15,000 subscribers and keeps a list of “verified” vendors who the moderators have confirmed won’t scam users. Sources close to The Daily Caller have ordered fake drivers licenses from these vendors, all of which have bar codes that can be scanned, proper holographics, and proven to be effective at liquor stores or hotel check-ins. \\nAccording to ICE: “ICE places a high priority on investigating document and benefit fraud. These types of fraud pose a severe threat to national security and public safety because they create a vulnerability that may enable terrorists, other criminals and illegal aliens to gain entry to and remain in the United States.” While ICE claims to place a “high priority” on fake IDs, sites such as reallygoodfakes.com have had a registered domain since 2010. Besides the key issues related to fake drivers licenses of illegal immigration and terrorism that ICE identifies, fake IDs can also enable voter fraud. \\nIan Smith, investigative associate at the Immigration Reform Law Institute, told TheDC fake IDs are commonly used by illegal immigrants to “obtain work, open a bank account, and rent an apartment.” We spoke with Leah Smith a spokesperson at Election Services in Mississippi and she seemed pretty confident in relying on poll workers this November 8th. \\n\"We have trained poll workers who know what a real ID looks like\". \\nOriginal article by The Daily Caller. \\n——- Article by , Correspondent for TRUNEWS Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE!  '"}, "time": 1742562133.9941638}