{"duration": 0.04110550880432129, "input_args": {"text": "'REDDING, Calif.  —   In a speech in which he promoted the backing of   in Los Angeles and called protesters at a rally in San Jose “thugs,” Donald J. Trump on Friday sought to project support from   for his campaign on a single man in the audience. Mr. Trump, at a rally here, began speaking about a previous rally in Arizona in which a black supporter was arrested after punching a protester. “We had a case where we had an   guy who is a fan of mine,” Mr. Trump said of an event in Arizona in March. “In fact I want to find out what’s going on with him. ” As his voice trailed off, Mr. Trump noticed a man in the crowd. “Oh look at my   over here,” Mr. Trump said. “Are you the greatest? Do you know what I’m talking about?” Mr. Trump then returned to speaking about the Arizona episode. The man he had pointed to, Gregory Cheadle, a local real estate broker running for a Republican nomination for a congressional seat, said in an interview Friday night that it was “surreal” to be called out by Mr. Trump. Mr. Cheadle said he was not offended by the remark, which he at first could not hear over the noise of the crowd. “I’ve had people come to me  —   and these were whites  —   tell me that they were offended,” he said. “And I appreciate them saying that, but I wasn’t offended by it. ” He also clarified that he is not actually a Trump supporter, saying that he went to a Bernie Sanders rally the night before. “I’d describe myself as someone who is searching for answers,” Mr. Cheadle said. At the Arizona rally Mr. Trump was referring to, a Trump supporter punched a protester wearing a Ku Klux Klan outfit as the person was being escorted out. “As the     this guy, and this guy never knew what happened, everybody thought the   was against me, and it was the opposite,” Mr. Trump said at his rally Friday. “He was like this great guy, military guy. We have tremendous   support. The reason is I’m going to bring jobs back to our country. ” Mr. Trump’s comments come as his campaign is fending off charges of racism over his remarks about Gonzalo P. Curiel, the federal judge presiding over a lawsuit against Trump University. Mr. Trump has suggested that he believes the judge is biased because he “happens to be, we believe, Mexican. ” Judge Curiel was born in Indiana he is of Mexican descent.'"}, "time": 1742563257.6628718}