{"duration": 0.12441229820251465, "input_args": {"text": "'Written by Jacob G. Hornberger   Eight years ago, President Obama had a chance to change the warmongering direction that outgoing President Bush and the U.S. national-security establishment had led America for the previous eight years. Obama could have said, “Enough is enough. America has done enough killing and dying. I’m going to lead our country in a different direction — toward peace, prosperity, and harmony with the people of the world.” He could have ordered all U.S. troops in the Middle East and Afghanistan to return home. He could have ended U.S. involvement in the endless wars that Bush, the Pentagon, and the CIA spawned in that part of the world. He could have led America in a new direction.Instead, Obama decided to stay Bush’s course, no doubt believing that he, unlike Bush, could win the endless wars that Bush had started. It was not to be. He chose to keep the national-security establishment embroiled in Afghanistan and Iraq. Death and destruction are Obama’s legacy, just as they were Bush’s.Obama hoped that Hillary Clinton would protect and continue his (and Bush’s) legacy of foreign death and destruction. Yesterday, a majority of American voters dashed that hope.Will Trump change directions and bring U.S. troops home? Possibly not, especially given he is an interventionist, just as his Clinton, Bush, and Obama are. But there is always that possibility, especially since Trump, unlike Clinton, owes no allegiance to the U.S. military-industrial complex, whose survival and prosperity depends on endless wars and perpetual crises.If Clinton had been elected, there was never any doubt about continued U.S. interventionism in Afghanistan and the Middle East. Not only is she a died-in-the-wool interventionist, she would have been owned by the national-security establishment. She would have done whatever the Pentagon, CIA, and NSA wanted, which would have automatically meant endless warfare — and permanent destruction of the liberty and prosperity of the American people.It’s obvious that Americans want a new direction when it comes to foreign policy. That’s partly what Trump’s election is all about. Americans are sick and tired of the never-ending wars in Afghanistan, Iraq, Libya, Syria, Yemen, and elsewhere. That includes military families, especially the many who supported Trump, Gary Johnson, or Jill Stein. Americans are also tired of the out of control spending and debt that come with these wars. By electing Trump, it is obvious that Americans are demanding a change on foreign policy.Imagine the benefits to American society if Trump were to change directions on foreign policy. No more anti-American terrorist blowback, which would mean no more war on terrorism. That means the restoration of a sense of normality to American lives. No more TSA checkpoints at airports. No more mass surveillance schemes to “keep us safe.” No more color coded warnings. No more totalitarian power to round up Americans, put them into concentration camps or military dungeons, and torture them. No more power to assassinate people, including Americans. In other words, the restoration of American civil liberties and privacy.The Middle East is embroiled in civil wars — wars that have been engendered or magnified by U.S. interventionism. Continued interventionism in an attempt to fix the problems only pours gasoline on the fires. The U.S. government has done enough damage to Afghanistan and the Middle East. It has already killed enough people, including those in wedding parties, hospitals, and neighborhoods. Enough is enough.Will Trump be bad on immigration and trade? Undoubtedly, but Clinton would have been bad in those areas too. Don’t forget, after all, that Obama has become America’s greatest deporter-in-chief, deporting more illegal immigrants than any U.S. president in history. Clinton would have followed in his footsteps, especially in the hope of protecting his legacy. Moreover, while Trump will undoubtedly begin trade wars, Clinton would have been imposing sanctions on people all over the world whose government failed to obey the commands of the U.S. government. A distinction without a difference.Another area for hope under a Trump presidency is with respect to the drug war, one of the most failed, destructive, and expensive government programs in history. Clinton would have followed in Bush’s and Obama’s footsteps by keeping it in existence, if for no other reason than to cater to the army of DEA agents, federal and state judges, federal and state prosecutors, court clerks, and police departments whose existence depends on the drug war.While Trump is a drug warrior himself, he doesn’t have the same allegiance to the vast drug-war bureaucracy that Clinton has. If we get close to pushing this government program off the cliff — and I am convinced that it is on the precipice — there is a good chance that Trump will not put much effort into fighting its demise. Clinton would have fought for the drug war with every fiber of her being.There is another possible upside to Trump’s election: The likelihood that Cold War II will come to a sudden end. With Clinton, the continuation of the new Cold War against Russia was a certainty. In fact, Clinton’s Cold War might well have gotten hot very quickly, given her intent to establish a no-fly zone over Syria where she could show how tough she is by ordering U.S. warplanes to shoot down Russian warplanes. There is no telling where that would have led, but it very well might have led to all-out nuclear war, something that the U.S. national-security establishment wanted with the Soviet Union back in the 1960s under President Kennedy.The danger of war with Russia obviously diminishes under a President Trump, who has said that he favors friendly relations with Russia, just as Kennedy favored friendly relations with the Soviet Union and Cuba in the months before he was assassinated.Indeed, given Trump’s negative comments about NATO, there is even the possibility of a dismantling of that old Cold War dinosaur that gave us the crisis in Ukraine with Russia. \\nHow about it, President-Elect Trump? While you’re mulling over your new Berlin Wall on the Southern (and maybe Northern) border and your coming trade wars with China, how about refusing to follow the 16 years of Bush-Obama when it comes to U.S. foreign interventionism? Bring the troops home. Lead America in a different direction, at least insofar as foreign policy is concerned — away from death, destruction, spending, debt, loss of liberty and privacy, and economic impoverishment and toward freedom, peace, prosperity, and harmony. Reprinted with permission from the Future of Freedom Foundation . Related'"}, "time": 1742562310.1903753}