{"duration": 0.057914018630981445, "input_args": {"text": "'Austria should withdraw completely from the European Union’s migrant redistribution programme because it has already taken enough, government ministers have said. [Defence Secretary Hans Peter Doskozil proposed the idea at a cabinet meeting Tuesday morning, with Chancellor Christian Kern agreeing to send a letter to Brussels requesting the country’s withdrawal.  Mr. Doskozil said Austria had already “ ” its contribution as migrants continue entering the country via Italy and Greece, meaning it has taken far more than many other EU nations. Nachrichten. at reports that he pointed to statistics showing that in 2015 and 2016, Italy had to bear “far less of a burden” accepting 1, 998 asylum applications per million inhabitants, while Austria had to process 4, 587. “I believe that Austria has made a sufficient humanitarian contribution,” the minister said, adding that the nation was “one of the most heavily loaded countries” in the EU. Chancellor Kern agreed, saying Austria had already fulfilled its obligations and would seek an amicable way to escape the agreement. The comments came as leaders of the Central European Visegrad group rejected the EU’s migrant redistribution policy in protest at suggestions the level of their compliance could affect the EU funds they receive. The prime ministers of Poland, Hungary, Slovakia, and the Czech Republic said they will not yield under any financial pressure, describing it as an attempt at blackmail. Brussels wants each EU member state to accept its “fair share” of some 160, 000 migrants to ease the pressure on Greece and Italy. Hungarian Prime Minister Viktor Orbán also said that he was further strengthening his country’s borders in order to seal off the   “Balkan route”. Last month, Austrian Foreign Minister Sebastian Kurz also defended closing the border the deter migrants, saying the move, although initially criticised, had become accepted practice. Before the route was shut, over a million migrants travelled up through Macedonia and Serbia from Greece to reach wealthier EU nations.'"}, "time": 1742562666.2260535}