{"duration": 0.024381637573242188, "input_args": {"text": "\"The storm before the calm before the storm • Stocks GMD -1.3% Groucho Marx Disguises (GMD): $47.05 (-.61) (-1.3%) The company's value plummeted after the unveiling of a newly retooled disguise featuring no mustache, an average-sized nose, and, in the place of this black glasses, stylish wire frames. America's Finest News Source AUSTIN, TX—Anxiously wondering what kind of impression he was leaving on university admissions officials, wealthy father Gordon Fring was said to be waiting restlessly for responses this week after mailing donations to his son’s top college choices. Related Topics Parenting The American Voter \\nEvery four years, against anyone's better judgement, the American people are entrusted to elect the next president. The Onion lets them tell their stories. Trump Holds Strategy Meeting With Campaign’s Top Militia Leaders Ahead Of Election Day NEW YORK—Sitting down with his most heavily armed advisors to go over potential courses of action, Republican presidential nominee Donald Trump reportedly held a strategy meeting with his campaign’s top militia leaders Thursday afternoon in order to map out their approach before November 8. FEC Extends Election By 7 Months To Give Nation Chance To Better Get To Know Candidates WASHINGTON—In an effort to help voters make an informed decision at the polls, the Federal Election Commission announced Thursday it would be extending the U.S. presidential election by seven months to give Americans the opportunity to better get to know the presidential candidates. Trump Campaign Training Poll Watchers To Spot Any Suspicious Skin Colors On Election Day HARRISBURG, PA—Instructing volunteers to remain alert and pay close attention to every individual who arrives at their voting location, the “Trump Election Observer” section of Donald Trump’s campaign website reportedly trains supporters to spot any suspicious skin colors they may see on Election Day, sources confirmed this week. Quick Jump To Series Page \""}, "time": 1742563360.0059397}