{"duration": 0.06571030616760254, "input_args": {"text": "\"Nestle seeks more groundwater to expand Michigan plant They're putting profits over people - and the environment - yet again By Julie Fidler - November 9, 2016 \\nThe state of Michigan has given a preliminary go-ahead for food and beverage maker Nestle to nearly triple the amount of groundwater it will pump from beneath the state, to be bottled and sold at its Ice Mountain plant, approximately 120 miles from Flint. \\nNestle Waters North America asked the Michigan Department of Environmental Quality (DEQ) to allow the company to increase pumping from 150 to 400 gallons-per-minute at 1 of its production wells north of Evart. \\nThe company already increased the well’s pumping rate last year and earlier this year, but needs the DEQ’s approval to max out the withdrawal capacity under the Section 17 of the Michigan Safe Drinking Water Act (SDWA). \\nThe DEQ already issued a draft proposal for the request in January, and ended a public comment period on the subject on November 3. Carrie Monosmith, environmental health chief in the drinking water office, said the DEQ hadn’t received any comments. \\nMany Michigan residents feel Nestle has a lot of nerve asking for the increase, in light of Flint’s years-long nightmare over lead contamination in their drinking water. Many people in Flint still rely on bottled water for cooking, cleaning, and bathing as the government continues to drag its feet in replacing the corroded pipes. \\nNestle representatives defended the company’s efforts to pump more groundwater, saying the “U.S. market for bottled water in general is driving the bid for more Michigan groundwater.” \\nThat’s right, America. Nestle says it’s your fault. \\nIf that’s not infuriating enough, Nestle gets to pump that water for free. Under state law, private property owners may withdraw from the aquifer under their property for free. The only cost is $200 in annual paperwork. \\nThe interstate Great Lakes compact prohibits water diversions outside of the Great Lakes basin, but a loophole in the law allows water to be sold outside the region, so long as it is shipped in bottles smaller than 5.7 gallons. \\nJeff Ostahowski, vice president of the Michigan Citizens for Water Conservation (MCWC), asks: \\n“The issue is the privatization of a critical resource. How much is too much?” \\nFor years, MCWC has battled against Nestle to prevent it from expanding in the state. \\nAccording to Nestle and the DEQ, an environmental review shows the aquifer can withstand the proposed increase in pumping, and that it won’t hurt its flow, levels, or temperature of nearby surface waters.\""}, "time": 1742562096.1773288}