{"duration": 0.08959674835205078, "input_args": {"text": "\"NGOs should condemn terrorists in Syria, not Russia fighting them – Foreign Ministry Published time: 26 Oct, 2016 22:53 Edited time: 26 Oct, 2016 23:12 Get short URL Aerial view of the Foreign Ministry building in Moscow. © Maksim Blinov / Sputnik The NGOs that demanded Russia’s removal from UN Human Rights Council lack impartiality as they ignore terrorist activities as well as violations by the US-led coalition in Syria, the Russian Foreign Ministry's Commissioner for Human Rights told RT. Trends Russian anti-terror op in Syria , Syria unrest \\nTargeting Russia was “a gross misstep on the part of the human rights defenders,” Konstantin Dolgov said. \\n“If they call themselves [human rights defenders] they have to be objective. Al least, they have to try to be impartial. How can they assess the human rights situation in Syria in this one-sided manner? Just to join the chorus of Western governments and politicians, groundlessly accusing Russia of bombing civilian targets in Syria, without providing any evidence of this,” Dolgov added. \\nREAD MORE: US-led coalition killed 300 Syrian civilians in 11 probed strikes – Amnesty \\nThe NGOs, which failed to provide any solid proof of Russia’s alleged wrongdoings, “completely ignore the bulk of the problem” in Syria, the commissioner stressed. “And the bulk of the problem is the activities of the terrorist organizations like Islamic State, [Jabhat] al-Nusra… which have been persistently killing dozens of thousands of civilians in Syria.” \\nDolgov wondered “how can those NGOs ignore… numerous killings of civilians and destruction of infrastructure by the coalition led by the US?” when “there are multiple examples” of such violations. \\n“If you’re against violations of human rights, you should be against violation everywhere and by everybody,” he said. \\nThe commissioner pointed out that, on Wednesday, Amnesty International – which had not signed the petition – blamed the US for killing hundreds of civilians in Syria and refusing to investigate those incidents. \\nThe numbers of civilian victims provided by the group – around 300 – “aren’t complete,” Dolgov said. \\n“I don’t think that an accurate number. I don’t think anybody there has an accurate number.” Read more Over 80 NGOs call for Russia to be dropped from UN rights council over Syria \\nMore than 80 international organizations – including Human Rights Watch, CARE International and Refugees International – have signed a petition for Russia to be thrown off the UN Human Rights Council. They claimed that Moscow was no longer fit to hold its position in the United Nations body, due to its military operation in Syria. \\nIt turned out that most of the organizations are part of the very same Syria Relief Network based in Turkey, however, casting potential doubts over their impartiality. \\nThe petition came ahead of the UN Human Rights Council election, scheduled to take place on Friday. The Foreign Ministry official opted not to predict the outcome of the vote, but said that Russia was “definitely” running to regain its seat on the council. \\n“We’re running because we have a very strong record in the protection of international law; in the protection of international human rights law. We don’t have right now, at this last moment before the election, to prove anything. Our policies are well known and we’ve been one of the most active and creative members of the UN Human Rights Council for many-many years now,” Dolgov stressed. \\nWest, Arab states ‘protecting terrorists’ who will never win in Syria – Mother Agnes to RT \\nMoscow is aware that there some international players who want to block Russia’s activities in the Human Rights Council, because “we’re not professing double standards. We are consistently against politicizing human rights. We have a lot of supporters,” Dolgov added.\""}, "time": 1742562529.7828164}