{"duration": 0.04056215286254883, "input_args": {"text": "'Girl Put Aluminum Foil After Washing Her Hair and She Delighted The Best Hairdressers of The World Ξ [November 1, 2016] BLOG The Soldier Who Wouldn’t Carry A Gun, Eat Meat Or Work On Saturday Is One Of America’s Greatest Hero posted by Eddie This is Desmond Doss, the soldier who refused to carry a gun during WWII. He was the first conscientious objector in America’s history to receive the Medal of Honor, the highest award the military gives. To say he wasn’t a typical soldier is putting it way too lightly. Desmond Doss didn’t eat meat, wouldn’t train on Saturdays and adamantly refused to carry a gun. Heck, he wouldn’t even carry a bayonet. But during one of the worst battles of WWII, Doss is credited with saving 75 lives himself. He was a member of the Seventh-Day Adventist Church, and he stuck to its principles — even refusing to train on Saturday, the Sabbath Day in his church. He was working in a shipyard in April, 1942 when he was drafted into military service. Because of his religion and his dedication to pacifism, Doss was registered as a conscientious objector. That meant he wouldn’t be forced to carry a gun. Doss became a medic for the 77th Infantry Division, and made up for taking Saturdays off by working extra hours through the week. Other soldiers found Doss a bit hard to understand, and one of his commanding officers even offered to have him discharged for mental health issues. Doss refused, on the grounds that being religious didn’t make him crazy. He was on the island of Okinawa in 1945 with the rest of the 77th on May 5, when the American military began to lose the battle at the top of a 400-foot ridge. The battle was fierce and fast, with at least 75 men falling in the first few minutes. Most of the American troops fell back as the Japanese soldiers swarmed. One man stayed on the battlefield, refusing to take cover. It was Desmond Doss, treating the dozens of wounded soldiers who had fallen in the first fierce rush of the day’s battle. Shells fired above his head as he worked on the field treating the fallen men. He lowered the wounded one by one down to the base, 35 feet below the ridge, using ropes and a litter he fashioned, all while wounded soldiers left behind on the field of battle shot at the advancing Japanese. This left Doss free to do his work. When he was awarded the Medal of Honor months later for his actions in the battle, Doss was credited with saving 75 lives…even though May 5, 1945 was a Saturday. Doss was badly wounded in the battle. A grenade went off near him, and he was covered with injuries from the shrapnel. Even so, when it was finally his turn to be on a litter, Doss jumped back off because he saw a soldier who looked to be in worse shape than he was. He was hit by enemy fire shortly after he got off the litter, and used a rifle stock to create an improvised splint for his shattered arm. It was the most Doss ever handled a weapon during his service in WWII. He spent the next 5 years in hospitals, having his injuries treated. Doss spent the rest of his life working with the church, mainly in programs involving children and teens. He is one of only two conscientious objectors to receive the Medal of Honor, and his story has recently been immortalized in film. \\nSource:'"}, "time": 1742562304.3336685}