{"duration": 1.5876586437225342, "input_args": {"text": "'Ready Nutrition October 31, 2016 \\nDid you know that the White House is currently coordinating with Homeland Security to make preparations for a possible solar storm that could bring an end to civilization as we know it? An Executive Order published on October 13, by the Obama administration shows an increasing concern among White House officials about “solar flares, solar energetic particles and geomagnetic disturbances,” following a solar event which generated a Category G2 geomagnetic storm on October 8. This action could likely mean that we have an imminent solar threat in our near future. A solar discharge of great magnitude could mean entire countries could be without electricity, civil unrest and countless lives lost. If federal officials are preparing for this sort of disaster, we have enough reason to arm ourselves with the knowledge of what we might face. \\nPrepare for any disaster step-by-step \\nWhat are CMEs? \\nCoronal Mass Ejections (CMEs) are violent explosions of plasma originating from the Sun’s corona, out of which energized particles and powerful magnetic domains emerge as fast as 3,000 kilometers per second. A CME has an associated shock wave and electromagnetic pulse (EMP) that can travel toward the Earth and interrupt satellites and power grids around the planet. There are currently no public disclosures of CMEs being detected, but there is a significant geomagnetic storm event beginning, combined with the Executive Order previously mentioned, gives cause for concern about the possibility of a CME striking our planet in the near future. \\nA recent report from the National Oceanic and Atmospheric Administration (NOAA) Space Weather Prediction Center predicts a Category G2 geomagnetic storm from October 24 – 26. An aurora borealis is projected to be seen in the skies above New York to Wisconsin to Washington state, and interruption to satellites and power lines are expected. \\nIt is possible that this particular storm is not the result of a CME, but in order to be prepared, one must first know what disasters may lie ahead and plan accordingly. \\nHere are 5 catastrophic consequences of a major CME hitting the Earth and changing life as we know it: \\nSatellite Disruption \\nIf there was a high-magnitude impact of solar energy and particles, we would see an immediate response on low-Earth orbiting weather, communications, and military satellites. Some satellites could be crippled for up to a decade . The first sign that a major CME is about to strike will be a loss of connection with or permanent failure of a portion of low-Earth orbiting satellites and their associated infrastructure. The shock wave, in combination with an EMP, would likely cause significant disruption of GPS signals, possibly creating long-term failures across the global navigation satellite system. This would have disastrous implications for commercial airplanes and ships, many of which rely on GPS guidance systems for landing and docking, and a failure of timing on either of these systems could put countless lives at risk. Seismic stations, computer network synchronization and many electric power grids across the world rely on GPS clocks. Geomagnetic disturbances associated with CMEs are known to disrupt GPS clocks through interference of high frequency radio signals in both air and ground transmission. Here is some more information on EMPs.'"}, "time": 1742563486.330133}