{"duration": 0.06800532341003418, "input_args": {"text": "'Welcome to Our Picks, a guide to the best stuff to read, watch and listen to from around the internet. Check this space for the     article, the next great podcast for your commute, the   tweetstorm. And yes, we’re also tooting our own horn here. We’ll share can’  Times stories from the week and surface some gems you might have overlooked. We want to hear from you! Send us feedback about our selections to ourpicks@nytimes. com. • Scientists have discovered that there’s a species of parrots that can make each other laugh. According to a new study, kea birds in New Zealand are the first   known to demonstrate contagious emotion. Just the thought of parrots giggling together should hopefully lead to some more laughter around the internet. [National Geographic] • What’s more   than being in the N. F. L. draft? For one former football pro and Rhodes Scholar, it’s waiting to be matched for a neurosurgery residency. [Washington Post] • The history of the zipper is a fascinating  —   and complicated  —   tale that winds through a World’s Fair, Rolling Stones album cover and into space. [BBC] • Eleven new types of cloud have been added to the most recent edition of the International Cloud Atlas. Even better? The atlas is available online for the first time here. [Mashable] • One way to celebrate the life of Chuck Berry is to watch these clips of the musical icon playing “Johnny B. Goode” with Bruce Springsteen, John Lennon, Eric Clapton and more. [Open Culture] • The NBA’s secret addiction? Peanut butter and jelly sandwiches. If you only have time for one long read this weekend, make it this one. [ESPN] • Some histories take half a century to be revealed. In the 1960s, no one knew that scores of black NYPD officers went undercover to infiltrate the city’s radical groups. Now, some of them have stepped forward to tell their stories and “set the record straight. ” [Esquire] • You couldn’t script it: A reality television producer comes back from a   experience with a new donated hand that was surgically appended and a fresh outlook on life. [LA Magazine] • Entomologists, for those who need a refresher, are scientists who study insects. More and more, these bug detectives find themselves serving as “accidental specialists” treating people with a rare mental disorder called delusional parasitosis, the belief that you’re covered in bugs that aren’t really there. [STAT] • In his latest Character Study, Corey Kilgannon profiles Rosemary Romano, 79, who has inspired generations of blind students to become office workers, teachers and lawyers (and is blind herself). • Sketch Guy has simple advice on how to turn your wishes into reality instead of regrets. • Melissa Clark has a recipe for malted milk fudge ripple ice cream, “a satiny ice cream that’s veined with fudge sauce to create gooey, bittersweet ripples. ” •Meet a charming    who will happily meet a good flight delay with a favorite phrase: “Let’s talk about airport infrastructure. ” • Take a tour of the   word factory (including the basement, with its distinctly analog oddities) and read lexicographer Kory Stamper’s take on three words nerds love to debate. And don’t miss Fran Lebowitz’s By the Book interview. • If you’re a fan of Megan Mullally and Nick Offerman, or if you just enjoy hilarious people with incredible chemistry, we recommend listening to the married couple’s interview with Alec Baldwin on his show “Here’s the Thing. ” [WNYC'"}, "time": 1742561882.5840175}