{"duration": 0.13534021377563477, "input_args": {"text": "'BERLIN  —   Even in Germany, where consensus is highly valued, it had never happened before. On Sunday, Martin Schulz was anointed leader of the Social Democrats, Europe’s oldest democratic party, with 100 percent of the valid votes cast at a special convention. The result places Mr. Schulz, 61, a former president of the European Parliament, in pole position to unseat the world’s most powerful woman, Chancellor Angela Merkel, when the two face off on Sept. 24 in the national election, in which Ms. Merkel is seeking a fourth term. Even before that, it could increase the tensions coursing through Germany’s relationship with President Trump’s administration. Already, Mr. Trump’s actions  —   and Britain’s decision to leave the European Union  —   have had an effect here, slowing the rise of   populism as voters   the value of the Continent’s unity. But the rallying cries in Mr. Schulz’s   address to the convention seemed destined to irk an American administration that is already demanding more from its NATO allies. His best applause lines railed against buying more weapons, or argued that even Mr. Trump should hold fast to democratic values. Anyone who tries to curb the freedom of the news media, Mr. Schulz emphasized, “is laying an ax on the roots of democracy, whether he is the president of the United States or a protester at a rally of Pegida,” the     movement in Germany. “Both are unacceptable. ” After the unanimous endorsement of his election bid, Mr. Schulz jubilantly declared, “This vote is the start of capturing the chancellery. ” He was nominated as the new party leader only in late January and has since been embraced by the   with an élan not seen in years. More than 13, 000 people have joined the Social Democrats in recent weeks  —   a fact celebrated by party leaders even though 2016 membership, at around 438, 000, was 130, 000 less than a decade earlier. Significantly, the    Social Democrats have drawn level with Ms. Merkel’s   bloc, with both hovering around 31 or 32 percent in polls. Currently, the two govern in a coalition led by Ms. Merkel’s conservatives. Though German politicians and voters are used to the compromises of coalition politics, the partnership seems likely to grow testier. If so, some commentators said, that would be another sign of the effect Mr. Trump is having across a continent he often scorns. Last week in the Netherlands, and in December in Austria, centrist parties beat back the rising tides of nationalist populism, not quashing the far right but denying it further claim on national leadership. Commentators say that Mr. Trump has galvanized even Europeans skeptical of the European Union, a bloc often derided as remote and unknowable to the almost 500 million people who live in its 28 member states. Unease about Mr. Trump means that he “has had a much bigger effect in Europe than in the United States,” Rolf Kleine, a senior political editor of the   Bild newspaper, said on the sidelines of the Social Democrats’ convention. “Suddenly,” Mr. Kleine said, “people got frightened. ” They “have seen what the results are when you elect people you perhaps had better not have elected,” he added. Just how awkward relations already are was on full display last week when Mr. Trump received Ms. Merkel at the White House. In a subsequent post on Twitter, he claimed that Germany owed “vast sums” for past American defense. Then, on Saturday, American resistance deprived the German hosts of a Group of 20 finance ministers’ summit meeting of a usually routine declaration against protectionism. Ms. Merkel, known for her patience and for waiting out crises, has not reacted to either the NATO demands or the Group of 20 statement. But her close ally, Defense Minister Ursula von der Leyen of Germany, issued a sharp statement on Sunday in which she denied Mr. Trump’s contention. “There is no debt account in NATO,” Ms. von der Leyen said, adding that it was “false” to view the 2 percent pledged for military spending by each member as exclusively for NATO. Included in the sum, which Germany is set to reach over the next decade, is support for United Nations peacekeeping missions and the fight against the Islamic State. “What we all want is fair   which requires a modern understanding of security,” Ms. von der Leyen said. While Mr. Trump continues to unsettle, opponents might argue that Mr. Schulz, who failed to finish high school and is entirely untested in national politics, also represents a risk. But Mr. Schulz, a former bookseller, has a compelling personal story, more than 20 years of experience in European structures and, above all, a message that Germans appear newly eager to hear. Since he was chosen as the Social Democrats’ leader and embraced a simple slogan, “More Justice,” his party has advanced. Supporters chant “Martin! Martin!” when he appears and wave placards proclaiming that it is “time for Schulz. ” His rise has apparently blunted the advances of the   Alternative for Germany party, which now runs around 9 to 10 percent in polls. The Green and Left parties are also stuck around 8 percent each, with the liberal Free Democrats hovering around the 5 percent hurdle that must be cleared to win parliamentary seats. So far, Mr. Schulz has provided almost no details of what his policies might be and says he will outline his program only in late June. Even supporters worry that this leaves him vulnerable. “At the moment, he is everybody’s darling,” said Steffen Burmeister, 54, who is active in local politics near Hamburg. “He can bring people along, and he has the right themes. ” In addition, he said, “it is a very important signal that he is someone who has worked so hard for Europe, and at the top of the structure. ” Still, Mr. Burmeister argued, more “fresh faces” are needed. Mr. Schulz sought to appeal to voters of all ages: invoking the iconic Willy Brandt, the Social Democrat who pioneered détente with the Soviets, for older generations and seeking to woo younger ones with concern for their future. Anne Wachter, 27, works for the Social Democrats. Embracing a   image of Mr. Schulz, which she said she had carried nationwide to appearances in recent weeks, she rejected the idea that his advance was a result of Mr. Trump’s rise. “I think we just let Donald Trump be,” she said, “and make our own policy. ”'"}, "time": 1742563259.5540226}