{"duration": 0.06434226036071777, "input_args": {"text": "'November 15, 2016 - Fort Russ - Ruslan Ostashko, PolitRussia - translated by J. Arnoldski -  \\n\\n\\nIt’s impossible not to laugh and feel pity when looking at those who in the media and on social networks are now saying that the arrest of [Russian Economy Minister] Ulyukaev [for allegedly taking a $2 million bribe] was made possible exclusively thanks to the telephone conversation between Trump and Putin. According to this conspiracy theory, without Washington’s permission, Putin never ever would have dared lay a finger on Ulyukaev and only now gathered the wiretap transcripts from many months and years before the American elections. \\nGuys, let’s respect our country. We are not Ukraine. Putin and the FSB don’t need a nod from Washington to extinguish corruption. Open the calendar on your computer and look at what year it is. It is 2016 and those who are talking about some kind of permission from Washington are either stuck in 1995 or have confused today’s Moscow with Kiev. There’s no need to be like our neighbors, who to this day think that every day the sun rises only because of the State Department. Washington is not the center of the universe or the world. It’s time to get used to this. \\nIf you want to find coincidences in time and draw meaningful conclusions from them, then I have a better proposal. Today, November 15th, the leader of the FSB of Russia, Alexander Vasilevich Bortnikov, is celebrating his 65th birthday. I wish him every success in his hard work. If someone  wants to come up with conspiracy theories, then the arrest of Ulyukaev should at least be attributed to this special day and not some kind of phone call with Trump. Judging by the hysterical statements of the American supporters of Clinton, even Trump’s election would not have been possible without the active support of Russian intelligence. \\nWe will never know if this is actually true, but I suggest that we not make any excuses. It’s really quite cool when the Western propaganda machine speaks of the omnipotence of the immortal KGB. \\nAnd there’s no need to write off the arrest as a fight between clans within the country’s elite. Of course, there are clans and they are waging a tough fight against one another, but it is unlikely that any clan would like a situation in which anyone can be jailed regardless of their rank, position, and merit. After Ulyukaev’s arrest, it turns out that nothing, no position, gives immunity from justice. This situation is not beneficial for any clan. And it is becoming all the more clear that Vladimir Vladimirovich Putin is the driving force of the process of fighting against bureaucratic corruption.  \\nAnd finally, look at how warped various representatives of the non-systemic opposition and the pseudo-liberal media are. Just yesterday they were screaming on social networks about how everything is bad and terrible, corruption is everywhere, and no one is jailing senior officials. Well, last night they arrested Ulyukaev. Security forces are saying that they caught him red-handed. And what reaction do we see in the blogosphere and media? Cries about 1937, massive Putinist repressions, a disaster for the economy and the ruble, the night of the long knives, etc. I feel that soon this will be followed by calls to pay and repent. Ulyukaev has all the chances to become a prisoner of conscience and Khodorkovsky will stand in up in support of him. This is pathetic. \\n\\nThe new year is coming soon. I would like to make the wish that we’ll find a sane opposition under the Christmas tree or on new year’s eve. We’ll handle corruption and roads in one way or another.  \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742628422.6323981}