{"duration": 0.08567690849304199, "input_args": {"text": "'Tom Cahill | November 6, 2016 \\nA photo of an indigenous Standing Rock water protector on horseback facing down dozens of riot police is blowing up social media. \\nThe viral photo was circulated by filmmaker Larry Wright on Friday, and it quickly accumulated tens of thousands of engagements on Twitter. Wright described the photo as “incredible.” This photo from Standing Rock is incredible pic.twitter.com/aWeHSFh1VP \\n— Larry Wright (@refocusedmedia) November 5, 2016 \\nAfter inquiries from Twitter users about the origin of the viral photo, Wright pointed them to a GoFundMe page for “Standing Rock Rising,” which hosts not only the viral photo, but several other high-quality shots showcasing the nobility of the Standing Rock protesters at the Dakota Access Pipeline construction site, particularly in the face of countless state resources aimed at ousting them from treaty-protected land. The original source of the viral photo on Standing Rock Rising’s Facebook page has over 16,000 shares as of this writing. \\nDEFEND THE SACRED \\nPosted by Standing Rock Rising on Wednesday, November 2, 2016 \\n“What an incredibly powerful photo,” wrote Chris Ashby-Zwozdiak in the comments. “The civilised vs the uncivilised, predatory, and despicable mob. I stand with you Standing Rock, all indigenous peoples, and with all those who continue to fight for environmental and social justice for all.” \\n“This reminds me so much of the Tiananmen Square massacre that saw China’s People’s Liberation Army gun down hundreds of civilians in a brutal crackdown on protests against government corruption, lack of transparency and freedom of speech,” wrote Catherine Davies van Zoen. “This photo here will become just as much an icon of shame to the USA police as the other one is to the Chinese military.” \\nRyan Redhawk, a photojournalist from Atlanta, is revealed as the photographer behind Standing Rock Rising. Redhawk is aiming to crowdfund $15,000 , of which over $11,000 has already been raised, saying the goal of his work is to “help spread awareness for activism and social change across the United States.” Redhawk is planning to stay at Standing Rock throughout the cold winter months, documenting the indigenous resistance to the Dakota Access Pipeline, even walking away from his two current jobs to devote 100 percent of his time to the project. \\n“This project means so much to me, because I deeply feel the Native Americans are being forgotten in general American culture, and something as rich as their roots should live on forever,” Redhawk wrote. “I want to see them be brought back to light as the original Americans. After all, this was their land, before it was our[s].” \\n\\nTom Cahill is a writer for US Uncut based in the Pacific Northwest. He specializes in coverage of political, economic, and environmental news. You can contact him via email at [email protected] '"}, "time": 1742563582.3315446}