{"duration": 0.06082963943481445, "input_args": {"text": "'Born Mary Grace, a    North Texas child is now officially named Max. His parents petitioned a court to change all of his legal documents, including his name, birth certificate, and Social Security card to reflect his male name and identity. [Max Briggle’s mother Amber told WFAA: “He’s always going to be transgender, but having that piece of paper, my hope is that it’s going to make it a little easier for him. ”  She called these changes, “another milestone,” and believed the new paperwork was essential for her child while the state legislature debates the proposed “bathroom bill,” SB 6. If passed into law, this legislation would mandate people use bathrooms based on the gender shown on their birth certificates. Amber and husband Adam, who reside outside of Dallas in Denton, became visible advocates for transgender children as the “bathroom bill” debate heated up nationally and in Texas. Max, then MG, became the face of Texas trans kids when his parents invited Attorney General Ken Paxton to dinner at their home. The family wanted to show Paxton they were a “  normal, remarkably unremarkable family,” according to The Dallas Morning News. Paxton and his wife accepted the invitation. The AG lead a   lawsuit against the former Obama administration over a transgender directive that advised public school students could use the bathroom and other facilities based on “gender identity. ” Ultimately, a federal judge blocked the Obama transgender guidelines. “As long as we’re going to pass laws saying which facilities you can and can’t use, it’s awfully nice to have a document saying he can use it,” said Amber Briggle. “At the same time, I just feel like it’s so unnecessary. Why do I have to change my son’s birth certificate so he can be treated like the boy that he is?” A changed birth certificate impacts more than bathrooms. In 2016, Texas public school superintendents resoundingly approved the University Interscholastic League’s (UIL) amendment requiring that school districts use a  ’s birth certificate to determine gender identification if questioned, as reported by Breitbart Texas. The UIL is the state’s governing body for competitive public school athletics, music, and academic events. Recently, North Texas transgender teen athlete Mack Beggs, transitioning from female to male, competed on the girl’s wrestling team because of UIL rules, Breitbart Texas reported. Altering Max’s name required a letter from a physician meeting specific requirements and a court order. According to WFAA, Texas Health  Human Services said only 34 people in the entire state met these requirements and could change their vital documents last year. In this case, the Briggle family went through the U. S. State Department to amend their trans child’s birth certificate since he was born in The Netherlands. The State Department issues a Consular Report of Birth Abroad (CRBA) when American children are born in a foreign country. That document now states Max’s sex as male. A CRBA functions as a birth certificate for all official purposes. Amber Briggle believes going through the State Department simplified the lengthy process. “The fact that he was born abroad made it significantly easier for us than had he been born here in Texas,” she said. “In which case, I’m not sure it would have happened at all. At least not at this age. ” The family now plans to have a “ ” baby shower to commemorate the revised paperwork. “I want to have a baby shower for my baby boy,” said Amber Briggle. “He’s always been my son. But it’s been this very long, gradual process over nine years for us to get to this point, and I feel like that needs to be recognized. ” Follow Merrill Hope, a member of the original Breitbart Texas team, on Twitter.'"}, "time": 1742563151.899839}