{"duration": 0.03627800941467285, "input_args": {"text": "'Hillary Campaign Hates to Pander to those “F*CKING DUMB” Millennials Hillary Campaign Hates to Pander to those “F*CKING DUMB” Millennials Breaking News By Amy Moreno October 28, 2016 \\nOne thing we’ve learned from the Wikileaks emails is that Hillary’s campaign is filled with nasty “Mean Girls” who name call and treat people, who are supposed to be their “friends” and co-workers” like garbage. \\nThey’re a miserable, angry bunch. \\nThey’ve called Bernie a “doofus,” Hillary an “idiot,” and a whole host of other rude and nasty names. \\nNow, we’re learning that the campaign hates pandering to millennials – having to do the “f*cking dumb” CRAP they think is “cool.” \\nGee, that’s the spirit! \\nFrom Infowars : \\nA new email released by Wikileaks as part of the Podesta dump features Hillary ally Wendy Bronfein advising Clinton campaign chairman John Podesta on how to reach “f**king dumb” young people. \\nMarketing executive Bronfein tells Podesta that Clinton “may not be the best face” to attract younger voters and that she needs to utilize “trending figures” as par of an “infusion to pull younger voters” because “that’s the crap that young people pay attention to”. \\nBronfein goes on to state, “It’s f**king dumb but being “cool” counts for more than it maybe should.” \\nShe references Bill Clinton’s saxophone playing as an example of this before asserting, “I hate to generalize a generation but by social media nature, they “follow”. So if someone they identify as cool endorses – they will likely fall in line with that candidate.” \\nSeriously, why would anyone vote for this vile old hag? This is a movement – we are the political OUTSIDERS fighting against the FAILED GLOBAL ESTABLISHMENT! Join the resistance and help us fight to put America First! Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742563186.0462003}