{"duration": 0.32051920890808105, "input_args": {"text": "'Email \\nAs a leftist and as a woman, I have always been aware how important language is to our social, political and interpersonal functioning. Moreover, as a female from any culture in the world, you learn from birth that not only does your body define who you are to others , the language through which you are defined and described does as well. Women especially understand the the nuances of language that underpin our experiences such that we are the object of “lady jokes” about female presidents and “that time of the month” (what if she starts a nuclear war?) and about those sexually uptight feminists who just need a good fuck to get over their “prudishness” about being cat-called. What language ends up evoking, however, is inevitably caught in a double bind as women are forever cast within the conterminous liberatory and carceral limits of meaning. The language used to describe females is inevitably a reflection of the social and political bigotry whereby language is never really precise and as employed is always too much or too little. \\nFredric Jameson’s The Prison-House of Language provides a critical account of the structuralist movement in the social sciences focussing on the likes of Ferdinand de Saussure whose work Jameson regards as far too removed from historical and material reality. Warning the reader against the trap of “ideological closure” within language, Jameson seeks to avoid the confinement that language imposes through what he deems as the “prison-house of language.” \\nIn a bizarre reversal of Jameson’s critique, we are in the throes of new culture wars that are far removed from Robert Mapplethorpe’s photography of black male bodies invigilated by conservative, Christian adherent, Jesse Helms. Instead, we are living through a moment when the liberal sector of society is, instead of image constabulary, undertaking some rather Draconian forms of language policing. Composed of a university student and twenty-something population, this movement harbours a profoundly conserve narrative, albeit couched as “progressive,” whereby the names we call ourselves are imposed upon others. \\nThe major battleground for this debate is at the University of Toronto where psychology professor, Jordan Peterson, has come under fire for critiquing Federal Bill C-16 . Under this bill is the proposal to amend the Canadian Human Rights Act and the Criminal Code whereby added to the list of prosecutable offences could include the “misuse” of pronouns. On 27 September, Peterson made the first of a series of videos which takes aim at “political correctness” at the legislative level and to a lesser degree, within his university. The current scandal is focussed on Peterson’s videos and his refusal to use “preferred pronouns,” arguing that Bill C-16 \\nWhile Peterson is certainly not a leftist and could be more accurately described as a Libertarian, his critique of the surveillance and control of language is one which resonates across the aisle because it arbitrates the current attacks on free speech by social justice warriors of the ostensible left. I include this word “ostensible” since many of these attacks over language and pronouns revolve around identity politics which the left is almost unilaterally solidly opposed to except when the identity is couched through emotions. Couching his argument purely in terms of the freedom of speech, Peterson points out the serious dangers inherent within this proposed legislation: \\nIt is one thing to tell people what they can’t say, but it is a completely different thing—an absolutely differently thing—to legislate what they have to say. And that’s a line that I don’t think we should cross…There is the inference,…the stated demand, that if someone wants to be addressed a certain way because they have certain emotional requirements, I am now legally compelled to comply with that. And that’s what I won’t do… Except that there is reasonable debate to be had about biology, sexuality, and culture and the attempt to ram through a particular conception of that into legislation and policy far too rapidly and in a staggeringly ill-advised manner. \\nAs he has been evolving his thoughts on this subject open acknowledging that he is still coming to terms with the repercussions by this bill, in another interview with the CBC (Canadian Broadcasting Corporation), Peterson expounds upon why he doesn’t recognize another person’s right to determine what pronouns he uses to address people: \\nThat’s right. I don’t recognize that. I don’t recognize another person’s right to decide what words I’m going to use, especially when the words they want me to use, first of all, are non-standard elements of the English language and they are constructs of a small coterie of ideologically motivated people. They might have a point but I’m not going to say their words for them…I’m not claiming that a person is free to use any words, in any context. But what I’m saying is that I’m not willing to mouth words that I think have been created for ideological purposes. \\nPeterson’s words have resonated throughout the University of Toronto community—faculty and students alike— and beyond. His videos and interviews have raised important questions for those of us on the left to address. Ultimately, Peterson asks if the ideas we hold so dear on the left (or the right) should be protected to such a degree that laws need be passed to proscribe how we grammatically refer to the intrinsic identity of the other forcing the subject to feed into what Peterson calls the “ideological game” of the other. If so, who decides which side of this debate becomes legally protected? And how does putting legal protections on ideology create a political environment of totalitarianism where only certain narratives are deemed relevant, others not at all? \\nThe mere fact that you don’t cause conflict in the present, or don’t hurt someone’s feelings in the present is no indication that you are acting in their best interests in the medium to long run. It would be a lovely world if the way we could set things right would be to make sure that no one’s feathers ever get ruffled in the present. And that is absolutely absurd. And the idea that the fundamental doctrine governing discourse should be “Don’t hurt someone’s feelings,” that is completely absurd. The fundamental doctrine governing communication should be stringent attempts to speak the truth and to listen. So you speak the truth–what you think to be the truth–so you can help clarify the nature of the world and then you engage in dialogue with other people and you listen on the off-chance that you have made a mistake and that the tool kit that you are using to work in the world could be improved. \\nTaking the view that we need to have rational arguments about pronouns, Peterson confirms that he refuses to be the “mouthpiece” of any ideology: “The fastest way to make yourself sick is to not choose your words carefully. And that is the fastest to make your “sickness” make society “sick” too. And I think that is one of the great lessons of the twentieth century. It is the pathologisation of thought and speech, and then the pathologisation of action, because that is what follows the pathologisation of speech and thought. I’m not going down that road.” \\nPeterson also speaks of the impracticalities of this measure, the potential illegalities now posed against the freedom of speech, and the potentiality that this law could make the use of pronouns fall under hate speech laws. With a measured, reasonable approach to public debate, Peterson’s evaluation of Bill C-16 and his worry about the freedom of expression , he has been met with a fury of social justice worker’s ire and insults, to include the public and media being subject to violence as documented by Laura Southern . \\nYet despite the violences he and the pro-free speech side of this debate endured, Peterson received a letter from the University of Toronto mentioning complaints from students, employees, and other individuals which call Peterson’s comments “unacceptable, emotionally disturbing and painful.” The letter also states that some members of the University of Toronto community have expressed fears for their safety in the wake of actions on campus following the release of Peterson’s YouTube videos: “We trust that these impacts on students and others were not your intention in making these remarks,” the letter states. “However, in view of these impacts, as well as the requirements of the Ontario Human Rights Code, we urge you to stop repeating these statements.” \\nFor how can one person’s refusal to use a specific pronoun actually result in the lack of safety or the creation of fear? I might think that I am the best singer in the world, but opening my mouth to sing even one bar from “La Traviata” would most certainly result in anyone within earshot quickly plugging their ears with their fingers and cringing from the pain of my voice. Even though my feelings might be hurt because people do not say I am best thing since Callas, this fact alone should not dictate my power to impose upon people my identity as “the best opera singer ever.” \\nPeterson has to date received two letters of reprimand and warning, although just last week the University of Toronto has agreed to host a public debate on Bill C-16 and the freedom of speech. For Peterson this is welcome news north of the border. However in New York a similar debate has only recently begun as NYU Clinical Assistant Professor of Liberal Studies, Michael Rectenwald , has been critiquing the culture of trigger warnings, safe spaces and surveillance on universities campuses around the country. Using an undercover Twitter account Deplorable NYU Prof , Rectenwald claims to “[expose] the viral identity politics of academia and its destruction of academic integrity.” Unlike Peterson, Rectenwald does not view this situation of academic control within academia as linked to political correctness as he told the Washington Square News : “My contention is that the trigger warning, safe spaces and bias hotline reporting is not politically correct. It is insane. This stuff is producing a culture of hypervigilance, self-surveillance and panopticism…This kind of left that we’re talking about: the SJW—identity-politics left—it’s not political; it’s religious.” Rectenwald was forced to go on paid leave through the end of the semester. \\nIt has been recently theorised that the way Internet algorithms are written, direct us toward articles, websites, and search results that reflect our own ideological mindset. This current explains why online discussions in recent years have become so silenced by agreement and worse, where humans’ collective inability to tolerate dissent, difference or disagreement is alarming. Hence, most of us tend to use the Internet today to confirm that which we already know, our own private echo chamber which is further reflected by social media . Peterson’s pushback against the policing of language and thought should be discussed openly and without stigma. And more importantly, we need to be reaching across to political actors with whom we might otherwise have nothing in common politically. The larger issues posed by the interception and control of free speech always turns back to the political tendency of who is controlling and who is controlled. \\nSome Black Guy has put this entire debate into context by laughing at the absurdity that one person can be vilified and positioned as another’s enemy simply for refusing the “preferred pronouns.” Laughing at the notion that this refusal to engage in preferred pronouns constitutes murder, Some Black Guy observes how those labelling people who disagree “the enemy” are demanding to be “attended to.” And this is a thorn in any leftist support of such narratives which atomise the individual as sacred and where the collective or historical is necessarily “anti-progressive.” These are teleological explanations of the universe which posit the need for the complete control of language within the rationale of the violent other. We have been here before and it didn’t go well in any of those historical “rinse cycles.” \\nClearly if all the identitarians have up their sleeve is to enforce a Stasi-esque catechism of pronouns or else , then this debate has already been lost. To live in a free society means that all of us risk being offended, hurt, and emotionally tainted. To posture a 21st century “parental advisory” label to all speech means that we have not only entered into the echo chamber, but that we have firmly nailed it hermetically shut. Moreover, the pronouns we use to discuss ourselves as individuals can only occur in the first person singular, I. The minute we interact with the world, we enter into the second and third-person, the plural, as well as subject and object pronouns. I can only evoke myself through my own language—the language of I and me , of nouns, verbs, adjectives, and so forth. I question if we can institute à la Academie française a control of language that actually responds to identity such that feelings are linguistically matched to words and not further ensnared within the lack that language presents. \\nI also wonder if it is at reasonable to require people, under order of the state, to remember any one of several dozen identities with their presumably hyper-individualised pronouns. From a practical perspective this would be a nightmare as the number of identitarian words and pronouns are increasing rapidly. And from a legal direction, it would create the opposite effect: most people would avoid those who are deemed as “difficult” and this sort of mandated speech would set off a domino effect of other vocabulary which we might be, in the not-so-distant future, required to utter. We also need to consider if identity politics is part of a larger cultural pathology of hyper-individualised people who are acting out and who, well, may simply be difficult if not entirely controlling. At heart, requiring that one be spoken of with a specific pronoun is a clear form of control. We need to discuss as a society if we should be legally mandating language in order to accommodate people’s feelings and quasi-religious beliefs. \\nWhen asked about his motives and the potential trouble he could get into for speaking out, Peterson replies: \\nWell, the biggest reason is because not doing so will get you into far bigger trouble. This is another example of the conflict between emotional regulation in the present versus emotional regulation in the future….If free speech is under assault…then the amount of trouble you’re going to get into for standing up right now for your right to think what you need to, and say what you need to, and act the way you see fit–the trouble you are going to get into for doing that now is so trivial compared to the trouble you’re going to get into if this continues for the next ten years that they are not even in the same universe of conceptualisation. To me, by doing what I am doing, I am avoiding trouble, not causing it or not magnifying it for myself. People think what I have landed in constitutes “hot water” have no idea what “hot water” is. Compared to any real trouble, the trouble that I am having, it’s the trouble of someone who is unbelievably well-protected, who has financial stability, and lives in what’s still a free society, and who is protected by tenure. And god, if someone like that can’t stand up and say what he has to say out of fear then there’s just no hope. If that’s how careful I have to be, how is the normal person supposed to be able to talk? You know, I can barely do it and I’m being hyper alert. And that’s not free speech–that’s barely tolerated speech.'"}, "time": 1742563805.350049}