{"duration": 0.11666178703308105, "input_args": {"text": "'Vladimir Putin: The United States continues to sleep with al-Nusra ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board Breaking: Iraq’s Maliki Slashes Barzani for Kurdish-Israeli Alliance By GPD on October 27, 2016 Main Kurdish party slams Maliki for derogatory comments against president [ Editor’s Note : Maliki calls out Barzani is a tool of Israel in the region. He was prime minister (Maliki is a VT affiliate [meaning that we have direct contact with him…JD]…so we give him a break. ) when Mosul fell and has been blamed for army corruption. The Iraqi army is almost entirely Sunni, a minority in Iraq while the majority Shiites have formed militias to fight ISIS with the backing of Iran. The Sunni’s reached out to the Gulf States, Saudi Arabia, Israel, Turkey and Kurdistan because they weren’t enjoying the same power they had under Saddam. In answer, ISIS, a small Ramadi based extremist group was reborn at the hands of intelligence agencies and military leaders of Israel, the US and other states. It is our belief that the current move on Mosul is going to expose what has gone on. If Mosul is cleansed, Turkey, who really is “ISIS” will hang on in Iraq tied to the Erbil Kurds and their Israeli allies, as you see below… Gordon Duff ] \\nERBIL, Kurdistan Region – The Kurdistan Region’s largest political party on Thursday slammed former Iraqi prime minister Nouri al-Maliki for derogatory comments the previous day against Kurdistan and its President, Masoud Barzani. “Maliki’s role in inciting sectarianism, his entanglement in corruption and his harming of Iraq’s political, security and economic standing is clear to all Iraqis as well as the international community,” the KDP said in a statement. “He is disloyal. No one has been as helpful to Maliki as the Kurdish nation, Kurdistan’s political parties, especially the KDP,” the party said in a statement. \\nThe KDP, whose leader is Masoud Barzani, compared Maliki to one of Saddam Hussein’s most notorious henchmen. “The disloyalty he has shown and the crimes he has committed against the Kurdish nation are no lesser than the crimes of Ali Hasan al-Majid (chemical Ali). He was the indulged son of the US at some point, yet disloyal to them now,” the KDP statement added, referring to Maliki’s cooperation with US forces in the past. \\nIn an interview with Euronews aired Wednesday, Maliki lashed out at Barzani, accusing him of implementing Israel’s policy in the region, claiming, “Kurdistan will become the second Palestine in the future,” and adding that “Israeli sympathizers and elements are abundant in Kurdistan.” \\nMaliki, who is the secretary general of the Daawa Party and head of the State of Law Faction in parliament, slammed Barzani, saying the, “Kurdistan Region has become a strategic and developed platform for the implementation of the US-Israeli policy, and by Kurdistan I do not mean all the Kurds. I mean only Masoud Barzani and the Kurdistan Democratic Party .” \\nHe also blamed the Kurdistan Region for the presence of Turkish troops in the country. “The Turkish Army has come to Bashiqa by permission of the Kurdistan Region. The (Turkish) force has come through Ibrahim Khalil and Zakho Bridges, passing via Duhok and is positioned in Bashiqa now. The Kurdistan Region thinks that it is a neighbor and a friend of Iraq, not a part of Iraq,” charged Maliki, who is now a vice president. \\nThe KDP referred to Maliki’s “failed cabinet” and his failed army, which collapsed in the face of an ISIS onslaught in June 2014, fleeing without a fight and giving up large swathes of territory, including the city of Mosul. \\nHis “puppet army could not stand ISIS for two hours, giving away half of Iraq along with the military equipment and ammunition of six brigades to ISIS,” the KDP noted. \\nIt added that, “He built an army which had no allegiance to the country, but animosity to the Peshmerga. He is not happy to see the unprecedented coordination between the Peshmerga and the Iraqi Army which are fighting terrorism together, liberating the areas which his coward army gave to ISIS. Maliki is unhappy to see that the Peshmerga and the Iraqi forces are successful in fighting terror. He is just like the wounded bear that bites its wounds out of pain and desperation.” \\nThe KDP said, “We want to reassure him (Maliki) that Kurdistan’s borders are not the ones determined by Saddam Hussein and Maliki. The borders of Kurdistan are those which the Peshmerga have liberated from ISIS, and we will stay there. He should know that he will end up with nothing other than embarrassment in the face of the will of Kurdistan, the Peshmerga and the KDP.” \\nThe statement added that, “Maliki is dreaming of ruling Iraq again. It is impossible for him to run Iraq again. He cannot and is not entitled to run Kurdistan, even if he gets to run Iraq again.” \\nIt said that, “if Maliki had any honor, he would not have appeared on TV talking about Mosul and its liberation.”'"}, "time": 1742561815.6989102}