{"duration": 0.1014401912689209, "input_args": {"text": "'LEAWOOD, Kansas  —   Erica Massman, a moderate Kansas Republican, refers to the building where her daughter attends fourth grade as a public school. Ms. Massman’s mother, whose politics tilt further to the right, calls it something else: a government school. “My mother, who is a Tea Party person, started saying ‘government schools’ all the time,” said Ms. Massman, recalling when she first heard the phrase around 2010. “I remember thinking, ‘Wow. ’” Kansas has for years been the stage for a messy school funding fight that has shaken the Legislature and reached the State Supreme Court. Gov. Sam Brownback, a Republican, and his political allies threatened to defy the court on education spending and slashed income taxes in their effort to make the state a model of conservatism. Somewhere along the way, the term “government schools” entered the lexicon in place of references to the public school system. “Our local grade school is now the government school,” State Senator Forrest Knox wrote in an   article last year, echoing conservative concerns that the government had inserted itself unnecessarily into education. The intent was obvious to her, Ms. Massman said. “They are trying to rebrand public education,” she said. The use of the term has set off alarms even among some Republicans, who fear that it signals still less support, financially and otherwise, for the public schools in a state that had long felt pride over the quality of its education system. The recent adoption of a school finance plan that was acceptable to Mr. Brownback, the Legislature and the Kansas Supreme Court has not entirely assuaged those concerns. Davis Merritt, a columnist for The Wichita Eagle, said in a column in May that state legislators’ “deaf and blind” ideology was threatening public schools. “Some have begun to call public schools ‘government schools,’ a calculated pejorative scorning both education and anything related to government,” he wrote. That elicited a response from Bob Weeks, the host of “WichitaLiberty. TV,” a show about Kansas politics and public affairs. “It is surprising to me that liberals and progressives object to the term ‘government schools,’” he said on the show. “They like government, don’t they? These people want more taxation and government spending, don’t they? Well, when we think about our public schools, we find they have all the characteristics of government programs. ” Dave Trabert, the president of the Kansas Policy Institute, which advocates limited government, said in an interview: “It’s certainly something that some people use to kind of separate between what’s government and what’s not. Technically, it’s accurate. ” It would not be the first time that conservatives have used semantics to sway public opinion, experts said. George Lakoff, a linguistics professor at the University of California, Berkeley, has been tracking the trend for decades. He pointed out that the right has been more successful than the left at framing issues related to abortion, health care, labor unions and the concept of government itself, among other issues, with carefully contrived catchphrases: “Tax relief. ” “ . ” “The Democrat Party. ” “Death panels. ” (“Obamacare” was originally an attempt by the right to saddle President Obama with the repercussions of the Affordable Care Act, until he embraced the term himself.) Besides coining phrases, Dr. Lakoff said, the right has   certain words  —   a practice that was demonstrated, he said, in President George W. Bush’s second inaugural address, which used “freedom,” “free” or “liberty” 49 times in 20 minutes. “The right has taken over the words ‘freedom’ and ‘liberty,’” Dr. Lakoff said. Deborah Tannen, a professor of linguistics at Georgetown University, recalled the 1986 speech in which President Ronald Reagan framed perceptions of “government,” to great effect. “The nine most terrifying words in the English language are, ‘I’m from the government, and I’m here to help,’” he said. “People tend to trace the demonization of government to Reagan,” Dr. Tannen said. “That’s kind of iconic, how he was using it. He set the government up as the enemy. ” Conservatives in Kansas have extended the semantical positioning of “government” to education, conveying the message that public schools are a form of government imposition, Dr. Lakoff said. The phrase “government schools,” a common reference overseas to national school systems, has been around for decades as a way to differentiate them from privately financed schools. It has also been a label for schools on Native American reservations, and long used to influence debate. Senator Daniel Patrick Moynihan of New York used the phrase in 1978 to make the case for federal aid to private schools. “We have succeeded in providing equality only to those who enroll in government schools,” he said in a speech in New York. “We have failed the parents who prefer to send their children to the schools that are descended from the older, private school systems. ” The Libertarian Party borrowed that for its party platform in 1980. “Government schools lead to the indoctrination of children and interfere with the free choice of individuals,” the platform said. But only recently  —   and mostly in reliably conservative Kansas  —   has the term been used regularly and clearly as a political wedge. Education advocates in Kansas said they had heard it in conversations with state legislators (though few use it in public statements) in discussions about public schools on Facebook and on some conservative news sites. The use of the term “government schools” is part of a broad education agenda that includes restraining costs. The   and libertarian wings of the Republican Party are pushing the state to loosen its laws to allow more charter schools. They oppose programs that offer free or   breakfasts and lunches, believing that schools have become part of the “nanny state”  —   another politically charged term  —   and are usurping the role of parents. Last year, Mr. Knox lamented in his   article, published in a southern Kansas newspaper, that the government had become too intrusive in education. “Our children have become government children,” he wrote. John Locke, a professor of linguistics at the City University of New York, said that in some contexts the use of the word government had a positive connotation: government bonds and   programs, for example. “But among those archconservatives who, by nature or disposition, want less government, it can have a negative effect,” he said. He suggested, somewhat tongue in cheek, that swapping “government” for “public” could become a trend, with references to “government libraries,” “government parks”  —   even “government universities. ” “It’s austere,” Dr. Locke said. “It has an oppressive ring to it. It sounds rigid, the opposite of open or friendly or charming or congenial. The people who use that term are hoping those words will come to mind. ”'"}, "time": 1742562215.8182724}