{"duration": 0.1322174072265625, "input_args": {"text": "'For the first time since before the first time he ruined his own life  —   not to mention the second time, and the third  —   Anthony D. Weiner is off Twitter. This is the Democratic former congressman and repeat candidate for mayor of New York who extinguished his own political career with a series of lewd social media messages to strangers. The human implosion who spent years scrubbing the stains out of his reputation, with regular media appearances and Twitter commentary as the mop. The punch line who has now lost just about everything but his unfortunate name to revelations that he had, once again, exchanged sexually charged Twitter messages with a woman he had never met. But for Mr. Weiner, there always seemed to be something else to say. Normally too defiant to lie low, Mr. Weiner has always insisted he had no choice but to stay in the game. But in the wake of his third instance of scandal in five years, friends say he is wholly devastated and uncertain about the future. His wife, Huma Abedin, a top aide to Hillary Clinton, announced their separation on Monday. The Daily News and NY1, two of the media outlets that still offered him a platform for his ideas and his political expertise, have cut ties with him. Mr. Weiner has been seeing a therapist, according to one friend who spoke to him recently. To talk about Mr. Weiner is to deal in metaphor and allegory his problems must always mean something else. Amateur psychoanalysts are, suddenly, everywhere, the way sexting experts were in the days after his 2011 resignation from Congress. His basic humanity is obscured by the public character he and the New York news media  —   the world’s biggest, hungriest pack of journalists  —   jointly conspired to create: Anthony Weiner, loudmouth liberal hero from Brooklyn turned tragic hero of tabloid proportions. He continues to be the easiest of targets. “It’s sad and a little bit ironic that a guy who understood the intersection of politics and technology and media better than anyone, and exploited it better than anyone to fuel his rise, fell because of it,” said Stu Loeser, a former spokesman for Senator Chuck Schumer and former Mayor Michael R. Bloomberg. Mr. Loeser has known Mr. Weiner since working for Mr. Schumer, Mr. Weiner’s old mentor, in the early 2000s. “Removing himself from the public conversation, he’s taking himself out of the part of the equation that has proven again and again to be part of his downfall,” Mr. Loeser said. If giving up his microphone was an attempt by Mr. Weiner to reclaim private citizenship, it may have come too late. A former public official with a powerful wife who never seemed quite convinced that he belonged out of the spotlight, Mr. Weiner was unreluctantly dragged back into it time after time by a public that refused to avert its eyes from him. (His recent turn as the subject of “Weiner,” the documentary released this year that chronicled the abrupt collapse of his 2013 mayoral bid amid revelations that he had sent sexually charged photos to admirers under the pseudonym “Carlos Danger,” did not help.) Friends and associates contacted for this article, most of whom asked to remain anonymous because they did not wish to be seen as inflaming the spectacle, said his near silence seemed to reflect an acknowledgment of the depth of the crisis confronting him and his marriage. Mr. Weiner has told friends that he feels deeply remorseful about the fresh humiliation the documentary dredged up for his wife. And in recent months, as Ms. Abedin shadowed Mrs. Clinton on the presidential campaign trail, Mr. Weiner felt he owed it to his wife to embrace a supporting role. At home with their    son, Jordan, Mr. Weiner kept busy cooking the Blue Apron meals Ms. Abedin ordered for them. “I think one of the blessings, in his mind, of the first scandal was how much time he did get to spend with Jordan,” a person who is friendly with Mr. Weiner said, explaining that if he had remained in Congress, he would have seen his son infrequently. “The time with Jordan  —   he really seemed to enjoy and thrive on it. ” The latest blast of scandal was especially shattering to Mr. Weiner, three of these people said, because he was what they described as an intensely caring and devoted father to Jordan, who appeared, asleep, in one of the photographs of Mr. Weiner’s crotch. On Wednesday, The New York Post reported that the city’s Administration for Children’s Services had opened an investigation into Mr. Weiner’s treatment of his son. Mr. Weiner, in his only comment to The New York Times, said via email, “We haven’t been contacted by A. C. S. ” An agency spokeswoman, citing privacy, said it could not comment on whether a case had been opened. In the documentary, Mr. Weiner explains that his virtual encounters were like a “video game” to him. But several of his friends and associates said Mr. Weiner’s third indiscretion had convinced them that he had an addiction or another clinical disorder, though he has denied as much in the past. With Mr. Weiner’s every round of   the hallmarks of addiction seem increasingly to apply, though the psychiatrists interviewed for this article emphasized that they could not give a diagnosis for Mr. Weiner without evaluating him in person. “There’s behavior where you can’t stop what you’re doing, and it makes no sense,” said Dr. Kenneth P. Rosenberg, an addiction psychiatrist and clinical associate professor at     Cornell Medical Center. “If it crosses over the threshold of causing significant problems for you  —   personal, occupational, social problems  —   then in my mind, you’ve earned the diagnosis of addiction. ” Asked by Bloomberg News in January why he continued to use social media, Mr. Weiner portrayed the activity as part of his professional and civic identity. “I have no choice but to not let it debilitate me,” he said, referring to the scandals. “It also doesn’t make me care any less, or make me think that if I have something clever to say on Twitter I shouldn’t say it, or if I have an idea I shouldn’t espouse it, or if I have a company that needs my help I shouldn’t help, or if someone calls me for advice on how to run for office I shouldn’t sit down with him. I don’t know what my alternative is. ” He repeated the argument as he granted an interview to The New York Times Magazine appeared on Stephen Colbert’s and Bill Maher’s television shows during the week of the Democratic National Convention, among other television forays penned columns in The Daily News and continued to joust and kibitz with reporters, ideological adversaries and random people on Twitter. Mr. Loeser offered Mr. Weiner, whom he called a “flawed genius,” a flicker of hope that he could find a way to stay engaged: Mr. Weiner’s mastery of liberal crosscurrents and media appetite would make him, in Mr. Loeser’s estimation, a smart person to hire for any organization looking to push a message. (Mr. Weiner has also acted as a consultant for private clients.) This will be Mr. Weiner’s third stab at addressing a scandal of his own making. The last time, he held a news conference, his wife smiling at his side. This time, however, there is no public constituency he is obligated to address  —   only public curiosity, waiting, insatiably, for answers.'"}, "time": 1742561985.059098}