{"duration": 0.14184951782226562, "input_args": {"text": "'WASHINGTON  —   The F. B. I. had a job offer for Nick Young, a veteran Washington transit officer: Become an undercover informant for the bureau and gather information at local mosques on fellow Muslims who might pose a terrorism threat. The clandestine work would be “a lot sexier” than his current job, Mr. Young remembered an agent named Ryan telling him. And it could pay him a lot of money if the intelligence was good. Mr. Young turned him down. But it would not be the last time he would see the F. B. I. agent. Last August, five years later, Mr. Young was summoned to the headquarters of the transit agency, Metro, where Ryan and other agents were waiting for him. “You probably don’t recognize me, do you?” Ryan, whose beard was now thicker, asked him. “Oh, I recognize you,” Mr. Young said. This time, the agent handcuffed Mr. Young on a charge of supporting the Islamic State  —   a case built, in a twist, by an informant who posed as a   terrorist fighter. The prosecution of Mr. Young, the only law enforcement officer among more than 100 Americans who have been accused of helping the Islamic State, offers a revealing look at the F. B. I. ’s shadowy    efforts to identify possible Islamic extremists. President Trump has vowed to intensify the effort as part of a campaign to “annihilate” the militant group. Mr. Young’s case also poses a challenge to the F. B. I. ’s expanding use of undercover operations to identify Islamic State sympathizers inside the United States who might travel overseas to help the terrorist group or commit “lone wolf” attacks at home. His lawyer claims that the F. B. I. entrapped him, with undercover operatives popping in and out of his life for at least six years. To law enforcement officials, however, Mr. Young represents one of their worst fears: a longtime officer, with access to sensitive facilities, who they suspect was “radicalized” to support Islamic extremism. He is charged with providing “material support” to the Islamic State, in the form of $245 worth of Google Play gift cards. The authorities say he gave the gift cards to a Muslim friend named Mo  —   in reality, an undercover informant  —   to support recruitment for the terrorist group. Before now, very few American suspects linked to the Islamic State have spoken out. But in three and a half hours of interviews from jail, Mr. Young, a convert to Islam, portrayed himself and many other American Muslims under investigation as victims of religious persecution. He accused an “overzealous” F. B. I. of “manufacturing” the case. “I know for sure I wouldn’t have been targeted if I was an evangelic Christian or a Sikh or a Hindu or something,” said Mr. Young, 37. “I’m not a terrorist,” he added. “Seeing these horrible allegations and the way they’re trying to paint me, it’s just a nightmare. ” Officials at the F. B. I. and the Justice Department declined to comment on the case. In general, the F. B. I. said in a statement, the investigative techniques used in such national security cases “are subject to vigorous oversight and require us to use the least intrusive means possible. ” The F. B. I. has moved aggressively since the rise of the Islamic State in 2014 to identify suspected extremist supporters inside the United States, opening hundreds of investigations and generating convictions from Brooklyn to Southern California, often against young Muslim men. Mr. Trump has declared that the country must do more to confront what he calls “radical Islamic terrorism,” including the possibility of expanding surveillance and intelligence operations, creating a “registry” of American Muslims, and reviving torture as an interrogation technique. While Mr. Trump has sent mixed signals on some of those proposals, they have worried some civil liberties advocates, who say they are eager to see whether the Justice Department and the F. B. I. seek to expand their investigative powers still further in domestic terrorism cases. Mr. Young sees himself as a pawn in that broader fight. He acknowledges holding passionate views about the Middle East and the “slaughter” of Syrians by the government of President Bashar  . On breaks from the transit agency, Mr. Young traveled to Libya twice in 2011 with body armor to join rebels fighting the Qaddafi regime. “I didn’t kill anyone while I was there,” he said, laughing, but “I got shot at a lot. ” He insisted that he had never supported terrorists. He plans to take the witness stand at his trial, an unusual tactic for a terrorism suspect. “Nick doesn’t have anything to hide,” said Nicholas D. Smith, one of his lawyers. As he waits for his trial date, he sits in a rural jail in Warsaw, Va. reading science fiction occasionally, with “The Jerry Springer Show” sometimes playing on a television in the background. “My brain’s turning to mush,” he said. He said the jail had denied him access to Muslim prayer sessions. But the conditions are far better, he added, than the solitary confinement he was placed in for 23 hours a day for months after his arrest. That ordeal, he said, has caused lingering panic attacks and other problems. Unlike the bulk of the Americans charged with supporting the Islamic State, Mr. Young is not accused of plotting violence or trying to travel to the Middle East to fight with the group. He said he was under investigation for so long, it was almost inevitable that the authorities would find a way to charge him. “At the end of the day, the crime I’m being accused of  —   a crime of sending gift cards  —   it would be laughable if it wasn’t really happening,” Mr. Young said. He declined to explain the gift cards, citing a pretrial order that restricts what he can say about documents in the case. But he said his explanation would come out at his trial. Since the Sept. 11, 2001, attacks, dozens of terrorism defendants caught in undercover stings have claimed in court that they were illegally entrapped into saying or doing incriminating things. None have succeeded. Judges have given the Justice Department wide latitude in using undercover stings in terrorism cases. “You almost need a perfect case” to prove entrapment, said Seamus Hughes, a terrorism expert at George Washington University’s Program on Extremism, “and that’s difficult to find. ” Still, several legal analysts said Mr. Young might have a legitimate shot, because of the unusual elements of the F. B. I. ’s yearslong undercover investigation. They point out that even an    charge that Mr. Young faces is based on his statements to agents about a fictional F. B. I. investigation into the whereabouts of a   Islamic State fighter who never existed. Mr. Young apparently first came onto the F. B. I. ’s radar around 2010 because he knew a fellow student at George Mason University, Zachary A. Chesser, who, like him, was a white convert to Islam from Northern Virginia and attended the same mosque. The F. B. I. interviewed Mr. Young that year as part of an investigation into Mr. Chesser, who ultimately pleaded guilty to   charges after he was accused of threatening the creators of “South Park” over the show’s depiction of the Prophet Muhammad. Mr. Young does not appear to have been an F. B. I. target at the time, even as undercover informants began giving the bureau reports about the activities of him and some of his associates. He continued working as an armed officer patrolling   subways and bus lines. He said F. B. I. agents  —   Ryan and a second agent  —   had met with him twice in 2011 to recruit him as an informant. Mr. Young said he found the idea of becoming an informant distasteful. The F. B. I. said in a court affidavit that he had used stronger language in a conversation with one of the bureau’s undercover informants, saying that if he were ever betrayed by one, “that person’s head would be in a cinder block” at the bottom of a lake. Based on wiretaps and statements from informants, the F. B. I. reported that Mr. Young had made a number of other incendiary and perhaps even threatening comments over the years about Muslim informants, F. B. I. investigators and “kaffirs”  —   or nonbelievers. Mr. Young acknowledged that he could have used “a little  ” in some of his private remarks. But he said he had never meant them to be taken literally. “Everyone’s capable of saying stupid, blustery things,” said Mr. Smith, his lawyer. Some F. B. I. officials pressed to bring criminal charges against Mr. Young years ago, but the Justice Department rebuffed them because of an apparent lack of evidence that he was involved in supporting terrorism, according to law enforcement officials. It was not until 2014 that Mr. Young crossed the line into supporting terrorism, the Justice Department now alleges. That was when he first met Mo, a Middle Easterner who said he was a military reservist, at a mosque where he prayed. Mr. Young said he had suspected early on that Mo might be an informant because of his strange mannerisms. But his concerns eased, and the two became friends, meeting at a Starbucks or elsewhere. Mo later told Mr. Young that he was thinking of traveling to Syria to join the Islamic State, prosecutors said. While Mr. Young sometimes appeared to offer Mo advice on how best to avoid government scrutiny if he went to the Middle East, he also told him at times that he did not need to join the terrorist group  —   at least not then, according to the F. B. I. ’s account. “There is no one with a gun to your head that is counting down,” he told Mo in a conversation recorded in October 2014. Such statements, said Mr. Smith, his lawyer, show that “the government is really grasping at straws here. ” Prosecutors are acting on “really more of a hunch that he might commit crimes in the future,” he said, “and they can’t prove it. ”'"}, "time": 1742562245.3275163}