{"duration": 0.06572794914245605, "input_args": {"text": "'Hillary Clinton’s former campaign chief John Podesta attacked the First Amendment rights of the free press as he continued to spin his conspiracy theory of Russia colluding with American news websites to damage Democrats. [During a conversation with the Washington Post’s Karen Tumulty, he cited the “participation and the support of the   media,” naming “guys like Sean Hannity” and “disgusting” Newt Gingrich for helping spread “fake news” to hurt Democrats. He specifically criticized Hannity and Gingrich for asking questions about DNC staffer Seth Rich’s murder and whether or not it had a connection with Wikileaks.  Podesta explained that it was one more example of how the Russians were “very active in propagating and distributing fake news, working with these   sites in conjunction with them. ” He also cited an “echo system” created by the Russians that raised the social media profile of articles that were damaging to Democrats. He pointed out that “legitimate sites” like the Washington Post and the New York Times suffered, as other “ ” websites got more traction during the election. Podesta blamed websites in the United States for publishing emails from Emmanuel Macron during the French presidential election to influence the outcome. “The first reports of them came from U. S.   sites back into France,” he said. “This is a global phenomena. ” He praised the French media for helping censor the information to stop it from damaging Macron’s campaign. “I think unfortunately for us, but maybe fortunately for the world, I think the French press was more sensitive to it,” he said, praising them for helping Macron “win by a landslide” after censoring their reporting on the hacked emails. He suggested that the American media should have done the same things with his leaked emails. “I didn’t feel like that really happened last fall   …     the mainstream U. S. press was much more interested in the gossip,” he said. Podesta warned the media about Russia’s efforts to use the emails to hurt Democrats, pointedly directing them to be more responsible. He suggested that the media should have helped the Clinton campaign fuel the Russian angle, instead of reporting on his emails. “I think if you contextualize it  —   if you say that ‘The Russians are coming,’ and ‘The Russians are here’  —   that can give people a sense of that they need to be more careful in the way they assess what they’re hearing and what they’re seeing and what’s being peddled,” he said. He described the period of leaks as “the Soviet days” and griped that the “low burn” of email stories helped revive questions about Clinton’s own private emails. “We hadn’t put it to bed completely,” he admitted.'"}, "time": 1742562744.789921}