{"duration": 0.05183267593383789, "input_args": {"text": "'All is fair in love and war, and this particular electoral battle in US politics has assumed more belligerent proportions than most. Neither Donald Trump nor Hillary Clinton genuinely deserve to be in the White House, but elections are rarely fought, let alone won, on the issue of the deserving.\\nAs the election moves into it’s the cracker phase, Trump is scrapping his way back in the polls, ever the immeasurable factor in this election. For the establishment, the battle is already won, creating a dangerous sense of entitlement for the Democratic nominee.\\nThat sense of entitlement shone through in the latest fury from the Clinton campaign, nervous about the FBI’s foray into the last days of this election. As ever, it was that seedy matter of emails sent on a private server when she was Secretary of State that came bobbing back up.\\nOn Friday, Director James B. Comey sent a letter to the US Congress noting that he was wishing, due to “recent developments” to “supplement” previous testimony on the previous and closed investigation into Clinton’s use of a private server. “In connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation.” [1]\\nThat unrelated case involved emails discovered on the laptop of disgraced former congressman Anthony D. Weiner, and a Clinton aide and Weiner’s estranged wife, Huma Abedin. Clinton found herself back in the frame.\\nImaginations started to gallop, notably at the open nature of the remarks. The investigation would involve the old issue of whether classified information had been involved, and whether relevant emails would be pertinent to the investigation.\\nNo sense of scope, length or frame of the investigation was given: “Although the FBI cannot yet assess whether or not this material may be significant, and I cannot predict how long it will take us to complete this additional work, I believe it is important to update your Committees about our efforts in light of my previous testimony.”\\nPreviously, Comey railroaded efforts to bring charges against Clinton’s misuse of classified material despite noting “evidence of potential violations of the statutes regarding the handling of information.” In so doing, he did acknowledge that prosecutors ponder a “number of factors before bringing charges.” These include “the context of a person’s actions, and how similar situations have been handled in the past” and “the strength of the evidence, especially regarding intent.”\\nWhile his then recommendation for non-prosecution was hardly binding on the Attorney-General, it would have been irregular to expect a prosecution in absence of hearty approval from the FBI. The result, or so thought those manning the barricades of the Clinton campaign, was permitted to rest.\\nThis naturally unleashed a hailstorm of speculation from such figures as Rush Limbaugh, who pondered whether there had been an element of connivance between the Obama administration, Comey and Clinton. Tom Fitton of Judicial Watch saw “a disconnect between Comey’s devastating findings and his weak recommendation not to prosecute Hillary Clinton.” [2]\\nThis “disconnect” has been a feature of the entire discussion about Email Gate. For one, President Barack Obama, despite being an enthusiast for prosecuting whistleblowers who disclose classified information for a perceived higher ideal for information transparency, did not see a legal problem with Clinton’s use of a personal email server.\\nIt was “not a situation in which America’s national security was endangered” even if it was imprudent. [3] Rather confidently, and in a manner befitting premature judgement, Obama insisted in April this year that Clinton “would never intentionally put America in any kind of jeopardy.”\\nCertain outlets of legal commentary, notably Lawfare , have taken note about the entire background surrounding Comey’s moves as murky and compromising for a range of parties. Attorney-General Loretta Lynch, for one, had been compromised by the President’s certitude on the subject of Clinton’s behaviour, a point made even more complicated by a promise – albeit one made by Clinton – that Lynch would continue to remain AG in her administration. [4]\\nIn then testifying before Congress about his own decision not to prosecute, an investigation was essentially being given dramatic air time. Truly, we were bearing witness to another Clinton saga, the legal equivalent of constipation in an ailing Republic. “As a general matter,” lamented Benjamin Wittes of the Brookings Institution, “when prosecutors and investigators decline to indict someone, we don’t want a report, much less congressional oversight of the unindicted conduct. We want them to shut the heck up.” [5]\\nThere was, however, no shutting up Comey, who is making more electoral history than is customary for a law enforcement organisation. It baffled Clinton, who has persistently wished the email matter to disappear in a confusing haze. Nor did Comey listen to senior Justice Department officials, who attempted to dissuade the move to send the letter. [6] “Never in recent history,” claimed the New York Times , “has the FBI been so enmeshed in a presidential race.” [7]\\nThe FBI director’s intervention has already inflicted range of shocks, though it is imprecise to what extent his own announcement will alter set minds or convince the confused. Trump, most certainly, was emboldened, and the unpopularity contest is set for a few more hiccups prior to the November 8 poll.\\nNotes.\\n[1] http://www.nytimes.com/interactive/2016/10/28/us/politics/fbi-letter.html?_r=0\\n[2] http://www.breitbart.com/2016-presidential-race/2016/07/05/republicans-and-conservatives-assail-fbis-decision-not-to-indict-hillary-clinton/\\n[3] http://www.nytimes.com/2015/10/12/us/politics/obama-tells-60-minutes-hillary-clinton-made-email-mistake.html\\n[4] https://www.lawfareblog.com/james-comey-hillary-clinton-and-email-investigation-guide-perplexed\\n[5] https://www.lawfareblog.com/comeys-testimony-precedent\\n[6] http://www.nytimes.com/2016/10/30/us/politics/comey-clinton-email-justice.html?hp&action=click&pgtype=Homepage&clickSource=story-heading&module=first-column-region&region=top-news&WT.nav=top-news\\n[7] http://www.nytimes.com/2016/10/31/us/politics/fbi-hillary-clinton-emails.html\\n Binoy Kampmark was a Commonwealth Scholar at Selwyn College, Cambridge. He lectures at RMIT University, Melbourne. Email: bkampmark@gmail.com'"}, "time": 1742628423.7088323}