{"duration": 0.2398831844329834, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name => Screenwriter Aaron Sorkin isn't happy. Credit: VDare.com. \\nSt Thomas Aquinas told us that one of the pleasures enjoyed by the blessed in Heaven was to contemplate the sufferings of the damned in Hell. Apparently if you get to Heaven there is a sort of balcony you have access to where you can stand and watch the sinners down below being prodded, scorched, and flayed. \\nFar be it from me to bandy theology with the Angelic Doctor, but I’ve always thought that divine justice should have a bit more charity in it than that. Whatever: Down here in the terrestrial sphere, there’s no doubt that one of the pleasures of winning an election is seeing the torments of the losers. \\nOne of the first losers out of the gate, on Wednesday morning, was the curiously named Steven Thrasher [ ] of BuzzFeed. It’s not the “Steven” that excites my curiosity, it’s the “Thrasher.” Mr. Thrasher is a homosexual ; indeed, he basks in the glory of having received the 2012 Journalist of the Year award from the National Lesbian & Gay Journalists Association. I know it’s Neanderthal of me, but I can’t help wondering whether “Thrasher” is an assumed name, meant to signal something to those in the know…but that’s idle speculation on my part. \\nSo here was Mr. Thrasher on Wednesday morning: \\nThis is a terrifying moment for America. Hold your loved ones close. \\nPeople of color, women, Muslims, queer people, the sick, immigrants: all are threatened by Donald Trump. They need your love, your warmth, your support Hold tight to the ones you love, America. Hold tight to the ones you love living in black and brown and yellow and native skin. Hold tight to us, because we will have to face white people who think we are rapists. We will have to face a nation that wants to stop-and-frisk us. Hold tight to us, because mass incarceration is actually going to get worse, and more of our brothers and sisters are going to be disappeared … This is a terrifying moment for America. Hold your loved ones close, Guardian , November 9, 2016 \\nIt goes on—or thrashes on—for another six hundred words in the same vein. \\nHomosexualists were very much to the fore in this kind of hysteria , although I can’t recall anything Donald Trump has said on the subject, and I doubt on a priori grounds that homosex bothers him in any way. \\nFor another example, here was lesbian writer Cathy Renna [ ]at Huffington Post, November 10th. Get yer hankies out: \\nThis election was a hate crime. Not physical but psychological, and one that may well lead to legal and physical manifestations that would very much be categorized as hate crimes. \\nI saw and heard about such pain and fear on social media and personally as we realized Trump would take the election. And it has not let up. I checked on several people who were expressing a level of fear that seem like it could lead to self-harm. \\nA Vote For Trump Was A Hate Crime , November 11, 2016 \\nThat one also continues for over 600 words. \\nScreenwriter Aaron Sorkin is not homosexual, although he does have eccentric tastes: According to Wikipedia, he once dated Maureen Dowd. I’m afraid that brings to my mind a limerick the late Robert Conquest wrote about Ms. Dowd’s approximate U.K. equivalent, Brigid Brophy. The limerick is much too vulgar for a family website, so I’ll leave you to look it up for yourselves. \\nMr. Sorkin unbosomed his feelings about the Trump victory in the form of a letter to his 15-year-old daughter: \\nThe Trumpsters want to see people like us (Jewish, “coastal elites,” educated, socially progressive, Hollywood …) sobbing and wailing and talking about moving to Canada. I won’t give them that and neither will you. \\nRead the Letter Aaron Sorkin Wrote His Daughter After Donald Trump Was Elected President ,Vanity Fair, November 9, 2016 \\nMs. Sorkin can of course make up her own mind about moving to Canada. It’s not actually an option for her Dad, though. He’s a convicted drug felon. [ Aaron Sorkin Says He Used Drugs , AP, August 3, 2001] And Canada doesn’t give settlement visas to felons. \\nCasting around for targets on which to vent their spleen, the CultMarx crowd didn’t even spare the celebrity fluff magazines. Here’s a gal named L.V. Anderson, an associate editor at Slate previously known as an expert on Ziploc bags , breaking a butterfly on the wheel, the actual butterfly in this case being People magazine . [ Amoral PEOPLE Magazine Is Already Fawning Over How “Cute” Trump’s Family Is .[November 9, 2016] ORDER IT NOW \\n“Amoral”! People , you see, has done what they habitually do when someone gets elected President: they’ve posted pictures of Trump’s family—actually of his daughter Ivanka Kushner and her kids—whom the magazine describes as “cute.” 22 photos of Ivanka Trump and her family that are way too cute https://t.co/AZdq7b2Gwa pic.twitter.com/e6cSxQAft1 \\n— People Magazine (@people) November 9, 2016 \\nThat has Ms. Anderson sputtering: \\nTrump and Kushner both played key roles in the most hate-filled presidential campaign in modern history. They worked tirelessly to elect a demagogue … \\nTrump and Kushner, more than anyone else, normalized Donald’s patent unfitness for the presidency. \\nAnd now, People is normalizing their moral bankruptcy by pretending that they are just average celebrities, as harmless as the Kardashians. \\nEnd sputter. Are the Kardashians really harmless , though? Discuss among yourselves. \\nAnd then of course there was the Hitlery-Hitlery-Hitlery-Hitler brigade. British Lefty historian Simon Schama on BBC Radio November 8th, quote: “Democracy often brings fascists to power. It did so to Germany in the 1930s. And so in my view it has done this evening.” [ Fury at BBC Radio 4 as Simon Schama compares Donald Trump election win to rise of HITLER , By Cyrus Engineer, Express.co.uk, November 9, 2016] \\nIt’s all been wonderfully delicious to watch. In a simile that I like very much, one of my email correspondents, who lives in the Washington, D.C. suburbs, told me that, quote: \\nThere are few in my zip code with whom I could share the joy of this moment. I can report that the apparatchiks are all walking around dazed and despondent, like Japanese schoolkids who have just heard the emperor announce the capitulation on the radio . \\nAdded to the pleasure of hearing such wailing and gnashing of teeth on the Left is the spectacle of establishment Republicans like Paul Ryan falling into line behind The Donald. The English language has the idiom “rats deserting a sinking ship.” I can’t think of a phrase that expresses the reverse thing, rats scampering to get back on the ship as she hoists sail and starts to pick up speed, but there really ought to be one. \\nIf St Thomas Aquinas got it right, and Heaven is half as much fun as this, I’m going to be very good indeed from now on in hopes of getting there at last. \\nIf you go before me, save me a space on that balcony. \\nTo take set this in a global perspective: VDARE.com Editor Peter Brimelow remarked to me the other day that an American election is the Greatest Show On Earth. \\nHe’s right of course, and that’s hopeful for the human race at large. \\nOur election will surely have been an encouragement. In many European nations, just as here, a smug, entrenched political elite has been pushing a sentimental globalist ideology whose benefits to their own people have long since passed the point of diminishing returns. \\nWe see this in the great crisis of illegal immigration from Africa and the Middle East. We’ve been chronicling the crisis on VDARE.com: the great floods of illegals into Germany, France, Greece, and most lately Italy. [ Italy Becomes A Leading Destination For Migrants, Matching Greece , NPR, November 6, 2016]We’ve told you about the sneaky euphemisms: “refugees,” “asylum seekers,” “migrants,” and so on. \\nNo doubt some small proportion of the numbers are genuinely fleeing from something. The great majority, though, it’s plain from the news pictures, are middle-class young men from sub-Saharan Africa and reasonably stable places like Pakistan, looking for a Western lifestyle. \\nIt’s overwhelmingly a problem of illegal immigration. And rising numbers of Europeans are mad as hell that their governments, far from doing anything to stop it, are actively encouraging it. \\nThere you see the commonality with Trumpism in the U.S.A. Illegal immigration has been a signature Trump issue. Trump’s success in the election this week has given heart to Europeans fighting for the sovereignty of their own countries and the integrity of their borders. \\nHere’s a relevant quote from one of those Europeans: \\n[Ronald] Reagan spoke of “Poland’s struggle to be Poland.” And today, three decades later, history is about to repeat itself in the United States and in several West European countries. Of course, I am not comparing our current political elite with the Communist dictatorships with their prison cells for dissidents, but the fight of a nation to be itself, remain itself and defend its identity, that fight is also being waged today. \\nWe are witnessing America’s struggle to be America, and the struggle of several European nations, among them the Netherlands, Britain, France, Germany and many others to preserve their identity and liberty, to remain the Netherlands, Britain, France, Germany. Everywhere, patriots are on the march. We are living the Patriot Spring. \\nGeert Wilders: The Patriot Spring – Breitbart , January 26, 2016 \\nThat was Dutch dissident Geert Wilders. He is the leader of a political party over there, the fifth-largest in the Dutch parliament, with twelve seats in the House and nine in the Senate. That hasn’t stopped the Establishment bringing Wilders to trial for “hate speech” after he promised an election rally that there would be fewer North Africans in Holland under a government run by his party. [ Europe’s Show Trials Are Where America’s Anti-Speech Regime Is Going, By Alex Grass, The Federalist, November 6, 2016] Wilders’ trial is ongoing. ORDER IT NOW \\nPatriots in European nations—the counterparts to those of us who write and broadcast on websites like this one—live under real threat. It’s not just the threat of show trials, either. Wilders has 24-hour police protection and sleeps at undisclosed locations. \\nThat’s the fate of honest patriots in societies under the soft totalitarianism of Political Correctness. This week’s election in the U.S.A. has given them new hope. Here’s Geert Wilders’ stirring statement on his hopes for the President Elect: \\nMy hope—and expectation—is that Donald Trump will follow in Reagan’s footsteps, that he will stand firm, speak the truth, concede nothing and, in doing so, inspire Western Europe to protect its freedoms against Islamization. \\nAmerica has just liberated itself from Political Correctness. The American people expressed their desire to remain a free and democratic people. Now it is time for Europe. We can and will do the same! \\nGeert Wilders For Breitbart: The Second American Revolution Has Come, by Geert Wilders, November 9, 2016 \\nThe key takeaway here: Wilders’ phrase “the Patriot Spring.” I don’t know if he coined that himself or borrowed it, but it’s something to watch out for across the pond in coming months. \\nThere are elections all over in Europe next year: Germany in February and September, the Netherlands itself in March, France in April, May, and June, Hungary in May, Norway in September, Czechia in October. \\nIt could be that we’re looking at not just a Patriot Spring over there—but a Patriot Year. \\nIf that comes to pass, it will have been partly under the inspiration of Donald Trump and our country, the U.S.A.— “the well-wisher to the freedom and independence of all.” \\nJohn Derbyshire [ ] writes an incredible amount on all sorts of subjects for all kinds of outlets. (This no longer includes National Review, whose editors had some kind of tantrum and fired him. ) He is the author of We Are Doomed: Reclaiming Conservative Pessimism and several other books . He’s had t w o books published by VDARE.com: FROM THE DISSIDENT RIGHT ( also available in Kindle ) and From the Dissident Right II: Essays 2013 . His writings are archived at JohnDerbyshire.com . (Reprinted from VDare.com  \""}, "time": 1742563446.3067098}