{"duration": 0.03214073181152344, "input_args": {"text": "'Sunday on CNN’s “State of the Union,” Sen. Bernie Sanders (I. ) said Trump “did not tell the truth” based on what he said during the campaign and what he has done so far as president of the United States.  “Let’s be clear. I mean, the point here is that, I think, all over grassroots America, whether they’re Democrats, independents or Republicans, people are perceiving that Trump did not tell the truth in his campaign in terms of what he would do as president of the United States,” Sanders said. “He was going to drain the swamp. Well, he’s, in fact, appointed more billionaires to his Cabinet than any president in history, etc. etc. So, what I think has happened now, in Kansas, it is true that the Democratic candidate lost. It is true that the Democratic Party should have put more resources into that election. But it is also true that he ran 20 points better than the  —   than the Democratic candidate for president did in Kansas. ” “So, what you’re seeing in Kansas, what you’re seeing in Georgia, I believe you’re going to see it in Montana, I believe you’re going to see it all over this country, is the many   red states, working people are going to wake up and say, wait a second,” he continued. “Republicans want to cut Social Security, Medicare, Medicaid and education, and they want to give hundreds of billions of dollars in tax breaks to the top 1 percent. No, that’s not what we elected Trump to do. Yes, climate change is real. It’s not a hoax. We got to move to sustainable energy. I think, all over this country, in red states and in blue states, people are beginning to stand up. They’re beginning to fight back. They’re demanding a government which does not just represent the billionaires, but represents the working class of this country. Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742563083.7445664}