{"duration": 0.1246635913848877, "input_args": {"text": "'Force and Fanaticism : Wahhabism in Saudi Arabia and Beyond Is “Wahhabism” a complete distortion of Islam? November 1, 2016 Raymond Ibrahim \\nNote: In what follows, Shillman Fellow Raymond Ibrahim reviews Force and Fanaticism: Wahhabism in Saudi Arabia and Beyond, by Simon Ross Valentine. A shorter version of the book review first appeared in the Middle East Quarterly (Fall, 2016, vol. 23, no. 4). \\nValentine, a British Methodist pastor and teacher who taught in Saudi Arabia, has written a useful book about the desert kingdom. Most interesting is its exploration of how the monarchy is \"the single greatest force in spreading Islamic fundamentalism\"; it \"has spent as much as $100 billion to spread Wahhabism in the West,\" yet \"America and Britain have been, and are continuing to be, implicit supporters of Wahhabism.\" \\nValentine discusses the background of how this \"unholy alliance\" came about. He warns: \"If the West simply ignores it, Saudi Arabia\\'s role in international terrorism seems likely to worsen rather than conveniently disappear.\" This is troubling considering that \"ISIS is Saudi Arabia\\'s latest monstrous contribution to world history.\" \\nThe author explores important topics, including the mutawwa , or religious police, and provides useful historical context, discussing the origins of “Wahhabism,” its alliance with the House of Saud, and the oil discoveries that changed everything. \\nThe book’s primary defect is standard. Valentine regularly insists that “it is of the greatest importance to distinguish between Wahhabism and Islam generally.” Anything good, positive, tolerant and peaceful is ascribed to Islam; anything bad, negative, intolerant, and violent—misogyny, draconian punishments, execution of apostates, intolerance for and discrimination against non-Muslims—is ascribed to “Wahhabism.” \\nThis position appears to be based on the author’s own cultural presuppositions. Thus he “felt confused and puzzled” to hear of Wahhabi intolerance, including the “attempt to propagate their beliefs by force,” prompting him to wonder: Can you force someone to love God?.... In all the conversations I had with ulema, imams, Mutawa [religious police] and Saudis generally there was never a mention of “love,” the idea that God loved me, just frightful talk of hell, burning and future pain if I did not believe and accept the Wahhabi faith.” \\nHad Valentine engaged in a critical reading of Islamic doctrine and history—as opposed to projecting his Christian notion of God onto Islam—he would’ve known that Muhammad, followed by countless caliphs and sultans throughout the centuries, did “propagate their beliefs by force” (the overwhelming majority of today’s Muslim world was taken from non-Muslims “by force”) and that although Islam attributes 99 characteristics to God, “love” is not one of them. \\nValentine\\'s readers would’ve benefit much more had he simply laid out his useful information concerning the inner workings of the Saudi regime and its unholy alliance with the West, without trying to tackle the deeper question of what Islam really is—leading to yet another book marred by Islamic apologetics.'"}, "time": 1742563256.7552528}