{"duration": 0.05486607551574707, "input_args": {"text": "'Women should be able to abort their babies simply because they are the “wrong” sex, a leading ethicist at Britain’s doctors’ union has said. [Professor Wendy Savage, a member of the ethics committee of the British Medical Association, said women should be able to have an abortion at any stage of pregnancy for whatever reason, even when the child would be able to survive outside of the womb.  She also said that abortion pills should be available online without the need to see a doctor or nurse. There has been growing concern in Britain that an increasing number of women are seeking abortions simply because they do not want girls, leading to some hospitals refusing to tell parents the sex of their babies. However, Professor Savage told the Mail on Sunday: “Because of this sort of anxiety some places won’t tell the woman the sex of the foetus, which is outrageous. “It’s her body and her foetus, so she should have that information  …     If a woman does not want to have a foetus who is one sex or the other, forcing her [to go through with the pregnancy] is not going to be good for the eventual child, and it’s not going to be good for [the mother’s] mental health. ” She previously caused outrage after signing a letter claiming   abortion is not “gender discrimination” because that only applies to “living people”. She then doubled down on those views, claiming the unborn child is not really a person. “The foetus is a potential human life at that stage [in the womb] it is not an actual human life  …     I think you’ve got to concentrate on the [rights of the] woman. ”   campaigners have branded her comments “utterly abhorrent” with Conservative MP Mark Field saying: “To have someone like Wendy Savage with her extreme views at the heart of the BMA is a very worrying sign. The majority of people in this country, even those who support abortion, think   abortion is a step too far. ” “Effectively we have abortion on demand nowadays, and all the safeguards we are supposed to have are being ridden roughshod over,” he added.'"}, "time": 1742564587.0572336}