{"duration": 0.04777240753173828, "input_args": {"text": "'The Mexican foreign secretary called the plan to build walls along the border a “hostile” and “deeply unfriendly” act, and an “aggravating action. ” He warned that Mexico intends to conduct a fierce legal battle to stop any border walls that violate the rights of Mexicans. [Mexico Foreign Secretary Luis Videgaray said building any walls when there are already 600 kilometers of barriers is not only a hostile and deeply unfriendly act, but one that “also is not going to fulfill the objectives that it raises, is not only an aggravating action, but it seems to be frankly a bad idea. ”  The foreign secretary said Mexico is planning a legal fight, and it has no intention to pay for any border walls or to cooperate with the U. S. in any way on the development of border walls. “Of course, any kind of financial cooperation or any other way in building the physical barrier between our nations and, of course, an important fundamental limit is not accepting the violation of the human rights of Mexicans in the United States. ” Videgaray charged that any border wall “is not part of a bilateral discussion and should not be, Mexicans should not be part of that discussion, we will not collaborate in any way the construction of something that hurts us, Is apparently an absolute waste of resources. ” Videgaray made this vow during his appearance before the Committee on Foreign Relations of the Chamber of Deputies in Mexico City this week. The foreign secretary said that his country had put together “a very significant amount of human resources” to argue that the U. S. is violating international treaties, “starting with the ominous Treaty of Guadalupe in 1948. ” This was most likely a reference to the 1848 treaty that ended the   war and set the Rio Grande as a boundary to Mexico. He forewarns that Mexico will file lawsuits in the U. S. as well as in international courts of law if there are any violations of a border treaty, environmental treaties, or an international law regulation. Secretary Videgaray told the Committee on Foreign Relations that Mexico “has been a tireless promoter of openness to the world, to open up to us,” for decades. He urged, “we must recognize that we face new circumstances, some of them unpublished and others that are reminiscent of things that happened to the world decades ago. ” “Today in the world there are threats to our paradigms of international coexistence that have been in force for decades. It is undeniable that there are outbreaks of isolationist protectionism, outbursts of nationalism that try to close the world and beyond that, from political actors of very diverse origins in different latitudes, question the principle of global integration. ” In the same speech, he said, “first and foremost as it should be,” the United States must recognize Mexico as a sovereign nation. The Mexican foreign secretary threatened that any attempt to tax remittances from the U. S. would be “a break point in any dialogue on other issues. ” He called the “flow of foreign exchange” “a fundamental support for many families. ” “[F]or Mexico, [it] is a   issue,” he charged. In his address, Videgaray also vowed that Mexico would “increase significantly the attention to Mexicans abroad. ” Videgaray explained that the 50 Mexican consulates have assisted and protected 45, 290 this year  —   “more than half were in the immigration field. ” There have been 2, 400 migrants who have been provided legal representation, and they are representing those who have already been deported. The foreign secretary said Mexico would never accept a unilateral decision by the United States to send migrants from other countries to Mexico, and the country is waiting to challenge executive orders “regarding the extension of the criteria to allow express deportation. ” They are “waiting for the first act of implementation, not only the Mexican government but the allied organizations,   organizations, so that when the first act of application exists, proceed to challenge the general rule,” he said. “There is not yet an act of application regarding the criterion of expeditiously deporting someone who has more than 14 days in the country or someone who is beyond 100 kilometers of internment. ” The foreign secretary added that any revision to NAFTA must include a dialogue between Mexico, Canada, and the U. S. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.'"}, "time": 1742628571.5913887}