{"duration": 0.16167116165161133, "input_args": {"text": "'Every Friday, pop critics for The New York Times weigh in on the week’s most notable new songs and videos  —   and anything else that strikes them as intriguing. You can listen to this playlist on Spotify here. Like this Playlist? Let us know at theplaylist@nytimes. com, and sign up for our Louder newsletter (coming soon!) here. Pop minimalism inhabits a sliding scale, as the xx seem determined to illustrate. “On Hold” is the lead single from its third album, “I See You,” set for release in January. It opens in churchly quiet, with Romy Madley Croft and Oliver Sim exchanging rueful intimacies about the end of a love affair. “When and where did we go cold?” moans Mr. Sim. “I thought I had you on hold. ” None of this is a stretch. But then the texture of the track opens up: an   beat burbles up, a bass line kicks in, and wait, is that a digitally manipulated sample of Hall and Oates? (Why yes, of course.) Jamie xx has been working in this vein as a D. J. and solo artist, and it’s promising to consider what it could mean for the group as it moves ahead. NATE CHINEN “Boy you shoulda got me   you shoulda held the door”: exasperation is perhaps Bibi Bourelly’s peak mode, and it is bracing on the seething “Flowers,” from her new    EP “Free the Real (Pt. #2). ” Ms. Bourelly, who has written songs for Rihanna and is still coming into her own as performer, can be unsteady  —   not in a performed way, but in the manner of someone who knows her destiny is to drive a beautiful tank but is still learning how to finesse the gears. Or maybe she never will: On “Perfect,” a duet with the   Earl St. Clair, she dismantles regressive standards of beauty and  : JON CARAMANICA One of the most formally ambitious, eerily pertinent albums to emerge in recent weeks was “Real Enemies,” by the ultramodern big band known as Darcy James Argue’s Secret Society. An adaptation of a multimedia piece presented at the Brooklyn Academy of Music last year, it traffics brilliantly in the syntax of American conspiracy theories, drawing from historical episodes, speculative fiction and the political writing of Richard Hofstadter and others. Depending on your state of mind this week, it could be just what you need to hear or precisely the opposite either way, it’s sure to strike a chord. And while the piece is meant to be digested whole, it’s possible to find meaning in a single track  —   like “Apocalypse Is a Process,” which begins with a disquieting stir of flutes and woodwinds, and then features a fine tenor saxophone solo by Sam Sadigursky, along with a sampled voice making a remark both urgent and cryptic: “We can’t wait any longer. ” N. C. Look, maybe you just want to watch Shia LaBeouf freestyle for four minutes in which he boasts about replacing Tom Hanks, calls himself “Jewish ’Pac to this music with a twist of Whitman,” takes shots at Lil Yachty and announces, “Truth is, I’m a true   white kid with B. I. G. in a Coogi tatted to me. ” And, hey, no judgment  —   comedy heals. J. C. Because what the world needs now is a gleaming   track from Giorgio Moroder. Because the vocal performance, by Karen Harding, is soulful and sure. Because there’s something touchingly upbeat about the main hook in the chorus: “Sometimes it feels like you’re too good for me. ” N. C. “Haven’t seen my ex since we broke   ‘cause he didn’t want to grow up,” Rena Lovelis, the lead singer of Hey Violet, sings at the top of the sinister single “Guys My Age. ” But then comes the twist: “Now I’m out here wearing something    get attention from a  . ” For the last couple of years, pop by young women has been tacking toward resistance  —   to gender norms, to the male gaze, to entrenched sexism. “Guys My Age” stands on the shoulders of those songs, embracing their mood, their musical approach  —   groaning, gloomy synthesized pop  —   and puts it in service of sexual authority, a whole different way of dismissing ignorance. J. C. The personal and the universal were already partly entwined on “Love Me Now,” the current single by John Legend. It’s a pledge of loving devotion, his specialty, that brushes against larger uncertainties. “I don’t know who’s gonna kiss you when I’m gone,” he sings in the chorus. “So I’m gonna love you now, like it’s all I have. ” Gone where? He doesn’t say exactly, but the tension in the song has to do with forces outside his control. Now a video for the song, directed by Nabil Elderkin, amplifies the idea: There’s Mr. Legend on a couch, singing to his wife, Chrissy Teigen, and their young daughter. But there, too, are couples against more troubled backdrops, like the Standing Rock Reservation in North Dakota and a refugee camp in northern Iraq. The core message  —   love is universal, and all the more crucial in a difficult time  —   seems likely to resonate elsewhere on Mr. Legend’s next album, “Darkness and Light,” due on Dec. 2. N. C. Here is something offhandedly great: a club recording from Mike Watt’s first solo tour, in 1995. Mr. Watt, the punk workhorse and former bassist in the Minutemen, was working with material from “  or tugboat?”  —   his debut album, crowded with cameos from the postpunk and   scenes. The tour recreated those conditions, mainly putting him in an   power trio with Eddie Vedder on guitar and Dave Grohl on drums. (Mr. Grohl, then recently of Nirvana, had brought his new band, the Foo Fighters, on tour as an opening act Mr. Vedder, best known as Pearl Jam’s frontman, was there with another opener, Hovercraft.) The set has a looseness that squares well with its low center of gravity it’s satisfying just to hear Mr. Grohl and Mr. Watt lock into a heavy groove. But there’s also a   quality to these songs, which valorize underground notions of integrity. Consider “Against the ’70s,” with an impassioned guest vocal by Mr. Vedder: “Baby boomers, selling you rumors of their history,” he sings. “Forcing youth away from the truth of what’s real today. ” N. C. In its original incarnation, on the most recent Coldplay album, “Everglow” is a piano ballad tastefully padded with sonic accouterments: electric bass, pealing guitars, stark and unobtrusive drums. The song has now been further pruned, to something resembling an unplugged solo performance by Chris Martin, on piano and vocals. Still, it wouldn’t be a Coldplay single without some earnest flicker of grandiosity, so here too is Muhammad Ali, talking in 1977. “We need somebody in the world to help us all make peace,” he says, referring to the example he hopes to set for himself. N. C. Julian Lage is a guitarist with spring in his step, the sort of improvising musician who radiates ease and good feeling even on tricky terrain. And he’s in emblematic form on “Live in Los Angeles,” a   digital album now on iTunes and Apple Music. Recorded in June at the Blue Whale, it features Mr. Lage’s trio with Scott Colley on bass and Kenny Wollesen on drums  —   the same players heard on “Arclight,” a studio album released this spring. Rather than an acoustic or   guitar, Mr. Lage works in this trio with a Telecaster, which brings more grit and bite to his sound. His playing on “Nocturne,” a country waltz, puts him in roughly the same county as Bill Frisell, but with a touch and temperament entirely his own. N. C.'"}, "time": 1742563940.63815}