{"duration": 0.12792634963989258, "input_args": {"text": "'Posted on September 7, 2016 by DCG | 53 Comments \\nLiberals would probably tell you to not “body shame” her. I say this woman needs serious medical and mental treatment. \\nFrom Daily Mail : An obese model who is paid by men to eat wants to pile on a further 300lbs to become the world’s fattest woman and be completely immobile. Monica Riley, 27, from Fort Worth, Texas, already tips the scales at 700lb but dreams of being too fat to move and is working towards hitting 1,000lb so that she feels like a ‘queen’. \\nHer feeder boyfriend Sid Riley, 25, whose surname she has taken despite not being married, spends his days cooking Monica meals and even feeding her 3,500 calorie shakes lavished with double cream through a funnel . He then rolls her over when her 91-inch stomach is full. \\nAmong the things Monica – a model on Super Sized Big Beautiful Woman websites – is looking forward to being immobile and getting a bed with a built-in toilet which Sid will need to empty. \\nMonica said: ‘The plan is to reach 1000 lbs and become immobile. I would feel like a queen because Sid would be waiting on me hand and foot and he’s excited about it too. \\n‘ It’s a sexual fantasy for us and we talk about it a lot. He already has to help me get off the sofa and get me out of bed. If I lay down after a big dinner he has to help me roll over because my belly is too full for me to roll – it’s a big turn-on for both of us .’ \\nDespite their controversial plans, the Monica and Sid are trying for a baby and have endured two miscarriages so far. She said: ‘We do plan to have children – there’s nothing to stop me raising a child from my bedroom . We would get a nanny in to help around the house and take the baby out and about. There’s nothing to stop us raising a child. Some people might think it’s selfish but I’m confident we would be good parents.’ \\nMonica had been overweight all of her life and just two years ago she was preparing for bariatric surgery after an ex-boyfriend urged her to shed the pounds. But at the last minute she pulled out of the operation and decided to embrace her figure instead. \\nAnd since meeting average-built Sid online four months ago, Monica has gained almost 55 lbs by gorging on 8,000 calories every day. \\nMonica said: ‘ The bigger I get the sexier I feel. I love my big soft belly and stuffing myself with food really turns me on . Sid loves to cook for me and hand-feed me and I’ve achieved so much since we got together . He feeds me around the clock and I never have to get up to do anything.’ \\nOn an average day, Monica will eat six biscuits, six sausages in a bread roll, a big bowl of sugary cereal, two weight gain shakes, four McChicken sandwiches, four double cheeseburgers, a large portion of French fries, 30 chicken nuggets, macaroni cheese, Taco Bell treats and a gallon of ice cream. \\nMonica hopes to get to a size where she will be unable to do anything for herself – requiring Sid to clean her, feed her and change her – by the time she is 32. \\nThe couple have run into criticism for their intentions, especially from Monica’s mother Terri, but they won’t be deterred in their efforts. Monica said: ‘My mom doesn’t understand it at all and she says I’m killing myself. ‘I understand her concerns but it’s my life and gaining weight makes me happy. I do worry a little bit about losing my independence but I know Sid loves taking care of me and would never let me suffer. ‘ \\nSid, who is 6ft 2in and 220 lbs, is also defensive against any criticism and insists he is simply helping Monica achieve her dreams . Sid said: ‘There is a misconception that feederism and immobility is about control but that’s not the case. If Monica wanted to stop I would accept her decision without question. I wouldn’t see caring for Monica as a chore at all. I love her and I love doing things for her – caring for her would be a dream come true.’ \\nTo assist Monica with her weight-gain, Sid prepares a special shake for her to drink through a funnel. The shake consists of ten Pop Tarts, heavy-duty cream, ice cream, milk and weight-gain power, totalling 3,500 calories. \\nMonica said: ‘The funnel feeding is what I really look forward to. I find it to be a very sexual experience and I know Sid likes it too. I have 20,000 online fans and they love to watch the funnel feeding – it’s a big hit.’ \\nAnd regardless of the health risks of being morbidly obese, Monica and Sid are charging full steam ahead with their mammoth quest. \\nMonica said: ‘I could get hit by a car tomorrow and my life would be over. At least if I die this way I will have lived out the life I wanted and fulfilled all of my dreams.’ \\nDCG'"}, "time": 1742564288.3871863}