{"duration": 0.11835145950317383, "input_args": {"text": "'DURHAM, N. C.  —   As soon as Chris Rock strode onstage here on Monday in the first performance of his   “Total Blackout Tour,” he explained why, nine years after his last   special, he’s pacing stages again: “That’s what alimony will do to you. ” Mr. Rock, who was married for 16 years,  divorced last year, and while his quip had the jackhammer snap that has long made him the best deliverer of punch lines in comedy, the old swagger faded during his     show. Now 52, Mr. Rock, looking trim in casual black pants and jacket, talked about his vanity, insecurities and failures with startling frankness. “I wasn’t a good husband,” he said, standing still, shifting into a quieter register. “I didn’t listen. I wasn’t kind. I cheated. ” Mr. Rock paused as the audience waited for the joke. It arrived eventually, but it did not match the impact of this silent, dramatic beat. In his new set, Mr. Rock appeared to be after something more than laughs. It is rare to see a celebrity discuss his infidelity with the specificity that he did here  —   detailing who and how many  —   but he talked about this in an anguished, searching tone that fans may find surprising. At times, Mr. Rock sounded like a man confessing his sins, turning vulnerability into his latest provocation. Ever since his breakthrough 1996 HBO special, “Bring the Pain”  —   his new set includes giant initials evoking that seminal show  —   Mr. Rock has maintained a secure place in the   pantheon. But in contrast with peers like Bill Burr and Louis C. K. his specials are infrequent enough that every one is a major event. His current show will be released as a special on Netflix, part of a   $40 million deal. His last, “Kill the Messenger,” was recorded during the 2008 election, and it’s hard not to be struck by his cheerful mood then, sounding positively giddy as he pokes fun at John McCain, skewering him as a “war hero who got captured. ” In the recent presidential campaign, Donald J. Trump made the same point about Mr. McCain in similar language, but without the punch line. In the past nine years, the line for transgression has shifted. But Mr. Rock didn’t try to adjust to it. Nor did he approach the recent election with what has become the standard alarm of many comedians. Barack Obama was the anomaly, he argued, while Mr. Trump is a return to business as usual in a conservative country always run by rich white men. “I’m not scared,” Mr. Rock said, looking to the evils of history for comfort. “I’m black. The future is always better when you’re black. ” Comedy is about surprise, and one reason Mr. Rock has been his generation’s finest political   is his ability to consistently go against the grain with conviction. (Unlike some, he always seems to believe the premises of his jokes.) The rise of Mr. Trump, he concluded, taking his critique to a comic extreme, stems from our battle against bullying. “We got rid of bullies,” he said. “When a real one showed up, we didn’t know what to do. ” He also discussed police shootings in an unexpected way, saying that he would think that law enforcement might try to shoot a white kid for once, “just for appearances. ” But he also spent time sympathizing with police officers, describing work that has zero room for error and draws pay that is far too low. If his current social commentary has a common thread, it’s an alertness to how economics colors every issue. “Whole Foods does not say ‘No Blacks Allowed,’” he said. “But a $7 orange does. That’s the new Jim Crow. ” What stood out most about this show, however, was the personal, not the political. Mr. Rock has mostly kept the audience at a distance from his private life. He isn’t the type to dwell on his demons or soul search on a podcast. So it’s a surprise to see him tell jokes about the dark consequences of his addiction to pornography or the excruciating details of family court. This is not his funniest show, but it might be his most compelling, a departure even in its form. The distance between his forceful   persona and the   more thoughtful one he displays in interviews has shrunk a bit  —   and his jokes are more intricate, denser. What remains firm is a lyricist’s gift for concision, boiling down a thought to its comic essence. On bullying: “Pressure makes diamonds. Not hugs. ” Mr. Rock’s comedy has always been happily cynical about marriage, his jokes regarding relationships rooted in regressive stereotypes about men and women. He’s found many laughs in sympathy for men behaving badly, blaming Hillary Clinton for her husband’s cheating and pointing out how O. J. Simpson had to pay steep alimony while his former wife slept with another man. (“I’m not saying he should have killed her, but I understand. ”) When discussing his own marriage, however, he blamed only himself, repeatedly, allowing sadness to creep into his dynamic voice. He also dug into his past, telling a story about his grandmother disparaging poor men that stuck with him for years, and another about his grandfather mocking him for crying. Mr. Rock wants to tell us where he came from, and also where he hopes to go. “I’m trying to get a little bit of religion,” he said, before backtracking: “Not a lot. ” He added that he believes in God, but only a bit. Onstage, Mr. Rock has always had the intonations of a preacher  —   which his grandfather was  —   repeating premises until they sound like incantations. But his real religion is comedy, and at the end of this discussion of his relationship with God, he contrasted the sureness of faith with the questioning nature of a comic. But as comedians go, Mr. Rock has always been one of the most forcefully confident. What’s different is he now sounds more anxious. And while the election and his divorce may have added heaviness to his gait, this evolution may also stem from simply growing older. In a line he repeated over and over on Monday, Mr. Rock explained his spiritual search in the hardheaded pragmatic terms we’ve come to expect from him: “I want to find God before God finds me. ”'"}, "time": 1742561751.9643934}