{"duration": 0.06431722640991211, "input_args": {"text": "'  \\nIt’s always nice to know that some people aren’t as concerned with the election as they are with the “big picture.” For Lance Wallnau, that constitutes turning America into a Fundamentalist Christian nation. Wallnau is a Seven Mountains Dominionist (so is Ted Cruz) who thinks that there is a vast left-wing conspiracy, even though he says he’s not really a conspiracy buff. There’s some cognitive dissonance for you. \\nAppearing on The Jim Bakker Show on Wednesday, Wallnau opened up his big bag of blarney and laid out his theories about the left-wing’s diabolical plans to destroy conservatives, especially Christian conservatives. Wallnau thinks that the left has a web of progressive organizations like MoveOn.org, Media Matters and Right Wing Watch that controls the media and decides what Americans think and talk about. \\n“They are all independent organizations coordinated by one group of people like us who handle the money. So they’ll show up where there’s race issues—boom, and make them inflammatory. They’ll show up where there’s a campus issue—boom, and make it inflammatory. Then the media machine kicks in, Media Matters, which is run by one of their organizations, and they come in and they get it into the social media channels so it’s in Facebook and everything. And you would think all of America’s ablaze. It’s a handful of funded, executed strategists with entities called 527s that are disciplining America.” \\nWhere to start with this stew of projection? No one group handles the money for all the liberal advocacy groups. The idea is absurd. These groups do not plot to turn any single issue into an inflammatory one; that happens organically depending on what life brings us. He’s never heard of the “shit happens” theory, I guess. Media Matters is not a media group unto itself, it exists to keep the actual media honest. Social networks? You think anyone can control those? If so, you really are stupid. And those horrible 527s that are controlling this “disciplining” of America? There are plenty of those on the right, as well. The 527 designation just means it’s a non-profit advocacy group. A quick look at the top fifty 527s in this election cycle shows that all sorts of issues and ideologies are represented. \\nBut Wallnau hasn’t emptied his can of crazy yet. Showing an amazing capacity for projection, he explains why Christians are feeling that things are not quite right: \\n“The web literally is coming down on America. And what’s sad is, how many Christians feel this fog on their head at times? Do you feel that? It’s almost like everything’s going wrong. And that fog that’s on Christians is the collective witchcraft that comes over the Body of Christ because there’s spirits being authorized to be released.” \\nHe goes on to blame the imaginary left-wing syndicate for authorizing Satan to run things. Authorize? So Satan has to get a rubber stamp of some kind? Is he the one authorizing the release of those spirits? If he is, he must have mountains of paperwork. One wonders when he has time to tempt anyone. \\nLike most pseudo-Christians, Wallnau loves to fall back on the idea that his devil is running things when those things aren’t going his way. That’s toddler-level thinking. What else would you expect, though, from someone who thinks God sent Donald Trump to be their savior? \\nThe charge of witchcraft obliges me to repeat things I may have said before but that always bear repeating. Witches do not sit around in groups of 13 trying to figure out ways to ruin the lives of others. We have our own problems and we don’t need or want more stuff to deal with. We are not some cabal intent on turning America into a macrocosm of our own ideology. That’s the Dominionist’s thing. We are quite happy to live out own lives and let others do the same. \\nThat said, we do get involved in elections. Just like any other American, we volunteer for our candidates. We phone bank and go door-to-door. We vote and encourage others to do the same. If we are working any witchcraft it is the magic of working together to better the lives of everyone. Jim Bakker and Lance Wallnau ought to try it sometime. \\nHere’s the clip from our conspiracy mates friends at Right Wing Watch \\nFeatured Image via Screen Capture Share this Article!'"}, "time": 1742563586.8127675}