{"duration": 0.1215062141418457, "input_args": {"text": "'https://wikileaks.org/podesta-emails/emailid/5688 \\n\"Bernie and his people have been bitching about super delegates and the huge percentage that have come out for Hillary… We want [Bernie supporters] to go home happy and enthusiastic in working their asses off for Hillary. Why not throw Bernie a bone . . . his people will think they\\'ve \"won\" something from the Party Establishment. And it functionally doesn\\'t make any difference anyway. They win. We don\\'t lose. Everyone is happy.\" \\n“I am doing the opposite, repeatedly writing friendly and positive pieces about Bernie as an HRC supporter, and when the time is right I will have money in the bank with him and his people as a liberal to urge them to come out in force to vote for HRC.” \\n\"Frankly I thought it was dumb for McCaskill and Gutierrez to be attacking Bernie. We are going to need his voters to turn out in November for HRC, he won’t be nominated.” \\n\"Through internal discussions, we concluded that it was in our interest to: 1) limit the number of debates (and the number in each state); 2) start the debates as late as possible; 3) keep debates out of the busy window between February 1 and February 27, 2016 (Iowa to South Carolina); 4) create a schedule that would allow the later debates to be cancelled if the race is for practical purposes over.” \\nThe MostDamagingWikileaks.com Reports : \\nThe person who wrote the superdelegate rules advises the Clinton Campaign how to create an illusion that Bernie people won something so they would work hard for Hillary after she is nominated. More shocking is the fact that they admit that the superdelegates are undemocratic. This guy flat out admitted that he rigged the system, and is proud of it. \\nThere was also a man who was acting as a mole for Bernie and writing positive/negative things about him then using that reputation to sway Bernie supporters to Hillary. \\nLastly, we see how to rig the debate schedule to be more favorable to her. One on one debates would have been better for Bernie Sanders, so they wanted to avoid that at all costs. They also wanted to limit the number of debates, and start them late to minimize the impact of the debates. \\nHillary is also on audio insulting Bernie supporters by calling them \" basement dwellers \". \\n17. Hillary was hateful, neglectful, above the law, “contemptuous” to her security detail, and “blatantly disregarded” security, (FBI docs) \\nhttps://vault.fbi.gov/hillary-r.-clinton/hillary-r.-clinton-part-04-of-04/view (p. 43-45) \\n“CLINTON frequently and “blatantly” disregarded [security and diplomatic protocols].” \\n“This frequently resulted in complaints by ambassadors who were insulted and embarrassed by this breach of protocol… CLINTON’s protocol breaches were well known throughout Diplomatic Security and were “abundant.”” \\n“…ABEDIN possessed “much more power” over CLINTON’s staff and schedule than other former chiefs of staff… was often responsible for overriding security and diplomatic protocols on behalf of CLINTON.” \\n“…Clinton disregarded security and diplomatic protocols, occasionally without regard for the safety of her staff and protection detail, in order to gain favorable press.” \\n“…traveling to Palestine, CLINTON ordered the limousine driver… to open the window while in “occupied territory”, referring to a dangerous area of the West Bank. [He] initially declined to respond to CLINTON’s request; however, repeated demands by CLINTON forced him to open his window despite the danger to himself and the occupants.” \\n“CLINTON’s treatment of DS agents on her protective detail was so contemptuous that many of them sought reassignment or employment elsewhere… it was difficult to find senior agents willing to work with her.” \\nThe MostDamagingWikileaks.com Reports : \\nLook at the first link (highlights all the parts). Seriously, there are way too many to include in the quotes… just a sheer and utter lack of care for protocol, security, and the well being of others. This is the person who people want to be in charge of national security and classified documents. \\nAnother scary note in this list is the mention of Huma Abedin, Hillary’s long time assistant, possessing “much more power” and overriding security and protocol on Hillary’s behalf. Abedin has been strongly rumored to be Hillary’s Chief of Staff should she be elected. She also has strong ties to the Muslim Brotherhood . \\n18. Clinton Foundation schemed with Big Pharma to keep the price of AIDS drugs high in America and cheaper generic versions out \\nhttps://wikileaks.org/podesta-emails/emailid/24440 \\n“Since President Clinton’s comments were made, we have been contacted by a number of advocacy groups who are now intending to wage a public campaign to bring in generics and lower drug prices. We do not feel we can participate in this without jeopardizing our work around the world. We cannot oppose what they might do, but we also cannot be publicly supporting it either.” \\n“we think that publicly pressuring the US and European AIDS drug companies to lower prices and bringing pressure to allow generic AIDS drugs into the United States will have limited if any success and could seriously jeopardize our negotiations to continually lower prices in poor countries… We have always told the drug companies that we would not pressure them” \\n\"We have always told the drug companies that we would not pressure them and create a slippery slope where prices they negotiate with us for poor countries would inevitably lead to similar prices in rich countries.\" \\n\"we suggest that we approach the innovator companies that can currently sell products in the US with the idea of making donations to help clear the ADAP lists.\" \\n\"the companies will likely favor a donation approach rather than one that erodes prices across the board. I would guess that they would also likely favor a solution that involved their drugs rather than an approach that allowed generic drugs from India to flood the US market at low prices or one that set a precedent of waiving patent laws on drugs.\" \\nThe MostDamagingWikileaks.com Reports : \\nWhen the Clintons are questioned about the obvious sketchiness of their foundation, they routinely cite AIDS work. But the AIDS work is carried out by CHAI (\"Clinton Health Access Initiative\"), a separate organization. \\nCHAI freely admits there is an implicit agreement with the drug companies not to pressure them to lower domestic prices. Bill Clinton made comments that added pressure. CHAI receives a great amount of positive publicity for their AIDS work abroad, and the comments jeopardize that program. Here, CHAI admits it is in their interests for U.S. AIDS drug prices to remain high, so that they can continue getting credit for keeping them low abroad. \\nBut CHAI is not content with simply fleecing American AIDS sufferers. Since CHAI doesn\\'t want pressure on Pharma companies to linger, they propose to torpedo other AIDS advocacy groups by creating a smaller, watered-down domestic program with the Pharma companies before those other advocacy groups begin their assault in January. \\nThe Clintons are only out for themselves. In comments on World AIDS day in the subsequent years of 2012 and 2013 , Bill says nothing whatsoever about domestic drug prices. If AIDS advocacy groups cannot trust the Clintons not to stab them in the back, how can the American people? \\nAlso remember, the Clinton foundation only donates 5.6% of their earnings to charity , despite Hillary knowingly and blatantly lying to the American people by claiming they donated 90% at the last debate, but she is counting on you to not do research, and her mainstream media to not report it. \\n19. CNN leaked primary debate question to Hillary through head of DNC'"}, "time": 1742564135.6827426}