{"duration": 0.14926528930664062, "input_args": {"text": "'Surrounded by images of music icons, Billy Ray Cyrus, the actor and country singer, saw a bit of himself in David Bowie. “Dude, that’s almost my frickin’ hairdo!” an elated Mr. Cyrus said on a recent afternoon after he caught a glimpse of the late rock god’s ’70s mullet on a   at the Morrison Hotel Gallery in SoHo. “I’m sending this to Miley,” Mr. Cyrus said, referring to his pop star daughter, while reaching for the garment. Even beyond appearances, it’s possible to see why both of them admire Mr. Bowie, that relentless pop chameleon. Mr. Cyrus, though never quite respected for his music or hairstyle, has managed to stretch his   charisma, distinctive look and willingness to engage with the kitschy and the lowbrow into a constantly regenerating career of nearly 25 years. By embracing his cowboy camp factor, and now his aging   essence, Mr. Cyrus, 54, has ambled down a surreal path from his first, biggest hit, “Achy Breaky Heart,” in 1992, to a varied acting résumé, including roles in David Lynch’s “Mulholland Drive” and Disney’s “Hannah Montana,” which made Miley a star. Along the way, there were detours to tabloid purgatory, borderline irrelevance and “Sharknado 2. ” And yet even after going Hollywood, Mr. Cyrus has enough juice in the   universe to carry an acerbic,   original series, “Still the King,” which premieres Sunday, June 12, on CMT. “I’ve reinvented a couple times in my career, at least,” said Mr. Cyrus, who has mostly laid low since Miley’s   cultural emancipation. “But how do you reinvent out of ‘Hannah Montana’?” he continued. “And then it hit me: A dysfunctional Elvis impersonator who lies his way into the church. That made sense. ” “I told Miley about it,” he added, “and she said, ‘Dad, that’s exactly what you need. ’” “Still the King,” a   comedy with a gritty Southern feel, finds Mr. Cyrus, a   of the show, playing an exaggerated take on the worst version of himself: “Burnin’ Vernon,” a louche   wonder scamming his way into a job as a preacher and into the life of the teenage daughter he didn’t know he had. Jayson Dinsmore, the executive vice president of development for CMT, said the show represents a new push for the network into premium scripted programming. He compared Mr. Cyrus’s role in “Still the King” to that of Larry David in the    comedy “Curb Your Enthusiasm”  —   but with a star who’s “undeniably charming. ” “Sometimes we forget how successful Billy Ray has been,” he said. “He’s one of those people who has multigenerational fans. ” Also, Mr. Dinsmore added, Mr. Cyrus is “incredibly good looking  —   women flock to him,” a boon for a network whose viewers lean female. Mr. Cyrus, a Kentucky native and politician’s son, whose own   puts him somewhere between George W. Bush and Joe Biden in manner, said that, “I kind of traded my musical soul to be an actor. ” Despite never truly being welcomed into the country establishment, “I’m a   first and foremost” and not technically a   wonder, he said. “Some Gave All”  —   Mr. Cyrus’s first album  —   “had four hit singles on it,” he insisted, adding a few expletives for emphasis. “Here’s the damn truth: I’ve had more hits than any   wonder in the world. I don’t mean that as bragging because I wish that my name wasn’t even in that conversation. But if you look on Wikipedia, it’ll say that. ” Despite his early musical success, Mr. Cyrus saw the writing on the Nashville wall when his third album in three years failed to match the first two. “I said,   they’re coming after me,” Mr. Cyrus recalled. “The teeter has gone to totter  —   I’m on the way down. ” He cited his   songwriting, including an emphasis on the environment. “That’s the last thing they want to hear from me,” he said. Thus began one of the stranger recent sagas in American celebrity bootstrapping as Mr. Cyrus willed his family (six Cyrus children in all)  —   and especially the daughter born Destiny Hope Cyrus  —   into becoming a household name. Following in the footsteps of diversified country stars like Kenny Rogers and Dolly Parton  —   and more recently, rappers like LL Cool J and Ice Cube  —   Mr. Cyrus aimed for longevity onscreen, first in an appropriately bizarre meeting with an auteurist director. “I had two stolen chickens in my agent’s car while I did the interview with David Lynch,” Mr. Cyrus said, having rescued the baby birds with Miley and her brother before they could become snake food at a petting zoo in Malibu. After he cameoed as the philandering pool guy in “Mulholland Drive,” Mr. Cyrus was cast as the lead  —   a Christian physician  —   in “Doc,” which ran from 2001 to 2004 on Pax TV. Ms. Cyrus   on the show and by 2006 had debuted as the   star Hannah Montana on the Disney Channel, with Mr. Cyrus appearing as her father, Robby Ray. What followed, along with more fame and fortune, was years of   (and parenting) scrutiny  —   Miley’s risqué Vanity Fair photos, the bong video, the twerking  —   that seems almost quaint in retrospect. “When you work as much in the business as we do, there’s gonna be peaks and valleys,” Mr. Cyrus said. “Fame is a dangerous thing, but when you volunteer for it, you have to accept that it ain’t all roses. ” “Here’s a lady singing about it right now,” he added, motioning to the speakers playing “Piece of My Heart” with Janis Joplin. For her part, Ms. Cyrus relishes a   relationship with her father these days. The pair prefers hanging at home, playing music together (she bought him a Tibetan singing bowl for his birthday)  —   “no TV on, just us talking, not on our phones or out to dinner for show,” she told this reporter last year. “I feel lucky that I’m his kid. When I sit with my dad, there’s a million things I could say that he could’ve done differently  —   as you could with any parent  —   but he’s the best dad I could’ve ever chosen. ” Though he stresses his outsider status, Mr. Cyrus, who favors distressed jeans, big sunglasses and western boots, also enjoys his insider connections. At the John Varvatos store on the Bowery, a staffer referred to Mr. Cyrus as a “friend of the brand,” gifting him an American flag scarf and leather jacket. Further downtown, while perusing the Morrison gallery’s rock ‘n’ roll photos, he told persuasive   stories, as if holding court on a barstool, of intimate interactions with the likes of Johnny Cash, Waylon Jennings, Carl Perkins, Bruce Springsteen, Paul McCartney, George Jones and even Kurt Cobain. “I wrote a poem about Kurt the day he died called ‘The Circus,’” Mr. Cyrus said. It was about life under the spotlight. “That’s when I said to myself, I need to step back from this because I don’t want to die. ” Mr. Cyrus eased his hard living  —   his only real indulgence since the   is marijuana, he said, but “just about enough to keep me from drinking”  —   though his ambition hasn’t slowed. In addition to his 14th studio album, “Thin Line,” due for release in September, he has been writing an environmental horror film about “fracking and all the damage it’s doing  —   but with blood and guts,” he said. Raised in a family of Southern Democrats, Mr. Cyrus said he follows politics “probably much deeper than anyone would think,” though he stopped short of picking sides in the presidential election, saying only that he respects both Hillary Clinton and Donald Trump, whom he called “a very brave and very intelligent man. ” (His promotional tour for “Still the King,” with its potential   audience, included Fox News.) “If there’s a heavenly father, there’s gotta be a Mother Earth,” he said, echoing Miley’s own recent   tendencies. (“I have to tell you, she learned that off me,” he added.) He also spoke out recently on Facebook against laws that regulate transgender bathroom access, citing Ms. Cyrus’s involvement in LGBT issues. But   as ever, he shrugged off any suggestion that his continued relevance is due only to his   daughter. “I don’t worry about it,” Mr. Cyrus said, aviator glasses shining on a New York street. “I was here first. ”'"}, "time": 1742561923.8795419}