{"duration": 0.06728243827819824, "input_args": {"text": "'This year’s SXSW festival is taking on President Trump, according to The Hill, which reported that the proceedings largely focused on negative rhetoric against the president. [“The centerpiece of the panel discussions is a series titled ‘Tech Under Trump,’” reported The Hill on Saturday, adding that the panel discussions “aren’t pulling any punches. ”  “NPR reporter Sam Sanders is hosting an event titled the ‘2016 Election: How We Got it Wrong! ,’ reflecting on his experiences covering the 2016 presidential race,” they continued. “Another discussion titled ‘Building Bridges When Others Want to Build Walls,’ is intended to highlight the uncertainty facing immigrants. One panel is discussing ‘From Trump to Trolls: How Muslim Media Fights Back. ’” “Some of the panels aren’t   but do highlight the tech industry’s policy priorities, including a discussion titled ‘Can You Hear Me Now? The Rural Broadband Debate,’ featuring Rep. Vicente González ( ) and Information Technology Industry Council President Dean Garfield,” The Hill concluded. “Even the festival’s art and music events are taking on a stronger political tone than in years past. One music showcase is titled ‘Contrabanned,’ and will feature acts from countries including Libya and Somalia, whose citizens are banned from entering the U. S. under Trump’s travel executive order. ” “I’ve never seen in my lifetime an atmosphere of fear as I’ve seen now,” said Sen. Cory Booker at the festival. “I feel a sense of pain about my country right now. “[Trump] isn’t backing away from his rhetoric. But if we don’t engage, we are the source of the problem, not the elected person we don’t like,” he added. In a SXSW session titled “Dark Days: AI and the Rise of Fascism,” Microsoft’s Kate Crawford even attempted to compare the rise of artificial intelligence with fascism. “Just as we are seeing a step function increase in the spread of AI, something else is happening: the rise of   rightwing authoritarianism and fascism,” Crawford declared. “We should always be suspicious when machine learning systems are described as free from bias if it’s been trained on   data. Our biases are built into that training data. ” SXSW’s chief programming officer Hugh Forrest praised the political slant on this year’s festival. “There is definitely a degree of politics or political focus that may not have been there in previous years,” said Forrest. “We hope people walk away with a little better understanding of issues and the players driving the issues. ” Forrest, who voted for Democratic presidential candidate Hillary Clinton, previously claimed to be “grieving” following President Trump’s victory in November. He also claimed to be excited about SXSW’s “role” in “paving a more progressive path to the future. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742563726.0697882}