{"duration": 0.11959052085876465, "input_args": {"text": "'Donald J. Trump on Wednesday called for the broad use of the contentious    policing strategy in America’s cities, embracing an aggressive tactic whose legality has been challenged and whose enforcement has been abandoned in New York. His support for the polarizing   policy  —   which involves officers’ questioning and searching pedestrians  —   collides with his highly visible courtship of   who have been disproportionately singled out by the tactic, data show. For Mr. Trump, the timing was especially inauspicious: It came as police shootings of black people were once again drawing scrutiny and protest. Mr. Trump has long championed    as a   tool in his hometown, New York, but on Wednesday he recommended that it be deployed in cities across the country that are struggling to control violence. It was the latest twist in Mr. Trump’s awkward, and at times counterproductive, outreach to black voters, who polls suggest remain deeply skeptical of him  —   and it occurred right after a prominent black supporter, Don King, used a racial epithet as he introduced Mr. Trump at a church in Cleveland Heights, Ohio. As Mr. King, the retired boxing promoter, sought to explain how society unfairly categorizes   he referred to a “dancing and sliding and gliding nigger,” before quickly correcting himself. “I mean Negro,” he said as Mr. Trump looked on a few feet behind him, grinning. Mr. Trump described his enthusiasm for    during a town   discussion, also in Cleveland Heights, after a voter pressed him on how he would reduce violence in black communities. “One of the things I’d do,” he said, “is I would do   . I think you have to. We did it in New York, it worked incredibly well and you have to be proactive. ” The largely white audience erupted into applause.  During the event, hosted by Fox News, Mr. Trump suggested that    would work well in cities like Chicago, which has been convulsed by gun violence, and Cleveland. “I see what’s going on here, I see what’s going on in Chicago,” Mr. Trump said before praising the technique again as “incredible. ” Black leaders reacted swiftly and harshly. “The idea of creating a national    policy is the equivalent of advancing martial law and is beyond the constitutional power of the presidency,” Marc H. Morial, president of the National Urban League, said in an email. In New York, Mayor Bill de Blasio, who has overseen the dismantling of    as official police policy, said what Mr. Trump was proposing “will simply alienate the very people who we need to be partners in the fight against crime. ” “He does not understand how policing works,” added Mr. de Blasio, a Democrat who is supporting Hillary Clinton, Mr. Trump’s Democratic rival for president.    has become a source of enormous tension between police officers and black residents in the cities that have deployed it as a   tool. Once credited with significantly reducing murders in urban centers like New York by removing weapons and drugs from the street, it has drawn protests and legal challenges. A federal judge in New York, Shira A. Scheindlin, struck down the tactic as unconstitutional in 2013, saying the way the city was using it violated the rights of minorities. About 83 percent of the stops in New York from 2004 to 2012 involved blacks and Hispanics, even though those two groups make up just slightly more than 50 percent of the city’s residents. Mayor Michael R. Bloomberg appealed the judge’s ruling, but after Mr. de Blasio took office the Police Department repudiated the strategy and stopped using it. Mr. de Blasio, who dropped the appeal, has called it a “broken policy. ” Similar complaints dogged the use of    in Chicago, prompting the Police Department to make an unusual concession: It now allows an independent third party to monitor its use. Mr. Trump remains an unabashed fan of the tactic and has glossed over the legal and racial objections to its use for years. In 2013, after Judge Scheindlin’s ruling, Mr. Trump took issue with those who would end the strategy. “NYC politicians better stop pandering  —   ending stop  frisk would be a disaster,” he wrote on Twitter. As a presidential candidate, Mr. Trump has repeatedly praised the procedure as a proven approach for reducing crime, holding up New York City’s experience as an example. “   is a very positive thing,” he said a few weeks ago. Mr. Trump is drawing historically low support from   according to several polls, and he has repeatedly stumbled in his attempts to appeal to them. He earned ridicule a few weeks ago when he told blacks that “you’re living in your poverty, your schools are no good, you have no jobs, 58 percent of your youth is unemployed  —   what the hell do you have to lose?” Wednesday was a chance for Mr. Trump to try a different approach, by speaking to black pastors. When asked about recent police shootings of black people in Tulsa, Okla. and Charlotte, N. C. he even seemed to fault the officer in the Tulsa case, saying, “I don’t know what she was thinking, but I’m very, very troubled by that. ” But Mr. Trump’s choice of the    Mr. King to introduce him was unusual: Mr. King was convicted of manslaughter in 1966, though he was later pardoned he has been investigated for possible connections to organized crime and he has no political experience. He is best known for promoting many of boxing’s   matches, like the 1974 “Rumble in the Jungle” between Muhammad Ali and George Foreman in Zaire. Standing at the pulpit in the New Spirit Revival Center in Cleveland Heights on Wednesday morning, Mr. King quickly veered off course as he recalled conversations in which he counseled black celebrities about the realities of race in America. “I told Michael Jackson, I said, ‘If you are poor, you are a poor Negro  —   I would use the N word  —   if you are rich, you are a rich Negro,’ ” Mr. King said. It was then that he seemed to slip up. “If you are a talented intellectual, you are an intellectual Negro. If you are a dancing and sliding and gliding nigger, I mean Negro,” he said, as he chuckled briefly and those in the racially mixed crowd laughed nervously around him. A smile remained fixed on Mr. Trump’s face. Beyond the walls of the church, reaction to the use of such an offensive word was quick and unforgiving. Barbara J. Holloway, 70, from Decatur, Ga. who is black, said Mr. King was “just playing into stereotypes and things that have hurt us in the past. ” “Instead of him trying to bring us forward and be positive in front of Trump, he is trying to take us back,” she said. It was, she added, “out of line completely. ” A few hours later, Mrs. Holloway was frustrated but not surprised to hear what Mr. Trump had said about   . “To me, it’s like you would be losing your freedom,” she said. “We already don’t have much value, it seems, and then now they want to say: ‘O. K. ma’am. Put your purse down. I think you got dope.’ They would have no reason to stop and frisk me. ” She added, “I expect nothing from Donald Trump that is really going to help me as a black American. ”'"}, "time": 1742563564.2125874}