{"duration": 1.3849868774414062, "input_args": {"text": "\"Share on Facebook The most fundamental principle, the basic program of all life, is energy saving. Whatever you do, whatever you like, whatever feels good for you, it's just a psychological response that shows you how to be more energy efficient. Life craves energy and subconsciously you'll always choose the path of least resistance because of that. That's why high calorie food tastes better, that's why whenever your beliefs are questioned you naturally refuse any arguments, that's why people feel more depressed when there is no sunshine outside. All default responses are just energy saving reactions; ‘more calories’ means more energy, changing the structure of your beliefs requires energy, and it's more efficient to do less when you are lacking the energy of the sun. However, a momentary ‘energy waste’ can result in a more sustainable energy consumption in the future. This requires higher levels of intelligence. For this to be achieved we must apply conscious effort in the right time and place. But what is the source of our energy? How can we gain more energy? How can we raise our consciousness and increase our intelligence? Nikola Tesla perfectly concluded what’s the main, most fundamental source of human energy and how to increase our energy and evolve as species. More energy means higher levels of operating power for our consciousness. If you apply time to this ‘equation’ it means that the longer we sustain higher levels of energy for our consciousness, the more intelligence we download from The Universe, the more intelligence we integrate into our being. So What's The Source Of Our Energy? “First let us ask: Whence comes all the motive power? What is the spring that drives all? We see the ocean rise and fall, the rivers flow, the wind, rain, hail, and snow beat on our windows, the trains and steamers come and go; we here the rattling noise of carriages, the voices from the street; we feel, smell, and taste; and we think of all this. And all this movement, from the surging of the mighty ocean to that subtle movement concerned in our thought, has but one common cause. All this energy emanates from one single center, one single source, the sun. The sun is the spring that drives all. The sun maintains all human life and supplies all human energy.” How To Increase The Human Energy? The following answer will make you understand almost everything about Nikola Tesla's lifestyle; why he was vegan; why he was obsessed with free energy; why he despised ignorance and imbeciles; How to increase human energy? There are actually 3 steps. The First Step Is Increasing The Human Mass: In order to increase the energy we have to think in terms of speed. If, let's say, there is a train and you add one more wagon, 3 things can happen. Either the wagon is of the same velocity as the train; in this case the speed of the train will slightly increase . The wagon is with a smaller velocity; in this case the whole train will decrease its speed . Or the wagon is of higher velocity; in this case the whole train will significantly increase its speed . We can think of it like this: ‘If there is a family with children of the same degree of enlightenment as the parents, that is, mass of the “same velocity,” the energy will simply increase proportionately to the number added. If they are less intelligent or advanced, or mass of “smaller velocity,” there will be a very slight gain in the energy; but if they are further advanced, or mass of “higher velocity,” then the new generation will add very considerably to the sum total of human energy.’ In Nikola Tesla's opinion growing muscles is “equivalent to adding mass of “smaller velocity,” and I would not commend it” but moderate exercise “insuring the right balance between mind and body, and the highest efficiency of performance, is, of course, a prime requirement” Food is one of the most important elements of increasing your mass. What we consider as food is just processed sunlight. Plants, with their photosynthesis, combine carbon, hydrogen and oxygen and bind them through sunlight, forming the CHO molecule (fat) we consume through food and burn for energy. However, the actual energy comes from freeing the photons of light between the chemical bond. That's what produces heat. That's what gives calories, stored photons. We eat sunlight for energy! Fruits, Vegetables, Meat, everything that we eat consumed the CHO molecules that the plants created. The energy that we consume through food is actually the same sunlight that plants used to forge these elements together. If we eat meat, we are consuming already consumed, unused CHO, as the only place that CHO comes is from photosynthesis. It's second hand CHO in a way. Consuming CHO directly from plants, fruits and vegetables is certainly equivalent to adding mass of “higher velocity,” “It is certainly preferable to raise vegetables, and I think, therefore, that vegetarianism is a commendable departure from the established barbarous habit. That we can subsist on plant food and perform our work even to advantage is not a theory, but a well-demonstrated fact. Many races living almost exclusively on vegetables are of superior physique and strength. There is no doubt that some plant food, such as oatmeal, is more economical than meat, and superior to it in regard to both mechanical and mental performance.” Nikola Tesla says. The consumption of second hand food is one of the main limits we put on ourselves for evolving as a race into more intelligent, kind and less animal like species. “To free ourselves from animal instincts and appetites, which keep us down, we should begin at the very root from which we spring: we should effect a radical reform in the character of the food.” Nikola Tesla continues. “Gambling, business rush, and excitement, particularly on the exchanges, are causes of much mass reduction” “Whisky, wine, tea coffee, tobacco, and other such stimulants are responsible for the shortening of the lives of many, and ought to be used with moderation. But I do not think that rigorous measures of suppression of habits followed through many generations are commendable. It is wiser to preach moderation than abstinence.” To conclude: Consume food that's closer to the sun, avoid unnecessary enlargements of your body that'll use more energy, avoid energy wasting habits and unhealthy addictions that serve solely to your ego. Each man who practices these advices adds a ‘wagon’ with higher velocity to the ‘human train’ we all move. The Second Step Is Reducing The Force That's Retarding The Human Mass: “The force which retards the onward movement of man is partly frictional and partly negative. To illustrate this distinction I may name, for example, ignorance, stupidity, and imbecility as some of the purely frictional forces, or resistances devoid of any directive tendency. On the other hand, visionariness, insanity, self-destructive tendency, religious fanaticism, and the like, are all forces of a negative character, acting in definite directions. To reduce or entirely overcome these dissimilar retarding forces, radically different methods must be employed. One knows, for instance, what a fanatic may do, and one can take preventive measures, can enlighten, convince, and, possibly direct him, turn his vice into virtue; but one does not know, and never can know, what a brute or an imbecile may do, and one must deal with him as with a mass, inert, without mind, let loose by the mad elements. A negative force always implies some quality, not infrequently a high one, though badly directed, which it is possible to turn to good advantage; but a directionless, frictional force involves unavoidable loss. Evidently, then, the first and general answer to the above question is: turn all negative force in the right direction and reduce all frictional force. “ Simply said, frictional force is ignorant, directionless, without a quality unlike the negative force which carries high quality but in a wrong direction. Frictional force will, most of the time, result only in energy loss no matter where it is directioned, while negative force can lead to significant increase of human energy if focused towards a proper, strategic direction.“There can be no doubt that, of all the frictional resistances, the one that most retards human movement is ignorance. Not without reason said that man of wisdom, Buddha: “Ignorance is the greatest evil in the world.” The friction which results from ignorance, and which is greatly increased owing to the numerous languages and nationalities, can be reduced only by the spread of knowledge and the unification of the heterogeneous elements of humanity. No effort could be better spent.” Nikola Tesla concludes. Individually, this can be explained as maintaining constructive balance between our talents and flaws; establishing peace between our darkness and light and uniting them towards a mutual, greater goal. This, of course, needs to be accompanied with learning, curiosity and reducing individual ignorance about The Universe around us. Cleansing your chakras is as essential as taking a bath in the context of reducing the force that's retarding your energy. Allowing energy to flow freely through your own body ensures a reduction in friction. It decreases the waste of your energy with fighting the negative emotions that are clogging your energy pools. According to Nikola Tesla war should not be terminated suddenly as this can result in something worse than war. “War is a negative force, and cannot be turned in a positive direction without passing through, the intermediate phases. It is a problem of making a wheel, rotating one way, turn in the opposite direction without slowing it down, stopping it, and speeding it up again the other way.” We shouldn't stop war, but redirect it towards a mutual goal of humanity. For example, instead of fighting ourselves, we can redirect our energy towards exploration of different parts of our galaxy. Of course, gently and gradually, with great maintenance. “It is doubtful whether men who would not be ready to fight for a high principle would be good for anything at all” Nikola Tesla explains why war is not a frictional force but one of a negative character. In his views, the future of war should result in reduction of man power exchanged for machines that will take the hit. To see how this can happen we must see how everything began. It started with the law of the strongest where physically weaker men were thrown completely to the mercy of physically stronger men. However, the weaker men developed intelligence due to their energy efficiency and developed ways to use stones, sticks and make weapons. Today wars are held by men who smoke cigars, sitting in a room, completely controlling physical forces with their intelligence. The future will make the intelligence create machines and control them instead of men, until war is mainly intellectual and the physical factor is completely irrelevant. To conclude: Use your talents to guide your flaws. Find peace and eliminate forces of friction with reason, within you and around yourself. The Third Step Is To Increase The Force Accelerating The Human Mass: “Of the three possible solutions of the main problem of increasing human energy, this is by far the most important to consider, not only because of its intrinsic significance, but also because of its intimate bearing on all the many elements and conditions which determine the movement of humanity.” How do you increase the force that's moving the human mass? Simply, spend more energy and spend it towards the most efficient possible direction. Our world is driven by machinery under a system created by our motive power. The mass of people is not moving chaotically but systematically, following an order like a clockwork. If we decrease our motive power we'll, unintentionally, be imprisoned by the same system we alone have created. That's why increasing the motive power is key in increasing the human energy. Constantly increasing the motive power will result in a constant increase of human energy. “Motive power means work. To increase the force accelerating human movement means, therefore, to perform more work.” says Nikola Tesla. But how can one man increase his energy constantly? Will there not be a point when the man cannot do more work? Will there not be a point when doing more work becomes harmful to the man, even unhealthy? There is a secret. When a man applies his effort so that, when coming into effect it will be in the direction of the collective human movement, the effort becomes most efficient and with less energy more is achieved. This means that as more people do more work towards a mutual goal, as more is achieved with less effort resulting in increase of mutual energy. Think of it like spinning a wheel. At first, for only a fragment of its potential speed you need a lot of effort and energy to even start moving the wheel. As you start moving the wheel and applying effort in the direction of its movement, as less effort it demands and as faster it keeps spinning. In the end, with less effort than it was demanded from you to move the wheel an inch, you spin it countless times faster. The same is with human energy! The secret of energy is that it is eternal in The Universe where almost nothing is. Your energy, no matter where you spent it, will forever stay and spread out if not directioned. That's why it's crucially important to focus your effort. As you spend your energy towards one direction, with time this energy will accumulate and less effort and energy you'll need to achieve a lot more. This is true globally and individually. “Another answer we have now found to the above great question: To increase the force accelerating human movement means to turn to the uses of man more of the sun's energy.” Imagine what we can accomplish if we all focus our efforts toward creating more sustainable ways of generating energy; cleaning the earth; reducing hunger; finding solutions for interstellar travel; educating; To conclude: Focusing your motive power and effort on one goal, towards the right direction of movement, will accelerate the velocity with which you move closer to your goal. With time, you'll spend less effort and achieve more. Conclusion: To gain your energy from the right sources means you gain more energy from less; reducing the retarding factors means you have less friction that wastes your energy; focusing your motive power towards the direction of the collective human movement means you use others' energy to boost your energy. Gain more energy, waste less energy, spend the energy so next time you'll need less to achieve more. Increase human mass, reduce retarding force, and increase the force accelerating the human mass. Follow this process with reason. Gain more, waste less, spend efficiently, learn. That's the secret formula for increasing the collective human energy according to the great mind of Nikola Tesla. That's how we raise our intelligence and evolve as species.\""}, "time": 1742564454.8535066}