{"duration": 0.07865262031555176, "input_args": {"text": "'You are here: Home / US / Media Treatment of Kaepernick Versus Tebow Brilliantly Compared Media Treatment of Kaepernick Versus Tebow Brilliantly Compared October 28, 2016 Pinterest \\nC.E. Dyer reports that the San Francisco 49ers announced on Tuesday that Colin Kaepernick will regain his starting quarterback position that had been given to Blaine Gabbert for the first five games of the NFL season. \\nKaepernick, as you likely already know, waged a disrespectful protest against alleged racial injustice in the country by first sitting during the national anthem and then taking a knee — because somehow that is supposed to be less disrespectful, ignorant, and petulant (it isn’t, but whatever). 49ers new starting QB is Colin Kaepernick. \\n— Adam Schefter (@AdamSchefter) October 11, 2016 \\nWe’ll see what happens, but the first quarter of the NFL season has seen a major drop in the ratings. Despite the NFL’s denials, it’s highly likely that the #NFLBoycott movement in response to the protests by Kaepernick and other players has had an effect on the ratings. \\nIt’s bad enough that Kaepernick is allowed to continue his farcical protest, but now he’s back in the starting role. Kaepernick, who is biracial and was adopted by white parents, will take over the starting role from Blaine Gabbert, who is white. Kaepernick also rakes in an average of $19 million a year. \\nOh, the racial injustice of it all! It’s systemic I tell you! Kaepernick hates the system so much, but I’m sure he likes the free market principles that allow him to make millions of dollars to throw a football. \\nPeople are struggling in this country and probably don’t like to watch a foolish multi-millionaire, whine about the farce that is “systemic racism,” when they try to enjoy a football game — just a guess. \\nUnless Kaepernick and other players are in on it, they have allowed themselves to be pawns in the left’s radical, globalist agenda that seeks to use identity politics such as race, gender, class warfare, etc. to divide and conquer. \\nKaepernick is blessed to live in this great country that allows him and his fellow players to make enormous amounts of money to play a child’s game. Instead of being grateful, he chooses to disrespect the country that afforded him such extraordinary opportunities. \\nHe uses the massive platform he’s been given to peddle a racist lie instead of taking the time to educate himself about the facts — which disprove the agenda spread by groups like Black Lives Matter, a group that is bankrolled in part by progressive left-wing billionaire George Soros and other left-wing big money. \\nWe’ll see how long the NFL allows this offensive spectacle to go on. Their bottom line has clearly taken a hit — the ratings are down 11 percent according to an internal NFL memo — and as we all know, money talks.'"}, "time": 1742564121.9019601}