{"duration": 0.15111923217773438, "input_args": {"text": "'It was the Friday before Labor Day, and Alicia Keys, the    pop star, was on the “Today” show performing for the program’s summer concert series  —   she’s about to release a new album, and she wrote the theme song for “Queen of Katwe,” out next week. There was a lot to talk about. But instead, Ms. Keys spent most of her time talking about makeup (and not wearing it) with the anchors Tamron Hall, Billy Bush and Al Roker, who were doggedly wiping the pancake off their faces. “You’re all crazy,” said Ms. Keys, swabbing Ms. Hall’s cheeks. “This isn’t even what it’s about!” “It” is #nomakeup  —   a meme, a movement, a cri de coeur  —   that has been roiling social media for months. If you missed the kerfuffle, it started in May, when Ms. Keys wrote an essay for Lenny, Lena Dunham’s online magazine, about the insecurities she felt being a woman in the public eye, and the roles (and makeup) she put on over the years to armor herself. She wrote about the anxiety she endured if she left her house unadorned: “What if someone wanted a picture? What if someone posted it?” And then, when she went without makeup or styling for an album portrait, she felt liberated, and the act became a metaphor. “I hope to God it’s a revolution,” she wrote. In the months that followed, Ms. Keys was seemingly everywhere  —   always without makeup, always beautiful  —   performing at the Democratic National Convention, on “The Voice” and the MTV Video Music Awards, at the Tom Ford show during New York Fashion Week. That’s a nice story, right? Inspiring and kind of sweet? Feh. “  2016,” as The New York Post and others called it, has grown only weirder and louder, as Twitter was at first ignited with Alicia Keys supporters, and then flooded with a backlash against her. And then with the backlash to the backlash. #Nomakeup was empowering and brave. No, it was annoying, incendiary and invasive. Ms. Keys’s (mostly female) detractors howled at her disingenuousness (surely she had spent thousands on skin care?) and her deceit (surely she was wearing tinted moisturizer?) some slammed her for not looking pretty enough (though they used coarser words than those). Late last month, Swizz Beatz, Ms. Keys’s husband, took to Instagram with a video defending his wife: “This is deep,” he said, clearly incredulous. “Somebody’s sitting home mad, because somebody didn’t wear makeup on their face?” Don’t be surprised that this is news, said Letty Cottin Pogrebin, the   feminist activist and author. “It’s all so familiar,” she said. “Alicia Keys could be taking a page from the   orthodoxy of the women’s movement 40 years ago. I’d never heard of her before this brouhaha, but now I’ll follow her anywhere. What she’s doing is   . She’s not just talking about the tyranny of makeup. She’s talking about female authenticity. She’s challenging the culture’s relentless standards of feminine conformity and the beauty industry’s incessant product hype. ” (Ms. Pogrebin said that while she was reading Ms. Keys’s essay, an ad popped up for some kind of skin cream.) Why is it, wondered Linda Wells, founding editor of Allure magazine, that fashion is considered   and makeup is  ? Or something more pernicious? Ms. Wells recalled “The Beauty Myth,” Naomi Wolf’s 1991 book in which she argued that contemporary ideals of beauty, proposed in large part by a   cosmetics industry, were enslaving women and holding them in thrall to all manner of restrictive practices, from makeup to surgery to eating disorders. “I get the argument, but I don’t agree with it,” Ms. Wells said. “To me, we’re not all passive victims. Make your choice, like Alicia Keys. Decide what makes you feel confident and enjoy it. ” Furthermore, Ms. Wells said, Ms. Keys’s gesture is coming at a particular moment, when the internet is flooded with YouTube videos on how to best present yourself   …     on the internet. “It’s tutorials about contouring and highlighting, except now it’s called strobing, and there’s something else called baking, which is basically a thick coat of powder,” Ms. Wells said. “It’s a very extreme look  —   we haven’t had highlighting since the ’80s. It’s this sort of extreme grooming geared for the selfie culture, and then someone like Alicia Keys comes out and says, ‘I’m not going to do it,’ and people are losing their minds. ” Whose makeup is it anyway? In the late 1980s, Andrea Robinson, then the president of Ultima II, recalled the response of her male bosses at Revlon when she proposed an extension of her brand called the Nakeds,   makeup designed for women who didn’t want to look as if they were wearing any. As Ms. Robinson remembered: “They said: ‘Why would a woman want to wear mud on her face? Makeup is about fantasy, it’s about color.’ What they didn’t say was that it was about their fantasy, their sense of color. The idea that women would want to look like themselves, and wear makeup for themselves, was crazy to them. ” Once introduced, the Nakeds broke all sorts of sales records, she said, and sold out over and over again. Hundreds of women wrote her in gratitude, Ms. Robinson said, including Jean Harris, who wrote her from prison: “She thought we had the right idea, that women should not overpaint themselves, and use their simple beauty. ” For the record, cosmetics executives aren’t worried that #nomakeup will have women hurling their lipsticks into the Dumpster. “It’s a makeup moment,” said Jane Hertzmark Hudis, group president of the Estée Lauder Companies, adding that her industry is experiencing “explosive growth,” with “prestige” makeup sales up 13 percent last year, according to the NPD Group (sales driven in large part by concealers, as it happens). Sales of all beauty products reached $16 billion in this country in 2015. Nude colors are consistent best sellers, Ms. Hudis said. Just ask Bobbi Brown, the makeup artist turned cosmetics mogul who built a company, as Ms. Robinson did, around nude makeup, and whose corporate manifesto right now is #bewhoyouare. “It takes a lot of guts to face HDTV without makeup,” Ms. Brown said of Ms. Keys. “But I get it. It’s all fine. Choose who you want to be. Personally, I like to have a little concealer. But obviously it’s more than about makeup. I don’t think people understand how difficult it is for women like Alicia Keys to worry about the way you look every second. It is the ugly internet we live in. Let’s be nice to people, and not be so judgey. ” There is a sense you just can’t win. When Kim Novak appeared on the Academy Awards in 2014, there was much snark regarding her clearly augmented face. Laura Lippman, the crime novelist who was then 55, was appalled: Who were these internet trolls who would weigh in so viciously on an   ’s appearance? In solidarity with Ms. Novak, she posted a selfie of her face “as is” and invited others to do the same. It was a different sort of #nomakeup moment. “Damned if you do, damned if you don’t, is how I felt,” she said. The response, she said, was overwhelming: thousands of “as is” photos from all sorts of people, including one man, she said, who photographed himself on a hospital gurney the day he had a minor heart attack. It’s just complicated, said Sheila Bridges, the interior designer. Given an alopecia diagnosis years ago, she decided to shave her head rather than contend with wigs or weaves, a private act that has subjected her to constant, uninvited public commentary. Also, people have been moved to pat her head. “Historically, beauty has been our currency as women,” Ms. Bridges said, “and when you do something that is inconsistent with societal norms, people get upset. It reminds me of when Gabby Douglas won her gold medals at the London Olympics. ” It was 2012, and the    was taking home two gold medals for her performances, but much of the conversation around that historic event  —   Ms. Douglas was the first   woman to earn the Olympic   title  —   was about how her hair was pulled into a ponytail and secured with clips. “There was a tremendous backlash,” Ms. Bridges recalled, “and all these terrible tweets, and what was so disturbing for me was that the majority seemed to come from other black women. I’m like: ‘Are you kidding? She’s one of the world’s best athletes, and we’re talking about her hair? ’” Gail O’Neill, a journalist and former model, said that for some, Ms. Keys has become a Rorschach test, and the disapprobation for the singer’s personal choice comes from women who are measuring themselves against it. “When women start applying makeup as preteenagers,” she said, “by adulthood, that mindless habit can result in a mask we don’t even know we’re wearing until someone like Alicia decides to remove hers in public. ” People who do things outside the herd scare people who are in the herd, said Anne Kreamer, a journalist who stopped coloring her hair at 49, and wrote about her experience in her 2007 book, “Going Gray: What I Learned About Beauty, Sex, Work, Motherhood, Authenticity and Everything Else That Matters. ” “It was the women who were the most critical,” Ms. Kreamer recalled, as if by doing without herself, she was taking something away from them. In her book, Ms. Kreamer noted that in the 1950s, fewer than 10 percent of women dyed their hair, as compared with 40 to 75 percent in the   she also surveyed some 400 women, of which 15 percent said they’d had some sort of plastic surgery. As she wrote, darkly, “Extrapolate the trend line, double the available technologies, and imagine the choices and pressures our   may face. ” In 1983, Ms. Pogrebin wrote an article called “The Power of Beauty” for Ms. the magazine she helped found. She was galvanized to do so when a friend had a chin augmentation, and then blossomed, emotionally, as a result. What’s the proper feminist response, Ms. Pogrebin asked herself, to such an extreme renovation: to offer congratulations, or wincing disapproval? If a feature distracts people from what they feel is their true selves, how can you argue with their alteration of that feature? But then again, as Ms. Pogrebin pointed out, whose notion of attractiveness motivated the change? “We can argue about what is attractive, but not that we wish to attract,” she wrote. The solution to not making ourselves crazy, she suggested, is to propose a broader definition of beauty, one that celebrates its impact but reduces its tyranny. Meanwhile, the churn about women’s looks continues. Last week, after Hillary Clinton’s performance on NBC, Reince Priebus, chairman of the Republican National Committee, took to Twitter to chastise the former secretary of state   …     for not smiling.'"}, "time": 1742562251.3057125}