{"duration": 0.05081605911254883, "input_args": {"text": "'In a press release for their most recent data dump, whistleblowing service WikiLeaks claims that the CIA has lost control of their “hacking arsenal. ”[The press release states that WikiLeaks’ publication of CIA documents is the “largest ever publication of confidential documents on the agency. ” The data dump consists of 8, 761 files and documents taken from a   isolated network situated inside the CIA headquarters in Langley, Virginia.  Explosively, WikiLeaks also claims that the CIA has lost control of their “hacking arsenal. ” Recently, the CIA lost control of the majority of its hacking arsenal including malware, viruses, trojans, weaponized “zero day” exploits, malware remote control systems and associated documentation. This extraordinary collection, which amounts to more than several hundred million lines of code, gives its possessor the entire hacking capacity of the CIA. The archive appears to have been circulated among former U. S. government hackers and contractors in an unauthorized manner, one of whom has provided WikiLeaks with portions of the archive. WikiLeaks states that their data dump contains information outlining the CIA’s global hacking program, the large collection of malware utilized by the agency, and their “zero day” weaponized exploits which could be used to hack “Apple’s iPhone, Google’s Android and Microsoft’s Windows and even Samsung TVs, which are turned into covert microphones. ” Since 2001 the CIA has gained political and budgetary preeminence over the U. S. National Security Agency (NSA). The CIA found itself building not just its now infamous drone fleet, but a very different type of covert,   force  —   its own substantial fleet of hackers. The agency’s hacking division freed it from having to disclose its often controversial operations to the NSA (its primary bureaucratic rival) in order to draw on the NSA’s hacking capacities. By the end of 2016, the CIA’s hacking division, which formally falls under the agency’s Center for Cyber Intelligence (CCI) had over 5000 registered users and had produced more than a thousand hacking systems, trojans, viruses, and other “weaponized” malware. Such is the scale of the CIA’s undertaking that by 2016, its hackers had utilized more code than that used to run Facebook. The CIA had created, in effect, its “own NSA” with even less accountability and without publicly answering the question as to whether such a massive budgetary spend on duplicating the capacities of a rival agency could be justified. The press release notes the vulnerability of these “cyber weapons” and how easily they can be hijacked by third parties: Once a single cyber ‘weapon’ is ‘loose’ it can spread around the world in seconds, to be used by rival states, cyber mafia and teenage hackers alike. WikiLeaks founder and editor Julian Assange gave his own comment on the release, stating: There is an extreme proliferation risk in the development of cyber ‘weapons’. Comparisons can be drawn between the uncontrolled proliferation of such ‘weapons’ which results from the inability to contain them combined with their high market value, and the global arms trade. But the significance of “Year Zero” goes well beyond the choice between cyberwar and cyberpeace. The disclosure is also exceptional from a political, legal and forensic perspective. Read the full press release here. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742563918.5385776}