{"duration": 0.08018016815185547, "input_args": {"text": "'Comments \\nUntil this election, nobody knew that North Carolina was a state firmly committed to Jim Crow -style racism, but today it’s been literally difficult to even pass several hours without yet another illegal scam to suppress minority votes being revealed . \\nA federal judge slammed North Carolina elections officials in court today in a case filed by the NAACP , where the US Attorney General weighed in to let the bench know that if proven, the allegations would show three major violations of the National Voter Registration Act. \\nDuring oral arguments, the judge explicitly called North Carolina’s voter challenge law a Jim Crow law, like the ones which began apeparing in the 1890s and codified American apartheid in the South, leading to the civil rights laws of the 1960s. CBS reports : \\nU.S. District Judge Loretta Biggs said multiple times the challenge process sounds “insane.” The NAACP says counties are violating federal law by removing voters less than 90 days before the election. “This sounds like something that was put together in 1901,” she told lawyers for the state. \\nThe judge also said she was “horrified” by the number of removals in Cumberland County, which accounted for the majority of the statewide total. “It almost looks like a cattle call, the way people are being purged,” she told county attorney Rick Moorefield. \\nClearly, election boards and politicians in North Carolina are only restrained by the spectre of federal enforcement via the pre-clearance mechanism of the Voting Rights Act. Unfortunately, since the moment that the Supreme Court decided to override the will of Congress and gut the Voting Rights Act in 2013, the impact of that willful act of judicial activism by conservative jurists has echoed in places where racism didn’t arrive with Trump, but festered secretly for decades, waiting for the opportunity to strike. \\nThe North Carolina officials who conducted the purge said they were following a bizarre state law, which the United States Department of Justice (DOJ) has already indicated that it believes violates the National Voter Registration Act. Here’s how Republicans in North Carolina purged 6,700 voters from three counties, who are mostly Democrats: \\nUnder state law, any voter can challenge another county resident’s registration, resulting in a hearing where the challenger presents evidence, according to a state legal filing. If local officials find probable cause, the challenged voter is given notice of a subsequent hearing. A voter who doesn’t rebut the evidence can be removed. \\nThe NAACP lawsuit cites Cumberland, Moore and Beaufort counties, where activists have challenged thousands of voters. The challengers include volunteers with the Voter Integrity Project, which says it wants to guard against voter fraud. In most cases cited by the lawsuit, mail to a voter is returned as undeliverable, which county boards can accept as evidence the voter doesn’t live there. \\nThe DOJ filed Statement of Interest on the side of the NAACP, saying that if their allegations are proven true in court, there would be three separate provisions of the National Voter Registration Act. Apparently, the judge’s reaction means that they made the case: \\nThree limitations on the removal of voters are pertinent here: (1) a jurisdiction may not remove voters based on a purported change of address outside of the jurisdiction using only mail returned as undeliverable and without following specific required procedures; (2) a jurisdiction may not remove voters based on a change of address within the same jurisdiction; and (3) a jurisdiction may not carry out a program of systematic removals within 90 days of a Federal election. \\nU.S. District Judge Biggs is expected to rule in the case early tomorrow, but it sounds like her opinion has already been made up after today’s hearing. \\nNorth Carolina voters are facing unprecedented political roadblocks this year and it’s all due to their state Republican party’s all out war against letting people vote. It looks like the NC GOP is getting nervous that nobody will vote for bigotry laws that have damaged their state’s economy, so they’ve got to do everything they can to rig the election by preventing people from voting.'"}, "time": 1742563333.7914674}