{"duration": 0.036407470703125, "input_args": {"text": "'Donald Trump is going to win a second term in 2020: you read it here, first. [I, in turn, heard it straight from the lips of an administration insider  —   Dr Ted Malloch, the business economics professor and prospective US ambassador to the European Union, who advised Trump from the early stages of his presidential campaign, and whom I’ve interviewed for this week’s Delingpole podcast.  Malloch is an ardent conservative of impeccable pedigree. I asked him what message he had for all those NeverTrump conservative types who still maintain that Hillary would have made the better President. Malloch: Get over it and move on. It’s what we’ve got. And guess what? It’s not for four years  —   it’s gonna be for eight years. He has already instigated his   campaign and I think I’ll break to you what the motto’s going to be. Can you guess? Delingpole: Um  —   Make America Great Again Again? Malloch: Keep America Great. Which has a certain assumption built into it: that during the next four years we’re going to achieve a great deal. And that then we just have to maintain that kind of trajectory. So this argument about what kind of conservative Trump is  —   is he a purist?  —   first of all he’s not a political philosopher and doesn’t purport to be an intellectual  …    This is not your father’s Oldsmobile. This is not your father’s Republican party. This is Donald Trump’s Republican party and it’s going to be a party that is more pragmatic, that is less ideological, that is more oriented towards national identity, towards   international relations and towards a degree of populism. So I would say ‘Like it or leave it.’ Forthright, supremely   and articulate, Malloch talks a good game. He would, no question, be a very entertaining US ambassador to the EU. But his appointment is being aggressively resisted by the EU establishment, which hasn’t taken kindly to his subtle hint in a BBC interview that, like the Soviet Union, it’s an empire ripe for collapse. I asked him why he thinks the war against Trump and his supporters has become so vicious. Malloch, a keen student of political history  —   he’s currently Professor of Strategic Leadership and Governance at Henley Business School  in the   believes that we are in the throes of a revolution and that the losers (who until recently were the political establishment) just aren’t enjoying losing. The Brexit and Trump shocks of 2016, he believes, are the   to the global takeover by the   in 1968. Malloch: In leftist circles and in academia both in Europe and the United States, the question has often been ‘Where were you in May of 1968?’ And the question was, of course: ‘Were you in Paris on the barricades? Were you part of the left? Were you taking that revolution to the streets?’ So we can ask this question, in a few years: ‘Where were you in 2016 when Donald Trump was elected president?’ Now we didn’t have any barricades on the street  —   although there were protests. We used mostly election booths to bring about our democratic means. But I think there is a significant change  —   both a watershed in world history and a change in the direction of American politics, that people will be writing about, frankly, hundreds of years from now. I’ve jokingly said that there are four faces carved into the mountain in South Dakota called Mount Rushmore. And they might have to find some more rock if this all goes as planned. ” Yup, you’re going to enjoy this podcast. Listen to it here. Or, if you do iTunes, here.'"}, "time": 1742628394.2681298}