{"duration": 0.12146401405334473, "input_args": {"text": "'Before Debbie Bowers had surgery for breast cancer, her doctor promised that insurance would pay for reconstruction, and said she could “even go up a cup size. ” But Ms. Bowers did not want a silicone implant or bigger breasts. “Having something foreign in my body after a cancer diagnosis is the last thing I wanted,” said Ms. Bowers, 45, of Bethlehem, Pa. “I just wanted to heal. ” While plastic surgeons and oncologists aggressively promote breast reconstruction as a way for women to “feel whole again,” some doctors say they are beginning to see resistance to the surgery. Patients like Ms. Bowers are choosing to defy medical advice and social convention and remain breastless after breast cancer. They even have a name for the decision to skip reconstruction: They call it “going flat. ” “Reconstruction is not a simple process,” said Dr. Deanna J. Attai, a breast surgeon in Burbank, Calif. and a past president of the American Society of Breast Surgeons, adding that more of her patients, especially those with smaller breasts before diagnosis, were opting out of reconstruction. “Some women just feel like it’s too much: It’s too involved, there are too many steps, it’s too long a process. ” Social media has allowed these women to become more open about their decision to live without breasts, as well as the challenges, both physical and emotional, that have followed. For a recent video created by wisdo. com, a social media platform, and widely shared on Facebook, Ms. Bowers and her friend Marianne DuQuette Cuozzo, 51, removed their shirts to show their scarred, flat chests. And Paulette Leaphart, 50, a New Orleans woman whose clotting disorder prevented her from having reconstruction after a double mastectomy, walked topless from Biloxi, Miss. to Washington this summer to raise awareness about the financial struggles of cancer patients. “Breasts aren’t what make us a woman,” Ms. Leaphart said. The nascent movement to “go flat” after mastectomies challenges   assumptions about femininity and what it means to recover after breast cancer. For years, medical professionals have embraced the idea that breast restoration is an integral part of cancer treatment. Women’s health advocates fought for and won approval of the Women’s Health and Cancer Rights Act of 1998, which requires health plans to cover prosthetics and reconstructive procedures. Since then, breast reconstruction has become standard care. More than 106, 000 reconstructive procedures were done last year, a 35 percent increase since 2000, according to the American Society of Plastic Surgeons. While it is not known exactly what percentage of women opt for breast reconstruction after a mastectomy, one study found that in 2011, 63 percent of women who were candidates for the procedure chose to have it. In some parts of the United States, the number is closer to 80 percent today. In promoting the surgery, doctors cite studies that suggest breast reconstruction improves a woman’s quality of life after cancer. But some women say that doctors focus too much on physical appearance, and not enough on the toll prolonged reconstructive procedures take on their bodies and their psyches. Up to   of women who undergo reconstruction experience complications. A systematic review of 28 studies found that women who went without reconstruction fared no worse, and sometimes did better, in terms of body image, quality of life and sexual outcomes. “That’s the dirty little secret of breast reconstruction: The risk of a major complication is higher than for the average elective surgery,” said Dr. Clara Lee, an associate professor of plastic surgery at Ohio State University who performs the procedure. Ms. Cuozzo, who appeared in the Facebook video with Ms. Bowers, spent a year having her breasts rebuilt after a double mastectomy, but after four infections in five months, she had the implants removed. The reconstruction, she said, “was getting worse than the cancer. ” While some states, including New York, now require physicians to tell women about the availability of breast reconstruction, women say they often are not informed of the option to remain flat. “I was never told there was a choice,” Ms. Cuozzo said. “I went from the breast surgeon to the plastic surgeon, and they said, ‘This is what you’re going to do. ’” Dr. David H. Song, chief of plastic surgery at the University of Chicago and immediate past president of the American Society of Plastic Surgeons, said that the risk of complications was real, but that focusing on them was like focusing on plane crashes when “millions of flights land safely. ” Given advancements in surgical techniques, “the aesthetic result can be better than the native breast,” Dr. Song said. “Patients can come out the other end looking more youthful, with a better aesthetic in her breast than before. ” But it is that kind of talk  —   suggesting that a reconstructed breast is an improvement on a woman’s natural breast  —   that enrages many women who have undergone mastectomies. For starters, a reconstructed breast is often numb and can no longer play a role in sexual arousal. It often lacks a nipple, since the nipple is usually removed in a mastectomy. After looking at photos of reconstructed breasts, “I was slightly horrified,” said Charlie Scheel, 48, of Brooklyn, who decided against implants after a double mastectomy. “You don’t have nipples and you have scars everywhere. ” Rebecca Pine, a cancer survivor from Long Island who   a photography and writing project called “The Breast and the Sea,” said, “It’s a tremendous amount to put your body through, and it’s not like we’re going to get our breasts back. ” Ms. Pine, 40, had reconstruction after her first mastectomy, but had the implant removed later when she had a prophylactic mastectomy on her other breast. “They don’t look or feel, in most cases, like our breasts,” she said. “The nerves are cut, so they’re not receptive to feel or touch. ” Dr. Susan Love, author of a   book about breast health, said that doctors aiming to expand access to reconstruction may have become overly enthusiastic about the surgery. “Surgeons became so proud of what we were able to do that we may have forgotten that not everybody may want it,” Dr. Love said. Dr. Marisa C. Weiss, founder of breastcancer. org, said doctors should not assume every patient wants reconstructed breasts. “I’ve had   dancers who do not want reconstruction and nuns who say, ‘I need reconstruction,’” she said. Some women say physicians pressured them to get implants. When Catherine Stapleton, of Florida, woke up after her mastectomy, she discovered that her breast surgeon, a woman, had left unsightly flaps of skin and tissue that could be used for breast reconstruction later, in case she changed her mind. “When I woke up from anesthesia, I was in shock,” said Ms. Stapleton, 58, who is now facing additional major surgery to correct the first procedure. Geri Barish, president of the Long Island advocacy group 1 in 9, said a doctor had chided her when she opted against reconstruction. “One doctor said to me: ‘How can you walk around like that? You look deformed,’” she recalled. Support groups and social media have allowed women to share stories about the realities of reconstruction. “A lot of the women in my support group had infections, and they were surprised at how many surgeries were involved,” said Alicia Staley, 45, who stayed flat after a double mastectomy. “As I compared notes, I wondered, ‘Why are all these women doing this to themselves? ’” Coming to terms with a flat chest after breast cancer can be difficult. While some women wear a prosthesis in their bra, it is not uncommon for them to stop using it. “They’re heavy, they’re uncomfortable, and they’re in a sensitive area where you have scars,” Ms. Pine said. Women say they take many of the clothes they wore before surgery to Goodwill and begin wearing scarves and long strands of beads to hide their flat chests. Others try to embrace their new form by having elaborate tattoos inked where they once had breasts. Ms. Pine has a lotus flower tattoo on one side and a dragonfly on the other. Sara   39, a technical writer in Kalamazoo, Mich. tried two types of implants but had a constant burning sensation and got rid of them. She then started a virtual support group called Flat and Fabulous. “We’re not ” she said. “But many women never feel it’s part of their body. ” For Kate Cloudsparks, 64, a farmer in southern Iowa who has been flat since a preventive mastectomy 21 years ago, discovering the Flat and Fabulous Facebook page this year led to her first communication ever with women who had made the same choice. “I didn’t know anybody else like me. I was carrying it around for 20 years without having anywhere to share it,” she said. “Finally, I had an opportunity to talk about what it’s been like to live as a woman without breasts. ”'"}, "time": 1742562805.3864863}