{"duration": 0.21555519104003906, "input_args": {"text": "'TORONTO  —   Kiefer Sutherland was playing tour guide. On the set of the new ABC series “Designated Survivor” here earlier this month, he clutched a pack of Camels and walked,   slapping, through a replica of the West Wing, pointing out where the president’s chief of staff sits, running his hand along the curved wall of the Oval Office. In front of a painting of George Washington, he offered this historical nugget: “He was actually quite handsome but the painter hated him. Unflattering. ” Later, while ruminating on President Washington’s dental problems, Mr. Sutherland stood in a hallway with his back to another presidential portrait: his own. The placard beneath read Tom Kirkman. After spending nearly a decade protecting the president on the Fox series “24,” Mr. Sutherland now requires his own detail. On “Designated Survivor” he plays a   cabinet member who ascends to the Oval Office when Congress is wiped out by an attack during a State of the Union address. The actor leaves behind the   antics of the counterterrorism agent Jack Bauer to play a policy wonk thrust into a job he never wanted. Mr. Sutherland hasn’t exactly disappeared since “24” ended its regular series run in 2010. Among other gigs, he did two “24”  projects, and appeared in   fare, including Lars von Trier’s “Melancholia,” and “Forsaken,” a western with his father, Donald Sutherland. And in August, he released his first album, “Down in a Hole,” filled with   country songs that he helped write. He’s been touring extensively, recently appearing at the Grand Ole Opry. But these have mostly been quiet endeavors, at least relative to the cultural noise generated by “24. ” Mr. Sutherland’s first network series   the   “Touch” on Fox, failed to find an audience, and was canceled after two seasons. If the public wants a repeat of Mr. Sutherland leading a slick drama that giddily seizes the   political moment, then “Designated Survivor”  —   a glossy   of political thriller, “The West Wing”  nation building and domestic drama  —   might be the show that delivers him back to the affections of the mainstream. Mr. Sutherland, 49, sat on a leather couch in the president’s private office  —   slight his arms tattooed prone to long, circular sentences  —   remarking on the difficulty of not appearing too presidential amid such surroundings (even if they are fake). “The set’s so good that you can’t help standing a little straighter,” he said. “There’s something about how significant that office is. We watched Kennedy’s kids play there, Nixon getting himself out of Watergate. It does have an impact on your performance. ” With an   narrative driving this election cycle, Mr. Sutherland’s respectful nostalgia for political office seems surprisingly  . Television politicians these days are mostly venal, their cutthroat egoism wrung for drama on “Scandal” and for laughs on “Veep. ” “BrainDead,” this summer’s satire from the creators of “The Good Wife,” targeted elected officials by planting   space bugs in their skulls. But “Designated Survivor” leans more toward the idealism of “The West Wing. ” David Guggenheim, a   writer known for “Safe House,” had long been intrigued by the concept of the designated survivor, the person in the presidential line of succession selected to wait in a secure, undisclosed location when all other members of government are gathered elsewhere. After his usually encouraging friend Simon Kinberg (a producer of films, including “The Martian”) expressed little enthusiasm about one of his movie pitches in a   email exchange, Mr. Guggenheim  —   hoping to redeem himself  —   pulled out the designated survivor idea and hit send. Mr. Kinberg loved it, and Mr. Guggenheim wrote the script in two weeks. They took it to Mark Gordon, a veteran producer (“Grey’s Anatomy”) who immediately envisioned Mr. Sutherland as the lead. “Most actors are known for the thing that made them famous,” Mr. Gordon said. “Jack Bauer was active and macho, but Kiefer’s actually such a gentle, gracious guy. He can be the idealized president that we all wish we had. ” In Hollywood, an Everyman in the White House is often played for laughs: Chris Rock in “Head of State” Kevin Kline in “Dave. ” But the “Designated Survivor” premise  —   an entire government up in flames  —   is   almost shockingly grim. Mr. Guggenheim needed Mr. Sutherland to tilt the story away from tragedy. “We were killing   people right off the top but I didn’t want the show to live in that darkness,” he said. “I did want Tom to represent optimism. We pointed Kiefer toward ‘Mr. Smith Goes to Washington. ’” The   common sense that drives President Kirkman is, said Mr. Sutherland, a retort to cynics. “The lack of knowledge and understanding of how difficult it is to govern has led to some very poor ideas in our society,” he said. “Maybe showing the rebuilding of a government in action will help dial down the rhetoric that’s out there. ” Mr. Sutherland has found himself in the political fray before. “24” made its debut in November 2001 amid intense    anxiety. Jack Bauer’s propensity for grisly torture methods meant “24” was read by some as a revenge fantasy for a grieving country, and eventually criticized by others for wallowing in   violence at a moment where “enhanced interrogation techniques” became a national ignominy. “Once I was in an airport waiting to get on a plane and a woman looked at me and said: ‘How can you make that   show?’ It’s like: What are you talking about? We had the first   president on TV we had the first female president on TV,” Mr. Sutherland said. ‘‘When Jack Bauer was on his deathbed he didn’t ask for a priest he asked for an imam to apologize. I wish the show hadn’t become so politicized in the end, but I have no regrets. ” He may be particularly sensitive to the   label because in Canada he’s considered   royalty. To Americans, he’s known as Donald Sutherland’s son, but to many Canadians, he’s the grandson of Tommy Douglas, the Saskatchewan premier who brought universal health care to Canada and helped form the federal party that would become the   New Democratic Party. As children, Mr. Sutherland and his twin sister, Rachel, spent time in Canada’s parliament in Ottawa. “I remember eating hot dogs in the House of Commons and waiting for my grandpa,” he said. “I loved the debates. ” His mother, the actress Shirley Douglas, continued the activist tradition. In 1969, when she was involved with the Black Panther Party, she was arrested in Los Angeles, said Mr. Sutherland, not without pride. Mr. Sutherland’s parents divorced when he was 4, and Ms. Douglas relocated the family to Toronto four years later. The city now passes for his hometown he takes the subway to the suburban set every day, and his mother and sister live here. But as a student Mr. Sutherland attended six schools in five years. He dropped out at 16 when he was cast in the Canadian film “The Bay Boy,” arriving in Hollywood soon after. The welcome mat was out for   Packers: He roomed with Robert Downey Jr. and rose quickly, landing a string of 1980s hits: “Stand By Me,” “Lost Boys,” “Young Guns. ” “You think: ‘This is great, this is going to be the rest of my life.’ Then somewhere around 30 you get a knock back and realize, ‘Oh no, you should have held on tight. ’” He married and divorced young his daughter, Sarah Sutherland, now 28, plays Julia  ’s daughter on “Veep. ” The career lull of Mr. Sutherland’s early 30s was followed by “24,” a show that Natascha McElhone had never seen when she signed on to “Designated Survivor” as first lady. She didn’t know what friends meant when they joked: “Jack Bauer becomes president?” “Kiefer has large reserves of vulnerability,” she said. “There’s something quite breakable inside, which I think is not just endearing but unusual. He’s also quite a worker bee. ” An executive producer on the show, Mr. Sutherland has made suggestions that have been incorporated into it, including having Kirkman wear glasses (for a Clark Kent effect) and making Kirkman an independent (circumventing Republican and Democratic baggage) according to Mr. Guggenheim. For a Canadian with a green card, Mr. Sutherland is oddly smitten with the mythic American West. In the 90s, he had a ranch in Montana, and roped in rodeos, feeding on   country   like Merle Haggard and Johnny Cash. After listening to one of Mr. Sutherland’s early efforts at songwriting, his friend and writing   Jude Cole, encouraged him to record. “I said: ‘There’s a heartbreaking quality to your voice. No, you’re not this fantastic singer, but there are a lot of smooth singers out there, and there’s not a lot of Kris Kristoffersons,’” Mr. Cole said. An actor who crosses over into music can invite mockery or oblivion, but Mr. Sutherland was willing to take that risk. After years of playing guitar in his trailer, and with Mr. Cole running a music label, Ironworks, he was ready to put his own music out there. “I was prepared for a brutal beating, but the nice thing about finally getting to the age where I’m at is, well, as long as they’re not going to kill me, O. K. ” (The reviews have been mostly positive, if begrudging: “  …    actually kind of decent,” read the headline on the A. V. Club’s take.) Loss and drinking are common themes the title track is about a friend who drank himself to death. Mr. Sutherland’s drinking has been a tabloid punch line in the past: In 2005, he hurled himself at a  decorated Christmas tree in a London hotel lobby and a D. U. I. arrest led to a brief jail stint. Yet he seemed ambivalent when asked if his relationship to alcohol had changed. “It’s been a part of my life, there’s no denying that,” he said. “It’s not something I do alone. I like going out with friends after work. It’s a way of letting loose. Having said that, I can tell you that if I look back on my life any of the negative things that have happened usually have [drinking] as a root cause, whether it was a D. U. I. or fighting, or a breakup, a relationship not working. There’s a price to pay for it. If you take a look at the songs, none of them are positive. ” As an actor, Mr. Sutherland is used to telling other people’s stories. But the album is intensely personal a “journal,” he has said. The song “Calling Out Your Name” is about his split from Julia Roberts in 1991. Even after decades in the public eye, Mr. Sutherland said he found this level of exposure new, and perhaps liberating. “I would never ordinarily be that confessional, and when I first got onstage, it took me a moment to surrender,” he said. “But when I did that became one of the great experiences of my life. I’m grateful for how gracious people have been. It’s affected how I approached this part. I could let a bit more of myself into the character. It’s more personal. ” Whether this incarnation of Kiefer Sutherland  —   or any  —   can ever eclipse one of the most   roles in television history, only the public will decide.'"}, "time": 1742561911.8760555}