{"duration": 0.05863809585571289, "input_args": {"text": "'NICE, France  —   Returning home after an abortive trip to find some ice cream late on Thursday evening, Mario Aufiero, a French retiree, waited patiently on the sidewalk as a big truck lumbered down the short street he needed to cross to get to his apartment building just off the Promenade des Anglais. The truck, he said, displayed no unusual menace but upset him all the same as heavy vehicles are supposed to be banned from the sedate residential area at that hour. Moreover, it was moving in the wrong direction down the   street outside his apartment. “There was nothing I could do, so I went home to bed,” Mr. Aufiero recalled. The deeply uncomfortable question now confronting French leaders and the country’s security apparatus, however, is whether they, too, dozed off that night. Moments after Mr. Auferio got home, the driver of the truck he had seen remorselessly turned it into a killing machine. The truck ran over scores of people as it barreled down the Promenade des Anglais for more than a mile before police officers finally stopped it by shooting to death the driver, Mohamed Lahouaiej Bouhlel, a    Tunisian. As investigators try to piece together what drove Mr. Lahouaiej Bouhlel to such extreme and random violence, many people in Nice and around the world are asking how, in a country that has been under a state of emergency since November, a lone driver could so easily flout elementary traffic rules and then race unimpeded through throngs of people who had gathered to watch a Bastille Day fireworks display. As in previous years, security forces, worried about a possible terrorist attack on France’s national day, set up barriers to block traffic on the Promenade des Anglais, a   boulevard that stretches eastward from the city’s airport to its old port. But the barriers,   devices made of hollow metal tubes, started far to the east of where Mr. Lahouaiej Bouhlel entered the boulevard. The number of police officers on duty that night was more than usual, but nearly all were concentrated in the   area by the old port, where most people traditionally gather to watch the fireworks. This left Mr. Lahouaiej Bouhlel more than a mile of open road on which to crush revelers who had decided to stay outside the heavily guarded spectator zone  —   and build up speed before he reached the first police barriers near the point where the seaside promenade joins the Boulevard Gambetta. Such was the   truck’s speed that when it first encountered any obstruction by police, “it would have required a wall of concrete” to stop it, Anthony Borré, an official in the regional government, told local television. French leaders, including President François Hollande, who visited Nice on Friday, repeatedly praised security services for swiftly stopping the truck once they encountered it. Indeed, the truck advanced only 500 or so yards after smashing through the barriers near Boulevard Gambetta. But this was only a short part of Mr. Lahouaiej Bouhlel’s long and murderous drive. “Why was he allowed to drive so far without anyone bothering him?” asked Pierre Roux, who, from his balcony, watched the truck plow through the crowd outside his apartment. “This is a terrible ” he said after emerging from his home early Friday to put a candle on a bloodied white sheet covering a corpse. How big a   is still being deciphered. It is not clear, for instance, whether the police tried to shoot out the tires before being able to shoot the driver, or whether smaller cities around France prepared for the possibility of a   terrorist attack with the same vigilance as, say, Paris, the scene of two major attacks last year. There, in stages starting early on France’s July 14 national day, the police snapped in place a security perimeter extending many blocks from the fireworks display at the Eiffel Tower. They closed even major thoroughfares to vehicles, including scooters, and placed checkpoints at nearly each approaching intersection to search pedestrians’ bags. The question of whether more could have been done to prevent 84 people from being killed has been taken up with gusto by local leaders on the French Riviera, most of whom represent   forces opposed to France’s Socialist government in Paris. “National unity does not signify national naïveté or, even less, national incompetence,” Éric Ciotti, the president of the department in which Nice is located, told Nice Matin newspaper on Saturday. ”Zero risk never exists, but it is our duty and our responsibility to limit it to the maximum. ” France’s Socialist government has responded angrily to such criticism, insisting it did everything it could to prevent a terrorist attack. It pointed out that nobody expected a rampage by truck and that the attacker had never popped up on the radar of intelligence and other services that monitor potential extremists. Still, Interior Minister Bernard Cazeneuve announced on Saturday that he was calling up 12, 000 police reserves to augment security around the country. “When you are talking after the fact, you can always find solutions,” Stéphane Le Foll, the government’s spokesman, told Europe 1 radio on Saturday. “Those who, after a tragedy like this one, come and say that they would have had the solution, that with them, nothing would have happened, I leave them to their total lack of responsibility. ” The prefecture for   the department that encompasses Nice, added its own voice to the defensive chorus, issuing a statement on Saturday that said security for this year’s fireworks show had been increased with 64 national police officers and 42 from the city plus 20 soldiers. It said vehicles had been positioned to block the Promenade des Anglais beyond the closely monitored security zone but acknowledged that Mr. Lahouaiej Bouhlel had bypassed one of these control points by simply driving onto the sidewalk. Mario Aufiero and other residents in the area near a children’s hospital where the truck entered the promenade said they had seen no extra police in their neighborhood and nothing on the boulevard to impede Mr. Lahouaiej Bouhlel’s murderous progress until it was far too late. “Everything was like it always is every year on July 14. There was nothing to stop him until he got down to Gambetta,” said Pierre Devit, a resident on the promenade in the city’s Magnan district near the hospital. He also asked why it had taken so long to shoot the driver. “They should have opened fire as soon as they saw the truck approaching,” he said. Others, however, were more understanding of the authorities’ failure to quickly halt the city’s worst episode of violence since World War II. “People need to be logical. The truck was moving at 60 kilometers an hour, so what could anyone do?” asked   Cuny, an employee in a foundry that makes the metal barriers studded along the seafront walkway. “We can’t put police every 10 meters. That would be completely unreasonable, and people would only complain. ” The Islamic State on Saturday gloated over the success of what it called “a new, unique operation” in Nice. In a radio broadcast claiming responsibility for the attack, it warned: “Let the crusader states know that regardless of how much they mobilize their security capabilities and tighten their procedures, they will not be safe from the strikes of the mujahedeen, which will continue to beat upon their doorsteps. ”'"}, "time": 1742628501.049137}