{"duration": 0.13553953170776367, "input_args": {"text": "'Home / Be The Change / To Fight Racism, Oregon College Devotes an Entire Month to ‘Whiteness’-Shaming To Fight Racism, Oregon College Devotes an Entire Month to ‘Whiteness’-Shaming Matt Agorist January 18, 2016 153 Comments \\nPortland, OR — The Cascade Campus Diversity Council at Portland Community College has just declared April to be one of the most unprecedented “educational projects” ever conceived —“White ness History Month.” \\nAccording to PCC , “Whiteness History Month: Context, Consequences, and Change is a multidisciplinary, district-wide, educational project examining race and racism through an exploration of the construction of whiteness, its origins, and heritage.” \\nIn the opposite manner of “Black History Month,” Whiteness History Month will not be celebrating the contributions made throughout history by people with white skin, but rather shaming them. \\n“White ness History Month, unlike heritage months, is not a celebratory endeavor, it is an effort to change our campus climate,” the College points out on its website. \\nPeter Fricke, writing for Campus Reform, explains, \\nAccording to a sub-page defining the term (adapted from a definition developed by the University of Calgary ), whiteness “does not simply refer to skin color[,] but [to] an ideology based on beliefs, values, behaviors, habits, and attitudes, which result in the unequal distribution of power and privilege based on skin color.” \\nNot only does the concept of whiteness allow those who are “socially deemed white” to accrue benefits, the page asserts, but those benefits “are accrued at the expense of people of color, namely in how people of color are systemically and prejudicially denied equal access to those material benefits.” \\nThe ideology of whiteness, it continues, dates back to “at least the seventeenth century, [when] ‘white’ appeared as a legal term and social designator determining social and political rights,” a concept that eventually grew to include “thousands” of “special privileges and protections” for white citizens. \\nWhile there is no question that racism is alive and well in the United States today, attempting to solve the problem by creating a climate of ‘race shaming’ is like trying to put out a fire by throwing matches into it. \\nIt is a statistical fact that black people are incarcerated at a higher rate, face heavier consequences for the same charges as their white counterparts, and are killed by police at a higher rate than whites. \\nAs Ron Paul pointed out in the 2012 presidential debate, \\n“True racism in this country is in the judicial system. The percentage of people who use drugs are about the same with blacks and whites. And yet the blacks are arrested way disproportionately. They’re prosecuted and imprisoned way disproportionately, they get the death penalty way disproportionately. How many times have you seen a white rich person get the electric chair or get, you know, execution? If we truly want to be concerned about racism, you ought to look at a few of those issues and look at the drug laws, which are being so unfairly enforced.” \\nHowever, shaming your neighbor who has nothing to do with these things, simply because their skin color is white, will solve nothing. It will only serve to fuel the flames of the bigot class by stoking the divide even further. \\nInstead of teaching students to strive for greatness, no matter what, this “project” teaches them to be victims. Instead of focusing on the issue of the state’s role in perpetuating the racist ideology of a few people in positions of power, PCC is attempting to lay blame to an entire group of people — because of the varying levels of melatonin in their skin. \\nRacism is an immense part of the problem, but it is important that we point out that it is only part of the problem. The other part of this problem is the color blue, and the violent unaccountable leviathan that it represents in America today. \\nA racist idiot without a badge and uniform is simply a racist idiot, add the power of the state and that racist idiot lays waste to civil rights, initiates violence, and extorts the populace; and it’s called ‘justice.’ \\nWhile the intentions of those behind “Whiteness History Month” are likely noble, they would do well to remember the famous words spoken by the Rev. Martin Luther King Jr. \\n“I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character.” \\nUntil we stop dwelling on the superficial qualities of our fellow humans, racism isn’t going anywhere — regardless of misdirected campaigns of shame. \\nh/t Campus Reform \\nMatt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world.'"}, "time": 1742564204.196431}