{"duration": 0.12481522560119629, "input_args": {"text": "'CANTON, Ohio  —   Joshua Brown loved his   Tesla Model S so much he nicknamed it Tessy. And he celebrated the Autopilot feature that made it possible for him to cruise the highways, making YouTube videos of himself driving  . In the first nine months he owned it, Mr. Brown put more than 45, 000 miles on the car. “I do drive it a LOT,” he wrote in response to one of the hundreds of viewer comments on one of his two dozen   videos. His postings attracted countless other Tesla enthusiasts, who tend to embrace the cars with an almost cultish devotion. They also tend to be people who like to live on technology’s leading edge, which in Mr. Brown’s case meant dismantling bombs for the Navy during the Iraq war, then coming home to start his own company to extend internet service into rural America. In his spare time he used a   printer to make model tanks and trucks. His Tesla, in other words, was simply one more extension of his   life. It took him on   adventures from the gravel driveway of the   clapboard house where he lived alone in Canton, an hour’s drive south of Cleveland. But Mr. Brown became a victim of an innovation geared precisely to people like him when his Tesla Model S electric sedan collided with a semitrailer truck on a Florida highway in May, making him the first known fatality in a   car. “He liked it mainly because it was an exceptional use of technology, and Josh was very much an innovator,” said his friend Paul Snow, who recalled how excited Mr. Brown was about his Tesla during a recent road trip. “He enjoyed the fact that technology was available, that it was being used to, ironically, increase safety on the roads. ” Tesla owners are a devoted bunch. Immediately after the company unveiled a prototype of its Model 3 car, more than 200, 000 enthusiasts put down deposits on the vehicles, which start at $35, 000 and will not be available until next year. Many owners like to showcase their cars on social media, creating songs, routines and other demonstrations of different features, particularly to show off how Autopilot works. Mr. Brown’s most recent video was his most popular. Titled “Autopilot Saves Model S,” it shows Mr. Brown driving on an interstate highway from Cleveland to Canton. A white truck cuts in front of Mr. Brown’s vehicle, and by his account, the Tesla’s Autopilot feature swerves the car to the right, avoiding a collision. After Elon Musk, Tesla’s founder, called attention to the video on Twitter, it went viral. Mr. Brown seemed to be elated. “He had said, ‘For something to catch Elon Musk’s eye, I can die and go to heaven now,’” said a neighbor, Krista Kitchen, choking up. “He was absolutely thrilled  —   and then a couple weeks later he died. ” In a statement, the National Highway Traffic Safety Administration said preliminary reports indicated that the crash occurred when a   made a left turn in front of the Tesla, and the car failed to apply the brakes. The agency did not name the victim, but the Florida Highway Patrol identified him as Mr. Brown. Ms. Kitchen said Mr. Brown, 40, had just left a family trip to Walt Disney World in Orlando. His relatives did not respond to requests for comment. At Mr. Brown’s house, behind an expansive,   lawn, a man who answered the door on Friday said the family did not wish to speak to reporters. Ms. Kitchen and others described how Mr. Brown would eagerly share his Tesla with friends, letting them take turns behind the wheel. And they described a man who was broadly generous with his time, who consistently helped friends in need, and who stayed in touch with his fellow veterans. “He was certainly an adventurer,” Mr. Snow said. “He was a warrior that served proudly for his country he was a patriot. He did many things that had never been done before. ” Mr. Brown was particularly interested in testing the limits of the Autopilot function, documenting how the vehicle would react in blind spots, going around curves and other more challenging situations. “This section in here is going to be very, very difficult for the car to handle,” he said in one video, posted in October, as his vehicle rounded a curve. “We’re filming this just so you can see scenarios where the car does not do well. ” Mark Vernon, a high school classmate who recalled tinkering with electronics in shop class together, said that his friend showed off the   feature on a recent visit at Mr. Brown’s home. “He knew the hill that it would give up on, because it couldn’t see far enough,” Mr. Vernon said. “He knew all the limitations that it would find and he really knew how it was supposed to work. ” Mr. Brown attended the University of New Mexico, where he studied physics and computer science, but did not graduate, the school said. Instead, he joined the Navy, where he served for more than a decade and specialized in disarming explosives, according to his company’s website. His service included a stint with the Naval Special Warfare Development Group, commonly known as SEAL Team 6. Ricky Hammer, a retired Navy master chief who worked with Mr. Brown at the development group, said he had strong computer skills and “was the equivalent of an electrical engineer even though he didn’t have the degree. ” Tesla owners tend to share a love of technology, and an eagerness to embrace the unknown, the untested or the unproven. Photos posted on Mr. Brown’s Facebook page show a love of the outdoors, where he rappelled down cliffs and jumped out of airplanes for fun. One of those struck by Mr. Brown’s adventurous side was Terri Lyn Reed, a senior insurance account executive who said she had helped Mr. Brown set up the insurance at his company, Nexu Innovations. “He’d probably fly an   to   it,” she said, referring to the military fighter jet. Tesla enthusiasts often also share a loyalty to the company, much the way Apple has engendered true believers whom it relies on to back the introduction of new iPhones, Macs and other products. Richard Henry, 26, who bought a 2015 Model S about nine months ago, uses Autopilot to take him through about 40 miles of freeway driving on each leg of his commute between San Francisco and Mountain View. When he started using his car’s Autopilot mode, it had a tendency to lose track of the highway lines and tell him to take control. But in the last few months it has improved more and more. Most days he turns it on and sits with his hands on his knees  —   ready to take the wheel, he pointed out. Learning about the technology and getting used to it has been “superfun,” he said. That is a point that separates him from the many other drivers who tend to learn how to use a few necessary functions in their car and never bother with most others. “I really like trying stuff like this out and understanding how the technology works,” Mr. Henry said. Mr. Brown’s enthusiasm for technology factored deeply into his work at Nexu, which specialized in setting up internet access in rural areas of the country where forests and mountains created special obstacles to entering the connected world. “Josh knew how to get around all the interference from all the trees and all the hills,” said Cindi Staneski, who runs the Hickory Run Campground in Denver, Pa. an   operation that became one of Mr. Brown’s early clients. “The big companies wanted nothing to do with it,” Ms. Staneski said, adding that Mr. Brown had become a mentor to her son. “It was too difficult, or they just wanted to charge you an extreme amount of money, whereas Josh felt that we deserved a chance that everybody else had. ”'"}, "time": 1742563668.4972336}