{"duration": 0.11223626136779785, "input_args": {"text": "'\\nIn the runup to the 2016 election Matt Drudge linked to reports that Hillary Clinton’s health was faltering. For weeks the ‘rumors’ were denied by mainstream media , especially left-leaning web sites.\\nAs the election drew closer, The Huffington Post and other non-partisan web sites claimed that Clinton had an unbeatable lead. On November 4th, just days before the election, Huff Post went so far as to suggest that Clinton had a 98% chance of winning the election. All the while, alternative media researchers, journalists, commentators and bloggers were highlighting the fact that polls actually showed a dead even race , with Trump leading in some cases.\\nWhen Wikileaks released tens of thousands of emails, the propaganda went into full swing with claims that the emails sourced from the DNC and Clinton Campaign were fake, even though numerous third-party organizations certified their validity.\\nIf you were to ask the experts, Drudge Report , Infowars , Breitbart , The Daily Sheeple , and other alternative media web sites were peddling fiction. In fact, “peddling fiction” is the exact terminology used by President Obama to marginalize the detailed economic reports being disseminated by Alternative Financial web sites like Zero Hedge .\\nThe fiction narrative, championed by entrenched media personalities, was pushed across social media by millions of anxious Hillary fans. According to them, everything coming from independent media was a lie – it was fake.\\nAs it turns out, Clinton’s health problems were confirmed when she was recorded stumbling about following a September 11th ceremony in New York. The Wikileaks were, in fact legit. Trump won by an electoral landslide. And the economy continues its downward spiral.\\nOne report after another being disseminated by what left-leaning pundits call “fake news websites” has been confirmed as accurate, proving that there was a concerted effort to stifle free speech and real journalism.\\nHillary Clinton made mention of it in her Deplorables speech, warning that a lot of fake information was being released through racist web sites across the web.\\nAnd if she had her way, no one would have ever read anything but positive information about her, while everything else was disappeared Orwellian-style, never to reach the masses that eventually elected Donald Trump to the Presidency.\\nWhat this year’s Presidential election has proven is that alternative media is a force to be reckoned with, and the establishment is scared shitless.\\nBut they won’t let it happen again.\\nEarlier this year President Obama turned control of the internet over to the United Nations, effectively eliminating free speech protections enjoyed by citizen journalists in America. It may have sounded crazy when we sounded the alarm before the internet takeover, but the today’s actions by Google and Facebook provide further evidence that the establishment media and Deep State politicians are preparing a digital lock down on any and all information that has not been approved by an as of yet unknown Truth Panel.\\nA Facebook spokesman said it will explicitly ban sites that traffic in fake news from using the Facebook Audience Network, saying they fall under the category of misleading, illegal or deceptive sites already barred. The audience network places ads on other websites and mobile apps.\\nEarlier Monday, Google said it plans to prevent Google ads from being placed “on pages that misrepresent, misstate, or conceal information about the publisher, the publisher’s content, or the primary purpose” of the website. The policy would cover sites that distribute false news, a Google spokeswoman said.\\nFalse news stories, particularly those that spread widely on Facebook, became an issue during the recent presidential election. Google experienced its own mishap on Sunday when a story on a right-wing blog erroneously stating Donald Trump won the popular vote appeared atop some Google search results.\\n…\\n“While implied, we have updated the policy to explicitly clarify that this applies to fake news,” the Facebook spokesman said. “We vigorously enforce our policies and take swift action against sites and apps that are found to be in violation. Our team will continue to closely vet all prospective publishers and monitor existing ones to ensure compliance.”\\nFull report \\nThe moves by Google and Facebook follow a recent de-monitzation effort at Youtube that has target alternative media. As noted in their “Advertiser Friendly content guidelines, they appear to be targeting alternative media directly by banning:\\nC ontent that is considered “not advertiser-friendly” includes, but is not limited to: \\nControversial or sensitive subjects and events, including subjects related to war, political conflicts, natural disasters and tragedies, even if graphic imagery is not shown So basically, anything newsworthy is no longer advertiser friendly, and these organizations will now determine whose news will or won’t be seen based on what is sure to be propietary algorithms and human curation.\\nThe bottom line is this: the time and energy required to produce the amount of video content and investigative journalism that we saw during the election is astronomical. Thousands of journalists, bloggers and concerned citizens spent countless hours reporting the news the mainstream media wouldn’t. Many of those people depend on advertising revenue to cover their most basic costs, including their monthly mortgages and the food they put on the table.\\nThe aim with policies like this, which will no doubt be overseen by establishment hacks, is to starve independent media. In turn, they will starve the people of the information they so desperately need to understand what is being done to them.\\nThis is only the beginning.\\nHattip Daisy Luther \\n'"}, "time": 1742563301.8507047}