{"duration": 0.03194022178649902, "input_args": {"text": "'Colombia & FARC Rebels Sign New Peace Deal Nov 13, 2016 1 0 \\nOn Saturday, the Colombian government signed a revised peace deal with the FARC Rebels, which comes after years of negotiation to end the fighting that has been taking place for over 50 years. A milestone for Columbia and humanity. \\nEarlier this summer, the initial peace deal was agreed to but then came under scrutiny when it was deemed to be favorably leaned towards the rebels. In October , the country held a vote on whether the deal reached in the summer should be agreed to. In a somewhat surprising vote, the country voted no to the peace deal. \\nAfter a few more weeks of dialogue, the sides have now once again come to an agreement on the peace deal. The new deal will include support from other social peacemaking groups as well as ensure that victims of FARC crimes are paid financial compensation. \\nThe FARC will still be able to form a political party and members with minor offenses can apply to get their records cleared. \\nThe FARC Rebels rose to prominence in the 1980’s and 90’s as they were able to utilize drug trafficking money to build their movement. At it’s height, it was said to be the “largest and best-equipped guerrilla force in Latin America.” \\nOne of the chief negotiators of the FARC guerrillas, Ivan Marquez, said : \\n“The new peace accord is the victory for Colombia.” \\nThis Colombian peace deal isn’t the only major peace deal signed this year either. In late September , the Afghanistan government signed a peace deal with Hezb-i-Islami, which is the first peace deal the government has signed with a group since the war with the Taliban started in 2001. \\nLet us all continue to focus on and spread the good news that these peace deals have brought. Though we cannot ignore the violence that has been happening around the world, we can work together to bring about peaceful change. War is a lose-lose situation, whereas peace is a win-win situation. Are there other peace deals that have occurred around the world this year? Are there others in process? How about even on a small level? Let us know other great and peaceful events that are taking place throughout the world in the comments section. \\nWhat are your thoughts about the Colombian and Afghan peace deals just recently signed? \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and does health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information and other inspiring articles.'"}, "time": 1742628461.8993926}