{"duration": 0.12885379791259766, "input_args": {"text": "'Russia: No jets have flown over Aleppo for past 9 days By Press TV on October 27, 2016 Russian servicemen prepare a Sukhoi Su-30SM fighter jet before departure on a mission at the Hmeimin military base in Latakia province, western Syria on Dec. 16, 2015. (Photo by AFP) \\nMoscow says Russian and Syrian aircraft have not carried out any sorties over Aleppo for nine days in line with their “humanitarian pause.” \\nThe Russian Defense Ministry responded on Thursday a day after a monitoring group sympathetic to militants claimed that airstrikes had killed at least 26 people in a village in Idlib. \\nRussia’s Ambassador to the United Nations Vitaly Churkin challenged the UN and the West to provide evidence of continuing airstrikes in Aleppo. \\nChurkin said no aircraft has approached the city at a distance of less than 10 km since a unilateral moratorium was announced by Russia and Syria on October 18 “in response to the UN call, and as a goodwill gesture.” \\n“If you have any information that there were any missile and bomb strikes, please provide this information,” Churkin said, adding he expected an “objective analysis” of the current situation. \\nChurkin also criticized the UN for failing “to thrash out in a proper way the operation on evacuation of the sick and injured people.” \\n“The UN staff members have failed to exert required pressure on patrons of the illegal armed units so that the militants could cooperate with humanitarian workers.” \\nThe Russian ambassador also hit out at UN aid envoy Stephen O’Brien for bias and arrogance after claiming that Aleppo had become a “kill zone” under Russian and Syrian bombs. \\nThe US, Britain and France rushed to his defense in one of the stormiest council sessions in weeks after Churkin accused O’Brien of failing to recognize that Russia and Syria had declared a humanitarian pause. \\nChurkin criticized the UN official for failing to present the facts objectively while foreign-backed rebels and al-Qaeda-linked terrorists are hampering a UN plan to evacuate the wounded from Aleppo. \\n“Please leave this kind of report to a novel that you might write one day,” the Russian ambassador told the UN official. \\nIn Moscow, Russian Foreign Ministry said Takfiri militants continue to indiscriminately target residential neighborhoods of Aleppo, using makeshift rocket launchers, and preventing civilians from leaving the city’s militant-held east. \\n“Aircraft of the Russian aerospace forces and the Syrian air force have not been carrying out any flight closer than the 10-kilometer zone around the city of Aleppo for nine days,” ministry spokesman Igor Konashenkov said. Fighters from the so-called Free Syrian Army fire an anti-aircraft machine gun mounted near the northern Syrian village of Beraan north of Aleppo, Oct. 24, 2016. (Photo by AFP) \\nWarships won’t join Aleppo campaign \\nThe Foreign Ministry also dismissed as absurd suggestions from NATO that a new Russian battle group heading to the Mediterranean would join the campaign against terrorists in Aleppo. \\nThe rebuttal came after NATO chief Jens Stoltenberg warned on Tuesday that the ships could be used to launch more airstrikes. \\nAndrei Kelin, a senior Russian Foreign Ministry official, told the RIA news agency that Stoltenberg’s statement was unhelpful. \\n“The concerns are not based on anything as our planes have not come near Aleppo for nine days. Our battle group is in the Mediterranean. Our ships have always had a presence there,” said Kelin. \\n‘Double standards’ \\nMeanwhile, Syria’s Ambassador to the United Nations Bashar al-Ja’afari denounced double standards towards the ongoing conflict in his country. \\nJa’afari lashed out at the US for supporting the so-called moderate militants in eastern Aleppo. He said Takfiri terrorists are now in possession of US-built rockets. Syria’s Permanent Representative to the United Nations, Bashar al-Ja’afari \\nHe also slammed Turkey’s aggressive policies toward Syria amid US support, saying it violated the basics of international law. \\nJa’afari said Saudi Arabia – another key ally of the West – is supporting terrorism while Wahhabi muftis are fanning the flames of bloodshed in Syria, Iraq and Yemen through their decrees. \\nThe entire Syrian population, he said, is suffering from the militancy being sponsored by Saudi Arabia, Turkey, Qatar and Israel. \\nJa’afari called on all members of the UN Security Council to exercise their responsibilities concerning the establishment of security and peace across the globe. \\n‘No Russian, Syrian role in fatal Idlib raids’ \\nIn another development on Thursday, Russian Foreign Ministry spokeswoman, Maria Zakharova, rejected as “a lie” claims that Russian and Syrian warplanes had conducted fatal air raids in the northwestern province of Idlib. \\nShe was reacting to reports that 22 children and six teachers were killed in airstrikes that hit a school and nearby areas in Idlib. \\nThe so-called Syrian Observatory for Human Rights, a monitoring group linked to foreign-backed militants in Syria, later claimed “warplanes — either Russian or Syrian — carried out six strikes” in the Idlib village of Hass, where the school is located. \\nZakharova further stressed “the Russian Federation has nothing to do with this terrible tragedy, with this attack,” adding that Moscow has called for an immediate investigation into the incident. \\nCommenting on the reports on Idlib airstrikes earlier in the day, Russia’s UN Ambassador Vitaly Churkin said “it’s horrible, horrible. I hope we were not involved.” \\n“It’s easy for me to say ‘no’ but I’m a responsible person. I need to see what our Defense Ministry is going to say,” he added.'"}, "time": 1742564410.2974584}