{"duration": 0.041019439697265625, "input_args": {"text": "'Email \\nWhether or not you’re a basketball fan, you’re going to love this story about a bold new humanitarian initiative from the NBA. In order to help alleviate the refugee crisis in Europe, the league is housing Syrian refugees on whichever half of the court isn’t being played on during the game. \\nNow that’s making a difference. Way to go, NBA! \\nSince the Syrian civil war began in 2011, millions of Syrians have been displaced. But thanks to the generosity of the NBA, some of them will now find a new home right around the three-point line on the half of the court that isn’t being played on at that time. While players occupy one half of the court, Syrian refugees will have a safe and welcoming space on the other half to reassemble their lives until the ball changes possession and they are shuttled to the opposite end. \\nWow. What a beautiful gesture from the NBA! With 29 courts across the country and 82 games in the 2016-2017 season, the league is set to provide housing that periodically oscillates from one half of the court to the other for several thousand Syrian refugees. This is huge. \\nIn contrast to Europe’s notoriously overcrowded refugee camps, the NBA’s half courts are big enough to comfortably house at least five families around the perimeter and one or two in the paint. The refugees also have access to any snack vendors who happen to be milling about the crowd near whichever half of the court they’re on at the time. \\nOf course, it’s a new program, and it’s not perfect. There have been several incidents in which refugees have collided with players after failing to get to the other half of the court in time, and last night an 8-year-old Syrian girl had to be treated for minor injuries after LeBron James dunked on her during a fast break. \\nStill, according to NBA commissioner Adam Silver, the program is a huge step up from the refugee camps abroad. \\n“The Syrian refugee crisis is only getting worse. Meanwhile, we’ve got this half of the court that isn’t being played on just collecting dust waiting to be put to good use,” said Silver, adding that he felt the league had a moral responsibility to harbor the refugees. “If we can help these people by sheltering them on one side of the court until there’s a change in possession and then sheltering them on the other half as soon as there’s a change in possession and then sheltering them on the other half until there’s a change in possession, then we have an obligation to do that.” \\nIt’s refreshing to see a major organization like the NBA reaching out to a group of people who so desperately need our help right now. Faith in humanity restored!'"}, "time": 1742563263.2831318}