{"duration": 0.056914329528808594, "input_args": {"text": "'U. S Ambassador to the United Nations Nikki Haley has blasted a new U. N. report that attacks Israeli actions in the Middle East, in what she says is the latest sign of the U. N.’s “unfair bias” in how it handles the   conflict. [The report, from the Office of the High Commissioner for Human Rights, was submitted in response to a resolution by the Human Rights Council  —   a body which Haley has repeatedly criticized for its own   bias and the questionable human rights record of some of its members.  The report, titled, “Ensuring accountability and justice for all violations of international law in the Occupied Palestinian Territory, including East Jerusalem,” evaluates Israel’s compliance with a number of U. N. resolutions and reports, including demands to deconstruct its security barrier on the West Bank, which has been credited with massively reducing terrorist attacks. The report adds: The High Commissioner notes the repeated failure to comply with the calls for accountability made by the entire human rights system and urges Israel to conduct prompt, impartial and independent investigations of all alleged violations of international human rights law and all allegations of international crimes. Furthermore, the High Commissioner calls upon Israel to ensure that all victims have access to remedies and reparation. The report also notes previous recommendations, including an   boycott call for “investigations of the activities of companies and financial institutions profiting from Israeli settlements, and for such practices to be ended and for reparation to be provided to Palestinians affected. ” Haley took issue with the report’s focus on Israel, noting that it “brushed over” terror attacks by Hamas and other terrorist groups attacking Israel, and ignored the human rights abuses of other countries. “This report is just the latest example of the Human Rights Council singling out Israel rather than focusing on the world’s actual human rights abusers,” she said in a statement. “Not only does it undermine the credibility of the Human Rights Council on human rights issues, but it once again highlights the unfair bias of the UN when it comes to the   conflict,” she said. Haley also took issue with the recommendation that the U. N. General Assembly ask the International Court of Justice to issue an advisory opinion on Israel, something her office says is out of the purview of the High Commissioner for Human Rights. Israel’s Ambassador to the U. N. Danny Danon also condemned the report, saying, “This obsession with Israel has crossed all lines. ” Danon accused the office of offering to “advise and support” efforts to create what he called a “blacklist” database of companies working in the region so that the international community could threaten a boycott. The latest report comes a week after Haley visited the Human Rights Council’s headquarters in Geneva and warned that the U. S. could leave the council if it didn’t reform its voting and bias against America’s ally in the Middle East. The same week, Breitbart News reported on an upcoming report by the Economic and Social Commission for Western Asia and submitted in the name of Secretary General Antonio Guterres, blaming Israeli settlements for a host of Palestinian grievances for everything from excessive use of force to building parks in the West Bank so as to “entrench” Israel’s presence. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742564623.3402083}