{"duration": 0.01923656463623047, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / Election Mirrors War between Masonic Factions Essential Reading Bloody Bill Clinton – American Caligula By wmw_admin on September 1, 2006 \\nThe real legacy of Clinton’s term of office: the chilling body count of those connected with him, who died in unusual or suspicious circumstances Hellstorm – Exposing The Real Genocide of Nazi Germany (Full Documentary) By wmw_admin on May 10, 2015 \\nWhat happened in the aftermath of World War II has been one of the darkest and best kept secrets in world history. Letter from James Abourezk, former US Senator from South Dakota to Jeff Blankfort on the Israel Lobby By wmw_admin on December 8, 2006 \\nMore than being an insider’s confirmation of the power of the pro-Israel lobby over Congress, the former US Senator’s letter also calls into question Noam Chomsky’s increasingly suspect looking motives Adam Weishaupt By wmw_admin on June 29, 2005 \\nThe founding of the Illuminati and one of the key players behind the genesis of the New World Order This Will Shock You To The Core: 9/11 from Cheney to Mossad By wmw_admin on September 13, 2015 \\nRebekah Roth has uncovered new “bombshell” evidence relating to Dick Cheney, Israeli art students, Mossad bomb experts and 9/11 Dov Zakheim 9/11 Mastermind Video By wmw_admin on May 15, 2010 \\nUsing legal injunctions, Dov Zakheim’s lawyers forced this website to remove an article we posted with the same title; which tells us he may have something to hide. Seems like others also think so as this video indicates. Watch it while you still can An oldie White Zimbabwean has her say By wmw_admin on January 7, 2009 \\nA human story from the hellhole Zimbabwe has become – with the West’s acquiescence of course. For although Western leaders may criticise him publicly, they opened the way for Mugabe’s ascent to power, just as they did with Saddam\""}, "time": 1742562620.2710333}