{"duration": 0.08262968063354492, "input_args": {"text": "'Written by Alex Eammons   When Donald Trump becomes commander in chief in January, he will take on presidential powers that have never been more expansive and unchecked.He’ll control an unaccountable drone program, and the prison at Guantanamo Bay. His FBI, including a network of 15,000 paid informants, already has a record of spying on mosques and activists , and his NSA’s surveillance empire is ubiquitous and governed by arcane rules, most of which remain secret. He will inherit bombing campaigns in seven Muslim countries, the de facto ability to declare war unilaterally, and a massive nuclear arsenal — much of which is on hair-trigger alert .Caught off guard by Hillary Clinton’s election defeat, Democrats who defended these powers under President Obama may suddenly be having second thoughts as the White House gets handed over to a man they described — with good reason — as “unhinged, ” and “dangerously unfit.” In the years after the 9/11 terror attacks, Vice President Dick Cheney and his legal adviser David Addington dramatically expanded the powers of the presidency, asserting the unilateral right in wartime to ignore legal limits on things like torture and government eavesdropping. Congressional Democrats generally caved , but made a few efforts to push back .The Democrats went silent on executive overreach when Obama was elected, however.When the New York Times revealed Bush’s warrantless wiretapping program in 2005, 60 percent of registered Democrats thought the program was “unacceptable.” But after NSA whistleblower Edward Snowden revealed a dramatically larger surveillance apparatus in 2013, a 61 percent of Democrats said the opposite — presumably because they trusted the man in charge.The Obama administration has counted on that trust repeatedly. When defending the drone program in 2012, instead of referencing its legal standards, administration officials reassured the New York Times that Obama is “a student of the writings on war by Augustine and Thomas Aquinas,” and that CIA director John Brennan is like “a priest with extremely strong moral values who was suddenly charged with leading a war.”After eight years of trusting the President with expanding military power, liberals must now reckon with the fact that Obama will pass the same capabilities to a man who has proposed killing terrorists’ innocent family members, who has said he would do “a hell of a lot worse than waterboarding,” and who has suggested dipping bullets in pigs’ blood is sound counterterrorism strategy.And most of the paltry few legal limitations that regulate the security state could easily be repealed by a President Trump...\\nObama has continued the Presidential tradition of going to war without Congress, sometimes in almost absurd ways. In 2011, for example, the White House needed to argue that it could continue bombing Muammar Gaddafi’s forces in Libya without Congressional authorization. So the top lawyer in the State Department sent a memo to Congress arguing that a bombing campaign did not amount to wartime “hostilities,” mainly because the enemy could not fire back. \\nEven when the Obama administration sought Congressional authorization in 2013 to strike Syrian President Bashar Hafez al-Assad’s forces in retaliation for using chemical weapons, he insisted that he didn’t really need to. And he has not sought out a separate authorization to extend the war on terror to fight ISIS in Syria, ISIS in Libya, Al Shabaab in Somalia, or Boko Haram in Nigeria. \\nWith such expansive war powers, and armed with the broad, Bush-era 2001 Congressional resolution authorizing war “in order to prevent any future acts of international terrorism,” the next President could conduct military operations on a whim. Fair Use excerpt. Read full article here . Related'"}, "time": 1742562953.3103242}