{"duration": 0.08938932418823242, "input_args": {"text": "'Written by Mark Almond   November 13th was as unlucky for stalwart backers of the foreign policy-line embodied by Hillary Clinton just as 8th November was for her domestic supporters. In both Bulgaria and Moldova, the voters rejected candidates for president who had been openly endorsed by Washington and Brussels. Having witnessed how small states with tiny electorates but vital Electoral College votes dealt body-blows to Hillary Clinton\\'s hopes of winning the US Presidency, it would be short-sighted and arrogant - as the Euro-Atlantic establishment has so often been - to dismiss voters in small East European states as irrelevant. Having presumed that Bulgaria was irretrievably anchored in the Euro-Atlantic power-structure by its accession to both NATO and the EU, the choice of an openly pro-Russian candidate for president of the country is a wake-up call to Brussels and Washington. Similarly, the Moldovan elite had seemed locked into an \"irreversible\" course as its premier put it to integration - better said subordination - to the Euro-Atlantic model. In both cases, the majority of citizens thought different. Until the implosion of the neo-con regime-change foreign policy embodied by Hillary Clinton and her attack-dog for Eastern Europe, Victoria Neuland, we could have been confident that the heavy-hands of Washington and Brussels would have pressured both Bulgaria and Moldova to reverse such results. Yet even cash inducements like the IMF\\'s sudden dole of US $36 million to the Moldovan regime just six days before the poll could not buy enough support . Even more striking was the Bulgarian public\\'s rejection of the pro-EU candidate who had boasted about how much EU aid to the poverty- stricken Balkan EU member was at stake. What ordinary Bulgarians and Moldovans know, and what the Euro-Atlantic elites and media never admit, is that EU funds have been a motor of the corruption suffocating their economies. Precisely because of the easy pickings EU and IMF cash provides to the ruling elites, they have no incentive to act in the majority\\'s interests. Real reforms are tough to enact and make the people richer not the insiders in the political class. Until Trump\\'s election, the USA and EU deployed their massive power and influence to making any vote against their policy-options seem futile despite popular recognition of how they had gutted the productive aspects of both the Bulgarian and the Moldovan economies. Sunday\\'s elections in both countries may be straws in the wind. They are victories for the genuine people power of the ballot box, not the street-based populism of crowds favoured by Washington and Brussels to impose \"people power\" on the people. It is striking that the Bulgarian premier, Borisov, who is often criticised as \"authoritarian\" by state media in the EU like Deutsche Welle and the BBC as well as by Euronews, immediately resigned. He drew the democratic consequence of his own candidate\\'s defeat. But the premier of Moldova, Filip, who has been boosted by Euronews etc. as a model European, immediately said the popular vote would have no effect on his policies! Even so, the election of advocates of better ties to Russia is a small geo-political earthquake in states NATO and the EU saw as securely-controlled bases for launching anti-Putin policies. No-one has died in these tremors in Bulgaria and Moldova. But the fact that the upheaval has been peaceful through the ballot-box leaves only violence as a viable way of reversing the will of the people. Both Bulgaria in 1997 and Moldova in 2009 saw violent Putsches from the street enthusiastically endorsed in Brussels and Washington as \"People Power\". If the kind of Soros-sponsored protests Americans themselves are now witnessing at home against Trump are switched on in the East European dissident states the counter-explosion could destabilise the whole EU-NATO project in the vast post-Communist region which had seemed willing to lick the West\\'s hand no matter how often the West had imposed destructive poverty-promoting policies. But now it would be unwise to think that the East European dogs can be kicked with impunity. They could turn vicious as the French say and bite back. A change of course in Washington could re-earn the pro-American consensus squandered over the last twenty-five years by the cynical Euro-Atlantic consensus. But can Western elites swallow their pride and learn the lesson of popular alienation. Or will they sink into denial and double-down on the policies which have rendered them despised by ordinary folk who see through phony rhetoric about swallowing touch economic medicine for their own good. East Europeans know that playing the reform politician not the entrepreneur is the way to get rich in their societies. Sadly, a lot of people in the West are coming to a similar conclusion. So the Trump Effect has emboldened the ordinary voters of Eastern Europe to demand that their elite put the people first. Maybe the Donald didn\\'t mean that to be the outflow of his victory in the USA, but that\\'s how people there see it. If the rigid and impoverishing policies promoted by the US-EU consensus cannot be revised, then more results like those in Bulgaria and Moldova can be expected. What should worry the US-EU establishment is that elections are coming in countries which won\\'t be so easy to ignore as small East European states. Next spring, the Dutch and the French vote. The anti-establishment tide in those two important EU and NATO states is running strongly. Years of rhetoric about reform and anti-corruption strategies across the New Europe of the old Soviet bloc coincided with rampant influence-peddling and bribe-taking. \"Drain the Swamp!\" was one of Trump\\'s most effective slogans. Across Europe, it echoes powerfully precisely because of the hypocrisy and cynicism of domestic and Brussels-based elites who talked so loudly about their commitment to the right kind of anti-corruption strategies but, as East Europeans say, have their left hand cupped behind their backs. Related'"}, "time": 1742564319.6961877}