{"duration": 0.060330867767333984, "input_args": {"text": "'Jew-Shielder Gavin McCuck Rekt by Jew-Hating Female Shitlord! \\nAndrew Anglin Daily Stormer October 28, 2016 \\nThe Jew slave Gavin McInnes AKA Gayvin McCuck AKA Goyvin McIn-My-Anus was just REKT at maximum speeds by Jew-hating female shitlord Emily Youcis. \\nShe was invited on the show to talk about a cartoon she made, but quickly began confronting McCuck on his chronic shilling for the hook-nosed parasites. \\nSurprise, Gavin, surprise! \\nMcInnes floped around like a skewered gofer as Emily broke it all down. \\n“Speaking of the real issues…” she began, before slapping this bitch around Newt Gingrich-style. \\nShe asked him who founded communism, and he began to freak, asking if “we are getting into Judaism?” He then did his little spiel about how Jews are so smart and savvy that they control the good and bad side of everything, and that most of the people who are bad in our society are actually Whites. \\nHe then said that his helper Ezra Levant – in fact his greasy master who orders him to insert objects into his asshole – is a Jewish hero. “I see him as a real ally,” said he. \\nQuick with it, Emily responded “oh, you think they’re our greatest ally?” \\nMcCuck then began twitching, claiming that Ezra Levant is literally one of the greatest heroes of freedom who ever lived, and that he is the Jew who made him realize that Nazis are actually just shills for other Jews (who apparently are part of a Jewish conspiracy that only involves bad Jews). Does this Jew look like a legendary hero to you? \\n“So you think the Jews really are the leaders of the Alt-Right?” Emily asked. \\nMcCuck then said: “I think a lot of these Alt-Right guys who are really pro-Hitler are spies.” \\nShe replied that this was an important thing she was meaning to bring up – his accusation that anyone that talks about the kikes is a plant. \\nHe then claimed that it is only the anonymous people who talk about Jews who he thinks are all a bunch of secret kikes (he always calls anonymous people cowards, pretending not to understand that if you actually go out and say this stuff publicly you will get fired from your job). \\nEmily then pointed out the obvious: “What about Andrew Anglin, because you called him a plant?” \\nGavin then made this face, while she went all smug Pepe on his faggot ass: \\n“Yeah, I find him totally suspicious,” he said. For the record, he hasn’t said he finds me suspicious – that would be something else – he has, using three different media platforms ( his podcast, Takimag and Rebel Media ), openly accused me of working for the feds, while admitting that he has no evidence for it and never even explaining why it would be the case. “I wouldn’t be surprised if all of Stormfront [sic] is a government website,” he continued. \\nThen these faces: \\nShe replied: “But see they’re the ones really addressing the issue. They’re the true Alt-Right. They’re the ones really fighting for White people. This is a White movement, Gavin.” \\nFrom there it only got worse, with Gavin arguing for literal cuckoldry, saying that it’s good for White people to adopt Black babies. And Emily gave the appropriate response – saying you might as well just send your wife to get knocked-up by a Black guy ( though David French believes it isn’t an either/or thing ). \\nHe finally said that it doesn’t matter if the entire West is replaced with non-Whites, as long as they adopt “Western values.” \\nThis guy is such an unbelievable cuck. I don’t even think that mainstream “conservatives” say that it doesn’t matter if all Whites are replaced. Well, some of them do, but like, I don’t think Sean Hannity would say that. \\nThis faggot has screwed himself so badly by taking the positions he has, and taking them so far. His career in the right-wing peaked when it started – when he wrote a pretty good anti-tranny article on Thought Catalog , apparently in order to purposefully himself fired from his own failing company. From there he had a couple of hits with anti-feminist clips, and then it all went into “I love the Jews and Black babies.” \\nHe’s also destroyed any chance he’d have to get into mainstream conservative politics, or get a show on Fox News or whatever else, by sticking a dildo up his ass on his show . I can pretty well guarantee his Jew master told him to do that, just because he wants to make sure he’s gotta stick around and work for him forever. Plus Jews just love debasing and humiliating their little slaves. \\nCan you imagine being so owned by a Jew that he tells you to stick a dildo up your asshole on video and you just say “yessir, how big of a dildo, sir?” \\nWe’re All “Spies”? \\nHe keeps saying that “all of” this site is “spies.” \\nWhat does that mean, exactly? Recently, I’ve started throwing some guys some shekels to write articles – Zeiger, Azzmador, Striker, etc. (btw if you want to see more of that, donate ) – but for the first three years of this site’s existence, it was pretty much just me, with a couple volunteers doing things here and there. \\nBut it’s almost like he’s talking about the readers and trolls themselves, no? Like the millions of people that visit this site every month are all federal agents –“spies,” he calls them – who come visit the site and post in the comments as part of their job. \\nAnd really if that isn’t the case, then the original accusation itself doesn’t make any sense. I mean, there are over 100,000 people who visit this site every day. \\nActually, for the last two months, it’s been averaging about 120,000 a day. Last thirty days \\nSo obviously, there are a lot of people who genuinely hate Jews and love Hitler. So for his theory to make sense, all of these people have to be “spies.” Like, literally all of them. Because even if 90% of the traffic was from spies – or concerned liberals and Jews or gapers or whatever – that would still mean that there were over 10,000 people who genuinely hate the Jews and love Hitler enough to visit a website about these things every day. And surely, one of those ten thousand could start a website writing about how much he hates Jews and loves Hitler, right? \\nI mean – right? \\nLiterally, the only way his accusation that anyone who hates Jews and loves Hitler is a spy is coherent is if there is actually no one in the world who hates Jews and loves Hitler. \\nIt is absolutely nonsensical, and the only reason he would shame himself by saying something so stupid is the same only reason he would stick a dildo up his ass on video: because some Jew told him to. \\nEmily’s Cartoon'"}, "time": 1742628447.6493454}