{"duration": 0.11467623710632324, "input_args": {"text": "'After spending days claiming it would welcome United Nations involvement in the Syrian chemical weapons attack, Russia used its veto power on the U. N. Security Council to block a resolution condemning the attack and calling for its perpetrators to be brought to justice. [China abstained from the vote instead of voting “no,” a decision President Donald Trump praised as “wonderful” and a sign of progress in U. S.  relations since China generally votes with Russia on Syrian affairs.  China’s U. N. ambassador, Liu Jieyi, said the resolution could be “amended” into a form China would vote for and said it was his country’s “longstanding hope that the Security Council can speak with one voice on Syria. ” “With its veto, Russia said no to accountability. Russia once again has chosen to side with Assad, even as the rest of the world, overwhelmingly comes together to condemn this murderous regime,” said the American ambassador to the United Nations Nikki Haley. “You are isolating yourselves from the international community every time one of Assad’s planes drop another barrel bomb on civilians and every time Assad tries to starve another community to death,” Haley told the Russians. The UK Daily Mail reports on a dramatic confrontation between Russian deputy ambassador Vladimir Safronkov and British ambassador Matthew Rycroft at the U. N. that reportedly occurred on Wednesday night. “Time and time again, Russia has abused its veto protect the regime and to defend its use of chemical weapons,” said Rycroft. “What has Russia got in return for its seven vetoes in six years? Russia’s initiative in 2013 to dismantle Syria’s chemical weapons has been exposed as a shambles. Russian pride in the Astana process has been turned to humiliation and Russia’s credibility and reputation across the world have been poisoned by its toxic association with Assad. ” The “Astana process” is a reference to   Syria peace talks held in Astana, the capital of Kazakhstan. Safronkov exploded in a   rant at Rycroft, claiming that the United Kingdom was trying to undermine improving relations between the United States and Russia. “You’re losing sleep that we might be working together with the United States,   with the United States. That is what you fear,” Safronkov thundered at the British ambassador. “You’re doing everything to make sure this kind of cooperation is undermined. What have you done to advance a  ? You welcome various opposition groups in London and Paris, illegal armed groups. ” “Don’t you dare insult Russia again,” Safronkov reportedly told Rycroft, accusing him of “irresponsibility” and using “dirty language. ” At one point during his tirade, when Rycroft turned his attention elsewhere, the Russian deputy ambassador snapped, “Look at me. Don’t turn your eyes away. Why are you looking away?” Safronkov explained that the reason Russia vetoed the U. N. resolution was because it “appointed the guilty party prior to the investigation, prior to an independent and objective investigation,” an approach that was “incompatible with the legal norms. ” However, the U. N. resolution did not actually name the regime of Syrian dictator Bashar Assad as the perpetrator of the attack. It condemned “the reported use of chemical weapons, in particular the attack on Khan Sheikhoun” and called upon the Syrian government to fully cooperate with an investigation by the Organization for the Prohibition of Chemical Weapons. The resolution, which was drafted by Britain, France, and the United States, would have obliged Syria to provide flight plans and details of air operations on the day of the chemical weapons attack, the names of its helicopter squadron commanders, and access to airbases from which the attack might have been launched. This was evidently the provision to which Russia objected most strongly. Safronkov’s accusation that the U. K. wanted to sabotage relations between Russia and the U. S. might seem odd, given the talk from both Washington and Moscow about how those relations have hit a   War low, but this is emerging as the official Russian narrative about the current diplomatic tension. For example, Russian Foreign Minister Sergey Lavrov said on Thursday that the Trump administration is under pressure from “those who want to prevent it from curing the wounds inflicted by Barack Obama’s administration, and are using the Russian card in internal political struggles. ” “It’s deplorable, and we regret what is going on, but we can do little except asking to back accusations with facts,” said Lavrov. “There hasn’t been a single fact, although under the pressure of President Donald Trump’s foes the White House has been forced to periodically make statements containing unfounded accusations against us. ”'"}, "time": 1742562450.4829812}