{"duration": 0.05250287055969238, "input_args": {"text": "'Posted on October 29, 2016 by Sean Adl-Tabatabai in Sci/Environment // 0 Comments \\nScientists in Brazil are planning on unleashing millions of genetically modified mosquitoes into the public in an attempt to stop the spread of the Zika virus. \\nDespite the fact that evidence shows that GM mosquitoes were responsible for the deadly virus spreading across the globe, scientists have been given the go-ahead by the government to release the GM mosquitoes into the wild. Recommended \\nA doctor has said that he believes the release of 5 million GM mosquitoes per week in Brazil may be causing a rise in brain cancer among humans. (2 hours ago) \\nPhys.org reports: \\nThey will mate with the females of the ordinary mosquitoes, spawning babies with a genetically inbuilt flaw that causes them to die quickly. \\nWith their work done, the modified father mosquitoes will then give up the ghost themselves—as they are genetically programmed to do. \\nOxitec says its factory in the town of Piracicaba, northwest of Sao Paulo, can produce 60 million mutant mosquitoes a week. \\nPiracicaba is the world’s “first and biggest factory” of genetically modified mosquitos, said Oxitec president Hadyn Parry. Recommended \\nU.S. regulators could allow the release of millions of genetically modified (GM) mosquitoes into the state of Florida to fight the Zika virus. (2 hours ago) \\n“This is the only place where we have a factory like this. We can use this as a hub for Brazil,” said Parry, who traveled to Piracicaba for the plant opening. \\nCurrently their only Brazilian customer is the city of Piracicaba, “but we are having conversations with several municipalities and states,” Parry said. \\nMosquitoes by the millions \\nAccording to the firm, five field tests that they conducted between 2011 and 2014—in Panama and the Cayman Islands, as well as the northeastern Brazilian state of Bahia—showed the population of wild Aedes aegypti insects dropped by 90 percent after the mutant mosquitoes were released. \\nOxitec does not yet have a sales permit from Brazil’s Anvisa health authorities, and there are no epidemiological studies showing whether mosquito-carried diseases drop after the factory-bred insects are released. Recommended \\nBritish company Oxitec hope to win approval to release millions of genetically modified mosquitoes in the Florida Keys, pointing to climate change and the rise of tropical diseases as the need. (2 hours ago) \\nParry is not concerned. “We are still waiting for Anvisa approval—we have no date for it, but we expect it for 2017,” he said. \\nAnd none of this has stopped the mayor of Piracicaba from signing a four-year, $1.1 million deal with Oxitec. \\nIn its first wave, the company will release 10 million factory-bred mosquitos each week into this city of 360,000 people. \\nThe need for insect control is pressing, as the summer in the southern hemisphere approaches and the mosquito population—and cases of the diseases that they carry—is likely to boom. \\nAs of July nearly 1.4 million cases of dengue were recorded in Brazil, following the record 1.6 million cases in 2015, according to health ministry figures. Recommended \\nThe United States government have announced plans to introduce GM mosquitoes in Florida in an attempt to thwart the spread of the dengue and chikungunya virus. (2 hours ago) \\nIn the same period 174,000 cases of Zika were reported. \\nThe Zika virus outbreak began in late 2015 in Brazil and has since spread across the Americas. \\nZika is particularly dangerous to pregnant women because it can cause birth defects such as microcephaly, in which babies are born with unusually small heads and brain deformities. \\nZika infection has also been linked to a nerve and immune disorder called Guillain-Barre syndrome.'"}, "time": 1742562057.4844928}