{"duration": 0.14348196983337402, "input_args": {"text": "'BEIJING  —   A trip to Sun Xun’s studio involved clambering  —   suitcase and all  —   onto the back of his friend’s moped in the dusty outskirts of this city. The scooter puttered through Heiqiaocun, or Black Bridge Village, before stopping at the vast industrial space used by Mr. Sun. The area is outside 798, the district that in the 2000s transformed a cluster of abandoned factories into one of Asia’s art hot spots. Black Bridge Village, for now, is right on the cusp of that gentrification. Pi Animation, which Mr. Sun founded in 2006 when he was a new graduate, is at once grungy and  . Upstairs, studio staff members used powerful computers to create two monumental works that took more than a year: “Mythological Time” (2016) a multimedia piece unveiled Nov. 4 at the Guggenheim Museum in New York, and “Reconstruction of the Universe,” a commission by the luxury watchmaker Audemars Piguet, which can be seen now at Art Basel Miami Beach. The Audemars project  —   a digital film made of tens of thousands of   woodblocks  —   used the work of more than 100 assistants, including students working  . It is being shown at a pavilion Mr. Sun planned for Miami Beach, with a swooping bamboo roof and short films projected onto glowing spheres. But, at least in his studio, Mr. Sun’s reality was a world away from international museums and beachside art fairs. With two major deadlines in front of him, he worked furiously, sitting on a sagging old sofa surrounded by overflowing ashtrays and empty beverage containers. There were no luxuries in his workspace  —   just a weight bench and a few stalls of squat toilets in the back. Mr. Sun, the son of factory workers, said there was no point in cleaning up. “A new   rail will be built right through my studio  —   not anyone else’s, mine,” he said wryly, thrusting two beefy arms out to show where the government planned to construct its next big project. He shrugged. “My studio will be destroyed, and I will move. ” Mr. Sun, 36, is preoccupied with the idea of inevitable change. The themes of time, impermanence and shifting views of history come up repeatedly in his work, which is filled with beautifully drawn Chinese dragons and tigers, as well as dystopian images like menacing Red Guards or factories belching   smoke. In his view, everything  —   the news on television, governments, art studios  —   is temporary. Even his studio is named for π, an “irrational number” that could be calculated for infinity without coming to a finite conclusion. Mr. Sun’s “Mythological Time” depicts his hometown, Fuxin in Liaoning, a frigid province wedged between North Korea and Inner Mongolia. It is part of the Guggenheim’s “Tales of our Time” exhibit featuring    artists from greater China. “It is a very, very, very poor   area,” Mr. Sun said of Fuxin. “It used to be important and had one of China’s biggest mines of its type, but not anymore. It’s almost like there is a ring around the northern part of the world  —   that goes through Fuxin, through parts of Russia, through parts of America  —   where coal has left people poor. ” Mr. Sun sometimes travels to Fuxin, where he sits outside with a pad of paper “to draw its factories, its mountains, its backyards. ” (Like a filial Chinese son, he helped move his family to a more temperate climate.) Xiaoyu Weng, a curator of Chinese art at the Guggenheim, explained how Mr. Sun used two   works to depict   Fuxin as just a blip over the course of millenniums. “It’s an animated history of his hometown, overlaid with mythological figures and animals,” Ms. Weng said by telephone from New York. “He imagines how coal mining was originally formed. ” “Sun Xun is unique among his generation of artists in that he has a very profound and complex interest in history,” Ms. Weng said. “He has the ability to take a Chinese issue and make it relevant to the global condition. He’s talking about changing landscapes, urban environments, energy sources  —   all controversial topics  —   and expressing it artistically. ” Mr. Sun seems to have little nostalgia for his hometown, but he is obsessed with his own family’s sad history, especially because the family’s own telling of it is so different from the history he was taught in school. “The story of my family is the story of China over the past 100 years,” he said. Mr. Sun comes from a military family. His   fought for China’s Qing dynasty against the Japanese empire. His grandfather fought for the Kuomintang, the forces that later fled to set up the Republic of China in Taiwan, a   democracy that still has tense ties with Beijing. “He had a ticket to Taiwan, but decided to stay in China,” Mr. Sun said of his grandfather, showing how one decision shaped his family for generations. His grandfather fell on the wrong side of history when the Communists took power, and Mr. Sun’s parents were punished for it. “My father experienced the Cultural Revolution,” he said. “Because his own father was involved in the Kuomintang, he could not go into the military and was sent to a factory. He was frightened of the Red Guards. He slept with an ax under his pillow. ” Mr. Sun then stopped, abrupt and  . “I’ve said too much,” he said, waving his hand dismissively at the recording of our interview. “The revolution was just one small point in time. ” Much of Mr. Sun’s work has to do with the way politics and history are distorted. “I don’t believe in history books. I don’t believe in the news, whether it’s from America or Taiwan or Japan or Korea. This is why I travel so much,” he said. “I only believe what I see with my own two eyes. My art asks questions, and I just keep looking. ” Mr. Sun is only the second artist to be given an Audemars Piguet Art Commission, a project the Swiss watchmaking company started in 2014. (The first was Robin Meier, a Swiss artist and musician.) Mr. Sun’s latest work, “Reconstruction of the Universe,” was originally to have its premiere at Art Basel Hong Kong in 2015, but its production was too unwieldy to finish in time. Mr. Sun drew original illustrations, and then had student helpers carve them into soft basswood  —   a process that required an enormous amount of time and skill. Tens of thousands of woodblocks were carved, printed and then scanned each woodblock made up one frame of a   film. The final product plods along at 15 to 18 frames per second, or about the rate of a   silent film. There is no direct narrative or story, just images like a flying violin with wings or the Great Wall of China surrounded by crumbling towers. What at first looked to be a haunted house turned out to be the Audemars Piguet Museum in Switzerland. (The idea of “a museum for time” in some distant, alpine land seemed particularly interesting to Mr. Sun). Winka Angelrath, Audemars’s   art exhibitions manager, explained the choice of Mr. Sun. “We liked that he was using traditional techniques, like ink painting and woodcutting, and turning them into digital animations,” Ms. Angelrath said. “He is making something new out of something old. “There are shared themes: complexity, precision, time. ” Ms. Angelrath had flown from Geneva to Beijing to check on Mr. Sun’s progress. She walked around his vast space, admiring the enormous amount of artwork he had created. After she left for her luxury hotel downtown, Mr. Sun packed up for the day. He walked through an unlit warehouse to his black car and then careened down an unlit street to eat at the kind of restaurant where you sit on the floor, drink cold beer and eat chicken skins on sticks. He noted, while driving past sushi joints and fitness centers, how quickly his neighborhood was changing, but said that was not necessarily a bad thing. “They will tear it down, but I will just make a more beautiful studio,” he said. “This is what they call development. ” “Reconstruction of the Universe,” Art Basel Miami Beach, through Sunday. “Tales of Our Time,” Guggenheim Museum, New York, through March 10.'"}, "time": 1742561942.0163717}