{"duration": 0.07974743843078613, "input_args": {"text": "'Leave a reply \\nThe Angels – We know so many of you feel as if you have been disappointed in this lifetime. Some of you feel you have disappointed yourselves. Many of you feel disappointed by others. Even more feel disappointed by life. Take heart! Each one of you, in every breath, has opportunity for change! Each one of you has the ability to release yourselves and others from the bondage of expectations, and to dance with life, exactly as you are, and exactly as life is. \\nWe hear you now! “I expect to be treated kindly! I expect myself to do my best. I expect others to be honest! I expect my children to listen to me” and on the list goes. You may have these expectations dear ones, but what happens when you do not live up them? What happens when others do not? While it is fine to have expectations, you already know that life and others do not always act as you expect. You do not always live up to your own expectations. What then? \\nFar better to say, “I expect to be treated kindly but if I am not I will discern what to do next.” “I expect to do my best, but when I do not, I will choose to learn.” “I expect others to be honest with me but when they betray my trust, I will walk away or let them know kindly what it takes to earn it once again.” “I expect my children to listen to me, but if they don’t, I will lovingly guide them in their lessons here upon the earth.” \\nExpect the best of yourself and others dear ones, if you wish, but when you or they do not live up to these expectations, be flexible. Dance with the present moment, as you are, as life is, because in that reality you are no longer resisting life. You are no longer chained to your expectations in the past. You are open to guidance in the moment, dealing with reality of life in front of you. \\nIn this fashion, you free yourself to find the most loving course of action based on how you are, how life is, and how others are being… right here and right now, in the present moment. SF Source Visions of Heaven  '"}, "time": 1742562248.8241506}