{"duration": 0.3910644054412842, "input_args": {"text": "' Trump in the White House By Noam Chomsky\\nNovember 14, CJ Polychroniou : Noam, the unthinkable has happened: in contrast to all forecasts, Donald Trump scored a decisive victory over Hillary Clinton and the man that Michael Moore described as \\x93wretched, ignorant, dangerous part-time clown and full-time sociopath\\x94 is the next president of the United States. In your view, what were the deciding factors that led American voters produce the biggest upset in the history of US politics?\\nNoam Chomsky : Before turning to this question, I think it is important to spend a few moments pondering just what happened on November 8, a date that might turn out to be one of the most important in human history, depending on how we react.\\nNo exaggeration.\\nThe most important news of November 8 was barely noted, a fact of some significance in itself.\\nOn November 8, the World Meteorological Organization delivered a report at the international conference on climate change in Morocco, COP22, which was called in order to carry forward the Paris agreements of COP21. The WMO reported that the past five years were the hottest on record. It reported rising sea levels, soon to increase as a result of the unexpectedly rapid melting of polar ice, most ominously the huge Antarctic glaciers. Already Arctic sea ice over the past five years is 28 percent below the average of the previous 29 years, not only raising sea levels but also reducing the cooling effect of polar ice reflection of solar rays, thereby accelerating the grim effects of global warming. The WMO reported further that temperatures are approaching dangerously close to the goal established by COP21, along with other dire reports and forecasts.\\nAnother event took place on November 8, which also may turn out to be of unusual historical significance for reasons that, once again, were barely noted.\\nOn November 8, the most powerful country in world history, which will set its stamp on what comes next, had an election. The outcome placed total control of the government \\x96 the executive, Congress, the Supreme Court \\x96 in the hands of the Republican Party, the most dangerous organization in world history.\\nApart from the last phrase, all of this is uncontroversial. The last phrase may seem outlandish, even outrageous. But is it? The facts suggest otherwise. The Party is dedicated to racing as rapidly as possible to destruction of organized human life. There is no historical precedent for such a stand.\\nIs this an exaggeration? Consider what we have just been witnessing.\\nDuring the Republican primaries, every candidate denied that what is happening is happening \\x96 with the exception of the sensible moderates, like Jeb Bush, who said it\\x92s all uncertain but we don\\x92t have to do anything because we\\x92re producing more natural gas, thanks to fracking. Or John Kasich, who agreed that global warming is taking place but added that \\x93we are going to burn [coal] in Ohio and we are not going to apologize for it.\\x94 The winning candidate, now the President-elect, calls for rapid increase in use of fossil fuels, including coal; dismantling of regulations; rejection of help to developing countries that are seeking to move to sustainable energy; and in general racing to the cliff as fast as possible.\\nTrump has already taken steps to dismantle the Environmental Protection Agency by placing in charge of the EPA transition a notorious (and proud) climate change denier, Myron Ebell. Trump\\x92s top adviser on energy, billionaire oil executive Harold Hamm, announced his expectations, which were predictable: dismantling regulations, tax cuts for the industry (and the wealthy and corporate sector generally), more fossil fuel production, lifting Obama\\x92s temporary block on the Dakota Access pipeline. The market reacted quickly. Shares in energy corporations boomed, including the world\\x92s largest coal miner, Peabody Energy, which had filed for bankruptcy, but after Trump\\x92s victory registered a 50% gain.\\nThe effects of Republican denialism had already been felt. There had been hopes that the COP21 Paris agreement would lead to a verifiable treaty, but any such thoughts were abandoned because the Republican Congress would not accept any binding commitments, so what emerged was a voluntary agreement, evidently much weaker.\\nEffects may soon become even more vividly apparent than they already are. In Bangladesh alone, tens of millions are expected to have to flee from low-lying plains in coming years because of sea level rise and more severe weather, creating a migrant crisis that will make today\\x92s pale into insignificance. With considerable justice, Bangladesh\\x92s leading climate scientist says that \\x93These migrants should have the right to move to the countries from which all these greenhouse gases are coming. Millions should be able to go to the United States.\\x94 And to the other rich countries that have grown wealthy while bringing about a new geological era, the Anthropocene, marked by radical human transformation of the environment. These catastrophic consequences can only increase, not just in Bangladesh but in all of South Asia as temperatures, already intolerable for the poor, inexorably rise and the Himalayan glaciers melt, threatening the entire water supply. Already in India some 300 million people are reported to lack drinking water. And the effects will reach far beyond.\\nIt is hard to find words to capture the fact that humans are facing the most important question in their history \\x96 whether organized human life will survive in anything like the form we know \\x96 and are answering it by accelerating the race to disaster. Similar observations hold for the other huge issue concerning human survival, the threat of nuclear destruction that has been looming over our heads for 70 years, and is now increasing.\\nIt is no less difficult to find words to capture the utterly astonishing fact that in all of the massive coverage of the electoral extravaganza, none of this receives more than passing mention. At least I am at a loss to find appropriate words.\\nTurning finally to the question raised, to be precise it appears that Clinton received a slight majority of the vote. The apparent decisive victory has to do with curious features of American politics: among other factors, the electoral college residue of the founding of the country as an alliance of separate states; the winner-take-all system in each state; arrangement of congressional districts (sometimes by gerrymandering) to provide greater weight to rural votes (in past elections, probably this one too, Democrats have had a comfortable margin of victory in popular vote for the House but hold a minority of seats); the very high rate of abstention (usually close to half in presidential elections, this one too). Of some significance for the future is the fact that in the 18-25 range, Clinton won handily, and Sanders had an even higher level of support. How much this matters depends on what kind of future humanity will face.\\nAccording to current information, Trump broke all records in the support he received from white voters, working class and lower middle class, particularly in the $50,000 to $90,000 income range, rural and suburban, primarily those without college education. These groups share the anger throughout the West at the centrist establishment, revealed as well in the unanticipated Brexit vote and the collapse of centrist parties in continental Europe. The angry and disaffected are victims of the neoliberal policies of the past generation, the policies described in congressional testimony by Fed chair Alan Greenspan \\x96 St. Alan as he was called reverentially by the economics profession and other admirers until the miraculous economy he was supervising crashed in 2007-8, threatening to bring the whole world economy down with it. As Greenspan explained during his glory days, his successes in economic management were based substantially on \\x93growing worker insecurity.\\x94 Intimidated working people would not ask for higher wages, benefits, and security but would be satisfied with the stagnating wages and reduced benefits that signal a healthy economy by neoliberal standards.\\nWorking people who have been the subjects of these experiments in economic theory are, oddly, not particularly happy about the outcome. They are not, for example, overjoyed at the fact that in 2007, at the peak of the neoliberal miracle, real wages for non-supervisory workers were lower than they had been years earlier, or that real wages for male workers are about at 1960s levels while spectacular gains have gone to the pockets of a very few at the top, disproportionately a fraction of 1%. Not the result of market forces, achievement, or merit, but rather of definite policy decisions, matters reviewed carefully by economist Dean Baker in recently published work.\\nThe fate of the minimum wage illustrates what has been happening. Through the periods of high and egalitarian growth in the \\x9150s and \\x9160s, the minimum wage \\x96 which sets a floor for other wages \\x96 tracked productivity. That ended with the onset of neoliberal doctrine. Since then the minimum wage has stagnated (in real value). Had it continued as before, it would probably be close to $20 per hour. Today it is considered a political revolution to raise it to $15.\\nWith all the talk of near-full employment today, labor force participation remains below the earlier norm. And for a working man, there is a great difference between a steady job in manufacturing with union wages and benefits, as in earlier years, and a temporary job with little security in some service profession. Apart from wages, benefits, and security, there is a loss of dignity, of hope for the future, of a sense that this is a world in which I belong and play a worthwhile role.\\nThe impact is captured well in Arlie Hochschild\\x92s sensitive and illuminating portrayal of a Trump stronghold in Louisiana, where she lived and worked for many years. She uses the image of a line in which these people are standing, expecting to move forward steadily as they work hard and keep to all the conventional values. But their position in the line has stalled. Ahead of them, they see people leaping forward, but that does not cause much distress, because it is \\x93the American way\\x94 for (alleged) merit to be rewarded. What does cause real distress is what is happening behind them. Undeserving people who do not follow the rules are being moved in front of them by federal government programs designed to benefit African-Americans, immigrants, and others they often regard with contempt. All of this is exacerbated by Reagan\\x92s racist fabrications about strapping young bucks and welfare queens (by implication Black) stealing your hard-earned money, and other fantasies \\x97 which are sometimes tinged with shreds of reality, as is usually the case with ugly and dangerous concoctions designed to deflect attention from the real agents of distress to easy scapegoats.\\nSometimes failure to explain, itself a form of contempt, plays a role. I once met a house painter in Boston who had turned bitterly against the evil government after a Washington bureaucrat who knew nothing about painting organized a meeting of painting contractors to inform them that they could no longer use lead paint, the only kind that works, as they all knew but the suit didn\\x92t understand. That destroyed his small business, compelling him to paint houses on his own with substandard stuff forced on him by government elites. Sometimes there are also some reasons. Hochschild describes a man whose family and friends are suffering bitterly from the lethal effects of chemical pollution but who despises the government, and the \\x93liberal elites,\\x94 because for him, the EPA means some ignorant guy who tells him he can\\x92t fish but does nothing about the chemical plants.\\nThese are just samples of the real lives of Trump supporters, who are deluded to believe that Trump will do something to remedy their plight, though the merest look at his fiscal and other proposals demonstrates the opposite \\x96 posing a task for activists who hope to fend off the worst and to advance desperately needed changes.\\nExit polls reveal that the passionate support for Trump was inspired primarily by the belief that he represented change, while Clinton was perceived as the candidate who would perpetuate their distress. The \\x93change\\x94 that Trump is likely to bring will be harmful or worse, but it is understandable that the consequences are not clear to isolated people in an atomized society lacking the kinds of associations (like unions) that can educate and organize. That is a crucial difference between today\\x92s despair and the generally hopeful attitudes of many working people under much greater duress during the great depression of the 1930s.\\nThere are other factors in Trump\\x92s success. Comparative studies show that doctrines of White Supremacy have had an even more powerful grip on American culture than in South Africa, and it\\x92s no secret that the white population is declining. In a decade or two whites are projected to be a minority of the work force, and not too much later a minority of the population. The traditional conservative culture is also perceived as under attack by the successes of \\x93identity politics,\\x94 regarded as the province of elites who have only contempt for hard-working patriotic church-going Americans with real family values whose country is disappearing before their eyes.\\nIt is worth remembering that before World War II, though it had long been the richest country in the world, the US was not a major player in global affairs and was also something of a cultural backwater. Someone who wanted to study physics would go to Germany. An aspiring writer or artist would go to Paris. That changed radically with World War II, for obvious reasons, but only for part of the population. Much remained culturally traditional. To mention one example of great significance, one of the difficulties in raising public concern over the very severe threats of global warming is that 40% of the population do not see why it is a problem, since Christ is returning in a few decades. About the same percentage believe that the world was created a few thousand years ago. If science conflicts with the Bible, so much the worse for science. It would be hard to find an analogue in other societies.\\nThe Democratic party abandoned any real concern for working people by the 1970s, and they have therefore been drawn to the ranks of their bitter class enemies, who at least pretend to speak their language \\x96 Reagan\\x92s folksy style with little jokes while eating jelly beans, W. Bush\\x92s carefully cultivated image of a regular guy you could meet in a bar who loved to cut brush on the ranch in 100 degree heat and his probably faked mispronunciations (it\\x92s unlikely that he talked like that at Yale), and now Trump, who gives voice to people with legitimate grievances who have lost not just jobs but also a sense of personal self-worth; and who rails against the government that they perceive as having undermined their lives (not without reason).\\nOne of the great achievements of the doctrinal system has been to divert anger from the corporate sector to the government that implements the programs it designs, such as the highly protectionist corporate/investor rights agreements that are uniformly mis-described as \\x93free trade agreements\\x94 in the media and commentary. With all its flaws, the government is to some extent under popular influence and control, unlike the corporate sector. It is highly advantageous for the business world to foster hatred for pointy-headed government bureaucrats and to drive out of people\\x92s minds the subversive idea that the government might become an instrument of popular will, a government of, by, and for the people.\\nIs Trump representing a new movement in American politics, or was the outcome of this election primarily a rejection of Hillary Clinton by voters who hate the Clintons and are fed-up with \\x93politics as usual?\\x94\\nIt\\x92s by no means new. Both political parties have moved to the right during the neoliberal period. Today\\x92s New Democrats are pretty much what used to be called \\x93moderate Republicans.\\x94 The \\x93political revolution\\x94 that Bernie Sanders called for, rightly, would not have greatly surprised Dwight Eisenhower. The Republicans have moved so far to dedication to the wealthy and the corporate sector that they cannot hope to get votes on their actual programs, and have turned to mobilizing sectors of the population that have always been there but not as an organized political force: evangelicals, nativists, racists, and the victims of the forms of globalization designed to set working people around the world in competition with one another while protecting the privileged and undermining the legal and other measures that provided working people with some protection and with ways to influence decision-making in the closely linked public and private sectors, notably with effective labor unions.\\nThe consequences have been evident in recent Republican primaries. Every candidate that has emerged from the base \\x96 Bachmann, Cain, Santorum, \\x97 has been so extreme that the Republican establishment had to use its ample resources to beat them down. The difference in 2016 is that the establishment failed, much to its chagrin, as we have seen.\\nDeservedly or not, Clinton represented the policies that were feared and hated while Trump was seen as the symbol of \\x93change\\x94 \\x96 change of what kind requires a careful look at his actual proposals, something largely missing in what reached the public. The campaign itself was remarkable in its avoidance of issues, and media commentary generally complied, keeping to the concept that true objectivity means reporting accurately what is \\x93within the beltway\\x94 but not venturing beyond.\\nTrump said following the outcome of the election that he \\x93will represent all Americans.\\x94 How is be going to do that when the nation is so divided and he has already expressed deep hatred for many groups in the United States, including women and minorities? Do you see any resemblance between Brexit and Donald Trump\\x92s victory?\\nThere are definite similarities to Brexit, and also to the rise of the ultranationalist far-right parties in Europe \\x96 whose leaders were quick to congratulate Trump on his victory, perceiving him as one of their own: Farrage, Le Pen, Orban, and others like them. And these developments are quite frightening. A look at the polls in Austria and Germany \\x96 Austria and Germany \\x96 cannot fail to evoke unpleasant memories for those familiar with the 1930s, even more so for those who watched directly, as I did as a child. I can still recall listening to Hitler\\x92s speeches, not understanding the words though the tone and audience reaction were chilling enough. The first article that I remember writing was in February 1939, after the fall of Barcelona, on the seemingly inexorable spread of the fascist plague. And by strange coincidence, it was in Barcelona that my wife and I watched Tuesday\\x92s events.\\nAs to how Trump will handle what he has brought forth \\x96 not created, but brought forth \\x96 we cannot say. Perhaps his most striking characteristic is unpredictability. A lot will depend on the reactions of those appalled by his performance and the visions he has projected, such as they are.\\nTrump has no identifiable political ideology guiding his stance on economic, social, and political issues, yet there are clear authoritarian tendencies in his behavior. Therefore, do you find any validity behind the claims that Trump may represent the emergence of \\x93fascism with a friendly face?\\x94 in the United States?\\nFor many years I have been writing and speaking about the danger of the rise of an honest and charismatic ideologue in the United States, someone who could exploit the fear and anger that has long been boiling in much of the society, and who could direct it away from the actual agents of malaise to vulnerable targets. That could indeed lead to what sociologist Bertram Gross called \\x93friendly fascism\\x94 in a perceptive study 35 years ago. But that requires an honest ideologue, a Hitler type, not someone whose only detectable ideology is Me. The dangers however have been real for many years, perhaps even more so in the light of the forces that Trump has unleashed.\\nWith the Republicans in the White House, but also controlling both houses and the future shape of the Supreme Court, what will America look like for at least the next four years?\\nA good deal depends on his appointments and circle of advisers. Early indications are unattractive, to put it mildly.\\nThe Supreme Court will be in the hands of reactionaries for many years, with predictable consequences. If Trump follows through on his Paul Ryan-style fiscal programs, there will be huge benefits for the very rich \\x96 estimated by the Tax Policy Center as a tax cut of over 14% for the top 0.1% and a substantial cut more generally at the upper end of the income scale, but with virtually no tax relief for others, who will also face major new burdens. The respected economics correspondent of the Financial Times, Martin Wolf, writes that \\x93The tax proposals would shower huge benefits on already rich Americans such as Mr Trump,\\x94 while leaving others in the lurch, including of course his popular constituency. The immediate reaction of the business world reveals that big pharma, Wall Street, military industry, energy industries, and other such wonderful institutions expect a very bright future.\\nOne positive development might be the infrastructure program that Trump has promised while (along with much reporting and commentary) concealing the fact that it is essentially the Obama stimulus program that would have been of great benefit to the economy and to the society generally, but was killed by the Republican Congress on the pretext that it would explode the deficit. While that charge was spurious at the time, given the very low interest rates, it holds in spades for Trump\\x92s program, now accompanied by radical tax cuts for the rich and corporate sector and increased Pentagon spending.\\nThere is, however, an escape, provided by Dick Cheney when he explained to Bush\\x92s Treasury Secretary Paul O\\x92Neill that \\x93Reagan proved that deficits don\\x92t matter\\x94 \\x96 meaning deficits that we Republicans create in order to gain popular support, leaving it to someone else, preferably Democrats, to somehow clean up the mess. The technique might work, for a while at least.\\nThere are also many questions about foreign policy consequences, mostly unanswered.\\nThere is mutual admiration between Trump and Putin. How likely is it therefore that we may see a new era in US-Russia relations?\\nOne hopeful prospect is that there might be reduction of the very dangerous and mounting tensions at the Russian border: note \\x93the Russian border,\\x94 not the Mexican border. Thereby lies a tale that we cannot go into here. It is also possible that Europe might distance itself from Trump\\x92s America, as already suggested by Chancellor Merkel and other European leaders \\x96 and from the British voice of American power, after Brexit. That might possibly lead to European efforts to defuse the tensions, and perhaps even efforts to move towards something like Mikhail Gorbachev\\x92s vision of an integrated Eurasian security system without military alliances, rejected by the US in favor of NATO expansion, a vision revived recently by Putin, whether seriously or not we do not know since the gesture was dismissed.\\nIs US foreign policy under a Trump administration likely to be more or less militaristic than what we have seen under the Obama or even the G.W. Bush administrations?\\nI don\\x92t think one can answer with any confidence. Trump is too unpredictable. There are too many open questions. What we can say is that popular mobilization and activism, properly organized and conducted, can make a large difference.\\nAnd we should bear in mind that the stakes are very large, as I remarked at the outset.'"}, "time": 1742563259.3553936}