{"duration": 0.15879249572753906, "input_args": {"text": "'  14, 2016 How To Plan Farmer’s Calendar All Year Round \\nA farmer’s work is never done. You’d think that in the winter when there are no crops to tend or hay to mow, there may be some time to take a break, and that’s somewhat true, but not really. \\nWinter is actually one of the busiest times of year; in addition to taking care of the animals, clearing snow, and keeping things running, you need to plan and prep for the next year. \\nWinter appears to be a time of sleep and relaxing by the fire, but for a homesteader, there is no such thing. If you have cows to milk and chickens to feed, then you still have to take care of that. Then there are all of the other tasks that you have to do: clearing the roof, bringing in firewood, making impromptu repairs. \\nWinter is a great time of the year to make a plan for what you need to do in the spring, summer, and fall to make your homestead successful. \\nWe’ve put together a calendar of things to do in the winter to help make your homestead successful all year round. \\nCheck your Stockpile \\nWinter is a great time to check your stockpile for several reasons, but the primary reason that we’re adding it to the calendar is so that you can decide what to plant in the spring. \\nIf you’re running out of green beans but still have a ton of corn, you can adjust your crops accordingly. Plant more beans and less corn. The same thing goes for canned meals and condiments. If you’ve just about eaten all of your beef stew and salsa but still have a ton of chicken soup left, adjust accordingly. \\nYou can also determine whether you’re best using your crops. Say you had a bumper crop of apples and made pie filling, applesauce, apple cider vinegar , and apple butter. Now you’re out of pie filling but still have 32 quarts of applesauce. It seems like you may want to adjust how you use your apples next year. \\nMake a chart and record your findings so that you can compare to last year and make your adjustments. You don’t want to use your entire stockpile. \\nIt’s good to have enough for a couple of years, but you don’t want to can 6 months’ worth of apple butter and 5 years’ worth of okra, especially two years in a row. \\nConcentrate on Your Herbs/Winter Crops \\nI don’t know about you but I love herbs. They’re great for adding flavor, and for using medicinally. Since they’re easy to grow inside , you can grow them year round. Since you’re likely slam busy all summer and fall, wait until winter to harvest and store your herbs. This is a good time to make your essential oils and medicinal blends , too. \\nIf you live in a moderate climate, you may be able to grow some winter crops such as garlic, kale, carrots and potatoes during the winter. They’re easy to grow and won’t take up hardly any time. Search the internet for crops that will grow in the winter according to your zone . \\nThere are also early spring edibles that you can start growing and have ready to eat while you’re waiting on those peppers and tomatoes to grow. \\nStart Your Seeds \\nIf you live in a zone where you have short summers and you want to grow crops that have a long growing period, start them inside as early as February. That way, you’ll have healthy seedlings or young plants to transplant when the weather warms up. Your garden will have a great start before the snow is even off the ground! \\nMake a To-Do List for the Coming Months \\nPlan your summer. Sit down and make charts of what you’re going to plant, how much of it you’re going to plant, and where you’re going to plant it. Keep in mind soil types and compatible plants when you’re making your chart. \\nThink about your animals. Do you want to breed? Do you need more eggs? Did you put back enough meat this year? Are your chickens cramped and need a new coup? How about the barn – does it need repairs? Is the tractor running rough? Do you need any new equipment? Make a list by month of all these projects that you need to address. \\nPlan Your Expenses \\nNow that you’ve sat down and planned your crops and equipment repairs and made a list of other things that you do, then plan how much you’re going to need to spend versus when you’ll need it and when you’ll have the money to do it. Try to project any equipment replacements or repairs that you’ll need, too. Remember to allow for any unexpected expenses. \\nYou don’t have to stop with just the next year. Do a five-year plan, then adjust as needed. Keep adding a year every winter. This will really help keep you on track as long as you actually refer back to the list and follow it as much as possible. \\nMake Syrup \\nIf you live in an area where you have birch or maple trees, late winter is when you can gather the sap from the trees and make your syrup for the year. Just FYI, it’s a bit of work to make, but it’s free and you can sell it for a great profit. That’s assuming your family doesn’t make you keep it! \\nDo all of the in-house repairs. Think about those creaky stairs, unpainted rooms, loose carpets and wobbly stools that you’ve been meaning to fix all summer. Now’s a great time to get all of that stuff done so that you can check it off the list. Video first seen on TacticalIntelligence . \\nHelp Your Animals Adapt \\nWinter affects different animals in different ways. Chickens will likely slow down production when the weather changes. You can head this off a bit by making sure that they’re snug and warm, but make sure that the coop stays well-ventilated. Keeping your hens happy will make your breakfast a happy event, too. \\nCows and horses, on the other hand, may need to be fed more so that they have enough energy to stay warm and (in the case of cows) keep producing quality milk. If you’re new to homesteading study up on your animals before winter so that you’ll know what to do to keep your animals safe and healthy. \\nWinter is definitely a bit slower than the rest of the year, but there are plenty of things that you can do to maintain and improve your farm. Relaxing a bit isn’t a bad thing, either – you work your buns off the rest of the year, so give your brain and your body a break. \\nHave Some Family Time \\nFarms are a ton of work and though we all squeeze in “together” time while we work, cleaning out the chicken coop together just isn’t the same as picking up a Redbox or heading out for pizza and an evening of fun. There’s so much work to be done in the other months that it’s easy to get caught up in the hustle and bustle and forget to have some fun. Now’s your chance! \\nEducate Yourself \\nWinter is a great time to use your mind instead of your back. Farming, homesteading, sustainability, and prepping are ever-changing beasts, so take the downtime to catch up on the latest news and ideas that are available all over the net. \\nFeel free to go old-school and buy some books and magazines to get some new ideas about how to move your farm forward. Think about planting guides, new equipment, new prepping ideas, or ways to help keep your animals healthy naturally. \\nAnother good subject to study up on is the plants that you’re growing. If you don’t know all about each plant that you grow, take this time to learn. Not all plants like the same types of soil. Some like rich, loamy soil, some like sandy soil. Some grow great next to each other and others, such as tomatoes and potatoes, shouldn’t be grown together. \\nJust knowing these small facts will increase your yield and even improve the quality and flavor of your crops. \\nIf you have anything else to add to the winter calendar to-do list,   \\nWe can all learn from each other, but never forget the ways our forefathers made their own food, harvested their own plants and made their own medicines to survive during gloomy   1 total views, 1 views today'"}, "time": 1742563333.4138553}