{"duration": 0.08431100845336914, "input_args": {"text": "'Eric Zuesse The reliability of all of these reports can reasonably be questioned, but here they are: On October 14th, NBC News bannered “CIA Prepping for Possible Cyber Strike Against Russia” , and reported that, “The Obama administration is contemplating an unprecedented cyber covert action against Russia in retaliation for alleged Russian interference in the American presidential election, U.S. intelligence officials told NBC News. … The sources did not elaborate on the exact measures the CIA was considering, but said the agency had already begun opening cyber doors, selecting targets and making other preparations for an operation.” On October 30th, “Super Station 95” reported an “Update” saying that “a trusted source” said: It appears the United States is going to engage in battle in Syria. SuperStation95 just received this communication from a trusted source: I just landed back in the US from Diego Garcia. War is brewing. The island has more aircraft and refueling tankers than I have seen since 2005. Docks were full and 30 ships were moored off shore.This is a huge buildup. B1s and B2s and b52s in abundance. Never seen them all at one place. It seems stupid to bunch them up at one facility. Our layover was only supposed to be for 4 hours but the flight crews were so backed up we stayed overnight. The hotel was full and we bunked in a tent. We have never had to do that before. AF security is everywhere and they were assey. (Acting like strict, suspicious assholes) Just a heads up, keep your eyes open. I know that I am not giving away in classified information, the Russians have a satellite dedicated to watching this island. Also, the navy had 2 subs at the docks at once. I have never seen more than 1 there. B52s have new paint jobs — all flat black. Whats up with that? On top of all this, huge numbers of in-flight refueling tankers are also on the island. More than enough to supply air operations to/from the Middle East, non-stop. This is a very bad development. The US would never stage this much hardware at Diego Garcia unless they were planning a full-out, prolonged, military action. Based upon my military experience as a contractor who has visited Diego Garcia every 6 months for 11 years, we are going to war. On November 3rd, NBC News headlined “Exclusive: White House Readies to Fight Election Day Cyber Mayhem” , and reported “Officials are alert for any attempts to create Election Day chaos, and say steps are being taken to prepare for worst-case scenarios, including a cyber-attack that shuts down part of the power grid or the internet. But what is more likely, multiple U.S. officials say, is a lower-level effort by hackers from Russia or elsewhere to peddle misinformation by manipulating Twitter, Facebook and other social media platforms.” This news-report included a video of Andrea Mitchell, headlined “Is Russia a third party in the 2016 race?” If the United States government, on or after Election Day, says that Russia had done something of this nature, then the U.S. ‘response’ to the alleged ‘cyber-attack from Russia’ would presumably be one or more of “the exact measures the CIA was considering,” as NBC reported on October 14th, and World War III could then start with a cyber-war that could escalate to serious consequences, such as deactivating a power-grid in one or both of the countries, and, subsequently, a direct military invasion, of one by the other. But how would the U.S. public ever be able to come to know whether that alleged Russian provocation actually existed and wasn’t instead provoked intentionally by the U.S. government in order to provide a pretext for the U.S. to invade Russia? (After all, we’ve been pouring troops and weapons onto and near Russia’s borders for months now — and how would the U.S. respond to a provocation in which Russia surrounded our border with nukes?) On November 2nd, ‘Jeremiah Johnson’ an anonymous retired Green Beret, headlined “Something Big Is Underway On All Fronts: ‘Within The Next Few Weeks The Future Of The United States Will Be Decided’,” and he reported that: As of this writing, the increased U.S. troop presence in Eastern Europe includes a battalion-sized element of American troops being emplaced in the Suwalki Gap, Polish territory that borders Lithuania in a 60-mile stretch of corridor. The Russian Defense Ministry announced that 600 Russian and Belarussian airborne troops conducted training exercises in Brest, on the Belorussian-Polish border only a few miles from where the U.S. forces are deploying in Poland. This on the heels of Britain deploying 800 men, tanks, and jets to Estonia, along with pledges of Challenger 2 tanks, APC’s (Armored Personnel Carriers), and drones. Two companies of French and Danish Soldiers will join the British in the deployment to Estonia. For the first time since 1945, Norway has violated its treaty with Russia (then the Soviet Union) not to station foreign troops on its soil. A company of U.S. Marines will soon be stationed for a 6-month deployment in Norway. The situation is heating up in Ukraine, according to a report on fort-russ.com entitled Ukraine Moves Massive Force up to Lugansk Frontline , published October 28, 2016. The report reveals the Ukrainian Army is deploying 3,500 soldiers and 200 armored vehicles of the 15th Motorized Infantry Brigade to Krasny Oktyabr in the district of Lugansk in Eastern Ukraine. For the first time in history, Romanian airspace is being patrolled by the RAF (Royal Air Force) of Britain. His report closes: “The next war will be initiated by an EMP [Electro-Magnetic Pulse] device detonated above the continental United States followed by a limited nuclear exchange and then conventional warfare. … Obama is the joker, setting the stage for the transfer of power. That transfer is not going to occur with the losing candidate (in either case) going gently into that good night. The stage is set for a war to begin. The stage is set for a false flag operation to take down our grid. The stage is set to steal the election for Clinton or declare it null and void. Within the next few weeks, the future of the United States will be decided…with or without the consent of the governed.” If it’s not true, then why is the U.S. engaging in these preparations? Russia has never attacked America. The Cold War was supposed to have ended. The U.S. government obviously thinks it now is actually hotter than ever, and so, apparently, we place the jihadists on the back burner; we’ve got a much bigger war to wage, and we’ll know soon whether it starts soon after the ‘election’.'"}, "time": 1742563976.8655567}