{"duration": 0.10928559303283691, "input_args": {"text": "'8 Catastrophic Signs Reveal Hillary’s Campaign Is IMPLODING Posted on October 31, 2016 by Prissy Holly in Politics Share This \\nFor months now, we’ve been patiently waiting for the scandal that would finally bring down Hillary Clinton. With the media constantly in her back pocket, she’s miraculously been able to keep anything from sticking. However, in an ironic twist, a member of her own party in the form of Anthony Weiner appears to be the force that will finally deliver the death blow to Hillary’s presidential bid. \\nOver the weekend, we got the incredible news that the FBI would be re-opening their investigation into Hillary after new pertinent emails were uncovered while authorities were investigating Anthony Weiner. Although Hillary would love for everyone to believe that everything is just peachy and she’s on the road to victory, there are catastrophic signs beginning to emerge, revealing that Hillary’s campaign is literally imploding from within. \\nJust in time for Halloween, here are the top 8 signs that show Hillary’s campaign is blowing up in her face, and that the long-awaited karma train has finally begun to run her over. 1. Hillary’s Right-hand Woman Huma Abedin Is Suddenly MIA \\nIt’s rare that we ever see Huma departed from Hillary’s side, but the love affair between the two appears to be crashing down, now that Huma’s own husband Anthony Weiner is the wrecking ball that’s currently crashing through Hillary’s campaign. According to reports, Huma has voided her immunity deal with the FBI, meaning that she has two choices: start singing or face jail time. Hillary obviously doesn’t want Huma around to tarnish her campaign, and in the light of everything imploding, Huma is nowhere to be found. 2. Rats Are Jumping Ship \\nEven Democrats are starting to renounce their support from Hillary. On Sunday night, prominent Democratic pollster Doug Schoen, who advised Bill Clinton and worked on Hillary’s campaign from back in 2008, announced he would be withdrawing his endorsement. Schoen went on to say on FOX news that he “fears a constitutional crisis” should Hillary be elected into office, while still under investigation from the FBI. 3. Early Hillary Voters Are Switching To Trump \\nReports are now flooding in revealing that many early voters in key swing battleground states such as Minnesota, Wisconsin, and Pennsylvania are now switching their votes to Trump. The search on Google “change early vote” is now beginning to trend. According to one alarming poll, 24% of the 18,029 people polled said they would be ditching Hillary in the light of recent events. 4. WikiLeaks Promises Leak This Week That Will Put Hillary In Jail \\nHillary’s incredibly been able to downplay the majority of WikiLeaks’ influx of incriminating email dumps over the past few weeks. Now, WikiLeaks is promising the long-awaited “October Surprise” that will hit sometime this week, along with the assertion that what’s in these emails will land Hillary in jail. 5. Trump Is Slaughtering Hillary In Florida \\nIt’s absolutely imperative that Trump wins in Florida if he’s to secure the number of electoral votes necessary to defeat Hillary. While Hillary and the Democrats flaunted their early lead in that state several weeks ago, Trump is now up by a whopping 4 points. His lead skyrocketed after the FBI’s announcement of their reinvestigation into Hillary’s private server. 6. Hillary’s Hitting The Bars \\nWhat better way to drown out the reality that you’re losing then slamming back a few whiskey sours? During a campaign stop in Florida where only an embarrassing handful of people turned out to see Hillary, she hit up a Florida bar in the middle of the day where she was seen knocking back liquor-heavy drinks. 7. Hillary Loses 11 Points In ONE WEEK \\nLiberals love their polls, but even with their heavily-biased fake numbers that previously had Hillary in the “lead,” even they cannot keep up the lie anymore. In a catastrophic new poll from Washington Post/ABC, Hillary has dropped an astounding 11 points in ONE WEEK! Oh, the horror! 8. Voters Are Screaming “LOCK HER UP!” \\nBefore hitting up the bar in Florida, Hillary was greeted by angry voters who began chanting “lock her up!” True to form, Hillary just ignored the group of angry Americans, while plastering on the biggest fakest toothiest smile she could muster. \\nIt’s so wonderful when karma finally comes calling. Unfortunately for Hillary, it looks like her dose of karma is deciding to hit with just a little over a week before the presidential election. Oh, how sweet it is! Follow Us On Social Media Search'"}, "time": 1742564457.8379846}