{"duration": 0.06712102890014648, "input_args": {"text": "'A small town in the southwest corner in rural Missouri is forever changing due to chain migration policies and an influx in refugees who have entered the U. S. over the last decade. [In Noel, Missouri, some 500 to 600 Somali and Sudanese immigrants and refugees now live in the region of just more than 1, 800 residents, as noted by USA Today in a piece highlighting the changing face of the area.  A particular Somali migrant quoted in the USA Today piece spoke about her father now trying to apply as a refugee in U. S. in order to move to Noel. On Thursday morning, inside a   apartment a block from Main Street,    Bedel Kayd and his    brother Saadiq sat quietly while finishing a bag of cheese puffs. With Abdullahi acting as translator, their mother, Mun Omer  —   a Somalian who arrived in the United States in October  —   said she initially thought President Trump’s executive order banning immigrants or visa holders from seven countries  —   Somalia, Sudan, Iraq, Iran, Libya, Syria and Yemen  —   for 90 days and refugees for 120 days meant refugees like her would have to return to their home countries. Trump’s executive order bans refugees from Syria indefinitely. Omer said she was relieved, to a degree, to learn that her initial fear wasn’t true. But the reality still doesn’t bode well for her father, who is trying to come to America. Immigration expert Ira Mehlman with the Federation for American Immigration Reform (FAIR) said that while extended family chain migration is a “general bad policy,” he said the booming Somali and Sudanese populations in Noel were most likely due to Tyson Foods’   plant in the town. The Tyson factory provides about 1, 600 jobs to Noel residents. The influx in refugees to the region has, however, cramped the local labor market. “These   companies undermine the union jobs,” Mehlman told Breitbart Texas. “They’ve brought in illegal aliens and refugees, but essentially, they’ve used this to replace their unionized workforce. It’s a labor subsidy for the employers. ” “There’s a myth that illegal aliens are a source of cheap labor,” Mehlman continued. “It’s cheap only to the direct employer. The rest of us have to pay for healthcare, education, and other social services. ” Mehlman told Breitbart Texas that in areas similar to Noel, where corporate plants employ the majority of small town population, it is the companies that incentivize chain migration policies which already allow for spouses and unmarried children to come to the U. S. “In other places, it has been the employers that has created this phenomenon,” Mehlman said. “They prefer these foreign workers over unionized employees. ” Immigration groups like FAIR and NumbersUSA have been pushing President Trump’s administration to reform chain migration policy, citing that it only leads to more illegal immigration. John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742563534.854954}