{"duration": 0.17676639556884766, "input_args": {"text": "'Tara Zoumer thought she had found her dream job when she was hired at WeWork, a $16 billion   that rents office space to young entrepreneurs. The walls were adorned with Pop Art. Neon light fixtures encouraged employees to “Hustle harder,” and there was beer on tap. “It was like walking onto a set of a movie,” Ms. Zoumer said. But shortly after she became an associate community manager in WeWork’s office in Berkeley, Calif. reality set in. Ms. Zoumer said she was feeling pinched because her annual salary was only $42, 000, a sum that, on some weeks, left her without money to ride the subway. She said she thought many of her duties  —   leading tours for prospective tenants, tidying up, answering phones and changing the kegs  —   were more suited to an hourly wage with a possibility for overtime. Ms. Zoumer tried to enlist colleagues to file what she hoped would be a   lawsuit to fight for overtime pay. But the company had instituted a policy that could force employees to ultimately resolve disputes through arbitration instead of the courts, which essentially shut down Ms. Zoumer’s lawsuit, since arbitration bars individuals from joining in a class action. When Ms. Zoumer refused to sign the new policy, she was fired. As     like WeWork grow  —   the company’s work force has swelled to 1, 500 from 300 a year ago  —   they are taking a page from the playbook of big corporations, which are increasingly using arbitration to thwart employees from bringing any meaningful legal challenge in court, an investigation by The New York Times found last fall. Uber and Lyft, the   services, make their drivers sign an arbitration clause. Square, the mobile payment processor, also requires that employees agree to bring disputes to arbitration. In advice to   Brotman Law, a tax firm in San Diego, promotes the benefits of arbitration for “companies doing business over the Internet,” emphasizing that it “can save significant costs. ” Amazon and Google also use arbitration to resolve disputes with customers. Far from burying its arbitration clause in its employment contracts, WeWork is proud of its policy. The company’s top executives said they thought that by adopting an arbitration clause as part of a broader dispute resolution program, they were staying true to their principles, which prize all levels of employees as members of a single community. WeWork says its employees are eligible for bonuses and equity in the company in addition to their salaries. “We want to show the world that this works,” Jennifer Berrent, WeWork’s general counsel and chief culture officer, a recently created position, said of the dispute resolution program. For    —   many of which began in Silicon Valley  —   the clauses can seem to conflict with professed goals of upending business as usual and being open with employees. Arbitration, by its very nature, is a secretive process that is often lopsided in favor of the employer. That secrecy, federal labor officials said, can allow widespread problems to persist because the process bars employees from sharing their experiences with others who might be in similar positions. “They give their young workers   tables and take away their constitutional rights,” said Cliff Palefsky, an employment and civil rights lawyer in San Francisco. This month, the Consumer Financial Protection Bureau proposed a rule that would limit financial companies from using arbitration to prevent their customers from filing   lawsuits. But the rule does not apply to arbitration used in employment disputes. As Silicon Valley companies grow from small   into major employers, their labor practices are coming into focus. Despite the popular image that the industry is predominantly made up of nerdy millionaires, many of these growing companies depend increasingly on   employees. And with some technology companies now working harder to raise money, there are growing pressures on these companies from investors to cut costs  —   pressures that can fall disproportionately on the workers at the lower rungs. At WeWork, Ms. Berrent said, arbitration is part of a multistep process to resolve disputes. The company adopted the policy after months of discussion about how to deal most fairly with complaints. At the outset of the process, WeWork requires employees to raise any complaints with their managers. If that does not work, the employee and WeWork must try mediation. Only if that fails does the issue go before an arbitrator, whose decision is binding. Ms. Berrent said this process was in keeping with the company’s values, settling problems “through open collaboration” rather than the courts. She confirmed that Ms. Zoumer was fired for not signing the arbitration clause. She said the employees who hold the job that Ms. Zoumer used to have were the “soul” of the company and its “brand ambassadors. ” She said they performed tasks that were far from menial and were not suited to an hourly wage. Ms. Berrent also notes that while lawsuits are both costly for the employee and confrontational, the company pays for arbitration no matter who wins. Unprotected by an arbitration clause, companies can face litigation that could result in huge settlements. The drug company Novartis paid $175 million to settle a   suit brought by female employees over promotions and pay. And more than money can be at stake Nike had to overhaul its business practices after   employees sued over discrimination. At large corporations, many employees have come to expect the clauses as standard. But those working at smaller firms that claimed to treat their employees like family tend to be surprised when they collide with one. When Kevin Ziober, a Navy reservist in Costa Mesa, Calif. first joined BLB Resources, which manages foreclosed properties, the company was just beginning Mr. Ziober was the 18th person hired. Mr. Ziober had already been at the company for several months when he was asked to sign the arbitration policy in January 2011. He did so without a second thought. It was a decision he would regret. In the fall of 2012, he informed BLB Resources that he was being deployed to Afghanistan. On his last day, the company threw him a farewell party, complete with a cake shaped like an American flag. “I was on Cloud 9,” Mr. Ziober said, recalling how he phoned his family to tell them about the party. That afternoon, as Mr. Ziober said he was packing up his cubicle, he was called into the human resources office and was “summarily” fired, according to his legal appeal. The reason for his termination, the company said, was that he was not being included in a federal contract that the company was applying for. In a statement, BLB said the decision not to include Mr. Ziober in the contract occurred months before he informed the company that he was being deployed. The statement added that BLB had offered to allow Mr. Ziober to work on the remainder of his existing contract if he returned in time from his deployment. In 2014, after returning from Afghanistan, he sued BLB Resources for violating a federal law, known informally as Userra, that protects the jobs of service members while they are deployed. A California judge ruled that he would have to take his claim to arbitration. Mr. Ziober’s lawyer, Peter   has appealed the case, arguing that Userra preserves the rights of service members to go to court. BLB said in a statement that “the company is extremely disappointed about Mr. Ziober’s allegations and denies them wholeheartedly. ” With their appeal, Mr. Ziober has waded into an intense battle playing out across the country. In Washington, a group of bipartisan lawmakers introduced a bill in 2014 that would exempt service members from having to take claims of wrongful auto repossession or improper debt collection to arbitration. An almost identical bill was quashed after intense lobbying by big banks and credit card companies, never making it out of committee. A bill in California that would have prevented companies from requiring employees to sign arbitration clauses suffered a similar fate when Gov. Jerry Brown vetoed it last year. The legislative skirmishes point to just how valuable arbitration has become to companies and just how far they will go to defend it. Despite WeWork’s arbitration requirement, Ms. Zoumer decided to sue the company on her own, hoping she would prevail in overturning the clause. Ms. Zoumer’s lawyer, Ramsey Hanafi, filed her case in December over wrongful termination and unfair labor practices, and Boies, Schiller  Flexner, a top corporate defense firm, is representing WeWork. Ms. Zoumer, 31, said she knew she was taking a risk when she challenged WeWork over arbitration. She told the company she needed at least a week to review the policy before deciding whether to sign it. In an email to colleagues, she encouraged them to do the same, citing The Times’s investigation into arbitration. Ms. Berrent said Ms. Zoumer was the only employee who refused to sign other than two employees who had planned to leave the company anyway. Ultimately, no other employees joined Ms. Zoumer’s lawsuit. “Younger people don’t want to pick fights, but we are losing our rights,” Ms. Zoumer said.'"}, "time": 1742562324.2576227}