{"duration": 0.11509537696838379, "input_args": {"text": "'ORAIOKASTRO, Greece  —   Mariya bint Loqman Abdlkarim is 9. She arrived in Greece in February after fleeing Syria with her family and crossing from Turkey in a rickety boat. Since then, she has been living in a shabby   camp, her future uncertain, her present reduced to the bare necessities. Not long ago, the Greek government decided to give her a shot at something closer to a normal life: Along with 22, 000 other refugee children, she would be allowed to attend public school starting in October. But as with many aspects of Europe’s effort to cope with the huge numbers of migrants who have come to its shores, the plan quickly ran into intense opposition, in this case from parents in a number of communities near camps in northern Greece. The refugee children, the parents said, might have contagious diseases. Cultural differences, they said, might disrupt learning. Last week, an association representing the parents of schoolchildren in the small town of Filippiada in western Greece sent a letter to local officials and the Education Ministry, saying “explicitly and categorically that we will not accept, under any circumstance and without any compromise, that the children of   irregular immigrants” attend local schools, referring to migrants entering the country illegally. “They come from another continent with completely different diseases and health conditions,” the letter said, adding that the refugees have a “different outlook regarding the role of the family, of women, of religion. ” Their presence would “alter the Greek character of the schools,” the letter said, adding, “We will not allow religious fanaticism. ” Earlier in September, the parents’ association of two schools in the town of Oraiokastro in northern Greece threatened to occupy the school grounds in protest if refugees from a nearby   facility were allowed to join classes. A few days earlier, the local mayor had called on residents to take the law into their own hands amid rumors that some refugees were moving into houses in the area. The parents’ announcements and a video of the mayor’s suggestion that residents “intervene” caused a public outcry and a storm of angry reactions on social media. They also prompted a Greek prosecutor to investigate whether the parents’ groups or the local mayor should be charged with racist offenses. Since then, both the parents’ groups and the mayor have toned down their responses, saying their only concern is the possible health implication if the refugee children are not vaccinated. The mayor, Asterios Gavotsis, said his comments in the videotaped meeting were “misinterpreted” and that he was “not inciting anyone to commit illegal acts. ” Outside one of the schools, Haralambos Magoulianos, a    retiree waiting to collect his two granddaughters, said he opposed admitting the refugee children. “I don’t like it,” he said. “What happens if we have an epidemic? I don’t want them here,” he added, saying that youths from the nearby refugee camp “steal bicycles and jump into our backyards. ” Other parents in the area have been more welcoming. The principal of the school in Filippiada and some parents there said the letter sent by the parents in that area did not reflect their views. In Oraiokastro, Alexandra Hapsi, 41, has two children in school. She said she had cooked food and donated clothes for refugees living at the sprawling camp at Idomeni, farther north, which was shut this year. “In Europe, no one is taking in refugees, and they call us racist,” she said, adding that she also wanted reassurances that the refugees attending local schools had been vaccinated. Asterios Batos, whose children attend the same school as Ms. Hapsi’s, leads the group representing the parents’ associations of all 41 schools in the broader region. “This image of a racist municipality is unfair,” he said, referring to the broader region. “We’re not racists. We’re concerned about whether all the right precautions have been taken. ” The plan calls for the migrant children to attend school in the afternoons. Initially, they would be kept in classes separate from Greek children, but they would eventually be merged into the general student population. In comments to Greek television last week, the education minister, Nikos Filis, said the program for the induction of refugees into schools included vaccinations. The lessons will be in Greek, math and English, or another language, depending on where the refugees plan to travel on to. The government has yet to specify which schools will be part of the program, stoking frustration among some parents and local officials. “Does a neighborhood or a school have the right to say, ‘I don’t want foreigners here?’ No, it doesn’t,” Mr. Filis said. The mayor of Oraiokastro, Mr. Gavotsis, said that he was not opposed to refugees’ being educated, but that classes should be held for a year in other venues, such as disused factories, before the children attend local schools. He said the high proportion of refugees in Oraiokastro, which has a population of 30, 000, was testing tolerance. “We have 10 percent of all Greece’s refugees here,” he said, referring to some 6, 000 migrants at three nearby camps. There are just over 60, 000 refugees in camps across Greece. Tensions often boil over among frustrated migrants, some of whom have been waiting for months for the outcome of their asylum applications, and many local residents are fed up, holding regular protests. The turmoil has been exploited by members of   groups who have infiltrated some of the protests. “We just want a fair distribution,” Mr. Gavotsis said. “If that makes us racist, what can I say?” Katerina Karanikolaou, who attended the meeting where Mr. Gavotsis suggested that local residents “intervene” to stop the education plan, was the only one of 72 parents to vote against a motion to occupy one of the schools in protest. She said the health concerns were a smoke screen. “The xenophobia started with Idomeni in February, and it’s taken root since,” she said, adding that residents feared “their town will be downgraded. ” Last Monday evening, Ms. Karanikolaou and her four children joined an antiracism rally, marching from the mayor’s office through the pristine streets of Oraiokastro, which means “beautiful castle. ” It was named by Greek refugees who settled there from 1924 to 1930 after a castle that used to sit on the coast of the Black Sea. “It’s sad,” Ms. Karanikolaou said. “Our ancestors were refugees. ” Around a mile away, in a huge disused tobacco factory, Mariya, the    girl from Syria, lives with her parents and seven siblings in a tent, one of hundreds sheltering some 1, 300 refugees. The camp is filthy  —   state health officials have called for its closure  —   but aid organizations run an efficient clinic, vaccinating children against mumps, measles, rubella and hepatitis. Stirring chunks of stale bread into a pan with browning onions for the family’s evening meal, Mariya’s mother, Jihan Sheikh Mohammed, 33, said she would prefer that her daughter attend a local school rather than receive the makeshift lessons given on site by humanitarian workers. But her father, Loqman Abdlkarim, 42, is keen to move on, as the family’s next asylum interview is not until April and he has relatives waiting for him in Germany. “I will wait another 20 days,” he said. “If nothing happens, then we’ll go back to Turkey. Even Syria is better than this,” he said, adding that drug dealing and sexual abuse were rife in the camp. Mariya, a bright, friendly girl, wants to stay. She said she would like to be a lawyer eventually. “Helping people,” she said. Oblivious to residents’ objections in the nearby town, she is eager to go to a real school, but is nervous about fitting in. Frowning pensively, she pointed to her grubby purple tracksuit and bare feet. “Will they let me go like this?”'"}, "time": 1742563714.8439877}