{"duration": 0.0797278881072998, "input_args": {"text": "'Good morning.  Here’s what you need to know: • Prime Minister Shinzo Abe returned from his visit with President Trump to a boost in approval ratings  —   and an internet meme of their uncomfortable handshake. Complicating matters even more, North Korea claims its recent launch shows progress toward   nuclear capabilities. Prime Minister Justin Trudeau of Canada is visiting Washington to discuss trade and jobs. Up next is Prime Minister Benjamin Netanyahu of Israel, on Wednesday. _____ • Michael T. Flynn, the U. S. national security adviser, resigned after it was revealed that he had misled the White House about his conversations with the Russian ambassador to the United States. The retired Army general, who had served in the job for less than a month, stepped down following days of reports that he had discussed American sanctions with the diplomat, weeks before President Trump’s inauguration. Today’s episode of The Daily podcast looks at Stephen Miller, the    behind many of Mr. Trump’s most contentious executive orders. Listen here if you’re on a computer, here if you have an iOS device or here for international access on an Android device. _____ • More harrowing details about the suffering of civilians in the Syrian city of Aleppo: Canisters of chlorine gas, a banned weapon, were dumped on residential areas at least eight times late last year in the final weeks of the battle to retake the city from rebels, Human Rights Watch reported. And a separate analysis drawing on satellite images, security videos and other data indicates that Russia, contrary to its repeated claims, bombed a major hospital in the city multiple times. _____ • Dozens of people employed by Xiao Jianhua, the influential Hong Kong billionaire who was whisked to China last month, are being stopped from leaving the mainland  —   another sign that Beijing is enforcing one of its most   crackdowns on a private Chinese conglomerate. Above, Mr. Xiao’s Tomorrow Group building in Beijing. _____ • A California dam’s spillway appears to have stabilized, but evacuation orders remain in place for more than 180, 000 people as state authorities try to make emergency repairs before more rains come. Gov. Jerry Brown warned that the situation at the Oroville Dam, the tallest in the U. S. was “complex and rapidly changing. ” _____ • Spiky limestone cliffs known as karsts support strange and rare species across Southeast Asia, from Vietnam to Borneo. But they are vanishing as surely as the region’s forests, often pulverized for cement. The loss is particularly acute in Cambodia, with limited government regulation and a scientific base still recovering from the trauma of the Khmer Rouge. _____ • Peugeot, the French automaker, bought India’s most iconic car brand, the Ambassador, from Hindustan Motors for $12 million. The “Amby,” sometimes described as a bowler hat on wheels, was first made in 1948. • The U. S. Senate confirmed Steven Mnuchin as Treasury secretary. The   Sachs banker will seek to overhaul the tax code and financial rules. • Our tech reporter considers the affinity Asia tech titans have for Mr. Trump and weighs whether they can fulfill their pledges to bring jobs to the U. S. • Japan is enjoying its longest period of growth in three years. But the pace of expansion has been slowing, and questions persist about how Japan’’s exporters will weather the Trump administration. • China’s inflation quickened to to 2. 5 percent in January, the highest rate since 2014. • U. S. stocks rose. Here’s a snapshot of global markets. • In Pakistan, a bomb killed at least 13 people and wounded more than 100 at a protest by pharmacists in downtown Lahore.    a   group, claimed responsibility. [The New York Times] • New Delhi’s latest bout of air pollution is drawing attention to widespread toxic air in the country. [India. com] • A rising hope  in France’s presidential race is Emmanuel Macron, the    former minister of the economy, who will face Marine Le Pen of the   National Front. He claims to transcend parties, but risks being seen as a candidate who stands for nothing. [The New York Times] • Australian firefighters  are still trying to contain remaining bushfires in New South Wales, while many residents returning to scorched areas find nothing left. [ABC] • A photo essay looks at a community on the outskirts of Bangkok where migrant workers from Cambodia, Myanmar and Laos live with their children in stacks of shipping containers. [The Diplomat] • A bomb scare at Hong Kong Disneyland, which led to the evacuation of more than 500 people, was set off by a suspicious package containing batteries and wires that turned out to be a child’s toy  —   possibly a malfunctioning Buzz Lightyear. [Hong Kong Free Press] • Japan, with the world’s highest proportion of people 65 and older, is a global model for how to adapt to an aging society, including when it comes to “one of the greatest joys”  —   eating. [The New York Times] • Want to stay focused at work today? Remember to take a break. • At age 100, this man still plays, teaches and conducts. Like the music, he keeps going. • Recipe of the day: Impress your sweetheart with this    chocolate fudge. • Modern goddesses ruled the Grammy music awards. Adele swept the top awards at the Grammys, but paid tribute to Beyoncé, who delivered a showstopper celebrating motherhood. Here’s the complete list of winners, and a look at the red carpet. • And the   Biennale is one of the largest exhibitions of contemporary art in India. Our 360 video follows an artist as she installs her work “The Dance of Death. ” Valentine’s Day isn’t the only holiday celebrating love today in the U. S. It is also National Donor Day, a government effort encouraging Americans to register to donate organs, eyes and tissue. Fifty years ago in South Africa, Dr. Christiaan N. Barnard performed the first human heart transplant. The patient survived just 18 days, but his use of a donor who was   was heralded by other doctors. “It was a monumental advance,” one said, “more societal perhaps than medical, because it applied to all organ transplants. ” Dr. Barnard’s second transplant patient lived for 19 months. The surgery was also notable because the donated heart came from a biracial man, a provocative decision during apartheid rule. Kidneys are the most frequent organ transplanted. The first operation to transfer a kidney that is considered to have been successful took place in Boston in 1954 involving a brother and his dying twin sibling. Tiff Fehr, a colleague of ours at The Times, saved a fellow journalist in December. She has this advice to anyone considering the brave act: “Donating a kidney was a kind of faith: in people, health care, hospitals and more. I’m gratified it went well on all fronts. ” For information on how to help, here is a list of organizations. Sean Alfano contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742628555.681864}