{"duration": 0.06860589981079102, "input_args": {"text": "'Nikki Haley, U. S. ambassador to the United Nations, has penned a blistering   targeting the controversial U. N. Human Rights Council. She uses her toughest language yet and slams the body as a “haven for dictators” ahead of a visit to its headquarters in Switzerland next week. [“When the world’s preeminent human rights body is turned into a haven for dictators, the idea of international cooperation in support of human dignity is discredited,” she says in an   for the Washington Post, published Friday.  Haley is due to address the Council in Geneva on June 6 —  the   address to the Council by a U. S. Permanent Representative —  before she then travels to Israel, where she will meet with Prime Minister Benjamin Netanyahu and visit a number of Israeli historical sites. The visit to Switzerland is likely to be a tense one. The Trump administration has reportedly contemplated an exit from the Council over its   bias and its questionable membership, which includes countries such as Cuba, Venezuela, and Saudi Arabia. A Senate subcommittee met last month to assess if the U. S. should remain a member of the body.  The U. S. boycotted the Council’s opening session in March over the   agenda before it, and Haley herself has called the Council “so corrupt” and filled with “bad actors,” using it to protect their own behavior.  In her piece for the Post, titled “The U. N. Human Rights Council whitewashes brutality,” Haley notes that the Council has done good work in places such as North Korea but says that it also allows countries on the Council, such as Venezuela and Cuba, to have their abuses ignored:  Venezuela is a member of the council despite the systematic destruction of civil society by the government of Nicolás Maduro through arbitrary detention, torture and blatant violations of freedom of the press and expression. Mothers are forced to dig through trash cans to feed their children. This is a crisis that has been 18 years in the making. And yet, not once has the Human Rights Council seen fit to condemn Venezuela. Calling on the U. N. to “reclaim the legitimacy of this organization,” Haley says she will outline the needed changes when she visits the Council. Those changes include competitive voting for membership on the council —  to keep “the worst human rights abusers from obtaining seats” and end the practice of singling out Israel for criticism. “When the council passes more than 70 resolutions against Israel, a country with a strong human rights record, and just seven resolutions against Iran, a country with an abysmal human rights record, you know something is seriously wrong,” she says. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY.'"}, "time": 1742561806.5535805}