{"duration": 0.1117856502532959, "input_args": {"text": "'LONDON  —   Michael Gove made his case on Friday to become the next British prime minister, arguing that the new leader should be someone who had backed an exit from the European Union, while vowing to spend less than a third of what his “Leave” campaign had promised on the National Health Service. Mr. Gove spoke a day after he shocked Britain by announcing his candidacy in the Conservative Party competition, having promised to serve as campaign manager for Boris Johnson, the former London mayor seen as the   for the post. Mr. Johnson, one of the leaders of the Leave campaign with Mr. Gove, has withdrawn his candidacy, making the home secretary, Theresa May, 59, the   favorite. But Ms. May had quietly backed staying in the European Union, and Mr. Gove, the justice secretary, argued on Friday that he best represented the mood of the party and the country. Mr. Gove, 48, laid out his program in a long and slightly wandering speech in London, acknowledging that he possesses no glamour or charisma and that he “did almost everything not to be a candidate for the leadership of this party. ” He said he was “so very reluctant because I know my limitations. ” He added, “Whatever charisma is I don’t have it, whatever glamour may be I don’t think anyone could ever associate me with it. ” But Mr. Gove, having betrayed Mr. Johnson, had to justify his decision. He listened to his heart, he said, and decided that running was “the right thing to do. ” He portrayed himself as a politician of conviction who broke with Prime Minister David Cameron, a friend, over a longstanding belief that Britain could not be truly sovereign inside the European Union, and with Mr. Johnson because “I came to realize this week that, for all Boris’s formidable talents, he was not the right person for the task. ” Like Ms. May, who spoke in a polished opening of her candidacy on Thursday, Mr. Gove said that he would not begin the formal process of leaving the European Union until next year and would not hold an early election. He also said that controlling immigration to Britain was a goal, which would almost surely prevent Britain from retaining access to the   single market of the bloc. He promised to “end free movement, introduce an     system for immigration, and bring numbers down. ” Money saved from leaving the European Union would be spent principally on the National Health Service, he said, pledging to spend 100 million pounds more a week, or about $133 million, by 2020. Before the referendum, the Leave campaign  bus had been emblazoned with a promise to spend £350 million a week on the N. H. S.  —   a pledge that it said was equivalent to the amount Britain sent to the European Union and one that it refused to abandon even when it was shown that the figure was bogus. Mr. Gove argued that he was “the candidate for change,” pointing to his experience as justice secretary and especially as education secretary, even though he became so unpopular in that post that Mr. Cameron moved him out of the job. That move was the source of great resentment from Mr. Gove and his wife, Sarah Vine, a journalist. Mr. Gove spoke of being an adopted child lucky to find loving parents in Aberdeen, Scotland, who instilled in him “a belief in human potential. ” And Mr. Gove, through intelligence and hard work, rose to graduate from Oxford and join the nation’s political elite. Only five Conservative members of Parliament were in the audience, and Mr. Gove will need more support than that to emerge as a plausible prime minister and a real competitor to Ms. May. She is considered a safe continuity candidate who is to the right of Mr. Cameron but slightly to the left of Mr. Gove. Ms. May is not a natural politician or a   but she has concentrated on doing her work. She has been generally praised for her six years as home secretary, one of the country’s most difficult jobs, in particular for standing up to the police unions and for pushing through antiterrorism legislation. Mr. Gove had little to say on Friday about the budget or the economy, which has taken a big hit from the vote for the British exit, known as Brexit, as the Treasury warned. During the campaign, he dismissed all such warnings as “Project Fear” and said that “people in this country have had enough of experts. ” George Osborne, the chancellor of the Exchequer and a friend of Mr. Gove’s, said in a speech of his own in Manchester on Friday that he would abandon his pledge to balance the budget by 2020, the end of this Parliament, because of the effect that the referendum would have on growth and the uncertainty surrounding it. “We will continue to be tough on the deficit, but we must be realistic about achieving a surplus by the end of this decade,” Mr. Osborne said. Few economists believed that Mr. Osborne would deliver a budget surplus so soon in any case, given the size of the deficit and the impolitic scale of the spending cuts or tax increases that would be required to achieve one. On Thursday, the governor of the Bank of England, Mark Carney, warned that Britain was suffering “economic   stress” from the referendum and that a downturn and possibly a recession were on the way. Mr. Carney said that he expected to order “some monetary easing” in the next few months to promote growth  —   in other words, a cut in interest rates. But the bank can only do so much. “Monetary policy cannot immediately or fully offset the economic implications of a large, negative shock,” he said. Had Mr. Cameron and the “Remain” campaign won the referendum, Mr. Osborne would have been seen as a potential successor for prime minister. Those hopes have evaporated, and there is speculation that he may support Mr. Gove. There are three other candidates: Stephen Crabb, a young lawmaker who is the work and pensions secretary Liam Fox, a former defense secretary and Andrea Leadsom, the energy minister, a Leave campaigner who is fast picking up support. Conservatives will start winnowing the five candidates down to two in rolling votes, and then the 150, 000 or so party members will choose between the final two, expected now to be Ms. May and Mr. Gove. A decision is likely to be announced on Sept. 9.'"}, "time": 1742562341.5544193}