{"duration": 0.04087710380554199, "input_args": {"text": "'For Donald J. Trump the TV star, ratings were made to be embellished. This turns out to be true as well of Donald J. Trump the president. Mr. Trump spent his first weekend in office at war with math. He said on Saturday that his inauguration crowd  —   which photographs showed was dwarfed by Barack Obama’s estimated 1. 8 million in 2009  —   “looked like a million, a million and a half. ” His staff members backed up that claim with what his adviser Kellyanne Conway memorably termed “alternative facts. ” For the political news media, the brazenness was stunning. But those of us who cover television have seen this kind of thing before: the inventions of a celebrity, surrounded by yes men and women, who creates his own reality. We recognize it because, not so long ago, that celebrity was Donald J. Trump. Mr. Trump has a reputation among TV reporters for using his own bespoke numbers. In 2015, he came to a Television Critics Association panel for his final season hosting “The Celebrity Apprentice” and declared it “the Number 1 show on television. ” It was not. Publicly available Nielsen ratings flatly proved that. Pressed by reporters, he insisted that it was at least the   show on Monday nights. It was not that either. (It finished the season 67th.) It was a bizarre performance even by the usual   standards of the critics association sessions. “The Apprentice” was, in its first season, a genuine hit. It declined afterward, but hung on as a modest performer. That’s no mean feat. But that wasn’t enough for Mr. Trump. So it wasn’t true for Mr. Trump. Last year, Mr. Trump’s former “Apprentice” publicist, Jim Dowd, was interviewed for the PBS “Frontline” election documentary “The Choice. ” Mr. Trump, he recalled, would demand that he call up   reporters and tell them, “Number 1 show on television, won its time slot,” even if “we were Number 72. ” (Mr. Dowd died in September.) Mr. Trump has always used an aspirational calculator. As a real estate developer, he built Trump Tower with 58 stories and declared it 68 stories tall. He carried his scorekeeping obsession into his celebrity career. For his 2011 Comedy Central roast, The Huffington Post reported, writers were told not to joke about Mr. Trump being less wealthy than he says he is. He edited a gag that said he lived in a “   penthouse atop my   space station,” raising the square footage to 50, 000. Running for president meant a new set of ways to keep score, and fudge it: The polls  —   rigged, unless they favored him. His rally attendance  —   huge, yet not too huge for him to embellish. And, again, the TV ratings, and not just for his own events. On Twitter, two weeks before his inauguration, he taunted Arnold Schwarzenegger, his replacement on “The Celebrity Apprentice,” for getting “‘swamped’ (or destroyed) by comparison to the ratings machine, DJT. ” If you knew all this, then you knew, when you saw the expanses of white space on the National Mall on Friday, that Defcon 1 klaxons were going to be blaring in the command center of Mr. Trump’s ego. He would be made small. His crowds would be smaller than Mr. Obama’s  —   smaller than the Women’s March! It would be in pictures, on TV, where things are the most real of all. It would make him look, in his understanding of the world, like a loser. Donald J. Trump is not a loser. Ergo, it was not true. The smaller turnout for Mr. Trump’s inauguration is actually a decent symbol of his election victory, in which he lost the popular vote by nearly three million votes but won the presidency on the strength of an intense base. To put it again in TV terms, Mr. Trump won by   rather than broadcasting. He identified a key demographic in the right markets and successfully targeted it. His margin of victory in the decisive states of Michigan, Pennsylvania and Wisconsin was just over 77, 000 votes combined, around the average audience of the   NBC Universo channel. This is a perfectly valid strategy, in politics and in TV. And in practice, Mr. Trump has embraced the politics of   not just in the campaign but in his inaugural speech, which made no effort to reach beyond his base. But as much as Mr. Trump has adapted to modern media, he is still a    man who came of age in the era of three TV networks, when there were no niche hits. Just as he could not be satisfied with the niche success of “The Apprentice,” he seemingly cannot bear being a niche president. It eats at him. He wants to win total viewers, not just the key demo. He doesn’t want to change to achieve that. But he wants the credit. Thus his repeated lie that he would have won the popular vote if not for “millions” who voted illegally. Thus the   inaugural fans he conjured up like extra floors to sell a condo building. Celebrities have support staff dedicated to maintaining their bubbles. (Even Mr. Trump’s bringing staff members to cheer him at events  —   like his first postelection news conference  —   is familiar from the critics association panels. Journalists are professionally forbidden from applauding the celebrities they cover, so network staffers whoop it up to massage their stars’ egos.) Mr. Trump has his press secretary, Sean Spicer, and Ms. Conway, each playing their version of the bulldog Hollywood publicist. Their job is to keep the talent happy. In a news briefing on Monday, Mr. Spicer essentially argued that the   comparisons were accurate, but it was “demoralizing” for the news media to make them. With these enablers around him, don’t expect Mr. Trump to change much. On Sunday, he   that “31 million people watched the Inauguration, 11 million more than the very good ratings from 4 years ago!” Mr. Trump’s TV ratings were also about 7 million viewers lower than Mr. Obama’s first inaugural in 2009. Mr. Trump’s tendency to treat truth as negotiable was idiosyncratic in a TV star. In a president, it’s disturbing. Alternative facts are what they use in alternatives to democracy. If anything, presidents receive more grades and metrics than candidates do, from approval polls  —   rigged again, apparently  —   to unemployment figures, which Mr. Trump cast doubt on when they were favorable to Mr. Obama. Every sign says that Mr. Trump will respond to these figures exactly as he has in the past: as the TV star, up early in the morning, stewing, waiting for the overnight ratings to come in.'"}, "time": 1742628516.7080996}