{"duration": 0.03660917282104492, "input_args": {"text": "'The Secret Service is investigating a burlesque dancer from Kentucky after she posted a Tweet that said she hoped someone would be “kind enough” to assassinate President Donald Trump. [“If someone was cruel enough to assassinate MLK, maybe someone will be kind enough to assassinate Trump,” Heather Lowrey, 26, of Louisville wrote on Twitter.  The Secret Service confirmed it interviewed Lowrey and is still investigating the incident, the New York Daily News reported. Lowrey posted the Tweet Jan. 17, three days before Trump’s inauguration. The Tweet disappeared not long after it was posted, along with all her social media accounts. The bio on her profile said she was a “a Louisville Vixen and aspiring WWE diva” before the account was taken down, the Daily News reported. No charges have been announced against her yet, but her former employers have already issued statements denouncing the Tweet and have severed ties with her, WAVE reported. Va Va Vixens, a burlesque group in Louisville, let Lowrey go as soon as they found out about the incident, citing a “zero tolerance policy” for her behavior. “We do not condone hate by any party and will not partake in it. We in no way support negative behavior or malicious intent from anyone,” the group said. American Income Life, Travis Moody Office, also severed ties with Lowrey and issued a statement on the company’s Facebook page saying, “Heather Lowrey is no longer contracted with the Travis Moody Agency. ” “The Travis Moody Agency, its agents and its staff do not share the same views, nor opinions as Heather Lowrey. We have a zero tolerance policy and would never condone this behavior,” the company said. She is the only person to face a federal investigation for posting about the assassination of President Trump. The Secret Service is also reportedly looking into Madonna’s comments at the Women’s March on Washington Saturday after the singer said she had thought of “blowing up the White House. ”'"}, "time": 1742561639.5639656}