{"duration": 0.11317229270935059, "input_args": {"text": "'PARIS (AP)  —   Human rights activists are gathered in Paris to draw attention to the situation of gays in Chechnya before Russian President Vladimir Putin’s visit to France. [The activists want   French President Emmanuel Macron to discuss the issue with Putin at their Versailles palace meeting. They held a banner “Stop homophobia in Chechnya” at a square in front of the Eiffel Tower.  Amnesty International France vice president Cecile Coudriou says “it’s important that Mr. Putin is ready to hear, we hope, strong words coming from Mr. Macron, to say ‘stop’ to that homophobia which has lasted for too long. ” Human Rights Watch said in a new report last week that   officials in Russia’s Chechnya humiliated inmates during visits to detention facilities where gay people were allegedly held and tortured. MOSCOW (AP)  —   On a trip that will likely shape   ties for years to come, President Vladimir Putin is set to visit France for talks on Monday with   French President Emmanuel Macron after expressing sympathy for his rivals during the campaign. After Moscow lost its bets in the French vote, the visit offers the Russian leader a chance to turn the page and try to establish ties with Macron as the Kremlin has struggled to mend a bitter rift in relations with the West. The meeting comes in the wake of the Group of Seven’s summit over the weekend where relations with Russia were part of the agenda, making Macron the first Western leader to speak to Putin after the talks. The Kremlin has hailed the visit as a chance for Putin and Macron to get to know each other and better understand their views on a range of disputed issues, including the Ukrainian crisis, the war in Syria and Russia’s ties with the European Union. Macron’s invitation for Putin was a surprise after his tough stance on Russia during the presidential campaign that contrasted with the platforms of some of his rivals, including   candidate Marine Le Pen and conservative Francois Fillon, who both have spoken for ending Western sanctions against Moscow over the Ukrainian crisis. Amid the Congressional and FBI investigation into Russia’s alleged meddling in the U. S. presidential vote, Macron’s aides claimed in February that Russian groups were interfering with his campaign. Moscow has strongly denied all allegations of election meddling. Putin, however, made his preferences in the French presidential election clear by hosting Le Pen at the Kremlin in March  —   part of Russia’s efforts to reach out to nationalist and   forces in a hope of boosting their influence in the West. Over the years, Putin also has frequently met with Fillon, the French prime minister in   and praised him as an experienced statesman. Analysts say the visit to Paris offers Putin an opportunity to improve ties with France that had steadily deteriorated in the closing months of Francois Hollande’s presidency. “As a person who pays utmost attention to personal contacts, Putin believes that only a    meeting could give answers to many questions about Macron as a person and president of France, as well as his future foreign policy course and his stance on Russia,” Tatyana Stanovaya of the Center for Political Technologies, an independent     wrote in a commentary. “Putin understands quite well that just one productive meeting could lead to a radical revamping of ties. It would be silly not to use that chance. ” In October, Putin abruptly shelved a trip to Paris after Hollande alleged that Russia could face war crime charges over Syria. Hollande declared that he wouldn’t take part in the opening of the newly built Russian Orthodox Spiritual and Cultural Center in the heart of the French capital and was only interested in talking about Syria. As part of his trip Monday, Putin is scheduled to visit the center near the Seine River that includes the Holy Trinity Cathedral along with a school and a book shop. The site was sold to Russia under former President Nicolas Sarkozy amid criticism from rights groups about France’s outreach to Putin. Prior to that, Putin and Macron are set to have talks at Versailles and then tour an exhibition there marking the 300th anniversary of Russian Czar Peter the Great’s trip to Paris that was prepared by St. Petersburg’s Hermitage Museum. With Peter the Great widely seen as a ruler who modernized Russia and sought to open it up to the West, the exhibition offers a symbolic backdrop for both parties to talk about the importance of   ties, and, more broadly, rapport between Russia and the West. Putin’s foreign affairs adviser, Yuri Ushakov, said Russia is dissatisfied with the current level of political contacts, adding that the talks will offer a chance to review them. “The meeting is very important for both Russia and France,” he told reporters. Ushakov noted that he expects an “interesting discussion” on ways to implement a 2015 Minsk deal for eastern Ukraine, which was brokered by Germany and France. The U. S. and the EU have made the prospect of lifting economic and financial sanctions against Moscow contingent on fulfilling the peace agreement. The deal has helped reduce the scale of fighting between Ukrainian forces and   separatists in eastern Ukraine, but clashes have continued and political elements of the agreement have stalled. Ukraine and Russia have blamed one another for the lack of progress. Ushakov said that the two leaders will also have a “frank” discussion on Syria, where Russia has backed President Bashar Assad and France has pushed strongly for his removal. He added that last week’s suicide attack on Manchester Arena emphasized the need to pool efforts in the fight against international terrorism, so the talks will also touch on that.'"}, "time": 1742563301.9936411}