{"duration": 0.05594134330749512, "input_args": {"text": "'You are here: Home / US / Hard Truth About Violence at Trump Rallies Hard Truth About Violence at Trump Rallies October 28, 2016 Pinterest \\nRegan Pifer observes that when Hillary Clinton’s supporters say they are with her , they must also mean that they lie for her . \\nWhen no trouble exists, Clinton supporters create trouble. And say anything to cast a poor light on Trump and Trump supporters. \\nTheir foul play even extends to claims of physical violence towards women. \\nThe bad news for them (as it has been for Hillary) is that the truth always, eventually comes out. \\nAs reported by Breitbart : \\nA woman who accused a Donald Trump supporter of punching her outside a Trump rally in North Carolina is backtracking after James O’Keefe and Project Veritas released video showing Democrat operatives claiming she was a trained activist. \\n69-year-old Shirley Teter of Asheville now says it is possible that 73-year-old Richard L. Campbell merely touched her accidentally, as his attorney had claimed all along. \\nOriginally, Harris told local ABC News affiliate WLOS, “He stopped in his tracks, and he turned around and just cold-cocked me.” She also added a pointed, rhetorical question — namely, whether “people find a Trump supporter punching her in the face deplorable.” \\nNow, however, Teter is changing her story rather dramatically. She told WLOS on Wednesday that “it’s possible that he could have struck her with his backhand.” \\nO’Keefe’s undercover video showed Democracy Partners consultant Scott Foval — who has since been fired — claiming that Teeter was a “trained” political activist… \\n…Facebook video of the altercation shows Campbell — who suffers poor vision as a result of cataracts — being led through a gauntlet of anti-Trump protesters by his wife. \\nIn the video, Teter then follows Campbell and appears to reach for his shoulder. His attorney told Breitbart News that he turned around after being touched, and Teeter then fell down. \\nYou want to know what is really deplorable, Teter? You serving as a lying minion for your lying queen. \\nAnd the victim? A poor, older man with cataracts who just wanted to peacefully attend a rally. \\nMaybe you weren’t lying. Just confused? \\nI understand how getting “cold cocked” by an intimidating Trump supporter is essentially the same as picking a fight with a quasi- blind man and collapsing like you took a charge in the NBA. \\nBut how can we blame Teter? She teeters around the truth like the Hillz. \\nIf only we could catch all of Clinton’s (and her supporters) lies on video. What a glorious day that would be.'"}, "time": 1742563826.9089398}