{"duration": 0.05722451210021973, "input_args": {"text": "'  Donald J. Trump and his transition team unveiled an extensive plan to avoid conflicts of interest between his private business empire and his public office at a press conference at Trump Town in Manhattan on Wednesday morning. [The plan was presented by Sheri Dillon, a tax attorney at the Morgan, Lewis and Bockius firm. The goal of the plan, she said, was to ensure that Americans could “rest assured that all of [Trump’s] efforts are directed to pursuing the people’s business and not his own. ” She said that Trump’s business empire was “not dissimilar to the fortunes of Nelson Rockefeller when he became Vice President  —   but at that time, no one was so concerned. ”  While Trump would not divest himself entirely of his assets  —   a process, Dillon argued, that would itself involve conflicts of interest because of the people buying his assets or lending the money for their purchase  —   he had directed the attorneys at the firm to create a structure that would “completely isolate him from the management of the company. ” She pointed out that Trump’s plan was voluntary, since laws governing conflicts of interest did not apply to the president or vice president, but he wanted to avoid even an appearance of impropriety. The plan involves several major elements, the first of which is   Trump’s decision to place all of his business assets, liquid and illiquid, in a trust by the time he is sworn in Jan. 20, and to hand control of the family business to his sons, Eric and Donald, Jr. along with Trump Organization Chief Financial Officer Allen Weisselberg. Trump himself would resign from all his posts in the family business, and his daughter, Ivanka Trump, would also resign from, and have “no further involvement with,” the Trump Organization, due to her husband, Jared Kushner, taking an advisory role in the White House. Furthermore, the management of the new family business entity, Dillon explained, would appoint an Ethics Advisor, whose written approval would be required for any dealing “that could potentially raise ethics or conflicts of interest concerns. ” The Trump Organization had also created the position of “Chief Compliance Counsel” to oversee conformity with ethics rules. Dillon also revealed that Trump had ordered that all of his pending business deals terminated, resulting in millions of dollars in losses. She added: “No new foreign deals will be made whatsoever during the duration of President Trump’s presidency. New domestic deals will be allowed, but they will go through a vigorous vetting process. ” Trump would not have any role in such deals, but would only learn about them through the media like everyone else, in order to avoid the appearance of any conflicts of interest. The Trump Organization would only report profits and losses to Trump, not particular business details. She also argued that creating a blind trust would have been ineffective, since Trump knows what his “iconic assets” are, and that turning the Trump Organization into a   company would have been too lengthy and cumbersome to work. In answer to critics who argued that foreign payments to Trump’s businesses  —   such as hotel bills paid by overseas guests  —   violated the Constitution’s Emoluments Clause, Dillon pointed out that the courts had never interpreted that clause to apply to fair market value exchanged for goods or services. Nevertheless, she said, Trump had arranged that any profits from foreign customers of the Trump hotel chain would be donated to the U. S. Treasury to prevent appearances of foreign influence. Critics might observe that all of the arrangements above are voluntary  —   that is, the chain of accountability is entirely within the Trump Organization. However, Dillon would likely argue Trump’s commitments exceed what is required under the law. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563143.9569626}