{"duration": 0.19128155708312988, "input_args": {"text": "'Gentlemen, I am filled to the brim with joy. We have successfully thwarted the globalist’s plans to ruin America—we’ve fought against the big banks, we’ve fought against the Satanic pedophile Elites , and we’ve fought against the corrupt mainstream media.\\nBut, the battle is not over yet. We still have much to do if we wish to make America great again. This will not be an easy fight, for we will certainly face much resistance along the way. Expect the cucks and liberals to throw temper tantrums as their safe spaces come tumbling down, expect the mainstream media to demonize the alt-right, and expect the elites to do everything they can to stop us.\\nThey will not stop us, though—no, we are far too powerful. The wheels of truth do in fact turn slowly, but alas, they turn! And they are growing in speed as we blaze towards victory. Here are four goals that we must achieve on our path to victory.\\n1. Dismantle The Mainstream Media \\nAs more and more of us start to wake up, the media will begin to sense this—in fact, they already have. Have you wondered why they’ve started to cover anti-Hillary stories? It’s because they realize that they’re losing credibility.\\nThe mainstream media is very well aware that they’re losing their chokehold on the American public’s mind, so in a last ditch effort, they’re trying to seem unbiased. Do not buy into their lies—it’s all a giant farce; an attempt to regain their former credibility.\\nOver the next four years, it will be extremely important to start dismantling these outlets. It’s time to call them out for what they are. Start sharing alt-right stories on Facebook and Twitter, get our message out there. Don’t watch any mainstream media.\\nDon’t buy mainstream magazines, don’t watch their news shows, hell, don’t even pay for cable. Do everything you can to bleed their pockets dry.\\nAs more and more money moves away from the mainstream media, it will naturally move towards alternative news sources—sites like Return Of Kings, Info Wars, Matt Forney , and Danger and Play will become the new media.\\nDon’t expect this to happen at first, however. In one final cry, before its gory death, the media will proclaim that there is a new “racist, xenophobic” enemy that helped Donald get into office: the alt-right.\\nExpect them to demonize us. Expect them to lie about us, to scream and shout, and to protest. This is fine, however—for we are anti-fragile. The alt-right is in a very unique position.\\nAny and all hatred towards the alt-right will be a net win for us. Why? It’s simple: any publicity is good publicity. A single mention of an alternative news site by the MSM can, and often does, net us tens of thousands of new viewers.\\nIn other words: if they ignore us, we continue to grow in power. If they attack us, we grow even faster. They can’t win.\\n2. Drain The Swamp \\nEverything that we’ve done up to this point to get Donald in office will be completely pointless if we don’t drain the swamp. This is our one chance—we have four years to do this.\\nIn order for us to bring about permanent change in this country, we need to hold the cucks and libtards accountable for their actions. Anyone who pushed the pro-Islam agenda, rape culture, or feminazi philosophy must be called out for the traitors that they are.\\nThe elites, the corrupt bankers, and the globalists must all be brought to light. In order for us to bring about true change, and to prevent a globalist dictatorship from happening in the near future, we must ensure that at least 25% of Americans are aware of the elites’ “conspiracy” by the next election.\\nThis is a grass roots movement, and it is growing in power—but we must take away power from those who tried so hard to fight us. Now is the time to cause a ruckus and email your representatives. Now is the time to demand Hillary be thrown in prison.\\nEvery single person involved in Hillary Clinton’s private email server must be thrown in jail. Pedophiles and Satanists such as Anthony Weiner and Marina Abramovic, and traitors such as Huma Abedin and Comey must be thrown in jail for their crimes.\\nNow is the time to clear out the murky waters—to sift through the dirt and rotten garbage lurking below. I believe, that once all is said and done, America will enter into a new age of prosperity. The patriarchy will return.\\n3. Normalize Straight Males \\nFor too long have men been oppressed, by the very civilization which we created. We have let the SJW’s and culture warriors back us into a corner, but we’ve finally started to fight back.\\nMore and more men, upon being exposed to the manosphere, are starting to wake up and take the red pill . We’re starting to realize, as a nation, that there is no reason to be ashamed of being white or being a man.\\nOnce we start to dismantle the mainstream media and drain the swamp, most of this should happen naturally—it was only through the artificial social engineering that being a white male became a crime.\\nBut, we can’t stop here—it’s time to start slowly red-pilling our blue-pilled friends. The best way to do this, is simply through osmosis. Don’t try to convince them with logic, because they did not arrive at a blue-pilled position through logic. They did so through emotion.\\nSimply be a beacon of masculinity. Be confident in yourself, be assertive, and don’t cave into ridiculous HR requests or political correctness social pressures. Again, once the mainstream media is dismantled and the manosphere grows in popularity, our movement will gain strength exponentially.\\nThe normalization of males, especially white males, is essential for our culture to continue—the second that we started to become ashamed of our heritage and of our nationality was the second that the cucks started closing in. We cannot give them an inch, or they will take a mile.\\nThis is not to say that our country shouldn’t accept immigrants—IF they go through the legal process. How did it get so far that it became socially unacceptable to shame ILLEGAL immigrants? Again, ILLEGAL immigrants? Like I said, it got this way due to an overwhelming amount of white guilt. Do not be ashamed of your heritage, men.\\nWe have made a gigantic step towards national sovereignty with Donald Trump being elected as president, and we cannot let this victory go in vain. We must push onward and continue to normalize what is NORMAL. Being a straight male, white or note, should be the norm, not being a transgender, green-haired, SJW.\\n4. Get The Law On Our Side \\nAs our grass roots movement picks up more and more steam, I believe that the pressure we create will naturally push judges and lawmakers to change our corrupt legal system.\\nFirst things first, we must create laws that treat men and women as they should be treated. Too many laws are skewed in favor of women. Now that women have the right to work, we must remove alimony—it’s ridiculous that men should have to pay $10,000 a month to their ex-wives, because she “got used to” a certain living situation.\\nWe must remove corrupt anti-male divorce laws, ridiculous “hate-speech” laws which infringe on our freedom of speech, and ultimately, SJW “rape” laws.\\nI, along with many other ROK men, have been falsely accused of rape . It’s time to remove all of these ridiculous laws that make it illegal for men to simply talk to women, and that were built into the system by the elites in order to wage war against men.\\nThe law should encourage freedom of speech; the fact that Twitter has not been held accountable for banning Milo Yiannopoulos is absolutely absurd. Information and social media platforms should be held to the same standards that the American people are.\\nGoogle needs to stop censoring search results—and if they don’t, it’s time for us to create laws against this type of behavior. Allowing Google to filter search results is like a regression back to Medieval times. For one entity to selectively edit our version of reality is unacceptable.\\nMost importantly, judges and lawmakers that have taken bribes should be thrown in jail…indefinitely. Anyone who took a “donation” from George Soros or any other member of the Bilderberg group should be imprisoned for crimes of treason.\\nSummary \\nWe are on the path towards victory, men—but it will not be without many hiccups. The first thing that the mainstream media will do is demonize the alt-right, but again, this will only make us stronger. It will expose our view points to a larger audience.\\nExpect it to get darker just before the dawn. Expect feminists, SJW’s, cucks, and libtards to protest and scream and shout—but, it will all be in vain. Too many men are starting to wake up. Too many men are starting to see the lies that have been shoved down our throats , and there is no going back.\\nThe next four years will be more important than ever. Our primary objective is to dismantle the mainstream media through natural means. It’s time for them to be exposed as the liars that they are. Simply eliminating the MSM will be most of the battle—remember, this is a war of information, and when the alt-right starts to control the news, there will be sanity.\\nWe must also focus on draining the swamp. We must rid our corrupt political establishment of the people who’ve betrayed us. We must normalize the family unit and white men—no longer shall we feel ashamed of our gender or sexual orientation.\\nThen, from here, the laws must change. Remember: this will not be easy. There will be much resistance along the way, but we’ve come this far. We’ve beat all odds and elected Trump as the president of our nation…and it’s time to make America great again.\\nRead More: Are You On Pace To Reach Your Goals? \\n'"}, "time": 1742562248.2936056}