{"duration": 0.0547027587890625, "input_args": {"text": "'Hillary Shows Her Guilt After Hearing Trump Supporters Chant 3-Brutal Words   Alisha Rich   \\nAfter decades of scandals, Hillary Clinton’s corruption seems to be finally catching up to her. Unfortunately for her, it’s all going down mere days before the election for her desired presidency. As she faces this harsh but deserved reality, she encountered several Trump supporters in Pompano Beach, Florida, who chanted 3 brutal words, and her reaction is proof that she’s guilty of it all. \\nWith only a little over a week to go before America votes for our next president, Hillary Clinton’s campaign is publically imploding. It seems even her most devoted fans are questioning her actions, and their uneasiness will only increase once they see what she did when she encountered several Trump supporters chanting, “Lock her up.” Pompano Beach – Clinton ran into some Trump supporters at an early voting site. pic.twitter.com/Lzbz1Pga1g \\n— Roberta Rampton (@robertarampton) October 30, 2016 \\nObviously, she’s been living in her own corrupt world for many years and believes she’s untouchable. However, people are now finally seeing who the real Hillary Clinton is — a crook and a criminal. When she encountered the vocal Trump supporters at an early voting site and heard what they were implicating, her reaction is exactly how a guilty person would respond – she ignored them, plastering that fake grin across her face. She ignored the folks screaming \"Lock her up!\" pic.twitter.com/SpgHvawvUr \\n— Roberta Rampton (@robertarampton) October 30, 2016 \\nOf course, some people may argue that her reaction is what anyone would do, but I believe the contrary. If you’re innocent, you’re going to want everyone to know you didn’t do it and vocally deny any unexpected accusations. Of course, Hillary does the opposite as she has many years of practice on how to ignore people who call her out for her wrongdoings. \\nClearly, when FBI Director James Comey dropped his bombshell, reopening her criminal investigation, Hillary became frantic and desperate. She knows what she’s done and how guilty she is. \\nNow, all she can do is pray nothing more comes to light before the big election. Sorry Hillary, not even your followers can be that dumb. I think it’s safe to say, Comey just handed Donald Trump the presidency.'"}, "time": 1742563147.231163}