{"duration": 0.16906404495239258, "input_args": {"text": "'STORRS, Conn.  —   After losing to Connecticut by 61 points in the first round of the N. C. A. A. tournament, Albany’s coach suggested that the Huskies were not only the best women’s basketball team in the country but also the fittest. “I think we’re as in shape a team that you’re going to come across,” said the coach, Joanna  . Yet, she added, “At times they just made us look bad in the way they pushed the ball. ” Robust conditioning is a particular imperative, and a stealth weapon, for a UConn team ( ) that rotates only seven players  —   five starters and two reserves  —   as it seeks a fifth consecutive national championship. Yet, perhaps surprisingly, UConn has won 109 consecutive games with an approach that is, in some ways, decidedly  . For instance, the Huskies do not use devices like   monitors, GPS tracking systems or other wearable technology designed to gauge fitness, enhance performance and reduce the risk of injury. “I’m not a big data guy,” UConn Coach Geno Auriemma said, adding with a laugh, “I’m not smart enough. ” Instead, the most dominant team in basketball places a premium on rigorous and varied preseason workouts, nutrition, sustained weight training through the season and, especially, on intense practices meant to simulate game conditions. The team relies heavily on the experience and intuition of Auriemma, UConn’s coach of 32 seasons, a Hall of Famer with nearly 1, 000 career wins, in knowing when to push hard in training and when to ease up. He firmly believes that, while weight training and   conditioning are vital, “nothing gets you ready to play basketball like playing basketball. ” Auriemma has 11 national championships  —   and is four victories shy of his 12th  —   to validate his theory. UConn faces U. C. L. A. on Saturday in the semifinals of the Bridgeport (Conn.) Regional. “The reason we’re fit is that we practice at an intensity that no one else does,” said Amanda Kimball, the team’s longtime strength and conditioning coach. “To maintain that intensity, it’s important to make sure we’re doing the right things in the weight room. ” UConn’s brisk,   practices are designed to prepare the regulars to play 30 or more of a game’s 40 minutes and to make quick and correct decisions when they are tired  —   to be able to hit a shot, make an intricate pass and guard the opponent’s top scorer in the closing minutes. “Their expectations are what you think you can’t do,” said Kyla Irwin, a freshman forward. To speed the pace of practices, a   shot clock is sometimes used instead of the   version used in games. Other times, four defenders hustle to guard six or seven shooters stationed around the perimeter and in the lane. One drill, involving three players at a time, requires each to run the length of the court, make a shot and return to the opposite baseline within 10 seconds. A similar drill, which includes an additional sprint to midcourt and back, must be completed within 17 seconds. As do other top women’s teams, UConn also trains against male players who are not of varsity caliber but who might have had college careers at smaller programs. And there is much less stopping for instruction than when Auriemma, 63, was a younger coach. He now prefers continuous movement, comparing his practices to preparing a car for racing. “We’re going to push this car to the limit so that when race day comes, we know what the limit is,” he said. “We do that every day. ” In the drill UConn calls Kansas, five players run the length of the court four times, rehearsing plays and fast breaks, and when they are winded, they conclude the exercise against a live defense. The drill can be repeated for 15 or 20 minutes. The   drill is a      exercise that lasts for five minutes as players rotate in and out. Afterward, the team runs from sideline to sideline for 30 or 60 seconds and immediately proceeds to a shooting drill called “35,” where the ball is not allowed to touch the court. “We do things to get us tired, and then when we get tired, we do things that require us to be mentally smart,” said Kia Nurse, a junior guard who has hit a remarkable 15 of 19   attempts in this N. C. A. A. tournament. Compared to practice, Nurse said, “The game is much easier. ” As the fourth quarter begins, she added: “That’s when your   kicks in that we’re not tired. The other team might give up, but there’s no chance that we are. ” Ideally, Auriemma would use eight players in his regular rotation, to keep his team operating efficiently and his stars satisfied with their playing time. A pet saying of his, attributed to Red Auerbach, the legendary Boston Celtics coach, is, “If you can’t win with eight, you can’t win with 88. ” For various reasons, including an N. C. A. A. rule that has required two transfers to sit out this season before becoming eligible, the current UConn team has only seven players whom Auriemma trusts to play regularly. Several began fall practice recovering from injury or surgery. None had been asked until this season to regularly make decisive plays at critical moments. So proper fitness has become even more urgent. Chris Dailey, Auriemma’s top assistant coach for three decades, said the Huskies once tended to lift weights in the preseason and stop when the regular season began. Now, the players lift at least twice a week through the season to build or maintain strength. At this time of year, given the inevitable wear and tear after   games, weight training shifts from a focus on squats to dead lifts, using a chassislike device called a trap bar, to ease the stress on the players’ backs. “That’s why we always look so good at the end, because we’re still getting stronger, or at least maintaining, where other teams are not lifting, possibly, or they’re backing off because they want to stay fresh for the tournament,” said Kimball, the strength and conditioning coach. Because UConn’s season regularly extends to the Final Four in April, Kimball said, “I can’t detrain them the whole month of March. ” Twice a day, at breakfast and dinner, players are required to answer a brief questionnaire on an iPad. How much did you sleep? Are you sore? Where? Did you eat lunch? How difficult was practice? Are you fatigued? Meals are designed by Kimball and catered so that she can make sure players are getting the right nutrients. An hour before each game, players drink a shake with   carbohydrates it is designed to bolster their energy and stabilize   levels. For recovery after weight training, Kimball is a proponent of tart cherry juice to help reduce joint and muscle pain. She is also a massage therapist, which gives her additional interactions with players, and more chances to gauge their fitness. “All this sports science is going on, but a lot of what we do is art,” Kimball said. “It comes from basically communicating with players. I see them multiple times a day. ‘Hey, how are you doing? You feel good? Not so good?’ It’s just a lot of communication, a lot of trust. ” For training in the   and preseason, Kimball also has devised a diverse set of workouts: sprints using weighted sleds, spin classes, yoga and pool exercises that include running, plyometrics and relay races. At some point, Kimball wants to incorporate GPS technology, she said, but she noted that it “doesn’t measure heart and intensity and passion to win. ” “It doesn’t measure,” she said, “that these girls might want it more than the other guys. ”'"}, "time": 1742561664.6434577}