{"duration": 0.06890368461608887, "input_args": {"text": "'An influential French blogger has come in for heavy criticism after thousands of antisemitic, threatening and homophobic tweets he published under a pseudonym resurfaced over the weekend, sparking fierce debate. [The tweets included threats against Front National leader Marine Le Pen, who he threatened to kill, but their author Medhi Meklat, 24, and his supporters have shrugged them off as a joke.  “I am going to slit your throat Muslim style” read the tweet threatening Le Pen. Another called for “Hitler to kill all the Jews” while a third said he wanted to “rape” former Charlie Hebdo    Charb, one of the victims of the January 2015 terror attacks, with a “Laguiole knife”. The tweets were published under the pseudonym ‘Marcelin Deschamps’ described by Meklat as a “shameful” “fictional character” whose thoughts were “quite the opposite” of his own. ” But they remained on the account after Meklat switched it to his name in 2015. This weekend they were outed by a fellow Twitter user who was outraged after seeing Meklat on TV promoting his new book, Le Monde has reported. On Saturday Meklat cleaned the account, deleting around 50, 000 tweets spanning back over a number of years to leave just 503 remaining. He also used the platform to issue an apology, writing “I’m sorry if these tweets shocked some of you. they are obsolete” adding “through Marcelin Deschamps, I was questioning the notion of excess and provocation. ” But his claims have not convinced everyone. The   secularist organisation Printemps Republicain [Republican Spring] have slammed the tweets as “serious” and “within the scope of the law”. They have accused the media of bearing some responsibility for the tweets, having “promoted” and “praised” Meklat. Had he been a member of France’s National Front, they said, Meklat “would have been instantly and quite rightly pilloried by the same media, and would certainly have found himself in court” they added in a statement. And they dismissed claims that Meklat, under the pseudonym Deschamps, was acting satirically in the same vein as the provocative magazine Charlie Hebdo arguing that Meklat had “only attacked certain categories of people [  …    ] Charlie Hebdo attacks everyone. ” Born in the notorious Paris suburb of    where riots have recently been raging, Meklat gained prominence through his writing for the Bondy Blog, a   blog set up following the 2005 Paris riots and financed by George Soros’ Open Society Foundation. Lauded as the authentic voice of France’s migrant communities, Meklat has capitalised on his media exposure to escape the banlieues, spending summers aboard yatchs in Los Angeles, and networking with esteemed institutions such as the Cartier Foundation to work on joint projects.  '"}, "time": 1742564219.5150847}