{"duration": 0.13462090492248535, "input_args": {"text": "'Watch out readers of Tolstoy and Dostoyevsky, since the mere familiarity with Russian authors is now sufficient to have a person branded as a Russian conspirator by mainstream media. [In the latest episode in extreme fake news, the foundering Newsweek Magazine has concocted an entire web of Russian connections around Trump’s chief strategist Stephen K. Bannon simply because Bannon knows something about Russian politics and literature.  While acknowledging that Steve Bannon, “hasn’t been implicated in any of the ongoing probes” into “murky connections” with Russian hackers and spies, and while further noting that Bannon “isn’t under investigation by the FBI for possible collusion with the Kremlin,” Newsweek writer Owen Matthews insists that something even more nefarious is going on between Bannon and the Kremlin. “But Bannon’s ties to Russia are ideological,” Matthews proclaims, “and therefore, arguably, they’ve had a more profound impact on White House policy with Moscow. ” Hitting a new low in fake news, Newsweek doesn’t even bother citing “unnamed sources” in relating its imaginary version of White House intrigue, but simply puts forward unsourced allegations that “Bannon was booted off Trump’s National Security Council in a White House coup” that was partly about “whether to appease a resurgent Kremlin or confront it. ” In his rambling piece, titled “Alexander Dugin and Steve Bannon’s Ideological Ties to Vladimir Putin’s Russia,” Matthews makes the verifiably erroneous claim that Bannon “has praised not only Putin but also a brand of Russian mystical conservative nationalism known as Eurasianism. ” Matthews does not explain to readers how Bannon’s characterization of Putin as a “kleptocrat” that Americans have to be “on guard of” can be considered praise. Nor does Newsweek inform us how Bannon’s mere mention that Putin’s belief system is based on Eurasianism should be construed as anything other than analysis, and has nothing to do with “praise. ” Still, in his magnificent house of cards, Matthews imagines that “Bannon and the  ’s admiration for Putin has come into direct conflict with the White House’s new policies. ” Not content with this sophomoric application of guilt by association, Matthews goes further still, suggesting that the slogan “America first” somehow relates to the worldview of Russian ideologue Alexander Dugin, whose philosophy “glorifies the Russian Empire. ” This is like saying that Charles de Gaulle must have been in cahoots with Cambodian dictator Pol Pot because the two were nationalists. Despite no   ties between Bannon and Dugin, Matthews alleges that they “have common cause in the idea that global elites have conspired against ordinary people —  and the old order must be overthrown. ” Bannon “seems to admire Dugin,” Matthews proposes, a theory for which he adduces no evidence, evidently springing from his overly fertile imagination. At best, Matthews sees common threads running through Bannon and Dugin’s speeches and concludes that they must somehow be colluding or at very least admire one another. Since Bannon believes that “individual sovereignty of a country is a good thing,” Matthews suggests, he must have Russian ties, because this is “precisely what Putin’s Kremlin is promoting as it backs anti —  European Union candidates from Hungary to France. ” By this strained logic, anyone who believes that national sovereignty is a positive value must therefore be a supporter of Putin’s Kremlin. After saying literally nothing of substance in his exhaustingly   article, Matthews arrives at the ridiculous conclusion that the “ideological honeymoon” between Trump and Bannon is over. “The only question now is whether Bannon can survive the divorce. ” Truth be told, Owen Matthews and Newsweek are not completely to blame for their exercise in groundless  . They are following the example of an equally fatuous story published by the New York Times last February. Remarkably, the Times dedicated an entire article to Steve Bannon’s familiarity with the writings of Italian philosopher Julius Evola “who inspired Fascists,” and therefore must somehow share his worldview. In the eyes of the New York Times, literacy has now become a crime. “The fact that Bannon even knows Evola is significant,” the article eerily reports, citing Mark Sedgwick, a British intellectual teaching in Denmark. While admitting that the entire connection amounted to “a passing reference by Mr. Bannon to an esoteric Italian philosopher,” somehow the Times saw fit to produce a   essay in a desperate effort to tease out a dark association between the two men. Nowhere but in the discredited mainstream media could such   be seriously proposed as anything remotely akin to true journalism. Reporting on the news is being systematically replaced by news fabrication. Apparently, propaganda vehicles like Newsweek and the New York Times have reached the conclusion that their readers are so ideologically driven that facts no longer matter at all. Any story —  however baseless and absurd —  is worth publishing as long as it advances the narrative that   want to believe. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742563667.1938436}