{"duration": 0.02435898780822754, "input_args": {"text": "'In the state of Chihuahua in Mexico, an eatery is churning out Donald Trump tacos. They’re made with a lot of tongue, a dash of pig snout and just a little bit of cow brain. Masks of Mr. Trump’s face, topped by tufts of artificial blond hair, are rolling off the lines at a factory in Cuernavaca  —   a recent batch numbered 10, 000. At the town of Otumba’s annual May Day celebration, 40, 000 visitors were treated to a donkey dressed as him. This is Mexico’s return volley in its informal war of words with Mr. Trump, the presumptive Republican presidential nominee, who fired the opening salvo the day he began his campaign, calling Mexican immigrants “rapists. ” Where Mr. Trump brought bellicosity, many in Mexico have responded with humor. As the campaign in the United States grinds on, south of the border you can buy Trump piñatas, watch the candidate be skewered in a satirical play, throw shoes at him in a video game, or purchase a special version of the classic    game balero, with Mr. Trump as the cup (you can guess where the stick goes). There are too many cartoons to count. Dámaso Morales Ramírez, a political science professor at the National Autonomous University of Mexico, said Mr. Trump had helped stir up feelings of Mexican nationalism as “people have seized their traditions and popular expressions to defend themselves. ” “What a Mexican says through caricatures is, many times, what they wouldn’t dare say out loud,” he said. “It’s a Mexican way of expressing anger. And expressing something they don’t like. ” Mr. Ramírez pointed to a new word, Trumpear, a play on the Spanish verb trompear, which means “to hit” or “to punch. ” The exact definition of the neologism is still being debated. A Mexican reporter suggested on Twitter that it meant “to hit, to vilify, to polarize, to revile, to terrorize as an electoral strategy. ” An academic defined it as “the act and effect of proposing stupid things that are impossible to realize. ” A technology businessman wrote that it meant “to do the ridiculous and then contradict yourself afterwards. ”'"}, "time": 1742628546.1784384}