{"duration": 0.03481459617614746, "input_args": {"text": "'Christopher Manion https://www.lewrockwell.com/lrc-blog/typical-fbi-swaggering-far-away-resonates-lies-lies-lies-dc/ \\nThe good news from the Bundy trial includes a mention of the Orwellian tactics they use on law-abiding Americans – but won’t use on Hillary. \\nAlmost 25 years ago I was at my cabin in northern Idaho on Gold Ridge, one ridge south of Ruby Ridge. \\nWhen I arrived a neighbor told me that the FBI was “looking for a right-winger hiding out on a ridge north of town.” \\nUh-oh. Should I turn myself in? \\nWell, Ruby Ridge: that’s where FBI’s infamous legal murderer Lon Horiuchi shot and killed Vicki Weaver while she was holding her infant daughter Elisheba – and I got there during the FBI “operation.” \\nWe all know how that intentional killing went down (Horiuchi shot her at a range of some 200 yards; a trained sniper, he could have hit her at 1000). \\nMy neighbors in Idaho demanded Horiuchi be prosecuted. Idaho tried but the feds pulled the case into their compliant courts and decided that Horiuchi was “just following orders.” (He’s from around here and I’ve had to be near him in church – yes, he goes to church – a couple of times. Had he been a Nazi prison guard, just following orders, he’d have hanged long ago…. I was tempted to ask him if that kill shot was really unintentional …. but I digress). \\nWhat really bugged me was the FBI army that invaded nearby Sandpoint. They were everywhere – boozing, swaggering, and bragging: “We’re gonna get him on my shift!” one lout shouted in a restaurant, to the horror of the locals who worked there (Sandpoint residents stayed home during those dismal days, hoping to avoid the determined killers…. a harbinger of dark days and occupations to come). The waitresses had to walk on eggshells (Idahoans love their guns and are pretty good at using them – something a gal doesn’t want to mention to a heavily-armed drunken boor far from home.) \\nIdaho’s senior senator at the time, Steve Symms, had it right. “We have the election box and the jury box. If they don’t work, we have the cartridge box.” \\nThis time the jury box worked. 11:36 am on October 28, 2016'"}, "time": 1742628605.6840093}