{"duration": 0.08116745948791504, "input_args": {"text": "'Sunday night’s Writer’s Guild of America awards show turned into a   exercise in     as Hollywood’s top writers repeatedly skewered the president during presentations and acceptance speeches.[   Patton Oswalt took on hosting duties for the Los   ceremony and began the night by introducing his event security, two men dressed as “soldiers from armed forces of the Russian Federation. ”  “People here tonight are angry about two things  —   that Deadpool is nominated for Best Screenplay and that Trump is President,” Oswalt joked. “Donald Trump, I want to be very careful about making jokes about. I don’t want to be kicked to death tonight by James Woods,” at which point the conservative actor hopped onstage, snatched off Oswalt’s shoe, and chided him: “This is an awards show, get some shoes, Jesus. ” The impromptu bit was not scripted, Oswalt assured his social media followers.  Regaining control of the show, Oswalt continued: “I feel bad for Trump. Here’s what happened: They had the [White House] Correspondents’ Dinner, Obama went up and made fun of Donald, and Donald said, ‘I’m taking his job. ’” “Now he’s sitting there saying: ‘This job sucks! My life before this was amazing! ’” he added. “Donald Trump taking Obama’s job would be like if the head of linguistics at Rutgers made fun of David Lee Roth   …     and he said, ‘I’m the head of linguistics at Rutgers. Bring on the hookers and cocaine! ’” Later, Chelsea Handler took her own shot at Trump by ridiculing his claim that millions of people may have illegally voted in the 2016 general election, though the talk show host’s jokes didn’t appear to land with the audience. “If you win this award tonight I want everybody to remember not to get a big head because there are millions of illegal voters in California. Not to mention the ones in Massachusetts who took a bus and voted in New Hampshire,” Handler joked.  Screenwriter Aaron Sorkin, who was awarded the Paddy Chayefsky Laurel Award for Television Writing Achievement, went on a fiery   tirade during his acceptance speech. The West Wing creator condemned Trump as being “out of touch” and urged the room full of writers to combat the administration by writing stories that help heal the country. While accepting the WGA West’s Laurel Award, director Oliver Stone broke from the night’s   bias and instead bashed both major political parties. “It’s fashionable now to take shots at Republicans and Trump and all that and avoid the Obamas and Clintons,” Stone said, according to Deadline. “But remember this: In the 13 wars we’ve started over the last 30 years and the 14 trillion dollars we’ve spent and the hundreds of thousands of lives that have perished from this Earth, remember that it wasn’t one leader but a system  —   both Republican and Democrat. ” Introducing Stone was actor and rare Hollywood conservative James Woods. “So my publicists says ‘Whatever you do don’t talk politics.’ I say, ‘Ok.’ And I show up and 15 minutes later I’m Darth Vader,” Woods joked.  Back in New York at the WGA Awards East, which were taking place simultaneously, host Lewis Black also took shots at Trump. “We’re living at the intersection of satire and reality,” Black joked.   Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742561776.3657627}