{"duration": 0.10471987724304199, "input_args": {"text": "'JENNINGS, La.  —   The air inside the Jefferson Davis Parish jail was hot and musty. Prisoners, often awakened by the morning heat, hoped for cooling rain after nightfall. And ice, one inmate recalled, brought fleeting relief in the cell she called a “sweatbox. ” Even though summer temperatures routinely roar past 100 degrees here, the jail, like scores of other jails and prisons across the country, has no  . “It’s hot,” Heidi Bourque, who was locked up this month for theft, said of the jail as she sat in her home, where the glowing red digits of the living room thermostat showed the temperature as a chilling 62. “It’s miserable. ” Her complaints are unlikely to move local residents, who approved funding to build a new jail after local leaders promised two years ago that it would not pamper inmates with  . But they speak to a broader debate about the threshold for when extreme temperatures become cruel and unusual punishment. Judges from Arizona to Mississippi to Wisconsin have declared over the years that the Eighth Amendment to the Constitution forbids incarceration in decidedly hot or cold temperatures. Still, prison reform activists encounter deep resistance in their quest to cool the nation’s cellblocks. “It’s almost impossible for courts to deny the constitutional violation because extreme heat undoubtedly exposes individuals to substantial risk of serious harm,” said Mercedes Montagnes, a lawyer for three inmates with health issues who challenged conditions on Louisiana’s death row. “Now what we’re grappling with is the remedy. ” Officials offer a range of justifications for the absence of   and for their reliance on cold showers, plentiful liquids and fans to help prisoners manage in the heat. Some contend that cooling systems are prohibitively expensive to install, particularly in older facilities. In places like Louisiana and Texas, sweltering states where elected officials cherish    credentials, it is politically poisonous to be perceived as coddling prisoners. And many officials simply say that temperatures are not anywhere near as dire as prisoners and their lawyers claim. “For the first 20 years of my life, I lived in a house with no ” said Jim Willett, the director of the Texas Prison Museum and a former warden at the state’s death house. “I just have a hard time sympathizing with anybody over  . ” The Louisiana Department of Corrections declined to comment, citing the lawsuit by Ms. Montagnes’s clients, who said that they had at times chosen to sleep “on the hard floor, in spite of the risk of bites from fire ants, because the floor is slightly cooler than their beds. ” A spokesman for the Texas Department of Criminal Justice, which is facing an array of lawsuits over the issue of jail temperatures, including a   case, said in a statement that “the   of staff and offenders is a top priority for the agency and we remain committed to making sure that both are safe during the extreme heat. ” The spokesman, Jason Clark, said that 30 of his agency’s 109 facilities are fully   but he asserted that retrofitting all the department’s other prisons would cost hundreds of millions of dollars. The disputes surrounding the climate of modern incarceration can be partly traced to 1981, when the Supreme Court concluded that “the Constitution does not mandate comfortable prisons. ” About 35 years later, states, counties and cities are interpreting the court’s words in their own ways. In Texas, state regulations require that temperatures in county jails “shall be reasonably maintained between 65 degrees Fahrenheit and 85 degrees Fahrenheit in all occupied areas. ” But that standard does not apply to state prisons. In Louisiana, the placement of a city or parish border can dictate the relative comfort of a night in a local lockup. Pretrial inmates here in Jefferson Davis Parish, a rural area of about 31, 000 people where the heat index on a recent afternoon hit 106 degrees, spend their days and nights in the small jail on the third floor of the courthouse. There are fans, but no  . “We don’t want to make it real comfortable for them because we don’t want them to want to come back,” Christopher Ivey, the chief sheriff’s deputy, said in his   office two floors beneath the jail. “We try to get it and keep it at a level that it’s comfortable enough that they can survive. ” Mr. Ivey, who said no parish inmate had suffered a   illness since the sheriff took office in 2012, said he believed the jail’s temperature never exceeded 80 degrees. But a jailer who dropped by Mr. Ivey’s office suggested that temperatures regularly reached the  . “You don’t leave there not moist,” Mr. Ivey acknowledged. Parish officials, who have not faced a court challenge about jail temperatures, did not agree to requests for a tour of the facility or interviews with current inmates. But after her release, Ms. Bourque, 25, described an environment where inmates found little relief. “It’s hot as hell,” she said. “The church ladies come over there, and I told her that. And she was like, ‘No, I believe hell is hotter.’ And I was like, ‘It’s just an expression. It’s hot as hell. ’” Inmates, lawyers and doctors described similar conditions inside other jails across the South, and some said that temperatures endangered the lives of prisoners with health problems. “Once these buildings heat up in the summertime, they never really do ever cool back down again,” Keith M. Cole, a plaintiff in the Texas   case, said at the Navasota prison where he is serving a life sentence for murder and is being treated for heart disease, diabetes and hypertension. “  to me wouldn’t be a comfort. It’s a necessity  —   it’s a medical necessity. ” Mr. Cole, 62, said that he understood public skepticism of   for prisoners, and that he might have even embraced such an opinion before he was sentenced in 1995. But in an interview, he said, “This isn’t about comfort. This is about life or death. ” Dressed in the plain white uniform of a Texas inmate, he spoke for nearly an hour in the prison’s   visitation center. “This is beautiful,” he said. “This is paradise right here. You couldn’t ask for anything better than this. ” The state said that adding   at Mr. Cole’s prison would cost of more than $22 million, with about $478, 000 in annual operating costs. Many of the pending cases could take years to resolve. A federal judge in Baton Rouge, La. ruled in Ms. Montagnes’s favor in 2013, but lawyers for the state and the prisoners are still haggling over fixes after an appeals court’s ruling. One proposed solution, detailed in a court filing this month, is what officials described as a “Cajun cooler,” which both sides said “essentially consists of a combination of an ice chest, a fan and a duct that emits cool air. ” And as the court battles continue, both sides question why the issue has become such a protracted, expensive battle. “In the South, almost everybody has ” said Jeffrey S. Edwards, a lawyer for Mr. Cole. “This isn’t a luxury anymore. Almost everyone has it, except for these inmates. ” In Jefferson Davis Parish and elsewhere, plenty of people wonder why climate control is even before the courts. Prisoners are serving punishments and do not merit, as people here repeatedly put it, “a country club jail. ” (Such worries are common: The Florida Department of Corrections felt compelled to list “prisons are  ” at the beginning on a list of “misconceptions. ”) But since the May 2014 vote here, law enforcement and civic leaders in Jefferson Davis Parish received what they regarded as dispiriting news: Some electronic features of the new jail will need to be kept cool to remain operational. So the prisoners will get   after all.'"}, "time": 1742563293.8697948}