{"duration": 0.04259181022644043, "input_args": {"text": "'North Korea’s foreign ministry warned Monday that its government is prepared to go to war with the United States, following remarks from Secretary of State Rex Tillerson in which he said the Trump administration was prepared for a military engagement with the communist dictatorship should they strike U. S. allies. [“The U. S. should face up to the situation of the world with its eyes wide open. The DPRK has the will and capability to fully respond to any war the U. S. would like to ignite,” the   Korean Central News Agency quoted a foreign ministry spokesman as saying, according to the South Korean newswire service Yonhap.  “If the   . S.  thought that they would frighten the DPRK, they would soon know that their method would not work on the latter,” the spokesman continued. “The world will soon witness what eventful significance the great victory won by the DPRK in the recent ground jet test of     engine will carry. ” Addressing Secretary Tillerson directly, the spokesman said he was “repeating what Obama touted much sanctions [sic] until he left the White House. What matters is that neither Obama nor Tillerson knows the reason why the DPRK had to have access to nuclear weapons and why it is dynamically bolstering up the nuclear force. ” The North Korean official appeared to be responding to Tillerson’s statements in South Korea on Friday where he told reporters that the Trump administration would not back down in protecting its allies in Seoul and Tokyo. “The policy of strategic patience has ended. We are exploring a new range of diplomatic, security and economic measures. All options are on the table,” Tillerson said, clarifying to one reporter that these options did include a military last resort. Tillerson also repeated on multiple stops during his Asia trip that he hoped to see North Korea’s closest ally, China, take steps to ensure that Pyongyang abides by United Nations sanctions. In China, Tillerson emphasized issues on which the two nations agreed, though reports suggest that he privately urged Beijing to cut economic ties with North Korea. Pyongyang appears to have received the message. In addition to the foreign ministry’s response, the Rodong Sinmun, a state propaganda newspaper, published a column Monday arguing that North Korea needs nuclear weapons because the United States will invade it if it does not threaten a nuclear attack. “Our army and people will continuously bolster up our nuclear deterrent for   down the road under the conditions that   U. S. government officials adamantly stick to their hostile policy toward us,” the column read. In addition to public statements, North Korea tested a new rocket engine model on Sunday at the orders of dictator Kim  . The Rodong reported that Kim applauded the test as a success: He noted that the success made in the current test marked a great event of historic significance as it declared a new birth of the   rocket industry which has radically turned into a     industry both in name and in reality by completely doing away with dogmatism, conservatism and formalism left in the field of rocket industry and the dependence on the technology of other countries. Kim said of the test, “the whole world will soon witness what eventful significance the great victory won today carries. ” The rocket engine, experts presume, is meant to fuel the launch of intercontinental ballistic missiles (ICBMs). North Korea has been developing nuclear technology in the hopes of creating a nuclear weapon with enough reach to successfully strike U. S. soil. Reuters corroborated the claims in North Korean media that the rocket engine test was an advance in the nation’s weapons technology, citing the South Korean defense ministry.'"}, "time": 1742562454.2983544}