{"duration": 0.13748764991760254, "input_args": {"text": "'Good morning.  We’re trying something new for our readers in Asia and Australia: a morning briefing to   your day.  What do you like? What do you want to see here? Email us with your feedback at asiabriefing@nytimes. com. Here’s what you need to know: • Voting begins in a few hours in the United States. Polls show a tight race nationally and in swing states, though early voting data bodes well for Hillary Clinton. We boarded Donald J. Trump’s plane for an inside look at his last stand. He’s betting big on less educated white voters. And even if he loses, his campaign’s legacy will live on, in the form of emboldened extremists. Here’s our live coverage of the last hours of the race. We’re offering unlimited access to NYTimes. com for the election, from now through Thursday morning. _____ • Hong Kong is bracing for street protests and tough questions about the independence of its courts after China barred two   city politicians from taking their seats in the legislature. The move could open an era in which Hong Kong’s elected officials can be punished if they fail to meet a vague standard of political loyalty to the central government. _____ • China’s new cybersecurity law gives the authorities far greater control over the internet as of next summer. Its requirements  —   including real names for messaging services and security checks in the finance and communication industries  —   are raising concerns about freedom of speech and barriers to foreign businesses. _____ • Australia will not legalize   marriage anytime soon. A bill that would have allowed for a plebiscite on the issue was shot down in Parliament over the $140 million cost and concerns that it would become a platform for hate speech. Polls show around 70 percent of Australians want marriage equality, and many supporters of legalization want action in Parliament, not a nonbinding plebiscite. _____ • Heavy smog continues to choke New Delhi, where schools are closed and emergency measures are in place to improve air quality that is equivalent to smoking two packs of cigarettes a day. Asked where she lived, a New Delhi resident said, “a gas chamber. ” _____ • The Philippine Supreme Court is expected to rule on whether President Rodrigo Duterte may transfer the remains of Ferdinand E. Marcos, the country’s former dictator, to a heroes’ cemetery in Manila. The justices have another Duterte case on the docket: a senator who has often been critical of him has asked the court for an order to stop him from retaliating with verbal attacks, which have included speeches in which he called her a “dirty woman” and discussed her private life. • Warner Bros. a division of Time Warner, is often in the shadow of its sibling HBO. Kevin Tsujihara, above right, the film studio’s chief executive, wants to change all that. He is on pace to deliver record operating profit and may have a hit with the new J. K. Rowling film, “Fantastic Beasts and Where to Find Them. ” • China will release its balance of trade figures  —   how its exports and imports compare  —   for October, offering another data point for the health of the country’s economy. • The Sotheby’s auction house reported a loss of $54 million in the third quarter, citing a slowdown in the art market and the purchase of an advisory business. • U. S. markets surged on election news, and the dollar was up. Here’s a snapshot of global markets. • The Nicaraguan president, Daniel Ortega, was   to a third term in an election that many disaffected voters simply ignored. [The Wall Street Journal] • A German sailing couple, who were seized and held for ransom eight years ago by Somali pirates, were reported to have been abducted again in dangerous waters near the Philippines. [The New York Times] • Japanese government investigators raided the offices of a national advertising giant, Dentsu, after the death of a young woman it employed was attributed to overwork. [The Asahi Shimbun] • China’s   a sleek   fighter, demonstrates the country’s growing power as a military force and an arms maker. [Foreign Policy] • The scandal engulfing South Korea’s presidency was uncovered because of a card game in Macau. [The Washington Post] • Mikheil Saakashvili, a former president of Georgia, quit his post in Ukraine’s government and accused the Ukrainian president of blocking efforts to fight corruption. [The New York Times] • The British prime minister, Theresa May, offered improved visa arrangements to India in trade talks meant to bolster ties ahead of the “Brexit. ” [The New York Times] • Janet Reno, the first woman to serve as U. S. attorney general, died at age 78. She played a major role in some of the most divisive episodes of the presidency of Bill Clinton. • The world’s youngest chess grandmaster,    Sergey Karjakin of Russia, is about to challenge the reigning world champion in New York. • A new study finds that whale songs need to be felt as well as heard. The sounds are accompanied by vibrations that course hundreds if not thousands of feet through the water, possibly enhancing    communication. • A Chinese Paralympic champion was nowhere to be seen at the finish of the New York City Marathon. Turned out her wheelchair had blown a tire at Mile 13  —   so three people, aided by a translation app, stepped in to help. “It really was a cool New York moment,” one said. Britons have been saying a lot of goodbyes in the past few months. They voted to leave the European Union. The prime minister resigned. The leading figures of the “Brexit” campaign departed the government. And through all this, the news media outside Britain found one expression that worked in multiple languages: “English leave. ” It’s a play on “taking French leave,” which the British use to mean departing abruptly  —   supposedly a reference to the French manner of leaving a social function without saying goodbye. Such nationalist expressions abounded around the 19th century, when rival nations in a disunited Europe settled scores in wars, revolutions and slights. But the Germans also pick on the Poles for evaporating from parties, which the British call an “Irish goodbye. ” (The German weekly “Die Zeit” even graphed the zingers and  .) Of course, the slaps don’t end with departures. Germans can mention, though rarely, “English shopping”  —   that is, theft, as in the colonial past. And references to historic battles get drawn into the mix, too. So the French could say, depending on how Brexit works out, “c’est un vrai coup de Trafalgar,” a true Trafalgar blow, reminiscent of their decisive defeat by the English in 1805. Palko Karasz contributed reporting. _____ Photographs may appear out of order for some readers. Accessing this version of the briefing should help.  Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742564601.0996008}