{"duration": 0.4366016387939453, "input_args": {"text": "'Over the years, William R. Ponsoldt had earned tens of millions of dollars building a string of successful companies. He had renovated apartment buildings in the New York City area. Bred Arabian horses. Run a yacht club in the Bahamas, a rock quarry in Michigan, an   company in Canada, even a   hedge fund. Now, as he neared retirement, Mr. Ponsoldt, of Jensen Beach, Fla. had a special request for Mossack Fonseca, a   law firm well placed in the world of offshore finance: How could he confidentially shift his money into overseas bank accounts and use them to buy real estate and move funds to his children? “He is the manager of one of the richest hedge funds in the world,” a lawyer at Mossack Fonseca wrote when the firm was introduced to Mr. Ponsoldt in 2004. “Primary objective is to maintain the utmost confidentiality and ideally to open bank accounts without disclosing his name as a private person. ” In summary, the firm explained: “He needs asset protection schemes, which we are trying to sell him. ” Thus began a relationship that would last at least through 2015 as Mossack Fonseca managed eight shell companies and a foundation on the family’s behalf, moving at least $134 million through seven banks in six countries  —   little of which could be traced directly to Mr. Ponsoldt or his children. These transactions and others like them for a stable of wealthy clients from the United States are outlined in extraordinary detail in the trove of internal Mossack Fonseca documents known as the Panama Papers. The materials were obtained by the German newspaper Süddeutsche Zeitung and the International Consortium of Investigative Journalists, and have now been shared with The New York Times. In recent weeks, the papers’ revelations about Mossack Fonseca’s international clientele have shaken the financial world. The Times’s examination of the files found that Mossack Fonseca also had at least 2, 400 United   clients over the past decade, and set up at least 2, 800 companies on their behalf in the British Virgin Islands, Panama, the Seychelles and other jurisdictions that specialize in helping hide wealth. Many of these transactions were legal there are legitimate reasons to create offshore accounts, particularly when setting up a business overseas or buying real estate in a foreign country. But the documents  —   confidential emails, copies of passports, ledgers of bank transactions and even the various code names used to refer to clients  —   show that the firm did much more than simply create offshore shell companies and accounts. For many of its American clients, Mossack Fonseca offered a   guide of sorts on skirting or evading United States tax and financial disclosure laws. These included locating an individual from a “ ” jurisdiction to be the straw man owner of an offshore account, concealing the true American owner, or encouraging one client it knew was a United States resident to use his foreign passports to open accounts offshore, again to avoid scrutiny from regulators, the documents show. If the compliance department at one foreign bank contacted by Mossack Fonseca on behalf of its clients started to ask too many questions about who owned the account, the firm simply turned to other, less inquisitive banks. And even though the law firm said publicly that it would not work with clients convicted of crimes or whose financial activities raised “red flags,” several individuals in the United States with criminal records were able to turn to Mossack Fonseca to open new companies offshore, the documents show. Federal law allows United States citizens to transfer money overseas, but these foreign holdings must be declared to the Treasury Department, and any taxes on capital gains, interest or dividends must be paid  —   just as if the money had been invested domestically. Federal officials estimate that the government loses between $40 billion and $70 billion a year in unpaid taxes on offshore holdings. Experts in federal tax law, money laundering and offshore accounts  —   asked by The Times to examine certain documents or at least to identify legal issues raised by the money management techniques that Mossack Fonseca advocated  —   said the law firm at times had come up with creative, but apparently legal, strategies to save clients money. A common tactic: selling real estate as a shift of corporate assets, instead of as a piece of property subject to transfer taxes. While the experts were reluctant to declare that the law firm or its clients had broken any laws given that no charges have been filed, they said they were surprised at how explicitly Mossack Fonseca had offered advice that appeared carefully crafted to help its clients evade United States tax laws. “The more correspondence that you have between a U. S. person and a bank or law firm discussing tax issues and efforts at concealment, the stronger the government will see it as a potential case worth prosecuting,” said Kevin M. Downing, the lead Justice Department prosecutor in the UBS offshore banking and tax evasion cases, now at the Washington law firm Miller  Chevalier. Mossack Fonseca has said repeatedly in recent weeks that its lawyers and staff members have honored international tax and banking laws, and that it is the victim in this case of an illegal hacking attack. But presented with summaries of several cases by The Times, Mossack Fonseca did not try to explain its actions. It simply said that its standards had improved in recent years, as rules internationally had tightened. “Our significantly expanded compliance office today not only evaluates new client candidates, but also existing accounts, and especially those that were established prior to the new international regulatory regime coming into effect,” a spokeswoman said in a written statement, referring to a 2010 law passed by Congress. “It wasn’t always this way. ” The firm’s American client list does not appear to include the sort of   political figures who have emerged from reporting on the Panama Papers in many other countries around the world. But the services offered by Mossack Fonseca, with 500 employees in more than 30 offices worldwide, were in high demand by the rich and famous in the United States. In 2001, Sanford I. Weill, then the chief of Citigroup, set up an offshore account called April Fool for his yacht. Alfonso Soriano, a former Major League Baseball   player with the Yankees and other teams, had a Panamanian corporation created for him. John E. Akridge III, a leading real estate developer in Washington, flew to Panama to meet with Mossack Fonseca lawyers, who in 2011 created the Cyclops Family Foundation in Panama, along with a related bank account. A spokesman for Mr. Weill said the accounts were used for legitimate purposes, and “appropriate disclosures were filed. ” Mr. Akridge and Mr. Soriano did not respond to repeated requests for comment. For its best customers, like the Ponsoldts, who declined repeated requests to discuss their work with Mossack Fonseca, the firm’s ministrations went far beyond legal services and banking. It acted as a concierge for “all details regarding your properties and worldwide business affairs,” for example, helping the family confidentially purchase (and dispose of) luxury condominiums at resort destinations and even arranging repairs for a car stored at a vacation home and hiring a contractor to fix broken poolside tiles, the documents show. “You deserve the best Mr. Ponsoldt, and we will try to help you the most we can,” the firm explained in an email. The firm’s American clients often expressed disbelief at how much they could lighten their tax burden by using the techniques advocated by Mossack Fonseca. “At hearing that he can make nearly $8 million per year just on tax savings,” a client from Pennsylvania “was now wide awaken,” a Mossack Fonseca staff member wrote. “I could even detect sweats coming down from his forehead and his cheeks were beginning to blush with crimson excitement. Noticing his interest, I went in for the kill. ” In 2006, using a secret email account set up by Mossack Fonseca so his correspondence would not be traced by the authorities, a businessman from Washington State asked a common question among the firm’s potential American clients: “How does a US citizen legally get funds to Panama without the knowledge of the US government and how can those funds be profitably invested without the US government knowing about them?” The reply came from Ramsés Owens, then a partner who helped run the firm’s trust division, offering clients “effective solutions to enhance your privacy, protect your wealth. ” Mr. Owens laid out a basic menu of services: a package deal setting up an offshore company in what he promised would be a relatively cheap and quick transaction. “We have right now a special offer by which we create a Private   combination for a flat fee of US$4, 500. 00,” Mr. Owens said. “It includes Charter Documents, Regulations, nominee officers and directors, bank account and management of funds, provision of authorized signatories, neutral phone and fax numbers and mail forwarding services for both the private foundation and its underlying company. ” With this legal structure in place, Mr. Owens went on to explain, any money placed in these accounts would essentially go into a black hole. “If we create a Private Foundation and the underlying company for you, the funds become completely private (US cannot know) as soon as the funds are deposited under a bank account or investment account in the name of the underlying company or the private foundation,” he wrote. The benefits of such an arrangement were numerous, he added, detailing how the client could effectively evade United States tax laws while protecting himself  —   and the firm. “You can take the money in cash, you can do a bad investment you can purchase something and not receive anything (an expensive piano, an expensive software),” Mr. Owens wrote. “You can receive an invoice from Panama or any other location and that would justify some of the outgoing moneys. You can also declare everything to the tax administration. “Any decision you make, please be aware that you will have to sign a ‘disclaimer’ to us. We can only ‘suggest,’ but the final decision to take the money out of the country is fully yours, and under the professional opinion of someone in USA. ” This was the sort of menu sold to the Ponsoldt family  —   in a very big way. William Ponsoldt, now 74, had come to Mossack Fonseca with hundreds of millions of dollars in assets, the firm’s staff estimated in “due diligence” memos that also laid out how he had become so wealthy. “He has started off in the 70ties purchasing   apartment buildings in New York, in order to refurbish and sell them off,” noted one memo from 2007, shortly after the firm had started to handle the family’s investment accounts. “Having done this for a while he spread out to various businesses and his CV is the typical profile of a serial entrepreneur. ” The memo went on to list nine businesses he had created, taken over or helped run, including Glas Aire Industries Group, an automotive parts supplier Zeus Energy Resources, a Texas   company Regency Affiliates, which owned a Michigan rock mine and Pegasus Ranch, one of the country’s largest    operations. Few American clients, the records show, demanded and received as much attention as Mr. Ponsoldt and two of his children, Tracey and Christopher, each of whom was assigned a secret email account and a code name  —   “father,” “daughter” and “son. ” Mossack Fonseca’s “V. I. P. service” consisted of everything from securing lunch reservations at a popular French bistro in Panama City to pressing the government to make an exception and grant Mr. Ponsoldt and his wife Panamanian passports. Over the years, tens of millions of dollars flowed into a series of shell companies  —   Escutcheon Investment, with its money at the Banca Privada in the Pyrenees principality of Andorra Probity Investments, with deposits at Andbanc Grup Agricol, also in Andorra Royal Pacific Investments, with deposits at Balboa Securities in Panama and Valdano Investments Group, with deposits at Berenberg Bank in Switzerland, among others, the bank records and other documents show. Mossack Fonseca employees were named as the companies’ officers, avoiding whenever possible any link to the Ponsoldt family. The firm even asked a Hong Kong branch of Barclays, the international bank, to override its rules for proof of the   beneficial owners of the accounts. “This is a very special client of ours,” a Mossack Fonseca lawyer wrote, conceding that the firm had intentionally created such a maze of companies so it “leaves us in the position to legally argue that our client is NOT the owner of the structure. ” It was not clear if the bank complied. The most important part of this elaborate structure was an entity called the Edenstone Foundation. Panama has long specialized in creating unusual foundations like Edenstone that are neither subject to Panamanian taxes nor required to support charitable causes. They do, however, allow the investors who “contribute” their financing to shield themselves from legal claims in the United States. In secret meetings documented in the Panama Papers, Mossack Fonseca named the Ponsoldt family as the beneficiary, through the foundation, of the money placed in bank accounts around the world. Among the early requests: confidentially transfer $800, 000 from “father” to “son,” meaning moving the money to yet another offshore account  —   called LBFH of Panama  —   which Mossack Fonseca had set up on Christopher Ponsoldt’s behalf with bank accounts in Andorra and Panama. One motivation for Christopher Ponsoldt to stash money overseas in accounts not traceable to him: He owned a dirt racetrack in Florida, and he was concerned racers “may get hurt and might then try to sue him for damages,” the law firm notes on his case file said. “Please notify me when the money is deposited in American dollars,” Christopher Ponsoldt wrote to the law firm a few months after his father’s accounts had been set up and $800, 000 was in the process of being transferred to another offshore account Christopher Ponsoldt controlled via the firm. “I want to have U. S. dollars, Australian Dollars, Indian Real’s and some kind of China index, to be determined. ” Mossack Fonseca agreed to “prepare a service agreement” between two of the legal entities it managed for the family, to make it look as if there were an actual expenditure of money for a business purpose. “After receiving the money, we will explain to them the nature of this transaction without giving details of your name,” the firm explained to William Ponsoldt, regarding the Caribbean bank through which the money was moving to his son. “Please let us know if you agree with this and if you will instruct the relevant parties to execute the wire transfer. ” Federal law generally limits such   transfers between family members to $14, 000 a year. But for this transfer, described as a “  distribution,” the documents give no indication that any United States gift taxes were paid, as would most likely have been required, said Jack Blum, a lawyer and expert in international tax evasion who served for more than a decade as a consultant to the Internal Revenue Service. “This is one way in which people with a lot of money step away from being average,” Mr. Blum said after reviewing the documents. Christopher Ponsoldt declined to comment. “I am sorry, I can’t help you,” he said before hanging up. Tracey Ponsoldt Powers, William Ponsoldt’s daughter, approached the firm in October 2008 with an urgent request for help in secretly moving some of her family’s money to Panama and then into gold coins. She feared political developments at home. “I feel VERY unsettled with this election and how the media is censoring information and spinning the American Public to vote Obama,” she wrote to Mr. Owens at Mossack Fonseca. “It is so obvious to me, that they are setting us up with a Socialist  —   but most people can’t see it happening before their eyes! It’s like propaganda that is brainwashing Americans to forget the Principles of Hard Work, Ingenuity, Risk and Boundless Success!” Mr. Owens suggested shifting the money into a “charity” account, controlled by the firm on the family’s behalf, in increments of less than $100, 000, so it would not be detected. Separately, that same month, William Ponsoldt moved $100, 000 from a company Mossack Fonseca controlled on his behalf into the name of his daughter. This was confirmed in an email from Mossack Fonseca to the code name “daughter. ” “The USD 100. 000 is deposited as call Money with high liquidity at Berenberg Bank Schweiz, Zürich,” said the email, which added: “Your Father initiated this process as you know. We will treat you with the same esteem and conditions and service as the family is used to. ” The subsequent series of complicated transfers  —   money from the account would eventually be used by Mossack Fonseca in 2013 at Ms. Powers’s request to buy real estate  —   would be a challenge for American enforcement authorities, Mr. Blum said. “Simply by constructing all this in such a complex way, they make it extremely hard for enforcement officials to ever have resources to reconstruct what taxes should have been paid,” he said. “What this is all about is obscuring the trail. ” Ms. Powers did not respond to a series of calls and emails, and then declined to answer questions when reached on a cellphone. “I have no idea what you are talking about,” she said before hanging up. Across the United States, Mossack Fonseca picked up clients who had similarly urgent and delicate demands. For more than 30 years as the founder of Boston Capital Ventures, Harald Joachim von der Goltz has built a reputation as a savvy investor in emerging companies. What few know, however, is that over roughly that same span of time and with the help of Mossack Fonseca, Mr. von der Goltz has also come to command a vast offshore empire: interconnected corporations, foundations and bank accounts with about $70 million in assets, according to internal emails. A lawyer for Mr. von der Goltz said the beneficial owner of all of the trusts and accounts is Mr. von der Goltz’s    mother, who resides in Guatemala. One document also suggests that the tens of millions of dollars in the accounts originally came from businesses operated by Mr. von der Goltz’s father. But numerous other documents prepared by Mossack Fonseca and signed by Mr. von der Goltz list him as the founder, manager and “first beneficiary” of the foundation that controls most of the family’s wealth. Mr. von der Goltz also put assets from companies he helped operate into the accounts, documents show. Most important, Mossack Fonseca registered Mr. von der Goltz as a resident of Guatemala, which tax experts said could help him protect the family money from certain United States tax obligations. “MF Trust has registered Harald Joachim von der Goltz as a client of Guatemala. However, we know he lives in Miami and makes his residence for 5 months of the year in Boston,” Mr. Owens, the Mossack Fonseca partner, wrote in an email in 2009 to top executives at the firm. The firm recognized that claiming the Guatemala residency represented a risk, but considered it a risk worth taking, given Mr. von der Goltz’s importance to the firm. “My suggestion: Leave everything as it is with von der Goltz, i. e. stay and live this potential risk, we might prefer to send money orders and cashier’s checks, which have a slightly lower risk than bank transfers. It’s all well done, customer understands well and accepts it as is,” Mr. Owens wrote. “I agree with your suggestion on my part,” responded Ramón Fonseca, one of the firm’s founders. Money was frequently transferred from several of the offshore accounts to accounts in the United States to fund investments at Mr. von der Goltz’s firm, the documents show. A foundation paid for his daughter’s education, as well as his granddaughter’s high school tuition. In a 2008 email, Mr. von der Goltz’s   accountant asked executives at Mossack Fonseca to wire money from Mr. von der Goltz’s mother, Erika. “Erika would like to make a gift to Tica of $100, 000 for his birthday. She hadn’t given him anything,” the email said, providing an account for Mr. von der Goltz at Espírito Santo Bank in Miami. “Ohh, yes, I know ERIKA wants it to be done quickly, we will proceed,” Mr. Owens responded before confirming that the money should be moved as requested. Legal experts consulted by The Times said it was difficult to determine definitively if the arrangements related to Mr. von der Goltz violated United States laws. But they said such moves were commonly used by investors seeking to hide their assets and evade federal taxes. “There is reason to question if she was really directing that shift of money,” Mr. Blum said, referring to Mr. von der Goltz’s mother. In a statement, Mr. von der Goltz said the companies were established for legal purposes, and that both he and the companies were compliant with United States tax and reporting requirements. “There has never been any illegal activity associated with these companies,” the statement said. Other case files examined by The Times show how Mossack Fonseca may have turned a blind eye in the vetting process while helping Kjell Gunnar Finstad, a Texas resident, set up an oil company offshore in 2013. Mossack Fonseca has long maintained that it will not work for individuals with criminal records or whose conduct raises “red flags” during its   process. But the firm somehow either missed or overlooked Mr. Finstad’s past when it conducted a background search of potential directors for the new offshore oil company, OK Terra Energy, which was run out of Houston but registered in the British Virgin Islands. Three years earlier, Mr. Finstad, the company’s controlling partner and lead investor, had been convicted in Norway for various breaches of securities and accounting laws involving a company called Norex Group. The case was major news in Norway. The records examined by The Times show that Mossack Fonseca collected a copy of Mr. Finstad’s passport, and conducted a basic internet search and a cursory background check. But there is no mention of the fraud case, and no discussion of whether to proceed with setting up the new company, in light of Mr. Finstad’s involvement. Reached at his office in Texas and asked about the Panama Papers, Mr. Finstad said only, “I don’t want to talk about that. ” For another client, Mossack Fonseca offered a special service for a premium price. Marianna Olszewski, the New York   author of “Live It, Love It, Earn It: A Woman’s Guide to Financial Freedom,” wanted to shift $1 million held by HSBC in Guernsey to a new overseas account. The catch? She did not want her name to appear anywhere near the transaction. Mr. Owens, the Mossack Fonseca lawyer, again offered a solution. Mossack Fonseca would locate what he called a “natural person nominee” in a “ ” jurisdiction to stand in for Ms. Olszewski as the owner of the account. “The Natural Person Trustee is a service which is very sensitive,” Mr. Owens wrote. “We need to hire the Natural Person Nominee, pay him, make him sign lots of documents to cover us, make him sign resignations, make him get some proofs evidencing that he has the economic capacity to place such amount of moneys, letters of reference, proof of domicile, etc. etc. ” The process, he suggested, would cost her at least $17, 500. Ms. Olszewski approved the maneuver  —   only to see the firm, at one point, accidentally disclose her name to the banks involved. “Ramses, Please call me ASAP!! This is important! !!!” she wrote to Mr. Owens. “HSBC said someone said marianna olszewski is the principal   beneficary! Who has done this!! I need you to call me immediately and tell them hsbc that was a mistake! !!!! !!!!! This is not good and I asked you NOT to do this! this is why we have this structure. ” Mr. Owens sought to calm her down, saying that Mossack Fonseca could tell the bank that the natural person nominee actually controlled the account. “This can be solved,” he wrote. Mr. Owens did not tell his client the identity of the natural person nominee, saying simply, “We would appoint a UK citizen residing in Panama since 50 years ago, engineer, entrepreneur,” as they needed someone who would be expected to have such a large amount of money available to transfer. Twelve days later, Mr. Owens sent HSBC a copy of a passport for a man named Edmund James Ward. “Kindly please find hereto attached the due diligence documents of the beneficial owner,” said the email sent to HSBC, noting that “the documents duly correct. ” The $1 million from Ms. Olszewski was then transferred to the new accounts, with an assurance that she need not worry. “If for any reason something happens, please also bear in mind that Mossfon is covered by insurance policies for US$10 Million (per event),” Mr. Owens wrote. “We have never used our insurance policy to cover a ‘fraud,’ or something like this. ” The use of a   to hide the true ownership of an account is one of the remaining illegal ploys favored by Americans today as international banks, under pressure from the United States, demand proof of account ownership, said Jeffrey Neiman, a former federal prosecutor from Miami who specialized in criminal tax offenses, adding that he could not comment directly on this case. “The fact that a law firm was willing to do this legitimizes the process for their clients,” he said. Many of the client files  —   like those for Mr. Weill, the banker Mr. Soriano, the ballplayer and Mr. Akridge, the developer  —   contain little information on the purpose of the offshore accounts, or how they were used after they were set up, making it impossible, based on the records available, to assess whether they were used legitimately. But the experts who reviewed some of the documents related to the Ponsoldts, Mr. von der Goltz and Ms. Olszewski said that the firm itself seemed to realize it was taking risks. “They were not always sure themselves which side of the line they were on at any given moment,” said Ross S. Delston, a former federal banking regulator who now specializes in combating   efforts. “It is apparent that members of the firm were aware they were treading very close to the line. ” In fact, the files contain instances, beginning before the Panama Papers came to light, of Mossack Fonseca lawyers   their actions. (In recent weeks, the firm has shut down many of its operations in Nevada, as well as British locations in Jersey and the Isle of Man, and is closing the   division that served many of its United States clients.) In 2013, Mossack Fonseca advised Ms. Olszewski to seek outside counsel and consider reporting herself to the I. R. S. warning of possible “severe” repercussions if she did not. The warning came in the wake of a Justice Department investigation of the role that certain Swiss banks had played in helping United States citizens evade federal taxes. Records show that Mossack Fonseca had been paid at least $102, 000 over nine years to help Ms. Olszewski handle various transactions. Ms. Olszewski took the firm’s advice, and belatedly disclosed her accounts to the I. R. S. the documents show. And by 2014, she asked Mossack Fonseca to shut down her accounts and offshore entities, which collectively held at least $1. 7 million. “I’m in complete compliance with all my U. S. tax and reporting requirements,” Ms. Olszewski said in an emailed statement when The Times asked about the accounts. In a second statement, she said she had relied on the advice of legal counsel to establish a trust for her family while living abroad. “I am confident that I have acted properly,” she added, “and any insinuation otherwise is false. ” Reached by telephone in late May, Mr. Owens, who is no longer with the law firm, said only, “Regretfully, I cannot speak about individual clients or my time at Mossack Fonseca. ” Mossack Fonseca sent a series of similar and increasingly dire warnings to the Ponsoldts in 2013 and 2014, telling them that they had to provide a Swiss bank with documentation that they had paid all required United States taxes  —   or face possible investigation. “Neither your ex Trustees nor us would like to be involved into any measure the US Department of Justice might try to enforce,” the firm wrote. “In this regard, again we strongly urge you to take the necessary steps to avoid any negative consequences for you as well as us. ” The records examined by The Times give no indication whether the Ponsoldts complied, and family members would not say when asked. “I don’t know what you are talking about,” Christopher Ponsoldt said in a second brief conversation before he again hung up.'"}, "time": 1742563160.0344415}