{"duration": 0.08907198905944824, "input_args": {"text": "'AMATRICE, Italy  —   A strong earthquake struck a mountainous stretch of central Italy early Wednesday, killing at least 241 people, trapping scores under debris and setting off tremors that awakened residents in Rome, nearly 100 miles to the southwest. The earthquake, which had a preliminary magnitude of 6. 2, struck at 3:36 a. m. about 6. 5 miles southeast of the town of Norcia in the Umbria region, followed by about 200 aftershocks over the next several hours, including a 5.  tremor at 4:33 a. m. The authorities said the quake was comparable in intensity to one in 2009  in the Abruzzo region of central Italy that killed more than 300 people. Towns in three regions  —   Umbria, Lazio and Marche  —   were devastated by the quake, which could be felt as far away as Bologna in the north and Naples in the south. As of Wednesday, the deaths appeared to be concentrated in four communities: at least 86 in the towns of Amatrice and Accumoli, in Lazio, and at least 32 in Marche, in the village of Arquata del Tronto and the hamlet of Pescara del Tronto. On Thursday, the Italian Civil Protection Department said 241 people were confirmed dead, and hundreds more injured. Prime Minister Matteo Renzi, speaking Wednesday from Rieti, a city in Lazio near the epicenter, likened the affected communities to “a family that has been hit but won’t stop. ” He vowed that the government would quickly start to rebuild, noting widespread anger over the long delays in rebuilding after the 2009 quake. “Reconstruction is what will allow this community to live and to restart,” he said. Immacolata Postiglione, the head of the emergency unit for the Civil Protection Department, said on Wednesday that more than 1, 000 people were expected to spend the night in four camps being set up in the area. She added that an unknown number of tourists had not been fully accounted for. “The number of missing people is undefined at the moment,” she said. The mayor of Amatrice, Sergio Pirozzi, said that “half the town no longer exists,” adding that rescue teams were digging through the rubble, “hoping that most people were alive. ” The historic center of the town, with buildings dating from the Middle Ages, was destroyed. “The problem is removing people from under the rubble,” he said. Asked how many people he thought were still trapped or dead underneath debris, he said, “Many, many. ” Mr. Pirozzi added that Amatrice had been cut off because of damage to roads and a bridge, and in a live television broadcast, he appealed for assistance. The town’s missing reportedly included two refugees from Afghanistan and three nuns and four older guests at a local boardinghouse. The town’s hospital had to be evacuated, but its patients were not injured, the news agency ANSA reported. The hamlet of Pescara del Tronto was all but destroyed. “When I arrived at the break of day, I saw a destroyed village, screams, death,” Bishop Giovanni D’Ercole of Ascoli Piceno, who visited the hamlet, told Vatican Radio. He said he had blessed “the bodies of two children buried under the rubble. ” Mr. Renzi, in brief remarks before he left Rome, thanked rescue workers and volunteers who had dug through debris, some with their bare hands, to reach trapped people, and said the nation had rallied to help. “No family, no city, no hamlet will be left alone,” he said. Expressions of solidarity and offers of help poured in from France, Germany, Israel and other countries, as well as from the European Commission. Ambulances raced back and forth on one of the main roads to Amatrice, where a courtyard in a   palazzo had been turned into an impromptu morgue. CNN showed footage of construction equipment’s being used to try to comb through giant pieces of debris in Amatrice and of rescuers standing on huge piles of rubble where homes once stood, evidence of the enormous scale of the rescue effort. “We need chain saws, shears to cut iron bars and jacks to remove beams,” a civil protection worker, Andrea Gentili, told The Associated Press. “Everything, we need everything. ” A video posted to YouTube by the State Forestry Corps showed a woman trapped under debris in the rural town of Capodacqua, as a man encouraged her to remain calm. Nonprofit agencies put out calls for blood donations. Massimo Cialente, the mayor of L’Aquila, the town near the epicenter of the 2009 Abruzzo earthquake, said that 250 temporary homes built after that disaster would be available for newly displaced people. Pope Francis skipped the catechism lesson during his Wednesday general audience and led pilgrims at St. Peter’s Square in praying for the victims, holding a rosary in his right hand. “I cannot fail to express my heartfelt sorrow and spiritual closeness to all those present in the zones afflicted,” he said in remarks released by the Vatican. “I also express my condolences to those who have lost loved ones, and my spiritual support to those who are anxious and afraid. Hearing the mayor of Amatrice say that the town no longer exists, and learning that there are children among the dead, I am deeply saddened. ” The earthquake was felt across a broad area pockmarked with dozens of small towns. Italian officials said it was difficult to gauge the number of casualties or the damage as the ground kept trembling through the night. Fabrizio Curcio, the director of the Civil Protection Department, said that the earthquake had been severe and that national emergency procedures had been activated. Mr. Curcio said mayors in the affected areas were monitoring the destruction. “They know the territory best,” he said. By early morning, rescue operations had been able to reach the most damaged towns, he said, adding, “We have to carry out an analysis of the territory and see if there are other places that have to be reached. ” On social media, there were many reports of friends or relatives’ being buried or trapped, and local residents said that the rescue effort was hindered by the fact that teams were having difficulty getting to the mountainous area, where most towns are reachable only along winding country roads. Facebook activated its safety check feature for the region, which allows users to mark themselves as safe and quickly alert friends and family after a crisis or a natural disaster. In Norcia, dozens of residents wrapped in blankets greeted the dawn in the town’s main square. “Much of our patrimony is damaged, but there are no victims,” Mayor Nicola Alemanno told RaiNews24. “That is the good news. ” The United States Geological Survey said the people in the region lived in structures that were a “mix of vulnerable and   construction. ”'"}, "time": 1742563938.245314}