{"duration": 0.1369640827178955, "input_args": {"text": "'Email \\nAs Election Day approaches, Democratic nominee Hillary Clinton knows that she must be able to count on the votes of the black community, a bloc that has been a reliable Democratic constituency for decades. \\nIn light of some of the revelations in the WikiLeaks e-mail dump, the Clinton campaign is worried that they may actually have a fight on their hands on Tuesday for the support of African Americans. \\nEven President Obama senses the danger. \\nIn an article covering a campaign stop in North Carolina made by the current Oval Office occupant, CBS News reported on November 3 that Obama \"worries now the black vote \\'is not as solid as it needs to be\\' for Hillary Clinton.\" \\nHis fears may be well-founded. Here\\'s the situation as reported by CBS News: An Associated Press analysis of early voting data in North Carolina shows blacks have cast 111,000 fewer ballots than at this point four years ago, when Obama lost the state by about 92,000 votes. Clinton aides note that GOP officials there reduced early voting sites for the initial week of early voting, and they say they can make up the difference by Election Day now that more sites are opening. Black voters’ share of early ballots request is also down a few percentage points in Florida and Ohio, though the Clinton campaign points to strong early turnout in key urban counties with large numbers of blacks and Hispanics. \\nIt\\'s not as if Hillary Clinton is just sitting back, trusting that blacks will show up for her on Election Day. She\\'s attacking her Republican opponent, Donald Trump, calling him a threat to the black community. Again, from CBS News: Her [Hillary Clinton\\'s] campaign is broadcasting an ad on black-audience radio stations hailing the former secretary of state as “fighting for us,” in contrast to Trump “demeaning our community.” A female voice in the ad says, “Listen to how he talks about us.” One audio clip has Trump singling out a black supporter at a rally in California: “Look at my African-American over here,” he said. In another, Trump lambasted Obama as “the most ignorant president in our history.” \\nThere is evidence, however, that some black voters are focused less on what Trump said about President Obama in a stump speech and more on what Clinton said about African Americans when she thought no one was listening. \\nBlack Conservatives Fund (BCF), a non-profit organization dedicated to representing the views of center-right African American voters, just launched a targeted paid media campaign intended to reach minority millennial voters in swing states who are still considering the qualities of the two major party candidates running for the White House. \\nTheir advertising features two spots highlighting Democratic Party nominee Hillary Clinton’s previous comments expressing contempt for black Americans, calling them “super-predators” and claiming they’d make up her “firewall” against Senator Bernie Sanders (I-Vt.) in the 2016 primary. \\nThe ad, “Hillary Hates,” features the candidate’s 1996 comments where she was caught using racially divisive undertones to champion a bill that ultimately locked up a generation of black men. The ad also uses 2016 footage of her run-ins with Black Lives Matter protesters. “We’re not just the only conservative group going after black voters on television — we’re the only group, period,” Black Conservatives Fund Senior Adviser Ali Akbar said. \\nWith a television buy in Ohio and North Carolina, the ad is supplemented by a sizable digital buy that spans across Facebook, Instagram, and smaller, highly targeted web publications. The cable time has been reserved across BET, CNN, ESPN, HGTV, and USA networks in these states. \\nThe digital ad buy stretches into at least three other states not being targeted on television. In total, the group has planned a six-figure commitment to their advertising campaign for the remainder of the 2016 general election, hoping to move the needle away from a candidate who, when the election isn\\'t days away, uses language to describe black voters that would cause substantial media furor if such statements were made by a Republican presidential hopeful. \\n“Make no mistake: our aim isn’t to suppress African American votes. Instead, we’re telling black voters to make sure they participate in this election, but they need to remember what Hillary Clinton thinks of them,” Akbar said. “We are confident that our message will have significant reach, since Democrats have neglected advertising to them this cycle.” \\nAkbar\\'s message might be reaching the right homes, as even the New York Times has reported that early voting among blacks is down in key states and that this electoral anomaly might turn out to be \"canary in a coal mine\" indicating that black voters aren\\'t as monolithic or as easily duped as the Clinton campaign and the DNC thinks they are. From the Times article published on November 1: African-Americans are failing to vote at the robust levels they did four years ago in several states that could help decide the presidential election, creating a vexing problem for Hillary Clinton as she clings to a deteriorating lead over Donald J. Trump with Election Day just a week away. As tens of millions of Americans cast ballots in what will be the largest-ever mobilization of early voters in a presidential election, the numbers have started to point toward a slump that many Democrats feared might materialize without the nation’s first black president on the ticket. \\nFor its part, the BCF has not been a backer of Trump from the beginning. In fact, during the primary campaign, the group endorsed, contributed to, and made independent expenditures for Dr. Ben Carson and then Senator Ted Cruz. \\nSubsequently, BCF focused on down-ballot races and driving Hillary Clinton’s negatives higher with black voters. The PAC has been recognized by outlets such as National Review for being one of the most efficient grassroots PACs. \\n“Once every four years the black community is courted then subsequently abandoned by Hillary Clinton Democrats,” Akbar concluded. “Amid numerous protests by black millennials against Hillary Clinton’s candidacy, the black vote was again taken for granted. No more.” \\nDespite the valiant efforts of the BCF and other constitutionally minded, liberty-loving black voters, it is almost certain that Hillary Clinton will run away with the black vote by a substantial margin. \\nThat isn\\'t the issue, though. The issue is that we may be witnessing the early days of a generational shift by the African American community away from being a Democratic Party \"fire wall\" — as Clinton dismissively declared them — and toward being a voting bloc that doesn\\'t turn a blind eye to the disrespectful and dismissive way it has been treated by a Democratic Party that does little to improve the quality of life of this important and politically powerful minority.  '"}, "time": 1742564466.508924}