{"duration": 0.1030430793762207, "input_args": {"text": "'Politics US Senator Bernie Sanders \\nFormer US Democratic presidential candidate Bernie Sanders has threatened President-elect Donald Trump, warning that his camp will be Trump’s “worst nightmare” if he goes after minorities in America. \\n\"If Donald Trump takes people\\'s anger and turns it against Muslims, Hispanics, African Americans and women, we will be his worst nightmare,\" the Vermont senator wrote on his Twitter page on Thursday. \\nThe 74-year-old senator had earlier issued a statement after the New York businessman’s victory in the US election on November 8, promising to work with him on certain issues but also to oppose him should he pursue divisive and discriminatory policies. \\n“To the degree that Mr. Trump is serious about pursuing policies that improve the lives of working families in this country, I and other progressives are prepared to work with him,” Sanders said. \\n“To the degree that he pursues racist, sexist, xenophobic and anti-environment policies, we will vigorously oppose him,” he added. \\nDuring the primaries, Sanders ran a close race with Clinton and promised to continue the fight all the way until the Democratic National Convention in June, where the party’s nominee was going to be named. \\nTowards the end of the race, however, Sanders changed his tone and bowed out in favor of Clinton. He also appeared next to her during the DNC and supported his party opponent in the Democratic campaigns. \\nOn July 12, 2016, Sanders formally endorsed Clinton after facing mounting pressure from major Democratic figures, including outgoing US President Barack Obama himself. US Republican president-elect Donald Trump delivers his acceptance speech during his election night event at the New York Hilton Midtown in the early morning hours of November 9, 2016 in New York City. (Photo by AFP) \\nOn Tuesday, Trump stunned the world by defeating heavily favored Clinton in the presidential election, sending the United States on a new, uncertain path. \\nTrump rode a wave of anger toward the elite US establishment to win the White House race against Clinton, a longtime Washington insider. \\nThe New York businessman garnered 290 electoral votes in the 2016 US election, while his rival and the former secretary of state received 232 votes despite winning the popular vote. \\nThousands of people since then have rallied in cities across the US to protest against Trump\\'s presidential election victory, condemning his controversial campaign rhetoric against Muslims, immigrants, women and other groups. \\nThis is while Trump said in his victory speech he would be president for all Americans. \"It is time for us to come together as one united people,” he said. \\nThe real estate mogul\\'s election campaign had been marred by his disparaging remarks against minorities in the US. His comments include a call to ban all Muslims from coming to America as well as stopping Mexican migrants by building a long wall along the US-Mexico border. \\nHe has also sought for a database to track Muslims across the United States and said that the US would have \"absolutely no choice\" but to close down mosques. \\nTrump’s proposal was widely condemned by Muslim and human rights groups as well as his Democratic rivals and many of his Republican proponents who describe the proposal as divisive, counterproductive and contrary to American values. Loading ... '"}, "time": 1742563758.2314467}