{"duration": 0.07944464683532715, "input_args": {"text": "'Like millions of Americans who are paying thousands of dollars a year for health insurance no doctors will take, I would love to be flying to Washington this week, pleading with members of Congress, spearheading   campaigns and appearing as a witness, to tell everyone about my experiences with Obamacare. [But none of us can, because we’re too busy working so we can afford to pay for the health care of 22 million poor, entitled or irresponsible people under Obamacare.  Just yesterday, for example, in addition to working, I had to spend an hour  —   on top of days and days last month  —   figuring out which few remaining clinics provide mammograms under my   now third Obamacare insurance plan. My original plan was made “illegal” by Obamacare, and the next two plans  —   fully approved under Obamacare  —   went bankrupt and were shut down by state and federal regulators. Now I just have to pray I don’t get cancer or break a bone before Obamacare is repealed because, even at $700 a month with a gigantic deductible, there is NO PLAN on the individual market accepted by the two premier hospitals in my area for cancer or broken bones. Those $700 premiums go to pay for the pregnancies and dental care of welfare recipients and immigrants, not cancer treatment for Ann. Democrats love to get on their high horses about the wonderful things Obamacare has done for the uninsured. They should be asked why they refuse to live under it. After they spend 800 hours changing insurance plans every year, ending up with increasingly expensive and increasingly useless plans  —   all so that their premiums can pay for the poor  —   I’ll be fascinated to hear about their love for the downtrodden. Same with Republicans who are, once again, being bamboozled by lobbyists, to the detriment of their taxpaying constituents who don’t have time or money to fly to Washington and tell them our   stories. Insurance lobbyists have somehow convinced politicians, who have very little experience in the private sector, that health insurance is wildly different from every other product  —   even car insurance and homeowner’s insurance  —   because of its need for a large pool of enrollees. Everyone talks about the enrollment problem as if this is a bug unique to the health insurance industry. What product, do they imagine, does not need lots of customers? How could restaurants afford those chefs, fresh flowers, industrial kitchens, one hundred sets of plates, napkins and silverware and a staff of waiters  —   without customers? AHHHH! THEY’LL GO OUT OF BUSINESS! !! THE MODEL DOESN’T WORK WITHOUT LOTS OF PARTICIPANTS! CONGRESS MUST GET INVOLVED. Publishers couldn’t have editors, proofreaders, lawyers, paper plants and marketing departments  —   unless there’s a large pool of book buyers. Pipe manufacturers couldn’t have hundreds of employees, huge machines and factories unless  —   you get the idea. Why is “having customers” treated like some freakish need of this one industry? People are a lot less interested in buying hotel rooms, restaurant meals and pipes than they are in buying health insurance. Everyone knows someone who has died of cancer or had some other major medical problem, and most people are not insane. Even with the hell of Obamacare, requiring hundreds of hours of work  —   to research, sign up for, be thrown off of, then sign up for a different,    plan, year after year  —   the   taxpayer is doing all that in order to maintain some form of health insurance. So apparently, no matter how awful you make it, this is a product Americans are desperate to buy! Republicans all say they want to save the   “good parts” of Obamacare. Because who knows better what the American consumer wants than a member of Congress! I keep imagining Congress designing a “comprehensive hotel reform bill,” promising to save the popular parts: “BUT PEOPLE LIKE HAVING TV’S IN THEIR HOTEL ROOMS!” How could we ever get TVs in hotel rooms without Congress writing a law? It turns out, people running a business have an uncanny ability to figure out what’s popular with their customers. Any “popular” features of Obamacare obviously, manifestly, inevitably will be preserved by the free market. If parents like keeping their useless millennial kids on their plans, guess what? Any insurance company forced to compete with other insurance companies WILL OFFER THAT. As for covering people with “  conditions”  —   there are   conditions and   conditions. Does this mean the unfortunate few with some exorbitantly expensive medical problem? Or does it mean people who have a “  condition” because they waited to be diagnosed with cancer before buying insurance? The first category of people was dealt a bad hand. Eventually, they will be taken care of by the market when excess coverage policies are common and reinsurance companies pop up to cover the primary insurance companies. Until then, a separate program can pay for the unlucky. That’s not a reason to wreck the health insurance market for everyone else. There aren’t 22 million people with horrifyingly expensive medical conditions. They’re being used as the baby seals to sell subsidized health care for the irresponsible. The second category is a lot less sympathetic, which is precisely why the two cases are always conflated. You can’t buy flood insurance after your house has already floated away. But we won’t let people die in the streets, so  —   as Trump said at the very first GOP debate  —   they will be dealt with “through a different system. ” They probably can’t go to Sloan Kettering, but then again, neither can I. Right now, my $700 a month pays for them to go to Sloan Kettering. Both cases are of zero practical importance to the vast majority of people who just want to buy health insurance on the free market, rather than what we’re doing now, which is giving shiftless layabouts and irresponsible   an unlimited health care credit card  —   paid for through our insurance premiums. We’d come to Washington and tell you that, but we’re working to pay for the pediatric dental care of illegal aliens.'"}, "time": 1742562480.906801}