{"duration": 0.0868682861328125, "input_args": {"text": "'TEHRAN  —   Iranians bade farewell to Ayatollah Akbar Hashemi Rafsanjani on Tuesday, with the sprawling state funeral veering slightly off script when groups of mourners started shouting opposition slogans. The authorities were forced to raise the volume on the loudspeakers playing lamentation songs after some in the crowds took up cries of “Oh, Hussein, Mir Hussein,” a reference to a former presidential candidate, Mir Hussein Moussavi, who has been under house arrest since 2011. Some of the chants were aimed at Russia, Iran’s ally in the Syrian conflict. Video clips on social media showed mourners shouting “Death to Russia” and “the Russian Embassy is the den of espionage,” as they passed the embassy’s complex in the heart of Tehran. People also called for the release of hunger strikers in Iranian prisons. State television, broadcasting the funeral live, airbrushed the protests, which were nevertheless allowed to proceed without police intervention. Mr. Rafsanjani, 82, who died on Sunday, was laid to rest after an elaborate ceremony that lasted several days. Right after his demise, his body was placed in a coffin that was put on public display in the modest house of the late founder of the Islamic republic, Ayatollah Ruhollah Khomeini. For two days, mourners had filed through the northern Tehran site, untouched since Mr. Khomeini died in 1989. A religious chanter brought the crowds to tears as he recalled how Mr. Rafsanjani helped to oust Shah Mohammed Reza Pahlavi in the 1979 revolution. “Our sheikh was so wise, he made the shah leave, leave,” the chanter sang. Men gathering on the ground floor bowed their heads in respect, while on the first floor  —   the women’s section  —   mourners in black chadors peeked down. Qassem Soleimani, the general of the Quds Force of the Revolutionary Guards who runs Iran’s operations in Iraq and Syria, paid his respects, some people said, showing clips of him on their cellphones as proof. Because of Mr. Rafsanjani’s close relationship with Ayatollah Khomeini, he was accorded the honor of being buried in the late leader’s mausoleum, in a golden cage. Before the interment, all Iranians were invited to gather around the campus of the University of Tehran, in the central part of the city, where Iran’s supreme leader, Ayatollah Ali Khamenei, led a prayer. People showed up early, some wearing scarves around their faces to protect them from the morning cold. Families passed by, pushing strollers carrying babies wearing woolen hats. Students took videos with their cellphones. Shiite clerics in traditional winter robes made of camel’s hair held prayer beads. There were so many people  —   2. 5 million by official estimates  —   that many of the dignitaries and family members invited to the campus were marooned in their cars amid the crowds. Some hid behind curtains others waved at the collection of camera phones. One of Mr. Rafsanjani’s daughters, Faezeh Hashemi, was photographed sticking her head out of the window of a bus and flashing a victory sign. She and her brother Mehdi have been harassed by   for their growing support of reformists and moderates seeking change in Iran. The daughter, an activist for women’s rights and personal freedoms, was jailed in 2011 for making “  propaganda,” while her brother was given leave to attend the funeral from prison, where he was sent on embezzlement charges. In recent years their father, long a staunch conservative, became an unexpected hero to Iran’s middle class. Mr. Rafsanjani sympathized with some demands made by protesters during the   Green Revolution, the antigovernment demonstrations following the disputed   victory of President Mahmoud Ahmadinejad in 2009. They saw him as a lone voice representing their beliefs in Iran’s establishment. Such deviations from the official line were put aside by the authorities on Tuesday. In death it seemed that Mr. Rafsanjani was to be remembered for his revolutionary credentials, not for his criticisms. Potential troublemakers were not invited. The former reformist president, Mohammad Khatami, who was supported by Mr. Rafsanjani, was told not to attend, local websites said. The same apparatus that normally churns out posters showing Uncle Sam with blood dripping from his teeth to burn during     demonstrations, now printed pictures of Mr. Rafsanjani, extolling him as “a man of history, who is immortal. ” In the teeming streets, scenes clashed incongruously. At one point, Ayatollah Khamenei could be heard through loudspeakers saying prayers for Mr. Rafsanjani while protesters chanted opposition slogans. Some wore green wristbands, the color of the opposition, and flashed victory signs. Supporters of the establishment tried to drown out the slogans by shouting “Allahu akbar,” meaning “God is great,” but for the most part they were overmatched. On state television, sound engineers at one point forgot to lower the volume when people shouted, “Hail to Khatami. ” “Hashemi’s death is a great worry to us,” said Leili Farhang, a    university graduate, who emphasized that she was unemployed “like many of my generation. ” She and her friends had showed up in front of the Tehran University campus “to pay respect to a man who respected us. ” It was hard, she and her friends agreed, to come up with the name of anybody within Iran’s establishment to replace Mr. Rafsanjani. Not one has his weight and stature, they concluded: “He will be missed. ” It took hours for the body to arrive at the South Tehran mausoleum, because of “the millions that have come out to honor the ayatollah,” Khabarfori, an Iranian online news channel, said on the Telegram messaging app. Inside the mausoleum, state television showed, a marching band played the national anthem, after which Mr. Rafsanjani’s coffin was placed next to Mr. Khomeini’s, as planned.'"}, "time": 1742562058.76548}