{"duration": 0.15350651741027832, "input_args": {"text": "'BEIJING  —   China said Saturday that its military budget would rise by about 7 percent this year, apparently the lowest increase in seven years, signaling that its leaders do not plan to engage the United States in an arms race even as President Trump seeks to bolster the Pentagon’s spending. Addressing reporters before the start of the annual National People’s Congress, Fu Ying, a spokeswoman for the legislature, said the increase would be “about” 7 percent. She said defense spending would amount to roughly 1. 3 percent of China’s gross domestic product. Last year’s proposed increase was 7. 6 percent, though China has yet to release final figures indicating how much was actually spent. Those figures, and the exact number of this year’s projected increase, will be revealed in a budget that the government releases on Sunday, when the national legislature starts its annual full session. Before 2016, the military budget had received   increases for six years, a reflection of China’s   economy. Chinese experts said the new budget would keep military spending roughly in line with the government’s usual formula of G. D. P. growth plus inflation. As China’s economy continues to slow, annual growth in the gross domestic product is expected to be about 6. 5 percent. Inflation hovers around 2 percent. And the government must also find more money for health care, education and other increasingly expensive social needs. Chinese and Western military analysts said it was notable that Mr. Trump’s recent pledge to raise American defense spending by $54 billion had not spurred China to elevate its own spending further. Ms. Fu said that China wanted good relations with the Trump administration but would respond to any challenges. “President Xi Jinping and President Trump have had two direct phone calls, and the message was very clear, which is that there must be more cooperation between China and the United States so we become good partners,” Ms. Fu said. But she added that China would watch the effects of Mr. Trump’s global policy changes. “Of course, everyone hopes that their impact will be positive, but if there are challenges, China will respond calmly,” Ms. Fu said. The U. S. military is vastly more powerful than China’s, as Ms. Fu noted. “Fundamentally, this is about the United States worrying that China could catch up and surpass the U. S. in its ability,” she said. “But in fact there is a still a huge gap in ability between the U. S. and China, which is still a developing country. ” To emphasize his intent to strengthen the American military, Mr. Trump visited the country’s new aircraft carrier this week. The Gerald R. Ford is a     floating fortress due to be commissioned this year and is the first in a new generation of supercarriers. The United States has 10   supercarriers. In contrast, China is building its first aircraft carrier, a   vessel, and has one refurbished carrier from Ukraine. Wang Xiangsui, a retired senior colonel in China’s Air Force who is now director of the Research Center of Strategic Issues at the Beijing University of Aeronautics and Astronautics, said Mr. Trump’s plans to increase military spending were unlikely to prod China into following suit. “I don’t think China will be oversensitive about this,” he said. “Despite all the aggressive talk, no one wants a war,” Mr. Wang said. While the $54 billion increase sounds like a lot, he added, ”the Americans didn’t achieve anything after spending six trillion in Iraq and Afghanistan. ” China’s top diplomat, Yang Jiechi, who visited Washington this week and met briefly with Mr. Trump at the White House, probably had the military budget on his mind as he tried to judge the mood of the new administration, said Dennis J. Blasko, an American expert on the Chinese military. “I’m guessing Yang Jiechi was tasked to make an assessment of the state of the bilateral relationship to see if there may need to be a   adjustment in reaction to the requested increase for the U. S. defense budget,” said Mr. Blasko, a retired army lieutenant colonel and the author of “The Chinese Army Today. ” Mr. Yang probably found the relationship to be on a sound enough footing, Mr. Blasko said. “I don’t think they want to get into a military budget fight with us, not even a rhetorical one. ” Ni Lexiong, a naval expert in Shanghai, said that if China really felt the need to spend more heavily on the military, it would not hesitate to do so. “If China felt threatened, I don’t think slower economic growth would stop them from spending more on the military,” Mr. Ni said. “You have seen how the Chinese were willing to starve to build an atomic bomb. We do not worry about poverty when we think a larger military is necessary. ” He said the new budget would allow China to keep modernizing its navy and air force, the two services currently getting the most attention. The navy launched 22 warships in 2016 to replace old ones, and the budget would let it keep up that pace this year, he said. “A chunk of the expenditure will go towards developing and manufacturing the latest weapons for a stronger air force and navy,” he said. “I believe this speed of replacement will continue, because it has been one of China’s   growth goals to build a military stronger than America’s one day, in either quality or quantity. ” While China’s future aircraft carriers are likely to be nuclear powered, the Chinese Navy will probably be focused on other, more important areas, said Lyle J. Goldstein, an associate professor at the China Maritime Studies Institute at the U. S. Naval War College in Rhode Island. “Chinese submarine development and the building of destroyers and frigates are likely more expensive and more consequential for the overall military balance,” he said. If Mr. Trump were to win his proposed increase of $54 billion, the American defense budget would be $603 billion, about 3 percent higher than under former President Barack Obama’s last budget plan. The People’s Liberation Army’s official budget was about $146 billion in 2016. Western groups that study the Chinese military say that actual spending is roughly 1. 2 to 1. 5 times greater than the announced figures. Using a rough estimate that assumes an average G. D. P. growth in China of 6. 5 percent and a U. S. growth rate of 3 percent, China’s military spending would be expected to surpass America’s around 2040, said Bonnie S. Glaser, the director of the China Power Project at the Center for Strategic and International Studies in Washington. Among the issues that Chinese military planners must deal with is how to handle the retrenchment of 300, 000 personnel announced by President Xi Jinping in 2015, part of an effort to streamline the P. L. A. into a modern fighting force. Although most of those leaving the army are   to   officers and soldiers, the severance costs are expected to be substantial, retired Chinese officers said.'"}, "time": 1742563188.710045}