{"duration": 0.032791852951049805, "input_args": {"text": "'President Donald Trump signed legislation Monday that rolls back two   education regulations  —   one regarding teacher training programs and another regarding requirements for states in meeting directives of the federal Every Student Succeeds Act (ESSA). [Trump signed H. J. Res. 58, which overturns the U. S. Education Department’s (USED) rule that relates to how teacher training programs are assessed. Additionally, the president signed H. J. Res. 57, which nullifies USED’s rule relating to state accountability requirements under ESSA.  The teacher training program requirement, part of the Higher Education Act, mandated states to rate training programs for teachers each year based, in part, on student outcome measures. The Washington Post describes the Obama rule as “broadly unpopular”: Teachers unions said the regulations wrongly tied ratings of   programs to the performance of teachers’ students on standardized tests colleges and states argued that the rules were onerous and expensive, and many Republicans argued that Obama’s Education Department had overstepped the bounds of executive authority. The ESSA rule concerned states’ accountability in identifying failing schools and reporting their plans for improving them to the federal government.. In his remarks about these two House joint resolutions, Trump said they “eliminate harmful burdens on state and local taxes on school systems that could have cost states hundreds of millions of dollars. ” “So it’s the states and   school systems, and that was very important,” the president added. “Parents, teachers, communities, and state leaders know the needs of their students better than anyone in Washington by far. So we’re removing these additional layers of bureaucracy to encourage more freedom and innovation in our schools. ” The   Congress and Trump are overturning some   rules and regulations via the Congressional Review Act.'"}, "time": 1742563514.489537}