{"duration": 0.05386161804199219, "input_args": {"text": "'“I screwed up the economy, your jobs and your mortgages so  —   hey  —   I’m just the guy you can trust to tell you what to do about climate change! ”[That was my take home message of a piece Hank Paulson penned for the New York Times a couple of years ago on the urgent need for a carbon tax.  Two years on  —   with fellow GOP Establishment stooges James Baker and George Shultz  —   he’s still harping on the same tedious theme. This     shyster Paulson is the kind of    throwback whose advice the Trump administration should avoid like the plague. As Treasury Secretary Hank Paulson not only failed to predict the 2008 financial crash  —   the US economy is “very healthy” and “robust” he insisted in 2007  —   but it’s quite possible that his encouragement of risky lending while he was at Goldman Sachs helped cause it. But that’s because Paulson is the very embodiment of the liberal elite which both the Brexit vote and the election of Donald Trump were designed to overthrow. Paulson may notionally identify as a Republican. Or, at least, he served with a “Republican” administration. But what’s quite evident from his demands for a carbon tax is that he belongs to that shiftless    elite which couldn’t give two hoots whether it’s a Democrat or Republican in charge, just so long as the elite get to maintain their power base and their revenue stream. Note how, back in 2014 when he was calling for that carbon tax in the New York Times, he boasted about teaming up with Tom Steyer (  hedge funder, creator of the NextGen super PAC) and Michael Bloomberg. These men are not conservatives. What they are is crony capitalists. They are the embodiment of almost everything that America voted against when it voted for Donald Trump. Of course they want to tax “carbon”. By taxing carbon dioxide (the harmless trace gas which makes the planet greener) the US government would be signalling to the world that it still believes in the   global warming narrative. This, in turn, would keep alive the   “renewables” industry in which Paulson, Steyer, Bloomberg and their friends are so heavily invested. Even now, Wall Street remains quite hideously exposed to the green boondoggle. When the Green Blob finally explodes, a lot of   and crony capitalists and dodgy financiers are going to lose billions. That’s the real reason Donald Trump is being put under such pressure by these people. Not because they consider global warming a real threat but because they’re terrified of all the money they and their friends stand to lose. If you want to understand this in more detail, you should read my Breitbart piece Why Renewables Are Doomed and Fossil Fuels Are The Future. It’s quite long but it does tell it like it is and it also gives you an idea of why I so loathe these Establishment protozoa and why you should too  …     I’d call them pondlife, except I’m quite fond of dragonfly larvae and newts. I’d call them reptiles  —   but snakes are cool and lizards are beautiful. But please, Donald Trump, for the love of all the decent people who put you in the White House, do not listen to these   scumbags, no matter how plausible their manner and how exquisitely handstitched their Brioni suits. Make America Great Again. Make carbon taxes history.'"}, "time": 1742563566.9324806}