{"duration": 0.01567697525024414, "input_args": {"text": "'When Mitt Romney traveled to Europe as a presidential candidate in 2012, he created an uproar when he wondered aloud whether London was sufficiently prepared to host the Summer Olympics. British tabloids derided him as “Mitt the Twit” and CNN declared: “Romney’s Trip Begins in Shambles. ’’ When Gov. Chris Christie of New Jersey went on a trade mission to Britain, he was roundly criticized for an errant comment about vaccinations amid a measles outbreak back home. “A Vaccine for Gaffes? Chris Christie Needs It” was the headline in Commentary. Those moments seem quaint when compared with Donald J. Trump’s news conference in Turnberry, Scotland, a day after Britain voted to leave the European Union. Over the course of 40 minutes, the presumptive Republican presidential nominee made pronouncements, predictions and asides that would have set off serious backlash for almost any other candidate. But Mr. Trump seems to be graded on a different curve. Here are some of his more provocative remarks: A reporter asked Mr. Trump about the suggestion from some pundits that both he and the Russian president, Vladimir V. Putin, would be the biggest political beneficiaries of the “Brexit” vote. Mr. Trump agreed that Mr. Putin could gain, and could not resist pointing out that Mr. Putin has been kind to him. “I think he will be probably, because I know how he’s been scorned to a certain extent,” Mr. Trump said, adding later: “He said some very nice things about me. I think he probably is somewhat of a beneficiary. ” Traditionally, candidates for national office in the United States refrain from insulting their own leaders when they’re traveling overseas. But Mr. Trump, who has bucked almost every other tradition, made no exception for this one. “He’s constantly dictating to the world what they should do. The world doesn’t listen to him obviously,” Mr. Trump said of Mr. Obama, who was against Britain leaving the European Union. “He’s embarrassed. ” Candidates also historically do not engage in politics about their own races when traveling abroad. Yet Mr. Trump described Hillary Clinton as a puppet for Mr. Obama, pointing to her support for Britain remaining in the European Union. “She’s always misread everything,” Mr. Trump said. “If he said leave, she would have said leave. She does whatever he wants her to do. You know why, but that’s O. K. ” Politicians are wary of sounding as if they’re cheering for bad economic news, something that voters tend to respond poorly to. But Mr. Trump said that the diminished pound, which   in value after the referendum vote, could benefit his bottom line at Trump Turnberry, his luxury resort and golf course. “When the pound goes down, more people are coming to Turnberry, frankly,” Mr. Trump said. “I’ve been in touch with them but there’s nothing to talk about,” Mr. Trump said. Besides, he added, he would rather have advisers who are divorced from recent global events. “I think I want to use ones that haven’t been involved, take a look at what’s happened in the world,” Mr. Trump said.'"}, "time": 1742628576.0541441}