{"duration": 0.17102599143981934, "input_args": {"text": "'WASHINGTON  —   The White House on Thursday “counseled” Kellyanne Conway, one of President Trump’s top advisers, in an unusual show of displeasure after she urged consumers to buy fashion products marketed by Ivanka Trump, the president’s daughter. Legal experts said Ms. Conway might have violated a federal ethics rule against endorsing products or promoting an associate’s financial interests. “Go buy Ivanka’s stuff is what I would say,” Ms. Conway said in a Thursday morning interview with Fox News, speaking from the White House briefing room. “I’m going to give a free commercial here: Go buy it today, everybody you can find it online. ” Sean Spicer, the president’s press secretary, would not elaborate on what the counseling entailed. Jason Chaffetz, the Republican chairman of the House Oversight Committee, said Ms. Conway’s comments were “wrong, wrong, wrong, and there’s no excuse for it. ” Mr. Chaffetz  —   who so far had not acted on calls since Election Day to investigate ethics issues related to Mr. Trump  —   and the panel’s ranking Democrat, Elijah Cummings, formally asked the Office of Government Ethics for an inquiry. Citizens for Responsibility and Ethics in Washington and Public Citizen, nonprofit advocacy groups, sent their own requests to the ethics office to investigate whether Ms. Conway’s comments went over the line. The director of the office, Walter M. Shaub Jr. has said publicly that the president needs to do more to separate himself from his businesses. Federal ethics rules state that an employee of the government’s executive branch cannot use public office for personal gain or to endorse products or services on behalf of friends or relatives. Legal experts said Ms. Conway, whose title is counselor to the president, appeared to have violated that and possibly other    rules, which do not apply to the president and vice president, but do apply to their staffs. The president and the Trump Organization continue to be targets of criticism  —   and formal requests for investigation by Democrats in Congress  —   over potential conflicts of interest because of their global business operations. A particular focus of Democratic lawmakers in Congress is Mr. Trump’s lease with the federal government on the Old Post Office building in Washington, redeveloped as the Trump International Hotel. The hotel and    Mr. Trump’s club in Palm Beach, Fla. are among the Trump properties critics see as profiting from a surge in interest because of his presidency. A lawsuit is also pending in federal court in New York, alleging that Mr. Trump is violating the Constitution by accepting payment from foreign governments at his hotels and golf courses around the world. It is one of dozens of lawsuits filed against him in recent weeks. The Trumps argue that they have taken major steps to avoid potential conflicts, including withdrawing from more than a dozen planned international deals. But the family is moving ahead with other plans, like the launch of a new hotel brand, Scion, which they hope will develop about 30 hotels around the United States, requiring approval from local governments that rely on federal aid. Ms. Conway was responding to a Trump family clash with Nordstrom, the department store chain, which has dropped Ms. Trump’s line. On Wednesday, the president used his personal and White House Twitter accounts to lash out at Nordstrom, saying that the company had treated his daughter “so unfairly. ” Those comments are the latest in a series of ethical questions about the relationship between his official role and his family’s interests. Ms. Conway’s remarks amounted to “using your government position as kind of a walking billboard for products or services offered by a private individual,” said Laurence Tribe, a professor of constitutional law at Harvard. “She is attempting quite crudely to enrich Ivanka and therefore the president’s family. ” Ordinarily, such conduct might be handled with a letter of reprimand, though it could lead to termination, legal experts said, but those decisions are largely up to the individual agency. “I think this is a violation, but I’d like to hear an argument as to why it’s not,” said Lawrence M. Noble, general counsel of the Campaign Legal Center, a nonprofit advocacy group, who was formerly the top lawyer and ethics officer at the Federal Election Commission. “She was speaking on behalf of the White House, in her official position, which makes it more serious. ” Richard W. Painter, chief ethics counsel under President George W. Bush, said Ms. Conway’s conduct would not have been tolerated in that administration. Recent events show that the president and the people close to him do not intend “to make meaningful distinctions between his official capacity as president and the Trump family business,” he said. Of Mr. Trump’s aides, Mr. Painter said, “Instead of trying to push him back on this, they’re jumping in this and shilling for the businesses alongside him. ” Nordstrom, one of several retailers to reduce or eliminate its ties to Ms. Trump’s line of clothes, jewelry and accessories, said its decision to do so was based purely on sales performance. But deep division in views of Mr. Trump have put retailers in a bind. Critics of the president have called for a boycott of   products and the stores that sell them, while his supporters have called for a boycott of stores that drop them. Ms. Conway said that Ms. Trump was being targeted by people who disliked her father. “They’re using her to get to him,” Ms. Conway said on Thursday. The president and his daughter have pledged to distance themselves from their various businesses. Ms. Trump has stepped away from her leadership role at the Ivanka Trump brand, and she and her father have resigned as executives at the Trump Organization. But recent events underscore the strong financial ties that remain. Mr. Trump will continue to receive reports on the performance of the Trump Organization, while Ms. Trump has given no indication that she plans to sell her brand. Much as her father has over the years, Ms. Trump licenses her name to various partners that manufacture and market her products. A day after Nordstrom pulled Ms. Trump’s products from its website, Neiman Marcus did the same, alluding to poor sales. Ms. Trump has no official role in the administration, but her father has included her in meetings with industry and government leaders, and her husband, Jared Kushner, is an adviser to the president. Acting as a surrogate for her father last year, she drew free attention to the Ivanka   products  —   sheath dresses, heels and jewelry  —   that she sometimes wore. That commingling created a thicket of ethical issues that became more pointed after the election. The dress she wore at the Republican National Convention, for example, was among the items presented to apparel buyers in Japan last year, as Ms. Trump’s company was finalizing a deal with a Japanese clothing company whose largest shareholder is a   bank. That deal was in its final stages when Ms. Trump joined her father’s meeting with Japan’s prime minister, Shinzo Abe, in November. A representative for Ms. Trump said she later withdrew from that deal. And in November, after her father’s election and the day after she appeared on “60 Minutes,” Ivanka Trump Fine Jewelry sent an email to fashion journalists with a photo from the interview, alerting them that the    bangle she wore in the picture was available for $10, 800. The jewelry line later apologized.'"}, "time": 1742564611.4216728}