{"duration": 0.04003190994262695, "input_args": {"text": "'Share on Facebook Share \\nRussia have officially declared that Billionaire George Soros is a wanted man in their country, citing him and his organizations as a “threat to Russian national security”. \\nPutin banned Soros from Russia last year due to the fact that Soros helped to nearly destroy the Russian economy in the early 1990’s. \\nVeteranstoday.com reports: \\nMatt Taibbi of the Rolling Stone said of Goldman Sachs six years ago: \\n“The first thing you need to know about Goldman Sachs is that it’s everywhere. The world’s most powerful investment bank is a great vampire squid wrapped around the face of humanity, relentlessly jamming its blood funnel into anything that smells like money. \\n“In fact, the history of the recent financial crisis, which doubles as a history of the rapid decline and fall of the suddenly swindled dry American empire, reads like a Who’s Who of Goldman Sachs graduates.” \\nObviously Soros wants to be like Goldman Sachs. Phil Butler puts it well when he says: “George Soros has a finger in every political pie there is. If there is a crisis on our world, it’s a safe bet he’s had a hand in it.” \\nOne can say that Soros and Goldman Sachs are ideologically part of the same brotherhood. Their strategy is a little different, but the end result is the destruction of lives via the economic system (be it capitalism or socialism) and political manipulation. \\nThat’s why Soros seems to think that he is invincible. He thinks he can move the political and economic planet in a few blinks of an eye and no one can tell him to stop. In fact, he writes books such as The Alchemy of Finance. Soros thinks he can kill political stability throughout Europe and indeed in America with no challenge. \\nSoros is certainly old, but he doesn’t want to be obsolete. His organization has recently been caught conducting covert operations designed to destabilize Russia. Here is an interesting quote from the leaked files of Soros’ Open Society Foundation: \\n“Our inclination is to engage in activities and with actors that will understand and counter Russian support to movements defending traditional values…Naming and shaming from us is problematic: we are also in the business of channeling money into other countries for political purposes.” '"}, "time": 1742562763.2417154}