{"duration": 0.03966212272644043, "input_args": {"text": "'Stopping the shipment of these supplies to Germany would have ended the Nazi war.\\n\\nNazism was the first time in human history that the rich had enough wealth to hire an entire country to do their dirty work. \\n\\n\\nHave you ever wondered who exactly are these rich men that thrive by destroying entire nations only to rebuild them later on — whilst reaping $Trillions in the process?\\n\\nThe most powerful of these infamous families is the Rothschild banking clan, who has been financing both sides of every war since the time of Napoleon.\\n\\nThe following quote, even though it has been attributed to a fictitious character, it is very accurate:\\n\\n“I told you once before that there were two times for making big money: one in the up-building of a country and the other in its destruction. Slow money on the up-building, fast money in the crack-up. Remember my words. Perhaps they may be of use to you some day. (Rhett Butler)” ― Margaret Mitchell, Gone with the Wind \\n\\nTo my readers, it will surely come as no surprise to find out that Hitler was, in fact, a Rothschild\\n\\nAdolf Hitler’s father, Alois Hitler, was the illegitimate son of Maria Anna Schicklgruber and Baron Rothschild. Maria Anna was working as a maid in Baron Rothschild’s mansion when she became pregnant and was sent back to her village for confinement.\\n\\nA correspondent who has extensively researched this subject writes:\\n\\n“It appears to me that Hitler knew about his connection long before his Chancellorship. Like his father before him, when the going got rough, the Hitlers went to Vienna. Hitler’s father left his home village at an early age to seek his fortune in Vienna. When Hitler was orphaned, after his mother died in December of 1907, he left for Vienna not long after the funeral.\\n\\n“There he seemed to drop out of sight for ten months! What happened during this ten-month stay in Vienna is a complete mystery on which history sheds no light. It makes sense, now that it has become established that Hitler was a Rothschild, that he and his cousins were getting acquainted, and his potential for future family endeavors was being sized up.”\\n\\nThe Rothschilds and the Illuminati produce many offspring out of wedlock in their secret breeding programs and these children are brought up under other names with other parents.\\n\\nHitler was financed by the Federal Reserve and the Bank of England, which are both owned/ controlled by the Rothschilds, which is further evidence that they have been the greatest force behind the second world war. \\n\\nIt makes me sick to even think about the rivers of blood spilled by their hidden conspiracies and the amount of pain, sufferance and destruction caused to the world.\\n\\n\\nAlso, George Bush’s grandfather, the late US senator Prescott Bush, was a director and shareholder of companies that profited immensely from their involvement with the financial backers of Nazi Germany.\\n\\nAdolf Hitler and Prescott Bush \\nBasically, the Bushes have contributed to the rise of Hitler and made a fortune in the process.\\n\\n\\nThe Powers That Be (TPTB) take good care of their own \\n\\nFrom 1945 to 1945, Operation Paperclip granted American citizenship to nearly 1,000 Nazis. Once “bleached” of their Nazism, they ended up working in the US military industrial complex, and have worked for the CIA, NASA, etc..\\n\\nOne of the Nazi experiments that continued in America was mind control. The subject were mostly children and mind control was achieved through torture. The secret project received the name MKUltra.\\n\\nIn his book, The Nazis Next Door , investigative reporter Eric Lichtblau reports that thousands of Nazis managed to settle in the USA after World War II, often with the direct assistance of American intelligence officials.\\n\\nAnd what about Adolf Hitler? \\n\\nThe FBI has quietly declassified secret files attesting that Hitler fled to Argentina in 1945 and they knew all about it.\\n\\nAlso, there are separate reports from people who met him in Argentina just months after war.\\n\\nOne of these contacts has even told the FBI the exact location where Hitler and his wife, Eva Brown, were hiding : a lakeside mansion in Patagonia, Argentina. (This remote mountainous paradise was full of top Nazi refugees).\\n\\nBut Hitler and his entourage were offered a safe heaven by TPTB and they were not to be bothered for the rest of their lives. \\nBy Alexander Light, HumansAreFree.com . Introduction by Michelle Walling, HowtoexittheMatrix.com . '"}, "time": 1742628590.310611}