{"duration": 0.10142064094543457, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Hillary Clinton launched a blistering attack on Donald Trump. She called his foreign policy ideas “dangerously incoherent” and said he could lead the country into war “just because somebody got under his very thin skin. ” But the Republican establishment continued closing ranks. The House speaker, Paul Ryan, finally endorsed Mr. Trump, and Karl Rove, who has called Mr. Trump “a complete idiot” has met with him. _____ 2. Federal regulators are trying to rein in the payday loan industry, which has trapped many   Americans in a cycle of debt. New rules that could go into effect next year include a limit on the number of times that borrowers can roll over their   loans into newer, pricier ones. Lenders could fight the constraints in court. _____ 3. The official cause of Prince’s death was an accidental overdose of a painkiller many times more powerful than heroin. The coroner’s report, delayed for weeks until a toxicology report could be completed, specified fentanyl, a synthetic painkiller given much of the blame for the high mortality rate of the opioid epidemic. _____ 4. The N. B. A. finals feature the same teams as they did last year, but this year’s series isn’t your basic rematch. The defending champion, the Golden State Warriors, and the Cleveland Cavaliers have both evolved, with the Cavaliers better equipped to match the Warriors’ shooting. But the Cavs didn’t show evidence of that in Game 1, when they lost,   despite limiting Stephen Curry, the Warriors’ guard, to just 11 points. _____ 5. Big news for opera fans: The Metropolitan Opera named a successor to James Levine, its first leadership transition in decades. The new guy is Yannick   41, widely regarded as a brilliant conductor. But the Met faces a long wait for his attention. He does not officially begin until the   season  —   and plans to remain as artistic director at the Philadelphia Orchestra. _____ 6. President François Hollande declared a natural disaster for the region around Paris, as days of torrential rain sent the Seine 18 feet above its typical level. The Louvre and Musée d’Orsay prepared to evacuate some of their masterpieces. The storm system, which caused flooding in much of central and northeastern France, also inundated southwestern Germany, killing at least nine. _____ 7. The former graduate student who fatally shot this professor at U. C. L. A. and then killed himself on Wednesday is suspected in another homicide. Police officers who searched his residence in Minnesota found a list of people he apparently intended to kill. Officers then found one of them, a woman, shot to death at her nearby home. _____ 8. Germany passed a symbolic resolution calling the killings of Armenians by Ottoman Turks in the early 20th century genocide. The move strains relations at a time when Europe needs Turkey’s help in managing the migrant crisis. The Turkish government denounced the vote as “null and void. ” _____ 9. Elizabeth Holmes, the founder of the   company Theranos and the rare   female billionaire, was ignominiously jettisoned from the heights of Forbes’s “richest” lists. The magazine sharply lowered its valuation of Theranos, noting questions about the accuracy of its tests and a welter of investigations, and put Ms. Holmes’s net value at zero  —   down from $4. 5 billion. _____ 10. A special neighborhood has been growing in the upper reaches of New York City’s skyscrapers. This week, our Magazine ascends into the rarefied living spaces, offices and construction sites above 800 feet. Its denizens are proud, sometimes rivalrous, occasionally poetic and, at least in one case, humble. “You realize how small you are and how big the world is,” said a man who sees the city from the 85th floor of 1 World Trade. _____ 11. And finally, there’s a show worth watching even higher than that. Thanks to a celestial alignment, Saturn will be visible all night. The best time to see it will be after midnight local time, when the ringed planet will hang highest. Look for a golden orb just to the left of Mars, a crimson dot. And Saturn will remain visible, if not as perfectly, through the summer. _____ Dolores Morrison contributed.  Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561895.2750742}