{"duration": 0.07943511009216309, "input_args": {"text": "'Dictionnaire visuel Icônes de Palekh, à la croisée de l’Orient et de l’Occident Aujourd’hui, Palekh, un petit village de la région d’Ivanovo, est principalement connu pour son artisanat local, la miniature laquée de Palekh. Rares sont ceux qui savent que ce magnifique style de peinture prend ses origines dans la peinture d’icônes. Par Ilaria Kantorova , Pavel Inzhelevsky , Igor Davidov \\nL’ancien village russe de Palekh est situéà 350 km au nord-est de Moscou, sur l’Anneau d’or. Inspirés par les styles de peinture d’icônes de Friaj et de Stroganov, les maîtres de Palekh créent leur propre technique. \\nLa peinture d’icônes de Palekh prospère au début du XIXe siècle. Les icônes fabriquées dans la région se vendent à travers la Russie et à l’étranger. Les peintres de Palekh jouissent d’une grande demande aux niveaux les plus élevés. Lire aussi : Lire et comprendre une icône russe \\nIls furent chargés de peindre les murs du Palais à facettes du Kremlin et de restaurer les fresques des cathédrales du Kremlin de Moscou , du couvent Novodevitchi, de la laure de la Trinité-Saint-Serge, des cathédrales et églises de Pskov et de nombreuses autres villes russes. \\nL’Hymne Acathiste au Sauveur, datant du milieu du XVIII e siècle, est la pièce maîtresse des icônes de Palekh. L’Acathiste est un éloge chantéà l’ église . Les hymnes, textes liturgiques et textes poétiques louant la gloire du Christ et de la Sainte Vierge figurent dans de nombreuses œuvres de Palekh. Ce fondement musical se reflète dans la structure de la composition et dans le rythme des couleurs des icônes. Lire aussi : Les secrets de fabrication des plus belles cloches russes \\nDans les Acathistes du milieu du 18e siècle, de 1870 plus précisément, nous retrouvons le trait caractéristique de la peinture de Palekh : le mélange de la peinture de Friaj (dimensionnalité) et de la peinture tardive de Stroganov (plasticité des figures). Ici, nous voyons les constructions composites très complexes. Les peintres d’icônes de Palekh préféraient les compositions complexes avec de nombreux personnages. \\nQuand les bolchéviques prirent le pouvoir, la peinture d’icônes subit un brusque coup d’arrêt. Mais, contre toute attente, les maîtres de Palekh trouvèrent une nouvelle niche dans la production de miniatures laquées. Lire aussi :'"}, "time": 1742564245.839721}