{"duration": 0.07965373992919922, "input_args": {"text": "'BUCHAREST, Romania  —   In a surprise move, Romania’s largest political party nominated a woman from the country’s Tatar minority for prime minister on Wednesday. If she wins approval from the president and Parliament, she will be both the first Muslim and the first woman to hold the post. The Social Democratic Party scored a resounding victory in the Dec. 11 general election, winning more than 45 percent of the vote. Together with its smaller ally, the Alliance of Liberals and Democrats, it holds a majority of the seats in Parliament. Ordinarily, the leader of the largest party is designated by the country’s president to become prime minister. But the Social Democrats’ leader, Liviu Dragnea, would have been a problematic choice: He was convicted of electoral fraud and given a   suspended sentence in April. President Klaus Iohannis has said that the country’s next prime minister should be untainted by criminal convictions or continuing investigations. So the Social Democrats turned instead to Sevil Shhaideh, 52, a relatively   figure who served as minister of regional development for six months in the last Social   government. “It’s a surprising choice,” said Sergiu Miscoiu, a professor of political science at   University in Cluj. “People were expecting somebody controlled by Dragnea, but from the party’s upper levels, not a relative newcomer. ” “Picking Shhaideh suggests that Dragnea will control the government without taking direct responsibility,” Professor Miscoiu added. “She is not stained in a direct way, so Iohannis has no official reason to reject her. ” Professor Miscoiu said the choice might have also been intended to counter accusations of orthodoxism and nationalism during the campaign. Referring to the Social Democratic Party, he said: “P. S. D. are saying implicitly with this nomination: ‘You accused us of being nationalist and orthodoxist  —   look what we do, don’t you like it?’ ” The nomination of Ms. Shhaideh took many observers by surprise. “We have seen many names put forward in the last days, but her name was not among them,” said Paul Ivan, a senior policy analyst at the European Policy Center in Brussels and a former Romanian diplomat. Ms. Shhaideh is thought of as more of a manager than a politician, Mr. Ivan said. “She is seen as a technocrat,” he said. “She’s an economist who has worked in local and regional administration for many years. ” Ms. Shhaideh has spent most of her career in Constanta, a port on the Black Sea, and not in Bucharest, the capital. But she is seen as close to Mr. Dragnea. She was secretary of state in the Development Ministry when Mr. Dragnea was its minister, succeeding him when he stepped down in 2015. He attended her wedding to a Syrian businessman. Ms. Shhaideh and her husband own three properties in Syria, according to a declaration of financial interests from July 2015. Muslim women have very rarely served as heads of state or government in Europe. The few previous examples were in countries with Muslim majorities: Tansu Ciller was prime minister of Turkey in the 1990s, and Atifete Jahjaga was president of Kosovo from 2011 to 2016. By contrast, more than 80 percent of Romanians are Orthodox Christians, while fewer than 1 percent are Muslims. “There will clearly be part of the electorate that won’t like it,” Mr. Ivan said of the party’s choice of Ms. Shhaideh. “They also won’t like that the two most powerful political positions in Romania will be taken by those from ethnic and religious minorities. ” (Mr. Iohannis, the president, is Protestant and of German ancestry.) Even so, Mr. Ivan said he did not think Ms. Shhaideh’s faith would make her seem alien to fellow Romanians. “Generally, Romania’s Muslim community, the Turks and Tatars, the Islam they practice is a very moderate one,” he said. “They have lived more than 100 years in a   country, they’ve been through a socialist regime. If you look at Shhaideh, her head isn’t covered. ” There appeared to be little chance that the appointment of Ms. Shhaideh would soften Romania’s position on migrant quotas. Romania was one of the European Union member countries that initially opposed the setting of mandatory quotas for the relocation of migrants, many of whom are from the Middle East or northern Africa. “Ironically, the fact that she is a Muslim will prevent her from being too bold on areas like refugees, simply because it is so easy to demonize and say, ‘Of course you say that, you’re a Muslim,’ ” said Radu Magdin, brand ambassador of Smartlink Communications, a political consulting group. “Her team will advise her not to get involved in issues where things can become personal. ” Now that Ms. Shhaideh has been nominated, the next step is for the president to formally designate her as the next prime minister that could happen this week. She would then need to be confirmed in office by a vote of confidence in Parliament.'"}, "time": 1742628338.968295}