{"duration": 0.06348538398742676, "input_args": {"text": "'An    Brooklyn high school student has sued the New York Police Department after he was struck with a baton at least twice by an officer in an episode captured on a cellphone video. In the lawsuit, filed on Wednesday in Federal District Court in Brooklyn, the student, Yordy Aragonez, claims that the officer used unreasonable force when breaking up a fight at Progress High School in the East Williamsburg section on Dec. 21, 2015. The suit was reported by NY1. The police said that officers responded that day to reports of several large fights at the school. Mr. Aragonez claims in his suit that he was pulled into a fight because he and his cousin were defending themselves after being “aggressively confronted and set upon by a group of male students. ” Then, the suit says, Mr. Aragonez was grabbed by the officer and pushed into a room where a class was in session. A video taken by a student and broadcast by NY1 showed the officer, named in the suit as Kareem Phillips, yelling at Mr. Aragonez, knocking him to the ground and into a desk and hitting him with the baton. “As officers attempted to break up the altercation, an officer used a baton,” the Police Department said in a statement on Saturday. “As a matter of practice, the incident is under review by the Internal Affairs Bureau. ” Mr. Aragonez was not immediately available for comment on Saturday, but in an interview with NY1, he said he had not resisted. “He was just hitting me,” he said. “I wasn’t even trying to get up or nothing. ” The Patrolmen’s Benevolent Association, the union that represents New York police officers, said it was not clear whether the officer could have handled the episode differently. “A snippet of video of a chaotic situation never tells the entire story,” Patrick J. Lynch, the association’s president, said in a statement on Saturday. “There is an investigation underway, and until all the facts are gathered, we must all withhold judgment. ”'"}, "time": 1742561793.0447562}