{"duration": 0.08250164985656738, "input_args": {"text": "'PITTSBURGH (AP)  —   Chris Kunitz spent a portion of the spring nursing a   injury and wondering if his time with the Pittsburgh Penguins was over. The veteran forward’s contract is up this summer and he’s been around long enough to know how these things go, particularly when you’re 37. [“It’s not fun thinking about the future,” Kunitz said.  He found a pretty compelling way to put it off for at least four more games and push his team to the brink of history in the process. Kunitz’s knuckling shot from outside the circle fluttered past Craig Anderson 5:09 into the second overtime to give the defending Stanley Cup champions a   victory over the Ottawa Senators in Game 7 of the Eastern Conference final Thursday night. Thrust alongside old linemate Sidney Crosby as the game wore on, the two reconnected for a goal that moved the Penguins closer to becoming the first team since the 1998 Detroit Red Wings to win    titles. Crosby sent a soft backhand pass from the right faceoff circle to Kunitz and for a moment, it seemed like old times. “With the way he was holding the stick you could tell he wanted it bad,” Crosby said. “I just tried to lay it there for him. I’ve seen him score from there pretty often. It was a huge goal for us, and a great reward for him for the way he played all night. ” Kunitz scored twice, his first two of the playoffs. Justin Schultz added the other in his return from an   injury, and Matt Murray stopped 27 shots on his 23rd birthday. The Penguins will host Western Conference champion Nashville in Game 1 on Monday night. Not bad for a team that watched so many of its core players  —   from defenseman Kris Letang to Evgeni Malkin to Crosby  —   deal with some serious bumps along the way. And yet here they are on the doorstep to a title once again. “If you look at the amount of guys who have played on this roster throughout the course of the year, it’s a lot of guys,” Crosby said. “The biggest step is ahead. ” Mark Stone and Ryan Dzingel scored for Ottawa. The Senators rallied twice to tie it, with Dzingel making it   with 5:19 left in regulation. Craig Anderson made 39 saves, but couldn’t get a handle on Kunitz’s shot as the Senators fell to   in Game 7s in franchise history. Just don’t call them cursed. A year ago, Ottawa didn’t even make the playoffs yet they found a way to push the Penguins to the 85th minute of Game 7 of the conference finals. “We wanted to make then earn it and they earned it, rightfully so,” said Senators defenseman Erik Karlsson, who assisted on both of Ottawa’s goals and played the entire postseason with a pair of hairline fractures in his left heel. “We got to give it to them. They were the better team. ” The Senators forced a return trip to Pittsburgh  —   where they lost   in Game 5 on Sunday  —   by leaning heavily on Anderson in a   Game 6 victory. Ottawa coach Guy Boucher told his team to not get caught up in the big picture but instead focus on the small ones, a recipe that carried the Senators throughout a bumpy transition under their   head coach to within a victory of the franchise’s second Cup appearance. The Penguins, trying to become the first defending champion to return to the Final since Detroit in 2009, came in confident they would advance if they could replicate their dominant Game 6, when they were undone only by Anderson’s brilliance. Pittsburgh has been nearly unflappable in the face of adversity under Mike Sullivan, and is now   in playoff games following a loss over the last two springs. “I couldn’t be more proud of our team for just its ‘sticktoitiveness,’” Sullivan said. “The last four games of this series, we found our game. ” Kunitz ended a   playoff goal drought when he completed a    with Conor Sheary  —   a healthy scratch in Games 5 and 6  —   by slipping the puck by Anderson 9:55 into the second period. The momentum lasted all of 20 seconds. Ottawa responded immediately with Stone  —   who stretched his left skate to stay onside  —   fired a wrist shot that handcuffed Murray . Pittsburgh kept coming. Schultz, returning after missing four games with an   injury, zipped a shot from the point through Kunitz’s screen and into the net with 8:16 left in the third. Once again, the Penguins could not hold the lead. Dzingel set up at the right post and banged home a rebound off Erik Karlsson’s shot that hit the left post and caromed off Murray’s back right to Dzingel’s stick . Unbowed, Pittsburgh continued to press. The Penguins pumped eight shots at Anderson in the first overtime before finally breaking through when Kunitz won just the fourth   Game 7 of a conference final in NHL history. The next step, the last step, awaits. NOTES: The home team is   in overtime Game 7s in NHL playoff history.   …     Pittsburgh F Patric Hornqvist skated during warmups, but was held out of the lineup for a sixth straight game with an   injury.   …     Karlsson had 16 assists in the playoffs to set a team record.   …     The Penguins are   in Game 7s.   …     It was the fifth   game of the series.'"}, "time": 1742562264.1058292}