{"duration": 0.0697476863861084, "input_args": {"text": "'at 10:41 am 2 Comments \\nOn Monday, The Daily Beast published a hugely important story about AT&T’s in house, for profit surveillance operation called Project Hemisphere. The program has nothing to do with information sharing legally required under a warrant, but rather consists of a business line through which the telecom giant stores customer data longer than peers in order to turn around and sell it to government agencies (no warrant required). This allows law enforcement to use secret and never disclosed evidence to build a cases against citizens via a shady and unaccountable practice known as parallel construction. \\nThe article is titled, AT&T Is Spying on Americans for Profit, New Documents Reveal , and is a must read. \\nHere are some key excerpts: \\nIn 2013, Hemisphere was revealed by The New York Times and described only within a Powerpoint presentation made by the Drug Enforcement Administration . The Times described it as a “partnership” between AT&T and the U.S. government; the Justice Department said it was an essential, and prudently deployed, counter-narcotics tool. \\nHowever, AT&T’s own documentation—reported here by The Daily Beast for the first time—shows Hemisphere was used far beyond the war on drugs to include everything from investigations of homicide to Medicaid fraud. \\nHemisphere isn’t a “partnership” but rather a product AT&T developed, marketed, and sold at a cost of millions of dollars per year to taxpayers. No warrant is required to make use of the company’s massive trove of data, according to AT&T documents, only a promise from law enforcement to not disclose Hemisphere if an investigation using it becomes public. \\nThese new revelations come as the company seeks to acquire Time Warner in the face of vocal opposition saying the deal would be bad for consumers . Donald Trump told supporters over the weekend he would kill the acquisition if he’s elected president; Hillary Clinton has urged regulators to scrutinize the deal. \\nThe fact that this deal is even being considered shows what a giant joke this county has become. \\nAs I noted on Twitter earlier this week: Why don’t we just merge the entire S&P 500 into one company called Oligarchy Inc. and get it over with. \\n— Michael Krieger (@LibertyBlitz) October 24, 2016 \\nWhile telecommunications companies are legally obligated to hand over records, AT&T appears to have gone much further to make the enterprise profitable, according to ACLU technology policy analyst Christopher Soghoian. \\nAT&T has a unique power to extract information from its metadata because it retains so much of it. The company owns more than three-quarters of U.S. landline switches, and the second largest share of the nation’s wireless infrastructure and cellphone towers, behind Verizon. AT&T retains its cell tower data going back to July 2008, longer than other providers. Verizon holds records for a year and Sprint for 18 months, according to a 2011 retention schedule obtained by The Daily Beast. \\nThe disclosure of Hemisphere was not the first time AT&T has been caught working with law enforcement above and beyond what the law requires. \\nA statement of work from 2014 shows how hush-hush AT&T wants to keep Hemisphere. \\n“The Government agency agrees not to use the data as evidence in any judicial or administrative proceedings unless there is no other available and admissible probative evidence,” it says. \\nBut those charged with a crime are entitled to know the evidence against them come trial. Adam Schwartz, staff attorney for activist group Electronic Frontier Foundation, said that means AT&T leaves investigators no choice but to construct a false investigative narrative to hide how they use Hemisphere if they plan to prosecute anyone. \\nOnce AT&T provides a lead through Hemisphere, then investigators use routine police work, like getting a court order for a wiretap or following a suspect around, to provide the same evidence for the purpose of prosecution. This is known as “parallel construction.” \\nParallel construction is a pernicious side effect of all this spying. It’s a very important topic I covered last year in the post, How the DEA Uses “Parallel Construction” to Hide Unconstitutional Investigations . \\n“This document here is striking,” Schwartz told The Daily Beast. “I’ve seen documents produced by the government regarding Hemisphere, but this is the first time I’ve seen an AT&T document which requires parallel construction in a service to government. It’s very troubling and not the way law enforcement should work in this country.” \\nThe federal government reimburses municipalities for the expense of Hemisphere through the same grant program that is blamed for police militarization by paying for military gear like Bearcat vehicles. \\nThere’s your government again. Tirelessly working against you from behind the scenes. \\n“At a minimum there is a very serious question whether they should be doing it without a warrant. A benefit to the parallel construction is they never have to face that crucible. Then the judge, the defendant, the general public, the media, and elected officials never know that AT&T and police across America funded by the White House are using the world’s largest metadata database to surveil people,” Schwartz said. \\nSheriff and police departments pay from $100,000 to upward of $1 million a year or more for Hemisphere access. Harris County, Texas, home to Houston, made its inaugural payment to AT&T of $77,924 in 2007, according to a contract reviewed by The Daily Beast. Four years later, the county’s Hemisphere bill had increased more than tenfold to $940,000. \\nAT&T documents state law enforcement doesn’t need a search warrant to use Hemisphere, just an administrative subpoena, which does not require probable cause . The DEA was granted administrative subpoena power in 1970. \\nJust another reason to end the failed war on drugs and close down the DEA. Recall, unconstitutional surveillance was actually pioneered by the DEA a decade before the 9/11 attacks. See: How NSA Surveillance Was Birthed from the Drug War – The DEA Tracked Billions of Phone Calls Pre 9/11 . \\nAT&T stores details for every call, text message, Skype chat, or other communication that has passed through its infrastructure, retaining many records dating back to 1987, according to the Times 2013 Hemisphere report. The scope and length of the collection has accumulated trillions of records and is believed to be larger than any phone record database collected by the NSA under the Patriot Act, the Times reported. \\nThis summer, I switched my cellphone service away from AT&T and was able to reduce my monthly bill by nearly 50%. You should consider doing the same. \\nIn Liberty,'"}, "time": 1742628425.9071465}