{"duration": 0.16831541061401367, "input_args": {"text": "'DIETRICH, Idaho  —   Anonymous phone callers from distant area codes have unleashed tirades of invective on the residents of this tiny rural town. Strangers cruise its paved and dirt roads, seeming to drive through just for a look. And come fall, Dean Grissom’s   and    grandchildren will be going to another school. “Their parents think the kids aren’t safe,” said Mr. Grissom, 57, who works for the Idaho Fish and Game agency. He said that sending the children to classes in Shoshone, eight miles away, was unnecessary in his view, but that he understood the parents’ fears. A town he loves has been damaged. There is a lot of debate here about what happened at the town’s only school on Oct. 23 after a football practice: an assault, a racist attack, bullying, a failure of supervision by school officials, or some combination. Hardly anyone disputes, though, that this town of 350 people has been shaken to the core. State and local prosecutors say that several white football players bullied and brutally assaulted a mentally disabled black teammate in a locker room that October day, shoving a coat hanger into his rectum while other boys held his arms. Two of the players accused in the attack were charged as adults with felony sexual assault and could face life in prison if convicted. A third teammate has been charged as a juvenile. A preliminary hearing on the criminal charges is scheduled for Friday. In addition, a $10 million federal civil suit was filed last month by the boy’s adoptive parents, Tim and Shelly McDaniel, who are white. In it, they accused the school district and its administrators, trustees, employees and volunteers of failing in their legal duty to protect the McDaniels’ son, who they say endured months of racist taunts, humiliation and physical abuse. After the   attack, the boy required treatment at two hospitals for rectal injuries. “The school district and individual defendants acted with deliberate indifference to the harassment, humiliation, mental and physical abuse and mistreatment of the plaintiff by students of the district and thereby permitted and caused him to be bullied, beaten and raped,” the lawsuit said. In big ways and small, the repercussions of both the crime and the family’s response are already rippling out, no matter what happens in court or at the school, which has 245 students in grades  . Mr. McDaniel, 60, who has taught science at the school for 21 years, put the family’s house up for sale last month and is looking for work elsewhere. The cars and trucks that sometimes slowly cruise by out front, he said, and the funny looks he gets around town have unnerved him and his wife, who is 51. On July 1, a state law allowing Idahoans to carry a concealed weapon without a permit will take effect, and Mr. McDaniel said he planned to be armed after that. “If I could be gone today, I’d be gone,” he said, sitting outside in the yard on a recent afternoon as dogs wandered about near chicken and goat pens. The McDaniels stood out here in rural Idaho even before the   episode. Over the years, they have adopted 20 children of various races  —   white, Hispanic and black  —   many of them with physical, mental or emotional troubles, including autism and fetal alcohol syndrome. A few years ago, Mr. McDaniel raised hackles by teaching sex education in his science classes with illustrations that some critics said were too graphic, and one of his daughters led a campaign on Facebook to save his job. The legal terrain to come is a minefield in itself, education law experts said. Courts have generally recognized that school officials cannot be everywhere all the time, and have not typically held teachers, administrators or coaches legally responsible for occasional bullying. But that deference can fade when race, religion or disability is involved, said John Dayton, a professor of education law at the University of Georgia. In those cases, courts have sometimes tilted hard the other way, he said, if they find that a clearly vulnerable group or category of students was not sufficiently protected. Other education experts said the central question raised by the McDaniels’ lawsuit  —   whether school officials should be held responsible for failing to stop a culture of bullying before it escalates to violence  —   had become harder to answer as new and different ways of bullying have proliferated. “The expectation of supervision has increased,” said Ann E. Blankenship, an assistant professor of educational leadership at the University of Southern Mississippi. Technology, she added, “opens the door to bullying opportunities 24 hours a day. ” Don Heiken, Dietrich’s mayor, has publicly called on the school to fire people involved in the football program, who he said must have been aware that bullying, if not outright racism, was getting worse. The boy, according to his parents’ suit, was stripped of his pants on the bus after one football game, while other students took photos. He was “continuously” subjected, the suit said, to “wedgies”  —   his underwear yanked sharply upward, sometimes so violently that he came home with torn shorts. “They had to have known,” Mr. Heiken said in an interview. It probably did not help, Mr. McDaniel said, that in a school where sports are hugely important, his son was unskilled at football. Unable to remember the plays, the boy was called offsides  —   crossing the scrimmage line before the ball was snapped  —   six or seven times in a row in a single game, his father said. Dietrich itself, about 35 miles from Twin Falls and about 60 miles from the resort community of Sun Valley, is changing and growing, which has become part of the discussion about what happened here. The population has doubled in the last couple of decades and is expected to double again even faster, according to a planning presentation made recently to the town council. Lynn Johnson, 78, said “outsiders,” as he called the wave of newcomers, were changing the town where he has lived for the past 42 years, and not always for the better. Both of the students charged as adults in the case  —   Tanner Ray Ward, 17, and John R. K. Howard, 18  —   were relatively new to the community, for example. The defendant being tried as a juvenile has not been named in court documents. “Neither of them boys are from Dietrich,” said Mr. Johnson, who drove a school bus and did maintenance work for the school for 17 years. “It wouldn’t have happened without them. ” A lawyer for Mr. Ward declined to comment, and a lawyer for Mr. Howard did not respond to phone messages. The school superintendent and principal, both defendants in the civil suit, did not respond to emails and phone messages. Mr. Grissom, who lives just a few blocks from the school, said that he knew and admired the McDaniel family, and that he thought that admiration was shared in much of the town. That they would move away was one more piece of the damage, he said. “People look at this and say a lot of people are prejudiced here,” Mr. Grissom said. “They’re not. ”'"}, "time": 1742562092.2684631}