{"duration": 0.13345861434936523, "input_args": {"text": "'South Korea’s Park   has become the first president in its history to be ousted from power via impeachment following allegations of granting inappropriate government access to a senior member of a   organization. [Koreans took to the streets after the announcement of the impeachment both to protest and celebrate, with one Seoul rally leaving two dead and two critically injured.  Koreans took to the streets after the announcement of the impeachment both to protest and celebrate, with one Seoul rally leaving two dead and two critically injured. After an extended investigation process, the nation’s Constitutional Court ruled that Park would be immediately stripped of her power as chief executive. South Korea will hold a presidential election within 60 days to replace her, one that many believe will benefit the leftist opposition party. Park is the first South Korean president to be removed in such a way. The announcement triggered assemblies  —   both protests and rallies  —   almost immediately, as some had begun congregating before the ouster became public to share the moment. In Seoul, two senior citizens were killed amid the chaos. According to the South Korean news agency Yonhap, the victims were two men named Kim (no relation) one aged 72 and the other, 66. The elder Kim died after being bludgeoned in the head with a large speaker. “Kim was found bleeding from his head near the court at around 1 p. m.,” Yonhap reports. The younger Kim “was found unconscious at a subway station,” but police have not identified a cause of death publicly yet. Police arrested one man in relation to the death of the elder Kim, who was seen ramming a vehicle into the police car carrying that speaker that ultimately hit Kim. Yonhap reports that two others are “in critical condition” but has not revealed any more information. The outlet added that, while one of the deaths appears accidental, many protesters took the streets of Seoul carrying “makeshift weapons, such as wooden sticks” to use against police. CNN reports that Seoul placed 21, 000 police officers on standby in case protests turned violent. That reality appeared to materialize rapidly, as dozens of protesters attempted to break police lines to storm into the courthouse where the impeachment decision was announced. While many lamented the end of Park’s tenure as president, leftists took Seoul’s streets to celebrate. Yonhap reports that some businesses offered free food and drink to celebrate, while a movie theater offered free viewings. Leftist   did not appear fully satisfied, however, as they chanted “Arrest Park  !” following the impeachment announcement. Also among those celebrating is the government of North Korea. Pyongyang had long reviled Park, an aggressive opponent of the Communist dictatorship whose parents were both assassinated by North Korean agents. On Friday, the government propaganda newspaper Rodong Sinmun published a final farewell to Park, addressing her as the “witch of Chongwadae [the Blue House, South Korea’s presidential palace]. ” “Nothing is more foolish than the   efforts of the traitor and her group to stem the trend of the times,” a Rodong editorial read. “With the publication of the special investigation results, Park is fated to be recorded as the worst ‘president’ and meet the most shameless end in the south Korean history of politics. ” What Park’s ouster means for the volatile relations between North and South Korea remains unclear. The leftist opposition in Seoul has long called for more diplomacy with Pyongyang and less cooperation with allies like the United States. America began deploying the first parts of a defense system known as THAAD (Terminal High Altitude Area Defense) this week, intended to protect from rogue North Korean rockets. Should South Korea elect a leftist president, such defenses may no longer be in the cards for that nation. The South Korean Unification Ministry issued a statement Friday insisting it would “maintain steady preparedness” following her removal. Park was impeached following the revelation that a close friend of hers, Choi   had been privy to classified information and given the opportunity to edit Park’s nationals security speeches. Choi has ties to a group called the “Eternal Life Church,” which many in South Korea consider a cult. Park issued multiple apologies following the revelation, while Choi issued a statement insisting that her illicit government involvement “deserves death. ”'"}, "time": 1742563889.2625258}