{"duration": 0.05797457695007324, "input_args": {"text": "'  => \\nDid Donald Trump unite the American Silent Majority behind things true and shared? \\nThese are economic prosperity, national pride and unity, recognizable neighborhoods—a yen that demands an end to the transformation of neighborhoods through centrally planned, mass immigration—and an end to gratuitous wars. \\nThose were the questions asked in “The Trump Revolution The Donald’s Creative Destruction Deconstructed” (June 29, 2016), and answered in the affirmative. \\nUnlike America’s self-anointed cognoscenti, some of us saw this coming. The former recognize truth only once card-carrying members arrive at it independently, grasp and broadcast it, sometimes years too late. Not so America’s marginalized writers. Not in 2012, but in 2002 did we pinpoint the wrongness of the Iraq War. And not in 2016, but in July of 2015 did some of us, not fortuitously, finger Trump as “a candidate to ‘kick the crap out of all the politicians’” and “send the system’s sycophants scattering” (August 14, 2015). His appeal, as this writer has contended since late in 2015, transcended left and right. \\nConversely, vaunted statistician Nate Silver “calculated, last November, that Trump’s support was ‘about the same share of people who think the Apollo moon landings were faked.’” (Professor Tyler Cowen of George Mason University properly downgraded wonder boy Silver’s intellectual prowess. His prose, wrote the good teacher, was a sprawl that “evinces a greater affiliation to rigor with data analysis than to rigor with philosophy of science or, for that matter, rigor with rhetoric.”) \\nGiven the disparate groups that rooted for Mr. Trump’s candidacy, it would appear that he did in fact awaken a historic majority. You could say Mr. Trump was an “omnibus candidate,” a concept floated by historian David Hackett Fischer. An omnibus campaign is one that appeals in all cultural regions. Back in the 1840 and 1848 elections, William Henry Harrison and Zachary Taylor, respectively, proved to be “omnibus candidates,” popular across cultural regions. In his ability to run strongly in almost every cultural region, Trump is the closest the country has come in a long time to an “omnibus candidate.” \\nPresident-elect Trump answered the many prayers of very many people. \\nThe establishment’s reaction to the Trump revolution comports with “the conduct of elites,” also traced by Hackett Fischer in his towering text, “Albion’s Seed: Four British Folkways in America”: “There is a cultural equivalent of the iron law of oligarchy. Small groups dominate every cultural system. They tend to do so by controlling institutions and processes, so that they become the ‘governors’ of a culture in both a political and mechanical sense.” \\n“The iron law of cultural elites is an historical constant,” posited Hackett Fischer in his magisterial account of American cultural and social origins. “But the relation between elites and other cultural groups is highly variable. Every culture might be seen as a system of bargaining, in which elites maintain their hegemony by concessions to other groups.” \\nThese old bargaining processes may have worked in New England’s town system, where each community enjoyed a “high degree of autonomy and also a common interest in supporting the system itself.” But “reciprocal liberty” in early America’s “back settlements” has long since given way to elite solidarity, hegemony, log-rolling and collusion with favored interests. \\nIn virtue, the American oligarchy currently in control of the intellectual means of production bears no resemblance to the natural aristocracy, the object of Thomas Jefferson’s lauding reflections. Likewise, Sir William Berkeley’s concept of a society governed by “gentlemen of honor, courage and breeding” is nowhere seen in the fragmented, faction-based politics of America. This is not to say that Mr. Trump exemplifies these lost qualities, but, as “The Trump Revolution” contends, there is a distinct element of gruff, made-in-America noblesse oblige to Trump’s political crusade. \\nPut it this way, President-elect Trump is unlikely to be caught off-guard mouthing his contempt for small-town America, as Barack Obama did in depicting potential voters as clinging to their guns, god and other “bigotries.” It’s hard to imagine President-elect Trump ever demonstrating the cruelty and hypocrisy of a Gordon Brown, Great Britain’s former prime minister. In May of 2010, after hearing Mrs. Gillian Duffy’s worries over deficits and immigration, the pompous, two-faced boor of a prime minister retreated to his limousine, and, microphone on, proceeded to berate this perfectly decent lady, calling her “horrible,” “old woman,” and “bigoted.” \\nThe Trump presidency is the last heave-ho of America’s Mrs. Duffys; of America’s historic, founding majority. \\nAlmost 200 years on, Albion’s seed is scattered, diluted and demoralized. More so than cultural identities, issues have come to dominate elections. The Trump revolution boiled down to fundamental things like Islam (“no thanks”), immigration (“much less”), and a government that refused to heed. \\nIn the short term, the success of this majority awakened and its candidate will depend on President-elect Trump’s ability to beat back the sprawling political machine that makes up the D.C. Comitatus, now writhing like a fire breathing mythical monster in the throes of death. Or, so we hope.'"}, "time": 1742628408.38582}