{"duration": 0.11569333076477051, "input_args": {"text": "'The Federal Reserve took action on Wednesday against Goldman Sachs and one of its former executives, escalating a   investigation into a leak of confidential government information. The action, which forced Goldman to pay a $36. 3 million penalty, stemmed from an incident in 2014, when a junior Goldman banker took confidential information from the Federal Reserve Bank of New York. The junior banker, whom Goldman promptly fired, received the information from a New York Fed employee. Both men  pleaded guilty to stealing government property, and Goldman paid a $50 million penalty to New York State regulators because its “management failed to effectively supervise” the banker. The Fed did not act against Goldman at the time, making its decision to pursue Goldman now a somewhat unusual move. The action, which cites Goldman for an “unauthorized use and disclosure of confidential supervisory information,” is also an awkward one for the Fed. The leak, after all, originated at the Federal Reserve Bank of New York with one of its own employees. And the junior Goldman banker who received the confidential information was a former New York Fed employee himself. Goldman, not the New York Fed, was the one to uncover the leak. Yet the Fed’s board in Washington, a unit that operates separately from the New York Fed, is the one penalizing Goldman. And the Fed’s action goes further than Goldman’s settlement with New York State last year, reaching back several years to highlight how the bank failed since 2012 to have sufficient policies and employee training to prevent a leak like this one. The case reflects a broader effort at the Fed to adopt a tougher stance against Wall Street misconduct and to crack down on individual bankers. In 2015, the Fed chose to bar six bankers from the industry, twice the number in 2014. The year before that, the Fed did not take any such actions. The Fed’s case against Goldman, the details of which were reported last week by The New York Times, centers on what could have been a regulatory gold mine. The confidential information, the Fed said, included reports of bank examinations and other “confidential reports prepared by banking regulators. ” The documents effectively provided Goldman with a window into the Fed’s private insights about regulatory matters. And the bank, the Fed said, used the information in presentations to current and prospective clients “in an effort to solicit business. ” “The board expects all firms, including Goldman Sachs, to comply with all U. S. laws, rules and regulations,” the Fed said in a statement, noting that it is “illegal to use or disclose confidential supervisory information without prior approval. ” In its own statement, Goldman said it was “pleased to have resolved this matter. ” The bank emphasized that it had fired the former junior banker, Rohit Bansal, and that it had immediately notified the Fed after discovering that he had “improperly obtained information from his former employer, the Federal Reserve Bank of New York. ” Goldman also fired Joseph Jiampietro, an executive who helped oversee Mr. Bansal. Goldman’s investigators found leaked New York Fed documents on Mr. Jiampietro’s desk, though the company never concluded that he knew about the leak. Instead, it reported to regulators that he had “failed to properly escalate” the problem. But now the Fed, unlike New York State, has taken aim at Mr. Jiampietro, previously a senior adviser to Sheila C. Bair when she was chairwoman of the Federal Deposit Insurance Corporation. In announcing an action against Mr. Jiampietro, the Fed said it was seeking to impose a fine and to “permanently bar him from the banking industry stemming from his and his subordinates’ unauthorized use” of confidential information. Unlike Goldman, Mr. Jiampietro’s lawyers are fighting the case through the Fed’s civil disciplinary proceedings, disputing that Mr. Jiampietro had anything to do with the leak. They note that Mr. Bansal, who accepted a misdemeanor plea deal with federal prosecutors in Manhattan, did not explicitly accuse Mr. Jiampietro of instructing him to obtain the documents. In a previous statement, a lawyer for Mr. Jiampietro accused the Fed of appearing to use his client “as an industry scapegoat. ” The lawyer, Adam Ford of the law firm Ford O’Brien, added on Wednesday that “the allegations filed against Mr. Jiampietro are demonstrably false. ” Mr. Jiampietro, he said, “never requested confidential supervisory information from anyone and never used it for his or anyone’s benefit. ” “The Fed has the law wrong and the facts wrong,” Mr. Ford said. “Mr. Jiampietro intends on fighting these allegations and looks forward to full vindication. ” The Fed’s actions on Wednesday were not its first to stem from the leak. The New York Fed fired its employee and notified law enforcement agencies, saying at the time that it was “resolute to learn from our experiences. ” The Fed board in Washington also permanently barred Mr. Bansal from the industry. Goldman, which under the terms of its settlement with the Fed must enhance its program for preventing its employees from soliciting or accepting leaked regulatory information, said in its statement: “We previously reviewed and strengthened our policies and procedures after Bansal was terminated. We have no tolerance for the improper handling of confidential supervisory information. ” Mr. Bansal, who received probation for his role in the leak, “looks forward to putting this behind him and moving on with his life,” his lawyer, E. Scott Morvillo, said at the time of his sentencing. And yet the case will linger for Mr. Bansal. The Fed is likely to call him as a witness against Mr. Jiampietro.'"}, "time": 1742564416.0172362}