{"duration": 0.09707903861999512, "input_args": {"text": "'The president of one of the nation’s largest police organizations apologized to minorities on Monday for past mistreatment by the police that has helped fuel a deepening mistrust of law enforcement within predominately black and Hispanic communities. The apology by Terrence M. Cunningham, who leads the International Association of Chiefs of Police, came during a speech in San Diego at the group’s annual conference. The remarks were an unusual yet symbolic step by law enforcement, whose members have often denied responsibility for deteriorating relationships with the communities they serve. For law enforcement officials to regain the trust of minorities, they must begin “to acknowledge and apologize for the actions of the past and the role that our profession has played in society’s historical mistreatment of communities of color,” said Chief Cunningham, who also leads the Police Department in Wellesley, Mass. His comments were met with praise for addressing the problem, and with criticism by some activists and other police groups. Chief Cunningham’s group, which has about 16, 000 members worldwide, was formed in 1893, and is among the nation’s oldest and most respected law enforcement associations. But the organization has resisted recent efforts for change, and it refused to agree to proposals that would encourage officers to use less force  —   including deadly force  —   when confronting suspects. Over the last two years, the fatal shootings of a number of black men, including the deaths last month of Terence Crutcher in Tulsa, Okla. and Keith Lamont Scott in Charlotte, N. C. have increased tensions between the police and   and have led to demands for greater police accountability. Chief Cunningham cited racially biased federal, state and local laws that had made police officers “the face of oppression for far too many of our fellow citizens,” including “ensuring legalized discrimination or even denying the basic rights of citizenship to many of our fellow Americans. ” He added, however, that police critics “must also acknowledge that today’s officers are not to blame for the injustices of the past. ” Chief Cunningham did not mention contemporary issues of police misconduct  —   often related to race  —   that have been documented in recent Justice Department reviews of police departments in Ferguson, Mo. San Francisco Philadelphia and Baltimore, among other places. Critics said Chief Cunningham undercut his message by failing to recognize racism among   police forces. “Police racism is not just a relic of history. Until police leaders acknowledge that bias is a problem right now, they will not have earned the confidence of communities of color,” said Paul Butler, a former federal prosecutor, a law professor at Georgetown University Law Center and the author of “Let’s Get Free: A   Theory of Justice. ” Chief Cunningham wrote in an email after his speech: “Too many lives have been lost already, and this must end. It is my hope that many other law enforcement executives will deliver this same message to their local communities, particularly those segments of their communities that lack trust and feel disenfranchised. ” For some police groups, the remarks by Chief Cunningham  —   who is stepping down this week as the organization’s leader  —   were an unfair criticism of officers, who are working in one of the most difficult periods in   relations in recent history. “Such appeasement of the violent   movement is just one more nail in the coffin of American law enforcement,” said William Johnson, the executive director of the National Association of Police Organizations. “The people who support American police officers aren’t looking for an apology. And for the people who hate the police, it won’t make any difference. ” Kofi Ademola, a Black Lives Matter organizer in Chicago, said that if there was to be an honest conversation about policing, then law enforcement organizations like Chief Cunningham’s would not only have to address contemporary police misconduct, but also be willing to discuss the violence that Mr. Ademola said was inherent in policing. While Chief Cunningham’s apology might not be entirely satisfactory for critics of the police, it represents progress, said David A. Harris, a professor at the University of Pittsburgh School of Law who has written about police accountability. “It has been a long time coming,” he said. “It might not be enough, but at least it represents an openness to understanding that the police have been at the tip of the spear in discriminatory policies. ”'"}, "time": 1742563461.4235651}