{"duration": 0.04820537567138672, "input_args": {"text": "'Leeks \\n\\nVegetables that do not like to be disturbed include many of the root vegetable varieties such as Carrots, Beets, Turnips, and Parsnips. Many of the root vegetables are cold-hearty and can withstand colder temperatures, and therefore be directly planted in the ground as soon as temperatures are above 39 F for the season. Several vegetables that are a bit trickier include corn, beans, and peas. These vegetables have a much more sensitive root system and do well when they are directly planted into the ground once the season has come, after the last frost when temperatures begin to warm and sunlight increases. \\n\\nWhen your seedlings have matured enough and the temperature outside is warming, it is time to start thinking about getting your vegetables outside and into the garden. This typically happens after the last frost, when the outdoor temperature is above 59 F. If nighttime temperatures drop a lot lower than this, wait another week or two. \\n\\nCold weather can rot seedlings and shock them, even killing tender crops. Once you are confident that temperatures and weather outside is optimal, begin to harden your seedlings and prep them for transplanting. \\n\\nTo do this, place your seedlings outside in a shaded area with filtered light and slowly, over the course of a week, expose them to more and more sunlight. Seedlings grown indoors are usually quite fragile and soft, and need time to harden before being planted outside in the ground. \\n\\nOnce your seedlings have been planted in the ground, ensure that they are watered immediately. Some may droop or wilt as a result of being transplanted, but most will rebound after they have had time to adjust to their move. Be sure not to over water new transplants because they will be unable to use all the moisture around them and soon rot. \\n\\nStarting seedlings inside will give you a fun activity to do indoors and your garden will thank you in spring! \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She graduated The Evergreen State College with an undergraduate degree focusing on Sustainable Design and Environmental Science. Follow her adventures on Instagram.'"}, "time": 1742628340.9179611}