{"duration": 0.11826395988464355, "input_args": {"text": "\". Finding the Doorway Out of the Matrix I am a bigger picture person. I have studied the light and the dark sides on this reality and of mys... Print Email http://humansarefree.com/2016/11/finding-doorway-out-of-matrix.html I am a bigger picture person. I have studied the light and the dark sides on this reality and of myself intensively, and I have found that there is one thing that will make my doorway or exit from this reality appear. This thing that I speak of has been forgotten m=by many playing the game of the intense polarities.The main focus of my website is to share my personal experience and insights on the true nature of our reality and who we really are.In summary, it is my observation that the reality that we see, taste, touch, feel, and see is a holographic matrix created in order to experience a third dimensional physical reality.Within this reality that we are experiencing is an extreme polarity of dark and light. The reason for the extreme polarity is that Earth is shifting out of this vibrational frequency into a higher vibrational frequency, and in order for humanity to follow suit, they need to “wake up”. Waking up involves questioning everything in your reality and awareness. Extreme circumstances push people toward change and out of stagnation. Who are you and why are you here? Waking up also involves knowing who you are and how you got here. It is very similar to waking from a dream. When you know who you are and when you realize that you are not your body and that you never die, a freedom washes over you that allows you to have an inner peace while our reality collapses. This brings us closer to the understanding and remembrance of what we need to do to find the doorway out. You are here on Earth at this time so that you can wake up and exit the matrix that you have been a part of for eons of “time”, as Earth serves as a portal out of the third dimension and extreme polarity. You had to come here first in order to return home. There are even some some souls that left their peaceful worlds to come here to help those that have been stuck a very long time find the door when it is available. The key to exiting the matrix I have served the darkness (mostly from ignorance or trickery) and I have also served the light in many lifetimes. I have been the extreme pendulum, swinging back and forth in order to rectify karma and to expand my soul’s experience. The one thing that I am striving for in this lifetime that will allow me to exit this reality is BALANCE.True balance is achieved when you can see all viewpoints from a higher perspective. You understand the dark’s necessity for energy vampirism and you also understand the light’s need to serve, protect, and fight for freedom. You realize that even the light team can easily become unbalanced, and being an extreme “lightworker” simply attracts the dark like moths to a flame because that is how balance works. For every action their is an equal and opposite reaction.When you realize that ultimately you are only fighting yourself and that by being extreme in anything you are going to attract the opposite polarity, then you can step back and try to figure out how you can stop that fight. It doesn’t mean that you lie down and let the dark take over. It also doesn’t mean that you stand in the power of light will ultimately win the battle for earth and humanity. It means that you pull the dark and light aspects within you, accepting that you played this game to experience everything it had to offer. Zero point Balance brings forth the zero point energy that opens the portal for exiting this reality. Some call it ascension and some call it incension. This portal exists within you and is activated through connecting the heart chakra with the endocrine system. Earth is also receiving frequencies aligned with activating or re-arranging our latent DNA. Only you can activate your portal by accepting and flowing with these frequencies. Once it is activated, you can never be influenced by extreme polarity again and you begin to attract a new reality which is harmonized and balanced. You simply move toward a frequency that resonates with your own frequency.When you begin unlocking the portal, you begin to become the observer of what is unfolding in this reality. You are “in this reality but not of it”. You notice that you are the creator of your reality based on contracts and agreements made before incarnating, but you also see how you can change your reality by making conscious decisions in the now moment that change the past as well as the future. Zero point is the removal of the veil of forgetfulness and the alignment of the wheels of time so that you may see the exit and move toward it. You are an aspect of Source Source created dark and light both. Source created the beings that took over the organic template of Earth and the organic template of the human body that allows experience of the organic Earth. If it was a forbidden thing to do, Earth’s consciousness would not have allowed it in the first place. If it was such a horrible thing, we would never had incarnated into it. We made ourselves a bet before we came here: would we awaken to who we are and realize that we are all of it? Would we learn how to stop the extremity within ourselves into a harmonious balance which sings a new vibration? Escape 'Their' TRAP and Set Your Soul FREE Masculine and feminine imbalance Balance is also missing between the masculine and feminine. Ever since the androgynous human was split into a male and a female for reproductive purposes, there has been a battle for domination and control of the sexes. In Orion, the female queen rules, and on Earth the patriarchal has ruled while the feminine has been suppressed. We have to be careful when we bring the feminine back to Earth that it is not to rule or to dominate males. Currently there are a number of dominating, controlling female programs running that overcompensate for male domination. Since the outer reality is a reflection of within, balancing the male and female aspects of us individually will help to balance it in our reality. This means women can let go of the media programming of oversexuality, high heels, and and starvation and men can learn to feel their emotions rather than playing the tough guy. Chaos brings change and transcendence As Standing Rock unfolds , as the U.S. election comes near , and as your life circumstances seem to morph and change now faster than ever, you realize that the waking life is just a dream or matrix that you wanted to experience. The real you is your oversoul that exists outside of the matrix. This realization brings calm and balance into your life and allows you to observe rather than react and interact with the battle. With this knowledge, you keep your energy for yourself rather than giving it away within the matrix . This energy will then propel you where you need to go when the doorway opens. Don’t get caught up in the distraction of “look over here”. Instead, focus on looking within and moving further away from the illusion.As you continue to observe, your float higher and higher away from the battle into a place of peace and knowing that allows you to continue to reach a higher understanding of what has happened, what is currently happening (and why) and what your future holds. I feel that my future holds a place where extreme polarity no longer exists because it is no longer needed. It will have been a tool for propelling me out of the matrix as I merge with all that I am and all of the lifetimes that my oversoul has had. There is a whole new game waiting for us, and zero point through balance is the stargate that will open the door to a whole new reality. By Michelle Walling Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742562344.3491333}