{"duration": 0.04754066467285156, "input_args": {"text": "'The baseball hazing ritual of dressing up rookies as Wonder Woman, Hooters waitresses and Dallas Cowboys cheerleaders has been banned. Major League Baseball created an   and   Policy that covers the practice and the players’ union agreed not to contest it as part of the new labor deal that was set to be ratified by both sides Tuesday. The policy, obtained by The Associated Press, prohibits “requiring, coercing or encouraging” players to dress up as women or wear costumes that “may be offensive to individuals based on their race, sex, nationality, age, sexual orientation, gender identify or other characteristic. ” Paul Mifsud, a vice president of M. L. B. said Monday the new rules resulted partly “in light of social media, which in our view sort of unfortunately publicized a lot of the dressing up of the players. ” He added, “There’s lots of pictures of baseball players dressed up as Disney princesses. ” All out starting next season: Bryce Harper as a member of the United States Olympic women’s gymnastics team, Mike Trout as Lady Gaga, Manny Machado in a ballet tutu and Carlos Correa as Wonder Woman. “Although it hasn’t happened, you could sort of see how like someone might even dress up in black face and say, ‘Oh, no, we were just dressing up,’” Mifsud said. “We’ve also understood that a number of players have complained about it. ” Exactly when the annual   day began is not quite clear. Players often considered it a form of bonding, and it has become a bigger production in recent years. Chase Headley and other San Diego Padres newcomers wore the skimpy, shiny orange shorts and tight, white tops of Hooters servers for a flight from Denver to Washington in September 2008. “Times have changed,” said Dave Prouty, the players union general counsel. “There is certain conduct that we have to be conscious of. ” Prouty said the union’s focus was to preserve the players’ rights to challenge the level and imposition of discipline. Not all outfits have been banned  —   superheroes such as Batman and   are still permitted. Other past costumes that would be allowed include the giant ketchup bottle worn by the San Francisco ace Madison Bumgarner, the Olympic men’s water polo uniform worn by the Miami slugger Giancarlo Stanton, and the Gumby costume donned by the Dodgers outfielder Yasiel Puig. Last September, the Mets posted photos and video of players going to Starbucks in Philadelphia wearing uniforms from the   Girls Professional Baseball League, as portrayed in the 1992 movie “A League of Their Own. ” Several other teams engaged in similar behavior. In 2012, Harper and other Nationals newcomers wore red leotards in the style of Gabby Douglas and the U. S. women’s gymnastics team for a train ride to New York. The veteran pitcher Gio Gonzalez posted a photo in Twitter. In 2007, the Yankees’ theme was “The Wizard of Oz. ” Ian Kennedy wore Dorothy’s ruby red slippers for a flight from New York to Tampa, Florida. “I’d rather be here dressing up than anywhere else,” Kennedy said at the time. “It makes you feel like one of the guys. ” The new policy states “a player’s actual or perceived willingness to participate in prohibited conduct does not excuse the activity from being considered a violation of the policy. ” Not everyone saw them as fun. After he was traded to the Mets in 1992, Jeff Kent threw a pimp costume to the floor in the visitors’ clubhouse in Montreal and demanded that his regular clothes  —   which contained the identification that he needed to go through customs  —   be returned. “I paid my rookie dues in Toronto,” he said then. “I feel I have endured my embarrassments, my punishment. I felt I was being taken advantage of. They wanted to go overboard. I stuck up for myself. I won’t be pushed around. ” Some common rookie rituals will be permitted. Last year, the Cardinals and Dodgers made their newcomers walk across the street from Wrigley Field  —   in their full uniforms  —   to bring back coffee before a game against the Cubs. And rookie relievers still might find themselves lugging snacks across the diamond to the bullpen for the veterans. But requiring players “to consume alcoholic beverages or any other kind of drug, or requiring the ingestion of an undesirable or unwanted substance (food, drink, concoction)” is banned under the new collective bargaining agreement. The policy is in addition to the workplace code of conduct adopted by M. L. B. and the union in 2013 after the office of New York Attorney General Eric Schneiderman asked to meet with baseball officials and inquired what rules the sport had in place against bullying with respect to sexual orientation. “The purpose of this policy is not to prohibit all traditions regarding rookies or players,” the new policy document said, “but rather to prohibit conduct that may cause players physical anguish or harm, may be offensive to some players, club staff or fans, or are distracting to the operation of the club or M. L. B. ”'"}, "time": 1742628447.9096777}