{"duration": 0.131087064743042, "input_args": {"text": "'Why isn’t the Democratic Party landsliding the worst and cruelest Republican Party in the past 162 years?\\nJust take a glance at their record votes and you’ll wonder why the Republican representatives don’t just incorporate themselves and be done with any pretense that they are real people.\\nA brief look at a compilation of Republican votes during the years 2011-2012, when the Republicans controlled the House, demonstrates that they regularly choose Wall Street over Main Street, drug and oil, banking and insurance companies over consumers. And that Republicans want tiny enforcement budgets against corporate crime to assure that hundreds of billions of your health and other consumer dollars are not recovered from the corporate criminals ($60 billion a year alone in business frauds on Medicare).\\nRepeatedly, these Republicans, often a unanimous 100% of them, in a bizarre kind of corporate-conditioned response, vote in favor of corporations shipping American jobs overseas rather than voting to protect American workers. This Republican-controlled congress was intent on defending and increasing massive tax breaks for the wealthiest at the expense of the lower income families, attacking Medicare, social security, and other programs assisting elderly Americans, even assaulting women’s health and safety, opposing stronger food safety enforcement and preventing toxic pollution controls while at the same time protecting rapacious student loan companies and keeping victims of mortgage companies and banks defenseless against onslaughts of insurmountable debt accumulation.\\nThey also passed a bill to pay members of Congress during a GOP-led government shutdown, however, while refusing to guarantee that soldiers would get paid during the same shutdown. Moreover, the Republicans have this strange antagonism toward encouraging more people to vote, and assuring that every vote counts.\\nGo past the façade of the Republican rhetoric praising heroic veterans are their grim votes against protecting veterans from rip-offs as borrowers for their consumer, education and housing needs.\\nFast forward to the last two years and you’ll find the same corporatist grip on the House. Fifteen times House Republicans have voted for measures attacking women’s health; blocked all votes on comprehensive immigration reform; gave the back of their hand against children’s well-being; twice voted unanimously against affirming that climate change is real and passed tax cuts of which 99.6 percent go to the richest 1 percent of Americans. Furthermore, they have voted unanimously against even considering a constitutional amendment to overturn the Supreme Court’s 5-4 Citizen’s United decision that opened the floodgates of big corporate money in elections. They continue to protect secret money in elections and twice voted against even allowing a vote on the Paycheck Fairness Act giving women new tools for equal pay for equal work.\\nOne hundred percent of all House Republicans voted against allowing a vote to let American workers earn just seven job-protected paid sick days each year – less than has been given for years in western-European countries.\\nSo in hock are they to the student loan industry, the Republicans have repeatedly voted against bringing up for a vote the student loan refinancing bill. One hundred percent of House Republicans voted against even bringing up a bill to stop big companies from dumping their U.S. charter and fleeing abroad to avoid paying their fair share of taxes. Lead-poisoned children in Flint, Michigan got the straight-arm by 236 House Republicans. Republicans held zero hearings in 2016 on the president’s 2017 budget – an unheard of breach of legislative duty.\\nHouse Republicans in recent years have stupidly cut the IRS budget facilitating $400 billion of uncollected taxes each year, thereby swelling the federal deficit that the GOP is supposed to care about. The Republicans are knowingly complicit in protecting tax evasion.\\nWorse, these Republicans are complicit in shielding over $330 billion each year in computerized billing fraud. This corporate crime wave estimate comes from the leading expert on billing fraud, Harvard Professor Malcolm Sparrow (author of License to Steal ), backed by an earlier report from the Government Accountability Office of the Congress. There simply is too little budget for adequate investigators and prosecutors even when every dollar in enforcement brings about ten dollars in recoveries and fines!\\nWhy doesn’t all of this anti-human record make news? First, these bills are almost always blocked by the Democrats in the Senate. Second, many of these votes by the House Republicans are blocking votes to require on-the-record roll call votes that show each member’s position on a bill. Third, let’s be clear, the media, which has reporters swarming all over Capitol Hill, is not doing its job.\\nFourth, there aren’t a tiny fraction of the civically active people back home organized to publicize the votes by their member of Congress. Fifth, the lack of dynamic leadership by Congressional Democrats included being rolled by a Republican strategy to up the GOP’s advantage in the number of gerrymandered districts in 2010 (brilliantly reported in David Daley’s new book, Ratf**ked: The True Story Behind The Secret Plan to Steal America’s Democracy ).\\nIn the final analysis, the blame is on the Democratic Party that does not give us a competitive election process over substantive matters uppermost in the minds of the American people. It took strenuous demands by some civic leaders in Washington, D.C. just to get the House Democrats to compile these aforementioned Republican votes and passively release them in a concise form to the public and then only a month before the November elections! With few exceptions, Democrats astonishingly do not campaign on such a base Republican misery index.\\nUnfortunately, many Democratic candidates are dialing for the same campaign dollars as their Republican opponents and many Democratic incumbent candidates are ensconced in safe, non-competitive electoral districts (often because of their gerrymandering). Consequently, they don’t make an effort to show the callousness and cruelty of the Republican Party.\\nFor any further explanation of this Democratic Party’s dysfunctional indifference to winning back the House of Representatives, based on the abysmal record of the Republican Party, call in some social psychologists specializing in group machoism.\\nTo see the full list for yourself – see 2012 and 2016 .\\n Ralph Nader is a consumer advocate, lawyer and author of Only the Super-Rich Can Save Us!'"}, "time": 1742563086.0920203}