{"duration": 0.04026222229003906, "input_args": {"text": "'Fight Inflammation with These 9 Vitamins and Minerals (And where to get them) http://blogs.naturalnews.com/fight-inflammation-9-vitamins-minerals-get/ \\nBy Twain Yobra \\nPosted Monday, October 31, 2016 at 12:42pm EDT \\nVitamins and minerals play vital roles in the body. And one of their most important role is fighting inflammation. And this can reduce risk of diseases like arthritis, heart disease and so on. \\nHere are 9 anti-inflammatory vitamin and minerals you should include in your diet. \\n1. Vitamin E \\nThis antioxidant will fight inflammation. You can get vitamin E from natural sources seeds and nuts like almonds, peanuts and so on. Avocado and spinach are also great sources. \\n2. Magnesium \\nResearch shows that magnesium will keep you relaxed, increases energy, improves heart health and much more. Unfortunately most people are magnesium deficient. Good food sources of magnesium include beans, nuts, leafy greens, whole wheat bread, carrots, and meat. \\n3. Vitamin B \\nLow levels of B vitamins increase risk of inflammation. Natural sources include broccoli, kale, cauliflower, bell pepper, chicken, tuna and chickpeas. \\n4. Glutathione \\nThis antioxidant will definitely fight inflammation. You can get it from garlic, apples, tomatoes, apples, grapefruit and avocado. \\n5. Vitamin C \\nVitamin C is known to strengthening the immune system, reducing toxicity and even fights cancer. Lemon water, tomatoes, and oranges are great sources of vitamin C. \\n6. Vitamin D \\nVitamin D deficiency plus poor nutrition can lead to chronic inflammation. Sunlight is the most popular sources of vitamin D, other sources including avocado, spinach, seeds and nuts. \\n7. Vitamin K \\nVitamin K prevents the body from heart disease, osteoporosis. Get vitamin K eggs, liver, cabbage, cauliflower, spinach and kale. \\n8. Coenzyme Q10 \\nThis antioxidant has anti-inflammatory properties. You can get it from natural sources like olive oil, walnuts, peanuts, spinach, mackerel, beef liver, and sardines. \\n9. Vitamin A \\nVitamin A protects the body against free radicals. You can increase levels of vitamin A by eating carrots, broccoli, sweet potato, kale, collard greens, cantaloupe, dandelion, and spinach. \\nFor more information on eating healthy and staying fit, download your FREE 3 Weeks Flat Stomach Guide to help you improve your health and physique. And like our Facebook page . You might also like…'"}, "time": 1742562956.595872}