{"duration": 0.06900715827941895, "input_args": {"text": "'The prophecy is coming true. \\nEvery cuck loser who enters Trump’s proximity turns into a mega-shitlord. \\nNewt Gingrich just taught the slut Megyn [sic] Kelly how to shut her whore mouth. \\nWow. \\nWashington Post : \\nGingrich, on Fox in his role as a Donald Trump surrogate, had questioned the stories of women whoâ\\x80\\x99ve come forward to accuse Trump of sexual assault â\\x80\\x94 and the relative importance of the controversy itself, relative to Hillary Clintonâ\\x80\\x99s alleged misdeeds. \\nKelly pushed back. â\\x80\\x9cAs a media story, we donâ\\x80\\x99t get to say that 10 women are lying. We have to cover that story, sir,â\\x80\\x9d said the Fox anchor. \\nâ\\x80\\x9cSure. Okay,â\\x80\\x9d Gingrich said. â\\x80\\x9c So, so itâ\\x80\\x99s worth 23 minutes of the three networks to cover that story, and Hillary Clinton had a secret speech in Brazil to a bank that pays her 225,000 [dollars], saying her dream is an open border where 600 million people could come to America â\\x80\\x94 thatâ\\x80\\x99s not worth covering â\\x80Ś â\\x80\\x9d \\nâ\\x80\\x9cThat is worth covering,â\\x80\\x9d interjected Kelly. â\\x80\\x9cAnd we did.â\\x80\\x9d \\nGingrich was still speaking: â\\x80\\x9c â\\x80Ś I mean, you want to go back through the tapes of your show recently, you are fascinated with sex, and you donâ\\x80\\x99t care about public policy. â\\x80\\x9d \\nâ\\x80\\x9cMe? Really?â\\x80\\x9d she said, laughing. \\nâ\\x80\\x9cWell, thatâ\\x80\\x99s what I get out of watching you tonight,â\\x80\\x9d Gingrich said. \\nCue crosstalk. \\nKELLY: â\\x80\\x9cYou know what, Mr. Speaker, Iâ\\x80\\x99m not fascinated by sex. But I am fascinated by the protection of women â\\x80Śâ\\x80\\x9d \\nGINGRICH: â\\x80\\x9cOkay.â\\x80\\x9d \\nKELLY: â\\x80\\x9c â\\x80Ś and understanding what weâ\\x80\\x99re getting in the Oval Office â\\x80Śâ\\x80\\x9d \\nGINGRICH: â\\x80\\x9cOkay.â\\x80\\x9d \\nKELLY: â\\x80\\x9c â\\x80Ś and I think the American voters would like to know â\\x80Śâ\\x80\\x9d \\nGINGRICH: â\\x80\\x9cAnd, therefore, weâ\\x80\\x99re going to send Bill Clinton back to the East Wing, because after all, you are worried about sexual predators.â\\x80\\x9d \\nâ\\x80\\x9cYeah, listen, itâ\\x80\\x99s not about me,â\\x80\\x9d Kelly said. â\\x80\\x9cItâ\\x80\\x99s about the women and men of America. And the poll numbers show us that the women of America, in particular, are very concerned about these allegations and, in large part, believe that they are a real issue. And donâ\\x80\\x99t dismiss the women â\\x80Śâ\\x80\\x9d \\nAnd: resume crosstalk. \\nGINGRICH: â\\x80\\x9cYou want to comment, you want to comment â\\x80Śâ\\x80\\x9d \\nKELLY: â\\x80\\x9c â\\x80Ś donâ\\x80\\x99t dismiss the women summarily.â\\x80\\x9d \\nGINGRICH: â\\x80\\x9c â\\x80Ś on whether the Clinton â\\x80\\x94 do you want to comment on whether the Clinton ticket has a relationship to a sexual predator.â\\x80\\x9d \\nKELLY: â\\x80\\x9cWe on â\\x80\\x9cThe Kelly Fileâ\\x80\\x99 have covered that story as well, sir. I will tell you, the polls â\\x80Śâ\\x80\\x9d \\nGINGRICH: â\\x80\\x9cNo, I just want to hear you use the words. I want to hear you use the words â\\x80\\x98Bill Clinton, sexual predator.â\\x80\\x99 I dare you. [At that point, Gingrich was smiling slightly. Kelly was not.] â\\x80\\x9cSay â\\x80\\x98Bill Clinton, sexual predator.â\\x80\\x99â\\x80\\x9d \\nKELLY: â\\x80\\x9cMr. Speaker, weâ\\x80\\x99ve covered â\\x80\\x94 excuse me, sir â\\x80Śâ\\x80\\x9d \\nGINGRICH: â\\x80\\x9cDisbarred by the Iowa, by the Arkansas bar.â\\x80\\x9d \\nKELLY: â\\x80\\x9cExcuse me. excuse me.â\\x80\\x9d \\nGINGRICH: â\\x80\\x9cDisbarred by the Arkansas bar. Eight hundred fifty thousand dollar penalty.â\\x80\\x9d \\nKELLY: â\\x80\\x9c â\\x80Ś excuse me, sir. We on â\\x80\\x98The Kelly Fileâ\\x80\\x99 have covered the Clinton matter as well. Weâ\\x80\\x99ve hosted Kathleen Willey â\\x80Śâ\\x80\\x9d \\nGINGRICH: â\\x80\\x9cWell, try saying it.â\\x80\\x9d \\nKELLY: â\\x80\\x9c â\\x80Ś weâ\\x80\\x99ve covered the examples of him being accused as well, but heâ\\x80\\x99s not on the ticket. And the polls also show that the American public is less interested â\\x80Śâ\\x80\\x9d \\nGINGRICH: â\\x80\\x9cHeâ\\x80\\x99ll be in the, heâ\\x80\\x99ll be in the East Wing.â\\x80\\x9d \\nKELLY: â\\x80\\x9c â\\x80Ś in the deeds of Hillary Clintonâ\\x80\\x99s husband than they are in the deeds of the man who asks us to make him president, Donald Trump. Weâ\\x80\\x99re going to have to leave it at that, and you can take your anger issues and spend some time working on them, Mr. Speaker. Thanks for being here.â\\x80\\x9d \\nGINGRICH: â\\x80\\x9cAnd you, too.â\\x80\\x9d \\nI haven’t seen a bitch get shut down like this since the 80s. I thought he was going to reach through the screen and start slapping her around, OLD SCHOOL. \\nI hate this bitch so, so much. \\nShe alone is proof that women should never, under any circumstances, be allowed to leave the kitchen or speak with men who are not their husbands, fathers or brothers. \\nBecause really, as funny as this exchange was, it isn’t really about sex. If it was about sex, as Newt mentions, she could easily focus on Bill, who is a literal rapist. \\nIt is about sexism. \\nAnti-male sexism by a feminist whore. \\nMegyn [sic] Kelly should be in prison.'"}, "time": 1742564121.142131}