{"duration": 0.257892370223999, "input_args": {"text": "'There is a strange little cultural feedback loop that’s playing out again and again on social media. It begins with, say, a white American man who becomes interested in taking an outspoken stand against racism or misogyny. Maybe he starts by attending a Black Lives Matter demonstration. Or by reading the novels of Elena Ferrante. At some point, he might be asked to “check his privilege,” to acknowledge the benefits that accrue to him as a white man. At first, it’s humiliating  —   there’s no script for taking responsibility for advantages that he never asked for and that he can’t actually revoke. But soon, his discomfort is followed by an urge to announce his newfound   awareness to the world. He might even want some public recognition, a social affirmation of the work he has done on himself. These days, it has become almost fashionable for people to telegraph just how aware they have become. And this uneasy performance has increasingly been advertised with one word: “woke. ” Think of “woke” as the inverse of “politically correct. ” If “P. C. ” is a taunt from the right, a way of calling out hypersensitivity in political discourse, then “woke” is a   from the left, a way of affirming the sensitive. It means wanting to be considered correct, and wanting everyone to know just how correct you are. In the ’70s, Americans who styled themselves as “radical chic” communicated their social commitments by going to cocktail parties with Black Panthers. Now they photograph themselves reading the right books and tweet   tuned platitudes in an effort to cultivate an image of themselves as politically engaged. Matt McGorry, the actor who plays a sweetly doofy prison guard in “Orange Is the New Black,” is a helpful case study of this phenomenon. McGorry’s Instagram presence was once blithely     —   yacht shots, tank tops, a tribute to coconut water. Then he watched the actress Emma Watson brief the United Nations on the importance of men’s involvement in the feminist movement, and he took it to heart. Now he presents his muscular selfies and butt jokes alongside iconography of feminism and   racism. In one snap, he holds a copy of “The New Jim Crow: Mass Incarceration in the Age of Colorblindness,” in bed, shirtless. In December, BuzzFeed nodded at McGorry with a listicle titled: “Can We Talk About How Woke Matt McGorry Was in 2015?” Earning the “woke” badge is a particularly tantalizing prospect because it implies that you’re down with the historical fight against prejudice. It’s a word that arose from a specific context of black struggle and has recently assumed a new sense of urgency among activists fighting against racial injustices in Ferguson, Sanford, Baltimore and Flint. When Black Lives Matter activists started a website to help recruit volunteers to the cause, they called it StayWoke. org. “Woke” denotes awareness, but it also connotes blackness. It suggests to white allies that if they walk the walk, they get to talk the talk. The most prominent pop touchstone for “stay woke” is Erykah Badu’s 2008 track “Master Teacher,” in which she sings the refrain “I stay woke. ” “Erykah brought it alive in popular culture,” says David Stovall, a professor of   American studies at the University of Illinois at Chicago. “She means not being placated, not being anesthetized. She brought out what her elders and my elders had been saying for hundreds of years. ” In turn, the track has helped shepherd the next generation into its own political consciousness. In an interview with NPR last year, the rapper Earl Sweatshirt described listening to “Master Teacher” in the car with his mother as a teenager. “I was singing the hook, like, ‘I stay woke,’’u2009” he said. His mother turned down the music, and “she was like, ‘No you’re not. ’’u2009” Earl Sweatshirt’s mom was cautioning her son against brandishing a word without understanding its history and power. He got the message years later, he said, and called her up and announced: “I’m grown. ” Such reflectiveness is often absent from the promiscuous spread of “woke” online. The word has now been recycled by people hoping to add splashes of drama to their own inconsequential obsessions, tweeting “Raptors will win it all #STAYWOKE” or “new bio . .. #staywoke. ” The new iteration of radical chic is the guy on Tinder who calls himself a “feminist artist in Brooklyn” and then says he’s “looking for the    in the   ”  —   the performance of “wokeness” is so conspicuous that it breeds distrust. In a 2012 paper about race relations on Twitter, Dr. André Brock, a University of Michigan communications professor, wrote about how the surfacing of popular hashtags and trending topics “brought the activities of   literate blacks to mainstream attention,” creating a space where the expressions of black identity are subject to “intense monitoring” by white people  —   a kind of accelerator for cultural appropriation. When black activists used “stay woke” in their Twitter campaigns against police violence, the term appeared alongside a host of trending hashtags  —   #ICantBreathe, #IfTheyGunnedMeDown  —   and was thus flagged for white people who have never listened to a Badu album or joined the crowd at a rally. Defanged of its political connotations, “stay woke” is the new “plugged in. ” In January, MTV announced “woke” as a trendy new slice of teen slang. As Brock said, “The original cultural meaning of ‘stay woke’ gets lost in the shuffle. ” And so those who try to signal their wokeness by saying “woke” have revealed themselves to be very unwoke indeed. Now black cultural critics have retooled “woke” yet again, adding a third layer that claps back at the appropriators. “Woke” now works as a dig against those who claim to be culturally aware and yet are, sadly, lacking in  . In a sharp essay for The Awl, Maya Binyam coined the term “Woke Olympics,” a “kind of contest” in which white players compete to “name racism when it appears” or condemn “fellow white folk who are lagging behind. ” The latest revolution of “woke” doesn’t roll its eyes at white people who care about racial injustice, but it does narrow them at those who seem overeager to identify with the emblems and vernacular of the struggle. For black activists, there is a certain practicality in publicly naming white allies. Being woke, Stovall says, means being “aware of the real issues” and willing to speak of them “in ways that are uncomfortable for other white folks. ” But identifying allies poses risks, too. “There are times when people have been given the ‘black pass,’ and it hasn’t worked out so well,” Stovall says. “Like Clinton in the ’90s. ” A white person who gains a kind of license to use power on behalf of black people can easily wield that power on behalf of themselves. “Woke” feels a little bit like Macklemore rapping in one of his latest tracks about how his whiteness makes his rap music more acceptable to other white people. The conundrum is built in. When white people aspire to get points for consciousness, they walk right into the cross hairs between allyship and appropriation. These two concepts seem at odds with each other, but they’re inextricable. Being an ally means speaking up on behalf of others  —   but it often means amplifying the ally’s own voice, or centering a white person in a movement created by black activists, or celebrating a man who supports women’s rights when feminists themselves are attacked as  . Wokeness has currency, but it’s all too easy to spend it.'"}, "time": 1742563200.006815}