{"duration": 0.21910452842712402, "input_args": {"text": "'Pamela Geller of the American Freedom Defense Initiative joined SiriusXM host Alex Marlow on Monday’s Breitbart News Daily to give her review of President Donald Trump’s visit to the Middle East. [“It was a good speech,” Geller said of President Trump’s remarks in Riyadh, Saudi Arabia, during the weekend. “It’s just that President Obama had set the bar so low that just the mention of Islamic terror is cause for jubilation. That’s how bad it is. ”  “It was a mixed bag. I hope that he follows through on many of these initiatives. These new centers for combating extremist ideology  —   again, the fear of not naming the motive, of a motiveless ideology, is deeply troubling,” she said.  “Of course, King Salman’s remarks were as telling and revealing as President Trump’s,” she added. “The idea that he does not speak to the Islamic teachings and text that call for jihad, he does not speak to jihadic doctrine. He spends the entire time telling us, preaching to us, that Islam is a religion of peace and that it has a history of coexistence. I don’t know what period he’s talking about because for 1400 years   Christians, and Jews, were forced to live in dhimmitude under denial of basic human rights. ”  “And, of course, he cites that famous Koranic quote that CAIR cites, that President Obama cites, about if you save one life you save the world entire  —   when, in fact, that is a Talmudic verse that was cribbed by the Islamic religion, and it really is an implied threat to the Jewish people. We don’t have to get into the   of it, but the whole speech of King Salman’s was a deception,” Geller charged. (CAIR is the Council on   Relations, a political organization in the United States.)  “I’m very glad that President Trump talked about fighting ISIS because according to leaked emails from Hillary Clinton, the Saudis were supplying ISIS, and Qatar was supplying ISIS. They can’t continue to play both sides, which the Saudis have done brilliantly for decades,” she said.  “So when President Trump says, ‘Drive them out of the mosques,’ that’s a tricky one because how are countries living under Muslim rule going to drive the most devout out of the mosques? That’s where I think President Trump got it wrong, when he said that terrorists were falsely invoking the name of God. No, they’re not. They’re citing Koran chapter and verse. That was misleading,” said Geller. “It is pure Islam. It is authentic Islam,” she insisted. “I mean, when he says that the terrorists do not worship God they worship death  —   that’s just not true. They’re dying in the cause of Allah. They’re not screaming, ‘Death akbar.’ They’re screaming ‘Allahu akbar.’ They pray five times a day. If you look at ISIS videos, they pray after they slaughter in the cause of Islam. ” “Abu Bakr   the Caliph of the Islamic State, has a Ph. D. and a master’s in Islamic theology from the world’s leading Islamic university,” she pointed out. “Do Western leaders presume that they know more than he does about Islam?” Geller went on to “emphatically state that the battle between good and evil was an extraordinary statement, wonderful” in Trump’s Riyadh speech. “Even though the White House released the text calling it ‘Islamist extremism,’ he said ‘Islamic extremism.’ That’s an important point because that word ‘Islamist’ is a ridiculous word. It’s nothing except the person using it doesn’t want to offend Islam by speaking unwelcome truths about the political nature of that religion,” she argued. “Overall, it was an A,” she graded Trump’s speech. Marlow noted that Trump surprisingly removed the qualifier of ‘radical’ Islamic terrorism and referred simply to ‘Islamic terrorism’ directly. “It was brilliant,” Geller said, mocking how adversarial media outlets chastised Trump for declining to denounce “radical Islamic terrorism” as if he were backing away from his campaign rhetoric, when, in fact, what he said in the Riyadh speech was even more blunt and direct. She also jeered at a CNN headline that took Trump to task for allegedly failing to discuss human rights in Saudi Arabia. “Oh, my God,” she exclaimed. “You had President Obama, who was aiding and abetting the mass slaughterers, who never uttered the word, who gave billions to one of the worst human rights violators on the planet, Iran  —   and that was the CNN headline  —   like they give a fig about human rights in Muslim countries! It’s extraordinary. The coverage is almost Kafkaesque. ” Geller said it was “thoroughly enjoyable” to watch the media struggle to come up with talking points that portray Trump’s Middle East trip as a failure. “He just delivered to the Saudis the largest arms deal  —   and, of course, we know that is really because of Iran. Iran is fighting the Saudis in Yemen,” she noted. “President Obama would harp on this, the biggest victims of this extremism are Muslims themselves. That’s a false narrative because the Sunni vs. Shia  —   you saw that with ISIS when they would line up their victims and ask them specific questions about Islam. The Sunni don’t think the Shia are Muslims, and the Shia don’t think the Sunni are Muslims. They’re fighting for who is the true Muslim. When the West says, ‘Oh, they’re killing Muslims’  —   again, that’s in your mind, but not in the mind of the Sunni and not in the mind of the Shia. ” “I am concerned about that arms deal,” she added. “The common enemy of Iran and the Saudis, of course, is Israel. Right now, the Saudis need Israel because Iran has been newly emboldened and newly enriched and newly armed, thanks to President Obama. That’s sort of scary. Where is the law of unintended consequences going to be?” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742564250.8190026}