{"duration": 0.0315394401550293, "input_args": {"text": "'Poll: Sexism Was NOT A Factor In Hillary\\'s Loss By: Aaron Bandler November 11, 2016 \\nSome leftists still reeling from Hillary Clinton\\'s stunning defeat on Tuesday are blaming her defeat on supposed sexism against a woman president. However, a new poll suggests that sexism did not play a role at all in Clinton\\'s loss. \\nThe poll, conducted by Conquest Communications Group and published on Just Facts , featured a question specifically geared toward gauging potential sexism: \"If you were faced with a choice between a male and a female presidential candidate, who would you vote for?\" \\nHere were the results (emphasis added): \\nOverall, 69% of voters said “It does not matter,” 15% preferred a female, 12% preferred a male, 3% were unsure, and 1% refused to answer. \\nMale voters and Trump voters were more likely than any other groups to say “It does not matter,” at 73% and 72% respectively. The other groups were not far behind and within the margins of error, with rates of: 67% for Clinton voters. 66% for undecided voters. 64% for females. \\nNaturally, supporters of Trump were more likely to support a male president than a female president–25 percent to 2 percent, respectively–and Clinton supporters were more likely to support female president than a male president, 27 percent to 5 percent, respectively. \\nThe survey was conducted from October 11-23, so it was taken a couple of weeks before the election. But it\\'s hard to imagine a majority of voters all of a sudden turned into a bunch of sexists. \\nThere is a little bias towards a male president among Trump voters and a little bias towards a female president among Clinton voters, but the results of the survey suggest that overall, the genitalia of a candidate is not a significant factor involved in most voters when it comes to choosing the next president of the United States. \\nDemocrats will have to find a different strategy for identity politics since the gender card doesn\\'t work. Speaking of identity politics, it looks like the race card seems to be in trouble as well . Tags '"}, "time": 1742563130.5987108}