{"duration": 0.042017459869384766, "input_args": {"text": "'PRAGUE  —   Petra Kvitova said she was determined to play tennis again, no matter what that required, after a   intruder attacked her inside her home. Kvitova, a   Wimbledon champion, was released from a hospital on Friday, three days after she had surgery for injuries sustained in the attack in the town of Prostejov. With a big bandage covering her left hand and forearm, Kvitova said she had been told by the surgeon who performed the operation on Tuesday in a special clinic in Vysoke nad Jizerou that her recovery was “looking good and without complications, as it should be. ” “I feel better day by day,” she told reporters in Prague. During a session on Thursday with the doctor, she said, “I was able to move the fingers on my left hand. ” She called that “the greatest Christmas present I could have wished for. ” Apparently in a good mood and smiling, Kvitova offered thanks for the support she had received from other players, fans, her family, team and doctors. “I never received so many messages in my life at a moment,” she said. “I really appreciate that. ” The WTA, on its official Twitter account, wished Kvitova “a speedy recovery. ” “We can’t wait to see you back on court again,” the Twitter post said. Kvitova, who plays tennis   had damage to the tendons in her left hand, along with injuries to all five fingers and two nerves. Doctors estimated it would take her about six months to return to tennis. Kvitova vowed to come back, sooner or later. “I don’t care about how much time it takes, if three months, six months or a year,” she said. “But that’s for sure I want to return one day, and I’ll do all I can to make that happen. I had no doubt about my return to the tennis circuit for a second. ” Kvitova won Wimbledon in 2011 and 2014. She reached a   ranking of No. 2 in 2011 and finished the 2016 season at No. 11. Kvitova did not take questions but said she did not want to look back and talk about the attack. The assailant was still at large. In April 1993, Monica Seles was at the height of her success when she was stabbed in the back during a changeover at a tournament in Hamburg, Germany. A man reached over a courtside railing and stabbed her, leaving an   slit between her shoulder blades. Seles returned to the game two years later and reached the 1995 United States Open final.'"}, "time": 1742562110.6529205}