{"duration": 0.05784153938293457, "input_args": {"text": "'German Parents Taken to Court for Refusing to Send Their Son to a Mosque \\nAndrew Anglin Daily Stormer October 28, 2016 \\nYou all thought I was cr y when I started pushing the idea that the women and even some of the liberal cucked men of Europe are actually pushing for forced Islamization of Europe on purpose. \\nYou were all like “no no no, liberals are just stupid, they think they’ll integrate, or that there can be coexistence somehow – they just don’t get it.” \\nWell, where are we now? \\nRT : \\nParents of a German teenager may face a trial and fine for â\\x80\\x9ctruancyâ\\x80\\x9d after refusing to allow their son to go to a local mosque on a school field trip out of fear that it would lead to his â\\x80\\x9cindoctrinationâ\\x80\\x9d by Islamic radicals. \\nThe story broke in mid-June, when parents of a 13-year-old student opposed the idea of their son visiting a mosque in the northern German town of Rendsburg, reportedly organized as part of a geography class. \\nIn a letter to the class teacher quoted Â by the NDR, the teenâ\\x80\\x99s father argued that his son would be â\\x80\\x9cindoctrinatedâ\\x80\\x9d in the mosque. He went on to say that â\\x80\\x9cfor years we have been hearing reports about religiously-motivated violence connected with Islamic people.â\\x80\\x9d \\nA local education authority subsequently fined the couple a total of â\\x82Ź300 ($328), referring to school regulations and regional laws which include penalties for truancy. \\nWhen the parents opposed the fine, their case was forwarded to Peter Mueller-Rakow, a local prosecutor, who will decide whether or not to proceed with a court trial, Spiegel reported on Wednesday. \\nThe parentsâ\\x80\\x99 lawyer, Alexander Heumann, argues that they refused the school trip out of fear for their sonâ\\x80\\x99s â\\x80\\x9cbodily safety.â\\x80\\x9d \\nDenying any faith-based motives, he emphasized that the couple do not belong to any religious group, and are of the opinion that â\\x80\\x9cnobody shall be forced into a sacred place against his good will.â\\x80\\x9d \\nHeumann himself, however, is a former member of the Alternative for Germany party, an anti-immigrant political group, and was a participant in setting up the â\\x80\\x98Dugida,â\\x80\\x99 a Dusseldorf-based branch of the far-right PEGIDA movement. \\nFeminism is the complaint of a woman who doesn’t have a man to tell her what to do. \\nThe entire goal of feminism is to force an end to feminism. That is why feminists are pushing for Islamization. They want to be told what to do. The immediate goal of their demonstrations is to get manhandled. It is a weird psycho-sexual thing that men couldn’t ever understand and women are unconscious of so incapable of explaining. But I assure you it is there. \\nThey don’t care about race, because women are incapable of processing philosophical or ideological concepts. The only fact they are able to process – and this is on an emotional, subconscious level – is that their men refused to be men, and have told them to go be men, and that this is causing them extreme distress and blocking their ability to produce children. \\nThis is what feminism is – women don’t say what they actually want, they express themselves in a way where you’re supposed to interpret their emotional state. When Femen riots naked, what they want is to be physically dominated by men – i.e. raped. \\nSo they are replacing us with Moslems to fix their current state, which is feminism. \\nI told you people this.'"}, "time": 1742562754.494401}