{"duration": 0.20345401763916016, "input_args": {"text": "'A    man was attacked by a bear in the wilderness of southwest Montana. Alone and injured, he walked  —   then drove  —   for miles to save himself. How did he do it? The man, Todd Orr, said he was scouting for elk in a mountainous valley on Sept. 30 when he was attacked twice by a female grizzly. Bleeding, stunned and suffering a cracked bone and deep gashes, Mr. Orr said he hiked through the woods for miles to reach his truck. In a gory video that had been viewed more than 37 million times by Thursday, Facebook posts  describing the maulings and a new website that allows the public to track his recovery, Mr. Orr, 50, offers insights into the psychology of survival. While few people will encounter an angry bear in their lives, those in the business of first aid and extreme survival said his social media imprints invited general reflection: When someone finds themselves isolated, injured and bleeding, what should he or she do to survive the lonely trek in search of medical help? Dr. R. D. Marks, whose medical staff was the first to treat Mr. Orr, said the injured man came out of the woods on the morning after the attack and went to the Madison Valley Medical Center in the small city of Ennis, Mont. for help. “He just showed up at the door,” Dr. Marks said on Thursday. “I think he called ahead and said he was coming. By that time it was like his badge: ‘I got bit by a grizzly bear and I got a story to tell.’ ” Mr. Orr, who builds custom knives for a living, was recovering from multiple surgeries and unable to return telephone messages, according to a statement on his website. But in Facebook posts published last weekend, he said he had been scouting elk in Madison Valley, in the Lee Metcalf Wilderness area. That is bear country, Mr. Orr wrote. He should know he was raised in the area. Armed with a pistol and repellent spray, he made lots of noise so as not to surprise any bears, which can make them lash out. “I hollered out, ‘Hey, bear’ about every 30 seconds,” he wrote. But suddenly, on the trail ahead, he spotted a grizzly with cubs. She charged. A dose of repellent did nothing to slow her down. He hit the ground, face down, and she was on top of him, biting his arms, shoulders and backpack. “The force of each bite was like a sledgehammer with teeth,” he wrote. “She would stop for a few seconds and then bite again. Over and over. ” Then the bear ambled away. Stunned and bleeding, Mr. Orr started back down the trail toward his truck, about a   trek. He took stock of his injuries: mostly puncture wounds on his arms and shoulder. He did not want to pause to dress the wounds, he wrote, so he     toward what he thought was safety. But then, a sound: It was the same bear, charging toward him again. He hit the dirt, covering his neck with his arms and pressing his face to the ground to protect his eyes: the textbook position to take during a bear attack. One bite clamped onto his forearm, and he heard a crunch. He gasped from the pain, but the sound sent the animal into a frenzy, biting his shoulder and upper back even more. So, Mr. Orr said, he played dead, lying motionless and silent as the bear bit his head, even as blood gushed into his eyes and face. “I thought this was the end,” he wrote. Finally, the animal stopped. She stood on his back. Without moving, he endured moments of terrifying intimacy as the animal sniffed him. He felt her breath on his neck, her claws digging into his back, smelled her “pungent odor. ” Then she was gone. Somehow, Mr. Orr got to his feet. His pistol had been knocked out of reach. “But a quick assessment told me I could make it another 45 minutes to the truck without losing too much blood,” he wrote. He took off along the trail. At the end of the path, he took photographs and the video. Panting,   and with streams of blood crisscrossing his face, Mr. Orr recorded his injuries as he spoke to the camera. “She got my head good,” he said. “I don’t know what is under my hat. My ear, my arm, pieces of stuff hanging out  —   I don’t know what’s going on in there,” he said, displaying his mangled arm. “And then my shoulder she ripped up I think my arm’s broke. But legs are good. Internal organs are good. Eyes are good,” he said. He got into the truck and drove, calling his girlfriend and 911, and asking a rancher along the way to telephone ahead for help. When Mr. Orr arrived at the medical center, Dr. Marks said, it was about 8 in the morning. Mr. Orr had driven six miles to reach a highway, and another 10 to get to the medical center, Dr. Marks estimated. “People are kind of amazing,” he said. “We think about how terrible these things are, and some people do freak out, but most people go into survival mode, and you get crystal clear: ‘Here is what I gotta do,’ and they do it. “You take inventory and find everything is working  —   I am alive,” he added. Mr. Orr said he had a   gash above his ear and multiple bite marks for which he underwent several surgeries. Dr. Marks said Mr. Orr most likely stanched some of the heavy bleeding from his scalp wound by having his baseball cap pulled down over his head while on the trail. “It kind of pulled the edges together and controlled the bleeding, for the most part,” Dr. Marks said. “Kind of like putting a pressure dressing on. I don’t know if he thought about it that way. ” Tod Schimelpfenig, the curriculum director at NOLS Wilderness Medicine, a Wyoming school for wilderness medicine education, said that Mr. Orr was lucky the bear did not bite into an artery, penetrate his chest or skull, or rip off a large hunk of flesh. That would have made the bleeding unmanageable alone (though had he had help, he could have contained it with an expertly placed tourniquet). For people who might find themselves in similar situations, Mr. Schimelpfenig said puncture wounds should be treated by applying direct pressure for up to five minutes. With multiple punctures, you must “figure out the worst one. ”   showed that Mr. Orr had a cracked forearm bone, but on the trail he was apparently unhindered by it. A stabilizing splint could be fashioned with a shirt tail and a safety pin, Mr. Schimelpfenig said. Replenishing fluids is key, because you could lose blood while exerting yourself  —   as Mr. Orr was while walking while injured. Mr. Orr’s presence of mind was notable. In the video, he demonstrated behavior common to extreme survivors. He was objective, giving a factual accounting of the parts of his body that still worked. He was accepting  —   admitting what he did not know, like the extent of his other wounds. In the Facebook post, Mr. Orr recalled that at one point he felt gratitude on the trail, saying he “thanked God for getting me through” the first attack. He grieved when the second attack occurred, then said he felt “double lucky” when he survived it. During the lonely trek out of the woods, in the dark, he continued to plan. He emphasized a connection with his fellow human beings, saying that after the attack, he had been concerned that other people might run into the bear. He imparted advice. “Be safe out there,” he said, his eyes darting around while he was still out in the open. “Bear spray doesn’t always work. But it’s better than nothing. ” Most important for survival, Mr. Orr described focusing on living, Mr. Schimelpfenig observed. “He came up with a plan, he saw the future, he was happy with what he had: ‘This is my reality here is what I am going to do,’ ” he said. ”He did not lie there and hope someone was going to find him. ”'"}, "time": 1742561679.9404423}