{"duration": 0.06008744239807129, "input_args": {"text": "'Student journalist Andy Ngo was fired from his job at the Vanguard, the student newspaper of Portland State University, after a video he posted on Twitter was included in a Breitbart News report. [At @Portland_State interfaith panel today, the Muslim student speaker said that apostates will be killed or banished in an Islamic state. pic. twitter.   —   Andy C. Ngo (@MrAndyNgo) April 27, 2017,   Student journalist Andy Ngo, a graduate student at Portland State University, was fired from his job at the school’s student newspaper after a video he tweeted of a campus interfaith panel was included in a report from Breitbart News. The video, which went viral on social media, showed a Muslim student stating that   or apostates, would either be banished or killed in countries run under Islamic law. “That is only considered a crime when the country is based on Koranic law,” the student said, speaking about the legality of being a   in an Islamic country. “That means there is no other law than the Koran. So in that case, you are given the liberty to leave the country. You can go to a different country. I am not going to sugarcoat it. So if you go to a different country  …    but in a Muslim country, a country based on Koranic law, disbelieving or being an infidel, is not allowed, so you will be given the choice. ” Ngo was dismissed by the editors of the Vanguard student newspaper, who claimed that he had recklessly endangered the Muslim panelist’s life by portraying the student’s remarks inaccurately. An editor of the Vanguard allegedly told Ngo that his conduct was “predatory” and “reckless,” before ultimately chastising him for the inclusion of his video tweet in a report that appeared on Breitbart News on April 27. Four days later, the    of my school newspaper called me into a meeting. The paper’s managing editor was also present. They asked me about a Breitbart piece describing the event. It was the first time I’d seen the piece, which included my tweets and a tweet from one of the panelists. My editor, whom I deeply respected at the time, called me “predatory” and “reckless,” telling me I had put the life and   of the Muslim student and his family at risk. She said that my tweets implied the student advocated the killing of atheists. Another person in the meeting said I should have taken into account the plight of victimized groups in the “current political climate. ” The editor claimed I had “violated the paper’s ethical standards” by not “minimizing harm” toward the speaker. Writing in The National Review, Ngo defended himself by claiming that he had simply reported on what the panelist had said. Despite this, Ngo was fired from his position, with the editors arguing that his history of affiliation with conservative media was harmful to the Vanguard’s reputation. In my defense, I told the two editors that I had simply been relating the speaker’s words. While dozens of Muslim states do not consider apostasy or blasphemy a crime, 13   countries punish these actions with death. The speaker was admitting as much, and as someone who has covered the persecution of atheists and apostates in Muslim countries, I considered that newsworthy. Nevertheless, my editor turned to me and said, “We have to ask you to step aside. ” She said I had “a history” of affiliation with conservative media, and argued that that history was toxic to the “reputation of the Vanguard. ” The Vanguard wrote on the interfaith panel on May 1, condemning Mr. Ngo’s reporting in the process, claiming that the video he had shared on Twitter was shared without the proper context. A video clip featuring only a portion of the organizer’s quote that addressed the Quranic law about   or infidels being “given a choice” has been shared on Twitter and Facebook without the preceding and following context. This comment from the organizer, widely shared out of context was met with significant criticism by audience members who accessed it through social media and   media outlets. Benjamin Ramey, a student on the interfaith panel, argued that Mr. Ngo didn’t take the Muslim panelist’s comments out of context. Speaking to Breitbart News, Ramey stated that “it is discouraging to see a student funded publication use their platform inappropriately to publicly slander the name of their now former Multimedia Editor, Andy Ngo, in order to shield themselves from their own apprehension to engage in equitable dialogue about atheism and religion in the modern world. ” “If one wishes to shy away from such talk, let them, but that individual cannot force those around them to keep silent as well,” he added. @MrAndyNgo @Portland_State As one of the panelists present at this event I would like to say that this speech is not taken out of context.  —   Benjamin Ramey (@NikolaosRamey) April 27, 2017,  Ngo initially offered his   to the Vanguard following his dismissal but they refused, claiming it would cause the Muslim panelist “further distress. ” Instead, Vanguard    Colleen Leary penned a column defending her decision to dismiss Ngo. In the column, Leary argued that Ngo’s tweet, which wasn’t published in his official capacity as a Vanguard journalist, was “a dangerous oversimplification that violated very clear ethics outlined by the Society of Professional Journalists. ” Andy Ngo spoke with Breitbart London    Raheem Kassam on Breitbart XM on Sunday. In the interview, Ngo agrees with Kassam’s assessment that he was fired by the editors of the Vanguard “basically because this was covered by Breitbart. ” You can listen to the entire segment below.  Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742628468.662607}