{"duration": 0.0769953727722168, "input_args": {"text": "'No Search Warrant Yet: FBI Can’t Move On Email ‘Investigation’ By Michelle Oxman on October 30, 2016 Subscribe \\nYou bet James Comey jumped the gun when he wrote to Congress that the FBI was looking at more Clinton emails. Apparently, he had decided that emails on Anthony Weiner and Huma Abedin’s home laptop computer should be examined further. But that didn’t mean that the FBI had the legal authority to look at them yet. Actually, it didn’t—and still doesn’t—have that authority. What Did The FBI Find? \\nLet’s remember, first, that the FBI was investigating Weiner’s use of the internet to send sexts and photos to a 15-year-old girl. They searched a laptop that they say was used by both Weiner and Abedin, and they found emails from the State Department, forwarded by Huma Abedin from work to home. There is no indication that Hillary Clinton sent any emails to or received emails from Abedin on this computer. When Will We Know What’s In The Emails? \\nNo one knows. The FBI needs a warrant to view the emails. The warrant for Weiner’s emails and texts doesn’t apply to emails that Weiner neither sent or received. As of Sunday afternoon, October 30, the FBI has not gotten a warrant to search the emails. Pending requests for search warrants are not usually made public, so we wouldn’t know if the FBI has even asked for a warrant. Is Search Warrant Available? An Open Legal Question \\nAs the Washington Post reported on October 30, 2016, there are good reasons to think that the FBI would be denied a warrant to search the couple’s computer for emails related to Clinton’s tenure as Secretary of State when the purpose of the FBI’s access was to review Weiner’s recent emails and sext messages. By what logic would the FBI be justified opening emails to and from Huma Abedin’s accounts from 2009 to 2013? Unfortunately, some people, especially conservatives, resist arguments based on the “technicality” of the Fourth Amendment. Comey’s ‘Explanation’ \\nAccording to Yahoo News , as of Saturday night, the Department of Justice and FBI officials were discussing what to do next. Because the FBI did not have a warrant to read Abedin’s emails, on Thursday, October 28, Comey accepted the investigators’ recommendation that the Bureau “seek access” to them. On Friday, he sent a memo to FBI employees explaining that he felt he had to update Congress because of his previous testimony that the Clinton email investigation was finished. On the other hand, he didn’t know yet what significance the emails would have. and he didn’t want to create a “misleading impression.” Violating Policy \\nThere seems to be no doubt that Comey’s letter to Congress violated two long-standing tradition and policies: (1) prohibiting discussion of ongoing investigations; and (2) not taking actions to favor one side or another in elections. Two former Deputy Attorneys General, one Democrat and one Republican, publicly questioned Comey’s fitness to lead the FBI because of it. In addition, others have pointed out that Comey has repeatedly gone beyond established limits in his discussions of the Clinton email investigation. \\nFeatured image from Liberal America media archives. About Michelle Oxman \\nMichelle Oxman is a writer, blogger, wedding officiant, and recovering attorney. She lives just north of Chicago with her husband, son, and two cats. She is interested in human rights, election irregularities, access to health care, race relations, corporate power, and family life.Her personal blog appears at www.thechangeuwish2c.com. She knits for sanity maintenance. Connect'"}, "time": 1742563186.6948857}