{"duration": 0.07006168365478516, "input_args": {"text": "'\\nEveryday, more and more information surfaces about Benghazi. \\nA critical email that just surfaced shows that the Pentagon offered to act immediately in Benghazi. \\nHere are the details: \\nVIA Allen B West \\nThe ugly truth about Benghazi continues to trickle out. Like this critical email that shows the Pentagon urgently offering help to the unfolding attack in Benghazi on September 11, 2012. And although it came after the first wave of the attack at the consulate, it occurred before a mortar strike on the CIA annex killed Ty Woods and Glenn Doherty. \\nAs Judicial Watch notes, the email ‘leaves no doubt military assets were offered and ready to go, and awaiting State Department signoff, which did not come.” \\nIn other words, the Pentagon was offering military assets that potentially could have saved the lives of American citizens — if only the State Department had signed off. \\nOf course, we all remember who was leading the State Department at that time. Everyone’s favorite leading Democrat candidate for president, Hillary Clinton. \\nVia The Right Scoop : \\nAn email recently obtained by Judicial Watch shows that the Pentagon was demanding Hillary allow them to send help to Benghazi during the 2012 attack. This would completely contradict the claim from Hillary and Leon Panetta that no forces were available and within reach to provide help to the compound that was under siege. \\nFrom Fox News: \\nAs the attack on the U.S. consulate in Benghazi was unfolding, a high-ranking Pentagon official urgently messaged Secretary of State Hillary Clinton’s top deputies to offer military help, according to an email obtained by Judicial Watch. \\nThe revelation appears to contradict testimony Defense Secretary Leon Panetta gave lawmakers in 2013, when he said there was no time to get forces to the scene in Libya, where four Americans were killed, including U.S. Ambassador to Libya Christopher Stevens. \\n“I just tried you on the phone but you were all in with S [apparent reference to then-Secretary of State Hillary Clinton],” reads the email, from Panetta’s chief of staff Jeremy Bash. “After consulting with General Dempsey, General Ham and the Joint Staff, we have identified the forces that could move to Benghazi. They are spinning up as we speak.” \\nIronically, Hillary Clinton and her minions were concerned with spinning the story instead of gearing up the military forces. \\nHere’s the email: More: \\nThe email was sent out at 7:19 p.m. ET on Sept. 11, 2012, in the early stages of the eight-hour siege that also claimed the lives of Foreign Service Information Management Officer Sean Smith and two former Navy SEALs, Ty Woods and Glen Doherty, private CIA contractors who raced to the aid of embattled State Department workers. \\nAlthough the email came after the first wave of the attack at the consulate, it occurred before a mortar strike on the CIA annex killed Woods and Doherty. \\n“This leaves no doubt military assets were offered and ready to go, and awaiting State Department signoff, which did not come,” Judicial Watch, a nonprofit government watchdog said in a statement. \\nParts of the email from Bash were redacted before release, including details on what military forces were available. \\nSo there it is. Panetta and Hillary LIED to the American public over and over, and the media never pressed them enough to demand answers. \\nThe clincher? This information has been available since a month after the attack. But as Judicial Watch notes: \\nThe Obama administration and Clinton officials hid this compelling Benghazi email for years,” said Judicial Watch President Tom Fitton. “The email makes readily apparent that the military was prepared to launch immediate assistance that could have made a difference, at least at the CIA Annex. The fact that the Obama Administration withheld this email for so long only worsens the scandal of Benghazi. '"}, "time": 1742561858.1849997}