{"duration": 0.1204843521118164, "input_args": {"text": "'The Doctrine of Armed Exceptionalism LobeLog (resilc) \\nHow Putin Derailed the West Counterpunch. Resilc: “‘Why is Hillary Clinton so eager to intensify US involvement in Syria when US interventions in Afghanistan, Iraq and Libya have all gone so terribly wrong?’ The USG incentive system for DoD/CIA/State/USAID et al is more war and more interventions.” \\nThe fatal expense of American imperialism Boston Globe (furzy) \\nTrade Traitors \\nTPP Is Exciting. Let’s Make the Case for It. Bloomberg (resilc). Four alarm fires and bombings are exciting too, but not in a good way. \\n2016 \\nClinton camp blasts FBI ‘double standards’ BBC. This line of attack is unlikely to succeed. The FBI is consistently depicted as upstanding and competent in crime and CSI shows. The fact that the Obamamometer has basically thrown Clinton under the bus v. Comey says that he reads the public pulse more or less the same way. \\nSpy told FBI that Russia wants to cultivate Trump: report The Hill (furzy). Mark Ames via e-mail: \\nWhat we learned even in the 90s—there are never, ever any standards for a journalist writing about Russia. Ever. The more bigoted and fantastical, the better. And when your hack crap is completely 100% debunked by other revelations, no editor will ever, ever discipline you. The only way you can have problems with Russia journalism is if you step away from the herd. No editor will ever forgive you for it. \\nAnd John Helmer debunked it more specifically by e-mail. Since his message was long, some key bits: \\nMy wife is linked to Putin – she’s Russian. I’m linked to Putin – his friend Oleg Deripaska tried to kill me. \\nFridman is busy exiting from Russia as fast as he can go – and may lose Vimpelcom Russia in consequence. The recent DoJ corruption penalty for Vimpelcom — $795M – indicates a reasonable lack of fondness on his part for the current US administration, but then Fridman has hired Richard Burt (Reagan-Bush) and Tom McLarty (Clinton) to “advise” – meaning lobby for him to get approvals from the Treasury, State and CIA for takeovers of fresh US assets, such as FreedomPop. And they are going through the Committee on Foreign Investment in the US, so the Trump “connection” can’t be as bad as the Clintonites make out. \\nBurt and McLarty are advisors to the LetterOne board, not directors on the Alfa Bank board. If Burt is considered a Trump man – e.g., , http://www.politico.com/story/2016/10/donald-trump-campaign-lobbyist-russian-pipeline-229264 — how to explain he was vintage Reagan and Bush? I remember Burt well – short, narcissistic (adolescent acne the cause), not very bright, would do anything to please, especially for money: http://www.politico.com/story/2016/10/donald-trump-campaign-lobbyist-russian-pipeline-229264 If Burt is such a Trumpie, and McLarty a Clintonite, what happens when they want to use the office toilet at the same time? And then John Negroponte arrives, hustled by Stu Eizenstat (ex Carter) – does ideology get in their way, or do their money interests encourage them to form an orderly line? Look at this list of McLarty’s associates: http://maglobal.com/about-us/our-team/john-negroponte / \\nAnd another desperate story at Slate, which I cringe at dignifying by linking to it: Was a Trump Server Communicating With Russia? I hate having to attack this garbage; recall Glenn Greenwald saying how he despised Trump yet excoriating the MSM going all in running any and every fact-challenged or badly stretched attack on Trump, when there is plenty of bona-fide dirt on him already. Outsourcing this again to Ames who has seen more of this than I have: \\nThe super-secret server linkup is one of the most inane supermarket spy pulp fantasies I’ve seen. It’s cartoon-bad. Most conspiracy theorists work a lot harder on their inane inventions than this. It relies on total ignorance, on a cartoonish grasp of how linkups would work. \\nAnd Helmer again: \\nA computer channel to a bank that doesn’t do the one thing banks are meant to do – transfer money. In the forensics of sex crimes, is that one of those Jimmy Carter “adulteries in the mind”? \\nFT endorsement: For all her weaknesses, Clinton is the best hope Financial Times. Surprising amount of opposition in the comments section (as in lots) given reader demographics. And the US is now the FT’s biggest market. \\nDonald Trump Used Legally Dubious Method to Avoid Paying Taxes New York Times. Par for the course for the New York Times. Article hyperventilates about supposedly improper behavior by Trump, yet the basis for the case is that what he did was later made impermissible. I deducted interest I paid on my one little student loan in the early 1980s because prior to the 1986 Tax Reform Act, all consumer interest was tax deductible. By the standards of the Times’ fulminating, what I did then was similarly “legally dubious.” Help me. \\nOn top of that, from what I infer from this piece, which is not at all clear on what Trump supposedly did (it tries to make his sin about failure to report, which sounds like a stretch; the IRS does have audit powers), it still appears that Lee Sheppard’s analysis of why what Trump did in 1995 was kosher then but not kosher later is the best account to date. And that was out a full month ago. Her article specifically discussed why the cancellation of debt income did not appear on his tax return at the time. I am putting the key part of her discussion (it was unpaywalled for weeks but now Tax Analysts has hidden it again) at the very end of this post so the geeky can see what a stretch the Times’ treatment is.'"}, "time": 1742561835.2591882}