{"duration": 0.05725240707397461, "input_args": {"text": "'BEIJING  —   The uninhibited Fu Yuanhui, the Chinese swimmer beloved for her    expressions, has made waves once again. On Saturday night in Rio, she freely discussed having her period while competing in the Olympics, breaking what has long been a taboo among female athletes. The video of her poolside interview quickly went viral. Ms. Fu’s remarks came after the Chinese women’s swimming team narrowly missed winning a medal in the   medley relay. In a   interview, Ms. Fu, who had already won a bronze medal for the   backstroke, could be seen crouching as her teammates were questioned one by one. As the commentator turned to her, Ms. Fu stood up, grimacing in pain. The commentator ventured a guess that Ms. Fu must be suffering from a stomachache, which Ms. Fu quickly corrected. “It’s because I just got my period yesterday, so I’m still a bit weak and really tired,” she said. “But this isn’t an excuse for not swimming well. ” Ms. Fu’s candor immediately attracted a deluge of comments online. On Weibo, China’s   social media platform, the hashtag related to the subject was searched more than half a million times by the end of Sunday, with many commenters expressing their support for Ms. Fu’s openness. “Only those who have gotten their periods know how deathly painful it can be,” one wrote. “You are too awesome. ” A male user wrote, “To compete during her period and still feel bad about placing fourth: Fu Yuanhui, you are amazing. You are our pride. ” Female commenters also took to social media to dispute largely   criticism that swimming in a pool while menstruating was unhealthy and unhygienic. “Don’t talk to me about staining the pool red or taking medicine to stop one’s period,” a female commenter wrote. “Haven’t you heard of something called a tampon?” In many parts of the world, menstruation is still regarded with shame and distaste, though that is changing. In the United States, creative hashtag campaigns on social media and online petitions have challenged the discomfort about   topics. Female athletes, including the former tennis star Annabel Croft of Britain, have criticized the silence surrounding menstruation in sports. In 2015, the American musician Kiran Gandhi ran the London Marathon during her period sans female hygiene products to protest   crossing the finish line with bloodstains prominently on display. Yet more open discussion about menstruation has been more slow to catch on in China. When talking about their periods, if at all, women still prefer to use euphemisms like “a visit from my aunt” or “taking a break. ” Television ads for feminine hygiene products are banned during prime viewing times as inappropriate. As a result, very few Chinese women use tampons, because it is widely, and falsely, believed that they can rob a woman of her virginity. This month, Chinese entrepreneurs plan to introduce the country’s first domestic tampon brand. All tampons sold in China have been imported, and most are sold online. In February, Anhui Province issued regulations allowing women to take up to two days off for menstrual pain, provided they could procure a doctor’s note certifying their symptoms. However, critics feared the practice might have the unintended effect of discouraging employers from hiring women and pointed out that women might still elect to forgo a paid menstrual leave to avoid criticism from male colleagues. “Fu Yuanhui’s comments have raised awareness, because Chinese society still approaches menstruation indirectly, even considering it unlucky,” said Chen Yaya, a feminist activist and researcher at the Shanghai Academy of Social Sciences. “But there’s no need for this at all. The period is simply an everyday phenomenon. ”'"}, "time": 1742564425.5120878}