{"duration": 0.0476078987121582, "input_args": {"text": "'CNN anchor Anderson Cooper weighed in on Kathy Griffin’s   photograph in which she posed with a fake, bloodied, decapitated head of President Donald Trump, saying the photo was “disgusting” and “inappropriate. ”[“For the record, I am appalled by the photo shoot Kathy Griffin took part in,” the Anderson Cooper 360 host wrote on his Twitter account Tuesday evening. “It is clearly disgusting and completely inappropriate. ”  For the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate.  —   Anderson Cooper (@andersoncooper) May 31, 2017,  Cooper and Griffin have   CNN’s New Year’s Eve Live since 2007. CNN said in a statement Tuesday that it was “evaluating” Griffin’s future role in the broadcast, but said it had not yet made any decisions. “We found what she did disgusting and offensive,” the network said in a statement, according to the Hill. “We are pleased to see she has apologized and asked that the photos be taken down. We are evaluating our New Year’s Eve coverage and have made no decisions at this point. ” The photo, first published by TMZ Tuesday morning, caused a firestorm online, as the comedian’s name became a trending topic on Twitter with thousands of people taking to the service to express their shock and disgust. Meanwhile, Facebook users flooded the comedian’s official page with calls to boycott her upcoming   comedy tour. Griffin apologized later Tuesday for the photo, which was taken by Los   photographer and artist Tyler Shields, and asked that it be taken down. “I’m a comic. I cross the line. I move the line, then I cross it. I went way too far,” Griffin said in a   video posted to her Twitter account. “The image is too disturbing. I understand how it offends people. It wasn’t funny. I get it. I’ve made a lot of mistakes in my career, I will continue. ” Representatives for CNN and Griffin did not immediately respond to a request for comment.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563597.2793539}