{"duration": 0.031785011291503906, "input_args": {"text": "'posted by Eddie A strange ‘lake’ of super salty dense water is discovered on the bottom of the Gulf of Mexico, where salt deposits bubble up along with methane. Scientists have found an alien, inhospitable world not in the far reaches of the galaxy, but on the bottom of the Gulf of Mexico — about a day’s boat ride from New Orleans. Dubbed the “Jacuzzi of Despair,” this pool of super-salty brine kills any unfortunate creature that happens to wonder in — mainly benthic crabs, amphipods and an occasional fish. The circular pool — about 100 feet in circumference and about 12 feet deep — lies nearly 3,300 feet below the surface of the Gulf. \\nEveryone who enters this pool at the bottom of the sea will suffer horribly. Erik Cordes, associate Professor of Biology at Temple University, has researched the pool and described his findings in the journal Oceanography . \\n“It was one of the most amazing things in the deep sea. You go down into the bottom of the ocean and you are looking at a lake or a river flowing. It feels like you are not on this world”, Cordes told Discovery News . \\n“ It feels like you are not on this world” The water in the “lake within the sea” is about five times as salty as the water surrounding it. It also contains highly toxic concentrations of methane and hydrogen sulfide and can thus not mix with the surrounding sea. \\nFor animals (and people) who swim into it, these toxic concentrations can be deadly. Only bacterial life, tube worms and shrimp can survive those circumstances. For scientists this “lake” is like a playground for their research. They can explore how certain organisms can survive in extreme habitats. “There’s a lot of people looking at these extreme habitats on Earth as models for what we might discover when we go to other planets” Cordes said to “seeker”. Read the original article on Tech Insider Source:'"}, "time": 1742628601.5915804}