{"duration": 0.052336931228637695, "input_args": {"text": "'Interviews US First Lady Michelle Obama (L) listens as Democratic presidential nominee Hillary Clinton speaks during a campaign rally in Winston-Salem, North Carolina, on October 27, 2016. (Photo by AFP) \\nThe United States government is trying to distract people from the true nature of Democratic presidential candidate Hillary Clinton by accusing Russia of influencing the election against her. \\nDon DeBar, a New York-based author and radio host, made the remarks in an interview with Press TV on Thursday, following Russian President Vladimir Putin’s response to Washington’s accusations of sponsoring hacking attacks against the US. \\nSpeaking to foreign policy experts during a Valdai Discussion Club meeting in Sochi, southern Russia on Thursday, Putin said Washington was using Russia as a distraction to cover the fact that this year’s White House contenders had nothing to offer on real issues. \\n“The subject matter of what is being revealed here is definitely an action item that defines who Clinton is,” DeBar said. \\n“Also, the thing that is really galling is the fact that we are told to ignore the content, and the content is something that goes to the heart of governing and also to the heart of Clinton’s record,” the analyst noted. \\n“This is the person who was married to the guy who signed in ‘three strikes and you are out legislation’ for people to get life in prison if they are convicted of three felonies,” he said. “If you look at the things that have been revealed here, some of the acts are themselves the violations of three separate federal criminal sanctions.” \\nDeBar argued that Clinton has multiple sets of the triple violations and yet is freely allowed to run for office under federal protection. \\nClinton and her campaign have repeatedly claimed that Russia was trying to rig the November election in favor of Republican nominee Donald Trump. \\nDuring the last presidential debate last week, Clinton accused Trump of having secret ties with Moscow, saying that Putin would love to see a “puppet” in the White House. \\nDeBar dismissed accusations against the Russian president, but noted that since the US was openly seeking regime change in Russia, it is only logical for Russia to fight back. \\nBased on that argument, DeBar said: \"It warrants support and not condemnation” even if Russia was trying to fight back in a way or another. Loading ...'"}, "time": 1742561968.3593733}