{"duration": 0.04419755935668945, "input_args": {"text": "'Tesla Made More Money This Quarter Than All U.S. Oil Companies Made Last Year Nov 14, 2016 0 0 \\nSigns of the times. This past quarter, Elon Musk’s Tesla company made a profit of $22 million, while the entire U.S. oil industry lost a total of $67 billion last year, according to the U.S. Energy Information Administration . This is in part due to the global oil prices falling, as well as humanity’s awakening push for clean, renewable energy. \\nAccording to the Renewable Energy Institute , the price efficiency of solar technology will be better than fossil fuel by 2025 and will continue to get cheaper and cheaper until that time. \\nHowever, the newly elected President of the U.S. says that he wants to “lift the restrictions on the production of $50 trillion worth of job-producing American energy reserves, including shale, oil, natural gas and clean coal.” Donald Trump also says he will initiate this action within his first 100 days of being in office. \\nWhile this action is certain to increase jobs for more Americans, we must also take into account the environmental impact this will have as even more carbon will be released into the atmosphere if these now dormant energy reserves begin to be tapped. \\nAdditionally, the price of oil continues to remain low and even if jobs are created, there is no guarantee these companies in the fossil fuel industry will be able to profit financially. \\nThe way the world is recognizing the necessity to move away from fossil fuels, as well as the increased technological capability, it appears as though Donald Trump will have a very difficult time putting this part of his plan into action. \\nInstead, he is likely to face a wave of opposition if he tries to implement such measures as people know that we can’t keep pumping even more carbon into the atmosphere if we want our world’s atmosphere to return to pristine condition. \\nEarlier this year, leaders from Russia, China, Japan and South Korea met to sign an agreement to begin working on a project called the Asian Super-Grid . The project will include wind and solar technologies and will power various parts of the world, including Europe, Southern Africa, South and Southeast Asia, as well as the four countries involved. \\nWhat we are seeing right now in our world is the writing on the wall: We see what destruction and pollution can come from the fossil fuel industry (as well as the political destruction that occurs through war to gain more oil resources from the Middle East) and we see that the solutions to these issues already exist. \\nWe see more and more that the solutions are being put into place, and now on an even wider scale (Asian Super-Grid). We also are seeing the economic reality of either continuing down the old path of fossil fuels as well as the bright new path being forged with clean and sustainable energy. \\n2017 is going to be quite a year. We have the solutions, but will we implement them on a mass scale? \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and does health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information and other inspiring articles.'"}, "time": 1742562745.4616694}