{"duration": 0.2590041160583496, "input_args": {"text": "'by Dr. Mercola \\nArtificial sweeteners such as aspartame are typically used to sweeten so-called “diet” foods and beverages in lieu of sugar or high-fructose corn syrup (HFCS). The idea is that reducing your calorie consumption will result in weight loss. \\nHowever, research has completely demolished this notion, showing that artificial sweeteners actually have the converse effect; they actually lower appetite suppressant chemicals and encourage sugar cravings and sugar dependence, thereby raising your odds of unwanted weight gain. [1],[2] \\nResearch has repeatedly shown that artificial sweeteners promote insulin resistance and related health problems just like regular sugar does, including [3],[4],[5] cardiovascular disease, stroke [6],[7] and Alzheimer’s disease . \\nWhile poor diet is a major driver of Alzheimer’s in general (the primary culprits being sugar/fructose and grains, especially gluten ), the key mechanism of harm here appears to be methanol toxicity — a much-ignored problem associated with aspartame in particular. \\nIn a previous interview, toxicology expert Woodrow Monte, Ph.D., (author of the book “While Science Sleeps: A Sweetener Kills” [8]) explains the links between aspartame and methanol toxicity and the formation of toxic formaldehyde. Newly Leaked Emails Discuss Rumsfeld’s Involvement in Aspartame Approval \\nJohn Podesta’s leaked emails have turned up a number of damning pieces confirming the collusion between the soda industry and high level officials within the U.S. government, including Hillary Clinton. \\nIn a recent batch of leaked emails, Donald Rumsfeld’s [9] involvement in the approval of aspartame is discussed. [10] Rumsfeld served as White House chief of staff from 1974 to 1975. He was also secretary of defense from 1975 to 1977, and again from 2001 to 2006. \\nIn 1976, Rumsfeld became CEO of the drug company G.D. Searle & Company, which was trying to get aspartame approved by the FDA. \\nTo put the email chain into context, in 2013 the International Dairy Foods Association (IDFA) and the National Milk Producers Federation (NMPF) filed a petition with the U.S. Food and Drug Administration (FDA) requesting the agency “amend the standard of identity” for milk and other dairy products. \\nThis change would allow them to add aspartame to chocolate milk, which is a primary milk product served with school lunches, without labeling it as a low-calorie drink. I wrote about this in my article, “ Big Dairy Petitions FDA to Allow Unlabeled Use of Aspartame in Dairy Products .” Former Head of FDA Reveals His Concerns About Aspartame \\nAt that time, Wendy Abrams, founder of Cool Globes Inc., an organization dedicated to raising awareness of climate change, forwarded correspondence to Podesta that she’d received from Don Kennedy. \\nKennedy is a former head of the FDA [11] and current editor-in-chief of Science Magazine. In his email correspondence with her, he shares his concerns about aspartame’s potential toxicity: [12],[13] \\nThe whole sweeteners issue has interested me since my early time at FDA … A little later, still during my time as Commissioner I was called on by Don Rumsfeld, who introduced himself as the CEO of Searle … \\n[W]e told him that we would look carefully at the evidence and rely on our expert committee structure as usual. \\nAspartame continued to attract concerned critics, and we at FDA saw no resumption of Searle’s effort to get it approved. I looked up one piece on that history, which I append below. Not a very nice story. \\n‘In 1985 Monsanto purchased G.D. Searle, the chemical company that held the patent to aspartame, the active ingredient in NutraSweet. \\nMonsanto was apparently untroubled by aspartame’s clouded past, including a 1980 FDA Board of Inquiry, comprised of three independent scientists, which confirmed that it ‘might induce brain tumors.’ \\nThe FDA had actually banned aspartame based on this finding, only to have Searle Chairman Donald Rumsfeld … vow to ‘call in his markers,’ to get it approved’ … Aspartame ‘Blew Holes in Their Brains’ \\nIn her correspondence with Kennedy, Abrams also noted her own adverse reactions to NutraSweet, noting that: \\n… I think it is poison … Doctors will swear to me it is fine, and I will tell them, maybe I’m the only person in the world who reacts like this, but clearly it affects me, and then they’ll tell me again, it is fine. They are so brainwashed by the propaganda, they refuse to believe anything contrary. \\nI also have a friend who worked for the researchers at University of Chicago (which has a top rated neurology dept [sic]) and the doctors there said when they gave NutraSweet to lab mice, it literally blew holes in their brains. \\nIn a subsequent email, Kennedy tells Abrams that: “Rumsfeld has a lot to answer for in his next life.” Children Are at Increased Risk \\nAs is often the case, children are particularly susceptible to damage from artificial sweeteners. \\nA recent study [14] evaluating how much artificial sweetener is actually absorbed into the blood when consumed by children versus adults found that children had DOUBLE the concentration after drinking a 12-ounce can of diet soda compared to the adults. As reported by Science Daily: [15] \\nThe same research team previously found that these artificial sweeteners were also present in breast milk when mothers ingested foods, drinks, medicines or other products that contained artificial sweeteners. \\nSince infants have less ability to clear substances from their blood stream via the kidneys (lower glomerular filtration rate up to age 2 years), the authors speculate that the infants’ artificial sweetener blood levels may be proportionately even higher. \\nThese results are important because early life exposure to artificial sweeteners may influence a child’s future taste preferences, diet and metabolic fate. Research Reveals Surprising Mechanism of Harm \\nResearch published in the journal Nature [16] in 2014 revealed a previously unknown mechanism by which artificial sweeteners make you pack on unwanted pounds and disrupt your metabolic function. Most importantly, this study proved causation. \\nIn recent years, we’ve learned that gut microbes play a significant role in human health. Certain gut microbes have been linked to obesity, for example, and as it turns out, artificial sweeteners disrupt your intestinal microflora, [17],[18],[19],[20],[21] thereby raising your risk of obesity, diabetes and other related problems. \\nSpecifically, the researchers found that artificial sweeteners alter metabolic pathways associated with metabolic disease. Decreased function was observed in pathways associated with the transport of sugar in the body. \\nArtificial sweeteners were also found to induce gut dysbiosis and glucose intolerance in otherwise healthy people. Of the artificial sweeteners tested, saccharin (Sweet’N Low) had the strongest impact, followed by sucralose and aspartame. \\nGlucose intolerance is a well-known precursor to type 2 diabetes, but it also plays a role in obesity, because the excess sugar in your blood ends up being stored in your fat cells.According to the authors of this widely publicized study: [22] \\n[W]e demonstrate that consumption of commonly used non-caloric artificial sweeteners formulations drives the development of glucose intolerance through induction of compositional and functional alterations to the intestinal microbiota … \\nCollectively, our results link non-caloric artificial sweeteners (NAS) consumption, dysbiosis and metabolic abnormalities, thereby calling for a reassessment of massive NAS usage. \\nAnother study, published in PLOS One, [23] also found that when rats were fed aspartame, it shifted their gut microbiota, causing it to produce propionate — short-chain fatty acids (SCFAs) involved in sugar production — which resulted in elevated blood sugar. Diet Soda May Impact Your and Your Child’s Fertility \\nRecent research [24] also suggests artificially sweetened drinks may affect your fertility. It found a connection between saccharin and sucralose consumption and reduced fertility rates among women undergoing in vitro fertilization (IVF) treatment. These artificial sweeteners also raised the risk of a woman’s embryo having at least one deformity. Professor Dr. Adam Balen, chairman of the British Fertility Society (BFS), told The Daily Telegraph: [25] \\nThis is a very interesting study that suggests the false promise of artificial sweeteners that are found in soft drinks and added to drinks, such as coffee, may have a significant effect on the quality and fertility of woman’s eggs and this may further impact on the chances of conception. These findings are highly significant to our population. There should be more scrutiny of food additives and better information available to the public and, in particular, those wishing to conceive. ‘Diet’ Soda Is a Fraud \\nFalse advertising is prohibited by federal law, and the term “diet” is only permitted on brands or labels when it is not false or misleading. In light of the research demonstrating that artificial sweeteners actually raise your risk of obesity rather than combat it, the consumer group U.S. Right to Know (US RTK) has asked the Federal Trade Commission (FTC) and the FDA to investigate Coca-Cola Co., PepsiCo Inc. and other companies for false advertising. [26],[27] \\nIn its 2015 citizen petition to the FDA, [28],[29] US RTK asked the agency to issue warning letters to Coca-Cola and Pepsi, concluding that the beverages are misbranded because the use of the term “diet” is false and misleading. In another letter, [30] the group urged the agency to stop Coca-Cola Company from making “illegal claims that its artificially sweetened sodas prevent, mitigate or treat obesity,” noting that Coca-Cola has made such claims on at least eight occasions. \\nFor example, Coca-Cola Company announced that its No. 1 “global commitment to fighting obesity” is to “offer low- or no- calorie beverage options in every market.” [31] \\nHowever, if artificially sweetened beverages promote obesity rather than fight it — which research clearly indicates — then Coca-Cola’s commitment is anything but helpful. Nor is it supported by science. I listed a sampling of studies clearly refuting the industry’s “diet” claims in my previous article, “ Aspartame Update: Coke Illegally Claims Diet Soda Can Combat Obesity .” \\nMost recently, The New York Times [32] reported on a new study [33] showing water clearly beats diet soda for weight loss. Eighty-one overweight women diagnosed with type 2 diabetes ate the same diet, with one exception. Half drank diet beverages five times a week while the other half drank plain water. \\nSix months later, the group that drank water had lost an average of 14 pounds. The diet soda group lost an average of 11.5 pounds. The water group also saw greater improvements in measures of diabetes severity, such as fasting insulin and postprandial glucose. All of this is right in line with previous research showing artificial sweeteners promote weight gain and worsen diabetes . Expect More Artificial Sweeteners in Pepsi Products \\nPepsiCo is now vowing to reduce the amount of sugar they add to their drinks. [34] According to a recent announcement, at least two-thirds of its drinks will contain 100 calories or less from added sugar per 12-ounce serving by 2025. But while this may sound like good news, it simply means that more artificial sweeteners will be used. \\nIndeed, the company has stated it will achieve this sugar-reduction goal by introducing more artificially sweetened drinks and reformulating existing beverage recipes. Considering artificial sweeteners are more damaging than sugar, this means the company’s products will become even more harmful than they already are. \\nAs you may recall, just last year Pepsi announced it would stop using aspartame. The decision came on the heels of declining diet beverage sales following a string of bad press discussing mounting health concerns. \\nAlas, by September 2015 the company reintroduced aspartame, claiming consumers were demanding more choices. Whether that’s true or not is impossible to tell, but another, and more likely incentive, is that PepsiCo is simply trying to hedge their bets should a tax on sugary beverages actually go through. Reclaim Your Health by Ditching ‘Diet’ Drinks and Snacks \\nWhen you add together the various routes of harm — from confusing your body with sweet taste without calories, altering your gut bacteria for the worse, impairing your fertility and, who knows, maybe even “blowing holes in your brain” — it becomes easy to see how artificial sweeteners have likely played a role in worsening the obesity and diabetes epidemics since their emergence in our food supply, and how they may be undermining health in a myriad of unsuspected ways. \\nI strongly recommend avoiding ALL artificial sweeteners, and to read food labels to make sure you’re not inadvertently consuming them. They’re added to some 6,000 different beverages, snacks and food products, so there’s no telling where they might be hiding. \\nAs for safer sweetener options, you could use stevia or Lo Han, both of which are safe natural sweeteners. Keep in mind, however, that if you struggle with high blood pressure, high cholesterol, diabetes or extra weight, then you have insulin sensitivity issues and would probably benefit from avoiding all sweeteners, including natural ones. \\n\\nRead the full article at Mercola.com. \\nSources and References'"}, "time": 1742563123.8646586}