{"duration": 0.14180493354797363, "input_args": {"text": "'Carbon Tax Reversal in Washington State November 12, 2016 \\nExclusive: Washington State’s rejection of a modest carbon tax – opposed by some environmentalists for not being larger – marks a reversal for what could have been a model for the U.S., writes Jonathan Marshall. \\nBy Jonathan Marshall \\nEven as voters nationally elected a notorious climate denier as their next president, several environmental groups rallied to help defeat a ballot measure in the state of Washington that would have taxed carbon emissions. It was an historic missed opportunity that should provoke serious reflection about realistic strategies for fighting global warming. \\nWith the possible exception of the rising threat of nuclear war , no issue facing humanity is more urgent than climate change. Yet the world’s second largest carbon polluter, the United States, has consistently failed to take tough national measures to curb its emissions, owing to fierce resistance by the fossil-fuel industry and its conservative allies. Although most Americans believe climate change is real, they are easily spooked into inaction by warnings of higher energy costs or job losses. Graphic on “The Greenhouse Effect” at the Environmental Protection Agency’s Web site \\nThat’s why Initiative 732 on Washington’s ballot was so important: It offered a plausible way to bring skittish taxpayers and businesses on board the climate action train by addressing their concerns about the economic costs of environmental remedies. \\nThe $2 billion carbon tax proposal, modeled on a successful tax in neighboring British Columbia , offered a carrot-and-stick approach to effect change. Rising gradually over time, it would have added about 25 cents to the price of a gallon of gasoline and roughly two cents per kilowatt-hour to the price of electricity generated from fossil fuels. Most consumers would have found those “sticks” motivating but not crippling. \\nThe carrots in the measure were a 1 percent cut in the state’s regressive sales tax, near elimination of business taxes for manufacturing to protect jobs, and tax rebates of up to $1,500 for hundreds of thousands of low-income households. Through “revenue neutrality” — giving back the money it raised — the initiative aimed to quiet anti-tax activists. And targeting so many of the benefits to people of modest means, it beat the usual rap that higher energy costs fall hardest on those who can least afford them. \\nTax Endorsements \\nCharles Komanoff, New York-based director of the Carbon Tax Center, called the Washington proposal “fantastic,” saying, “I think it’s really fair and smart.” \\nThe proposal also won over influential Harvard economist Greg Mankiw, former chair of President George W. Bush’s Council of Economic advisers, who said “I’m hopeful that it would become a model for other states, and indeed nationwide. . . . This kind of thing is really the model for where climate policy needs to go in the coming years.” \\nMany economists believe that using market prices rather than command-and-control regulations to influence energy choices will ultimately achieve the most bang for the buck. \\nThe initiative also won the endorsement of the Audubon Society, famed climate scientist James Hansen, dozens of scientists at the University of Washington, and climate activist Leonard DiCaprio. \\nOn the other side, not surprisingly, the measure earned the militant opposition of Koch Industries, other petrochemical companies and a major utility. They spent more than a million dollars to kill the initiative. \\nMuch more surprisingly, the fossil-fuel lobby was joined in opposition, or non-endorsement, by Sierra Club, Union of Concerned Scientists, Washington Environmental Council, and several other environmental, social justice and health advocacy groups. By dividing the environmental movement, they helped cut the “yes” vote to 42 percent. \\nTheir chief concern: the initiative didn’t raise taxes enough or mandate more spending on renewable energy development, mass transit, affordable housing and community programs. They let their liberal-progressive ideas of the perfect be the enemy of what one MIT energy economist called “by far the most aggressive U.S. proposal” he’s ever seen. \\nPerfect as Enemy of Good \\nOpponents did raise legitimate issues, such as whether the initiative set the carbon tax high enough to fully pay for the tax rebates. Critics also questioned , with reason, whether the drafters’ studied attempts to win over businesses and conservatives would actually produce results. Oil billionaires David and Charles Koch. \\nBut some of the criticism was hyperbolic. Naomi “Shock Doctrine” Klein, for example, smeared the carbon tax initiative as “right-wing friendly” and “the policy choice of big polluters.” She further denounced it as “a disastrous precedent that could set back the climate justice movement for a decade,” apparently because it would not immediately “jumpstart an urgent, sweeping phase-out of fossil fuels” or “deliver the massive green energy investments and community-driven solutions we all need.” \\nKlein and other hard-liners fail to acknowledge some basic truths. First, even voters in liberal Washington may be reticent to approve huge new tax-and-spend programs. Second, slamming residents with really high carbon taxes would ensure the premature death of any such program. A modest carbon tax can be raised over time once voters are reassured that it doesn’t cost jobs or pinch their wallets excessively. \\nMoreover, purists ignore the fact that a more radical program in Washington, even if approved, would have no direct impact on global warming. The contribution of any one state to the global pool of carbon emissions is minuscule. Only broad, collective action ultimately matters. \\nWhere a state like Washington can make a difference is by showcasing a model approach with broad appeal. A successful and popular carbon tax in Washington might convince other states and other countries to follow suit, just as British Columbia’s successful tax is now spreading across Canada . That’s why Koch Industries and other fossil-fuel interests spent so much to defeat it. \\nEnvironmentalists who denigrate anything short of super-progressive policies are living in a thick bubble. In an age when the media barely even acknowledge the existence of climate change, and when voters elect Donald Trump president, we need creative new approaches to combating climate change. \\nLet’s hope the vote in Washington, rather than closing the door on smart carbon taxes, has, in the words of Audubon Washington’s executive director, “awakened a sleeping giant” in “the fight for commonsense climate solutions.”'"}, "time": 1742561859.0309308}