{"duration": 0.09864306449890137, "input_args": {"text": "'  Recipient Email => \\nFor journalists to discourage an inquisitive stance, even distrust, toward government and the elections process is astounding. But not surprising. I’m thinking of CNN journo Brian Stelter who asserted—they never argue, do they? They only ever assert—that skepticism about voting irregularities in America is “dangerous.” \\nWell, a journalist decrying inquisitiveness and skepticism: Now that’s dangerous. \\nStelter—he’s a danger to journalism—and the rest of the media Idiocracy like to repeat that Russian hackers (never the Stelters of the world) are undermining America’s great electoral system. I ask you: What can the Russians do to us that America’s elites have not already done? \\nWhen broadcaster Lars Larson attempted to find out whether one Arcan Cetin was a citizen of the US, ICE, the U.S. Immigration and Customs Enforcement, told him, essentially, “Sorry, our obligation is to protect this migrant’s privacy.” \\n“Who,” you ask, “is Mr. Cetin”? Cetin is a contributor to the phenomenon I term “murder-by-Muslim-immigrant.” He murdered five innocents, north of Seattle. \\nArcan Cetin voted, reports Mr. Larson. But nobody at ICE was willing to tell a good citizen like our broadcaster if Cetin voted legally or not. \\nAs it turned out, a sigh of relief was in order. The stellar Mr. Cetin, who, like most Muslim immigrants, voted Democrat, violated the Sixth Commandment five times, but, thank G-d, did not appear to have violated the commandment against voter fraud. Rumor has it that the murderer had been awarded citizenship, although it’s impossible to ascertain. \\nThe point I’m making here is that you can rest assured voter fraud is rampant in the US as in any banana republic—and not only because an American is barred from checking whether a Muslim murderer is a fellow-citizen. But because leftists have fought down-and-dirty to bar any proof of citizenship at the time of voting. Yes, the law requires, in my state, as in most of these United States, that you be a citizen, as well as a resident of the state in which you’re voting. But you don’t always have to provide proof of citizenship when voting. \\nTo vote in Washington State, as in most states, what’s needed is a driver’s license or a current State ID card . Essentially, the American voting system, thanks to the triumph of left-liberalism, is based on an honor system. \\nJournalist John Fund’s research has shown that when they vote, “80 percent of non-citizens vote Democratic.” And that “6.4 percent of non-citizens voted illegally in the 2008 election.” Funds’ sources confirm that a significant number of “non-citizens register as voters” and have voted in sufficient numbers to sway elections. \\nAnd when these efforts fail, the government might just step in to commit indirect voter fraud. \\nFor instance, the Feds recently and wrongly granted citizenship to hundreds facing deportation, an “error” the culprits where unwilling to correct. The point is that leftists, Obama’s DOJ, in particular, have pursued every legal remedy in the book against states seeking to require proof of citizenship from voters. \\nThe point is that we’re a sprawling country of competing interests, in which raw, ripe democracy has long-since usurped the old constitutional republic, where limits were placed on the power of thumping majorities. In a rank, raw democracy, where might makes right, and almost every vote is a lien against someone’s private property; voter-fraud by default is a big deal. \\nDonald Trump’s supporters might be the losers in something of a rigged electoral system; but they’re certainly not stupid. \\nThat’s another oft-repeated thing. Trump’s base of supporters is referred to as whites without college degrees. Again and again we hear that Mr. Trump is over-performing with white men without college degrees. The reference is intended not only as a demographic marker, but as a Mark of Cain. \\nWorse has been said about this statistical cohort. Quoted in “The Trump Revolution: The Donald’s Creative Destruction Deconstructed” are Republicans and Democrats alike, maligning Trump’s Middle America as worthy of contempt. \\nYou had writer Kathleen Parker hissing about Trump’s “undereducated” supporters. There was Joan Walsh, Salon editor-in-chief, proclaiming on MSNBC that she looked at those people and felt sad. “They share such a low common denominator,” groaned Joan about the “crazy, entertaining, simplistic talk” of the Trumpsters. “They’re all Republicans. … they really don’t have a firm grasp on reality,” she sneered. \\nNational Journal’s Ron Brownstein had his own taxonomy for Trumpsters. “Upscale Republicans” (or those on the panel with him), vs. “blue-collar Republicans.” Nothing but “downscale whites,” derided another Democratic strategist. \\nAnyhow, implicit in tethering a lack of education to Trump support is that the more educated a voter, the smarter. And the smarter the voter, the more likely he or she is to support Hillary Clinton and the Democrats. \\nBut correlation, of course, is not causation. My hypothesis points to a confounding variable or factor—another variable related to both education and voting-patterns that could account for the good sense displayed by Trump supporters without college degrees. \\nVoters without college or university degrees have not been institutionalized during life’s formative years. \\nVoters without college or university degrees have not spent years in the tertiary school asylums. \\nIn other words, many of Trump’s supporters are less likely to have been brainwashed and propagandized by the asphyxiating, postmodern, racial and gender agitprop that makes college-educated kids so insufferable and subject to group-think. \\nSpending protracted time in college or university is almost guaranteed to turn-out individuals whose uniformity of opinion is as scary as its uninformed nature. \\nSome support for my theory, namely that support for Trump is associated with a less propagandized population, is evident from the fact that Trump has an advantage with independents, which, as the label indicates, have a greater propensity to think outside-the-box.'"}, "time": 1742564035.8876624}