{"duration": 0.03139328956604004, "input_args": {"text": "'Vice-Emperor Pence’s Plane Skids Dangerously Off Runway \\nZeiger October 28, 2016 He’s survived. I guess some Jew’s prayer remains unanswered tonight. \\nWhile there was the makings of a tragedy, the heavens themselves have intervened to keep the Glorious Leader’s lieutenant safe and sound. \\nWhile there is currently any evidence that this accident was caused by human malfeasance, I’ll just go ahead and assume this was conjured by the Kabbalistic magic of vengeful Rabbis trying to thwart the God-Emperor’s rise to power. \\nABC news : \\nA charter aircraft carrying Donald Trump’s running mate Mike Pence slid off the runway Thursday night while landing at LaGuardia Airport in the New York City borough of Queens, prompting a temporary closure of the entire airport. \\nAbout an hour and a half after the incident, one of LaGuardia’s two runways has reopened for arriving and departing flights. The FAA said the airport’s other runway will remain closed indefinitely pending clearing of the aircraft. Immediately back into action. \\nAccording to the FAA, there were no injuries among the 37 people onboard the Boeing 737, which was arriving from Fort Dodge, Iowa. \\nPence tweeted, “So thankful everyone on our plane is safe. Grateful for our first responders & the concern & prayers of so many. Back on the trail tomorrow!” So thankful everyone on our plane is safe. Grateful for our first responders & the concern & prayers of so many. Back on the trail tomorrow! \\n— Mike Pence (@mike_pence) October 28, 2016 \\nAccording to an ABC News reporter on the aircraft, the GOP vice-presidential candidate came back to check on everyone on the plane and said there was mud on the windows and the plane had skid onto the grass. \\nAccording to The Associated Press, the plane made a rough impact when it landed. The AP also reported that the pilot slammed on the brakes and passengers could smell burning rubber. \\n— Ines de La Cuetara (@InesdLC) October 28, 2016 \\nOn one hand, whenever I hear about airplane shenanigans involving high-level American politicians, my first reflex is to assume some kind of nefarious plot. But things seem relatively straightforward here. \\nIt was raining, the runway was slippery, and the plane just had a rough landing. \\nBut if anything, this event will still help the Trump campaign. Because of all the scandals involving the Clintons these days, many people will have a vague suspicion that this might have been an attempt on Pence’s life by system agents. People are already speculating in that direction on Twitter. \\nAgain, there is not reason as of yet to seriously entertain conspiracy theories. But that doesn’t mean those perceptions don’t exist. And it doesn’t mean they don’t affect the election.'"}, "time": 1742628531.0834463}