{"duration": 0.0711357593536377, "input_args": {"text": "'The Huffington Post, installing new leadership after the recent departure of its   Arianna Huffington, reached into the senior ranks of The New York Times on Tuesday and hired Lydia Polgreen as its top editor. Ms. Polgreen, who joined The Times in 2002, has been serving as an associate masthead editor overseeing The Times’s ambitious global expansion project. “To me this felt like an unmissable opportunity to take a massive journalistic platform that was at an inflection point and think about what the possibilities are of what it could be,” Ms. Polgreen said in an interview. She added: “This is not about leaving The Times. This is about seeing a really big opportunity that I frankly didn’t go looking for but came to me, and wanting to grasp it. ” Ms. Polgreen, 41, said she was drawn to The Huffington Post’s “explicitly progressive mandate and identity,” particularly given this moment in the country’s history. She began talking to The Huffington Post before the election, she said, but the election results were “certainly a factor” in her decision. As The Huffington Post’s top editor, Ms. Polgreen said her main challenge was to “get The Huffington Post back in touch with its fundamental roots in reporting. ” She also said she wanted to guide the publication in the language it would use to cover the Trump administration. Ms. Huffington, who founded The Huffington Post in 2005, stepped down as editor in chief in August to focus on her new venture, a health and wellness   called Thrive Global. No successor was named at the time, and the publication has been operating under an interim editorial committee acting in Ms. Huffington’s place. In an interview, Jared Grusd, chief executive of The Huffington Post, said that nearly half of his site’s monthly audience comes from outside the United States, and he pointed to Ms. Polgreen’s experience as a foreign correspondent, and her supervision of digital projects within The Times, as well suited to the Huffington Post’s mission moving forward. “We were looking for someone who has tremendous integrity, with deep roots in the process of journalism and the way in which journalism needs to function,” he said. “She’s somebody who can carry our voice, and translate our narratives, across fundamental shifts in the media landscape and the political landscape. ” The Huffington Post was purchased by AOL in 2011 for $315 million. AOL sold itself to Verizon for $4. 4 billion in 2015. Ms. Polgreen previously worked as a foreign correspondent in South Africa, India and West Africa for The Times, and has also served as a deputy international editor. Her departure comes as The Times is shifting to its next generation of leadership. In September, it elevated Joseph Kahn to the position of managing editor, positioning him as a leading candidate to succeed Dean Baquet, the executive editor. Ms. Polgreen was widely considered to be on a path to further advancement at The Times as it moved to a future built around digital and international initiatives. “Lydia Polgreen is a highly creative journalist,” Mr. Baquet said. “She will do great things, and I have to admit to a certain pride that The Huffington Post saw the value of hiring one of The Times’s great young stars. ”'"}, "time": 1742561987.3079069}