{"duration": 0.07919764518737793, "input_args": {"text": "'Breitbart News Senior    Peter Schweizer  —   hailed as the “chief   in the media” by SiriusXM host Alex Marlow  —   joined Breitbart News Daily Wednesday with a progress report on President Trump’s efforts to drain the “swamp” of Washington corruption. [“I will say this: I think the table has been set,” Schweizer said. “The tone I think has been very, very good. The Washington establishment is often obsessed with the notion of things running smoothly, and why are things not running smoothly. The problem with that is, it’s kind of akin to saying ‘my car is running well’ as we drive over the cliff. ”  “You don’t want things to run smoothly if bad decisions and bad leadership is occurring, and that’s what we’ve had for a long time,” he continued. “So I like very much the tone that has been set, that business as usual is not good for the country, that there needs to be change, that there’s rampant corruption and  . The tone has been very good. ” “In the first hundred days, there has not been a lot of movement in terms of legislation or actions that need to be taken,” he added. “The president has instituted this policy where there’s a ban on lobbying if you serve in the Trump administration. Great idea in theory the reality is, it’s not really a law, it really can’t be enforced, somebody can ignore it when they leave. ” “My hope is that we’re going to see, in combination with people in the Freedom Caucus and other reformers, working with this administration to really get at the root of the business model of official Washington,” said Schweizer.  “What I always tell people is, if you don’t like the decisions that are being made and you feel like Washington, DC, is unresponsive to you, chances are it’s because somebody is being paid off or palms are being greased. The reason we don’t have representative government is because we have corruption, and we have payoffs. That’s really the root cause, in my mind, of a lot of the issues we’re talking about today,” he said. Schweizer said there are “a number of reforms that have been floating out there for a couple of years” that would help to drain the swamp. “Some of them have been pushed by guys like Sen. Rand Paul, others of them going back 20 years,” he said. “One of them I think would be term limits. I was not a big fan of term limits. I think term limits now are a great idea for Congress. It’s the way you get entrenched people out of there, and I think nobody is irreplaceable. ” “The second thing is, you need to have a lifetime ban on lobbying by members of Congress when you leave, and you need to have a ban on lobbying by immediate family members,” he continued. “The third reform that I think would be very helpful is one that Rand Paul has pushed, which is a   requirement. ”   “One of the ways in which they hide a lot of nasty things in legislation is, there will be a big highway bill, and they will insert some obscure language two or three sentences is sometimes all it takes, and it could be related on a totally different subject,” Schweizer explained. “They insert it into the bill, and then, lo and behold, everybody realizes after that transportation bill becomes law that there was some boondoggle inserted. Under a   rule, you could not attach unrelated issues, or embed them or amend them, to complex pieces of legislation. ” “Those three things  —   term limits, a ban on lobbying by congressmen and their family members, and   ruling  —   I think would be very powerful in getting started this process of draining the swamp,” he recommended. Schweizer gave the media a poor grade overall for monitoring Washington corruption during the Obama years, although he acknowledged there are “some great reporters out there that do work individually. ” “The large news organizations, I think either some of them certainly had an ideological or philosophical predilection to support Barack Obama. I think second of all when you did have honest news outlets and honest reporters, there’s the resource issue. They just aren’t willing to spend money on it. But the third issue is this issue of transparency,” he said. “Look, I’ve been critical, I think, that the Trump administration should not stop releasing the White House visitor logs. I think that is a transparency issue that’s a good thing,” Schweizer said. “Yes, I know that in the Obama administration, if somebody in the White House wanted to meet with a lobbyist, instead of doing it in the White House where it would be logged, they would go across the street in a coffee shop, so there are ways around it. But I do think it’s important for there to be transparencies, so I would urge the Trump administration to reverse itself on that issue. ”  He said there was “positive work being done by the Trump administration” in the area of regulatory reform. “This problem of transparency is a vital one. The reason that bills are so complex, or regulations put out by the EPA are so complex, is because people get paid for complexity,” said Schweizer. “This is a business model. It’s not just about liberals at the EPA who want to control people’s lives. It’s about people who work for the EPA who know that if you make a regulation complex and hard to understand, the person that wrote that can quit their job and get a very, very lucrative consulting career, by being hired by companies to comply with the rules the wrote. That’s another area where we have this problem of the revolving door where reform needs to occur. ”  “It begins with transparency. It’s like having good intelligence on the battlefield. You can’t know precisely how to respond to the enemy unless you know where the enemy is lurking. That’s what transparency allows us to do with corruption  —   find out where it’s lurking,” he said. “I hope on the area of transparency, where it comes to the big infrastructure projects, we’re going to see transparency, and we’re going to really see a commitment to making sure that the infrastructure projects being done reflect the interests of the country,” Schweizer said. “I’m somebody who believes that spending money on infrastructure is a legitimate action for the government. This is part of the nerve system of the country. ”  “The problem is that things like the Transportation Committee in the House of Representatives, these massive infrastructure projects often are designed not so much to meet the infrastructure needs of the country, but to line the pockets of the supporters of the politicians who are crafting and designing these projects,” he warned.  “I think the infrastructure project is important. I think it’s going to be helpful to the country. I think it’s something that’s long overdue, having driven roads all around the United States. I think we’re all aware of the shortcomings there. But again, it’s going to be crucial how it’s done,” he said.  “This is a classic problem in Washington, DC,” Schweizer recalled. “You go back and you look at Ronald Reagan, you look at FDR. It’s not just a question of having a certain idea we’re going to implement and do this, it’s how it’s implemented. So often, presidents get tripped up because the Deep State, or the permanent political class, essentially hijacks the project and says, ‘Yeah, we think infrastructure’s a great idea. We’re now going to use this massive program to serve our terrific purposes and to help our people, rather than really design something for the benefit of the country. ’”  “I think infrastructure’s important, and I’m hopeful that we’re going to have sufficient transparency so it’s not hijacked by the permanent political class,” he stressed. Peter Schweizer is a senior    for Breitbart News, president of the Government Accountability Institute, and author of   books such as Clinton Cash: The Untold Story of How and Why Foreign Governments and Businesses Helped Make Bill and Hillary Rich. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742628482.0682573}