{"duration": 0.04734373092651367, "input_args": {"text": "'Twitter has reversed one of its new   features following complaints that it encouraged even more abuse on the platform. [After Twitter announced on Monday that a new   feature would stop notifying users when they’d been added to a list, several complaints started to immediately gain traction.  We want you to get notifications that matter. Starting today, you won’t get notified when you are added to a list. https:  .   —   Twitter Safety (@TwitterSafety) February 13, 2017,  “Being added to a list and knowing what list you were added to was literally the last useful thing about Twitter,” complained one user. @TwitterSafety Being added to a list and knowing what list you were added to was literally the last useful thing about Twitter.  —   Anthony Quintano 🌴 (@AnthonyQuintano) February 13, 2017,  “This isn’t a good move. Please reconsider,” added another. @TwitterSafety @Support @mrdonut @peterseibel This isn’t a good move. Please reconsider.  —   EricaJoy (@EricaJoy) February 13, 2017,  “Yeah no this update is bad and seems to misunderstand the nature of abuse on the platform,” another user proclaimed, while one verified account simply added: “you just made it easier for people to stalk other people so good job. ” @SwiftOnSecurity @TwitterSafety @Support yeah no this update is bad and seems to misunderstand the nature of abuse on the platform cc @jack,  —   jake (@jakebeckman) February 13, 2017,  @TwitterSafety you just made it easier for people to stalk other people so good job.  —   Carli Velocci (@velocciraptor) February 13, 2017,  @TwitterSafety @Support Man, I was having hope y’all would make one smart move to start 2017. Come on.  —   Austin Braun (@AustinOnSocial) February 13, 2017,  @TwitterSafety lol you are so fucking bad at this,  —   Lev Novak (@LevNovak) February 13, 2017,  @TwitterSafety how boneheaded.  —   Stephen Toulouse (@Stepto) February 13, 2017,  Following complaints, Twitter quickly reversed their decision, announcing, “We heard your feedback  —   this was a misstep. We’re rolling back the change and we’ll keep listening,” just hours later. We heard your feedback  —   this was a misstep. We’re rolling back the change and we’ll keep listening. https:  .   —   Twitter Safety (@TwitterSafety) February 13, 2017,  Twitter first announced their new wave of   features in a blog post last week. The changes reportedly include extra measures to stop suspended users from creating new accounts, “safer search results,” and the collapsing of “potentially abusive or   Tweets. ” “In the days and weeks ahead, we will continue to roll out product changes  —   some changes will be visible and some less so  —   and will update you on progress every step of the way,” declared Twitter in their post. “With every change, we’ll learn, iterate, and continue to move at this speed until we’ve made a significant impact that people can feel. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562981.9187188}