{"duration": 0.04299283027648926, "input_args": {"text": "'0 Add Comment \\nAS TEACHERS in Ireland enjoy some well earned time off this week, they have been plagued by the undeserved stereotype of being hard party animals that love nothing more than to be 4 days into a session with no end in sight. \\nWWN carried out some extensive research to discover not all teachers fit the lazy stereotype and are actually making the most of their time off. \\nHere’s 5 things they’re doing that won’t result in them ending up face down in a pool of their own vomit while haphazardly correcting your child’s ‘I love my Mammy because’ essay. \\n1) Pre-Session \\nDon’t even try to class this as a balls to the wall session. It isn’t. Do not misunderstand the situation. A pre-session is no more a session than the Pope is a Muslim. So don’t try and pull a fast one on teachers. Sure it can’t be a session, there’s no drugs in sight, trust us, we looked. \\n2) Just the one \\nJust going for the one is simply that, an expression of a desire to have a casual catch up with a fellow teacher friend without being unfairly labelled a basket case that can’t go two minutes without recreating their favourite scenes from Trainspotting. And it’s still ‘just the one’ if it’s an early house, after ambling home from last night’s pre-session. \\n3) Correcting essays \\nSee, it’s not all fun and games and importing four tonnes of class A drugs. Teachers have some serious work to do, and a bottle of wine and a line will certainly make the whole thing go more smoothly. \\n4) Bumping into a student in a nightclub \\nAn awkward encounter many people can sympathise with. What is your favourite pupil Thomas doing in Flannerys at 2.30am? And what’s he eating a Toffee Crisp for? Why is his mother shouting at you? Wait, why does Flanneys now look eerily like a suburban front garden. An easy mistake to make, don’t worry about it. \\n5) Re-lax-ing-the-fuck-out \\nEducating the Nation’s little shits isn’t easy, we can only imagine, which is why teachers often just catch up on their sleep during a midterm. Or if sleep isn’t possible, a trance sleep-like state after necking some Ketamine in a field in Kildare.'"}, "time": 1742563225.1404445}