{"duration": 0.031196117401123047, "input_args": {"text": "\"The Great Move of China 2020 is Underway October 31, 2016 The Great Move of China 2020 is Underway \\nChina will invest 946.3 billion yuan ($140 billion) by 2020 to relocate its poorest citizens from remote, inland regions to more developed areas, the state planner said on Monday. \\nThe mass relocation is part of a strategy to lift 10 million people out of poverty by 2020, with 2 million estimated to be moved this year, the state council said in May. \\nThe funds will be used mainly to construct homes, support facilities and basic public infrastructure, with the rest going to the restoration of vacated lands, state planner National Development and Reform Commision (NDRC) said in a document. \\nREAD MORE: CHINA BETS BIN ON NUCLEAR FOR ENERGY INDEPENDENCE \\nThe investment will be financed mainly by China's two policy banks - China Development Bank and Agricultural Development Bank of China, who will provide 341.3 billion yuan in long-term loans and 50 billion yuan in construction bonds - as well as by local governments, who will provide 285.8 billion yuan. \\nLocal governments will also raise up to 100 billion yuan through bonds, while the central government in Beijing will allocate around 80 billion yuan. Relocated villagers are expected to contribute 21.5 billion yuan. \\nChina's poor make up about 5 percent of a population of 1.4 billion, living mostly in the countryside and earning less than 2,300 yuan a year, according to the government and state media. \\nMore than 12 million people were moved in earlier relocation efforts as of the end of last year, the NDRC said. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories\""}, "time": 1742628418.0589314}