{"duration": 0.1423964500427246, "input_args": {"text": "'langues , enfants \\nEn octobre dernier, Bella est devenue célèbre du jour au lendemain grâce au projet Personnes extraordinaires présenté par la chaîne de télévision Rossiya 1. La vidéo dans laquelle la petite fille répond aux questions, chante des chansons et parle dans plusieurs langues a suscité un grand intérêt sur les réseaux sociaux. « Je me sens stupide par rapport à cet enfant » , écrivaient les internautes dans les commentaires. \\nIoulia Deviatkina, la mère de Bella, affirme que sa fille n’est pas un enfant prodige, ses parents accordant simplement beaucoup d’attention à son développement. « Les enfants n’ont pas forcément besoin de parler sept langues, mais chaque petit est capable de maîtriser deux ou trois langues » , assure Ioulia. \\nLes parents de Bella sont conscients que dans la vraie vie, la petite fille n’utilisera pas les sept langues activement : c’est tout simplement impossible. « Quand elle ira à l’école, nous nous concentrerons sur l’anglais, le français et le chinois » , précise la mère de la petite fille. \\n« Nous n’avons pas peur que Bella s’ennuie en classe non plus. Elle possède les connaissances obligatoires pour tout enfant de quatre ans. Simplement, elle est capable de parler sur ces sujets « enfantins » dans plusieurs langues différentes » . Le gazouillis en français \\nLa mère de la petite fille est linguiste de formation et enseigne l’anglais aux enfants depuis sept ans. Son père travaille à l’Institut de recherche Radio. C’est une famille de classe moyenne. Cependant, pour les parents de Bella, le développement de leur fille est l’investissement le plus important. Окт 18 2016 в 3:35 PDT \\n\\nInitialement, les parents de Bella voulaient qu’elle parle couramment l’anglais. Ainsi, dès la naissance, sa mère lui parlait en deux langues, les alternant jour après jour. Elle veillait à ce que les langues ne se mélangent pas et interdisait à sa fille d’utiliser des mots russes dans les conversations en anglais. \\nQuand Bella a eu 10 mois, ses parents ont rajouté le français. Elle ne savait pas parler, mais pouvait montrer du doigt les objets nommés par les adultes. Lire aussi : De jeunes mères russes racontent comment leur enfant a bouleversé leur vie \\nBella a appris à lire avant de commencer à parler. Dès l’âge de cinq mois, ses parents lui apprenaient à lire grâces à des cartes spéciales. Par exemple, quand on montrait à Bella, âgée de neuf mois, le mot « main » en russe ou en anglais, elle montrait sa main. Avant l’âge d’un an, la petite fille a appris 60 de ces cartes avec ses parents. Elle a commencéà lire couramment à l’âge de deux ans. Dessins animés en chinois \\nÀ deux ans, Bella savait parler avec des phrases courtes et lire avec aisance dans trois langues. Avant l’âge de trois ans, ses parents ont rajouté le chinois au « programme » . Ioulia raconte que la petite fille montrait un grand intérêt pour la nouvelle langue. Elle demandait même qu’on lui mette des dessins animés en chinois . Окт 5 2016 в 5:26 PDT \\n\\nÀ l’âge de 3 ans et 2 mois, la petite Bella étudiait volontiers l’espagnol et l’allemand, mais aussi la danse, le violon et le chant . Puis, on a rajouté l’arabe. Bella se promène, joue à cache-cache et lit des livres pour enfants, mais elle le fait en plusieurs langues différentes. Tous ses cours se déroulent sous forme de jeu. \\nSes parents organisent des voyages ludiques avec des locuteurs natifs, elle fréquente un club de théâtre en anglais, apprend le dessin en français, la danse en espagnol et suit des cours de patinage avec un locuteur allemand. Par ailleurs, ses parents lui organisent régulièrement des cours collectifs avec des amis qui sont également élevés dans un milieu multilingue. Lire aussi : Le russe, cinquième langue dans les écoles de l’UE Outil de développement du cerveau \\nLes chercheurs confirment que la capacitéà parler plusieurs langues et de passer de l’une à l’autre dépend de l’interaction entre différentes zones du cerveau. Elles se mettent en marche en fonction des caractéristiques phonétiques de la langue, de son système grammatical, de l’imagerie linguistique et même de la tonalité de la prononciation. \\n« Chaque nouvelle expérience se reflète dans le cerveau par l’émergence de connexions nerveuses. L’hippocampe, responsable de la mémoire, stimule la croissance de nouveaux neurones. Le volume de certaines zones du cerveau croît littéralement » , explique la psychologue Tatiana Diatchenko. Окт 16 2016 в 1:18 PDT \\n\\n« Le multilinguisme a une influence positive sur le développement général de l’enfant, même s’il peut provoquer un retard du développement du langage à cette étape, par rapport aux enfants qui n’apprennent qu’une seule langue » , explique Kira Ivanonva, spécialiste de l’Institut de recherches linguistiques auprès de l’Académie russe des sciences. \\nCependant, un apprentissage précoce ne garantit pas que l’enfant parlera couramment la langue plus tard. « Je connais une mère qui ne parlait qu’anglais avec son enfant à partir de l’âge de trois ans. Aujourd’hui, ce petit n’est même pas capable de maîtriser le programme d’une école normale, non-spécialisée » , raconte Maria Molina, chercheuse à l’Institut de linguistique auprès de l’Académie russe des sciences. Lire aussi :'"}, "time": 1742562147.6039593}