{"duration": 0.18560075759887695, "input_args": {"text": "'Why So Few Whistleblowers? A Former CIA Agent\\'s Story « on: Today at 11:42:10 AM » Kevin Shipp is a major whistleblower coming from a solid background as a courageous, decorated CIA officer and anti terrorism expert. He held several high level positions in the CIA. A 2011 New York Times article describes the shocking details of Shipp\\'s harrowing personal story of seeking justice and eventually turning whistleblower after his health and the health of his family were severely compromised.Running into the juggernaut faced by so many whistleblowers, Shipp ended up with both his marriage and his career destroyed. Yet in the end Shipp prevailed and managed to stay out of jail. He now speaks openly about both his own personal experiences and how the system works to silence and punish whistleblowers, and in so doing keep corruption and illegal activities at all levels covered up.Shipp\\'s excellent essay below explains in detail why so few whistleblowers have come out on highly illegal activities related to Pentagon corruption, CIA manipulation and overthrow of governments, 9/11 shenanigans, secret mind control programs, and much more. His words show just how much courage it takes for people like Edward Snowden and Julian Assange to expose major government corruption. By spreading the word and calling for clear strong laws to protect whistleblowers, we can make a difference.With best wishes for a transformed world,Fred Burks for PEERS and WantToKnow.infoFormer White House interpreter and whistleblowerSilencing WhistleblowersBy Kevin ShippWhy don\\x92t more \\x93whistleblowers\\x94 come out to expose illegal or unconstitutional secret government operations? If these activities are so illegal, why are people not coming forward to report them?Over the last fifty years US government intelligence agencies have perfected a complex, sequential system to systematically silence or destroy any employee, including his or her family, who attempts to reveal illegal or unconstitutional activities conducted as part of secret government operations.As a condition of employment, military and intelligence employees recruited for secret operations are required to sign a \\x93secrecy agreement,\\x94 or \\x93nondisclosure agreement,\\x94 before being given access to the position, which offers high pay and status in the organization. This agreement threatens civil and criminal penalties if the employee reveals ANY information regarding the program. Thinking the agreement will only be used for legal purposes and will get them the coveted job, all employees eagerly sign it.This secrecy agreement was originally designed to protect legitimate classified information, to protect military personnel during wartime and protect legitimate national defense information and technology.However, because of the binding power of the agreement, government agencies began using it as a powerful tool to silence federal employees who question the legality of certain government operations. It was the perfect tool to threaten, silence or jail any whistle blower who dared to challenge the secret operations of government.Today, the secrecy agreement is routinely used as an efficient weapon to intimidate or silence employees. Annual refresher briefings are given to remind employees of the penalties for violating the agreement. These penalties include huge fines, termination, financial ruin and even prison \\x96 all of which mean the destruction of their lives and their families. Most will not reveal any wrongdoing, no matter how egregious, for fear of calculated, severe retribution.When employees sign the secrecy agreement and are cleared for classified programs, they are not told they are giving up their right to a jury trial, or to sue the agency that hired them. If they try to do so as a whistle blower, they find they have no right to be heard in federal court. Many have found this out when their case was denied; then it was too late. That is part of the system.If the employee attempts to contact their Congressman or Senator, their representative is blocked from receiving any information about their case, because they do not have the necessary \\x93clearance.\\x94When the employee attempts to blow the whistle to the Congressional intelligence committees, their response is ignored. It is made clear to committee members that they are not to touch such cases, so they refer them back to their Senator or Congressman, who cannot access information involved in their case.If a courageous employee continues to proceed and blow the whistle, a system of personal and career destruction follows. This begins with promotions being denied, being turned down for sensitive or career enhancing assignments, and their files being flagged, ruining their reputation inside their agency. At this point their career is over. If they go quietly, the retribution stops.When the employee still continues their effort to report the information, their travel records, personnel records, medical records and security records are searched for mistakes or damaging information that can be used to threaten them with termination. Their telephones and computers are monitored searching for incriminating information. If no substantive information can be found, it is fabricated and placed in their file.Employees who refuse to back down are then subjected to internal \\x93security investigations,\\x94 multiple, hostile \\x93interviews,\\x94 attempting to get them to recant their information, and multiple polygraph interrogations.In many cases, the employee is commanded to report to the internal medical office for psychological evaluation. If they comply, the evaluation labels them as paranoid, unstable, or disgruntled. This information is placed in their file and is used later to justify the agency\\x92s action in the event of outside scrutiny.If the employee contacts a member of the news media, they are immediately cited with violating their secrecy agreement and criminal penalties are filed against them. Several news media outlets are connected to the CIA and NSA and notify them of the employee\\x92s contact.Finally, the employee is forced to resign after being threatened with termination in kangaroo court meetings where the information fabricated in their files is used against them.After termination or forced resignation, interest rates on their internal credit union loans are raised to make the payments unaffordable. The release of the employee\\x92s retirement funds needed provide for their family are blocked (a felony). The agency black lists them from gaining employment with other government agencies or contractors, further ruining them financially.Dehumanized, financially ruined and under severe emotional and mental pressure, the employee\\x92s family begins to break apart. If the family\\x92s foundation is not strong, this results in alcoholism, depression and divorce. In some cases, it has resulted in the employee committing suicide, the ultimate goal of the program of destruction. This silences the employee permanently, obscuring the agency\\x92s role in their destruction. It is the perfect crime.Should the employee still have the resolve to endure this program of career and personal destruction and continues to press for release of the information, or if his family members attempt to sue the agency for the illegal activity, classified agencies will invoke the secretive State Secrets Privilege, which orders the employee and his family not to reveal the information or face prison. If the family\\x92s case reaches federal court, the State Secrets Privilege is invoked and the case is shut down \\x96 and sealed. Federal judges rubber stamp the censoring of the case without reviewing the case facts.Now that the employee\\x92s case, and in some cases their family\\x92s case, is shut down and under seal, citing \\x93national security,\\x94 the process of silencing the employee is complete. Many are never heard from again, fearing prison if they talk to anyone, including an attorney.Using attractive awards of multi-million dollar contracts, the US government military industrial complex convinces private corporations that their employees must be cleared and sign secrecy agreements. This includes employees at all levels, from secretaries to CEOs. Once they have signed the secrecy agreement, they are bound to keep all information, including potentially illegal information, quiet, being threatened with the same penalties.To date, over five million Americans have been required to sign this secrecy agreement and now fall under the shadow of the State Secrets Privilege.Only a few federal employees have made it through this systematic process of destruction to reveal what they know about the illegal operation they observed. Sadly, some whistle blowers have died \\x93mysterious\\x94 deaths or committed \\x93suicide.\\x94Employees in intelligence agencies are aware of penalties contained in the secrecy agreement and the huge risk in violating it, even to expose corruption. Most look the other way to protect their careers, retirements and families. Many have observed the outward signs of the system of personal and career destruction used on others and a culture of fear exists. But, they are not fully aware of all that is being done. The full scope of the system is only known at the higher levels of the organization and is hidden from employees, until its use is necessary.This is why we do not see whistle blowers coming out and reporting what they have seen. This system has been used and perfected for over fifty years. It is being used because it works.It works, unless the system is exposed, the whistle blower knows what is coming and prepares for it, and they are supported by private organizations and individuals dedicated to truth in government.This support is essential, not only to protect the whistle blower and their family, but also to defend our Constitutional form of government from tyranny.Kevin M. Shipp,Video https://youtu.be/Nl5NW9KcMt0 Logged \"The two enemies of the people are criminals and government, so let us tie the second down with the chains of the Constitution so the second will not become the legalized version of the first.\"Thomas Jefferson'"}, "time": 1742562127.504755}