{"duration": 0.07718729972839355, "input_args": {"text": "'Marc Zell, co-chairman of Republicans Overseas Israel speaks as the Republican Party launches its first ever election campaign in Israel in Modiin, Monday, Aug. 15, 2016.\\nDonald Trump’s adviser on Israel said on Wednesday that Jewish settlements in the occupied West Bank are not illegal, adding that he believes the candidate agrees with him, putting the pair at odds with much of the world.\\nSpeaking to AFP at a rooftop restaurant on Jerusalem’s Mount Zion after a pro-Trump rally, David Friedman also said the US presidential candidate was “tremendously sceptical” about the prospects for a two-state solution to the Israeli-Palestinian conflict.\\nAbout 150 people, including right-wing Israelis and evangelical Christians, attended Wednesday’s Trump rally outside the walls of Jerusalem’s Old City, near the flashpoint Al-Aqsa mosque compound.\\nThe compound is holy to both Muslims and Jews, who refer to it as the Temple Mount. Located in East Jerusalem, it was occupied by Israel in 1967 and later annexed in a move never recognised by the international community.\\nAsked whether Trump viewed the West Bank as part of Israel, as many far-right Israelis do, Friedman did not answer directly.\\n“I don’t think he believes that the settlements are illegal,” Friedman said.\\nMyself and . @realDonaldTrump senior #Israel advisor David Friedman at the #JerusalemForever event that was held tonight at the old city. pic.twitter.com/2JxEWRrk8o\\n— Israeli for Trump (@davidweissman3) October 26, 2016\\nIsraeli religious nationalists see the Palestinian territory as part of the country, citing Jews’ connection to the land from biblical times.\\nThe US has intensified criticism of Israeli settlement building in the West Bank in recent months, warning that it is eating away at hopes for a two-state solution.\\nSettlements in the West Bank are viewed as illegal under international law and are major stumbling blocks to peace efforts because they are built on land seized in the 1967 war which Palestinians see as part of their future state.\\nAt an American Israel Public Affairs Committee conference in March, Trump described an “unbreakable bond” between the US and Israel.\\n“When I become president, the days of treating Israel like a second-class citizen will end on day one,” Trump told delegates, in a speech that heaped praise on Israel and derided Palestinians as perpetrators of violence.\\nRecalling rounds of failed peace talks between the two parties, Trump blamed Palestinian leaders.\\n“To make a great deal, you need two willing participants,” Trump said. “We know Israel is willing to deal. Israel has been trying to sit down at the negotiating table without preconditions for years.”\\nFriedman reiterated that Trump would recognise Jerusalem as Israel’s capital and move the US embassy there – which would break with decades of precedent and put Washington at odds with most UN member states.\\nThere were chants of “lock her up” when Trump’s Democrat rival Hillary Clinton’s name was mentioned at the rally ahead of the 8 November vote – a common refrain among Trump supporters who want to see her jailed over an emails scandal.\\n“I hate Hillary. She’s the same like (Barack) Obama,” said Ran Hofman, 54, who waved an Israeli flag. “They screw up the whole world.”\\nA brief video message from Trump of about one minute was played at the event.\\n“Together we will stand up to the enemies like Iran, bent on destroying Israel and her people,” Trump said. “Together we will make America and Israel safe again.”'"}, "time": 1742563287.034261}