{"duration": 0.09234809875488281, "input_args": {"text": "'A Bureau of Land Management (BLM) internal working document that was leaked and reported on by the liberal Greenwire website spells out in detail President Donald Trump’s plan for making America great again. [It lists expanding production of domestic energy resources, supporting law enforcement,  the military, and enhancing border security.  “Several conservation and government watchdog groups say they’re concerned about the direction the Bureau of Land Management is headed after a draft list of agency priorities under the Trump administration surfaced this week,” Greenwire’s EE News reported on Monday. “The draft   ‘BLM Priority Work’ list, first reported on yesterday by EE News, calls for the agency to focus on increasing energy development in suitable areas of the 245 million acres BLM manages (Greenwire, April 10),” EE reported. The document is divided into five sections  —   “Making America Safe through Energy Independence” “Making America Great Through Shared Conservation Stewardship” “Making America Safe  —   Restoring Our Sovereignty” “Getting America Back to Work” and “Serving the American Family. ” EE gathered statements from environmental activists in response to the leaked document, which it said “calls on the agency to streamline federal coal, hardrock mining, and oil and gas ‘leasing and permitting processes. ’” “It also prioritizes streamlining unspecified ‘processes’ mandated by the National Environmental Policy Act (NEPA) as well as ‘land use planning to support energy and minerals development and other priorities,’ including ‘   processing for pipelines, transmission lines, and   projects,’” EE reported. Under the “Make America Safe” headline, it calls for BLM taking action to “coordinate with the Department of Defense to ensure that public lands and resources are available to support the mission of our military” and to “prioritize clearance and approval process to support Southern Border actions. ” EE illustrated its report with a photograph of the wall now in place along the U. S. border with Mexico, which Trump has vowed to expand. The document states that BLM will “provide employment opportunities for veterans and youth to work on public lands. ” But critics of Trump’s plans expressed horror after reviewing the document. “The Trump administration is prioritizing drilling, mining and the construction of an immoral and   border wall over protecting America’s public lands and people’s health,” League of Conservation Voters Deputy Legislative Director Alex Taurel said in a statement given to EE. “Our country’s public lands should be preserved for all people to enjoy and should not be handed over to corporate polluters,” Taurel added. “The priorities from Trump’s Bureau of Land Management make it clear that the administration is not planning to manage our parks and other special places for the use and enjoyment of the people, but rather for the profits of corporate polluters,” Athan Manuel, director of the Sierra Club’s public lands protection campaign, said in a statement provided to EE. “America’s public lands are worth much more than what lies underneath,” Manuel said. “These are the places where families spend time together, where people and wildlife both can take refuge as they enjoy and explore our wild places. ” But EE reported that a senior BLM official “defended the priority work list, telling EE News this week that it is meant to help agency staff understand that the Trump administration will prioritize the agency’s full ‘ ’ mission  —   including increased public access and recreation  —   and not concentrate solely on promoting fossil fuels or any other energy development. ” Under the “Serving the American Family,” BLM included in its goals expanding recreational, hunting and wildlife conservation opportunities, working with state and local law enforcement to improve public safety and streamlining grazing permits to help American ranchers and farmers.'"}, "time": 1742563438.013709}