{"duration": 0.12236356735229492, "input_args": {"text": "'  Bitcoin Soars As China Launches Crackdown On Wealth-Management Products Oct 26, 2016 3:36 PM 0 SHARES \\nAfter trading in a tight range for much of the summer, coiled within a $100 range around the mid-$500s, over the past several weeks bitcoin has once again started to push higher, closely tracking the decline in the Chinese Yuan as shown below. \\nHowever, the most recent burst in bitcoin activity, which sent it surging by over $20 overnight, has little to do with any moves in the official Chinese currency, which recently rebounded modestly tracking the recent dip in the dollar, and is likely attributable to a long overdue crackdown on China\\'s Wealth-management products, a key component of China’s \"shadow banking\" system. \\nAs Bloomberg reported overnight , China’s central bank is finally conducting a trial monitoring of banks’ off-balance-sheet wealth-management products under its macro-prudential assessment system. A question one should ask perhaps is why the $1.9 trillion in asset locked up with WMPs had so far been exempt from regulatory supervision. \\nJust as notable, going forward the WMPs will be included in calculating broad-based credit, something we discussed last week when we showed just how vastly China is undercounting its broadest credit aggregate, Total Social Financing by ignoring shadow debt . Currently, the products aren’t included in the assessment framework, however it’s not clear when or if the People’s Bank of China will add them, Bloomberg added. \\n\\nCitigroup estimated that 13 trillion yuan ($1.9 trillion) of the products, which are a key building block in China’s shadow-banking system, could be covered. Other banks\\' estimates are even bigger. \\nNo matter the size, the extra scrutiny will certainly cool growth of the unregulated products, as China tries to rein in financial risks that could tank the economy. Adding the products to the central bank’s calculations could help to emphasize requirements for lenders to limit dangers and maintain sufficient capital. A change would mean regulators would be may be better able to “control the pace of broad-based credit supply,\" Judy Zhang, a Hong Kong-based analyst at Citigroup, said in a note. WMP issuance and yields may shrink as lenders pass on extra costs to investors, she said. \\nAs Bank of America explained overnight, in late 2015, PBoC officially introduced its MPA framework, which expanded its focus from loans to credit in a broader sense, covering not only loans but also banks’ bond investments, equity rights and other investments, financial assets bought with re-sale agreement, and deposits with non-deposit-taking financial institutions. The MPA can make it more difficult for banks to adjust on-balance sheet assets to circumvent government’s credit control. The latest move adds banks’ off-balance sheet WMPs, i.e. those without a principal guarantee, to the mix. This, in theory, should make it more difficult for banks to move assets off balance sheet . \\nChinese households, companies and banks held a record 26.3 trillion yuan of wealth-management products as of June 30 and the China Banking Regulatory Commission has been tightening rules on WMPs since late 2014. Most of the products are non-principal guaranteed, which means they reside off banks’ balance sheets. \\nThe implications for th economy can be significant: \\nThe cornerstone of PBoC’s MPA is capital adequacy, in-line with Basel III. So it’s possible that in the long term, banks may be required to provide capital for at least some of its off-balance sheet assets, including the WMPs. As of Jun, total balance of bank WMPs reached Rmb26.3tr. Without considering future growth, the additional amount under the MPA would be some Rmb15.5tr, after deducting Rmb6.1tr products with guarantees (already on banks’ balance sheet) and Rmb4.7tr of cash and deposits. This represents about 7% of banks’ on-balance sheet assets as of June (Rmb217tr). More important, we should view the latest development in the broad context of policy tightening over shadow banking activities since early this year (related reports linked in the sidebar). \\nHowever, the most immediate practical consideration from the increased regulatory supervision of the $1.9 trillion in related product is that these funds, many of which are of highly suspect origins, will seek to shift away from the heightened scrutiny and find alternative venues. Which may explain the latest jump in bitcoin as a modest portion of the funds locked up wealth-management products may have found itself into the digital currency, promptly sending it higher by nearly 5%. Should the crackdown on WMPs persist, it may be just the catalyst to push bitcoin above its recent multi-year highs just why of $800 hit earlier this summer.'"}, "time": 1742563308.0782843}