{"duration": 0.06491613388061523, "input_args": {"text": "'Europe or Russia: Could Moldova\\'s presidential election determine its future? Moldova goes to the polls for the first time in 25 years to elect a new president Moldova goes to the polls to elect a new president at a time of tensions between pro-Russian and pro-EU camps. \\n\\nA woman walks by electoral posters in Chisinau, Moldova. Moldovans will vote for a president on Oct. 30 i n an election, which could move the former Soviet republic closer to Europe or to Russia. Photo: AP \\nOn the last Sunday of October, presidential elections will be held in the Republic of Moldova. This small state in southeastern Europe does not rank among the major international players, ye t its significance should not be underestimated . \\nMoldova is located on the border between the post-Soviet space and the European Union , and over the past 25 years, its territory, wedged between Romania and Ukraine, has more than once been an arena of both competition and cooperation between the West and Russia. The emergence of the post-Soviet Moldavian state also produced the Transnistrian conflict , which had outsized influence in the development of Russian policies toward newly independent former Soviet republics and the relations between Russia and the European Union.\\nBetween the East and the West Moldova is a strategic partner of the EU. It was the first state the Commonwealth of Independent States (CIS) to receive visa-free travel to the EU for its citizens. Additionally, it has special political and historical-cultural ties with Romania.\\nAs experts Dmitri Furman and Cristina Batog wrote, “of all the titular nations of the former Soviet, and later, post-Soviet republics, the Moldovans possess the most uncertain, contradictory mentality,” and the question of whether they are part of the larger, divided Romanian nation or a separate Moldovan ethnicity has not been decided yet, either on the personal or political level. \\nAs a result, there is a serious competition within the country between two national-state projects, “Moldavianism” and “Unionism” (or “Romanianism”). This situation would be unimaginable in other countries with separatist regions, such as Georgia or Azerbaijan .\\nAlso read: \" Will Moldova become a new flashpoint for Russia and Europe? \" At the same time, Chișinău officially declares its neutrality and, unlike Tbilisi and Kiev, has not forced its relations with NATO . This approach is not least due to the presence of a considerable and stable part of the electorate that is interested in preserving ties with Russia, as well as to the problems concerning the Gagauzian Autonomy, whose population also favors Eurasian integration. \\nNevertheless, Moldova rejected the federalization project proposed by Moscow in 2003 as part of a resolution to the Transnistrian situation. At the time, the republic was led not by a coalition that favored closer ties with the EU, but by the Communist Party headed by Vladimir Voronin, which came to power advocating rapprochement with Russia and the Union State of Russia and Belarus.\\nPolitical turmoil The Oct. 30 presidential election is an important milestone in the country’s history. For the first time in 20 years, the president will be elected by popular vote. Since 2000, the head of state has been elected by the members of parliament, but in March of this year, Moldova’s Constitutional Court repealed the previous amendments to the Republic’s Constitution that gave this power to the parliament. \\nThe problems with the country’s electoral system had been known for some time. After Voronin left office in 2009, the country went for three years without a legitimate president. The parliament could not reach a consensus on the country’s next leader, who had to be elected by a three-fifths majority of legislators. Moldova was governed by the speaker of parliament who was given the status of “acting president.” Only in March 2012 did Nicolae Timofti gain the deputies’ support and was elected president.\\nCrises and mistrust of the main institutions of power have become a chronic disease in post-Soviet Moldova. In September 2015, a scandal broke out when multi-millions were withdrawn from the country’s three leading banks and transferred offshore. \\nMass protests ensued, and some observers were quickly to refer to the moment as a “Chișinău maidan” after the protests that brought down the government of Ukrainian President Viktor Yanukovich . The protests had the effect of uniting those who wanted closer integration with Romania and those who wanted closer integration with the EU while alienating those inclined to deepen ties with Russia. \\nThe decision on returning to direct election of the president was adopted, to a large extent, under the influence of that social-political turbulence. The election was considered an attempt to establish political legitimacy against the backdrop of growing mistrust of the other governmental institutions.\\nCandidates and positions The favorites in the election are Igor Dodon, leader of the Socialist Party, and former Minister of Education (2012–2015) Maia Sandu. Four days before the election, Marian Lupu, a democrat and former speaker of the parliament (2005–2009 and 2010–2013) withdrew his candidacy. All the leading candidates engaged in bashing their opponents and promoting their own domestic policy agendas, they also have vastly different foreign policy values. \\nDodon is pro-Russian and favors Eurasian integration, Sandu supports deeper cooperation with the EU. Lupu explained his withdrawal from the campaign because of the necessity to consolidate the supporters of the “European choice.” \\nAlso read: \" Revealing the post-Soviet identity complex in Transnistria \" Under close scrutiny though, such differentiation is mostly artificial. The same Dodon, who denounced the Moldova–European Union Association Agreement early in the discussions over it spoke more cautiously as the campaign went on, promoting instead a tri-lateral format of cooperation between Brussels, C hișinău and Moscow). \\nDodon, who is also supportive of a flexible approach to Transdnistria, was the Deputy Minister and then Minister for Economy and Trade when Moldova and Ukraine tried to carry out an “economic defreezing” of the region in March 2006. At that time, Ukraine decided to ban Transnistrian goods from traveling across its border unless they were documented by Moldova’s customs office.\\nIn Tiraspol, that step was regarded as the introduction of a joint Ukrainian–Moldavian economic blockade of Transnistria, since goods could not flow out any other way. This was, of course, an exaggeration, but it strengthened the already powerful pro-Russian sentiments on the left bank of the Dniester. Obviously, Moldova’s Ministry of Economy and Trade and its key officials, including Dodon, played a role in the decision.\\nShould the pro-European camp suffer a defeat in the election, neither the country’s foreign policy nor its position towards the settlement of the Transnistrian conflict is likely to shift substantially. Unlike Kiev, both the pro-Russian and pro-European camps in Chișinău are interested in preventing a large-scale confrontation with Moscow. \\nAs for the “Romanian factor,” Bucharest has considerably changed its rhetoric under the new president Klaus Iohannis. The political focus shifted from propagating the idea of the “great union,” as phrased by the former Romanian leader Traian Băsescu, to building economic ties not only with the Republic of Moldova but also with Transnistria. In this, Bucharest is influenced to some extent by the European Union, which against the background of the conflict in Donbass and the migration crisis, is not interested in the escalation of another standoff close to its borders.\\nThe opinion of the author may not necessarily reflect the position of Russia Direct or its staff. '"}, "time": 1742628548.8704722}