{"duration": 0.09821057319641113, "input_args": {"text": "'Nine months after instructing Alabama’s probate judges to defy federal court orders on   marriage, Roy S. Moore, the chief justice of the Alabama Supreme Court, was suspended on Friday for the remainder of his term for violating the state’s canon of judicial ethics. It was the second time in his contentious career that Judge Moore, an outspoken conservative, was removed as chief justice, and it followed his most recent star turn in the nation’s culture wars. The suspension was imposed by the state’s Court of the Judiciary, a   body of selected judges, lawyers and others, which found Judge Moore guilty on six charges. While the court did not take him off the bench entirely, as it did in 2003 after he defied orders to remove a giant Ten Commandments monument from the state judicial building, it effectively ended his state judicial career. His term ends in 2019, and Judge Moore, 69, will be barred by law from running for a judicial position again because of his age. The court said in its decision that most, but not all, of its members had supported fully removing Judge Moore from the bench, but removal requires a unanimous vote. The decision to suspend him, the court said, was unanimous. The court found that the “clear purpose” of Judge Moore’s January order to the state’s 68 probate judges to refuse to issue marriage licenses to   couples, which he called simply a “status update” on the legal situation, was “to order and direct the probate judges, most of whom had never been admitted to practice law in Alabama, to stop complying with binding federal law. ” In a statement, Judge Moore called the decision corrupt. “This was a politically motivated effort by radical homosexual and transgender groups to remove me as chief justice of the Supreme Court because of outspoken opposition to their immoral agenda,” he said. Mathew D. Staver, Judge Moore’s lawyer and the founder of Liberty Counsel, a legal group that has fought against   marriage, called the decision illegal and said he was appealing to the Alabama Supreme Court. Judge Moore filed a similar appeal after the Court of the Judiciary’s decision in 2003. The justices recused themselves in that case and selected at random a panel of retired judges to hear it. The judges upheld Judge Moore’s removal. Richard Cohen, the president of the   Southern Poverty Law Center, which filed complaints that led to Judge Moore’s trial, welcomed Friday’s decision, calling suspension without pay the same as removal for all practical purposes. “The bottom line is he can’t exercise any judicial authority or power,” Mr. Cohen said. No one expects Judge Moore, a major figure in the culture wars since before he entered statewide office, to depart quietly from the political scene. In the years after his first removal, he ran for governor twice, though he finished far behind in the Republican primaries. He considered running for president in 2012 but decided instead to run, again, for chief justice. His victory without a runoff in the 2012 Republican primary rattled the state’s political establishment, and many   Republicans openly supported the Democrat in the general election. Judge Moore won with a slim majority. The federal court decisions on   marriage, including the ruling in June 2015 by the United States Supreme Court that it is a constitutional right, outraged him. In a   concurrence to an Alabama Supreme Court decision on the matter earlier year, he condemned the gay rights movement as leading to a “wasteland of sexual anarchy” and wrote, in the context of the federal Supreme Court decision, of the “duty to disregard illegal orders. ” In Judge Moore’s view, the Supreme Court’s decision guaranteeing   couples the right to marry was not binding on Alabama. Despite a Federal District Court’s order to the state’s probate judges, Mr. Moore insisted that until a final ruling by the Alabama Supreme Court, the matter was still unresolved. In January he issued his order to the probate judges, informing them that they had a “ministerial duty” to refuse licenses to   couples until a   decision was handed down. It was this action that brought charges from the Judicial Inquiry Commission, a state oversight body, that he was violating Alabama’s canon of judicial ethics. “He was instructing state officers to disregard a binding injunction that was consistent with controlling Supreme Court precedent,” said Ronald J. Krotoszynski Jr. a professor at the University of Alabama School of Law. “It was a remarkable thing for him to do. ” While what Judge Moore will do next is a matter of speculation, most everyone agrees that his time in the public eye is not over. “The last time he was kicked off as chief justice, he ran for governor,” said Jack Campbell, a Republican consultant and a former spokesman for the state Supreme Court. “I don’t think he’s done. ”'"}, "time": 1742564029.1658974}