{"duration": 0.034867048263549805, "input_args": {"text": "'Home | World | Eight Years of Obama Rocked Hillary Clinton Campaign Eight Years of Obama Rocked Hillary Clinton Campaign By Cluck Clan 09/11/2016 07:35:08 \\n  can thank eight years of Obama rule, which has most certainly lost Hillary Clinton the U.S. election. \\n\\n\\nSocialists in America have had their day, all the Marxists and Communists within the Democrat party have torn the country apart. \\nEight long burdensome years of Obama, overspending on socialist pet projects, controlling, politically correct, gays, feminists, transexuals, inhibiting free speech, encouraging global chaos and people have had enough. \\nOne can only hope that Black Lives Matter is buried under deep concrete never to be seen again, all the SJWs are taken out into the streets and beaten with bats, and the politically correct morons are told to shut the fuck up once and for all. \\nThe silent Americans seething for eight long years fought back, and to vote for someone like Trump was a breath of fresh air even though in an act of defiance against the whole system of corruption. \\nAs one maverick to another, there can only be an element of respect given to Trump, who just did not give a fuck, and has in one night buried eight years of hell under Obama, possibly the worst president of the United States ever encountered. \\nIt has to be said that eight years of blackness has ended, and we can all breathe a breath of fresh air and light, albeit with major uncertainties. \\nUnder Trump there will be war with China, there will be economic hell, and there will be upheaval but anything is better than more Obama or socialists. \\nTrump has just grabbed the world by the pussy. Share on : Tua Pui Poh \\nYes. Finally, America can be GREAT AGAIN under TRUMP who would trump, triumph and fires those unfit to represent the silent majority people in America! I can be proud of America once again all the way from Belgium!'"}, "time": 1742564445.4629402}