{"duration": 0.060272932052612305, "input_args": {"text": "'CLEVELAND  —   It was just after 10:30 p. m. Tuesday, a coveted time slot at any political convention. But at the Quicken Loans Arena here, there were rows and rows of empty seats as Kimberlin Brown, a soap opera actress and California avocado farmer, struggled to talk over the chatter of delegates heading for the exits. The session was supposed to last until 11 p. m. the gavel fell at 10:58. Donald J. Trump came here promising a nominating convention bursting with glitz, energy, celebrity and the highest of show business production values. Instead, at least for the first two nights, Mr. Trump struggled to stage the biggest show of his political career: his own convention. The party gathering, after an unusually contentious primary season, has been marked by a noticeable absence of energy and swaths of empty seats. The audience, whose attention often seems elsewhere, responded to a historic moment  —   when Mr. Trump’s son Donald Jr. cast the votes that made his father the Republican presidential nominee  —   with modest applause. Chants of “  ” rose in one section of the floor, only to fade away. The crowd seemed to come alive only when the subject was not Mr. Trump but Hillary Clinton, the likely Democratic nominee. “Lock her up, lock her up, lock her up!” the crowd chanted lustily as Chris Christie, the New Jersey governor whom Mr. Trump defeated for the nomination, offered an indictment of Mrs. Clinton. “This is a joyless convention,” said Mike Murphy, a senior adviser to one of Mr. Trump’s rivals, Jeb Bush. “The mood among the delegates, I’ve found, is somewhere between grim resignation and the Donner Party. ” There were fewer empty seats in the arena on Wednesday night and the energy appeared to pick up, particularly as Ted Cruz, who came in second to Mr. Trump and enjoys significant support among conservative delegates, spoke. And even before Mr. Cruz had finished speaking, Mr. Trump entered the arena, igniting a roar. Convention planners  —   seeking to take advantage of one of the few times the candidate will have access to unfiltered television coverage  —   have made what many here say are questionable programming decisions as they seek to fill four valuable nights of exposure. On Tuesday, for example, Mr. Trump’s younger daughter, Tiffany, delivered a   speech, but was off the stage by 10 p. m.  —   the start of the coveted   hour. She gave way to Kerry Woolard, the general manager of Trump Winery. Donald Trump Jr. followed with a rousing speech for his father  —   but he soon yielded his spot to Ms. Brown, the actress who played the devious character Sheila Carter on “The Young and the Restless. ” She was killed off the show in the 1990s, according to Variety. “You don’t put an avocado farmer on in the middle of prime time,” said Russell Schriefer, who has been involved in planning Republican conventions for 20 years, about Ms. Brown. “That’s just common sense. ” “The most critical hour on prime time is 10 p. m. to 11 p. m.  —   especially at 10:30 when people change the channel,” said Tammy Haddad, a former MSNBC political director. “So you had Donald Trump Jr. hitting it out of the box with a good speech, but then it’s not just a soap star, but someone who was a soap star in the ’90s. ” Mr. Trump’s best opportunity will come Thursday, when he delivers his acceptance speech. And the pomp and emotional ceremony of that night could go a long way to erase any missteps of a convention that began with his wife, Melania Trump, delivering remarks that contained passages of a speech delivered in 2008 by Michelle Obama at her husband’s nominating convention. “  percent of the convention is Donald’s speech,” said Charlie Black, a longtime Republican strategist. “They have got to get that right. If they get that right, that’s the lasting impression that gives you momentum  —   or doesn’t. ” Still, the way the convention has unfolded to date has fed existing concerns among many Republicans about Mr. Trump’s political skills and the depth of his support in his own party. The flat mood so far is no small matter, considering that one of the top functions of a convention is to energize delegates and party leaders before sending them home to sell the candidate. The meandering convention to date and the problems involving Ms. Trump are the latest evidence of the     organization that has marked this campaign. In the best of times, conventions are celebrations, four days of speeches and receptions as a party gears up for a fall campaign. The atmosphere has suffered from the absence of political celebrities  —   former presidents, presidential candidates, prominent senators  —   whom delegates would usually be grabbing for selfies and autographs. But Mr. Trump’s difficult relations with his party means that many of the party’s   leaders  —   former President George W. Bush the 2012 nominee, Mitt Romney and the 2008 nominee, Senator John McCain of Arizona  —   are not here. Their absence has also limited the options of convention planners trying to fill four nights with speeches from   political figures who can pack the hall and keep television cameras trained on the podium. Inside the hall, delegates milled around and kept speaking even as prominent Republicans took the lectern  —   among them Paul D. Ryan, the speaker of the House. While they cheered two of the candidates Mr. Trump had beaten to win the nomination, Mr. Christie and Ben Carson, a neurosurgeon, they greeted Mitch McConnell, the Senate majority leader, with scattered boos. Ms. Haddad said she was particularly struck by empty seats. “People talk about the floor being a little ” she said. “Well, the hall itself is not filled out. The best seats directly across from the stage are wide open. It’s significant. When a hall is not filled, it’s hard to bring the energy up. ” The lack of enthusiasm could be seen on and off the convention floor. Some hotels reported that guests had checked out early. Bars that had hoped to be serving revelers until 4 a. m.  —   thanks to a new state law passed specifically for the convention  —   have been closing early. A Rick Springfield concert the other night drew a sparse crowd. Christian Berle, a delegate from the District of Columbia who supported Gov. John Kasich of Ohio, said he has found the convention so distasteful that he was prepared to pay the airline change fee so that he could leave early. “I mean, $400 to get out of this place seems like a cheap thing,” he said. Norm Coleman, a former senator from Minnesota, said he would head home Thursday morning. “I have a lot of family commitments,” Mr. Coleman said with a smile as he stood in a convention hall marked by patches of open space. A political convention cannot be judged only by action in the hall. Cleveland was teeming with lobbyists, many of whom chose to spend their evenings at restaurants and receptions with elected party officials rather than on the convention floor. Andrew Richner, a delegate from Michigan, said the lack of energy reflected the fact that Mr. Trump had won after overcoming a crowded field. “We’re still feeling the lingering effects of a   primary process,” said Mr. Richner, who had supported Mr. Kasich, who has stayed away from the convention. “It takes some time to get over that. ” Pete Hoekstra, a former congressman from Michigan, said the lack of enthusiasm could be traced to the fact that many of the people in the hall were Republican Party regulars who were never going to embrace Mr. Trump. “It clearly hasn’t been his crowd,” Mr. Hoekstra said.'"}, "time": 1742628449.7124414}