{"duration": 0.08070015907287598, "input_args": {"text": "'President-elect Donald Trump is like a one-man meteor shower of this age. He sprays white-knuckle antipathy upon all manner of people of varied religions, ethnicities, race, and any other target of choice. He avoids the “politically correct” avenue and simply does things his own way. Trump’s age of distractions has thrown the country into a frenzy leaving people careening and disoriented. The real issue is the lack of focus is not limited to the realm of politics; it has shifted into other areas that have affected many on a personal level. This is not really about the distraction of politics, it is more centered on the politics of distraction.\\nOne of the things that continues to rise over the past 15 years or so is the increase in diagnosis involving focus. Whether it is ADHD (Attention Deficit Hyperactivity Disorder) or OCD (Obsessive-Compulsive Disorder), the list of diagnosis that indicates a challenge in our ability to focus has America in the lead above any other country. The blame has shifted from the school system to the household, to the programmers of major television stations and now, Trump’s age of distractions. Famed novelist Arthur Golden said, “A mind troubled by doubts cannot focus on the course of victory.” With this in mind, it is evident that no matter who is to blame for the lack of focus, victims need to discover a remedy fast.\\nFocus, by definition, is the adjustment for distinct vision; a center of activity, attraction, and attention. It is the last part of the definition that really stands out, “the center of a person’s activity, attraction, and attention . ” Here is the real deal, people do not possess focus if it has not arrested those three areas of life. That is the difference between hobbies and passions. The latter captivates all you are and all you do. Many have failed simply because they have refused to bring their lives into a definite focus.\\nFocus allows us to harness our skills, intelligence, and resources and put them to work on our life goals. Most, at one time or another, have fallen into the trap of being a “Jack of All Trades.” The part that is often missed is that we become masters of none. We spread ourselves thin in an effort to appear busy, but life’s successes come from a laser beam approach toward tasks. This may be the reason America ranks nearly last amidst other countries with regards to productivity. We have more stuff than ever, but we seem to be doing less. The issue lies in our inability to focus.\\n\\nWhere do we begin? In a society that is screaming at us from sun up to sun down, how will we find the time to focus? Even on our jobs, we get assigned to one project only to be told the other five are really the priority. Everything was due two days ago. People consume fast food at alarming rates because it is supposed to be fast and no one has time to cook a balanced meal. This, however, leads to fears of illnesses like cancer and diabetes. People of all nationalities seem to be in a losing battle with the clock and now experts are telling saying the biggest problem is really the lack of focus. Listed below are solutions that can ease the pressure and help people to find focus in Trump’s age of distractions:\\nAdmit other things are important too: One of the first mistakes we make is trying to go “cold turkey” when it comes to our distractions. You have had them long enough for them to become a new normal. Therefore, cutting them out will not be easy. First, devise a plan to lower a number of distractions by setting guidelines. By checking emails less frequently and turning the ringer off on your phone, you increase your ability to focus instantly. Solicit the help of colleagues: People tend to interrupt you because that is what you have trained them to do. Setting boundaries around yourself sends an instant message to people indicating you are in work mode. Let them know your times of “on purpose” focus and that you are not to be disturbed. Usually, people will honor it. Utilize technology, sticky notes, and lists to your advantage: In your lap right now is the power to retake your focus. You probably have a smartphone, Tablet, Kindle or some other device capable of helping you organize your time. I find if we do not have a plan, we are planning to fail. Set reminders to study in your phone, read your morning paper on your iPad while commuting, or set a to-do list the night before. All these small tasks add up to big time savers in the future. In Trump’s age of distraction, it has become easy to blame the lack of focus on external events. In reality, the only thing we really do control is our behavior in any given situation. Take back your life and readjust your focal point. You will be amazed at how closely life imitates a camera. Until it is turned on and focused, no memories are ever clearly captured. Remember, this is really not about the distraction of politics, but the responsibility of managing the politics of distraction.\\nOpinion by Cherese Jackson (Virginia) \\nSource:\\nNew York Times: The Politics of Distraction\\nPhoto Credits:\\nTop Image Courtesy of Michael Vadon- Flickr License\\nInline Image Courtesy of Aaron Brinker – Flickr License\\nFeatured Image Courtesy of Nate Steiner – Flickr License\\n   Donald Trump , election , focus , self help'"}, "time": 1742561922.5685039}