{"duration": 0.06353545188903809, "input_args": {"text": "'NEW YORK (AP)  —   NBC is bringing back its “  TV” Thursday franchise this fall with the revival of “Will  Grace,” and by moving its heartwarming hit “This is Us” to the same night. [The network announced its schedule Sunday, kicking off the annual week where broadcasters outline next season’s plans to advertisers. NBC is the second most popular network behind CBS, first among the younger viewers it covets, and is bullish on next year since it will show the Winter Olympics and Super Bowl.  The comedy “Will  Grace,” which originally aired from 1998 to 2006, unites its original ensemble of Debra Messing, Eric McCormack, Sean Hayes and Megan Mullally with the original creative team. If the resumption goes well, NBC hopes there will be more than the 12 episodes now on order, said Robert Greenblatt, NBC entertainment chairman. “Will  Grace” will kick off Thursday’s lineup, followed by “Great News,” a sophomore comedy produced by Tina Fey. Greenblatt said Fey will appear periodically on air next season, too. The key to reestablishing Thursday nights, which NBC dominated during the 1980s and 1990s, is bringing the fans who made “This is Us” the year’s biggest new hit, to that night at 9 p. m. The show also gets the   slot after next winter’s Super Bowl. Greenblatt sounded conflicted about how much NBC will push the “  TV” concept promotionally. “I’m not saying it’s going to be emblazoned with   letters atop the Empire State Building, but we’re going to use it,” he said. NBC will introduce eight new series next season but sprinkle them throughout the year. Only the “Will  Grace” reboot, a Dick   limited series on the Menendez murders and “The Brave,” an action series starring Anne Heche as an undercover military hero, will begin in the fall. Doing it that way illustrates the elastic nature of broadcast television, when shows drop on and off the schedule throughout the year, and the goal is to reduce repeats. As a result, Greenblatt wouldn’t say when the other five new series will appear. Some established shows, like “Chicago Med” and “Little Big Shots” were renewed but don’t have announced spots on the schedule yet. The     nature of TV will be a barrier for NBC: the Thursday schedule it hopes becomes dominant will be   for pro football in the fall and the Winter Olympics. NBC said it was offered “American Idol,” which rival ABC announced it was bringing back next season. NBC said the strength of “The Voice,” which will add former “Idol” stars Kelly Clarkson and Jennifer Hudson as coaches next year, and its other development led it to say no, thanks. “The audience didn’t tell us there was a compelling reason to bring it back, either,” said Paul Telegdy, president of NBC’s alternative and reality series. NEW SERIES, Other new series ordered by NBC:  —  “Good Girls,” a drama about three suburban moms who rob the local supermarket. It’s described as a mix between “Thelma  Louise” and “Breaking Bad”  —  “Reverie,” a thriller about a former hostage negotiator brought on to save people lost in a virtual reality program,  —  “Rise,” a drama starring Josh Radnor as a teacher who revives a lackluster high school theater department,  —  “A. P. Bio,” a comedy produced by Lorne Michaels and Seth Meyers about a philosophy scholar who goes to work teaching biology in high school,  —  “Champions,” a Mindy   series about a gym owner and his brother who must cope with a new   in the household. ___, NEVER CAN SAY GOODBYE, After first announcing the cancellation of the time travel series “Timeless,” NBC bowed to fan complaints and said it would bring the freshman series back. NBC also didn’t include some other series in its order for next season  —   “Chicago Justice,” ″Trial  Error” and “The Carmichael Show”  —   but Greenblatt said that doesn’t necessarily mean they’re dead. ___, “NEW GIRL” There’s good news and bad news for fans of the Zooey Deschanel’s Fox series “New Girl. ” Fox, which will present its schedule Monday, announced a day in advance that the series will be back for a seventh season  —   but that will be its last.'"}, "time": 1742564160.8471775}