{"duration": 0.10088872909545898, "input_args": {"text": "'WASHINGTON  —   Congressional Republicans, racked by divisions over health care, taxes and spending, are increasingly desperate for leadership from the White House to unite the party and point the way toward consensus. But presidential leadership does not appear to be forthcoming, leaving the party largely paralyzed at a moment it had thought would be full of legislative activity. “The White House is huge,” said Senator John Thune, Republican of South Dakota. “The president is the only person who can sign a bill into law, so he’s the guy that ultimately holds the whip hand when it comes to this getting done. ” As congressional leaders struggle to clear the first major legislative hurdle of the Trump era  —   a bill to repeal and replace the Affordable Care Act  —   their talks with the White House, though not infrequent, have failed to advance any coherent, cohesive policy prescription. Repealing the health care law is the Republicans’ first step toward enacting their broader agenda. So far, President Trump, seeking to project an image of a man of action, has preferred   executive actions over   engagement with Congress. In the absence of presidential leadership, the most fiscally conservative House Republicans have stepped forward to demand that the health care law be whittled to near nothingness. More moderate senators are insisting on a replacement plan with many of the current law’s popular components. Both sides are pressing hard to sway lawmakers working on draft legislation that would roll back the Affordable Care Act’s expansion of Medicaid, replace the subsidies offered in the insurance marketplaces with tax credits to buy coverage, and eliminate tax penalties for people who do not have health insurance. After weeks of loud protests across the country from voters who are fearful of losing their health care, Republican governors complicated matters further this week by joining Democrats in a call for a replacement plan that would ensure coverage for the 20 million Americans who gained insurance under the Affordable Care Act. “I’d like to hear a renewed commitment to repealing the law,” said Senator Mike Lee, Republican of Utah  —   another sign of just how far the party is from unity. Democrats, who have been dismissed as obstructionists by Republicans determined to repeal and replace the law without them, are sitting by quietly waiting for those efforts to fail. At that point, Democrats believe, Republicans will have to reach across the aisle and repair the law. “We’ve maintained all along there is room to negotiate,” said Senator Brian Schatz, Democrat of Hawaii. “But only if they abandon their attempt to repeal the law. ” While he has seen no moves toward cooperation yet, “they are in a world of hurt,” Mr. Schatz said of Republicans, “because none of their plans add up, and their members are starting to figure this out and the public is starting to figure this out, and they don’t have Obama as a foil anymore. I think they need to fail first. ” Senator Claire McCaskill, Democrat of Missouri, who has long offered to help fix the law, said she had heard from only one Republican colleague, Senator Bob Corker of Tennessee, since the end of last year. “I don’t think Republicans have decided what they’re waiting for,” she said. “The White House or Godot. ” Many Republicans seem to be resigned to seeking consensus on health care legislation, as well as on a budget and tax reform, without comprehensive White House guidance. Representative Michael McCaul, Republican of Texas and the chairman of the House Homeland Security Committee, said he was relying less on a signal from Mr. Trump than on    discussions between lawmakers and the administration to “get the details filled in. ” Those details include how Mr. Trump plans to fund his call for a 10 percent increase in military spending, Mr. McCaul said. “From a budget standpoint, these numbers are difficult to crunch,” he said. “We as Republicans want a stronger national defense. That money’s got to come from someplace. That’s where the hard decisions have to be made. ” Mr. Trump’s aversion to making big changes to two of the costliest government programs, Medicare and Social Security  —   something Republicans generally crave  —   is not helping matters. “That makes it even more difficult,” Mr. McCaul said. The president’s budget outline, unveiled this week, has something for almost every Republican to hate, from the lack of   entitlement reform to large proposed cuts at the State Department. “Speaking for myself,” said Senator Mitch McConnell of Kentucky, the Republican leader, “I think the diplomatic portion of the federal budget is very important, and you get results a lot cheaper, frequently, than you do on the defense side. So, speaking for myself, I’m not in favor” of huge reductions at the State Department. Senator Lindsey Graham, Republican of South Carolina, called those cuts “dead in the water” for him. Many of Mr. Trump’s direct contributions to the legislative process have happened through the news media, as he has signaled his priorities in interviews that have sometimes left congressional Republicans scrambling to decipher his intentions. Representative Eric Swalwell, Democrat of California, said some of his Republican colleagues were frustrated by their inability to move forward. “They’re reading about what he wants to do at the same time I am in the paper,” he said. Six weeks after Mr. Trump said Republicans would provide a replacement plan for the Affordable Care Act that offered “insurance for everybody,” Speaker Paul D. Ryan of Wisconsin is fighting to reconcile his party’s competing priorities while also contending with the occasional messaging complication from the White House. “This is a plan that we are all working on together: the House, the Senate, the White House,” Mr. Ryan said Tuesday. “We’re all working on this together with the administration. ”'"}, "time": 1742562143.2269068}