{"duration": 0.13150548934936523, "input_args": {"text": "'[Graphic of Trump courtesy of Boing Boing ] Rowan Wolf, PhD Voice of Conscience A s the minutes tick down before election day 2016, I feel that I must throw in my final thoughts and feelings.\\nThis is an historic election in so many ways. Let me point out a few: The first time that a woman was the Presidential candidate of the duopoly. The first time in the modern era when a direct member of the .01% without any knowledge or background in politics was the Presidential candidate of the duopoly. The first time that BOTH candidates were hated and mistrusted by the majority of the voting public – regardless of party. \\nNow that the ‘firsts’ are out of the way, let me deal with my real concerns about this election. \\nWe live in a time when the world is literally a political tinder box, and the United States seems bent on adding fuel and throwing Molotov cocktails all over the place. \\nWe live in a time when the Earth teeters on the brink of runaway climate and ecological catastrophe. We are literally at a point where most climate scientists are saying that we are near or PAST the point of no return with climate – the point where we could avoid devastating, civilization destroying, extinction level event (ELE) catastrophe. Every single eco-system, and every ecological region on the planet is degraded and many are collapsing. \\nThis issue of the environment is deeply pertinent to the U.S. presidential election because one of the duopoly candidates rabidly does NOT “believe” in global warming. In fact, this candidate wants to disband the entire Environmental Protection Agency and reverse all environmental protections – from pollution to endangered species. (Frankly, this candidate wants to get rid of ALL regulations and treaties and apparently, most laws – they get in the way of business). Can you guess which candidate this is? \\nVideo courtesy of the NY Times . \\nI have watched as much of the left has joined the far right Tea Partiers and “alt-right” white power movement in promoting Donald Trump as the better of the two candidates for President. The ‘Left’s” argument at base is that “The Establishment” is against Trump so he must be better than Hillary Clinton (who obviously represents The Establishment). The fact is that the Left is standing with those who are ideologically (supposedly) 180 o from the Left I thought I knew. \\nThe Left I thought I knew was anti-capitalist, anti-imperialist, pro-social justice, pro-collectivity, and environmentally conscious. Yet most seem to have decided that standing with those who are white-centric, xenophobic, misogynistic, imperialistic, pro-corporate, anti-science, anti-intellectual, and anti-environmentalism, is the ‘common ground’ against The Establishment. I am sorry, but the logic eludes me. \\nThese same Left Trumpers argue that he is less militaristic and hawkish than Clinton, even thought Trump has said that he wants to dramatically increase the military (the only part of the government he seems to have a use for since they would be tied to his command). He wants to upgrade and USE the nuclear arsenal. His solution to ISIS (and other pesky folk in the Middle East) is to nuke them. He wants to re-take Iraq and get their oil. In fact, he thinks that we should just take over the resources wherever we want. He also wants to make Iran straighten up “fast” (everything is going to happen “fast”) or presumably he will nuke them too. Then there is clearly a lot of money to be made in nukes and he wants to sell them to everyone. I have not found one thing that is less hawkish about Trump other than he seems to like Putin. Of course that could change on a dime if he gets pissed off at Putin. \\nTrump is different than the ordinary candidate, and what he has done is step to the front of a movement. It is a movement that is now clearly fascist. Even many on the Left recognize that Trump is a fascist (there have been various comparisons to Mussolini), but there has been virtually no discussion of the movement that has not only been empowered by Trump, but is now legitimated as a political organization, part of the power structure and sitting at the table – via Trump. And the racist Right (aka “alt-right”) is well aware of it. Trump says that there will be riots if he is not elected. The implied threat is of heavily armed militias in the streets and not peaceful protestors expressing their disgust and distrust. \\nI have to wonder at how the Left has changed. We have arrived at a point where the Left (reluctantly of course) stands behind a fascist (and a fascist movement) for President of the most powerful nation on the planet. Please keep that in mind. No matter the degraded economic position of the United States, we have the largest arsenal and largest military on the planet by several magnitudes. Who is elected here matters more than ANY other country on the planet. \\nSo I am sad, and bereft. My country is sliding into chaos. My planet is rushing towards disaster. And the people I thought stood with me have lined up behind a narcissistic, vengeful, fascist for President. \\nOh we missed the opportunity of a lifetime. The Left could have gotten behind Sanders. No he was not perfect, but he was damn well a significant move LEFT. The Left could have looked at what was happening (given the popularity of Sanders and Trump, the two perceived anti-establishment candidates) and put forward a real viable candidate – Jill Stein. With the massive dislike of both Clinton and Trump, we might have actually pulled off a real coup and gotten the Greens into the White House. That ship has sailed. \\nI do not support Clinton. I do not think she is a good candidate. I do think she is sane – though self-serving. I do know just how much of a hawk she is, and that she is more than happy to continue the agenda that both neo-cons and neo-libs have been pushing since 2000 (if not earlier). \\nRegardless of who “wins” this farce of an election, Trump and his version of Brown Shirts are going to be with us for a long time. I am left to wonder how the Left that risked their lives fighting Mussolini and Franco are now standing behind Trump. \\nI have no illusions about the malignancy of Clinton, but I also have no illusions about the malignancy of Trump. The fact that Clinton is the Democratic candidate speaks to the fact that she puts her “right” to be the first woman candidate, and the first woman U.S. president, above the fate of the country speaks volumes. It was clear that if Sanders was the candidate, Trump would not even be on the radar, much less in a dead heat for the presidency. It is now known that the DNC (with the help of MSM) sunk Sanders. Of course, much of the Left had nothing but trash talk for Sanders. It is also now known that Sanders put his political position as a senator above the needs of the country and got in line behind Clinton rather than refusing to support her and jumping over to the Green Party ticket (which speaks clearly as to where the hearts of Stein and Baraka are). \\nIn talking and corresponding with folks on the Left, I have heard that many are not even planning to vote. This includes the authors of a number of the anti-Clinton, pro-Trump pieces. This is stunning to me and a double blow as what they are doing is purely trying to influence the votes of others. In other words, propaganda. That some of my comrades would turn their pens and efforts to propaganda to influence the votes of others, and not devote that energy to promoting real candidates for real change leaves me tremendously disillusioned about the Left and what the goal actually is. I had thought that we were aiming for a world of justice and equality, of humane treatment of all – including the planet itself, of true education and intellectual development, of support for creativity and the importance of it in a healthy society. Now I find that the apparent goal is to bring down society at any cost, and surely that cost will be high for little good arises from chaos. Rather, the most self oriented and violent responses are maximized when people feel they are fighting for survival. This is not what I have spent a life time fighting for and it is not what I will fight for now. \\nMy voting advice is as follows: \\nFind out how the vote is running in your state. If Clinton is leading by a significant margin, vote for Stein and Baraka. If there is not that margin, then vote for Clinton. We have an electoral College- not a majority vote. That puts the electoral college members in each state as the voter for each state. \\nAnother option is vote swapping through a system like #NeverTrump . And yes, it is legal to do this. \\nVote for the down ballot. Vote for the most progressive candidate that has any chance of winning. Why? Because if Trump wins we will need them to help stop the slide into fascism. If Hillary Clinton wins, we need them to keep her from the the continued plans of regime change. \\nOne thing I know for sure – we have a long struggle before us to get back to the point where we can embrace the diversity and richness of our culture, and to fully address the structured inequality that is robbing us of lives and potential every day. We were obviously NOT there before this election process, and we will be a damn sight further away from it afterwards. When hate becomes socially acceptable, we are all damaged, and lessened, and all life is cheapened. \\nIs this the person you want for President of the United State? Would you trust him with your life? \\nMeet Donald Trump ad from Rowan Wolf on Vimeo . This video is an ad from the Clinton campaign. However, it is Trump making his own statements. Rowan Wolf, PhD Is Managing Editor of The Greanville Post and Director of The Russian Desk. She is a sociologist, writer and activist with life long engagement in social justice, peace, environmental, and animal rights movements. Her research and writing includes issues of imperialism, oppression, global capitalism, peak resources, global warming, and environmental degradation. Rowan taught sociology for twenty-two years, was a member of the City of Portland’s Peak Oil Task Force, and maintains her own site Uncommon Thought Journal . She may be reached by email at rowanwolf@greanvillepost.com =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week. [email-subscribers namefield=”YES” desc=”” group=”Public”]'"}, "time": 1742628294.6017413}