{"duration": 0.04194474220275879, "input_args": {"text": "'The words “Madonna” and “concert” hardly conjure images of an intimate gathering, but on the eve of Election Day in the heart of Greenwich Village, that is what a few hundred people got. On Monday evening, the singer announced online a surprise concert in Washington Square Park in Manhattan with just enough time for fans to drop their forks, reroute their taxis and arrive to see her sashay onstage in a bomber jacket with fluorescent green sleeves and a winter hat sprinkled with stars. Madonna stood in the middle of the round fountain at the center of the square, holding a red guitar and pledging her support for the Democratic presidential nominee. She welcomed everyone to “a surprise, impromptu rally for Hillary Rodham Clinton. ” And the crowd, which had been huddled around the edges of the fountain, leapt to its feet. She then broke into her song “Express Yourself,” modifying the lyrics to say, “Make her express herself. ” The Material Girl’s message was decidedly feminist and   J. Trump, the Republican nominee. “Women are marginalized, let’s face it,” Madonna said between songs. “As far as I’m concerned, we still live in an extremely chauvinist, sexist, misogynist country. And that’s why Hillary Clinton needs to be president. ” The show was just five songs long: Madonna’s own “Express Yourself,” “Like a Prayer” and “Don’t Tell Me” as well as “Imagine” and a   of “If I Had a Hammer” and her “Rebel Heart. ” It was mainly a singalong, in the folk music tradition of the Village. People held signs, shouted “I’m with her” and appeared to know all of the words. Those in attendance included unsuspecting tourists in the right place at the right time,   New Yorkers who had gotten texts while leaving work and volunteers for Mrs. Clinton, many of them young women, who had spent the day calling and texting voters in battleground states. There were also some super fans. “I literally stalked this for 48 hours,” said David Yontef, 46, who lives in Chelsea and works in advertising. For more than a day, he said, there had been false leads on the location of the secret concert. “I was going to hop on a train to Philly then it seemed like it might be in Michigan  —   I was refreshing the browser every 10 minutes,” he said. “Then suddenly at 7 p. m. they said 7:30 here. We left dinner on the table, threw money on the table and jumped in a cab. This is history. This is Madonna, and she’s trying to get the first woman in the White House. ” Was he satisfied with the show? “Oh my God,” he said, “it was everything. ”'"}, "time": 1742561707.3081324}