{"duration": 0.05706429481506348, "input_args": {"text": "\"November 17, 2016 102 Google's chief executive Sundar Pichai has responded to concerns about fake news stories, heightened since the US election. Share on Facebook \\nHere we go with the liberal left’s latest boogeyman “fake news” . \\nLet’s find anything, absolutely anything to blame on Hillary’s election loss…blame it on Putin, on not getting their way, on Brexit, on Farage, on not having enough safe spaces, on all the apparent injustices of the world. Now let’s blame it on the “fake news”. \\nWTF is “fake news” even mean. The politically correct, crying liberal masses are reaching a point of stupid, that is beyond compare in the history of mankind. \\n“Fake news” is right on up there with WMDs, barrel bombs, mansplaining, color revolutions, humanitarian wars, moderate rebels, gender fluidity, the patriarchy…all made up, destructive apparitions engineered to avoid confronting the man in the mirror. \\nHere we go with the lying establishment media, and the “socially responsible” social media tech giants jumping on board censorship in disguise, telling the world what they should or should not read. Book burning for a digital age. \\nGoogle’s chief executive Sundar Pichai will “do no evil” , saying it is important for Google and other social media businesses to promote “accurate” stories to their billions of users …and Pichai is just the man to judge what is “real news” and what is “fake news”, because we the deplorables have neither the brains, nor the judgement, to discern between right and wrong, real and fake. \\nThank God for the liberal left, and their neo-liberal value system, to help us plebiscites make sense of such a mixed up world. \\nWe got conned into supporting Trump because the “fake news” seemed so real and was so enticing that we completely fell for it, and in the process prevented the the peace loving, saintly Hillary Clinton from keeping America great. \\nTalking to the BBC’s Economics editor Kamal Ahmed in the wake of fake news controversies during the US election campaign, Mr Pichai said the firm had made some mistakes. \\n“There have been a couple of incidences where… we didn’t get it right.” \\n“It is a learning moment for us and we will definitely work to fix it.” \""}, "time": 1742564365.2904267}