{"duration": 0.18236517906188965, "input_args": {"text": "'by Dr. Mercola \\nThe U.S. food system is set up to protect industrialized, centralized food production and distribution, while efforts to decentralize food are kept strictly under wraps. \\nThere are many problems with this system, including the fact that food production is often out of sync with demand, leading to excessive amounts of waste. In 2016, for instance, the industrial dairy industry has dumped 43 million gallons of milk due to a massive milk glut. \\nThe glut is the result of a 2014 spike in milk prices, which encouraged many dairy farmers to add more milk cows to their farms. U.S. Department of Agriculture (USDA) data shows that dairy cows have increased by 40,000 in 2016, with a 1.4 percent increase in production per cow. \\nWith too much milk and nowhere to sell it, prices have tanked. Milk prices declined 22 percent in recent months to $16.39 per 100 pounds — a price so low some farmers can no longer afford to even transport it to the market. [1] \\nThe milk glut isn’t only affecting the U.S., either. It’s been felt globally, which means milk producers can’t export their surplus milk. What’s a dairy farmer to do with a surplus of milk? Dump it — on fields, into animal feed or added to manure lagoons. USDA Steps in to Bail Out Dairy CAFOs \\nAt its foundation, the milk glut is the result of dairy operations in the U.S. consolidating into concentrated feeding operations (CAFOs) — massive industrial “farms” with the sole goal of producing as much food as possible for the greatest profit. As reported by Yale Environment 360: [2] \\nWhile milk carton imagery pictures bucolic, small farms, more than 50 percent of U.S. milk is now produced by just 3 percent of the country’s dairies — those with more than 1,000 cows, according to the U.S. Department of Agriculture (USDA).The very largest U.S. dairies now have 15,000 or more cows. \\nThe USDA, meanwhile, is coming to bail out these massive industrial enterprises. They’ve offered to buy $20 million of cheddar cheese from private sources, while milk producers try to get fast food outlets to add more cheese-heavy products to their menus. [3] The USDA already purchased $20 million of cheddar cheese in August 2016. 1 in 4 US Dairy Cows Contracts Mastitis \\nDairy cows raised in confinement and fed unnatural diets of genetically engineered (GE) grain are at high risk of illness, as are all animals raised in CAFOs. It’s estimated that one-fifth of livestock are lost due to diseases, which is an unrecognized source of food waste. [4] \\nIn the U.S. alone, 1 in 4 dairy cows contracts mastitis, which is a painful and serious udder disease. The result of producing large quantities of low-quality milk, mastitis is also the leading cause of therapeutic antibiotics treatment in U.S. dairy animals. \\nIn an era where antibiotic-resistant disease is taking millions of lives, any preventable causes of antibiotics usage should be curbed. Mastitis is also preventable with clean, humane living conditions and proper diet, which lead to healthy cows. \\nMastitis is also another source of food waste. Milk with antibiotic residues cannot be sold, so milk from cows being treated with antibiotics for mastitis must be poured down the drain — to the tune of 1.2 billion servings a year (not to mention the addition of more antibiotics into the environment). [5] \\nAs noted by one study on antibiotics usage on a dairy CAFO in New York state, “One of the best options to decrease antibiotic usage is to prevent the infection in the first place …” [6] Indeed, which again brings us back to the way cows are raised. CAFOs are literal breeding grounds for infection. \\nFurther, according to the 2016 Global Agricultural Productivity (GAP) Report prepared by the Global Harvest Initiative, once a cow contracts mastitis, she will probably not produce as much milk as before: [7] \\nIn addition, the cow’s level of milk production through her entire life cycle will likely fall below her potential as she is more susceptible to contracting mastitis on a recurring basis. \\nThe need for alternatives to protect the health of animals and preserve the long-term effectiveness of shared-class antibiotics has never been greater. As Dairy CAFOs Grow in Size, so Too Does Related Pollution \\nIn Wisconsin, the heart of dairy country in the Midwest, farm consolidation is growing at an alarming rate. \\nWhile the number of overall dairy farms in the state dropped by about one-third in the last decade, the number of such farms with more than 500 cows grew by 150 percent — and those with 2,000 or more cows grew at the fastest rate of all. [8] \\nIn addition to concerns like mastitis and milk gluts, such operations produce mind-boggling amounts of waste that represent one of the top sources of pollution in the U.S. Yale Environment 360 reported: [9] \\nAccording to the EPA, a 2,000-cow dairy generates more than 240,000 pounds of manure daily or nearly 90 million pounds a year. The USDA estimates that the manure from 200 milking cows produces as much nitrogen as sewage from a community of 5,000 to 10,000 people. \\n… Milking cows … produce more manure than beef cattle and the Holsteins that dominate the U.S. dairy industry produce almost twice as much manure as Jerseys. \\nCows that give more milk per cow also produce more manure and per-cow milk production has almost doubled since the 1970s. \\nManure spills and leaching of waste from storage “lagoons” contaminate waterways and drinking water, posing serious environmental risks in Wisconsin and elsewhere in the U.S. Grass-Fed Dairy: Better for the Environment, the Animals and Human Health \\nDemand for grass-fed dairy products is growing at an impressive rate, which is excellent news for the environment, animal welfare and human health. Grass is a cow’s natural food. \\nWhen cows eat grains, as they do on CAFOs that produce the milk used for most U.S. dairy products, their body composition changes. Most importantly for you, these changes include an alteration in the balance of essential fats. \\nMilk (and meat) from cows raised primarily on pasture has been repeatedly shown to be higher in many nutrients, including vitamin E, beta-carotene and the healthy fats omega-3 and conjugated linoleic acid (CLA). According to a study published in the journal PLOS One: [10] \\nMilk from cows consuming significant amounts of grass and legume-based forages contains higher concentrations of ω-3 FAs [omega-3 fats] and CLA than milk from cows lacking routine access to pasture and fed substantial quantities of grains, especially corn. \\nIn turn, lactating women consuming such milk have an increased CLA concentration in their breast milk … \\nThis study confirms earlier findings that milk from cows consuming significant amounts of grass and legume-based forages contains less LA [omega-6 linoleic acid] and other ω-6 Fas [omega-6 fats] and higher concentrations of ALA, CLA and the long-chain ω-3s EPA and DPA, compared to cows lacking routine access to pasture and fed substantial quantities of grains. Grass-Fed Dairy is a Solution to the Problems Created by Industrial Dairy \\nUnfortunately, only about 22 percent of U.S. dairy cows have access to pasture and even then access tends to be very limited. [11] Grass-fed dairy producer Maple Hills Creamery further shared reasons why grass-fed dairy is better: [12] When a cow eats corn and grain, the pH of the rumen (the first chamber of the cow’s stomach) becomes acidic; this destroys some flora and increases systemic inflammation, shortening the cow’s lifespan and increasing her risk of infection Raising grass-fed cows requires fewer resources than growing grain crops to feed CAFO cows, along with fewer chemical fertilizers and pesticides On a 100 percent grass-fed farm, manure is spread over pastures naturally as the cows roam; there is no need for environmentally destructive manure lagoons Grass-fed dairy farming works best with small herds, which in turn helps support local economies and small farmers, who are able to claim a premium price for their premium dairy products \\n“In short,” Maple Hills Creamery writes, “100 [percent] grass-fed organically produced dairy is a viable solution to the industrial dairy system, focusing on holistic care of both the animals and land, rather than an end goal of highest production and maximizing the bottom line at the cost of animal welfare and environmental concerns.” Support Raw, Grass-Fed Milk Products \\nRaw milk dairy products from organically raised pasture-fed cows rank among some of the healthiest foods you can consume. They’re far superior in terms of health benefits compared to CAFO-produced, pasteurized milk products, and if statistics are any indication, safer, too. \\nWhile many believe that milk must be pasteurized before it can be safely consumed, it’s worth remembering that raw milk was consumed for thousands of years before the invention of pasteurization. It’s also important to realize that pasteurization is only really required for certain kinds of milk, specifically that from cows raised in crowded and unsanitary conditions, which is what you find in CAFOs. \\nYour dairy products should ideally be pasture-raised, NOT pasteurized. Organically raised cows that are allowed to roam free on pasture where they can graze for their natural food source produce very different milk. \\nTheir living conditions promote and maintain their health and optimize their milk in terms of the nutrients and beneficial bacteria it contains. Getting your raw grass-fed milk and other food from a local organic farm or co-op is one of the best ways to ensure you’re getting high-quality food. \\nRead the full article at Mercola.com. References'"}, "time": 1742563123.0505464}