{"duration": 0.11601877212524414, "input_args": {"text": "'White House press secretary Sean Spicer has said that contrary to media reports, Donald Trump did not reject a handshake from German Chancellor Angela Merkel, adding that he simply did not hear her request. [Having given Shinzo Abe a 45 minute handshake, Donald Trump refuses to shake hands with Angela Merkel pic. twitter.   —   Nick Hilton (@nickfthilton) March 17, 2017,   Following a meeting with the media in the Oval Office, mainstream media reports suggested that Trump had refused Merkel’s offering of a handshake, although Spicer has confirmed this was just a misunderstanding. “I do not believe he heard the question,” Spicer told the German newspaper, Der Spiegel after video footage showed Merkel leaning towards Trump and asking him whether they would like to shake hands. On meeting other leaders in the Oval Office, including UK Prime Minister Theresa May, Canadian Prime Minister Justin Trudeau, and Japanese Prime Minister Shinzo Abe, Trump posed for photos with the trademark presidential handshake. However, Trump told the media that despite reports from the “fake news” media, the pair had a “great meeting,” adding that “Germany owes vast sums of money to NATO and the United States must be paid more for the powerful, and very expensive, defense it provides. ” Despite what you have heard from the FAKE NEWS, I had a GREAT meeting with German Chancellor Angela Merkel. Nevertheless, Germany owes  …    ..  —   Donald J. Trump (@realDonaldTrump) March 18, 2017,    …    vast sums of money to NATO  the United States must be paid more for the powerful, and very expensive, defense it provides to Germany!  —   Donald J. Trump (@realDonaldTrump) March 18, 2017,  Trump has previously described Merkel’s policy of letting millions of unvetted migrants into Europe as a “catastrophic mistake,” while Merkel has attacked Trump’s proposed travel ban, arguing it is “unjustified. ” When asked in January whether he would support Merkel’s run for reelection later this year, Trump refused to comment, although he described her as “great, great leader” for whom he had “great respect. ” You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com.'"}, "time": 1742563554.2927883}