{"duration": 0.08662867546081543, "input_args": {"text": "'Re: WINDOWS 10 « Reply #91 on: November 17, 2015, 01:37:05 PM » nVidia even admitted that they intentionally cripple Linux drivers to put performance under Linux the same as performance under Windows.Clips its own product\\'s wings to please MicrosoftBy Chris MerrimanMon Oct 07 2013, 15:28 CHIP DESIGNER Nvidia has revealed that it crippled its Linux driver to ensure parity with Windows.According to a forum poster at the Nvidia Developer Zone , the v310 version of the drivers for Basemosaic has reduced the number of monitors a user can connect simultaneously to three.The firm\\'s reply to the post was the type of dismissive response that the Linux community has come to expect in its dealings with Nvidia.Nvidia said, \"For feature parity between Windows and Linux we set Basemosaic to [three] screens.\"So let\\'s be clear about this. Nvidia has chosen to remove functionality from a Linux driver to ensure that it isn\\'t more capable than the Windows version. This really doesn\\'t sound like the action of a company that wants to get along well with Linux developers and users. So far, Nvidia hasn\\'t indicated whether this is a temporary situation, or more likely a permanent arrangement.There can be one of two obvious motives for this, which amount to two sides of the same coin. Either Nvidia doesn\\'t want to be seen to show up an embarrassing limitation in Windows or the Windows driver, or the continuing acrimony between the graphics firm and Linux is not over yet.While for most users three monitors are ample, making this a fairly niche problem, it\\'s an example of a company manipulating the marketplace. Of course controlling the flow of progress in order to sell another product is nothing new - video games makers have been doing that since the 1980s.But to control the flow of progress to favour one platform over another is playing \"technology god\" and sets a disturbing precedent. Logged'"}, "time": 1742563002.183702}