{"duration": 0.11676812171936035, "input_args": {"text": "'RICHMOND, England  —   Charles Porter and his staff of eight work from his office in a converted riding school on the grounds of Aske Hall, an old manor house set in the gentle, rolling hills of North Yorkshire. His Australian Labradoodles, Bertie and Cybil, spend their days lounging on a leather sofa by a roaring fire. It is an unassuming setting for an unassuming company. Porter does not advertise or seek to publicize his work he had never previously granted an interview. His website is modern and sleek but studiously enigmatic. “There are no pictures of people we work with,” he said. “We live and die by our discretion. ” To hundreds of players in English soccer over the last 20 years, though, Porter is an integral part of life. “He has helped me out with all sorts of things,” said Kevin Kilbane, formerly of Everton and Ireland’s national team. Danny Mills, a longtime client and former England international, described Porter as a “consummate networker, a great person to have around to take the stress away. ” To Porter’s clients  —   actors and musicians as well as athletes  —   he is almost indispensable. He will not say it, but he is the ultimate purveyor of the Premier League lifestyle. It is Porter whom you call to get your hands on the latest cellphone, or when the time comes to upgrade your car. It is Porter who can make sure your Christmas shopping is completed, or your vacation is booked. It is Porter who knows the people to hire if you want Santa to visit your children, and it is Porter, to at least one player, whose help you seek when you want to propose. “One client rang me and said: ‘Charles, I want to get engaged, and I want you to sort everything out,’” he said. “I said, ‘Have you at least found a partner?’ He said he had someone in mind, but that he needed everything else arranged: a ring, a venue, to fly in by helicopter. “We’d never done anything like that before, but we pulled it off. We sent them to a Scottish castle. She said yes, and they’re still married. There was only one thing we couldn’t quite do: He said he wanted snow. I had to tell him that there are some people I can’t have conversations with. ” It takes Porter a little time to come up with a satisfactory, concise definition of what it is, exactly, that he does. “It is,” he said, mulling it over, “quite difficult to pin down. It can be a bit of a challenge when people ask. ” He can say easily enough what he is not. “We are not a concierge service,” he said. “We are not the people you call to get a table at the Ivy, or at the Chiltern Firehouse. ” He is not, as one of his clients found out, the man to call when you want a pack of cigarettes delivered to a bar by taxi at 3:30 in the morning. Porter initially settled on calling himself a “  ” but a little later, a more poetic turn of phrase occurred to him. “We are the people who fill the holes,” he said. “We are the people who make life a little smoother. ” That his name is still so little known outside the rarefied circles in which he works goes some way to explaining his success in doing that. He would doubtless be able to write a compelling, salacious memoir, but breaking the omertà of his trade would be anathema to him. He religiously eschews  . That sort of tact, to the rich and famous, holds tremendous appeal. Porter started out some 20 years ago, after his work with the phone network Cellnet brought him into contact with Middlesbrough, the Premier League club the company sponsored. “I remember going to the training ground,” he said. “There were two guys hanging around in the car park. ” They were known, to the players, as something not far off from Baloney Bob and Fairground Frank. “One did cars, the other watches and jewelry,” Porter said. “I thought I could do it better than that. ” His initial sphere of expertise was, thanks to his background, cellphones. “It was one of the first things the players wanted,” he said. “But the clubs did not have people helping them set those things up. In the early days, there was one Senegalese player who had a    SIM card. He was spending about £7, 000 a week phoning home. ” Porter used his contacts not just to give players access to    contract phones but to help them with the paperwork, customer care, technical support and security. There was, for a while, a fad for personalized phone numbers, incorporating birthdays or jersey numbers. “Then they started asking for other things,” he said. He sourced cars, worked with private banks to set up accounts, and, later, added insurance, holidays and luxury shopping to his repertoire. As his portfolio expanded, so did his client base. “I started out with 12 Premier League players,” Porter said. “Now we have about 3, 500 people from sport, entertainment, everything. Most of them work in teams or casts, and they talk to each other. It is all word of mouth. ” Porter looks after the families of many of them, too. “One of the things I learned working inside a club was that you have to take care of the unit,” he said. “If a player is happy but his wife does not have a car or a phone, then that does not help. ” As the Premier League has become more international, of course, the clubs have picked up much of that burden. One of Porter’s first clients was Juninho, the Brazilian playmaker who signed with Middlesbrough in 1995. He was installed in two cramped rooms at the    Stockton Hotel, along with his entire family. Now, most teams have dedicated player care departments, employing as many as a dozen people to ensure their charges’ lives run as easily as possible. They help them find properties to buy or, increasingly, rent enroll their children in schools make sure their bills are paid and, in some cases, find churches or mosques where they can worship. “The clubs have done all they can to take Bob and Frank out of the equation,” Porter said. They maintain lists of trusted suppliers, from luxury brands to financial advisers the department store Harvey Nichols is among the retailers that install   shops at training grounds so players do not have to browse with the masses. Porter, though, has not seen his work dry up. If anything, the opposite is true. He is now invited by clubs to educate young players about phone security his clients are, increasingly, the teams themselves, rather than individuals. “I will quite often get calls at night explaining that they are with    a player in a restaurant,” he said. “They will say they are signing tomorrow and they need a phone for them as soon as the deal is done. ” The phone invariably comes first Porter and his team remain available for everything else, should they be required. They arrange about 20 cars a month, ordinarily upgrades. A small clutch of clients demands the latest phone on the day of release, regardless of how many they already have. At least one player, a peer said, had as many as seven at one point. They are sent out wrapped in scented tissue paper. “That is what we do: that   personal service,” Porter said. Much of the    work, though, is sorting out bank accounts, credit ratings, car insurance, technical problems. “I realized a long time ago that these people are not going to ring a call center, give their names and spend 40 minutes on hold to sort out their data allowance,” Porter said. That is where he and his team come in: to take care of life’s little annoyances, to fill the holes, to make the journey as smooth as possible.'"}, "time": 1742562141.8182628}