{"duration": 0.0953969955444336, "input_args": {"text": "'Keywords: Better Tasting Food , GMOs , homestead , Homesteading \\nIf you clicked a link that got you to this page, you can’t pretend that you are not interested in homesteading any longer. I’m not sure if you are afraid of the effort, afraid that you won’t know what to do, or what you are afraid of, but it’s time to get up and get going. \\nI have been homesteading for over 15 years and wouldn’t change it for anything in the world. My husband and I have made many mistakes along the way, but we have never been afraid to put in the hard work to get any job done. For all our hard work, we have become one of the rare profitable homesteads that are more than just surviving. \\nWe all have our own reasons that we want to try homesteading, so don’t base yours off of mine. I am just hoping to spark some interest to get you off your feet so you can make your dream become a reality. I Provide Healthy Food For My Family \\nWe are not vegan, vegetarian, of allergic to gluten, but we are completely aware of what we are putting into our bodies. I just don’t like to buy vegetables from the grocery store that have been produced chemically. I also don’t like to buy meat that was fed all sorts of things that I don’t know about. \\nEverything that I put on my kitchen table, to feed my family, has been grown or produced by me or someone I know. I know that the corn we ate last night was grown using some organic soil, water, and a little alpaca poop for good measure. The pork also came from our farm, and I know about everything that pig ate in his very happy two years of life. \\nI’m not saying that we are the healthiest family in the world, but I know we aren’t eating chemicals . That is what matters to me and my husband! The Food Tastes So Much Better \\nThe food that we produce on our homestead is so much better that the food you are purchasing at the grocery store. The truth is that they are looking to produce as much perfect looking food as they can, as fast as they can. They don’t want to grow the strands of produce that take a little longer but taste exponentially better. \\nThe meat also takes better because you aren’t rushing that either. Not to mention the fact that you are feeding the animals with healthier and better tasting food. When you slaughter the food yourself, it will taste better as well. Animals that are stressed when they get slaughtered produce meat that is much tougher that meat that we produce here on the homestead. Freedom \\nNot many people can say that they have complete freedom to do what they please during the day. Now, that doesn’t mean that we don’t have responsibilities, but we can take an hour off in the middle of the day to attend the elementary school winter concert. We can also take those doctor appointments in the middle of the day when the office isn’t insane. \\nIf you want to get freedom over your own life, start homesteading today ! We Have Economic Security \\nIf the economy crashes, we are not in risk of going without anything that we really need. We don’t rely on anyone for any of the basic necessities, including a source of income. We have everything that we need in order to survive right here on the homestead. There isn’t much that can go wrong with the government that could put us at risk. \\nI am not an apocalypse prepper, but I will say that homesteaders are more prepared should a disaster occur. We have more knowledge and experience in all of the tasks needed in an extreme survival situation than most people I know. Our Kids Understand The Meaning of Hard Work \\nI’m not saying that your kids don’t understand the meaning of hard work, but my kids have been there and done that. My nine year old wakes up two hours before school and takes care of the chickens every day. Those chickens are completely her responsibility and she know that. \\nI do allow my kids to use electronics during down time, they just know the difference between down time and chore time. They feel like they are part of the team, so it doesn’t feel like we are making them do chores every day. You might also like…'"}, "time": 1742563012.3283882}