{"duration": 0.019962549209594727, "input_args": {"text": "'Billy Bush is officially out at NBC. The network announced the news on Monday after several days of negotiations over the terms of his departure, less than two weeks after a video from 2005 surfaced in which he and Donald J. Trump engaged in a vulgar and misogynistic conversation about women. “I am deeply grateful for the conversations I’ve had with my daughters, and for all of the support from family, friends and colleagues,” Mr. Bush, who was a   of “Today,” said in a statement. “I look forward to what lies ahead. ” Terms of Mr. Bush’s departure were not disclosed but he was believed to be walking away with a payout worth millions of dollars, according to a person briefed on the settlement who spoke on condition of anonymity. The settlement does not include a noncompete clause, so Mr. Bush is free to look for a position elsewhere, the person said. It has been just 10 days since video from an “Access Hollywood” tape was made public by The Washington Post. The tape, in which Mr. Trump described sexually assaulting women, has roiled his campaign for president. Mr. Trump has said he was not proud of what he said in the video, but dismissed the comments as “locker room talk. ” In an interview broadcast on CNN on Monday night, Mr. Trump’s wife, Melania, accused Mr. Bush of egging her husband on to say “dirty and bad stuff. ” Though NBC initially had no plans to discipline Mr. Bush, he never again appeared on the air after the tape became public. Mr. Bush had started appearing on “Today” in August. NBC will now have to find a replacement for him as a   of the 9 a. m. hour. In a note to the show’s staff members, Noah Oppenheim, the “Today” chief said, “While he was a new member of the ‘Today’ team, he was a valued colleague and longtime member of the broader NBC family. We wish him success as he goes forward. ”'"}, "time": 1742564354.7841146}