{"duration": 0.27849769592285156, "input_args": {"text": "'LONDON  —   In another era they could have been allies. Both vicars’ daughters and born just a few years apart, Chancellor Angela Merkel of Germany and Prime Minister Theresa May of Britain share an understated pragmatism and conservative roots, and have made their way in the still largely man’s world of politics. But there could be so much more. At a time when President Trump is lashing out at friend and foe, and when the macho politics of strongmen is resurgent from Moscow to Manila, when not just the European Union but   Western values, free trade and security alliances are under attack, the two women might have worked together to defend the liberal global order. Instead, because of Britain’s vote in June to leave the European Union, they find themselves on opposite sides of the biggest divorce in recent European history, a chasm that has fundamentally reordered their priorities and is hindering them from cooperating on the broader issues. At a meeting of European leaders in Malta last week, Mrs. May and Ms. Merkel abruptly canceled a planned bilateral meeting after a brief exchange during a sightseeing excursion was deemed enough. After lunch, when it came to discussing the threats facing Europe, Mrs. May was shown the door. Their differing priorities were on ample display this past week as they dealt with both Mr. Trump and President Recep Tayyip Erdogan of Turkey. Ms. Merkel, whose overriding strategic ambition as Germany’s leader is to save the European Union, has kept her distance from Mr. Trump. After his election, she firmly outlined the liberal values on which she was prepared to work with him, and she swiftly condemned his travel ban aimed at seven   countries. Mrs. May, whose priority is to sign bilateral trade deals to offset her country’s departure from Europe’s single market, rushed to be the first foreign leader received by Mr. Trump after he took office. Apparently pleased to be caught on camera holding his hand, she extended a speedy invitation for a state visit with Queen Elizabeth II. “Opposites attract,” she beamed. The invitation has since become a polarizing issue in Britain’s sharply divided political landscape, and reinforced a view on the Continent that as Britain cuts ties with Europe, it will become America’s lap dog. “It’s chalk and cheese,” said Timothy Garton Ash, a professor of European history at Oxford. “But none of this tells you very much about the contrasting character of the two women. It tells you about the contrasting positions of the two countries. ” If Ms. Merkel can still afford to be an idealist, Britain’s plan to leave the European Union, or “Brexit,” has turned Mrs. May into a calculating realist. Within hours of leaving Mr. Trump, she was on a plane to Turkey. Upon arriving, Mrs. May waffled in her judgment of Mr. Trump’s travel ban, later stiffening her criticism after a public outcry. She also negotiated a deal with Turkey involving the British defense company BAE Systems. Five days later, Ms. Merkel paid her own visit to Mr. Erdogan and looked far clearer in her resolve when faced with the autocratic Turkish leader, calmly noting that she had raised controversial issues like press freedom and Turkey’s future Constitution. Privately, German officials express some sympathy for Mrs. May’s sometimes clumsy diplomacy, understanding that she needs new partners if she is to make good on her promise of a “Global Britain. ” But only occasionally have there been glimpses of the partnership that might have been. In July, Ms. Merkel was almost effusive in welcoming Mrs. May, who chose Berlin for her first foreign trip as prime minister. The German chancellor emphasized their countries’ “common values. ” During a news conference, both women stiffly answered questions about Brexit. Then a journalist asked about their first impressions of each other. Their body language visibly loosened. Ms. Merkel laughed, and Mrs. May said, “We have two women here who, if I may say so, want to get on with the job. ” Their shared gender has led to many lazy comparisons, said Rosa Prince, the author of a biography of Mrs. May that is to be published this month. “When you are a female political leader of a certain age, you are inevitably compared to Margaret Thatcher and Angela Merkel,” she said. “Theresa May is nothing like Margaret Thatcher, but as it happens has quite a lot in common with Angela Merkel. ” Each cautious and deliberate, they are both childless, have quiet husbands and enjoy watching sports. (Ms. Merkel knows soccer Mrs. May prefers cricket.) An Oxford graduate and lawmaker since 1997, Mrs. May was Britain’s   home secretary of modern times before taking over from Prime Minister David Cameron in the confusion that followed the Brexit referendum. As Ms. Prince put it, “She was the last woman standing after all the men got burned or ran away. ” Ms. Merkel, a scientist before she went into politics, is long used to being the only woman in the room. Evelyn Roll, a German biographer of Ms. Merkel, said that, on the advice of a German actress, the chancellor had deliberately lowered the pitch of her voice to deter men from talking over her. Both women endured condescension and outright misogyny as they rose. Mrs. May has been called a “bloody difficult woman” by a fellow minister. Ms. Merkel’s predecessor and mentor, Helmut Kohl, patronized her as “my girl. ” Even after Ms. Merkel unseated Mr. Kohl as leader of the Christian Democrats amid a party financing scandal, Germany’s   news media belittled her as efficient but bland  —   until she took office in 2005 and gradually became “Mutti,” the mother of the nation. “The only way men can process that a woman is in power is apparently to liken her to their mother,” Ms. Roll said. Ms. Merkel, who grew up in Germany’s former Communist east, has never branded herself a feminist. But on her watch Germany has introduced boardroom quotas for women and created a generous system of paid parental leave shared between mothers and fathers. Mrs. May once wore a   that read, “This is what a feminist looks like. ” In 2005, Mrs. May   a group called Women2Win to elect more women to Parliament and then nurture them, something that Mrs. Thatcher was often criticized for not doing. “They are both serious people who don’t grandstand, who don’t play for the gallery,” said Charles Grant, the director of the   Center for European Reform. But the few times the two women have met privately have been highly scripted affairs with little warmth on display, according to one person who was present at more than one of their meetings. “Theresa May is not good at small talk,” said Ms. Prince, the biographer. “She is not an easygoing, smooth person. She is not a natural diplomat. ” Ms. Merkel, however, is said to respect Mrs. May, considering her the “ ” in the British government, officials close to the chancellor say. For her part, Mrs. May has long expressed admiration for the German chancellor. “There are still people who don’t rate her, are a bit dismissive, perhaps because of the way she looks and dresses,” Mrs. May said in a 2012 interview with The Daily Telegraph. “What matters is, what has she actually done? And when you look at her abilities in terms of negotiation and steering Germany through a difficult time, then hats off to her. ” The two will soon be on the opposite side of the negotiations as Brexit talks commence. There is no wish in Berlin to “punish” Britain for leaving, said Peter Torry, Britain’s ambassador in Germany until 2007, who still lives in the German capital. But Berlin’s tone has grown more distant as Britain’s resolve to leave has hardened and their interests diverge. Mrs. May has said she will turn Britain into a   competitor if no favorable deal is offered by the European Union by the end of a   negotiation. But given her promises for a fairer society, that proposal is not considered credible or workable by many business and political leaders in Europe. Nor is her offer to be a bridge to the new American president. At a news conference in Malta after the European Union summit meeting on Friday, Ms. Merkel was asked whether Germany should lower its corporation tax in line with the reductions signaled by Mrs. May and Mr. Trump. “We have a tax system in Germany that is weathering challenges well,” Ms. Merkel said, suggesting that   societies rely on raising a fair amount of tax. One reason for the difference between the two women’s approaches may be that one is just starting out as head of government, while the other has been in office for over a decade. “May is like Merkel 10 years ago,” Ms. Roll said. Though sometimes accused of lacking a vision for Europe, Ms. Merkel is calm and strategic, said Daniela Schwarzer, the director of the German Council on Foreign Relations’ research institute in Berlin. “That’s obviously helpful in a situation where we risk seeing a lot of provocations coming out of Washington over the next few years,” she said. By contrast, Ms. Schwarzer added, Mrs. May seems “more tactical at this point. ” One leader is consumed by preparing Britain’s departure from the European Union, and the other with keeping the bloc together. Could they develop a pragmatic relationship during the Brexit talks and beyond? “It won’t be a smooth ride,” Ms. Prince said, “but it certainly has a better chance of succeeding with these two levelheaded women at the top. ”'"}, "time": 1742562331.4622622}