{"duration": 0.05536007881164551, "input_args": {"text": "'Protesters Clash After Mount Greenwood Police-Involved Shooting Laura Podesta and Will Jones, ABC 7 (Chicago), November 7, 2016 \\nProtesters clashed Sunday afternoon near the site of a deadly police shooting of a 25-year-old man in Chicago’s Mount Greenwood neighborhood. \\nInvestigators said Joshua Beal, of Indianapolis, was armed when a confrontation between him and officers resulted in him being fatally shot. However, family members dispute the police narrative. \\nMichael Beal, Joshua Beal’s brother, was charged with aggravated battery to a police officer, resisting arrest and attempting to disarm a police officer, a Cook County State’s Attorney spokesperson said Monday. He is scheduled to appear in court at 1:30 p.m. Tuesday. \\nOn Sunday, Mount Greenwood residents squared off against activists demonstrating against the shooting. The clash between Black Lives Matters and Blue Lives Matters groups became tense at times as they exchanged chants such as “KKK” on one side and “CPD” on the other side. \\n{snip} \\nAccording to police, the shooting occurred after a vehicle leaving funeral services at a nearby cemetery stopped in traffic in front of a Chicago fire house near West 111th Street and South Troy Street. An off-duty firefighter told the driver that they were illegally blocking the fire lane. The occupants exited the vehicle and a verbal/physical altercation ensured, police said. An off-duty Chicago police officer was inside a nearby business and assisted the firefighter. \\nA Chicago police sergeant driving to work stopped when he observed a man with a firearm in his hands. After the man “failed to drop his weapon, shots were fired striking the individual multiple times,” police said. \\n{snip} \\nAccording to family, an off-duty officer in an unmarked vehicle cut off one of the vehicles in the funeral procession. The family members and officer got out of their vehicles. After a verbal exchange, gunfire erupted but Beal’s family said that he did not provoke the officer, and merely disclosing that he had a concealed weapon permit. \\n{snip} \\nVideo circulated online on Sunday that claimed to show Beal holding a gun. \\n“The problem is everybody is making their assumptions based on the little stuff they see, the picture, the video. No one knows what happened,” activist Ja’Mal Green said. \\nThe video appears to capture the tense moments before the shooting, showing at least two people with their guns out. In another video, gunshots can be heard. \\n{snip}'"}, "time": 1742563985.029429}