{"duration": 0.09645247459411621, "input_args": {"text": "'By Zero Hedge\\nEarlier this month, Deutsche Bank stock was shaken following a Bloomberg report that Deutsche Bank’s hedge fund clients had withdrawn billions in margin cash from the bank’s prime brokerage unit, adding a shade of liquidity concerns to the bank’s ongoing capitalization woes. It now appears that DB has continued to hemmorhage cash with the FT reporting that the German lender’s exchange traded fund unit has seen billions in outflows as Germany’s biggest lender considers whether to sell parts of its asset management business.\\nInvestors have pulled $8bn from Deutsche’s ETF arm so far this year . This is an unwelcome collapse after a strong performance in 2015 when the unit attracted positive inflows of $28bn, according to ETFGI, a London-based consultancy. DB’s clients have been heading for the exit after the bank was threatened with a $14bn claim by the DOJ.\\n“The noise around Deutsche Bank has clearly not helped its ETF business,” said a senior executive from a rival asset manager who did not wish to be named.\\nAs the FT adds, Deutsche has put aside €5.5bn to cover potential litigation costs but the threat of a larger bill has forced it to consider selling a minority stake in its asset management arm, its best-performing division in recent years. However, efforts to raise fresh capital could be hindered by the outflows from the ETF unit, which is widely regarded as one of the crown jewels of Deutsche’s asset management operations.\\nTo be sure, DB defended itself when a spokesman for the bank said the ETF outflows were “part of the broader industry-wide” trend away from currency-hedged ETFs. The outflows account for 10 per cent of Deutsche’s total ETF assets under management, and indeed the difficulties at Deutsche coincide with a period of upheaval across the European ETF industry. A cut-throat price war led by BlackRock and Vanguard, the world’s two largest fund managers, has forced rivals to abandon their strategic plans.\\nStill, the cash strapped bank may find it more complicated to unwind positions and provide the needed cash at a time when each of its moves is scrutinized under a microscope.\\nDB is not alone: Source, the London-based ETF provider, has been put up for sale fewer than three years after being acquired by Warburg Pincus, the private equity group. Commerzbank, Germany’s second-largest lender, has also confirmed it plans to spin off its ETF business into a separate unit.\\nSome industry observers believe Deutsche’s ETF business could make an attractive acquisition target for a rival looking to establish a foothold in the market. A former Deutsche employee said that efforts had been made in the past to find a buyer for the ETF unit, which has assets of $76.9bn and ranks as the fifth-largest ETF provider globally.\\n“We heard a lot of rumours that senior management put [the ETF business]up for sale several times but they were unable to get much traction for the price they were asking,” he said.\\nIt wouldn’t be the first time Deutsche has tried to monetize some of its better performing assets. Following a review in 2011, the Frankfurt-based lender tried to sell large chunks of the asset management business but a potential deal with Guggenheim Partners, the US investment firm, fell apart in 2012. The bank subsequently merged the asset management division with the bank’s wealth unit, bringing the two together under the leadership of the scandal-plagued Michele Faissola whose involvmenet in a series of Monte Paschi deals has prompted the Italian government to launch an investigation into his “market manipulation” activities. As reported previously, the former investment banker is one of four executives to have led the asset management division in as many years. His involvement in the suicide of former Deutsche Banker William Broksmit was profiled here recently . Faissola’s departure from Deutsche Asset & Wealth Management last year led to another reversal: the separation of the asset and wealth management divisions just three years after they had been brought together.\\nSource: Zero Hedge \\n'"}, "time": 1742563503.0244298}