{"duration": 0.05354571342468262, "input_args": {"text": "\"Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nA leaked passage from Megyn Kelly’s new book reveals that her perverted boss, Roger Ailes, offered to advance the Fox host’s career in exchange for “sexual favors.” \\nKelly’s book, titled Settle For More , is set to be released on November 15. In the book, she reportedly reveals that Ailes targeted her as well as many of the other women at Fox News. The harassment took place early on during Kelly’s time at Fox News, beginning in 2005. The managing editor came to her and told her that she had “captured the attention of Mr. Ailes.” She would soon learn just what this meant during the first of several meetings at his office in Manhattan. \\n“Roger began pushing the limits,” she alleges. “There was a pattern to his behavior. I would be called into Roger’s office, he would shut the door, and over the next hour or two, he would engage in a kind of cat-and-mouse game with me — veering between obviously inappropriate sexually charged comments (e.g. about the ‘very sexy bras’ I must have and how he’d like to see me in them) and legitimate professional advice.” \\nBut things didn’t stop there. Radar reports : \\n“He offered to advance her career ‘in exchange for sexual favors,’ she writes, and even though she says she rejected ‘every single one,’ she claims he tried ‘physical advances.'” \\n“But in January 2006, she claims, he ‘crossed a new line — trying to grab me repeatedly and kiss me on the lips.’ When she shoved him away, she alleges, ‘he asked me an ominous question: ‘When is your contract up?’ And then, for the third time, he tried to kiss me.’ ” \\nKelly stayed conspicuously quiet when former Fox News anchor Gretchen Carlson came forward and filed a lawsuit against Ailes accusing him of sexual harassment. In her book, Kelly says that Ailes launched an “intense campaign” to convince her to speak out on his behalf when Carlson first filed her claim against him. \\n“I was approached several times, and several times I refused,” she writes. “There was no way I was going to lie to protect him.” \\nThe revelation confirms what most of us already assumed. After all, it wasn’t likely that a dirty old man like Ailes would go after so many other women at the network and not target the pretty young starlet. Until now, though, this had not been confirmed by Kelly. She said in her book that she finally decided it was time to speak out, even though there could be serious consequences. \\n“Crossing him was a major risk,” she said, “but what if — God forbid — he was still doing it to someone?” \\nThe passages regarding Ailes were reportedly added to the book after the rest of it had been completed. The book’s publisher is HarperCollins, which is owned by the same media company as Fox, who fired Ailes after Carlson filed suit against him. \\nRadar also noted that Kelly has stressed “that though she rebuffed all of his advances, he [Ailes] never went through with his implied threat of revenge. Instead, he promoted her.” \\nFeatured image via Paul Morigi/Getty Images for Fortune/Time Inc Share this Article!\""}, "time": 1742561857.7056713}