{"duration": 0.037111759185791016, "input_args": {"text": "'Dani Rovira protagonizará el mensaje de Navidad del Rey TAMBIÉN INTERPRETARÁ AL ESPAÑOL AL QUE LE TOCA EL GORDO DE NAVIDAD televisión \\nEl popular actor Dani Rovira será el encargado de dirigirse este año a los españoles en el tradicional mensaje de Navidad. Hasta ahora, ningún ciudadano de a pie había conseguido este privilegio, reservado al Rey de España. \\nLa trayectoria del actor ha vivido una tendencia inversa a la de la monarquía. Desde su debut en “8 apellidos vascos”, su popularidad ha ido en aumento, al contrario que los Borbones, que han notado como el caso Nóos les ha pasado factura. “Era el momento idóneo”, afirma Rovira. Además, está seguro de que la repercusión de salir en todos los canales a la vez le beneficiará de cara a su siguiente gran reto: intepretar al español al que le ha tocado la Lotería este año. \\nRovira no ha querido avanzar nada del contenido del mensaje, aunque ha prometido muchas sorpresas. “Es posible que aparezca Carmen Machi en algún momento interpretando a doña Letizia, peo por ahora no hay nada seguro”, ha explicado el intérprete y cómico. Según fuentes cercanas al actor, él mismo estaría escribiendo parte de texto, que incluirá reflexiones sobre lo diferentes que son hombres y mujeres y lo mala que está la comida de los aviones. \\nJuan José Cela, representante del cómico, explica que Rovira lleva varias semanas preparándose para el papel, empeorando su dicción e incluso viajando a Arabia Saudí para cerrar negocios turbios. \\nLa Casa Real no ha querido pronunciarse al respecto. Únicamente ha comentado que Rovira es una buena alternativa al Rey, ya que haber trabajado en “8 apellidos vascos” y “8 apellidos catalanes” le otorga una legitimidad “más que razonable” para afrontar la cuestión del desafío secesionista. \\nMediaset no descarta que el año que viene el mensaje corra a cargo de Antonio Recio y Amador, populares personajes de la exitosa serie “La que se avecina”.'"}, "time": 1742562006.6527598}