{"duration": 0.06659364700317383, "input_args": {"text": "'WASHINGTON  —   The White House is considering the creation of a national monument to the gay rights movement on a small piece of Greenwich Village parkland across the street from the Stonewall Inn, where a 1969 uprising helped inspire the push for equality, advocates said on Tuesday. The interior secretary, Sally Jewell, and other federal officials are scheduled to attend a listening session next week in New York, during which supporters of such a park will make their case. The advocates include Senator Kirsten E. Gillibrand and Representative Jerrold Nadler, both Democrats from New York. “We are excited about this, and we do think that the president should move forward on it,” said Kristen Brengel, the vice president for government affairs at the National Parks Conservation Association. The scheduled meeting was reported by The Washington Post. Robert Atterbury, a spokesman for Mr. Nadler’s office, said the National Park Service has completed a “reconnaissance survey” on the Greenwich Village land, known as Christopher Park, a routine step before making any recommendation to the president. White House officials said no decision had been made. President Obama has the power to create national monuments, as he has done repeatedly during his two terms. The push to create a national park or monument near the Stonewall Inn is intended to recognize the protests that erupted at the Manhattan bar after the police raided it in summer 1969. Those spontaneous protests by primarily gay men who frequented the bar are viewed by many as the beginning of the modern gay rights movement (though historians have noted the movement began before Stonewall). The bar has been granted landmark status by the city, even as it continues to serve as a watering hole that caters not only to the area’s gay residents, but also to tourists from around the world, gay or straight. “Stonewall deserves to be remembered,” said Brian Sullivan, a former bartender at the tavern who returns almost daily. “When I started coming here, gay people were disowned by their families, so this is the place where we formed a new gay family of our own. ” Mr. Sullivan, 57, leaned against the bar’s   edifice as he recalled some of the history he had witnessed there, from harrowing police raids to resolute speeches by the drag queen Marsha P. Johnson. “This is the mecca it’s where it all started,” he said. Chad Walter, a market researcher who plays for the Stonewall billiards team, said he hoped a monument would strengthen the continuing gay rights movement. “People are still being discriminated against all across the country,” Mr. Walter, 39, said. “This adds legitimacy it tells people that even the government agrees this movement is important and historic. ” Advocates of creating a national park near the Stonewall Inn have been working to build support for years. They are hoping that members of the public will turn out at the meeting next week to encourage Mr. Obama to act before he leaves office in January. The Parks Conservation Association has collected about 20, 000 signatures on petitions that have been sent to the White House. But even as advocates are urging the president to act, New York lawmakers  —   led by Ms. Gillibrand and Mr. Nadler  —   are trying to build support for legislation that could create the national park if the president chooses not to. Marc Brumer, a spokesman for Ms. Gillibrand, said they were making “good progress” on the legislation, which he said had recently picked up support from Senator Mark S. Kirk, Republican of Illinois. “Whether it’s the right to marry the person you love, or the repeal of ‘don’t ask, don’t tell,’ we’ve come so far in the push for equal rights,” Ms. Gillibrand said in a statement. “It’s past due for a national monument honoring the legacy and events that took place at Stonewall and the L. G. B. T. rights movement in our country. ”'"}, "time": 1742564390.5434487}