{"duration": 0.04979205131530762, "input_args": {"text": "'Samstag, 12. November 2016 Schlagstöcke und Pyrotechnik sichergestellt: Polizei löst unerlaubte Kinderdemo auf Köln (Archiv) - Dem beherzten Eingreifen einer Hundertschaft der Kölner Polizei ist es zu verdanken, dass am Freitag eine nicht angemeldete Demonstration in Köln-Bickendorf innerhalb weniger Minuten aufgelöst werden konnte. Bei den Beteiligten wurden Dutzende Schlagstöcke sowie Pyrotechnik in großem Umfang sichergestellt. Nach Angaben der Polizei nahmen rund 50 Minderjährige im Alter zwischen drei und sechs Jahren an der Kundgebung teil. Augenzeugen berichten, dass die Beteiligten lautstark Sprüche wie \"Sankt Martin, Sankt Martin\" und \"Rabimmel, rabammel, rabumm, bumm bumm!\" skandierten und dabei Schlagstöcke vor sich hertrugen, an denen Brandsätze befestigt waren. Wasserwerfer gegen Pyrotechnik: Kölner Polizei beim Einsatz Ob es sich bei den Demonstranten, die sich als Besucher der Kindertagesstätte \"Blaue Zwerge\" ausgaben, um Mitglieder eines extremistischen Bündnisses handelt, wird derzeit noch geprüft. Die 43-jährige Leiterin der Gruppe wurde festgenommen und sitzt derzeit noch in Untersuchungshaft. Ein weiterer Mann auf einem Pferd, der die Demonstration anzuführen schien, konnte sich in vollem Galopp dem Zugriff durch die Beamten entziehen. Wie die Polizei mitteilte, werden zudem mehrere Dutzend von den Demonstranten mitgeführte Kekse auf Drogen untersucht; das Ergebnis steht noch aus. Da mehrere Beamte von widerspenstigen Kindern gekratzt und laut Polizeibericht teilweise fies ans Schienbein getreten wurden, ergingen insgesamt 32 Strafanzeigen wegen gefährlicher Körperverletzung und Widerstandes gegen Vollstreckungsbeamte. 17 Polizisten wurden krankgeschrieben. ssi, dan; Foto rechts: Marek Peters / www.marek-peters.com , GNU 1.2 ; Hinweis: Erstmals erschienen am 11.11.14 Artikel teilen:'"}, "time": 1742628596.0815265}