{"duration": 0.12738871574401855, "input_args": {"text": "'Christopher David Leave a Comment \\nWho would have ever suspected that pressure could help you sleep? Well, probably not in the sense that you are thinking. However, recent studies have shown that the pressure caused by weighted blankets could be very helpful in the treatment of insomnia, anxiety and many other health issues. \\nThe importance of a good night’s sleep can easily be overlooked in a modern world that is obsessed with productivity. We all find ourselves wrapped up in our jobs, families and daytime life that we forget how important a productive night of rest can be. Lack of sleep can take a huge toll on our health and our moods, thus hurting our waking lives. \\nWe all know how it feels to miss out on sleep. Worries enter you mind, and it seems as though your brain will not calm down. Then you begin thinking of how poorly you will feel in the morning if you don’t sleep. One thought follows another, and the whole process begins to snowball. Many of us have spent late nights on the internet, researching ways to help us fall asleep. \\nIf that is how you came across this article, we may be able to help. New research provides evidence that sleeping under a weighted blanket at night can help you fall and stay asleep. Although it is no miracle cure, it can be very beneficial for suffers of anxiety and insomnia who are simply looking for anything to help them get through the night peacefully. \\nThe reason this works is due to a process known as deep pressure touch stimulation, or DPTS. DPTS therapy is similar to what occurs during a massage. Deep contact with the skin and muscles creates a relaxing sensation in the brain. Like the comfort an infant feels when swaddled in a thick blanket, we grown-ups can benefit from a weighted blanket. \\n“Deep touch pressure is the type of surface pressure that is exerted in most types of firm touching, holding, stroking, petting of animals, or swaddling,” says Dr. Temple Grandin. Grandin has done extensive research into the benefits of DPTS and is a pioneer in the field. “Occupational therapists have observed that a very light touch alerts the nervous system, but deep pressure is relaxing and calming.” Weighted Blankets \\nA weighted blanket is not just a thick comforter. It is a cover specifically designed to be heavy and create a small amount of pressure. The fabric of the blanket contains plastic polly pellets, usually spread throughout small pockets, that adds weight to the blanket itself. It’s similar to Beanie Babies, except not as cute. \\nIn fact, the creator of Magic Blanket, a leading brand of weighted blankets, first got the idea 15 years ago when his daughter draped a Beanie Baby over his should as he was driving. \\n“It was a lizard that was long and hugged my shoulder, and felt pretty cool,” says Magic Blanket creator Keith Zivalich . “I thought, ‘Wouldn’t it be great if you had a blanket that hugged you that way?’” \\nWeighted blankets were already being used to treat certain pediatric and psychiatric disorders, but normally only in hospital settings. Now Magic Blanket and other household weighted blankets are gaining in popularity. Most of them weigh between 10 and 30 pounds and some can even be adjusted. Now that they are being used more commonly, there are signs that they can be beneficial in the treatment of other health problems. How it Works \\nThe pressure of a weighted blanket molds to your body like a hug. This pressure not only helps to relax the muscles, but also creates a relaxing sensation in the brain. When this deep pressure is applied, the brain creates serotonin and melatonin. \\nSerotonin is a chemical in our brain that is closely related to happiness and elevated moods. Many pharmaceutical anti-depressants work by helping the brain’s serotonin receptors. On a smaller scale, the effect of DPTS caused by a weighted blanket will have a similar effect. When we are resting, the serotonin will then be converted to melatonin. \\nMelatonin is another biochemical agent that is naturally produced in the brain and helps us sleep. You are probably already somewhat familiar with melatonin, as it is the main ingredient in most natural sleep aids. \\nWhen the body feels the gentle amount of pressure caused by sleeping under a weighted blanket, pressure points are activated that will naturally notify the brain to create more serotonin and melatonin. This is the basic concept behind deep pressure touch therapy and the main reason it is effective in reducing stress. \\nThis therapy is not only beneficial for insomnia. A study published by Occupational Therapy in 2008 delved deeper into how it works. The researchers took a sample of 34 people and separated them into two groups. One group slept with a 30-pound weighted blanket, and the other group slept with a regular blanket. They found that those who slept with the weighted blankets showed significantly decreased levels of anxiety than the control group. These results were confirmed by another study in published in Australian Psychiatry in 2012. \\nDoctors in psychiatric, pediatric and geriatric hospitals have used weighted blankets for years as a way to help calm restless or irritable patients. Karen Moore, an occupational therapist in Franconia, New Hampshire and another proponent of DPTS says, “In psychiatric care, weighted blankets are one of our most powerful tools for helping people who are anxious, upset, and possibly on the verge of losing control.” Other Treatments \\nFurther research has indicated that this therapy can be beneficial in treating many other ailments as well. Because serotonin levels in the brain are the related to so many different mental disorders, DPTS could be beneficial in the treatment of: Depression '"}, "time": 1742562930.1247647}