{"duration": 0.0930631160736084, "input_args": {"text": "'“Sooner or later, everything old is new again,” Stephen King once wrote  —   an observation that’s never been truer than today. Far from being dead, vinyl records sales rose to $416 million last year, the highest since 1988, and artists like the Black Keys, Lana Del Rey and Beck are eagerly embracing the format. Instant   cameras have caught on among millennials and their younger siblings. A new Pew survey shows that print books remain much more popular than books in digital formats.   paper notebooks and erasable whiteboards are the   technology among many Silicon Valley types, and even typewriters are enjoying a renaissance in today’s     era. In his captivating new book, “The Revenge of Analog,” the reporter David Sax provides an insightful and entertaining account of this phenomenon, creating a powerful counternarrative to the   belief that we would live in an     world. Mr. Sax argues that analog isn’t going anywhere, but is experiencing a bracing revival that is not just a case of nostalgia or hipster street cred, but something more complex. “Analog experiences can provide us with the kind of   pleasures and rewards digital ones cannot,” he writes, and “sometimes analog simply outperforms digital as the best solution. ” Pen and paper can give writers and designers a direct means of sketching out their ideas without the complicating biases of software, while whiteboards can bring engineers “out from behind their screens” and entice them “to take risks and share ideas with others. ” “The choice we face isn’t between digital and analog,” Mr. Sax asserts. “That simplistic duality is actually the language that digital has conditioned us to: a false binary choice between 1 and 0, black and white, Samsung and Apple. The real world isn’t black or white. It is not even gray. Reality is multicolored, infinitely textured, and emotionally layered. ” And it’s often analog  —   perhaps less efficient, less perfect, less speedy  —   which best captures those human imperfections, creating a tactile interface with the world. A growing number of artists have noticed that music made on old tape machines and vintage studio equipment sounds different  —   “more heartfelt, raw, and organic,” in Mr. Sax’s words  —   than music made with the latest, most sophisticated technology. Listeners, too, as the musician Jack White has observed, find that vinyl has a romance, a magic that doesn’t come with the click of a mouse: “With vinyl, you’re on your knees. ” He continued: “You’re at the mercy of the needle. You watch the record spin and it’s like you’re sitting around a campfire. It’s hypnotic. ” In these pages, Mr. Sax takes us on a spirited tour of the resurgent analog universe. He takes us to United Record Pressing, a vinyl plant in Nashville that’s churning out 40, 000 records a day, with a staff that’s tripled since 2010. He takes us to Book Culture, on the Upper West Side of Manhattan, one of the many indie bookstores to open in New York and around the country in recent years. And he takes us to Snakes  Lattes, a   cafe in Toronto, where customers can play not only familiar childhood games but also more obscure selections from a   collection. There are even “game gurus” to dispense advice  —   a decidedly more social experience than the solitary world of many video gamers. This desire for human interaction  —   and a sense of community and place  —   is one of the magnets that draw people to neighborhood bookstores, where readers can get expert recommendations (from a person, not an algorithm) and attend readings and discussion groups. The more time we spend in the digital world of clicks and taps and swipes, Mr. Sax writes, the more people have begun to recognize the value of    interactions. So much so that work spaces (most notably, at tech companies) are being configured to promote productive meetings and serendipitous exchanges. “The whole point of all these spaces,” says Primo Orpilla, a   of a firm that designs offices for digital technology companies, “is to get you to put down your device and read inflections, read body language, and have meaningful conversations. ” In an increasingly digital world where physical objects and experiences are being replaced by virtual ones, Mr. Sax concludes, “analog gives us the joy of creating and possessing real, tangible things”: the hectic scratch of a fountain pen on the smooth, lined pages of a notebook the slow magic of a Polaroid photo developing in front of our eyes the satisfying snap of a newspaper page being turned and folded back the moment of silence as the arm of an old turntable descends toward a shiny new vinyl disk and the music begins to play. In reporting this book, Mr. Sax says he found that it was less a case of older generations reaching back to familiar formats from their youth than teenagers and   discovering turntables and LPs, paperback novels and film cameras. “The younger someone was, the more digitally exposed their generation was,” he writes near the end of this book, “the less I found them enamored by digital technology, and the more they were wary of its effects. ” These kids were falling in love with analog.'"}, "time": 1742562352.0175862}