{"duration": 0.19431853294372559, "input_args": {"text": "'Jaime Lannister set the tone for “Game of Thrones” in the pilot episode, shoving the young Bran Stark out of a window, paralyzing him, in the first of the show’s many unspeakably cruel acts. So, in Sunday’s Season 6 finale, there was a macabre symmetry to the fact that Jaime’s own son, the callow King Tommen, leapt to his death from a castle window. The paired calamities, loosely linked by a long string of still more deaths and dismemberment, including Jaime’s loss of his hand, reflect the series’s long game, in which acts of malice lead inexorably to more of the same. “He once said, ‘The things I do for love,’ and it was all about protecting his sister and also the kids,” said Nikolaj   the man who plays Jaime. “Now they’re all gone. ” [ “Game of Thrones” Recap: Long May She Reign ] Jaime entered the story as a louche villain but has evolved into a more shaded figure, torn between his toxic devotion to his lover and twin sister, Cersei, and more honorable impulses. The finale ended with Jaime at a crossroads, confronted with the loss of yet another child and positioned yet again between Cersei, who claimed the throne in an explosive coup, and his brother, Tyrion, currently returning to the capital city with Cersei’s rival for power, Daenerys Targaryen. “We won’t find out until next season how Jaime reacts to that,” said Mr.   45, who is Danish. “The cruel irony is he killed the Mad King in order to save King’s Landing, and he comes back to find out his sister pulled the trigger instead. ” In a telephone interview on Monday afternoon, Mr.   discussed the perils of loving a mad queen, Jaime’s bond with Brienne and possible “Game of Thrones” spinoffs. These are edited excerpts from the conversation. Congratulations on surviving another season. Hey, hallelujah. What was Season 6 about for Jaime?  It was a season of dramatic change again for him. He was sacked from the job he thought he couldn’t get sacked from  —   he’s no longer a Kingsguard. He’s back to just being Jaime Lannister that’s the massive change. Coming back with a dead child was horrific. Leaving King’s Landing the season before, at least they were in control. Coming back, he’s faced with this crazy religious uprising and the High Sparrow, and he’s not really equipped to deal with someone like that. Unfortunately, Cersei then found a way. Every time he leaves King’s Landing, something horrible happens.  In the final scene, Jaime gave Cersei an intense but ambiguous look. What was that about? I think basically he’s in shock. So many things are going through his head  —   you look down and you see your sister telling the rest of the world to go to hell. The woman you love has turned into this seemingly mad woman. If you were a couples counselor, you would tell him to maybe reconsider this relationship. What would it take for him to finally forsake her? I’ve asked myself that question quite a few times. This is such an extreme world, but I’m sure there are people in your life where you go, why in the hell are these people together? Their relationship is abusive, and why do people stay in that? Or even get addicted to dysfunctional relationships. But I don’t know how far he has to be pushed. If he can forgive her for this, I think he can forgive her for everything. She was responsible for genocide, she forced their last child to commit suicide. On a scale of 1 to 100, with 100 being this is the moment when you have to leave, I think we are at 99. 9. But it’s “Game of Thrones,” so you never know. I was struck by the parallels between Tommen’s death and when you shoved Bran out the window to kick off this whole story. It’s a bookend to what’s driven him. If Bran had told anyone what he’d seen, the three kids would have been killed there and then. Now they’re all gone. What seemingly was Cersei’s whole reason for being  —   to keep them safe and to keep them powerful, is now gone. She only has herself and Jaime, but really just herself. So I think it is an end to what has been such a huge part of the motivation for these characters. Jaime began the show as a villain. What does his evolution into a more sympathetic person symbolize? How does it fit within the broader story? It’s always about how much information you have. In the beginning, we only saw his actions we didn’t get to understand why he did it. Then later we realize, hang on a second, maybe he’s not a complete [expletive] maybe he had reasons to do these horrible things. He’s seen a lot of crazy stuff. The Riverrun story line was, in a way, about the craziness of war. You have a guy in a castle who doesn’t want to give it up. He’s outnumbered and refuses out of pride, and if that means he’s going to have to sacrifice thousands of his own men, so be it. The logic behind it  —   I think Jaime has found the empathy, and the understanding that, hang on a second, this is crazy. At least that’s what I hope maybe I’m reading too much into it. He’s getting older and he’s experienced real loss  —   he’s lost his father, he’s lost his daughter. You can argue in some ways he’s lost his sister  —   she’s definitely gone to the dark force. That changes you. He was briefly reunited with Brienne at Riverrun, too. How would you characterize their relationship? When they spent that long journey together back to King’s Landing and learned to trust each other, I think that was the first time Jaime ever spent time with a grown woman other than his sister. She represents the best parts of me, and clearly there’s a love and an attraction, but it’s an impossible scenario. They’re both dedicated to other people’s needs. And I don’t think they’ll ever be able to put themselves first. How was Season 6 different from previous ones? Obviously, there’s the whole being off book. But I felt there was a sense of the whole thing getting close to the end. As Dan [Weiss] and David [Benioff, the show’s creators] have said, there’s 13 episodes left now. It’s not that much when you consider the amount of characters and worlds. Getting to the end of Episode 10, you feel almost like, we made it. Daenerys is on her way, she’s got her ships, the whole thing is in motion. I thought every episode had some kind of step forward. Even the episodes that were about laying down story lines, there was always something that got us closer to that final shot of Daenerys on her way. Season 5 was the most depressing of all the seasons, ending, of course, with Jon Snow’s death. This season we started with his resurrection  —   there’s light at the end of the tunnel, we can fight this thing. The end of Season 5 was the turning point. Of course, Daenerys is the beautiful hero and she wants to bring beautiful change, but she’s also using these weapons of mass destruction. You can see King’s Landing burning even more now, and that’s a scary thought. As the show enters its homestretch, and it’s a huge hit, there have been spinoff rumors. Can you see any   spinoffs? Jaime and Bronn hit the road? Jaime and Brienne get an apartment together?  Yeah, that’s the one. What would you call that? “Roommates”? “Heartslayer”? It could be a  . [Laughs.] “The Heartslayer”! Yeah, why not. But it has to be a sitcom, though, and it has to have a laugh track. Then I would do it in a heartbeat. I thought we’d have a season where we just did the whole thing in a cabaret. Varys would be the owner of the club, because I know Conleth Hill would be amazing at that. And we’d all come in and do little things. Last year we did a Coldplay musical. I thought that was the finest moment we had. Conleth Hill has starred in plenty of stage musicals he could pull that off. He would be amazing. There are so many ways you could go, and let’s milk it. Let’s do it for the rest of our careers  —   just “Game of Thrones” spinoffs.'"}, "time": 1742563924.8341067}