{"duration": 0.0574955940246582, "input_args": {"text": "\"Beware: You could be poisoning yourself by reheating these five foods \\nThursday, October 27, 2016 by: Isabelle Z. Tags: reheating , toxic food , foodborne illness (NaturalNews) Nothing beats a home-cooked meal. Not only does food taste better when you prepare it yourself, but it's also a lot healthier. Unfortunately, this can also be very time-consuming depending on the dish in question, and today's hectic lifestyle means that a lot of us can't cook something special from scratch every day. If you don't want your family to have to resort to toxic fast food on your busy days, what can you do?Making enough home-cooked food to last a few days sounds like a great idea on the surface because you can quickly microwave it, but the truth is that reheating certain foods can actually make you and your family quite ill . Here is a look at some of the foods that you need to be really careful about reheating. Rice According to the NHS, eating reheated rice can cause food poisoning. They explain that the reheating itself is not the culprit; it actually has to do with how the rice was stored prior to reheating. Rice can sometimes contain spores of bacteria known as Bacillus cereus , which can cause food poisoning, and these spores can survive cooking. If rice is then left to sit at room temperature, the spores can grow into bacteria, which will multiply and could produce toxins that can cause vomiting and diarrhea.The NHS says that the likelihood of this happening increases with the amount of time the rice sat outside at room temperature. They advise serving rice right away after it has been cooked or else cooling it as quickly as possible – within no more than an hour. They also suggest reheating rice to the point where it is steaming, and avoiding storing it in the refrigerator for longer than one day. Potatoes Potatoes that have sat out at room temperature for several hours can not only lose their nutritional value, but they could also create the perfect conditions for botulism to grow. Uneaten potatoes should go directly to the fridge after cooking to help reduce the chances of this occurring. Chicken When you reheat cold chicken, the structure of its proteins is changed, which can cause digestive upset. If you have leftovers you can't bear to toss, reheat them slowly at a lower temperature on the stove or in the oven to help keep the chicken's proteins intact. It must be steaming all the way through before you can serve it, so be sure to stir it every once in a while. Spinach Spinach is best eaten raw, but it's okay to cook it if you plan to eat all of it immediately afterward. However, when cooked spinach is reheated, the nitrates in it break down into nitrites, turning one of the healthiest foods into something that is potentially toxic and can negatively impact the uptake of oxygen in the blood. Eggs It is not a good idea to repeatedly expose eggs to heat. Reheating them after they've been fried or boiled using high temperatures can cause them to become toxic and upset your digestive tract. Moreover, their protein is destroyed when they are repeatedly exposed to heat. According to the FDA , cooked egg dishes should never be left outside of the fridge for more than two hours; this drops to just one hour if the temperature is higher than 90 degrees F. Warm temperatures between 40 and 140 degrees provide the perfect environment for bacteria to grow.While most of us have reheated these foods and have not noticed any adverse effects, it is important to exercise caution if you plan to continue doing so in order to avoid poisoning yourself and your family or causing digestive issues. Tina Hanes of the USDA Meat and Poultry Hotline suggests making sure your leftovers reach 165 degrees Fahrenheit when you reheat them, and you should use a food thermometer to verify this. Covering the food helps it retain moisture and boosts its chances of heating all the way through, which is vital for avoiding cooler pockets where bacteria can thrive. Finally, keep in mind that microwaves are particularly risky because they do not heat food evenly. Sources include:\""}, "time": 1742562870.896165}