{"duration": 0.015775203704833984, "input_args": {"text": "'November 3, 2016 \\nI can’t understand why everyone’s getting interested in these old murder mysteries again,’ a baffled Prince Philip is understood to have said to aides at Buckingham Palace. ‘Aren’t they all a bit old hat? Or in Mrs Philip’s case, old crown? All I’ve heard is Miss Markle this, Miss Markle that, and quite a lot of Miss Markle the other,’ he told one footman, sending him out for some hearing aid batteries and a Twix. It’s understood Buckingham Palace insiders have been warned not to explain the true identity of ‘Miss Markle’ to the Duke of Edinburgh. \\n‘Why Prince Harry is suddenly interested in whodunnits – well it beats me. Didn’t we have that Belgian detective to dinner once? You know, the one that wrote ‘Ten Little… Ten little… bugger me it’s gone. Anyway, there was ten of the little blighters, whatever they were, and then there were none. Ten Green Bottles? No, that’s not it.’ \\n‘That reminds me! Do you remember when Charlie got a thing for that pop group, Chicken Supreme? No that’s not it. Edmundo Ros and the Supremes? No. Wait, it’ll come…..That reminds me. Has anyone seen my book of Negro Spirituals? I mean if we’re going to get nostalgic with games of Cluedo, why not a bit of singing? ‘Way Down upon the Swanee Whistle…’ \\n‘The Three Degrees! I knew it would come to me. Lovely lovely African American women! Charles was really smitten! There were three of them, and I could see what was going through the lad’s mind. ‘Eeny meeny miney mo, catch a..catch a…something by his toe. Or her toe. He’d have done alright there, instead of that thin woman and the one who smells of tobacco! Anyway, let’s hope Harry keeps up his interest in Miss Markle. And reading in general. Wait a minute. Isn’t it Miss Marple? Where are those batteries?’ Share this story... \\nPosted: Nov 3rd, 2016 by nickb Click for more article by nickb .. More Stories about: UK News 0'"}, "time": 1742628559.9146411}