{"duration": 0.14422297477722168, "input_args": {"text": "'Our new president is a    billionaire Ivy League graduate, a real estate tycoon, a TV star and a son of inherited wealth. But he is no longer, by his own calculations, a member of the “elite. ” Nor are the men (and the few women) now joining his inner circle  —     and corporate executives, Harvard and Yale alumni, Silicon Valley entrepreneurs and Goldman Sachs bankers. The true elite apparently sits elsewhere, among those who, in Sarah Palin’s notable 2008 formulation, think “that they’re  —   I guess  —   better than anyone else. ” As an adjective, the word “elite” still conveys something positive, even aspirational: elite athlete, elite model, elite travel services. But as a noun, embodied by actual living people, it has become one of the nastiest epithets in American politics. “Elites have taken all the upside for themselves and pushed the downside to the   and   Americans,” complains Trump’s adviser Steve Bannon (of Harvard, Goldman Sachs and Hollywood). In this formulation, elites are a destructive, condescending collective, plotting against the beleaguered masses outside their ranks. And in these attacks, the   and his team are deploying one of the most effective partisan political stereotypes of the modern age. For most of American history,   sentiment was a matter of up versus down, not left versus right. But about half a century ago, the conservative movement set out to claim   politics as its own. That meant redefining the term away from class and toward culture, where the “elite” could be identified by its liberal ideas, coastal real estate and highbrow consumer preferences. The   Club for Growth captured this type in a famous 2004 attack ad, instructing the Democrat Howard Dean to “take his           New York         freak show back to Vermont where it belongs. ” Trump adjusted the formula for the hot topics of the 2016 campaign. “I was on the right side of that issue, as you know, with the people,” he boasted after Brexit, adding that “Hillary, as always, stood with the elites. ” His complaints against “political correctness” conjure a world of absurdist campus politics, where overprivileged students squabble over gender pronouns and the fine points of racial victimization. “Media elites” come in for special attack, cordoned off in pens to be mocked and jeered at during rallies, labeled both liars and incompetents. But Trump has also ventured beyond mere   turning the 2016 election into a competition between knowledge systems: the      “people” versus the    “elites. ” His campaign insisted for months that pollsters and technocrats and media would be proven wrong by his electoral success. The fact that he did win dealt a blow to an entire worldview, one in which empirical inquiry and   were supposed to triumph in the end. The question, now, is whether it’s possible to run an executive branch based on hostility toward experts and professionals of all political stripes  —   and how many billionaires and Ivy Leaguers Trump can appoint before this rhetorical pose begins to break down altogether. The notion that distant elites might be conspiring against the people comes straight from the Founding Fathers, whose Declaration of Independence lamented the “long train of abuses and usurpations” inflicted upon ordinary Americans by an arrogant British king. From there on, United States history might be seen as a repeating cycle of   revolt. The Jacksonians rebelled against the Founders’ aristocratic pretensions. Northern “free labor” went to war against the oligarchical slavocracy. And the Populist revolts of the late 19th century adapted this story to modern capitalism, with farmers and laborers rebelling against robber barons, bankers,   experts and   professionals. The first historians to study those Populists described them as heroic crusaders, champions of the “people” against the “powers. ” But by the middle of the 20th century, alarmed by the rise of fascism and homegrown demagogues like Senator Joseph McCarthy, a new generation of scholars took a more anxious view of the   spirit. In his 1955 book “The Age of Reform,” Richard Hofstadter dismissed the Populists as   provincial   the latent fascists of their day. Eight years later, his “  in American Life” documented a dangerous suspicion of “the critical mind” that seemed to course through the national culture. From his perspective, the 1952 election captured everything wrong with American political life, with Dwight Eisenhower’s “philistinism” winning over Adlai Stevenson’s “intellect. ” Hofstadter did not usually describe his ideal intellectually minded citizens as members of an “elite. ” That word conveyed something different  —   a ruling class that held direct political and economic power. The most famous articulation of this view came from the sociologist C. Wright Mills, in his 1956 assessment of America’s “power elite. ” “They rule the big corporations,” Mills wrote. “They run the machinery of the state and claim its prerogatives. They direct the military establishment. ” In Mills’s view, these people were tied together not by culture or ideology but by their positions at the helms of large,    institutions. As individuals, they might be Republicans or Democrats, and might live in Ohio or California. The point was that they were in charge of things. But that vision never gained much traction in mainstream politics, where a more partisan, targeted definition was starting to emerge. William F. Buckley Jr. carved out some essentials in his first book, “God and Man at Yale,” drawing a neat distinction between respectable   men like himself and the socialistic eggheads of the professoriate. Ronald Reagan chose the term “elite” to bring it all together in his famed 1964 speech, “A Time for Choosing,” delivered on behalf of the Republican presidential candidate Barry Goldwater. “This is the issue of this election,” he said: “whether we believe in our capacity for   or whether we abandon the American Revolution and confess that a little intellectual elite in a   capitol can plan our lives for us better than we can plan them ourselves. ” Lyndon Johnson won that election in a blowout, but Reagan’s vision of a smug and detached liberal elite helped spark the oncoming “culture wars,” pitting a supposedly indignant Middle America against the liberal snobs of the coasts. By the 1990s, with the rise of   media stars like Rush Limbaugh and Bill O’Reilly, bashing the “liberal elite” had become a favorite blood sport of the American right. Despite all the abuse hurled their way, some “liberal elites” have accepted at least part of their detractors’ critique, particularly on the progressive left. It was during Bill Clinton’s presidency that the social critic Christopher Lasch published “The Revolt of the Elites and the Betrayal of Democracy,” which mourned that “   liberals” had turned into “petulant,   intolerant” scolds, thoroughly out of touch with the concerns of Middle America. Since then, the torch has passed to a younger generation of writers, including MSNBC’s Chris Hayes, whose 2012 “Twilight of the Elites” called for rethinking the entire ethos of liberal “meritocracy”  —   a system, he argued, that tends to fuel   and incompetence at the top while offering little but contempt and dim prospects for those at the bottom. So as 2017 begins, we find ourselves in a strange and uncertain political moment. Antipathy toward a wealthy, preening managerial class seems to be gaining popularity across the political spectrum  —   and, oddly, to have helped elect a wealthy, preening incoming president. Meanwhile, both liberal and conservative “elites” are scrambling to figure out what happens if the   continues to reject basic political norms and even routine intelligence briefings. Under a Trump presidency, such “elites” may have no choice but to attempt a radical redefinition of their role in American life. Otherwise, the man in the White House will do it for them.'"}, "time": 1742564455.9694495}