{"duration": 0.06297945976257324, "input_args": {"text": "'JOHANNESBURG  —   The African National Congress, the party that helped liberate black South Africans from   rule but has become mired in corruption, endured its worst election since taking power after the end of apartheid, according to results released on Friday. The A. N. C. the party of the nation’s liberation hero and first black president, Nelson Mandela, could once count on the unyielding loyalty of tens of millions of black South Africans who lived under apartheid. But widespread anger over the stagnant economy and the brazen   of the A. N. C. ’s members have badly eroded the party’s standing, gradually chipping away at its ability to rack up big electoral victories on the basis of its history alone. In the biggest   of the nation’s   political order, the A. N. C. lost power in at least one big   city, Nelson Mandela Bay, for the first time. The main beneficiary of widespread dissatisfaction in the country was the Democratic Alliance, a political party that was traditionally led by white South Africans who opposed apartheid but now has many young black leaders. During the campaign, the A. N. C. attacked the Democratic Alliance as a Trojan horse for white interests. By late Friday evening, it was locked in extremely tight races over Johannesburg, the commercial capital, and Pretoria, the seat of government  —   an unthinkable predicament for a party whose leader, President Jacob Zuma, was so confident of endless victories that he has said that his party would rule “until Jesus comes. ” Nationwide, with 98 percent of ballots counted in this week’s municipal elections, the A. N. C. garnered 54 percent of the vote  —   its lowest level in an election since 1994, when Mr. Mandela became president and the party became South Africa’s dominant political force. The decline in support for the A. N. C. was especially sharp in the nation’s eight major cities, where a growing number of black,   voters turned against the politics of patronage personified by Mr. Zuma and increasingly resisted the A. N. C. ’s emotive appeals to its heroic past. “We’re waking up to a new political scene in South Africa,” said William Gumede, a political scientist at the University of the Witwatersrand in Johannesburg. “People are clearly not voting anymore based on the past. They’re now voting on the current reality of poor service delivery and the Zuma presidency. ” The party’s showing in this week’s municipal elections fell well below the 60 percent threshold that the party’s secretary general, Gwede Mantashe, identified in a report in October as “a psychological and political turning point that would be interpreted as an indication of the demise of the movement. ” Cyril Ramaphosa, the deputy president of the A. N. C. and of the nation, said at a news conference on Friday afternoon that the organization would “do an introspective look at ourselves. ” “We are a party that’s not going away from the body politic of this country,” he said. “Where we have shown areas of weakness, we are going to get better and improve. That’s who we are. We learn from our mistakes. ” Mr. Ramaphosa, who is considered a leading contender to succeed Mr. Zuma as the A. N. C. ’s presidential candidate in 2019, sounded contrite, in a possible sign of how the party might try to regroup. “They think that we are arrogant,” he said of voters, “they think that we are   they think that we are   and I’d like to dispute all of that and say we are a listening organization. ” Mr. Zuma’s seven years in office have been marked by a series of scandals, including the use of millions of dollars in government funds to renovate his private home accusations that Indian businessmen close to him offered to dole out powerful government posts in exchange for favorable treatment and Mr. Zuma’s appointment of allies with little experience to important positions in government and   companies. The party’s poor showing this week also showed the extent of frustration over the economy, which has been made worse by Mr. Zuma’s erratic decisions, and anger over one of the world’s highest levels of income inequality. The A. N. C. ’s enduring grip on rural areas dependent on the party’s deeply rooted patronage network will most likely ensure its dominance on the national stage for another decade, according to experts and even to officials in the opposition. But pressure could mount on party leaders to replace Mr. Zuma before the end of his second and final term, in 2019. The A. N. C. ’s national tally was about eight percentage points lower than the 62 percent it received in the most recent local elections, in 2011. “It’s a huge drop,” said Prince Mashele, the executive director of the Center for Politics and Research, a private group. “This means that the A. N. C. was rejected by its core constituents  —   meaning that there is something fundamentally wrong that the A. N. C. has done to offend them. ” For the opposition Democratic Alliance, the election results are the first significant victories outside of its stronghold in the western part of the country. Whites and South Africans of mixed race make up the party’s core supporters in that area, and blacks make up only about   of the population there. The Democratic Alliance retained Cape Town, the nation’s   city, with a landslide victory. The party now controls at least two of the nation’s eight biggest cities. Mmusi Maimane, who last year became the Democratic Alliance’s first black leader, claimed victory in the mayoral race in Pretoria on Friday, with more than 10 percent of the votes still left to be tallied. The A. N. C. did not concede. Under Mr. Maimane, 36, who grew up in Soweto, the Democratic Alliance appears to have made inroads even in A. N. C. strongholds, especially among young voters whose image of the A. N. C. has less to do with Mr. Mandela than with Mr. Zuma. “I wanted change,” said Tebogo Malatjie, an unemployed    man in Soweto who voted for the first time for the Democratic Alliance. “You cannot vote for the A. N. C. if you want change. ” Voters in Nelson Mandela Bay  —   South Africa’s   municipality, which includes Port Elizabeth and whose population is 60 percent black  —   chose as its new mayor Athol Trollip, 52, a white South African from the Democratic Alliance with a long career in progressive politics. He is fluent in Xhosa, the dominant African language in his region. But the Democratic Alliance failed to win a majority there and will have to form a coalition government with one or more smaller parties, possibly the Economic Freedom Fighters, a leftist party that came in third nationwide with 8 percent.'"}, "time": 1742628555.098243}