{"duration": 0.062332868576049805, "input_args": {"text": "'Former U. N. ambassador John Bolton discussed the Trump administration’s top foreign policy objectives with SiriusXM host Alex Marlow on Thursday’s Breitbart News Daily. [Curt Schilling, who was   from CPAC on Thursday morning, asked Bolton what he thought the top foreign policy concern for the Trump administration was at the moment.  “I think there are two immediate concerns, and then there are two strategic concerns that may sound   but require corrective action by the Trump administration just as soon as they can get to it, to overcome the mistakes of the last eight years,” Bolton replied. “The two immediate threats are the proliferation of nuclear, chemical weapons. We see Iran and North Korea as the sort of two   threats in that regard. And then, second, the continuing threat of radical Islamic terrorism, with ISIS,   the Taliban in Afghanistan, all really threatening us in palpable ways today. ” “The two   threats  —   although again, we see them in the news  —   are China and Russia,” he continued. “We need to have a   strategy to keep Russia in check in both Eastern and Central Europe and in the Middle East. ” “The relationship with China, I think, will be the dominant international issue for the United States for the rest of this century, and we’re not doing well right now,” he warned. “They’re creating their own new province in the South China Sea. They’re taking a huge chunk of territory and sea lanes out of international status and making them Chinese national territory, and Obama just watched it happen. ” “There’s a lot on the administration’s plate, an awful lot to do. We obviously focus in the media on terrorism, and Americans are rightly concerned about it, but this is not just a Middle East issue, and it’s not just the threat of terrorism that, I think, the president in his   perspective has to deal with,” he said. Turning to quick hits on a few other topics, Bolton praised the current U. N. ambassador, Nikki Haley, for doing “an excellent job,” in particular applauding her assault on the U. N. security council’s   bias last week. “I’m glad she said what she did. It was right on target. I hope she continues,” he said. Marlow mentioned the news about Senator John McCain making a “secret trip to Syria” and wondered if he was trying to establish a “shadow presidency. ” “Well, look, McCain has been involved in the conflict in Syria for a long time, and we’re at a very important moment here because if Iran is able to keep the Assad regime in power and we continue to follow the Obama policy of opposing ISIS in a way that magnifies the positive effects for Iran, for its surrogate regime in Iraq, for Assad, for Hezbollah, we may eliminate ISIS  —   which I think Trump is determined to do, unlike Obama. But we don’t want to do it in a way that maximizes the benefit for Iran. So I think this is something that, really, it’s an     kind of problem. How are we going to go after ISIS more effectively than Obama did without advantaging Iran?” Bolton asked. Bolton looked at President Trump’s immigration reforms and Mexico’s hostile reaction to them, observing that “the rules, to me, look like saying we’re actually going to enforce American law that’s already on the books. ” “How’s that for a revolution?” he asked sardonically. “Where you put the people you’re deporting  —   I mean, ultimately, they’ve got to go back to their country of origin. Mexico’s objecting that a lot of them aren’t Mexican. On the other hand, they got into the United States through Mexico. Maybe it should be Mexico’s problem,” Bolton mused. “We’ll see how discussions went last night. We don’t have reporting on it. They see the Mexican president today, and we’ll know from there. ” John Bolton is a senior fellow at the American Enterprise Institute and presides over his own political action committee, BoltonPAC. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563853.3801541}