{"duration": 0.025568723678588867, "input_args": {"text": "'  Brilliant Takedown Of Feminism From An Old Man Brilliant Takedown Of Feminism From An Old Man December 28, 2012 30 Comments Culture \\nMany of you are probably familiar with Fred On Everything , a member of the old guard when it comes to the fight against feminism. His Hooking Up article gives a birds-eye view of how feminism corrupted women, in a way that only a senior citizen who has seen it all can elucidate. \\nWhat I don’t get is, why are gals bitching? This is the world they wanted. They clawed and scratched and burned their bras and had court cases and threw fits to get exactly what they have. They hated men because, they said, men weren’t letting them copulate frantically like men had always wanted them to. Men, or more likely their mothers, didn’t let them make themselves unattractive by dressing like hod-carriers and swearing like sailors. Finally men gave in and now women hate them for that . Whatever happened to gratitude? […] \\nSally Sue might have teeth like pearls and brains and perky tits and a wacky sense of humor and actually be quite a prize, but sex trumps art. If Sally didn’t say Yes, she knew that Greta would. Women had commoditized themselves. It was a marvelous thing for the testosterone wads we think of as college boys. […] \\n“All you want is sex!” \\n“Uh…what else have you got?” or “So what?” \\nOr, “Marriage? Why? Would sex be better? Would food taste better? I don’t get it.” \\nOr, “Marriage doesn’t make sense. Do you want to eat in the same restaurant all your life?” \\nWomen weren’t happen then and aren’t happy now. Trying to please them will just sacrifice what you want while giving no guarantee that they’ll be content, yet we still have beta males and white knights fighting among each other to appease the unappeasable. Will they collectively realize their folly? \\nMaybe a more relevant question is if we want them to wake up. When I’m looting the Best Buy after a hurricane, I don’t want to compete with other looters. It’s possible the quality of goods I’d be able to steal would be much less due to the competition.'"}, "time": 1742563395.536255}