{"duration": 0.08348488807678223, "input_args": {"text": "'T. J. Oshie dominating in a thrilling United States shootout victory over Russia. Sidney Crosby scoring an overtime goal on home ice to lift Canada to the gold medal over the United States. Henrik Lundqvist stretching across the goal line with seconds remaining to secure gold for Sweden. Some of the more memorable moments in Olympic hockey history have involved N. H. L. players, but new ones will probably have to be forged without them next winter in South Korea. Citing a majority of owners’ overwhelming opposition to disrupting the regular season, the N. H. L. announced Monday that it would not participate in the 2018 Olympics in Pyeongchang, depriving the Games of the world’s best players in a showcase sport. Players in the N. H. L. have participated in every Olympics since 1998, and many have expressed interest in playing at next winter’s Games. Lundqvist, the Rangers’ stellar goaltender, said on Twitter that the league’s decision wasted “a huge opportunity to market the game at the biggest stage” and that he was disappointed “for all the players that can’t be part of the most special adventure in sports. ” The Washington Capitals star Alex Ovechkin has said he plans to represent Russia at the Pyeongchang Games no matter what the N. H. L. might decide, raising the possibility that the next battle for the owners might be with individual players who do not want to obey the league. The National Hockey League Players’ Association said in a statement that players were “extraordinarily disappointed and adamantly disagree” with the league’s decision. “N. H. L. players are patriotic and they do not take this lightly,” the association said. “A decent respect for the opinions of the players matters. This is the N. H. L. ’s decision, and its alone. It is very unfortunate for the game, the players and millions of loyal hockey fans. ” N. H. L. owners and officials do not like the idea of shutting down the league for a few weeks. They have argued that they deserve a portion of the revenue that the International Olympic Committee receives from the tournament, and they do not like the injury risk. Several stars, among them Islanders center John Tavares and Red Wings center Henrik Zetterberg, sustained   injuries at the 2014 Sochi Olympics. “The league isn’t ” N. H. L. Commissioner Gary Bettman told Chicago business leaders last month. “We’ve been to five of them. The problem is the clubs are   to the season. To disappear for almost three weeks in February when there’s no football, no baseball, there’s only basketball and us. To do it where there’s no programming for the NHL Network, for NHL. com, for all of our social media platforms  —   we just disappear. ” The United States Olympic Committee responded to the decision with a statement posted on its website: “We’re disappointed that the N. H. L. has decided not to participate and feel for the players who were looking forward to the Games. That said, we’re confident U. S. A. Hockey will build the   team to compete and win in Pyeongchang. ” Bettman has been hinting at a potential Olympic absence for about a year, telling reporters before Game 1 of the Stanley Cup finals last May that “our teams are not interested in paying for the privilege” of participating. The N. H. L. endorsed another global event, the World Cup of Hockey, held in Canada in September. The competition ended two weeks before the season, and coupled with mandated   breaks for each team, it created a compressed schedule comparable to that of an Olympic year. Players and coaches have complained that the schedule has led to fatigue and poor play. The N. B. A. is the only other one of the four major North American sports leagues that sends its players to the Olympics, but basketball is contested at the Summer Games, during the league’s  . When baseball was a medal sport, from 1992 to 2008, Major League Baseball would not permit its players to compete for similar reasons as the N. H. L. ’s: a lengthy interruption of an inflexible schedule that would cost owners and the players’ association about three weeks’ worth of revenue. Minor leaguers and college players competed instead, as could be the case with the hockey teams for the United States and Canada in Pyeongchang. “We knew it was a very real possibility for many months and certainly respect the decision of the N. H. L. ,” Dave Ogrean, executive director of U. S. A. Hockey, said in a statement. “The good news is that because of our   efforts over the course of many years, our player pool is as deep as it has ever been, and we fully expect to field a team that will play for a medal. ” The president of the International Ice Hockey Federation, René Fasel, said recently that the federation needed the N. H. L. ’s decision on 2018 by the end of April. Though the N. H. L. ’s statement on Monday ended with “We now consider the matter officially closed,” it remains to be seen whether the decision is, in fact, final. Negotiations for the 2014 Sochi Olympics stalled four years ago, but an agreement was reached on July 19, 2013, less than seven months before the opening ceremony. Furthermore, although the N. H. L. said in its statement that the I. O. C. had let it be known that the league’s participation in the 2022 Beijing Games was contingent on its presence in Pyeongchang, the league is striving to make inroads in China. Refusing to send its players there could ruin an opportunity to tap a new market. Last week, Bettman traveled to China to announce that the Vancouver Canucks and the Los Angeles Kings would play two exhibition games there in September, in Shanghai and Beijing, where the Kontinental Hockey League of Russia recently installed a team. In its statement, the N. H. L. said it had been open to hearing from the I. O. C. the I. I. H. F. and the players’ association on ways to make Olympic participation more attractive to the team owners. “A number of months have now passed, and no meaningful dialogue has materialized,” the N. H. L. said. The I. O. C. which had previously paid travel and insurance expenses for N. H. L. players, had said it would not do so for the 2018 Games. The I. I. H. F. stepped in to cover those costs instead, but that concession did not satisfy the league.'"}, "time": 1742628340.8510194}