{"duration": 0.10745525360107422, "input_args": {"text": "'RIO DE JANEIRO  —   The same shouts can be heard throughout the Summer Olympics, from table tennis and fencing to swimming and beach volleyball events: Silêncio! Shh! While every sport has its own custom for when it is appropriate to cheer and when quiet is expected, none of that applies here. The Rio Games have only just begun, but already the exuberance of local fans has collided with athletes’ and officials’ pleas for silence. “We are not used to this in table tennis,” said Galia Dvorak of Spain, who acknowledged that she had been shocked and unnerved by jeers from Brazilian fans during her match. She added, “It was just weird. ” At the Olympic Aquatics Stadium, an official twice requested silence from the crowd before a   butterfly race that featured the Brazilians Daiene Dias and Daynara de Paula. Fans contained themselves just long enough for the races to start before resuming their screaming. At the beach volleyball court, fans whistled and jeered when a Canadian team served. The   announcer asked them to cheer for everyone. During a men’s fencing event, raucous Brazilian fans tossed aside the sport’s typically convoluted rules of decorum  —   cheering is all right, but only at certain moments  —   as they shook the stands with continuous spasms of celebration and booed anyone who notched a point against one of their own. “It’s an incredible feeling when you enter this arena,” the Brazilian fencer Ghislain Perrier said after losing his bout. “You feel all the power of the Brazilian people. ” The fans’ presence has been most striking, though, at the table tennis arena. Outside a select few countries, the sport struggles to draw fans and generate excitement. Players in the sport value silence, which allows them to hear the way the ball bounces off an opponent’s paddle and to react more smoothly to a shot. The tenor of the match on Sunday night between Hugo Calderano of Brazil and Tang Peng of Hong Kong revealed itself before a single point was played. Calderano, 20, entered the arena like a gladiator, hearing his name bellowed in unison from the stands, and when Tang, 35, hit a   shot into the net, the crowd let out an overjoyed roar of approval. On it went through the match, just like this: every time Calderano scored, an elated scream each time Tang erred, yelps of joy. In the realm of table tennis  —   a subtle sport often likened to chess  —   these were vividly unusual scenes. But such displays had been going on at the Olympic table tennis pavilion all weekend. “It’s usually a more serious sport,” Anderson Monteiro, 40, a casual table tennis fan from Rio de Janeiro, said as he watched Calderano play. “I think it’s fantastic. It’s wonderful. It’s typically Brazilian. ” Alexandre Araújo, a press officer for the Brazilian table tennis squad, tapped his chest as he explained that the fans had “come with a football heart. ” On Sunday, fans hissed when Tang prepared to serve, forcing him on one occasion to step away from the table. That made the fans boo louder. They stopped only to sing to Calderano, “Vou te apoiar, Hugo!” (“I will support you, Hugo! ”) On Saturday afternoon, while Caroline Kumahara of São Paulo was on her way to losing her   match to an opponent from Luxembourg, the Brazilian fans kept their spirits up, doing the wave, rattling noisemakers and serenading her with encouragement, like “eu sou brasileiro, com muito orgulho, com muito amor!” (“I am Brazilian, with much pride, with much love! ”) “Brazilians are like this,” Kumahara said afterward. “They are always happy, always making fun of everything. This is normal for them. ” It has been highly abnormal for the players, though. On Saturday morning, Gui Lin, the other woman representing Brazil in singles, stepped away from the table at one point to motion to the stands to quiet her vocal fans  —   a rather extraordinary move in the wider context of sports. Gui, who said she appreciated the cheers, nevertheless seemed uneasy afterward as she described table tennis as a sport “where you have to be quiet” and the noise as a sign of disrespect. “They have to focus,” Gui said of her opponents, “and there are three other tables playing, and I thought it wasn’t right to disturb the others because of me. ” Gui’s opponent, Dvorak, blamed the crowd’s jeers for her   loss in the first game. “Like in other countries, like in China, they cheer a lot, but never against the opponent,” Dvorak said. “They cheer for their players, but never making this ‘ooh’ against you. ” Noting the atypical atmosphere at his own match Saturday afternoon, Gustavo Tsuboi of São Paulo guessed that, for all their enthusiasm, most of the Brazilian fans on hand were not familiar with the customs of the sport. “It’s unusual how they react,” said Tsuboi, who said he loved the additional energy. “We are used to having events only with people who already know our sport. ” Not all   were peeved. Tommy Danielsson, the Luxembourg coach, said: “I find it very nice when the audience gets involved. We need this. People can see that this is not just a hobby game you play in a garage at home. ” The atmosphere Sunday supported that assertion. The crowd grew more engrossed, and more animated, as the match entered its late stages and it seemed that Calderano, the   player in the world, might produce a    victory over Tang, ranked 15th. Gui had slipped into the stands before the final game, taking a seat in the second row. As she watched the final points  —   Tang banging away to stay alive, Calderano parrying his efforts  —   she rubbed her palms nervously in front of her mouth. When Calderano secured the winning point, sending the crowd into a prolonged roar, Gui jumped out of her seat and pumped her fists in the air. The fans whooped and applauded and pounded their feet, and she clapped along with them, perfectly in rhythm.'"}, "time": 1742563561.7235684}