{"duration": 0.03929781913757324, "input_args": {"text": "'Liberal cities across the globe are getting all symbolic in the wake of President Trump’s decision to pull the U. S. out of the Paris climate accord  —   by shining green lights on buildings. [Trump announced Thursday that he will pull the U. S. out of the 2015 Paris accord, causing dismay among liberal politicians and media outlets across the globe. Some mayors and governors have said they intend to carry on with the agreement in their cities.  But now, some of those liberal enclaves are expressing their support for the accord by turning their buildings green as a sign of their environmentalism. In New York City, Boston and Washington D. C. buildings turned green at the behest of the cities’ liberal politicians. City Hall shines green tonight because New York City will honor the goals of the #ParisAgreement. pic. twitter.   —   Bill de Blasio (@NYCMayor) June 2, 2017,  City Hall is green tonight.  Boston stands with the environment.  We must protect our future. #ParisAccord pic. twitter.   —   Mayor Marty Walsh (@marty_walsh) June 2, 2017,  Exiting the #ParisAgreement may make us see red  feel blue, but the Wilson Building’s lit up green tonight to prove the fight endures pic. twitter.   —   Council of DC (@councilofdc) June 2, 2017,  Abroad, Paris, Montreal and Mexico City also got in on the fun. Regardless of #Trump’s decision, cities will apply #ParisAgreement. #Climate pic. twitter.   —   Anne Hidalgo (@Anne_Hidalgo) June 1, 2017,  Les Changements climatiques existent! Montréal supporte #AccorddeParis Montréal supports #ParisAccord @c40cities pic. twitter.   —   DenisCoderre (@DenisCoderre) June 2, 2017,  🇲🇽Mexico City lighted city hall  monuments green to express his commitment to the #ParisAgreement 🇲🇽 #Cities4Climate pic. twitter.   —   C40 Cities (@c40cities) June 2, 2017,  The push by liberal cities across the globe may not be surprising. Despite Trump’s openness to negotiating the accord, local and world leaders reacted angrily to the announcement. The governments of Italy, France, and Germany on Thursday rejected the offer, saying in a joint statement that the agreement  “cannot be renegotiated, since it is a vital instrument for our planet, societies and economies. ” Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742563902.1889856}