{"duration": 0.08182001113891602, "input_args": {"text": "'The surge in gun ownership among LGBT community members that began after the June 12, 2016, Orlando Pulse attack has continued and even grown during the first months of the presidency of Donald Trump. [Haaretz reports, “The latest   wave, following the June 2016 mass shooting at a gay bar in Orlando, Florida, has brought a new kind of person to the gun culture  —   young and liberal gay people, many of them  . They’re now standing side by side with straight white conservative men at shooting ranges. ”  The Orlando Pulse nightclub was a   zone and the attack on it was carried out by an Islamist with two guns a rifle and a handgun. He passed background checks for both guns and a   waiting period for the handgun, proving once more that gun control is no hindrance to determined attackers. Many in the LGBT community came away from the attack awakened to this fact and to the reality that they were going to have to take   into their own hands —  literally. Enter the Pink Pistols. Prior to the Orlando Pulse attack “the Pink Pistols Facebook group numbered about 1, 500 people. ” But following the attack “sixteen Pink Pistols branches opened  …     and the Facebook group grew to 9, 000 members. ” Pink Pistols spokesperson Gwendolyn Patton said: We teach queers to shoot so they can be safer from those who would harm them for who and what they are. Then we tell the world we’ve done it, so those who think queer people are helpless targets who can’t fight back and are easy pickings for violence will know that it isn’t necessarily true   …    . We don’t want to have to shoot anyone. We’d much rather they decided it wasn’t worth the risk and went to play pool or something. On June 12, 2016, just hours after the Orlando Pulse occurred, Breitbart News quoted Patton saying, “Let us not reach for the   fruit of blaming the killer’s guns. Let us stay focused on the fact that someone hated gay people so much they were ready to kill or injure so many. A human being did this. The human being’s tools are unimportant when compared to the bleakness of that person’s soul. ” Patton admitted that it is difficult to carry guns in the bars of some states because of   prohibitions. But she suggested this can often be remedied by a selecting designated driver who agrees to forgo any alcohol for the night so that that he can carry a gun with which to protect his companions. Patton said, “It’s sad that we must consider such things, but when there are persons out there who mean us harm, we must find ways to protect ourselves within the law. ” Erin Palette is transgender who lives 60 miles from Orlando and has concealed carry permit. Palette recalled how the LGBT community’s view of owning guns for   appeared to change overnight —  following Orlando Pulse —  and how gun ranges and firearms training facilities across the country were eager to help: I started seeing this wonderful outpouring of support from gun owners who were posting all across social media that if you were LGTBQ and wanted to learn how to defend yourself, these gun owners would teach you shooting for absolutely free. And the sentiment was: ‘I don’t care what your politics are, I don’t care what your sexuality is, I don’t care what you have between your legs  —   you are a human being, you have the inherent right to defend yourself, and if you don’t know how, I will be happy to teach you.’'"}, "time": 1742563193.8112278}