{"duration": 0.037583351135253906, "input_args": {"text": "'Posted on October 31, 2016 by Edmondo Burr in News , US // 0 Comments A man dressed as Freddy Krueger and an accomplice have shot five people at a large Halloween party in San Antonio, Texas. \\nEarly Sunday a man dressed like the fictional serial killer from the film ‘Nightmare on Elm Street’ opened fire on a large crowd after an argument turned violent. \\nThe shooters are still at large. \\nKens5 reports: \\nThe shooting happened on the 2900 block of Aspen Meadow around 5 a.m. on Sunday. One of the residents who did not want to go on camera said he was throwing the party with his housemates and was taking fees at the door. RELATED CONTENT Two Teenagers Dead And 17 Injured In Florida Nightclub Shooting \\nHe said several men he did not know showed up to the home and started a fight with his friends. He said the argument escalated into a shooting. \\nHe said several people who attended the party captured part of the fight on Snapchat. This later reportedly helped police identify that there were two shooters involved. He said one man had a shotgun and the second man had a hand-gun. \\nThere were five people who were injured in the shooting. Police said that one injured woman tried to drive to the hospital, but wrecked her car along the way. Jasmine De Hoyos, who attended the party, said there were more than a hundred people at the home. She said she helped one of the victims who got shot in the arm. \\n“I kind of applied pressure to the wound to make sure he didn’t bleed out. A couple of his friends were there with us. So, we were trying to keep him calm,” said De Hoyos. \\nNo arrests have been made and police are still searching for the shooters. \\n“I’m kind of sad that this happened in this neighborhood because I like living here. It’s a really good neighborhood. It is what it is, and we’re just going to keep an eye out and try to keep each other’s back,” said Jeremy Collins, another neighbor. \\nThe resident of the home who did not want to go on camera said one of his friends who got shot in the stomach is still in critical condition.'"}, "time": 1742628424.0954313}