{"duration": 0.09614038467407227, "input_args": {"text": "'SCANDAL: EPA could have issued an emergency order 7 months before Flint water crisis became public knowledge \\nMonday, October 31, 2016 by: J. D. Heyes Tags: Flint , water crisis , EPA cover-up (NaturalNews) The federal bureaucracy and corresponding state agencies have never been much good at responding to crises in a timely fashion, and that tradition was alive and well during the recent toxic water crisis in Flint, Michigan.In fact, according to a newly released watchdog report, Americans now know that the federal Environmental Protection Agency (EPA) could have intervened in the crisis a full seven months before it finally did, meaning thousands of residents in Flint would have had to drink far less water tainted with lead.As reported by The Associated Press , the EPA\\'s inspector general said that the agency had the authority and enough information to issue emergency orders to protect Flint residents from the lead-contaminated water they were drinking as early as June 2015, seven months before officials finally declared an emergency.Inspector General Arthur Elkins said in an interim report that the water crisis should have created \"a greater sense of urgency\" for the EPA to \"intervene when the safety of drinking water is compromised.\" Everyone is pointing fingers at everyone else The drinking water in Flint became tainted with unsafe levels of lead after city officials decided to begin drawing from the Flint River in April 2014, in a bid to save money. The broke city of about 100,000 residents north of Detroit was under state control at the time.Regulators did not make sure that the water was properly treated, so lead from aging pipes leached into the supply, the AP reported.Since the discovery of high levels of lead, federal, state and local officials have traded accusations about who is most to blame for the crisis , even as residents are still forced to drink bottled or filtered water.Doctors have detected higher than normal levels of lead in hundreds of children around the city. And many taps remain off-limits.Gov. Rick Snyder, a Republican, appointed a panel to look into the matter. It concluded that the state is \"fundamentally accountable\" for the lead crisis due to decisions made by state environmental regulators as well as state-appointed emergency managers who were in charge of running the city.But that said, once the EPA discovered that water being consumed by city residents was tainted with unsafe levels of lead, Snyder believes the agency should have acted – and he is right.\"As Gov. Snyder has stated all along, what happened in Flint was the result of failure of government at all levels,\" his spokeswoman, Anna Heaton, said recently.Since the crisis began, officials have tried to reshuffle the deck, so to speak, and call it \"reform.\" They say some state agencies have undergone \"culture changes\" that will supposedly prevent future recurrences of epic failure, according to Heaton, who called such changes \"encouraging.\" People should be held accountable – but won\\'t be It\\'s unclear how many people actually believe that, considering that state agencies had mandates already to protect the public from polluted and contaminated water (as did the EPA). By \"culture changes,\" does Heaton mean that people were fired and actually replaced by others who will do what taxpayers are paying them to do?Flint Mayor Karen Weaver, a Democrat who took office after the crisis emerged, said agencies like the EPA and the Michigan Department of Environmental Quality are there \"to help ensure the well-being and safety of men, women and children,\" yet they failed in their core mission to do so. She also called for those who are responsible for the crisis to be held accountable, though we advise her not to hold her breath.As for the EPA\\'s inspector general report, it said that the agency\\'s Midwest region did not issue an emergency order because officials concluded actions taken by the state prevented the EPA from doing so. The report says that their interpretation was not correct, and that according to federal law, when state actions are deemed to be unacceptable, \"the EPA can and should proceed with an (emergency) order\" designed to protect \"the public in a timely manner.\"Without EPA intervention, \"the conditions in Flint persisted, and the state continued to delay taking action to require corrosion control or provide alternative drinking water supplies,\" the report said. Sources:'"}, "time": 1742561676.319655}