{"duration": 0.02685093879699707, "input_args": {"text": "'SWAT Standoff Suspect Linked to Zionsville Murder, IMPD HQ Shootings Rich van Wyk and David Macanally, WTHR (Indianapolis), October 31, 2016 \\nThe suspect in a SWAT standoff on Indianapolis’ far northeast side Monday afternoon has been connected to recent shootings at IMPD headquarters and the September murder of an 82-year-old Zionsville man. \\nDamoine Wilcoxson surrendered peacefully around 4:15 p.m. after a hours-long standoff with IMPD at an apartment complex near Shadeland Ave. & Mill View Dr. Damoine Wilcoxson \\nWilcoxson was holding his 6-month-old son inside the apartment during the standoff. The boy’s grandmother stood across the street during the ordeal, waiting alongside everyone else and hoping he would be okay. \\n{snip} \\nWilcoxson was armed during the standoff and police say he fired at officers through the door. No one was injured and officers did not return fire due to concerns for the child. \\n{snip} \\nProsecutors say Wilcoxson faces a murder charge for the shooting death of John Clements less than half a mile from Zionsville High School on Sept. 28 . It was the first murder Zionsville has seen in 20 years. \\n{snip} \\nAccording to court documents, investigators believe Wilcoxson is also related to the IMPD headquarters shootings that occurred on October 4 and October 13. Detectives found handwritten notes demanding $100,000 and threats including “white must die” near the shell casings that were connected with the Oct. 4 shooting at IMPD Northwest District headquarters. Similar notes were found near the shell casings discovered after the Oct. 13 shooting at IMPD North District headquarters. \\n“At least in one of those shootings, we believe that he intentionally targeted two police officers inside,” IMPD Chief Troy Riggs said, “and we’re going to be requesting attempted murder charges.” \\nHe allegedly fired almost 50 rounds at those police stations earlier this month. No officers were hurt, but he allegedly left a note at the crime scene threatening more shootings if he didn’t get $100,000. \\nDetectives discovered that the shell casings from both IMPD shootings were a match. A DNA sample from one of the notes and a shell casing matched Wilcoxson’s profile. \\nCourt papers say forensic evidence links his gun to all those cases, but his stepfather says, “No, no, no, he’s not.” \\nThe stepfather doesn’t believe Damoine is connected to those crimes. \\nHis aunt, Detra Boyd, said, “He had a moment. That’s all.” \\n{snip} \\nFBI undercover agents friended him on Facebook during the probe into the police station attacks and the Zionsville murder. According to court documents, they found anti-white remarks and posts like “Kill mankind. No one should survive. We all live in lies,” plus “eye-4-eye, tooth for tooth, head for head, life for life.” \\n{snip} \\nWilcoxson has a long criminal history that includes run-ins with police since he was 14 years old. \\n{snip}'"}, "time": 1742628586.072501}