{"duration": 0.045213937759399414, "input_args": {"text": "'  \\nRecently, I was asked a question about Kill Anything That Moves , my history of civilian suffering during the Vietnam War. An interviewer wanted to know how I responded to veterans who took offense at the (supposed) implication that every American who served in Vietnam committed atrocities. \\nI think I softly snorted and slowly shook my head. \\nAlready two books behind me, Kill Anything That Moves might as well have been written by someone else in another lifetime. In some sense, it was. \\nIt takes effort for me to dredge up the faded memories of that work, a Kodachrome-hued swirl of hundreds of interviews on two continents over the course of a decade. But this particular question was easy enough to answer. Almost all the Americans I interviewed had seen combat, but most American veterans of the war hadn’t. Many had little or no real opportunity to commit war crimes. Case closed. \\nBut that question caused me to recall a host of related queries that churned around the book. Questions by skeptics, atrocity-deniers, fair-minded interviewers attempting to play devil’s advocate. A favorite was whether the book was “anti-veteran.” That, too, was a head-shaker for me. \\n“How could that be?” I would respond. After all, the book owed its genesis to veterans. Veterans were key sources for it. Veterans provided the evidence. Veterans provided the quotes. Veterans even supplied the title. The book was, to a great extent, the history of the war as described to me by veterans. The story I told was their story. How could that in any way be anti-veteran? \\nMany of the vets I spoke with viewed their truth-telling as a form of patriotism, of continuing service to country. Nate Terani’s inaugural TomDispatch essay follows in the same American tradition. His eyes were opened to the abuse of military power while living in Iran as a boy. Later he would join the U.S. Navy and wear the stars and stripes with particular pride. September 11th and all that came after — notably the demonization of his Muslim faith in his homeland — imbued him with a new mission, one he now views as no less sacred than his military service. \\nFrom Smedley Butler to Andrew Bacevich , Daniel Ellsberg to Chelsea Manning , Vietnam Veterans Against the War to Iraq Veterans Against the War , the U.S. armed forces have produced a steady stream of truth-tellers and whistleblowers, men and women willing to serve their country in profound ways during trying times. There’s no bronze star for activism, no Navy Cross for unpopular or contrarian opinions, no Purple Heart for the hard knocks involved in speaking out against war crimes or Islamophobia or laying bare information vital to the American public. Veterans who dare to do so have sometimes walked a cold, lonely road far from the warm glow enjoyed by summer soldiers and sunshine patriots. Those who do so exhibit a special form of courage that may even exceed the bravery of the battlefield, the courage to stand tall and make oneself a target, a courage deserving ( with a nod to Thomas Paine ) of the love and thanks of man and woman.'"}, "time": 1742628300.0134075}