{"duration": 0.05406522750854492, "input_args": {"text": "'Charles Osgood, whose distinct voice and dapper broadcasting style has made the CBS show “Sunday Morning” a weekly ritual for many viewers, will be leaving at the end of September after 22 years as the program’s anchor. News of his departure comes after months of speculation. On Sunday, Mr. Osgood, who is 83, used a part of the “Sunday Morning” broadcast to tell his viewers that the rumors were true. “For years now, people, even friends and family, have been asking me why I keep doing this, considering my age,” Mr. Osgood said. “I am pushing 84. It’s just that it’s been a joy doing it. ” He added: “It’s been a great run, but after nearly 50 years at CBS, including the last 22 years here on ‘Sunday Morning,’ the time has come, and a date is set for me to do my farewell ‘Sunday Morning. ’” The farewell broadcast will be on Sept. 25. Since he joined the network in 1971, Mr. Osgood had been a reporter and anchor for every broadcast on CBS, according to the network. He took over “Sunday Morning” from Charles Kuralt in 1994. His comforting, almost folksy approach to the news (and trademark bow ties) quickly eliminated any early doubts that he could successfully replace Mr. Kuralt, who had spent 15 years developing the show. With Mr. Osgood in the anchor chair, the program has won three daytime Emmys for outstanding morning program. His voice, velvety and gravelly at once, made him well known to radio, television and movie listeners. In 2008, he was the narrator of the animated film “Horton Hears a Who!” “Charles Osgood has one of the most distinctive voices in broadcasting, guiding each broadcast, making sure the words were just right and being a calming, reassuring presence to our viewers,” David Rhodes, president of CBS News, said in a statement. “His impeccable commitment to quality inspires all of us at CBS News. ” On Sunday, Mr. Osgood assured viewers that they could still find him on the radio. He will contribute to his   program “The Osgood File,” where he has been known to read vignettes and poems about the day’s news. He ended his farewell announcement by singing a folk song, written by Woody Guthrie, to his viewers: “So long, it’s been good to know   long it’s been good to know   long it’s been good to know   long time since I’ve been   I’ve got to be drifting along. ”'"}, "time": 1742563918.8030457}