{"duration": 0.016086816787719727, "input_args": {"text": "'DePaul University reportedly banned “Gay Lives Matter” posters which were designed to advertise a lecture from a gay journalist on radical Islam which took place on campus Wednesday night. [Here’s the call for protests of my talk tonight at @DePaulU ”Dictatorships and Radical Islam: Enemies of LGBTQ Rights.” Notice missing word? pic. twitter.   —   Jamie Kirchick (@jkirchick) May 10, 2017,   According to The College Fix, students at DePaul University planning to advertise for a lecture event featuring journalist Jamie Kirchick were reportedly rejected by campus administrators, who said that the posters were an effort to “ ” the approach of the Black Lives Matter movement and “pits two marginalized groups against each other. ” On Wednesday evening, Kirchick, who is gay, spoke about the radical elements of Islam that threaten members of the LGBTQ community in a lecture titled, “Dictatorships and Radical Islam: The Enemies of Gay Rights. ” “This is a disappointing decision by the university to prohibit our poster,” said Matt Lamb, a leader of the Turning Point USA group that helped bring Kirchick to campus. “The event by our DePaul chapter is calling attention to the harms that big government, authoritarian regimes pose to LGBT citizen’s most basic human rights. ” DePaul’s Turning Point USA President Jason Plotzke expressed his confusion over the university’s decision to reject their poster, arguing that their design had no intention of undermining the Black Lives Matter movement. “We do not see how the branding of Black Lives Matter is exclusive from all other lives and we cannot make a similar statement in a different movement,” Plotzke said. “Sure, it is related and based off the BLM slogan, but with no intent to undermine the movement. We are not even using the poster to push an entire movement, but rather a specific event. We, as students in an academic setting, should be allowed to market our events as we see fit. ” Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742628454.8693824}