{"duration": 0.11406469345092773, "input_args": {"text": "'It was the day before my wedding, and I still didn’t have a dress. In less than 24 hours, family and friends would be gathering to celebrate the occasion, and at this point my “something borrowed” was going to be an entire church outfit. Was I concerned? Not really, and not for long. I decided to throw a Hail Mary at my mom by asking if she would make a skirt to match the $10 top I found. She did. And it was lovely. My wedding dress was just one of many things I wasn’t concerned about. For example, five days earlier (on a Thursday, which also happened to be New Year’s Eve) I was on the phone with the woman who would become my banquet coordinator. The conversation took place about an hour after I was officially engaged (with an $8. 88 Walmart wedding ring purchased that morning) while hiking in the Sedona Verde Valley in Arizona. It went like this: HER (choking cough) “Excuse me? You’re getting married in five days, and you’re just calling me now?” ME “Well, I actually think I’m being quite generous. I just got engaged, and you’re my first call. I figured I should work out some logistics before texting everyone. And no, I’m not pregnant. ” HER “Well this is unusual. How many people are you expecting?” ME “Probably 100. ” HER (cough) “One hundred people with five days’ notice?” ME “People do it for funerals all the time. If I’ve underestimated, we’ll have leftovers. If I overestimated, I’ll just make my family eat last. ” HER “I’m not sure how to process this. O. K. let’s talk about flowers. ” ME “Ha. No, thank you. ” HER “No flowers?” ME “The room is beautiful enough, so I don’t think anyone will notice. Seems wasteful. ” HER “How about tablecloths and napkin colors?” ME “Just whatever is cheapest and most convenient. ” HER “You don’t have colors?” ME “Well, I guess the only suit my fiancé has right now is navy. Plus, he has a pink tie. So I guess we’ll go with that for our wedding colors. Navy and pink. ” HER “Is this a joke?” The entire luncheon was planned in an hour. Because Rob Reading, now my husband, and I knew each other for four years and had been dating for a year, we already knew we wanted to spend eternity together. (We had already met with our bishops for premarriage approval but had not become officially engaged.) And because of my husband’s maritime work and subsequent transfer from London to the Bay Area, along with my working on the legal team for the Little Sisters of the Poor Supreme Court case, we figured we had two options in the moments after his proposal: get married in a week or in a year. We eagerly decided it was   five days to put my theory to the test. Why five days? Long ago, I became convinced that modern weddings were unnecessarily burdensome. My theory: You could plan a beautiful wedding in a week. The second call I made that day in the desert was to my parents (who told me their prayers were answered). The third call that afternoon was to the Salt Lake Temple of the Church of Jesus Christ of   Saints. I wasn’t concerned about getting a slot at the temple because early Tuesday morning isn’t prime time for weddings. It was still Day 1 of planning at this point. I already had my ceremony and reception sites secured. Wedding invitations were soon sent (yes, that day) via text message with a collage of selfies saying: “Would love to have you come if you can make it. No gifts. Just love. ” I called in favors from my best friends to do photos, hair and makeup. I pulled strings to get performers and an M. C. for the event. As I was the last of six children to marry (not to mention my 13 foster siblings) my parents certainly weren’t complaining. In addition, the small farm town that I grew up in  —   more cows than humans  —   was rejoicing that the two of us, in our 30s and 40s, were marrying at all. To be sure, five days’ notice was inconvenient for our guests, and there were a few who could not make it. But whether five days or five years, it would have been inconvenient and there would have been those who would have missed it. And surprisingly, there were only a handful of close friends who couldn’t make it, the same rate as any wedding. And some of the best parts? Total planning time: 26 hours. Total cost: $4, 500. The result, on Jan. 5, 2016, was the perfect wedding day. People said that it couldn’t have been more lovely if we had had a year to plan it. No one noticed that we didn’t have flowers. Or, as my mother, Marilyn, said: “Hallelujah! Hallelujah for putting the relationship above a wedding reception. Hallelujah for not worrying about complicated logistics. And hallelujah for not having enough time to change your mind!” Rob kept saying to me throughout the   planning process, “What do you want me to do?” I told him there really wasn’t a lot that has to be done to plan the wedding, and here’s why: With each social expectation for weddings, I asked myself: “Does this achieve the goal of making the people at my wedding feel loved and appreciated for the role they play in my life? Will it help strengthen my marriage and the promises we made to each other?” If the answer was no, I didn’t waste any more time. I now appreciate applying this to other areas of life. Is where we go to dinner eternally significant? If not, it’s not worth arguing over. Do party favors for the barbecue you’re giving matter? Probably not. Enjoy the path of least resistance. If it truly represents the most important elements of your life and relationship, put time, energy and creativity into it. If not, do yourself a favor and skip the stress. Rob also saw the beauty in our short engagement and the microburst planning period. “The longer it plays out, the longer the nuisance,” he said. “It would have been just an obstacle to starting our life. So why wait?” We may not have a $200 gravy boat, and I may have worn an $8. 88 Walmart wedding ring that eventually turned my finger green, but our flowerless,    wedding set the perfect precedent for married life  —   elegantly simple. Read More: Here’s How She Planned Her Wedding in a Week'"}, "time": 1742564246.0276952}