{"duration": 0.18529486656188965, "input_args": {"text": "'Good morning.  Here’s what you need to know: • Russia vetoed a U. N. Security Council resolution sponsored by the United States, Britain and France which would have condemned last week’s chemical attack in Syria. (China abstained.) The vote reflected how President Trump’s plan to mend ties with Moscow has given way to acrimony. “We may be at an   low in terms of relationship with Russia,” Mr. Trump said, as he met NATO’s secretary general, Jens Stoltenberg, at the White House. President Vladimir Putin sat down with Secretary of State Rex Tillerson at the Kremlin for two hours, despite saying earlier that he would not have time to meet the oil executive. Above, Mr. Tillerson with his Russian counterpart, Sergey Lavrov. _____ • Reports that the Japanese Navy would join a U. S. Navy strike group off the Korean Peninsula added to regional fears of a military strike should North Korea conduct another nuclear test. President Xi Jinping of China took a call from President Trump and urged that the situation be resolved peacefully, CCTV reported, and another   outlet warned the North that China would cut off vital oil supplies in the case of a test. Above, the U. S. aircraft carrier Carl Vinson. _____ • Within the Trump administration, two key figures are on the spot. Stephen Bannon, the chief strategist, appears to be in a   after repeated   with President Trump’s adviser and    Jared Kushner. Mr. Trump has publicly undercut Mr. Bannon, above. Our “Daily” podcast looks at his situation. And Sean Spicer, the White House press secretary, tried to recover from a whopping gaffe, saying his assertion that Hitler, in contrast to the Syrian president, did not use chemical weapons on his people was “inexcusable and reprehensible,” and that the timing  —   during Passover and the Christian Holy Week  —   “compounds that kind of mistake. ” _____ • “No one should ever be mistreated this way. ” That was the chief executive of United Airlines, trying to quell the outcry over a viral video showing a screaming Asian passenger being dragged off an overbooked airplane. But consumers threatened a boycott, lawmakers called for an investigation and, in China, the episode reached more than 770 million views on Sina Weibo. _____ • And let our latest 360 video take you to Bama County, the   longevity capital of China. Eat the   mushrooms. Drink the “longevity water. ” Chat with centenarians and come away feeling hopeful and fresh. Just don’t forget your skepticism: many who are drawn by promises of miracles leave only with disappointment. • The Trump business empire has 157 trademark applications pending in 36 countries, drawing a   lawsuit from a team of constitutional lawyers and ethics lawyers. • Tesla excited investors with its upbeat outlook for delivering a   electric car. Now its chief, Elon Musk, must deliver the goods. • Cathay Pacific, one of Asia’s biggest   airlines, replaced its chief executive officer as it seeks to stem last year’s $74 million loss. • A new ad strategy uses “ ” words in TV commercials to trigger viewers’ smart speakers, like Google Home and Amazon’s Echo. • On the uselessness of job interviews: A management expert argues that recruiters use the process to try to “get to know” people  —   and it doesn’t work. • Coming up: China releases monthly figures for imports, exports and balance of trade. • U. S. stocks were weaker. Here’s a snapshot of global markets. • Iran’s firebrand former president, Mahmoud Ahmadinejad, unexpectedly registered to run in May’s presidential election, a move that could appeal to   who want to curtail accommodations to the West. [The New York Times] • In Italy, the death of a female vineyard worker set off months of   over what the authorities, labor experts and union organizers call an elaborate system of modern slavery. [The New York Times] • Officials with India’s governing Bharatiya Janata Party denounced a member of its youth wing for offering a bounty for the “severed head” of the chief minister of West Bengal state, Mamata Banerjee. [BBC] •  Chinese nationals have been posing as Buddhist monks in Tokyo to prey on foreign tourists, and the Japanese police suspect they are part of a crime ring. [The Asahi Shimbun] • Cassandra Hsiao, a   teenager who grew up in the U. S. is dealing with sudden fame after being accepted by all eight Ivy League schools, as well as Stanford and Johns Hopkins, thanks in part to her essay about learning English as an immigrant. [South China Morning Post] • Is running a part of your morning routine? Good news: It may be extending your life. • Adults who sleep less lose the ability to more effectively ward off ailments. • Recipe of the day: Succulent chicken with mixed mushrooms and cream is as timeless as they come. • Lorde, the New   superstar, is back. Four years after her debut album, the pop prodigy offers “Melodrama,” a testimonial to heartbreak and solitude. •   cats had battle scars. Researchers analyzed tens of thousands of bones retrieved from tar pits to understand the painful price of being a Pleistocene predator. • Finally, if you want to get engaged in Fiji, you’ll be needing a sperm whale tooth. The tabua, as it is known, is associated with good luck and even supernatural powers. Tough whaling laws are making the traditional talismans tough to come by. If you happen to be in Thailand this morning, don’t bother taking a shower: You’ll get soaked anyway as soon as you step outside. Songkran, the water festival that celebrates the Buddhist New Year, officially begins today and continues for several days. In some parts of the country the   has already begun. The celebration, traditionally a time of purification, retains some of its Buddhist beginnings. Many Thais return home for the holiday and observe water cleansing rituals. But the purifying symbol of water has exploded into a countrywide party. People play with water guns and dump buckets of waters from the beds of pickup trucks. Some even bring out the fire hoses. Even last year’s drought couldn’t stop the festivities, though some government officials asked festival goers to downgrade to spray bottles, which befuddled one university student. “Are you kidding me?” said Krit Pongchaiassawin. “I would just get laughed off the street. ” Some Thai traditionalists are worried that the festivities have strayed too far from their origins. This year a government official warned merry makers not to “wear revealing clothes” or dance suggestively. Such transgressions will result in a fine of about $145. Evan Gershkovich contributed reporting. _____ This briefing was prepared for the Asian morning. We also have briefings timed for the Australian, European and American mornings. You can sign up for these and other Times newsletters here. Your Morning Briefing is published weekday mornings and updated online. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742562179.2002604}