{"duration": 0.031617164611816406, "input_args": {"text": "'President Donald Trump announced that the U. S. will help London and the United Kingdom in any way possible in a tweet issued shortly after two new terror incidents hit London on Saturday night. [Trump’s first twitter activity regarding the attack was a retweet of the Drudge Report:  Fears of new terror attack after van ’mows down 20 people’ on London Bridge  …      —   DRUDGE REPORT (@DRUDGE_REPORT) June 3, 2017,  The President went on to add his own commentary on the potential multiple incidents: We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!  —   Donald J. Trump (@realDonaldTrump) June 3, 2017,  Whatever the United States can do to help out in London and the U. K. we will be there  —   WE ARE WITH YOU. GOD BLESS!  —   Donald J. Trump (@realDonaldTrump) June 3, 2017,  Just hours earlier, Trump tweeted out his weekly address, in which he spoke of his first trip abroad as President of the United States and his talks with world leaders about fighting terrorism. #WeeklyAddress🇺🇸 pic. twitter.   —   Donald J. Trump (@realDonaldTrump) June 3, 2017,  Vice President Mike Pence also offered his prayers and thoughts for all affected: Our thoughts  prayers are   the victims, courageous first responders  all the people of London. As President Trump said: WE ARE WITH YOU.  —   Vice President Pence (@VP) June 3, 2017,  The U. S. Embassy in London issued it’s own statement with emergency instructions for U. S. citizens: Emergency message for U. S. Citizens  —   please read + share: https:  .  pic. twitter.   —   U. S. Embassy London (@USAinUK) June 4, 2017,  In March a “knifeman” mowed down pedestrians on Westminster Bridge with his vehicle before ramming into the gates of Britain’s House of Parliament, then stabbing a police officer. London’s Metropolitan Police announced within the hour that they were treating that attack as a “terrorist incident. ” On May 22 an IED was set off at Manchester Arena as an Ariana Grande concert was concluding. Breitbart News previously reported that Europe had seen a terror attack attempted every nine days in 2017 as of May 23. ISIS put out a alert for more truck attacks, calling crowded London streets “ideal targets” in a recent issue of their magazine Rumiyah. “Flatten [ ] under trucks,” it read in part. Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742564291.780875}