{"duration": 0.06327486038208008, "input_args": {"text": "'ELECTION EVE BOMBSHELL : Wikileaks Reveals Analysts at Intelligence Firm Believe Hillary Killed Vince Foster ELECTION EVE BOMBSHELL : Wikileaks Reveals Analysts at Intelligence Firm Believe Hillary Killed Vince Foster Breaking News By Amy Moreno November 7, 2016 \\nWikileaks has cast a harsh light of TRUTH on a dark and disturbed Clinton campaign. \\nHillary’s campaign is comprised of extremely wealthy elites who exist in an avant-garde world filled with bizarre ritualistic practices that play out like a fantastical plot out of a foreign snuff film. \\nFrom pay to play scams designed to make the Clintons wealthy to satanic rituals called Spirit Cooking to accusations of pedophilia and murder – it’s all weaved throughout the Wikileaks email drop like a tapestry of dark and sinister perversion. \\nIn what cold be one the biggest BOMBSHELLS yet, Wikileaks reveals that analysts at an intelligence firm believe that Hillary Clinton had one-time Deputy White House counsel Vince Foster murdered – a rumor that has plagued the Clintons for decades. \\nThe “Ron Brown” referred to in the above email is this man, Secretary of Commerce. \\nNotice the email states that Ron’s assassination had the “earmarks” of Hillary’s “method of disposal…” of a “talkative” secretary of commerce. \\nInteresting choice of words, wouldn’t you say? \\nThat’s what led to the comment regarding Vince Foster’s murder. \\nSome may consider that an “off the cuff” comment. \\nHardly. \\nAnd certainly not happenstance once the totality of the Foster story unfolds. \\nFoster was found dead in Fort Marcy Park, just outside of Washington, D.C., on July 20, 1993. \\nHis death was ruled a suicide, but new documents call “suicide” into question. \\nSerious question. \\nThis recently uncovered evidence suggests Vince Foster did not commit suicide. \\nThe evidence shows that he died of two gunshot wounds to the neck, and not the one wound initially reported. \\nThe flies were discovered in the National Archives and Records Administration. \\nThe injuries on Foster’s neck were not reported in official government documents. \\nAt the time, the FBI said that Foster’s neck injury photos were underexposed and useless. \\nMany people who have studied the case and raised concerns that it was a murder cover up have become targets of Clinton and Clinton associates backlash. \\nBut the facts remain – records indicate Foster didn’t die from one .38 caliber gunshot. \\nHe died from TWO gunshots . \\nFurthermore, the second shot, on right side of his neck was made by a “small caliber” bullet hole. \\nThis raises serious questions about Foster’s motives for suicide. \\nHe was tied to Hillary Clinton’s roles in White House scandals at Whitewater and the White House Travel Office. \\nVince Foster was one of Hillary’s closest friends, and he had intimate knowledge of these two scandals. \\nThe theory is that Vince Foster was murdered to make sure he didn’t tell the world what he knew about President Bill Clinton and his wife, Hillary. \\nHe has a reputation of being too honest, and therefore, many speculate he could no longer be trusted. \\nThis is just ANOTHER scandal in a decades-long history of scams, secrets, and rumors or sinister wrongdoing, unethical actions, and morally corrupt behavior that follows the Clintons. \\nAmerica, for the love of everything HOLY – do not welcome further corruption and degradation into the White House. \\nWe’ve gone decades now placing unscrupulous people in power. \\nIt’s time for REAL CHANGE . \\nIt’s time to out an END TO THE CLINTONS . \\nIt’s time for you and me to come first . \\n#AmericaFrist This is a movement – we are the political OUTSIDERS fighting against the FAILED GLOBAL ESTABLISHMENT! Join the resistance and help us fight to put America First! Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. Share on Pinterest Share No Responses '"}, "time": 1742561806.79983}