{"duration": 0.11918210983276367, "input_args": {"text": "\"  => A tsunami is a natural phenomenon. Mass immigration is government policy. Credit: VDare.com. \\nConservatives are fond of saying, “Being a liberal means never having to say you’re sorry. ” Unfortunately, the same is true of Conservatism Inc. functionaries. They acknowledge conservatives are facing demographic extinction. They admit it is happening because of immigration. But they refuse to listen to the very people who warned them about this. Instead, they will continue skipping towards annihilation and drag the entire country with them. \\nExhibit A: the recent cover story from National Review telling us, once again, how Republicans need to “adapt to a diversifying electorate or lose their influence” [ Can the GOP Overcome Demographic Change in Red States , by Tim Alberta, [ ]November 7 2016]. \\nIncredibly, the hook of the story is the tale of an American couple who used to live in California before fleeing the state. \\nThe state had been overrun, first by immigrants legal and illegal, their cultures and traditions in tow, and then by liberal politicians who seized control of the government by catering to these constituencies and turning their communities into Democratic garrisons. The state became majority-minority in 2001; whites are now 39 percent of its population and dwindling. In turn, the GOP is essentially extinct, representing conservative enclaves around California but irrelevant in statewide elections. \\nThey fled to Arizona, but the same process of ethnic cleansing via mass immigration is underway there as well. So they are supporting Donald Trump in order to stop it. \\nNeedless to say, author Alberta does not sympathize with their solution. \\nBut Trump cannot deliver that; nobody can. The country will soon look very different. And the biggest contributor to that change—the single trend that could propel the GOP toward oblivion—is the ethnic diversification of the electorate. \\nAlberta’s brilliant suggestion: Republicans need to somehow win the votes of the very people this couple is fleeing from! Here's my @NRO cover story on America's demographic transformation and the dire implications for Donald Trump's GOP https://t.co/mMa98v1QLI pic.twitter.com/FYUTOkvcoi \\n— Tim Alberta (@TimAlberta) October 31, 2016 \\nWhat makes this even more amazing is that Alberta acknowledges Republican failure to win a majority of non-white voters anywhere in the country. \\nHe suggests there’s hope for Republicans in Texas. But as Steve Sailer has shown , the strong state identity and white bloc voting suggests Texas is a unique state, and even in this best-case example, Romney only won 37 percent of the Hispanic vote. Alberta also suggests Florida. But here too, it is older Cuban Hispanics who vote Republican, a declining demographic relative to the larger “Latino” community. \\nAlberta blandly blames the GOP for trying to “repel non-whites.” And as an example of someone who is doing the opposite and somehow winning over this demographic, Alberta points to…Paul Ryan! \\nRyan, for example, has toured the nation’s poorest neighborhoods and met with community leaders to craft anti-poverty proposals, and has long been a supporter of comprehensive immigration reform. \\nBut this isn’t a new idea. It’s just another attempt at “Jack Kemp conservatism,” which spectacularly failed to win minority support or even enough white votes . And despite Ryan’s boasting about opposing Prop. 187 , Hispanics don’t support Republicans who favor mass immigration. Even Alberta admits Ronald Reagan’s share of the Hispanic vote actually declined from 37 percent to 30 percent after he passed the nation-destroying 1986 Amnesty. \\nThe central problem is something Alberta doesn’t mention at all, let alone confront. Non-whites do not want conservatism . They have nothing to gain from it. The black middle and upper classes (and its exemplars like Michelle Obama ) are a creation of Affirmative Action. Hispanics favor liberal economic policies by larger margins than they favor more immigration. Arabs are eager to jettison their supposed “white privilege” so they can get government benefits too. \\nAt some point, one of these Beltway Right shills has to show some evidence— any evidence—that babbling about “enterprise zones” or an “opportunity society” actually wins over minority voters. \\nWhy would any of these people want “limited government” when they can get handouts, privileged treatment and tributes to their tribal identities? Why would they want to assimilate to an “American” identity which is fundamentally a creation of European-Americans when they can receive more psychological and financial benefits from claiming they are the victims of racism and “white privilege?” \\nThe demographic death spiral was not necessary. After all, Peter Brimelow warned conservatives ( in National Review!) that it was “ Time To Rethink Immigration ” back in 1992. He and Edwin S. Rubenstein told conservatives “demography is destiny” and broke down exactly what i mmigration would do to the Reagan coalition in their 1997 “ Electing A New People ,” also a National Review cover story (!) . But, as Brimelow noted when VDARE.com reposted the piece in 2000, the response was silence, without anyone even addressing the argument. \\nAs we see from Alberta’s article, the silence continues when it comes to grappling with hard realities. William F. Buckley and the “ movement ” he created “ simply did not have the energy or the courage to adapt to the next generation of issues ” following the election of Ronald Reagan. \\nHowever, that “movement” was not idle when it came to purging the people who understood what was happening. Peter Brimelow , John O’Sullivan , Sam Francis , Patrick J. Buchanan and many others who accurately predicted what was coming were driven out of the Respectable Right. And Conservatism Inc. is left with people who not only won’t, but can’t intelligently interpret what is happening [ The Intellectual Rot at the Heart of the Beltway Right , by Gregory Hood, American Renaissance, April 9, 2016]. \\nAlberta expresses the deluded hope that conservatives can, contra Brimelow’s warning, prevent demographics from becoming destiny. In contrast, despite the silly rhetoric about “Stronger Together,” progressives are refreshingly frank about their desire to use engineered population transfers to ensure liberal hegemony. “Ensure demographics is destiny” is one of the major strategic objectives listed by John Podesta in a memo given to a group of liberal billionaires in late 2007 [ Revealed: Liberal Money’s Longterm Strategy To Control Public Opinion And Secure ‘Advantageous’ Demographics , by Peter Hasson, Daily Caller, November 2, 2016]. \\nPodesta boasts about an “emerging progressive majority” featuring “communities of color.” He confidently describes blacks as the Democrats’ “most reliable voting bloc” but speaks about Latinos in some detail. And, interestingly, he dismisses the mystical “ Bush won 44 percent of the Hispanic vote” poll which many Beltway Right operatives evidently still believe . \\nConsidered a swing group by many analysts, Latinos appear to have become much more Democratic over the Bush years. In the 2004 election, it was initially reported that they gave Bush 44 percent of their vote. However, the exit poll is now widely acknowledged to have been flawed and the generally accepted estimate is that Kerry carried Hispanics 58 percent compared to Bush’s 40 percent… Latino support for the Democrats appeared to go up substantially in 2006, with the group as a whole favoring Democrats by a 69 to 30 percent margin. The rapid increase in demographic importance of Latinos will continue for decades. \\nWhat can Conservatism Inc. do in response? Winning over minority voters with Paul Ryan-style strategies isn’t something that has never been tried: it has already been tried, and it failed. \\nBut this demographic change is not a natural process. It’s the result of deliberate government policies and could be easily reversed. Even Mitt Romney acknowledged this with his fleeting reference to “self-deportation.” If conservatives want to save their movement, and the country, they need to change the demographic facts on the ground. \\nOf course, this is much harder than stopping America from becoming majority minority to begin with. But Conservatism Inc. wouldn’t listen. Now it has a much more serious challenge to deal with—one which will remain no matter how much wishful thinking Beltway hacks engage in. Still, acknowledging you have a problem is a first step towards solving it. \\nPerhaps at this late hour Conservatism Inc. could try heeding the warnings, and the proposed solutions, of those they cast into the outer darkness. If they don’t, conservatives, and the country, will face extinction. And they will have no one to blame but themselves. \\nA word to National Review . Don’t call it a grave. It’s the future you chose. \\nJames Kirkpatrick [ him ] is a Beltway veteran and a refugee from Conservatism Inc. (Reprinted from VDare.com by permission of author or representative)\""}, "time": 1742564315.102874}