{"duration": 0.11513113975524902, "input_args": {"text": "'Sports play as an escape from real world negativity. Unfortunately, the sports and political worlds collide quite a bit recently. [Whatever your political persuasion, the actual game on Super Bowl Sunday should prove fun to watch. Neither the cast of the Mike   musical Hamilton singing “America the Beautiful” pregame nor   Lady Gaga performing the halftime show, or commercials with political agendas, can ruin a game, featuring two great quarterbacks, New England’s Tom Brady and Atlanta’s Matt Ryan.  Let’s take a closer look at the football game, which likely plays as a nice   escape from political football. One of the great   in this contest features Ryan against a superb Patriots secondary: cornerbacks Malcolm Butler and Logan Ryan, along with safeties Devin McCourty and Patrick Chung. They all play on a high level. However, the Patriots’ secondary faces a Herculian challenge against the Falcons’ coterie of   weapons, led by wide receiver Julio Jones, who averaged more than 100 receiving yards a game this season. If you take away Jones, Ryan happily targets other talented wideouts such as Mo Sanu or speedy Taylor Gabriel, or perhaps one of three talented tight ends. “As a defensive coordinator, you really have to pick your poison, and decide what you want to take away,” Jones said. And the poison includes a tailback tandem that can hurt you running and receiving. Atlanta’s dynamic duo of Davonta Freeman and Tevin Coleman combined for 2, 482 yards and 24 touchdowns this season. This pair of powerful runners are passing game weapons as well, combining for 85 receptions and 883 yards. The Patriots aren’t easy to run against with a cornucopia of talented, massive defensive linemen such as Alan Branch and Malcolm Brown. “They have big heavy guys up front that are ” said Falcons center Alex Mack. And Mack, Atlanta’s outstanding center, isn’t healthy. He’s dealing with a painful left fibula injury, and will probably need a Toradol shot to get through the game. “I’m concerned,” Falcons coach Dan Quinn said about Mack. “I’m not panicked, but I’m concerned. ” With a   quarterback and a coterie of weapons, the Falcons certainly shouldn’t struggle scoring, but they can score enough? Can they keep up with the Brady? While Atlanta’s defense has improved from early in the season, it’s still not an elite unit. In their regular season finale, a   win over New Orleans, Saints QB Drew Brees threw for 350 yards, wide receiver Michael Thomas snagged 10 catches for 156 yards and tailback Mark Ingram rushed for 102 yards. After watching this tape, Brady likely chomps at the bit. The Falcons start three defensive rookies  —   safety Keanu Neal and linebackers De’Vondre Campbell and Deion Jones. They also feature a rookie nickel back, Brian Poole, who plays a lot. Brady is superb at manipulating defenders with his eyes  —   throwing them off the trail of where he intends to throw. Rookies are particularly vulnerable to this chicanery. Expect Brady to target these rookies. “Brady is going to find out what the kids know,” said SiriusXM NFL Radio analyst Pat Kirwan. “I would expect him to [go after the rookies],” said Neal. “I would expect him to go to a guy that doesn’t have as much as experience as others. ” Neal embraces the challenge. “Bring it on,” Neal said. “I’m not scared. ” Be careful what you wish for. Brady, looking for his fifth Super Bowl victory, is coming off a virtuoso performance vs. Pittsburgh in the AFC Championship Game, throwing for 384 yards and three touchdowns. At 39, Brady is still at the top of his game, and wants to play six more years. “You combine his competitiveness, his preparation, his accuracy and his toughness with his memory, you’ve got the best quarterback to ever play,” Houston Texans coach Bill O’Brien, a former Patriots assistant, told the Boston Herald. A good way to mess with Brady is with interior pressure. “The best way to disrupt [his] rhythm has always been pressuring Brady from the center of the pocket,” Falcons coach Dan Quinn said. “Many times, when [pressure] comes from the edge he’s able to step up and find an extra [second] worth of time to find a free receiver. ” And blitzing Brady a lot isn’t a good idea. “There isn’t a blitz I haven’t seen,” said Brady, a   NFL starting QB. The New York Giants beat him in a pair of Super Bowls (2007 and 2011) without blitzing. They relied on their front four to pressure him, allowing them to drop seven guys into coverage. “When you can affect him with a   rush, it’s absolutely pivotal for our defense,” said Falcons defensive tackle Tyson Jackson. “You can drop more in coverage. ” Plus, if you blitz, you aren’t likely to get there the Patriots allowed only 24 sacks in the regular season. Aside from Brady’s greatness, another problem for the Falcons  —   they are sans their top cornerback Desmond Trufant, on injured reserve. “[The Falcons] will lose, if their defense isn’t good enough,” said retired coach Dick Vermeil. It probably isn’t. The pick here is New England.'"}, "time": 1742562310.9877312}