{"duration": 0.06360197067260742, "input_args": {"text": "'Aaron Bandler November 11, 2016 \\nPresident-elect Donald Trump. That is still a term that is surreal to a lot of people, as he was not expected to win on Tuesday. What were the driving factors that propelled Trump to the presidency? How was he able to pull off such a stunning upset? \\nHere are seven reasons why Trump won. \\n1. Hillary Clinton was unable to get the minority vote to turn out for her. Last night, Dems were calling the race a \"Whitelash\" -- wrong. Mitt won 59% of white vote, Trump won 58%. Minority voters didn\\'t turn out. — David French (@DavidAFrench) November 9, 2016 \\nIn fact, Trump was able to get a larger share of the minority vote than Mitt Romney did in 2012, as the Daily Wire has explained : \\nUnsurprisingly, Trump lost to Clinton in the Latino and black votes by margins of 88 percent to 8 percent and 65 percent and 29 percent, respectively. Surprisingly, this was better than Romney fared among the aforementioned demographics in 2012, as he lost both groups by margins of 93 percent to 7 percent and 71 percent to 27 percent, respectively \\nMichael Barone has noted that \"turnout fell in heavily black Philadelphia, Cleveland, Detroit, and Milwaukee. Millennial generation turnout was tepid, and Trump carried white Millennials by 5 points.\" \\nThe enthusiasm was just not there for Clinton. \\n2. Trump was able to pull in former Obama voters. According to the Washington Post , Trump was able to win over one-third of the 700 counties that went for Obama twice. Clinton was only able to win six of the 2,200 counties that didn\\'t go for Obama. Trump was better at obtaining crossover voters than Clinton was. \\nSo who are these former Obama voters who voted for Trump in 2016, and what caused them to switch? \\n3. These former Obama voters felt that Trump cared about them, and the Democrat Party did not. John Daniel Davidson explains in The Federalist that Clinton and the Democrat Party took the blue-collar, working class whites in the Rust Belt for granted–exemplified by Clinton\\'s pledge \"to put a lot of coal miners and coal companies out of business\"–and it was to their detriment. The Rust Belt has been in economic decline for years, but it has suffered greatly from the Obama administration\\'s regulations towards coal. \\nWhile the Democrats wrote off the Rust Belt, Trump actually acknowledged their struggles, and that was all it took. \\n\"Trump was the first national political figure in generations who saw them, acknowledged that they have been left behind, that their cities and towns are in a state of persistent decline, and promised to help out somehow,\" writes Davidson. \"When you’re used to being dismissed as bitter folks who cling to guns and religion, as President Obama did in 2008, or denounced as \\'deplorables\\' and \\'irredeemable,\\' as Hillary Clinton did during this election, respect goes a long way—even if there are no easy solutions, from Washington or anywhere else, to the problems that plague your town.\" \\n4. The FBI re-opening its investigation into Hillary\\'s emails helped Trump. Per RedState , author Ed Klein said on the Steve Malzberg Show that Clinton was sobbing \"inconsolably\" on election night and was blaming FBI director James Comey re-opening the investigation as well as Obama for not stopping the investigation as to why she lost. \\nThere\\'s no question that the re-opening of the investigation did considerably help Trump, as the polls severely tightened after the announcement. Poll numbers showed that the vast majority of Americans felt that Hillary was acting in an immoral manner. The spotlight was off of Trump\\'s vulgar comments towards women and his sexual assault accusers, and instead the focus was on Clinton\\'s private email server. But Clinton is leaving out one major person who is responsible for her loss... \\n5. Hillary was a terrible candidate. If Clinton had been elected president, she would have been the first elected president to have been the subject of numerous FBI investigations. She broke the law by using her private email server to conduct official State Department business and there was a lot of quid pro quo that occurred at the Clinton Foundation . Clinton is robotic and devoid of charisma with a record in politics that is short of accomplishments but rich in failure, sleaze, and corruption. Basically, Clinton is \"an Obama Democrat without Obama\\'s charm,\" according to Jonah Goldberg . \\nShe may have been the only Democratic candidate that could lose to Trump, and the Democrats wanted to coronate her from the beginning. They have no one to blame but themselves for President Trump. \\n6. The public no longer has any faith in the media–and that includes late-night comics. Will Rahn wrote at CBS News that the \"unbearable smugness\" of the Clinton-biased media was off-putting to a lot of voters, as they sneered at Trump supporters as stupid backward hicks while doing everything they could to prop up Clinton. Trump\\'s vitriol toward the press ended up benefiting him politically. Poll numbers reflect this, as trust in the media has declined over the years. Rahn explains: \\nJournalists increasingly don’t even believe in the possibility of reasoned disagreement, and as such ascribe cynical motives to those who think about things a different way. We see this in the ongoing veneration of “facts,” the ones peddled by explainer websites and data journalists who believe themselves to be curiously post-ideological. \\nThat the explainers and data journalists so frequently get things hilariously wrong never invites the soul-searching you’d think it would. Instead, it all just somehow leads us to more smugness, more meanness, more certainty from the reporters and pundits. Faced with defeat, we retreat further into our bubble, assumptions left unchecked. No, it’s the voters who are wrong. \\nAs a direct result, we get it wrong with greater frequency. Out on the road, we forget to ask the right questions. We can’t even imagine the right question. We go into assignments too certain that what we find will serve to justify our biases. The public’s estimation of the press declines even further -- fewer than one-in-three Americans trust the press, per Gallup -- which starts the cycle anew. \\nThe same applies to late-night comics. Mollie Hemingway writes in The Federalist that Jon Stewart is partly responsible for the election of Trump because of how he single-handedly destroyed CNN\\'s Crossfire, resulting in \"a new age of hyper-political, hyper-liberal late-night comedy.\" Stewart\\'s The Daily Show spawned Stephen Colbert, John Oliver, Trevor Noah and several other lefty comics that perverted comedy into smarmy left-wing political lectures talking down to conservatives. \\n\"Jon Stewart is known for brutally deriding a show that featured people of differing views civilly discussing issues of the day,\" writes Hemingway. \"He got that show killed and significantly strengthened the world where cultural elites engaged in groupthink mockery of those with whom they disagree. The results include a further erosion of civility, a decrease in Americans’ ability to understand each other and their concerns, and, of all things, President-elect Donald Trump.\" \\nWhich all culminates into the main reason why Trump was elected... \\n7. Americans are tired of being trashed by leftist elites. Ben Shapiro explains : \\nTrump won because many Americans were sick of being told that they were the racists as Barack Obama and his Department of Justice stoked race riots in major cities around the country. \\nTrump won because many Americans were sick of watching other Americans being destroyed for their supposed intolerance – for their religious beliefs, for their unwillingness to label women men and men women, for their support for traditional marriage or conservative political candidates. \\nTrump won because many Americans were tired of the media’s constant harping on America’s flaws – we were supposedly sexist, racist, and homophobic. Americans said that they did not believe the media, and they were right to do so. \\nIn other words, the left has been tearing down America as a country infested with intolerant, prejudicial bigots who are incapable of thinking for themselves and needed to rely on them on how to live their lives. The people finally had had enough, so they elected the man whom they felt best stuck it to the leftist elites. Tags '"}, "time": 1742628463.2868254}