{"duration": 0.2835400104522705, "input_args": {"text": "'Nikki Haskell has packed many lives into her 75 years. She has been a real estate broker, a party planner, a pioneering stockbroker, a cult   host, a Studio 54 regular, a diet and fitness guru, and a socialite. Through it all, she has depended on her brains, her enthusiasm and her skill as a social connector to power her through the tough times. But now she is facing what may be the most difficult challenge of her life: maintaining her position in the social hierarchies of liberal New York and Los Angeles while serving as a cheerleader for one of her oldest friends, Donald J. Trump, whom she first encountered in 1974 at Le Club, a defunct   nightspot on East 55th Street in Manhattan. Ms. Haskell said she had a wonderful time at the     dinner held for Mr. Trump at Union Station in Washington on Jan. 19. But over the weekend, in a   suite at the Mandarin Oriental, she seemed to be wavering a little. Glued to the television on the morning of Jan. 22, she watched the coverage of the women’s marches in various cities across the country, as well as footage from the more raucous demonstrations of Jan. 20, during which protesters smashed windows, set a limousine on fire and clashed with the police not far from the Mandarin Oriental. After watching this stuff all day on many different channels, Ms. Haskell thought an uprising might be underway. “You see what’s going on in the streets, all these people rioting, all these women?” she said in a phone conversation. “Nothing ever happened like this. They never had these riots  —   every street, every city, all across the world. When there’s crowds and craziness like this, you never know what’ll happen. It’s horrifying. ” Given what she was seeing on television and in her social media feeds, she was worried that her vocal support for the new president would make her a pariah. “I can’t be the only person in the whole world defending Donald Trump,” she said. “I’ll be walking down the street, they’ll attack me. I don’t want to be attacked. This is totally out of control. I’m afraid to walk down the streets in New York or L. A. I’m trying to get a television show on the air, which will never happen in this environment. I’ll never have another friend. Nobody’s going to speak to me. ” When Ms. Haskell was a girl growing up on Lake Shore Drive in Chicago, her father bought her six horses, and she wore custom riding suits, with white wing collars and high silk hats, in shows across the Midwest. At night, her parents took her to the Chicago nightclub Chez Paris, where she became besotted with show business while taking in performances by Milton Berle, Jimmy Durante, Carmen Miranda and Mae West. Not long after the family moved to Beverly Hills, Calif. when Ms. Haskell was 13, her father died of a heart attack and her mother went to work. Ms. Haskell soldiered on. At Beverly Hills High School, she was head cheerleader and was voted “Biggest Flirt” in her senior year. In the Los Angeles of the 1960s, she won a twist contest judged by Bob Hope and Joan Collins. She dated Tony Bennett and hung out with Frankie Avalon, Fabian and George Hamilton. She married a real estate developer, Jack Haskell. After divorcing him, she said, she parlayed the $18, 000 settlement into a small fortune on the stock market. She remarried Mr. Haskell in 1966, moved with him to 470 Park Avenue in New York and divorced him again in 1968. She got her apartment in Manhattan, took classes in investing and was hired at Burnham and Company (which would later become Drexel Burnham). For 10 years, she was a stockbroker by day (and one of the few women working on Wall Street) and a constant presence at Manhattan restaurants and clubs by night. She was equally at ease dining at Elaine’s or judging a Blueboy magazine beauty pageant in the meatpacking district. She joked that she lived at Studio 54. She made friends with Rick James, Imelda Marcos, Andy Warhol and the Village People. She hit her stride with “The Nikki Haskell Show,” a charmingly   program on the New York   stations Channel J and Channel 10. In the 1980s, she was the forerunner of a YouTube star, and her guests included Michael Caine, Divine, Timothy Leary, Sophia Loren, Diana Ross, Arnold Schwarzenegger, Peter Sellers and Peter Ustinov. And Mr. Trump. New York magazine called her the “Queen of Comp” for her habit of scoring freebies in exchange for positive publicity. Spy magazine, less charmed by her social climbing, likened her to Pia Zadora. In the past three decades, she has been a staple at parties and benefits. She has also remade herself as an entrepreneur in the diet and fitness industry as the creator of StarCaps diet pills, which got her in trouble with federal authorities in 2014, because its supposedly “natural” ingredients included the drug bumetanide. Ms. Haskell was fined $60, 000, The Daily News reported. (Ms. Haskell put the figure at $70, 000.) She also sells the Star Cruncher, a piece of exercise equipment, through Groupon  —   “a gym in a bag,” she calls it. A longtime Democrat, she faced a dilemma last year when Mr. Trump’s campaign for the Republican presidential nomination began to take off. “I’m sort of in a quandary,” she said in her Upper East Side apartment last April, “because nothing would make me happier in the whole world than to see Hillary Clinton as president. I never thought that in my lifetime we would have a woman president, and I’ve always been very supportive of the Clintons. I’m a registered Democrat, but I vote across party lines and would never have voted for anyone else except for Hillary, if it wasn’t for the fact that Donald’s running. ” One reason she was leaning toward Mr. Trump was her belief that people were not ready for a female president. “The way things are throughout the world, men just don’t respect women enough,” Ms. Haskell said. “At this time a president being a woman might be detrimental. I hate to say that, but we live in a very, very antiwoman society. ” In September, Ms. Haskell came out as a public Trump supporter when she was interviewed for a Politico Magazine article headlined “The Real Trumpettes of Bel Air,” in which she said of Mrs. Clinton’s aide Huma Abedin, “I don’t think we should have a Muslim in power, someone working for the president. ” After it appeared, Ms. Haskell noticed a change in her social position on both coasts. “That’s when it all started,” she said. “It was a disaster. ” On election night, she went to a dinner in New York hosted by an entertainment mogul and was the only person there who admitted to voting for Mr. Trump, she said. Around 3 a. m. Ms. Haskell logged on to Facebook and posted: “How great, America wins. We love President Donald J. Trump. ” “You must be senile,” one of her followers replied. “U ought to be ashamed,” another wrote. On Nov. 10, she made a selfie video in the back of a New York City taxi and posted it on Facebook. “It’s up to us to do our part to make America great,” she said. “Whether you like Donald Trump or not, now is the time to become a better America. ” Before signing off with her customary goodbye (“ ! ”) she reminded everyone to watch her old public access shows  —   now available on Amazon Prime  —   a few of which showed her interviewing Mr. Trump when he was a mogul on the rise. Friends distanced themselves from Ms. Haskell, she said, and one bestie dropped her after 25 years of friendship. “I was actually in tears when someone told me they didn’t want to be my friend anymore because I supported Donald Trump,” she said. But Ms. Haskell refused to stop cheerleading. She made another video of herself while riding in a car down Park Avenue during the time of the frequent demonstrations near Trump Tower and the Trump International Hotel and Tower on Columbus Circle. After expressing frustration with the marches and protests (“stupid,” she called them) she said into her iPhone: “Donald Trump is not going away, and people are going to have to smack their kids around and sit them down and tell them to stop acting like jerks. And to be Americans and get with the program. See you later.  !” In December, the writer Kevin Sessums was fed up with her   posts on Facebook. The last straw was Ms. Haskell’s posting her 1982 public access interview with Roy Cohn, the mentor to Mr. Trump who served as Senator Joseph McCarthy’s counsel during the   hearings in 1954. “As if that were a glamorous, wonderful bit of footage,” Mr. Sessums posted. A later thread taking aim at Ms. Haskell grew to more than 100 comments. Over the holidays, she visited the California home of the movie producer Robert Evans, who wrote about Ms. Haskell in his 2013 memoir, “The Fat Lady Sang. ” He said he had no sympathy for those who have dropped her because of her support for the president. “I love her for it,” Mr. Evans said. “By losing Nikki’s friendship, they’re the losers. But she is a winner. ” On the afternoon of Jan. 19 at the Mandarin Oriental suite, which she was sharing with her friend, the   and philanthropist Kelly Day, Ms. Haskell started getting ready for the   dinner at Union Station for Mr. Trump’s donors and family members. “Donald always had big ideas, big dreams, and I was always fascinated with that,” she said while doing her eyelashes. She recalled first seeing him at Le Club. “He was really handsome, a hot guy, and he caught my eye immediately,” she said. “He was very captivating, even in a discothèque at night. ” Several months later, Mr. Cohn invited her to dinner at “21” and seated her next to Mr. Trump. “We clicked right away,” she said. The first night he took a Czech fashion model named Ivana Zelnickova out on the town, Ms. Haskell, along with her date, met up with them at Elaine’s. “Ivana and I became friends like that,” she said. “And when Studio 54 opened in 1977, I went with Donald and Ivana. ” As Ms Haskell and Ms. Day left the suite, Ms. Haskell spoke of her increasing number of  . “It takes a lot to make me cry,” she said, putting on a golden sable coat. “I have no children. I have a fabulous brother, nieces and nephews, but I’m a woman alone of 75 years old, and I find it just so disheartening. ” At Union Station, once through the metal detectors, Ms. Haskell smiled for the paparazzi. Her table was next to those occupied by Trump family members. After a speech by the   Ms. Haskell chatted a while with Melania, Ivanka and Tiffany Trump. “I can’t believe we’re here,” Tiffany told her. As waiters cleared away the main course (roasted branzino) she got up. “I supported Donald when no one supported him,” Ms. Haskell said on her way to the powder room. “One of the family just said to me, ‘It wouldn’t have happened if it wasn’t for you.’ Well, I don’t know if that’s necessarily true. But I really believe in Donald. ” She walked by Jose Fanjul, the sugar baron, and Christine Hearst Schwarzman, the wife of the billionaire Stephen A. Schwarzman. “You know why it’s a great party?” Ms. Haskell said. “Because everybody here loves Donald. ” After dessert (vanilla meringue cake) she seemed to feel better about those   of hers. “They’ll get over it,” she said. “If they don’t, they don’t. ” A protester was scowling at guests leaving the party. “He makes America ashamed!” the woman said. Waiting for an Uber, Ms. Haskell rhapsodized about the spectacular crystal, the silverware, the gold charger plates, the tablecloths, the decorations. At the lobby bar of the Mandarin Oriental, she ordered a Grey Goose orange vodka with club soda and a slice of orange (a “ ”) and said she hadn’t been offended by any of the remarks made by Mr. Trump, even those captured on the   Billy Bush tape. “Listen, Donald has more respect for women than anyone I know,” she said. “I’m not saying he’s not a guy. Guys talk about girls. They talk about getting them into bed. But it’s just guy talk. ” She remembered the interviews she did with him. “And now they’re all on Amazon Prime,” she said. “The history of what I’ve done will live on forever. ” Back in the suite, Ms. Haskell and Ms. Day ordered room service and didn’t call it quits until around 4:30 a. m. Later, they watched the inauguration together in their bathrobes. On Sunday, while watching the women’s protests on television, Ms. Haskell said she might ease up on the cheerleading until things settled down. “I’m just one little person,” she said. “I’m not Kellyanne Conway. ” She got dressed and made it to Reagan National Airport. “I’m never going to march,” she said on the phone, after clearing through security. “Yes, it worked in the Vietnam War and things like that, but that was a different time. I would have no problem going to Congress, and because I have this close friendship with the Trump family, I will use this opportunity to better all the things for women. Because that’s exactly how I feel. ” While still counting herself a Trump supporter, Ms. Haskell has indeed eased up with the Facebook posts in favor of the president since the inauguration weekend. “You know, I’m running out of friends and I got tired of all the negativity,” she said on Wednesday. “People were busting my chops and I lost a couple of very close friends, which I think is actually quite insane and pathetic, to think that people who are these lifelong friends are not speaking to me because I voted for Donald Trump. ” But lately she has taken pains to post nonincendiary material. “Just to show you how things have changed,” Ms. Haskell said, “the other day I posted myself going to the grocery store. That was a first. ”'"}, "time": 1742564300.6357622}