{"duration": 0.16384530067443848, "input_args": {"text": "'MAWLAMYINE, Myanmar  —   The scene would have been unlikely a year ago. Tens of thousands of demonstrators filled the streets to protest a decision by Daw Aung San Suu Kyi’s government to name a new bridge for her father. “Recognize the will of the local ethnic people,” protesters chanted last month as they marched along the waterfront of this historic city in southern Myanmar. Ms. Aung San Suu Kyi, a Nobel Peace Prize laureate once celebrated as a champion of democracy, was insulting the Mon people, the dominant ethnic group in the area, protest leaders said, by naming the bridge for a Burmese leader infamous here for steamrollering over their rights. “This is not a democratic process,” said Min Zarni Oo, general secretary of the Mon Youth Forum. “This is a big issue for the local people. The government doesn’t value ethnic diversity. ” No one expected governing to be easy for Ms. Aung San Suu Kyi, who became the country’s de facto leader a year ago after her party won a landslide election that ended more than a   of military rule. Even so, her first year has been a disappointment to many. She made it a top priority to end the   ethnic insurgencies that have torn the country apart, but her anemic peace effort has proved fruitless so far, and fighting between government forces and ethnic groups has increased. The world has been shocked by reports that the military has carried out atrocities, including rape and murder, against the Rohingya, a Muslim minority in western Myanmar, but Ms. Aung San Suu Kyi has said little on the matter and done even less. Her government’s growing suppression of speech on the internet seems perverse for a onetime democracy icon who spent 15 years under house arrest. Among the public, patience is wearing thin. “She doesn’t have support like before,” said Zar Zar Oo, 31, a vendor selling bottled water at the Yangon train station. “We loved her so much before, but it seems like she doesn’t do enough for us. For now, we are in trouble. ” In a televised speech to the nation commemorating her first year in office, Ms. Aung San Suu Kyi struck a defensive note, acknowledging her government’s lack of progress and saying people could choose another leader if they were unhappy with her. “If you think I am not good enough for our country and our people, if someone or some organization can do better than us, we are ready to step down,” she said. Some voters apparently listened. In parliamentary   last weekend, her National League for Democracy won only nine of 19 seats. Ms. Aung San Suu Kyi, 71, cites building roads as one of her biggest accomplishments. The party spokesman Win Htein said her government had doubled spending on health care and education, though he provided no details. And the economy has continued to grow as the country emerges from isolation under military rule. But Richard Horsey, a political analyst and former United Nations official, said that the growth had slowed and that foreign investment had dipped significantly. Washington’s lifting of economic sanctions last year has yet to translate into stronger trade, investment or job creation, he said. “Aung San Suu Kyi’s administration has not offered any compelling economic vision,” he said. In Yangon, people are waiting for Ms. Aung San Suu Kyi to deliver results, said Myat Suu Mon, 28, a department store clerk. The cost of taking the   bus to work has doubled, she said, while her pay has remained the same. “Support is less than before because people’s expectations were too high,” she said. “But in reality we don’t see things changing here. ” Zaw Htay, Ms. Aung San Suu Kyi’s spokesman, acknowledged that progress had been slow but said the government faced complex problems, such as ethnic conflicts and clashes with the Rohingya, that had been years in the making. “It’s very complicated,” he said in an interview. “We are not magicians. ” Indeed, Ms. Aung San Suu Kyi faces daunting challenges. In rebuilding the country, she must overcome decades of mismanagement and profiteering by previous military governments that enriched the generals and their cronies and brought the economy to its knees. Though her party has a strong majority in Parliament, it is hamstrung by a   arrangement dictated by the   Constitution, which gives the military control of key ministries and enough seats in Parliament to block any constitutional amendment. Ms. Aung San Suu Kyi is barred by the Constitution from serving as president because her children are foreigners, a prohibition she circumvented by creating the office of state counselor for herself and declaring that the president would report to her. She also named herself foreign minister. Supporters say her ability to get along with the military is a significant accomplishment. But critics suggest she suffers from Stockholm syndrome, becoming too cozy with her former captors. Moreover, they say, her imperious approach alienates potential allies and contributes to the country’s growing crises. “She’s Mary Poppins without a sense of humor,” said David Scott Mathieson, an independent analyst. “She has a schoolmarmish way where instructions are given and obedience is observed. She takes that approach with government, and it is highly misplaced. Politics is compromise. ” She rarely takes questions from the news media or speaks out on major issues. Her office declined a request for an interview for this article. Perhaps most disheartening to many of her longtime supporters has been her record on human rights. While she released dozens of political prisoners held by the former regime and repealed laws used to suppress political dissent, she left in place a law that is increasingly used to stifle criticism of public officials. Under the telecommunications act, defaming someone online is punishable by three years in prison. Anyone can bring a case, and suspects can be held without bail while they await trial. The previous government, which adopted the law in 2013, used it only seven times. In the year since Ms. Aung San Suu Kyi took office, 47 cases have been brought, according to Maung Saungkha, who was once imprisoned under the law and now tracks its use. In one case, two media executives were jailed after posting comments on Facebook questioning why a government official was wearing an expensive watch. Five cases have been brought by supporters of Ms. Aung San Suu Kyi against people they claim defamed her, Mr. Maung said. “Without freedom of expression, there won’t be democracy,” he said. “If the government wants national reconciliation, this kind of law has to be discarded. ” Mr. Win, the party spokesman, said Parliament would amend the law in its next session. “Don’t worry about this,” he said. “We will solve this problem. ” The biggest stain on Ms. Aung San Suu Kyi’s record may be her government’s brutal treatment of the Rohingya, and her tepid response to it. In recent months, government soldiers have been accused of widespread killing and rape of Rohingya in Rakhine State. A United Nations report concluded in February that the army and police had slaughtered hundreds of men, women and children   women and girls and forced as many as 90, 000 people from their homes. The deadly crackdown, which the government says was a response to attacks on police posts by Rohingya insurgents, has been roundly criticized by human rights groups, the United Nations, Pope Francis and even 13 of Ms. Aung San Suu Kyi’s fellow Nobel laureates, who wrote a letter calling it “a human tragedy amounting to ethnic cleansing and crimes against humanity. ” Although Ms. Aung San Suu Kyi has no direct control over the military, she has played down the reports of atrocities and stood by the military. “I don’t think there is ethnic cleansing going on,” she said in a rare interview with the BBC last week. “I think ethnic cleansing is too strong an expression to use for what is happening. ” She did appoint a commission led by Kofi Annan, the former United Nations secretary general, to examine conditions in Rakhine, but reviewing the military’s conduct was not part of its mandate. “Entire villages were razed,” said Matthew Smith, director of the group Fortify Rights. “Children were thrown into fires. Suu Kyi’s denials and failure to provide a shred of moral leadership to deal with the situation is a really damning revelation of her character. ” Ms. Aung San Suu Kyi has said her most important goal is negotiating peace with armed ethnic groups, and in August, she convened a peace conference with great fanfare to resolve the conflicts in northern Myanmar. But the meeting produced no   agreements, and analysts say there is more fighting now in that part of the country than there has been in many years. The blowback over the   in Mon State, seen here as more evidence that the government is out of touch with the concerns of ethnic minorities, should have been easier to avoid. Mr. Zaw, Ms. Aung San Suu Kyi’s spokesman, said senior party leaders had been warned that naming the bridge for her father, Gen. Aung San, would turn the population against them. They went ahead anyway, and last weekend it cost them the parliamentary seat in Chaungzon, the township across the bridge from Mawlamyine. “It was a mistake to name this bridge,” Mr. Zaw said. “It is a good lesson for N. L. D. leaders. ”'"}, "time": 1742563281.1348562}