{"duration": 0.23760223388671875, "input_args": {"text": "'MARFA, Tex.  —   On a   night, a few dozen people clustered near one end of the Lost Horse Saloon here: a small video crew, some Texas locals and tourists including visitors from New York City like me. Deer heads and skulls gazed down from the walls a sign announced “Open Mic Night. ” Seated in the tiny stage area were the two singers and lyricists of the xx  —   Romy Madley Croft and Oliver Sim  —   while Jamie Smith (a. k. a. Jamie xx) the band’s programmer, keyboardist and main producer, looked on from nearby. It was the first performance by the xx since 2014, and a Texas saloon made an unlikely comeback locale for a British band whose melancholy songs tend to conjure dark, lonely London flats or very late nights in club chill rooms. With downcast glances, as Ms. Madley Croft plucked an acoustic guitar, the duo sang the love song “Islands,” from the band’s   2009 debut album, and the clingy breakup song “On Hold,” the first single from its third album, “I See You,” due on Jan. 13. A stealthy,    way return made sense for a band that grew out of whispery songs recorded at home but has gathered a worldwide following. From the beginning, the xx bridged the       ethic of   the electronic underpinnings of dance music and an intuitive sense of pop songwriting that’s succinct, emotionally open and general enough to feel universal. It has turned out to be a durable, expandable, widely admired hybrid: dark and arty yet grounded in the pop basics, eager to communicate. The xx has already sold out a week of British theater dates in March, is booked as a headliner at Lollapalooza festivals in Brazil, Chile and Argentina and was welcomed as a guest on “Saturday Night Live” almost immediately after “On Hold” was released in November. It was precisely the fragility and reticence of the xx, on the debut album they made as teenagers, that brought the band a rapidly expanding following  —   one that grew further with its more polished but still skeletal second album in 2012, “Coexist. ” Mr. Sim and Ms. Madley Croft, playing   parts on bass and guitar backed by keyboard notes and samples from Mr. Smith, sang in smoky murmurs, like hushed dialogues or shared secrets: songs of isolation, longing and intimate tension. In the years between albums, the band’s signature sound  —   a moody voice in   over just a few instruments, with the barest hint of a dance beat  —   made its way into big pop hits like Hailee Steinfeld’s “Love Myself” and the Chainsmokers’ “Don’t Let Me Down” (though the xx’s habitual restraint doesn’t extend to the choruses). Even in its absence, the xx had an impact. Yet it’s impossible for the xx to return to teenage naïveté. And sticking too closely to its established ways would have made it feel like a “parody band of ourselves,” Mr. Sim said. “What makes us sound like us has been a combination of mistakes and just our personalities and what’s part of us. That definitely was the case on the first one. So trying to hang onto that consciously just doesn’t work. ” The challenge for the new album was how a band with growing clout, influence and experience could still conjure private emotions. “The band came from such an unambitious place,” Mr. Sim said. “But it’s slowly become something where we do have a lot of drive  —   we do have a lot of ambition now. ” The band’s solution was both clear and complicated: Work on the sounds, unblock the feelings and abandon   rules. “I See You” inevitably scales up the sound of the xx, openly courting a wider audience, but its songs still ring true. The video the band shot for “On Hold” in Marfa, where it did some of the first recording sessions for the new album at a cozy local studio, captured it in a new mode: clowning under the Texas sun, with band members riding shopping carts and skateboards, and Mr. Smith D. J. ing a house party for high schoolers. But the core of the xx  —   an endearing insecurity  —   hasn’t disappeared. Over a breakfast of huevos rancheros the morning after the show, the band admitted to renewed stage fright. “Last night  —   that felt scarier than Radio City,” Mr. Sim said. Together, the band members came across as thoughtful, courteous and unified. Ms. Madley Croft was relatively voluble, and Mr. Smith almost entirely   Mr. Sim genially, patiently measured his words. They never interrupted one another. Ms. Madley Croft compared the saloon performance to the awkward club shows at the 2009 CMJ Music Marathon in New York that brought the xx its first buzz in the United States. Back then, they stood stiffly by their instruments in near darkness, barely acknowledging the audience. When the band started, the xx imposed its own strictures. To stay personal, Ms. Madley Croft and Mr. Sim would each sing only lyrics they had written themselves. They also avoided, as they still do, specifics like place names or gendered pronouns  —   using you and I, not he and she  —   “so you can fit it into your own life and imagine yourself within it,” Ms. Madley Croft said. And even on a recording, an xx song could only have the parts that could be played onstage. “We never set out to be a minimal band,” she said. “We just couldn’t play our instruments very well. ” But with “I See You,” the xx upended its old methods. They recorded outside the familiarity of London (though they eventually returned there) in Marfa, Los Angeles and Reykjavik, Iceland  —   places with sunshine and   landscapes. And they fanned out for projects on their own. Mr. Sim appeared in fashion videos for Dior Homme. Mr. Smith stepped up his sideline as a D. J. remixer and producer, touring widely and releasing an album of his own in 2015, “In Colour,” that included the other xx members among many guest vocalists. He bought his first real synthesizer  —   a   Oberheim that supplies many of the swooping sounds in “On Hold”  —   after using for so long cheap keyboards, samplers and software sounds. Making music outside the xx also put Mr. Smith in serious recording studios for the first time in a career of laptop recordings. “It made me realize that I love working in   and I love working with my best friends  —   that is how I make the best music,” he said. “But also that I need to put myself out there to occasionally just   me and to realize how lucky I am. ” In Los Angeles, where as an Englishwoman Ms. Madley Croft had the guilty pleasure of “sunny skies in November,” she got invited to songwriting camps: brief, intense,    collaborations organized to generate hits. She was eager to learn the methods of pop pros. “I just was craving it. I knew it was going to be terrifying and quite outside of what I’ve done before, and I really enjoyed it,” she said. At one session, with the producers Ryan Tedder and Benny Blanco, she recorded a guitar part that came to define a song by OneRepublic, “Fingertips. ” A collaboration with the producer Rick Nowels led back to Jamie xx it yielded a song, “Ecstasy,” that ended up providing a verse for “Loud Places,” a track she sings on “In Colour. ” In an email, Mr. Nowels wrote: “Romy is a wonderful, natural singer and songwriter. She’s a strong intuitive musician which informs her songwriting. Her voice has a quiet intelligence. She writes lyrics from a personal and soulful place. She’s one of the few guitarists these days who has an instantly recognizable style  —   that’s almost impossible to achieve. She played through my little amp with some reverb, and there was that sound!” The camps, Ms. Madley Croft said, “taught me to trust my instincts. Everybody moves so quickly, works so quickly, that it’s kind of like oiling up your joints. But I was not quite pouring out my soul in that music. So I was really happy to come back with the boys and just get really cathartic again. ” But they were working differently this time. Mr. Sim and Ms. Madley Croft sometimes worked together, trading melodies and bits of lyrics, as in the songwriting camps, and no longer worrying who wrote what. Mr. Smith channeled some of his D. J. expertise into the new songs  —   although, he said, “It still sounds like there’s space compared to what you hear on the radio these days. ” And instead of staying cloistered, the band took some of its new songs on the road in 2014, playing small gigs around the South. The band’s early reticence was no pose. Mr. Sim and Ms. Madley Cross, both 27, met at the musically oriented Elliott School in the London suburb of Putney and wrote songs, at first, just for themselves. “We didn’t think anybody was going to hear them,” she said. “They were like a diary for us. But then people connected with that. ” They were so uncertain about their lyrics and singing, she added, that even while they were making their first album they exchanged lyrics by email, not in person. By then the xx also included two fellow students: Mr. Smith, 28, and the guitarist Baria Qureshi, who left after the xx’s first album. The band’s   limitations gave the xx a distinct sound, full of spaces and silences that drew listeners in. The xx’s quiet desolation had precedents in British pop, like Everything But the Girl and Young Marble Giants, but the xx also had its own dynamic there was drama in each pause. It was possible to hear the songs as a couple’s questions, confessions, quarrels and reconciliations, but the two singers were not romantically involved both are gay. “I’ve always been really up for being quite raw and emotional in music,” Ms. Madley Croft said. “I guess that was my outlet before I could have the confidence to be like that in life. ” The band’s growing audience, particularly after its debut won the Mercury Prize as the best album of 2009, made them only more  . When making “Coexist,” Mr. Sim recalled, “There was a lot of thinking of: ‘What do people like about us? What have people picked up on? What makes us us?’ We really tried to cling to that, and it was quite limiting. Our   was: ‘We’re going to shut ourselves away. We’re not going to play anything to anybody.’ And it was really insular, and it was tough. ” The culmination of their 2014 tour was a series of performances at the Manchester Festival in England and then at the Park Avenue Armory in New York. The shows, two or three each day for just 45 people at a time, were as much about architectural proportion as about music. The staging started out closely confined, with stylized movements for the band eventually, walls fell away to expose a huge open space. The xx could have been summing up its career trajectory, from tiny rooms to cavernous ones. The songs on “I See You” no longer insist on the austere minimalism of the band’s first two albums. The sonic palette has vastly expanded there are a few solid dance beats, some plush echoes of the Beach Boys, some resonant and ghostly synthesizer tones, even a sample of Hall  Oates in “On Hold. ” The frailty and tension of the xx’s past catalog remain “Here come my insecurities,” Ms. Madley Croft sings in “Say Something Loving,” which is far from the album’s only song to mention fear. But there are also new glimmers of confidence. At times, Mr. Sim said, the new album is “celebratory  —   it’s not all ‘Woe is me. ’” He paused  —   it is, after all, an xx album  —   and added, dryly, “Of course, given what we’ve done before, my version of celebratory is pretty different from somebody else’s. ” The album opens with “Dangerous,” which revels, tentatively but firmly, in taking a chance on a relationship it has a brisk, danceable beat, though a warning siren wails in the background. But there are also songs like “Performance,” a tearful ballad about putting a brave face on heartbreak, and “A Violent Noise,” an introvert’s nightmare of clubbing. The album concludes with “Test Me,” an eerie, drumless ballad about a relationship at a breaking point Ms. Madley Croft admitted that she wrote it about the friendships in the band. Over all, no one is likely to mistake “I See You” for a party album. After   the new songs, the trio radically reconsidered them, rewriting and sometimes dismantling them almost completely. “We were definitely in the   that we would just try everything, and we did,” Mr. Smith said. “And we made some terrible music in the process. I’ve got a hard drive full of stuff that’s never going to get heard. A lot of it was learning to realize that the first thing that you’ve done is by far the best, but having to take every possible route before you get back to that. ” Before leaving Marfa, the xx took me on a bicycle tour of the local landmarks, from the town center out to the Chinati Foundation, Donald Judd’s monument of minimalism. It was 80 degrees and cloudless under the desert sun. And it was easy to identify the pensive English rock band. They were, as usual, dressed entirely in black.'"}, "time": 1742564299.3152401}