{"duration": 0.11007952690124512, "input_args": {"text": "'Why American Surrogates Are in Demand for Chinese Families Kalee Thompson, Hollywood Reporter, November 4, 2016 \\nThe first time Dianna Barindelli carried a baby that wasn’t her own was in 2012. “We were done having kids, but I still wanted to be pregnant,” says the Modesto, Calif., stay-at-home mom, whose own daughters are 6 and 9. Barindelli signed up with the Center for Surrogate Parenting in Encino, one of the most exclusive surrogacy agencies in the world. In 2014, she matched with a Chinese couple. Unlike many agencies, CSP first shows parent applications to the surrogates, rather than the other way around. “It’s little things that you’ll connect with people over,” says Barindelli, who was attracted to pictures of the couple’s extended travels and their traditional wedding photos. \\nThe embryo transfer took place in late 2014. Barindelli emailed the mom weekly, sending updates and ultrasound pictures with WeChat, an app that offers instantaneous translation. The intended parents (IPs) planned to be there for the birth, but the baby boy arrived two weeks early, 24 hours before they arrived. Says Barindelli: “I texted and made sure [the mom] was OK with him staying in my room. I cleared everything with her. I didn’t want her to feel bad that she wasn’t there.” \\nBarindelli, who used her surrogacy fees to set up a college fund for her girls, is pregnant again, this time with the baby, due Feb. 1, of a Taiwanese couple. She may not be done: Her first Chinese couple emailed her recently, soon after their son’s first birthday. They still have frozen embryos and hope that Barindelli, now 40, will carry their second child. \\nCommercial surrogacy is banned in most parts of the world, as well as in many U.S. states. Until recently, infertile couples, singles and gay would-be dads had a handful of options to turn to when it came to finding a surrogate, among them India, Thailand, Nepal and Mexico, where surrogacy services have cost a quarter of the $100,000 to $200,000 bill typical in the U.S. But in the past few years, those countries have started enforcing laws banning international surrogacy. Meanwhile, China–the world’s most populous country, with a growing wealthy elite and where some doctors believe infertility is more common than in the U.S.–lifted its decades-long one-child policy. The result is a soaring Chinese demand for U.S. surrogacy services, one that is flourishing particularly in California, with its culturally friendly enclaves, excellent physicians and favorable state laws that regard IPs as a baby’s legal parents even before birth, if proper court documents are filed. {snip} \\n{snip} Despite CSP’s Southern California location, 51 percent of its clients now are foreigners, up from 15 percent a decade ago. Rival agency Growing Generations (clients have included Sarah Jessica Parker and 30 Rock director Todd Holland) also sees half of its clients coming from overseas, as does Gifted Journeys, a boutique agency in Pasadena. At San Diego’s Expect Miracles Surrogacy, international clients account for 80 percent of IPs. And of foreigners participating in this permutation of California’s birth tourism, the number of Chinese IPs is growing the fastest, making up the most common single foreign nationality for many agencies right now. \\n{snip} \\nMost local agencies have a mix of Caucasian, Latina and African-American surrogates. “I can’t think of a time when we’ve had an Asian surrogate,” says Growing Generations’ Bergman. Multiple agency heads say Chinese IPs tend to strongly prefer a Caucasian surrogate. “People really have this fantasy because of a lot of the marketing that was done in China,” says Gifted Journey’s Wilson-Miller. “They have this picture of blond surrogates who look like movie stars carrying the baby with their traditional families.” {snip} \\nThe concept of cross-race surrogacy can confound friends, family and associates of surrogates and IPs alike. In August, comedian GloZell Green, who is African-American, and her husband, also African-American, had a baby girl via a surrogate. “Our surrogate is a blue-eyed blonde,” the YouTube star told potential IPs gathered in a Culver City hotel in early October. People in her life “kept asking if the baby was going to be white.” \\nSurrogate selection aside, California has the added allure of numerous enclaves where families can be surrounded by Chinese speakers and businesses. “People from China can stay in Irvine, for example, and they have Chinese TV on their cable packages. Throughout California there are places they can go and shop and find stuff in Chinese. If they go to Kansas or Oklahoma? It’s total culture shock,” says Expect Miracles’ Anderson. {snip} \\nOf course, any baby born via surrogate in the U.S. has birthright citizenship. “The Chinese couples really like that because a lot of them want to come back and forth,” says Molly O’Brien, a fertility lawyer with offices in Torrance who frequently travels to China to participate in information sessions for would-be parents, often sponsored by doctors offices or assisted-reproduction agencies. “Maybe they eventually want that child to be able to go to college here.” Unlike the U.S., China forbids dual citizenship, and most American-born Chinese babies remain U.S. citizens. “Most Chinese couples just keep that American passport. It’s only if you want to use the government services that you’ve got to be Chinese,” says CSP’s Synesiou. \\n{snip}'"}, "time": 1742564587.169741}