{"duration": 0.07635116577148438, "input_args": {"text": "'At New Year’s Eve celebrations in Dortmund a mob of more than 1, 000 men chanted ‘Allahu Akhbar’ launched fireworks at police, and set fire to a historic church. [Already by 7 pm a man was hospitalised with   burns to his face and hands after fireworks were hurled at a group of homeless people outside the city’s main train station. More than two dozen people were injured at festivities in Dortmund, some seriously.  The events of the night were described as “quiet” by police in a statement, and as “normal” by a spokesman for the city government. But at 11:30pm police announced they were adding to their already much larger than usual presence in the city centre for New Year, sending in further reinforcements of officers. This came after the force reported there being a “large number of young men from North Africa” in town, with federal police officer Volker Stall noting there was an “aggressive mood” towards the public and police. At midnight, the situation threatened to escalate. A livewire published by the Ruhr Nachrichten reported that a crowd of “at least 1, 000 young men” began throwing fireworks into crowds of visitors, which also included families with children. Asked by officers to stop, the mob turned to pelt fireworks at police instead. Despite the prohibition of lighting pyrotechnics near churches, firemen had to intervene after fireworks were launched at St Reinolds, Germany’s oldest church, setting the roof alight. Also reported by the Ruhr Nachrichten was that “a group of Syrians sang in celebration of the ceasefire in Syria. ” However, a video posted to Twitter by one of the newspaper’s reporters, paired with the caption “Syrians celebrate the truce in their country” shows a group of men chanting ‘Allahu Akhbar’ around the flag of   and Islamic State collaborators, the ‘Free Syrian Army’. #Silvester in #Dortmund: Syrer feiern den Waffenstillstand in ihrem Land. pic. twitter.   —   Peter Bandermann (@RN_Bandermann) December 31, 2016,  There was uproar in Germany last month when St Reinold’s Church was occupied by identitarians in protest against the Islamisation of Germany. The demonstration was denounced as a “clear provocation by  ” by Dortmund pastor Friedrich Stiller. Dortmund’s ‘Special Commissioner for Tolerance and Democracy’ demanded more taxpayers’ money be put towards “Comeback” the city’s ‘  deradicalisation programme’ in the wake of the protest. “The money the city gives, 50, 000 euros per year, is no longer enough,” Hartmut   said. UPDATE: Since publication this article has not been edited, but Breitbart London has endured an attack from the German political establishment as well as the legacy media, alleging that substantive facts in this piece are to be considered “fake news”. Our    has responded to these false claims here. Correction: This article states St. Reinold’s Church is the oldest in Germany. We are happy to clarify that accolade belongs to the Trier Cathedral. Breitbart News stands by all other substantive facts in this article.'"}, "time": 1742564528.507451}