{"duration": 0.11808633804321289, "input_args": {"text": "'LOS ANGELES  —   Oscar voters showered the   “La La Land” with 14 nominations on Tuesday, a tie with “Titanic” and “All About Eve” for the most in Academy Award history. But the academy also moved past two #OscarsSoWhite years by honoring six black actors  —   a record  —   and including diverse films like “Moonlight,” “Fences” and “Hidden Figures” in the best picture race. [ The list of nominees | Where to stream them | Nominees react | Who got snubbed?] “It makes me feel good to see such a multifaceted group of people get recognized,” said Barry Jenkins, the director of “Moonlight,” which received eight nominations. Speaking by phone from Amsterdam, where he was promoting the film, he added, “It’s an affirmation that film has the power to erode barriers and reveal what makes us all human. ” Nine movies, most of them cobbled together outside the studio system, will compete for Hollywood’s top prize. Filling out the best picture race are “Arrival,” a   thriller the    drama “Hell or High Water” “Manchester by the Sea,” about a mournful New England handyman the subtitled   “Lion” and “Hacksaw Ridge,” Mel Gibson’s true story of World War II heroism. In a surprise, Mr. Gibson also drew a nomination as best director, officially ending his   status as a Hollywood pariah for his offscreen behavior. Joining him in the directing field were Damien Chazelle (“La La Land”) Denis Villeneuve (“Arrival”) Mr. Jenkins (“Moonlight”) and Kenneth Lonergan (“Manchester by the Sea”). Perhaps the biggest upset happened in the best actress category. “Arrival” emerged as one of the most honored films, with support in eight categories, but its star, Amy Adams, failed to receive a nod for best actress. Even worse, a website managed by the Academy of Motion Picture Arts and Sciences and ABC, which broadcasts the Oscars, initially listed her as a nominee. ABC took the blame, citing a rush to post names. “We apologize to the academy, press and fans for any confusion,” the network said in a statement. ABC also mistakenly named Tom Hanks as a best actor candidate for “Sully. ” In excluding Ms. Adams, whose performance has been honored by numerous other awards groups, academy voters backed Isabelle Huppert from the French film “Elle,” Emma Stone from “La La Land,” Natalie Portman from “Jackie,” Meryl Streep from “Florence Foster Jenkins” and the newcomer Ruth Negga from “Loving. ” It was Ms. Streep’s 20th career nomination her speech about Donald J. Trump at the Golden Globes probably won her some votes. (She reacted to her inclusion by releasing a happy dance GIF.) Several other legends were snubbed. Voters refused to throw Martin Scorsese’s   bomb “Silence” a lifeline, offering a lone nod for cinematography. And Clint Eastwood’s “Sully” had to make do with one nomination, for sound editing. Once again, the academy stubbornly refused to bow toward popular movies the   “Deadpool” received nothing, even in    categories. As expected  —   and despite renewed attention on   lawsuits that he settled in 2010  —   Casey Affleck, the star of “Manchester by the Sea,” continued his march toward the Oscar podium. He will vie for best actor alongside Denzel Washington (“Fences”) Andrew Garfield (“Hacksaw Ridge”) Ryan Gosling (“La La Land”) and Viggo Mortensen (“Captain Fantastic”). In a sharp contrast to the previous two years, when the academy put forward   rosters of acting nominees, voters chose the largest number of black candidates ever. Mahershala Ali and Naomie Harris each received a nod for their supporting work in “Moonlight,” a poetic drama about a young black man in Miami. Viola Davis (“Fences”) and Octavia Spencer (“Hidden Figures”) were also nominated for supporting actress. Joining Ms. Negga in the lead categories was Mr. Washington of “Fences,” an adaptation of August Wilson’s classic play about black life in 1950s Pittsburgh. Another minority actor, Dev Patel, was nominated for his supporting role in “Lion,” which received six nominations in total, tying “Manchester by the Sea” and “Hacksaw Ridge. ” And four of the five honored documentaries came from black filmmakers, including “13th,” Ava DuVernay’s searing look at race and mass incarceration in America, and “I Am Not Your Negro,” directed by Raoul Peck, a portrait of the writer James Baldwin and the   era. (The others in that race are “Fire at Sea,” “Life, Animated” and the   “O. J.: Made in America,” which paves the way for TV documentaries given limited theatrical release to be nominees.) Pundits will inevitably declare that the academy listened to the #OscarsSoWhite protests that found the Rev. Al Sharpton berating Hollywood in a preceremony rally last year. The academy made drastic membership changes in 2016, revoking the voting privileges of   members and inviting more women and minorities to join. (The   group remains overwhelmingly white and male, however.) Public pressure may have been a factor in the outcome on Tuesday, but the results almost assuredly have more to do with the vagaries of moviemaking: a full slate of   movies with diverse casts that coalesced in the past year. Still, race continues to be a   topic around the Oscars. Last week, one academy voter, Santiago Pozo, voiced brewing discontent among Latinos, writing in the trade publication Deadline. com that underrepresentation of other minorities in Hollywood  —   not just black actors  —   is “a terminal illness for our business and for the relevance of the Academy Awards. ” The Los Angeles Times weighed in with a similar editorial on Tuesday, noting that there were almost no Hispanic nominees. One exception:   Miranda received a nod for his original “Moana” song “How Far I’ll Go,” putting him one step closer to the rarefied club known as EGOT: those who have won an Emmy, Grammy, Oscar and Tony. (Mr. Miranda, a   Oscar nominee, already has an Emmy, two Grammys and three Tonys.) Among companies, Amazon was a big winner on Tuesday, beating Netflix to become the first streaming service to earn an Academy Award nomination for best picture. Amazon bought “Manchester by the Sea” at last year’s Sundance Film Festival. With 26, Lionsgate received the most nominations of any studio its contenders include “La La Land” and “Hell or High Water,” a partnership with CBS Films. The Oscars will be broadcast on Feb. 26. Jimmy Kimmel, who anchors ABC’s   programming block, will host. The academy entrusted its previous ceremony to the producers Reginald Hudlin and David Hill, who brought in Chris Rock to scold Hollywood on diversity and created a    scrawl in an   attempt to make acceptance speeches more interesting. Ratings dropped, and ABC, which charges more than $2 million for a   commercial, moved to take a firmer hand in this year’s telecast.'"}, "time": 1742561945.5122454}