{"duration": 0.10641312599182129, "input_args": {"text": "'110913 Views October 30, 2016 KWN PLUS , TRENDING King World News FOR DIRECTIONS ON HOW TO PLAY OR DOWNLOAD AUDIOS: CLICK HERE Nomi Prins: Keynote speaker who just addressed the Federal Reserve, IMF and the World Bank – Nomi is a renowned journalist, author and speaker. Her latest book, All the Presidents’ Bankers, is a groundbreaking narrative about the relationships of presidents to key bankers over the past century and how they impacted domestic and foreign policy. She was also on a Federal Reserve Advisory Council . Nomi is on the advisory board of the whistle-blowing organization ExposeFacts, and a board member of the animal welfare and wildlife conservation group, Born Free USA. She has also appeared on numerous international and national media. Nomi Prins is a renowned journalist, author and speaker. Her latest book, All the Presidents’ Bankers, is a groundbreaking narrative about the relationships of presidents to key bankers over the past century and how they impacted domestic and foreign policy. To buy Nomi Prins’ new book “ All the Presidents’ Bankers: The Hidden Alliances that Drive American Power “ CLICK HERE or ON THE BOOK Nomi Prins: Keynote speaker who just addressed the Federal Reserve, IMF and the World Bank – Economic signals are everywhere, from magazine covers to grocery stores to military events. They reveal the story of the world economy. Central bankers have done their best to conjure forth inflation in the hopes that this will vanquish deflation but the risk is that our daily lives, and the sustainability of governments, will be affected by an ongoing battle between these two forces. There will be important consequences. Quantitative Easing is now catching people in a vice by pushing up their cost of living even as their income is still falling. This breaks the vital social contracts between citizens and their governments and sets in motion many seemingly unrelated outcomes: social unrest in emerging markets, the movement of manufacturing and jobs back to the US and the West, improvements to the value added of emerging market firms, higher food and energy prices. The rising price, but shrinking size, of a steak, a candy bar and an apartment not only cause pain at home, they also propel some nations to deploy their militaries to secure resources and protect their citizens from the ill effects of inflation and deflation alike. This is already resulting in military confrontations, incidents and near misses between American, Chinese and Russian planes, warships and submarines. The solution is growth and innovation. Luckily, anonymous individuals are balancing their hubris against the risk of failure and proceeding to build a more dynamic economy and the new social contracts that will exist tomorrow. The only question is whether governments are hostile or hospitable to these efforts. By being alert to the many signals around us anyone can better navigate through the turbulence to the treasures of the world economy instead of being continuously overwhelmed and surprised by it. \\nAll the Presidents’ Bankers: The Hidden Alliances that Drive American Power – Who rules America? \\nAll the Presidents’ Bankers is a groundbreaking narrative of how an elite group of men transformed the American economy and government, dictated foreign and domestic policy, and shaped world history. \\nCulled from original presidential archival documents, All the Presidents’ Bankers delivers an explosive account of the hundred-year interdependence between the White House and Wall Street that transcends a simple analysis of money driving politics—or greed driving bankers. \\nPrins ushers us into the intimate world of exclusive clubs, vacation spots, and Ivy League universities that binds presidents and financiers. She unravels the multi-generational blood, intermarriage, and protégé relationships that have confined national influence to a privileged cluster of people. These families and individuals recycle their power through elected office and private channels in Washington, DC. \\nAll the Presidents’ Bankers sheds new light on pivotal historic events—such as why, after the Panic of 1907, America’s dominant bankers convened to fashion the Federal Reserve System; how J. P. Morgan’s ambitions motivated President Wilson during World War I; how Chase and National City Bank chairmen worked secretly with President Roosevelt to rescue capitalism during the Great Depression while J.P. Morgan Jr. invited Roosevelt’s son yachting; and how American financiers collaborated with President Truman to construct the World Bank and IMF after World War II. \\nPrins divulges how, through the Cold War and Vietnam era, presidents and bankers pushed America’s superpower status and expansion abroad, while promoting broadly democratic values and social welfare at home. But from the 1970s, Wall Street’s rush to secure Middle East oil profits altered the nature of political-financial alliances. Bankers’ profit motive trumped heritage and allegiance to public service, while presidents lost control over the economy—as was dramatically evident in the financial crisis of 2008. \\nThis unprecedented history of American power illuminates how the same financiers retained their authoritative position through history, swaying presidents regardless of party affiliation. All the Presidents’ Bankers explores the alarming global repercussions of a system lacking barriers between public office and private power. Prins leaves us with an ominous choice: either we break the alliances of the power elite, or they will break us. About author'"}, "time": 1742561977.1297047}