{"duration": 0.09971904754638672, "input_args": {"text": "\"Share on Facebook Every parents worries about the infectious childhood illness that sweep through classrooms and after-school programs this time of year. Most kids get their inoculations early on to avoid old-fashioned diseases like mumps and rubella that used to effect huge swathes of children every year. Even better, there's now an annual flu shot for tackling one of the winter's most contagious illnesses — even Ellen knows how important it is to get your flu shot! Still, some diseases are proving harder to tackle than others. One of the most resistant is hand-foot-and-mouth disease, which still affects about 200,000 Americans in the USA every year. This year, experts at the West Central Health District in Georgia warn that it could be a record-breaking year for the disease, which is already causing outbreaks among school kids and college students. Scroll through below to learn more about the disease, and what you can do to head it off. Hnad-foot-and-mouth disease — or HFMD for short — is an incredibly common ailment that affects hundred of thousands of people every single year. Part of the reason it's so very common? It's highly contagious, and can spread easily from contact with saliva or mucus. In other words, you can't get it from simply being in the same room as someone with the infection, but you can get it from a sneeze, a kiss, or a handshake. That's part of the reason it runs rampant in kindergartens and preschools, where the kids tend to be grabby with one another, and are usually a little bit covered in spit and snot. It also spread quickly on college campuses, where food and drinks are shared frequently, and students tend to be overtired and not at peak physical health. Senior citizens or folks with weakened immune systems are also vulnerable, especially if they live communally, like in a nursing home. Of course, even a perfectly healthy adult in the prime of life can get this disease; it all depends on what germs you're exposed to. Fortunately, the symptoms are unpleasant, but usually mild and not life-threatening. They include flu-like symptoms, like fever and sore throat, but HFMD is most characterized by the itchy red spots that appear on — you guessed it — your hands, feet, and mouth. Sores may sometimes also appear on the legs and genitals. The virus looks alarming, especially if you're sporting spots, but fortunately it usually clears up on its own within a week or two. Still, if you suspect you or another member of your family has the disease, go to the doctor straight away. Because it's so contagious, this illness usually requires you to stay home until the virus is fully out of your system, to keep it from spreading to other folks in your community. Though the symptoms of the virus are usually mild, there can be serious side effects, especially in people with weakened immune systems from another illness or from age. In some rare cases, HFMD can lead to serious brain infections like meningitis and encephalitis. More commonly, kids who don't shake the symptoms for a few weeks may lose some of their fingernails or toenails. According to the CDC , outbreaks of HFMD are not common in the USA, but that might be changing this year. A large outbreak has been sweeping through Georgia, and may affect the wider South Eastern US, and could even spread to other regions of the country. If you happen to live in an area affected by this year's HFMD outbreak, it's important to be extremely vigilant about hygiene practices. To keep this illness away from your family, make sure everyone is washing their hands after leaving the bathroom, and before touching any food. If you suspect HFMD, make sure to keep your kiddos home from school until they have been cleared by a doctor. If you or someone you know does contract the illness, the best treatment is rest and plenty of fluids, even if the sores make swallowing a little painful. Watch the video below to learn more about hand-foot-and-mouth disease, and don't forget to SHARE to help prevent the spread of disease this year! Related:\""}, "time": 1742563197.6717684}