{"duration": 0.09719538688659668, "input_args": {"text": "'Continuing to treat a victory over Senator Bernie Sanders as a fait accompli, Hillary Clinton on Sunday questioned Donald J. Trump’s business record and assailed his ideas, warning that the coming weeks represented a critical period in which, if left unchallenged, Mr. Trump could “normalize himself” as he seeks to broaden his support. But Mr. Sanders pointed to polls showing Mrs. Clinton with dangerously high percentages of people who have unfavorable views of her and asked whether a choice between her and Mr. Trump in the fall would force voters to pick the “lesser of two evils. ” Even as she contends with Mr. Sanders’s unflagging critique from the left, Mrs. Clinton said it was vital for her to pivot to confront Mr. Trump now, lest he successfully repackage himself for wider consumption, rather than appealing to the Republican primary electorate alone. “I do not want Americans and, you know,   Republicans, as well as Democrats and independents, to start to believe that this is a normal candidacy,” Mrs. Clinton said of Mr. Trump’s campaign on NBC’s “Meet the Press. ” “I know he has a plurality of Republicans who have voted for him,” she added. “But I think in the course of this campaign, we are going to demonstrate he has no ideas. There’s no evidence he has any ideas about making America great, as he advertises. He seems to be particularly focused on making himself appear great. And as we go through this campaign, we’re going to be demonstrating the hollowness of his rhetoric. ” Mrs. Clinton also poked at Mr. Trump’s failure to release his tax returns. Told that Mark Cuban, the media executive and owner of the Dallas Mavericks, had expressed interest in being her running mate, Mrs. Clinton said she was “absolutely” open to considering business leaders, not just elected officials. “Businesspeople, especially successful businesspeople, who are really successful  —   as opposed to pretend successful  —   I think, have a lot to offer,” said Mrs. Clinton, whose campaign has begun taunting Mr. Trump with a #PoorDonald hashtag on Twitter, suggesting that he is not nearly as wealthy as he claims. Mr. Trump has cited an audit by the Internal Revenue Service as his reason for keeping his tax returns private. “We’ve got to get below the hype,” Mrs. Clinton said. “I think we’re beginning to find out, but I don’t think we know enough, and that’s why he should release his tax returns. ” In choosing a running mate, Mrs. Clinton said she would seek, above all, someone prepared to be president and “someone you can work with  —   someone you believe will be a good partner. ” Mrs. Clinton’s intense focus on Mr. Trump came as a new ABC   Post poll showed the two    among registered voters in a general election matchup, after Mrs. Clinton had led by nine percentage points in March. Voters have widely unfavorable opinions of both candidates: 53 percent expressed such a view about Mrs. Clinton and 60 percent about Mr. Trump. Mr. Sanders, however, vowed on Sunday to fight all the way to the Democratic convention in July, pointing to polls that indicated he would fare better against Mr. Trump than Mrs. Clinton would. In several television interviews, he complained that Democratic superdelegates had thrown their support to Mrs. Clinton before he had even entered the race. “I ask those superdelegates to take a look at which candidate is the stronger to defeat Donald Trump,” Mr. Sanders said on ABC’s “This Week. ” “I don’t want to see the American people voting for the lesser of two evils. ” When the host George Stephanopoulos followed up by asking if he saw Mrs. Clinton as “the lesser of two evils,” Mr. Sanders backed away slightly. “Well, if you look at  —   no, I wouldn’t describe it, but that’s what the American people are saying,” he said, citing her unfavorable ratings. Mr. Sanders and Mrs. Clinton will be campaigning hard in California, which holds its primary on June 7. In Vista, Calif. on Sunday, Mr. Sanders told a cheering crowd that he was the strongest Democratic candidate to defeat Mr. Trump and that he hoped to have 50 percent of the total pledged delegates by the end of voting. He also stressed that his campaign had more “enthusiasm” and “energy” than his rival’s. “Our vision of social justice, of economic justice, of racial justice and of environmental justice  —   our vision is the future of this country,” Mr. Sanders said. “And I hope the leadership of the Democratic Party understands it must be the vision of the Democratic Party. ” Mrs. Clinton drew criticism from some Democrats and Republicans recently after telling voters she would put her husband, former President Bill Clinton, “in charge of revitalizing the economy” and job creation. On Sunday, she clarified her intentions, saying his role would be advisory, not ministerial. “I am going to ask my husband, who has a great track record in creating jobs, putting people back to work, revitalizing communities, to be in an advisory role working with me, working with our cabinet, to try to figure out what we can do” in particularly   areas, Mrs. Clinton said on NBC. “You know, every first lady has taken on special projects. ”'"}, "time": 1742564466.2898943}