{"duration": 0.22934579849243164, "input_args": {"text": "'Andrew Korybko \\nThere’s a lot of talk in the Balkans about what sort of a leader Trump will be and how his foreign policy will impact on the region. Although he was only just elected last week and still has over two months to go before officially coming to power, it’s already possible to make some predictions in attempting to answer those questions. Greeks In Government \\nThe strongest indication yet about what Trump’s Balkan policy may look like comes from the appointment of Reince Priebus as his Chief of Staff. This prestigious and high-profile position will be occupied by a Greek Orthodox believer who was born to a Greek mother, so it can confidently be inferred that he has a strong sense of Greek identity which obviously plays to the Republic of Macedonia’s disadvantage vis-à-vis the name issue and other matters of mutual discord. The second factor playing in Greece’s favor is the fact that Stephen K. Bannon was appointed at the same time as Trump’s Chief Strategist. This is important because Bannon used to run the wildly successful alternative media outlet Breitbart just prior to taking on his mid-summer responsibilities as the CEO of Trump’s campaign. One of the most popular writers on the site is Milo Yiannopoulos, an outspoken homosexual of Greek descent and someone who is not at all expected to be friendly to Macedonia or its culture of conservative values. Given Breitbart’s closeness to the Trump Administration, writers such as Milo might exert a disproportionate influence on the President’s policy formulation. Soros And Macedonia \\nNeither Priebus, Bannon, nor Yiannopoulos are good for Macedonia, but on the other hand, the Trump team’s antipathy to Color Revolution financier George Soros is well known and could play to the country’s advantage. It’s too early to tell, but with Soros practically declaring war on Trump and reorienting his focus towards the US and away from other parts of the world (at least for now), there’s a chance that the NGO-driven Color Revolution tumult of approximately the last two years might finally be over for some time. It’s also possible that Trump and his “deep state” (the military, intelligence, and diplomatic bureaucracies) might even defeat Soros and remove him from power, thus rendering his networks null and void for some time. \\nIn such a case, this wouldn’t necessarily mean the end of NGO-driven Hybrid War , but just that someone else might be tasked by the administration to replace him and take over his worldwide network. The visible change that this could produce would be that the message that future “Soros”-connected organizations propagate in trying to gain more regime change recruits could decisively shift from the “far left” to the “far right”, especially if Trump’s CIA realizes that it’s a lot more effective to use this sort of narrative in exploiting the palpable zeitgeist than stubbornly sticking with a discredited and proven failure from the past. It’s still too early to tell if this will happen or not, but the scenario isn’t improbable and should at the very least be countenanced by all Macedonians seeking to predict the course of American policy towards their country. \\nIf one accounts for the influence that Greeks will have on the Trump Presidency and acknowledge that Soros might very well end up on the losing side in his War on Trump, then it’s possible to forecast that the new American leader probably won’t budge on the name issue, yet won’t be as predisposed to resort to the same type of asymmetrical aggressions against Macedonia as his predecessor did. In short, Trump would be more reasonable than Obama, though he would still lean towards Greece if forced to choose. This is very relevant in terms of the bigger Balkan picture because it’s likely that the businessman will engage in his trademark deal-making in trying to reach a ‘gentleman’s agreement’ with Russia over establishing spheres of influence, and there’s no way that the Balkans would be left out of this proposal. Spheres Of Influence The Greek Headquarters: \\nThe US will never peacefully cede its prevailing influence over any of the NATO states, so nobody should get their hopes up that this will happen under Trump. Greece will probably be the center point of the new administration’s Balkan policy due to its energy significance with Balkan Stream, the Trans-Adriatic Pipeline, and the future potential that it has for transiting Israeli gas from the Eastern Mediterranean Leviathan field to the EU. Moreover, Greece is regularly at odds with Turkey due to the latter’s aggressive airspace violations in the eastern Aegean Sea, and the fierce opposition that all Greeks have to Turkish President Erdogan means that the country could become a useful base for covert destabilization operations against the multipolar-leaning leader who just barely survived a recent US coup against him. The ‘Coastal Balkans’ vs The ‘Balkan Bubble’: \\nAs for the rest of the Balkans, it was already expressed that the US will never “hand over” any of the NATO states to Russia, so this essentially leaves just the non-NATO states as potentially falling under any prospective spheres of influence agreement with Russia. Therefore, only Bosnia, Serbia, and the Republic of Macedonia could conceivably play a part in this proposal. It’s not likely that the Croat-Muslim Federation part of Bosnia would agree to their entire country being aligned with Moscow, so it’s much more realistic that only Republika Srpska – which already enjoys close political-strategic relations with Russia – would be party to this tacit agreement. Serbia, too, would thus obviously be involved as well, as could the Republic of Macedonia, though the latter might once more find itself on the frontlines of competition seeing as how influential some Greeks are poised to become in the Trump Administration. \\nIf one looks at it from a structural standpoint, it’s clear to see that the ‘Coastal Balkans’ would predictably come under the US’ influence, while Russia only stands to gain footing in the ‘Balkan Bubble’ of the Central Balkans, though importantly the most pivotal part of the region through which it and China’s megaprojects will pass. Balkan Stream could enter the Republic of Macedonia and thenceforth Serbia from Greece, which in this case would still give the US some degree of leverage over the project, but only up until the Greek-Macedonian border. Moreover, the Greek government has shown that it isn’t too loyal to anyone and just goes wherever the money is, so even with pro-Greek lobbyists in the Trump Administration, there’s no guarantee that Athens will agree to ‘cut its nose to spite its face’ in interfering with the Russian pipeline just for the sake of satisfying a few members of its American-based diaspora. Money talks, and Balkan Stream will be very profitable for the economically challenged country, so it probably won’t disrupt the project and sacrifice the billions of dollars of transit fees that it stands to gain from it. Macedonia In The Middle: \\nThe Macedonian government, unlike its Greek counterpart, has consistently proven itself to be a reliable partner and does not have a history of waffling between foreign patrons for the sake of pecuniary interests. Whether it’s in building strong relations with its existing Western partners or exploring deeper avenues of cooperation with its newer Russian and Chinese ones, nothing negative is really expected to change no matter whose sphere of influence Macedonia ultimately falls under. However, due to the tumultuous regime change attempts of the past couple of years which were sponsored and engineered by the US and a few other Western countries, there’s a reasonable chance that Macedonia might responsibly ‘hedge its bets’ by moving closer to the East in response, especially when bearing in mind that the West has constantly rejected its EU and NATO applications by strongly siding with Greece in the unresolved naming dispute. In fact, by virtue of Macedonia not being in either of these two organizations, it would automatically be more likely to enter into the Russian/multipolar sphere of influence if Trump is able to clinch a related agreement with Putin. Serbia And Republika Srpska: \\nAs for Serbia, the country’s people are overwhelmingly favorable towards Russia in spite of the Vucic government’s innate pro-Western orientation and clumsy façade of “geopolitical balancing”. Nevertheless, once more the “Balkan Bubble” of non-EU and non-NATO states comes into relevance and thus plays to Russia’s favor, increasing the probability that this country will also be “safely allowed” by the US to embrace Moscow just a little bit more substantially than it is now. That being said, Vucic isn’t a trustworthy or reliable partner , so instead of taking advantage of this just like how Macedonia and Republika Srpska will expectedly do by enhancing full-spectrum relations with Russia, the Serbian leader might just blow the opportunity by stubbornly sticking to his “geopolitical balancing” ruse in making symbolic gestures towards Russia while still deepening his country’s substantial partnerships with the West. In this sense, Republika Srpska’s President Dodik could be a better representation of the Serbian people’s will than the Prime Minister of Serbia proper is, since this subnational leader is more likely to take advantage of being part of any future Russian sphere of influence that Vucic is. Popping The ‘Balkan Bubble’ \\nFor as much of a win-win agreement as the enumerated spheres of interest proposal could be, there’s a lot that could go wrong in popping Russia’s ‘Balkan Bubble’, not least of which is the fact that it might not even happen at all if Trump isn’t able to replace and/or co-opt some of the neoconservatives embedded in the American “deep state”. Assuming that he’s able to do so to a workable extent whereby he’s empowered to carry through on his projected spheres of influence plan, then there’s always the chance that the US might just backstab Russia by activating the same geostrategic ticking time bombs that have threatened the Balkans for the past couple of years, such as a resumption of civil hostilities in Bosnia and a return to Albanian terrorism against Serbia and Macedonia. \\nWorse still, Trump might not even know about these or be able to fully stop them if they’re orchestrated by rogue neoconservative elements which were ‘cleansed’/’purged’ from the “deep state” and have ordered their loyal international contacts to take revenge by sabotaging the Trump-Putin ‘gentleman’s agreement’ over spheres of influence in Europe. Soros and his sympathizers could also do something similar, especially since the billionaire will probably fall out of favor with the US government during Trump’s term and might be motivated to partake in similar geopolitical vengefulness. Of course, Trump might also just be bluffing with Putin and trying to reach an agreement in order to buy time before preparing a ‘final strike’ against the last vestiges of multipolarity in the continent, but that doesn’t seem too probable since he’s more of a level-headed and stable businessman than a risky “deep state” gambler like Obama is. Concluding Thoughts \\nTrump has a track record of reaching deals and keeping his word, and given the positive chemistry that he’s already displayed towards Putin following their first-ever phone conversation with one another, observers can expect that the President-elect would probably stay true to any future promises that he makes to his Russian counterpart and consequently abide by any ‘gentleman’s agreement’ that he reaches over establishing a stable sphere of influence between them in ushering in a period of New Cold War Détente. While the proposed delineation might suggest that Russia doesn’t have anything to gain from the ‘Balkan Bubble’, such a conclusion would be both naïve and premature, since Moscow does in fact have a lot of geostrategic interests in the Central Balkans which it wants to use as the basis for building full-spectrum and robust partnerships with its members. \\nShould the predicted period of Détente last, then there’s nothing standing in the way of Russia or any of its forecasted partners reaching these sorts of mutually beneficial partnerships since the US would be disinclined to object to them so long as it keeps its word in respecting the Trump-Putin deal. This can’t be fully guaranteed no matter how convincingly it appears that it would last, but it would at the very least provide a valuable window of opportunity for both sides to intensify their relations. What’s ultimately most important is that Trump takes the US’ eyes off of the Balkans and stops trying to destabilize them like Obama did, since this could buy enough time for China’s Balkan Silk Road high-speed rail project to be constructed and thus open up an invigorating multipolar economic corridor between the Central European capital of Budapest and the Mediterranean port of Piraeus by means of the ‘Balkan Bubble’ states of Serbia and the Republic of Macedonia. \\nRussia should by that time have made itself comfortable in the ‘Balkan Bubble’ and could thus diversify its existing infrastructural and energy investments by expanding them into more of the real-sector economy, building off of the advantages that the Balkan Silk Road will provide in dramatically facilitating the logistical ease of conducting commercial business in the region. It might be optimistic to hope for so early at this point and two months before Trump even formally enters into power, but there’s a very real chance that the consummate outsider will indeed shake up the neoconservative-led and Soros-influenced US foreign policy establishment and carry through on his promises to normalize relations with Russia and repair some of the global destabilization wrought by the Obama years. \\nThis in turn could only work out to the Balkans’ benefit, especially if the man who wrote “The Art Of The Deal” practices what he preached and reaches a monumental one with Putin to decide upon a stable sphere of influence in the region, though there’s still a lot that can go wrong to prevent this from happening or sabotage it if it proves to be “too successful”. \\n'"}, "time": 1742564357.6476889}