{"duration": 0.09799075126647949, "input_args": {"text": "'Top eurocrats fear that should Marine Le Pen win the French presidency, the European Union will not survive. [“From the [European] Commission’s point of view, success for Marine Le Pen is a disaster and an existential threat to the European project,” a top official from the bloc’s unelected executive told Politico. “We can survive a Brexit, but not a Frexit. ”  Ms. Le Pen has stopped short of openly endorsing French withdrawal from the EU but has pledged a “France First” economic policy should she win office, levying taxes on companies which move jobs out of the country and reintroducing the French franc alongside the     euro currency  —   policies which would fall foul of EU law. The economic patriotism which I advocate is impossible within the European Union ! https:  .   —   Marine in English (@Marine2017_EN) March 6, 2017, Following mass casualty terror attacks in Paris, Nice, and elsewhere in France, Ms. Le Pen also pledged to take France out of the EU’s   Schengen area, which former Interpol chief Robert Nobel has described as “an international   zone for terrorists”. Politico’s sources inside the European Commission, however, have insisted that “There is no legal way to leave the euro or Schengen and still remain in the European Union. ” By preventing us from having national borders, the European Union condemns us to undergo #mass immigration #Marine2017 https:  .   —   Marine in English (@Marine2017_EN) March 10, 2017, Another top staffer confessed the prospect of a Le Pen presidency “worries us  —   without any doubt   …     After the UK [referendum] and the U. S. election, it would almost be a natural consequence. ” Conscious of its unpopularity, the EU as an institution has played only an   role in events like the Brexit referendum, but has intervened far more directly in the French elections. Pierre Moscovici, the European Commissioner for Economic and Financial Affairs, Taxation and Customs, has said it would be “a mistake” to avoid confronting politicians like Ms. Le Pen directly, as “France leaving Europe   …     would both kill Europe and make France choke severely”. ”I am convinced this is not an example to follow”: my remarks on #Brexit to @bbckamal https:  .  #Davos #wef17 pic. twitter.   —   Pierre Moscovici (@pierremoscovici) January 19, 2017,  “The Commission would vote [Emmanuel] Macron without any doubt,” a top Commission official confessed to Politico, referring to Ms. Le Pen’s main rival for the presidency. Macron, a   independent in the cast of former UK Prime Minister Tony Blair, served as economy minister in François Hollande’s socialist government.'"}, "time": 1742563932.8426116}