{"duration": 0.03533458709716797, "input_args": {"text": "'Tomatoes are probably the most versatile plant you can grow. Make your own self watering Tomato Buckets and never water your tomatoes again. \\n\\nMany people know about growing tomato plants in 5 gallon buckets. Turning these buckets into self watering buckets creates tomato plants that are practically maintenance free. Imagine growing full tomato plants and only having to refill a reservoir once a week. This trick also saves space! \\n\\nHow It Works \\n\\nThe process is actually very simple. Tomatoes are planted in a wicking medium that draws water from below and sends it to the roots of the plant. The water is drawn from another drum or garbage can and is released by a float valve. The valve that irrigated your plants is activated when the water level drops. \\n\\nYou can also grow peppers, okra, cucumbers, and more with this system. \\n\\nThe next important aspect of this design is the fabric grow bag you will be using. You can use simple grocery bags spun out of polypropylene. You can also find grow bags at your nursery and garden supply stores. The porous fabric allows excess water drainage and aeration of the root zone which is necessary for optimal growing conditions. \\n\\nThis is system is also based on the principle of “air root pruning”. As roots grow out to the porous fabric, they become exposed to air, dry out, and die. This causes the plant to produce dense fine feeder roots and prevents root circling. The increase in fine feeder roots leads to better nutrient and water absorption and promotes accelerated plant growth. \\n\\nYou will also need a plastic kitchen colander that will hold the fabric shopping bag off of the bottom of the bucket and create a shallow water reservoir in each grow bucket. Trim any large plastic colander to fit inside a 5 gallon bucket. \\n\\nNext you will need a 5 gallon support bucket with holes around the sides for ventilation. The bucket will help support the fabric bag and the ventilation holes will allow adequate air movement. This will allow oxygen to reach the root zone which is essential for optimal plant growth. The bucket also acts as a water reservoir below the bag providing a water source for the wicking grow medium. By maintaining the proper water level with the float valve regulator the medium will never dry out and will continuously wick moisture up to the root-zone.'"}, "time": 1742628416.791957}