{"duration": 0.03685927391052246, "input_args": {"text": "'NTEB Ads Privacy Policy PREPARE FOR 2018: Donald Trump Landslide Victory Will Usher In The Coming Global Shaking Well over a year ago, I told you that Donald Trump was God\\'s man for the White House, and that a landslide win would usher in a time of \"global shaking\". People laughed when I said and wrote about that. Here we are now 4 days after the unprecedented and historic upset Trump win, and the laughter has completely stopped. Please take note, the shaking has begun. by Geoffrey Grider November 13, 2016 Join us as we apply Paul’s command found in 2 Timothy 2:15 to ‘rightly divide’ our Bible and put everything in it’s proper perspective and place. \\n“And I will shake all nations, and the desire of all nations shall come: and I will fill this house with glory, saith the LORD of hosts.” Haggai 2:7 (KJV) \\nCLICK HERE TO LISTEN LIVE when the show starts Sunday night at 9:00PM EST! \\nWell over a year ago, I told you that Donald Trump was God’s man for the White House , and that a landslide win would usher in a time of “global shaking”. People laughed when I said and wrote about that. Here we are now 4 days after the unprecedented and historic upset Trump win, and the laughter has completely stopped. Please note, the shaking has begun. CLICK IMAGE SUNDAY NIGHT AT 9:00 PM EST TO LISTEN LIVE TO THIS BIBLE STUDY \\nOn this episode of Rightly Dividing , we look at the not just the amazing victory of Donald Trump, but what it will mean from a prophetic perspective when president-elect Donald J. Trump keeps his promise to move the US Embassy from Tel Aviv to Jerusalem. All Hell is going to break loose – literally. It will be just in time for the 70th anniversary of Israel being back in the land. But first, the Rapture of the Church . Are YOU ready for what comes next? \\nCLICK HERE TO LISTEN LIVE when the show starts Sunday night at 9:00PM EST! SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742561900.963736}