{"duration": 0.06307363510131836, "input_args": {"text": "'Chamae Rose: The Herb That Contains Monatomic Gold, Detoxifies & Creates Clear Skin Oct 26, 2016 0 0 \\nChamae Rose, or Chamaebatiaria millefolium, is an herb that grows in the Sierra Nevada Mountains and may be one of the most interesting and potentially helpful herbs out there. While many incredible and medicinal herbs exist, the location where Chamae Rose grows is the reason for the fascinating story behind it. Chamae Rose, or Desert Bush. Source \\nChamae Rose became well known when Patrick Bailey , a leader in research and development in the dietary supplement industry heard of a story behind this herb. What was told to him was that a Native American woman was allegedly curing people of AIDS, HIV, cancers, diabetes, gout, pneumonia and others with using only a single herb. \\nHe initially disregarded the information but an insistent friend who offered to introduce him to the lady convinced Patrick to meet with her and hear her story. At the time, she was 81 and Bailey reported that she looked no older than 60, and even without any gray hair. \\nShe told Bailey that when she was 60, she had congestive heart failure and kidney failure and was being advised by her tribe’s elders to prepare to pass over. Her and her husband decided to take a visit to the Sierra Nevada Mountains, which is a sacred place for her ancestors. One night during her stay, she had a dream of being instructed to drink a cup of tea and that it was not her time to go. When she woke up, she noticed the Desert Bushes that surrounded her and her husband and she decided she needed to dig up the roots of the bush and make tea from it. Within one month of regularly consuming the tea, all of her ailments vanished. Soon after, she began helping many others. \\nBefore leaving his meeting with the Native American healer, she told Patrick Bailey that the property (which she and her husband bought after visiting the land) was on a large white mineral deposit. It occurred to Bailey that maybe the soil contained what David Hudson had researched and called, monatomic gold. Four weeks later, test results came back on the soil and it did indeed contain monatomic elements, including monatomic gold. Source \\nWhat is different about using Chamae Rose to obtain monatomic gold, is that the roots from the plant uptake the monatomic elements and utilize them in the plant. When the plant is ingested by a human, we absorb the monatomic elements. It is believed that the massive healing power with Chamae Rose is because of the monatomic elements in it and the energy transfer it induces from plant to person. \\nMonatomic elements can be explained : \\n“The center of the periodic chart of elements consists of what are known as the “transition elements,” meaning that they can transit from metallic to monatomic or diatomic via chemical treatment or through other means (what some would refer to as “shadow chemistry” or “arcane chemistry” or even “alchemy”). Take gold for example. When you have two or more gold atoms in a microcluster, it will have metallic properties, but if you have only one atom, it will then have ceramic properties, which means that it becomes chemically inert but at the same time will have superconductive capabilities even at room temperature. The weight of these amazing materials can also change by heating, becoming lighter, even to the point of levitation. Because it is chemically inert, it can be ingested for health, wellbeing and super-energizing at the cellular level. \\nNot only do our cells communicate via chemicals and electricity in our nervous system and intercellularly throughout other processes, but also through the exchange of photons, or light particles. The human body is a marvelous bioelectric machine, and all of its processes depend on the clear and (ideally) unimpeded conduction of electrical “messages” required to carry out those processes. Light, as proven by fiber optics, can carry more and actually “purer” information. As mentioned above, these materials are superconductive, and therefore change our bodies at the cellular level, from our organs, muscles and tissues to our brain and nervous system, into superconductors of a greatly increased flow of photons, greatly increased because the materials themselves are in a sense “liquid (or powdered) light.” It’s like installing ‘gold tipped’ wires on your brain synapse. Put another way, you could say that monatomics transform the body’s “wiring” from being simple copper cable to being wired with fiber-optics, where the same “width” of wiring is able to carry 1,000 times as much ‘processing’ information.” \\nHarmonic Innerprizes , which is the company started by Patrick Bailey and is the only known company selling Chamae Rose, says there are other benefits of Chamae Rose in that it also contains many polyphenols and antioxidants, which helps to detoxify the body. In fact, Chamae Rose is known to detoxify the kidneys, lungs, liver, throat and bladder, as well as help with sinus and allergy issues. Because of it’s ability to detoxify, it is known as the beauty herb because it creates healthier, clearer skin. As we cleanse the inner organs, this reflects itself in the appearance and health of our skin. \\nWhat are your thoughts? Is this something you have used before? What do you think about monatomic gold? Cheers to our health! \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and practices health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information on how to receive health coaching for yourself, a family member or a friend as well as view other inspiring articles. Vote Up Lance Schuttler Lance Schuttler graduated from the University of Iowa with a degree in Health Science and is Director of Creative Health Non-Profits for Personable Media. He is passionate about holistic and naturopathic medicine as well as helping to bring awareness to an efficient, sustainable and health-promoting transition that our world’s current socio-economic model is rapidly undergoing.'"}, "time": 1742628574.0810914}