{"duration": 0.05322527885437012, "input_args": {"text": "'The United Nations envoy for gay rights has declared that when there is a clash between homosexual rights and religious liberty it must be recalled that “freedom of expression and religious freedom are not absolute rights and may be limited if necessary. ”[In a recent public consultation, the UN’s newly appointed “independent expert” on the defense of LGTB rights, Vitit Muntarbhorn, said that negative moral judgments on homosexual activity were a recent phenomenon, stemming from “colonial law. ”  “More recently, in colonial law, or remnants of colonial law, gays were criminalized, are criminalized, even though beforehand they were not criminalized,” he claimed during the Jan. 25 conference. When challenged about the clash between LGBT rights and religious freedom by Henk Jan van Schothorst of the Transatlantic Christian Council, Muntarbhorn said that religious freedom is not absolute and must yield to homosexual rights. “There are some absolute rights,” he said in apparent reference to LGBT rights, “but there are some that are not absolute. ” He went on to explain that “freedom of expression and expression of religion” are not absolute rights and that they can be curtailed when necessary. While praising a desire to engage with the “heart of religion,” Muntarbhorn said this should be done “without the mythology overriding the heart of the religion. ” The independent expert also emphasized the role of education so children can be “born and bred from a young age” with the right attitudes toward sexual orientation and identity, a practice that some have denounced as indoctrination or even “gender ideology” or “ideological colonization. ” Last summer, the UN Human Rights Council approved the appointment of an independent expert on the defense of the LGTB collective, and in October the Council chose Vitit Muntarbhorn of Thailand to fill the post. The following month, a coalition of 54 African states challenged the legality of the appointment, asking that his mandate be put on hold. They submitted a resolution calling for the suspension of the UN’s LGBT investigator, noting that gender identity and sexual orientation have no place in international human rights instruments. While Muntarbhorn has been tasked with assessing implementations of existing international human rights law and raising awareness of violence and discrimination based on sexual orientation and gender identity (SOGI) critics suggest that his very mandate will constitute interference with the laws of many UN countries.   countries worldwide, and almost 40 percent of all UN member states, currently have   laws on their books. In Africa alone, 33 states have laws making homosexual acts a crime, including Uganda, Nigeria, Sudan and Mauritania. Speaking on behalf of the African nations, Botswana’s ambassador told a General Assembly human rights committee in November that African nations “are alarmed” that the Human Rights Council is delving into national matters and attempting to focus on people “on the grounds of their sexual interests and behaviors. ” Ambassador Charles Ntwaagae said that the Council had no business looking into “sexual orientation and gender identity,” which are notoriously absent from the United Nations charter document, the Universal Declaration of Human Rights. “Those two notions are not and should not be linked to existing international human rights instruments,” said Ntwaagae. The UN has never adopted an official position regarding putative rights of gender identity or sexual orientation, though it does guarantee the rights of life, liberty, security, property and equal protection to all persons without distinction. “We therefore call for the suspension of the activities of the appointed independent expert pending the determination of this issue,” said Ntwaagae. The Africa group claimed that a focus on homosexual rights also takes attention away from other issues of “paramount importance,” such as racism and the right to development. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742562158.2620618}