{"duration": 0.09434795379638672, "input_args": {"text": "'LONDON  —   Oscar Pistorius, the Olympic runner, removed his artificial legs and shuffled his way to the front of a courtroom in South Africa on Wednesday, the third day of a hearing to determine his sentence for the 2013 murder of his girlfriend. Trembling and tearful, he rested his right hand on a desk for support as his lawyers pleaded with a judge to sentence him to community service rather than prison. Dressed in a   and athletic shorts, Mr. Pistorius, 29, was under five feet tall without the     prosthetic legs that earned him the nickname the Blade Runner. It was an image far more humble than that of the   athlete who successfully challenged   athletes. Mr. Pistorius’s defense lawyers had asked him to take off his prosthetic legs to highlight the sense of vulnerability they say he felt when, acting out of fear and confusion, he fatally shot his girlfriend, Reeva Steenkamp, early on Feb. 14, 2013. But the tactic appeared to also be meant to generate sympathy from the judge and a lighter sentence than the 15 years Mr. Pistorius faces for murder. It was the most dramatic moment of the day in a proceeding that both the prosecution and the defense have sought to inject with pathos. A defense psychologist testified on Monday that the athlete was unfit to testify because of a “severe” mental condition that included symptoms of   stress disorder. On Tuesday, the victim’s father, Barry Steenkamp, a diabetic, testified that his grief was so severe that he plunged his insulin syringe into his stomach and arms “to see if I could feel the same type of pain, but no. ” Mr. Pistorius has long maintained that he thought an intruder had entered the home he shared with Ms. Steenkamp in Pretoria, and that he had no intention of killing her when he fired four shots through a locked bathroom door after she had taken cover inside. It is Mr. Pistorius the   and not Mr. Pistorius the   athlete, who should be judged, said one of his lawyers, Barry Roux. South African sentencing guidelines call for a minimum term of 15 years in prison for murder, but they give the judge leeway. Mr. Roux argued that there were “substantial and compelling circumstances” to show leniency. Judge Thokozile Matilda Masipa, who is presiding over the televised hearing in the North Gauteng High Court in Pretoria, said on Wednesday that she would issue her ruling on July 6, according to news reports. In 2014, after a trial that riveted South Africa, Judge Masipa found Mr. Pistorius not guilty of murder but convicted him of culpable homicide, the legal equivalent of manslaughter. She sentenced him to five years in prison, and he served one year before being released in October to serve the rest of his sentence under house arrest. However, prosecutors appealed, and the country’s top appeals court convicted Mr. Pistorius of murder in December, finding that he was guilty because he knew that firing through the locked door would kill whoever was inside  —   even if he did not believe that it was Ms. Steenkamp. The court referred the case back to Judge Masipa for sentencing. Marius du Toit, a South African criminal defense lawyer and former prosecutor and judge who is not connected with the case, said in a phone interview that both sides had made fairly naked appeals to emotion  —   the defense by having Mr. Pistorius walk around on the stumps of his legs, and the prosecution by bringing forward Ms. Steenkamp’s tearful relatives  —   because the legal issues had already been resolved. “All the legal facts in this matter have been settled. We have the rulings from the courts, and all of the evidence that has been adduced,” he said. “The only thing that’s changed is that we’re dealing now with murder instead of culpable homicide, and on murder, the court has to impose a mandatory   sentence unless the court finds ‘substantial and compelling’ reasons for a different sentence. ” In a decision that could add to the charged emotions around the case, Judge Masipa on Wednesday agreed, at the request of prosecutors, to release photographs of Ms. Steenkamp’s body that investigators took after the shooting. The case has highlighted fear of violent crime in South Africa and raised questions about whether the criminal justice system treats all defendants equally. The chief prosecutor, Gerrie Nel, has portrayed Mr. Pistorius as a man given to fits of anger and  . On Wednesday, he summoned Kim Martin, a cousin of Ms. Steenkamp’s, to testify about what the prosecution contends is a lack of remorse. “All we’ve ever wanted was the truth,” Ms. Martin said. “I know people said that you’ve got the truth. But we didn’t. Oscar’s version changed so many times, and I’ve never, ever heard him say that ‘I apologize for shooting and murdering Reeva behind that door.’ ” Ms. Steenkamp, a law school graduate and model, was 29 when she died. “Besides the obvious anxiety and depression, as a family we’ll never ever be able to carry on like normal,” Ms. Martin said. “Just standing on a queue at a shopping center poses difficulty. People don’t recognize you, and they’ll start mentioning the trial, or they’ll start mentioning Oscar, or they’ll start mentioning Reeva. ” The family has expressed outrage that Mr. Pistorius taped an interview  —   his first about the killing  —   with the British television network ITV but declined to testify at the sentencing hearing. The interview is scheduled for broadcast on June 24. The sentence had been expected to be handed down before that date. Mr. Roux suggested that his client was also a victim, with his career and life ruined. “The accused has lost all of his assets and his career is gone,” Mr. Roux said. “The accused can never, ever resume his career. The accused has punished himself, and will punish himself for the rest of his life, far more than any court of law can punish him. ” Mr. Nel, the prosecutor, was unmoved. He said that Mr. Pistorius had not shown remorse and that his decision to give the ITV interview without informing the court showed “utter disrespect. ” “It’s the duty of this court not to follow public opinion but to lead public opinion in the public interest,” he said.'"}, "time": 1742563213.3071375}