{"duration": 0.15881609916687012, "input_args": {"text": "'The monster they created is running amok. Credit: VDare. \\nThese two things happened the day after Donald Trump won the election: First, a Washington Post reporter named Peter Holley called the American Renaissance office to ask–in dead seriousness–whether anyone from the Trump team had called us for policy advice. Second, Gloria Gonzalez-Garcia, a Mexican-American explained to the Fort Worth Star-Telegram what a Trump victory meant: “We were getting the message, ‘If you are not white, you don’t belong here.’ ” \\nSo what’s the connection? Let’s start with the Post ’s Mr. Holley . [ ] He is a professional newsman who attended Columbia’s Graduate School of Journalism. He calls himself an “experienced reporter with a talent for uncovering compelling stories that other people overlook.” It’s his job to find out and report what is going on–and he seriously thought the victorious Trump team would check in with me for instructions. \\nHe’s not alone. The same day, a journalist from the biggest newspaper in Latin America– Folha de S. Paulo – wanted to know if I had telephoned my friend Donald Trump to congratulate him on his victory. I told her I have never met him and don’t have his number. \\nWhat we have here is a stupefying delusion: that Donald Trump is a secret “white supremacist,” who dances to the tune of the Alt-Right. This delusion has two sources: ignorance and maliciousness . People like Peter Holley are so deeply marinated in liberal ignorance that they can’t tell the difference between American nationalism and racial nationalism–between the desire to put American interests first and white racial consciousness. \\nAs I have explained elsewhere , the maliciousness involved looking for racial dissidents who supported Donald Trump and then arguing that since “racists” backed him, Trump must be a “racist,” too. When Mr. Trump didn’t denounce David Duke and “white supremacy” fiercely enough to suit them, they claimed this was proof he is a secret sympathizer. They were wrong. He just doesn’t like being pushed around by journalists who hates him. \\nThe pro-Hillary media therefore created a Frankenstein monster–an imaginary Donald Trump who secretly wants to make America white again. They called him a bigot, a xenophobe, a fascist, a threat to democracy and, of course, the new Hitler. They hoped this would frighten enough voters into the Hillary camp to stop Mr. Trump, but it didn’t work. And now they are stuck with a Frankenstein president elect who, they are convinced, comes running to me for policy tips. \\nYesterday, Senator Harry Reid issued an idiotic press release that included these lines: \\nWhite nationalists, Vladimir Putin and ISIS are celebrating Donald Trump’s victory, while innocent, law-abiding Americans are wracked with fear–especially African Americans, Hispanic Americans, Muslim Americans, LGBT Americans and Asian Americans. \\nIt is because she has heard so many Frankenstein stories that poor Gloria in Fort Worth–a US citizen–thinks the real Trump message is that non-whites don’t belong in America. \\nAnd she’s hardly alone. \\nJason Perez (right) a university student in Hawaii, writes that “the next four years will be a living nightmare for all Hispanic Americans.” Mercedes Rosales , a high school senior in Homestead, Florida, says Mr. Trump “just wants to get rid of Mexicans, or Latinos.” Maria Perez , also of Homestead, says, “Because of the example of Donald Trump . . . now they can look at you and see you are an immigrant and kill you.” Mary Rabago , a Hispanic journalist living in Arizona, explains the election results: “Hate won.” \\nThe Muslim reaction is just as nutty. Asaad Alabdulaziz, an Iraqi who recently became a US citizen , asks, “Do I have to go back?” Sahar Aziz , a professor at the Texas A&M University, says that “the general mood I am seeing among Muslims is concern that a Trump presidency will be open season on them.” \\nNo one–not once in the campaign–ever talked about deporting law-abiding legal residents. So where did people get these deranged ideas? Obviously, from media caricatures. Hispanics are no doubt getting lurid stuff from the Spanish-language press as well. Telesur , a consortium based in Venezuela, reports that under a Trump presidency, “the rights of black and brown people, immigrants and women will suffer serious setbacks.” \\nPeople like Peter Holley–who created the caricature and believe in it–are on such hair-trigger alert for “racism” that they can’t conceive of a non-racial American nationalism that expresses itself in the ideas that helped Donald Trump win: Illegal immigrants should stay out. Illegals who are here should go home. There should be no sanctuary cities. Birth-right citizenship is crazy. Muslims are potentially troublesome. Legal immigration should be cut. \\nThere is nothing inherently racial about any of these ideas, and they appeal to millions of Americans who don’t think in racial terms. But current dogma demands that we thrill to the idea that every brown-skinned newcomer–whether he has a job or even speaks English–is a precious addition to our “greatest strength,” which is diversity. Anyone who supports policies that have the effect of slowing the march of diversity is a “racist,” and might as well be a dedicated AmRen reader or even a member of the Ku Klux Klan. That’s why Peter Holley thinks Donald Trump wants my advice. \\nThe notion that Mr. Trump will hurt blacks is especially wrong, but it follows the usual sloppy liberal thinking: If you want to send home illegals it can only be because you hate Hispanics, which means you hate blacks, women, homosexuals, and Jews. Donald Trump wanted Confederate flags taken down in the South, is “fine” with affirmative action , and he blasted Justice Antonin Scalia’s critique of race preferences in universities. And only the most fevered imagination could have prompted the Salon headline: “ I Am a Gay Jew in Trump’s America. And I Am Afraid for My Life .” Mr. Trump’s close professional and family connections to Jews are well known . \\nIt is the widely circulated fantasies about Donald-Trump-the-racist that explain why Mexican-Americans and Muslims who are US citizens are reportedly crying themselves to sleep at night, and why there are violent anti-Trump demonstrations all over the country. Just as reckless anti-police reporting paved the way for the murders of policemen , frothing press coverage of Donald Trump has sent thousands of ignoramuses into the streets to smash store windows and attack cops. \\nThe papers are now full of breathless reports of Trump supporters calling blacks “ni**er” and tearing hijabs off Muslim women. Some of these attacks were faked , but some are no doubt real. What do they reflect? What Donald Trump wants or what the Frankenstein wants? If loutish whites are telling Hispanics “we’ll deport you,” who gave them the idea that a modern-day Hitler is about to move into the White House? \\nThe Trump-is-a-racist idea is so firmly planted in the minds of Hillary supporters that nothing can dislodge it. But they don’t even understand what they, themselves, mean by it. \\nJosh Harkinson of Mother Jones called me after the election to talk about the Alt-Right. I explained to him how the media have painted a dishonest picture of Donald Trump, and he conceded that he was beginning to realize that using his favorite word–“racist”–to describe the president elect and people like me might be a mistake. I congratulated him on this intellectual breakthrough, and then asked what Donald Trump has ever said or done that was “racist,” whatever that word means. \\n“Oh, there are so many, I don’t know where to begin.” \\n“Then just tell me one.” \\nThere was a brief silence. “He retweeted an image of himself as Pepe the frog.” \\n“What? Is that the best you can do? You’re really straining.” \\n“Yes, I guess I’m straining.” \\nMr. Harkinson later brought up Mr. Trump’s suggestion that Judge Gonazlo Curiel’s Mexican ancestry meant he could not try the Trump University case fairly. I pointed out that Judge Curiel is a member of La Raza [the race] Lawyers, which gave Mr. Trump grounds to doubt his impartiality. “Besides,” I said, “if a white police officer is in an altercation with a black criminal and ends up shooting him, you’d be the first to say the officer was biased on account of his race.” \\n“Not the first.” \\n“Then the second.” \\nWe live in a world of malicious fantasy. If members of that priestly class known as journalists–everyone knows they are sternly objective–call someone a “racist” that’s what he is. And once you’re a “racist,” you might as well be a sexist, xenophobe, anti-Semite, homophobe, and who knows what else. This is what we get when reporters slant the news and then believe what they read in the papers. And the media can’t understand why no one trusts them anymore. \\nJared Taylor [ Email him ] is editor of American Renaissance and the author of Paved With Good Intentions: The Failure of Race Relations in Contemporary America . (For Peter Brimelow’s review, click here .) His most recent book is White Identity . (Reprinted from VDare.com by permission of author or representative)'"}, "time": 1742561703.2963839}