{"duration": 0.1793217658996582, "input_args": {"text": "'ENID, Okla.  —   One Sunday after church, Jeff Mullin and his wife were in line at the Western Sizzlin steakhouse here when a man, fists clenched, threatened to beat the hell out of him. “My first thought was just to kind of try to keep things calm. Otherwise, it was going to be two old guys rolling around on the floor of the steakhouse, and that would be pretty unseemly,” recalled Mr. Mullin, 64, the mustachioed senior writer for Enid’s daily newspaper, The Enid News  Eagle. The dispute was not personal. It was, of all things, editorial. Mr. Mullin’s red newspaper in a red county in what is arguably the reddest of states went blue this campaign season and endorsed Hillary Clinton for president. The editorial board, in a   column on Page A4 on Oct. 9, wrote that Donald J. Trump lacked “the skills, experience or temperament to hold office. ” The headline and subhead read: “For U. S. president: Hillary Clinton is our choice for commander in chief. ” It was the first Democratic endorsement for president in the modern history of the newspaper, which was founded in 1893. As the man’s reaction at the steakhouse suggested, Enid was stunned, and this   agricultural town of 52, 000 near the Kansas state line has not been the same since. The News  Eagle, with a circulation of 10, 000, lost 162 subscribers who canceled the paper. Eleven advertisers pulled their ads, including a funeral home that had a sizable account. Someone stuck a “Crooked Hillary” bumper sticker on the glass doors of the paper’s downtown office. A man left a   message on the publisher’s voice mail, expressing his hope that readers would deliver, to put it delicately, a burning sack of steaming excrement to the paper. Around the country, as newspapers big and small are struggling to keep subscribers, a handful of papers with conservative editorial boards made news by either endorsing Mrs. Clinton or urging readers to back anybody but Mr. Trump. Among them were The Dallas Morning News and The Fort Worth  . The Arizona Republic in Phoenix received death threats after it endorsed a Democrat for president for the first time in its   history. Yet for the most part, the fallout at those large metropolitan newspapers was   and barely noticed. The  ’s editorial in October, “Say No to Trump,” led to more than 100 canceled subscriptions, less than   of 1 percent of its circulation. In Enid, however, sentiment about the endorsement lingers weeks after the election. A former mayor, Doug Frantz, 72, withdrew his participation in this year’s Pillar of the Plains events, which are sponsored by the paper and honor community leaders and volunteers. Emails, letters, phone calls and comments denouncing the endorsement have poured into the paper’s website and Facebook page,  and online, the editorial logged more than 20, 000 page views the week it was published, making it one of the most viewed articles to ever run on Enidnews. com. Days after the editorial, Paul Allen, 81, one of Enid’s most prominent residents  —   he financed construction of the ballpark downtown  —   stepped into the paper’s offices on Broadway. He walked past the statue of an eagle in the lobby and canceled his    subscription at the front desk. He might have done it sooner, but hesitated because he knows the publisher, Jeff L. Funk, whom he sees at weekly Rotary Club meetings. “I like Jeff a lot,” said Mr. Allen, a   of a meat processing company that is the largest private employer in town. “That was one reason I debated it, because I didn’t want to offend him. “I wasn’t gloating over it,” he continued. “I just felt like it was kind of my duty almost. When I saw that headline, I was shocked. It was sickening to me. ” The News  Eagle’s   editorial showed the raw power of partisanship in   America, the extraordinary divisions exposed in this election and the surprising ways in today’s digital media age that newspaper endorsements still have the power to generate a reaction, even if they don’t necessarily change people’s votes. “There used to be a saying that the editorial page was the soul of a newspaper, and if that’s the case, we’ve got a lot of   newspapers in the country because they’re afraid to offend anybody,” said Terry M. Clark, the director of the Oklahoma Journalism Hall of Fame and a professor of journalism at the University of Central Oklahoma in Edmond. “This is an excellent example of the way American journalism ought to be  —   standing for something  —   and, man, it takes guts to do that in Enid, Okla. ” The News  Eagle, which urged readers in the Republican primary to support Senator Marco Rubio for president, stands by its endorsement of Mrs. Clinton. But it has also been busy doing damage control. One reader who stopped taking the paper said it was still trying to woo him back by delivering an occasional copy to his doorstep. The executive editor, Rob Collins, has worked the phones, talking to subscribers who had canceled or threatened to do so. “I talked a lot of people off the ledge,” said Mr. Collins, who grew up in Enid and whose father was a respected car salesman. “People knew my dad or know my mom and know my family here. A lot of people who were angry called expecting me to argue right back with them. Really, the only time I would raise my voice is when I would get cursed at or yelled at, which I don’t really like. “I hope people can respect that we’re entitled to our opinion, too, and that that can be different from news,” he added. The editorial took shape from notes that Mr. Funk, the publisher, supplied to Mr. Collins. Mr. Collins refined the notes and was the primary author of the endorsement, which was debated and approved by the paper’s   editorial board. The paper’s corporate parent, Community Newspaper Holdings Inc. which is based in Alabama and owns newspapers and websites in 23 states, also played a role. “It was our decision at the corporate level, which of course was made known to all of our papers, that Donald Trump did not meet our company and journalism values, particularly as they related to the First Amendment,” said Bill Ketter, the senior vice president for news. Asked if the Enid editorial board had the freedom to endorse Mr. Trump, he replied: “Let me put it this way. We would have been disappointed. Did we demand that they do something? No, we didn’t do that. We set out our principles and our standards. ” Enid is roughly 100 miles north of Oklahoma City, and people here still like to debate whether the town gets its name from a character in a Tennyson poem or, according to urban legend, from a joke played on an old chuck wagon sign. (Enid is, after all, “Dine” spelled backward.) The jets from Vance Air Force Base fly so low that residents like to say they can read the markings on the bottoms of the aircraft. Several residents said they now depended on the newspaper’s competitor, The Enid Buzz  —   an online and social media hub for community news and activities  —   for their local news, and they disputed any suggestion that canceling subscriptions was too strong a reaction. “I’m unhappy with the whole media,” said Jody Traynor, 67, a   subscriber who stopped taking the paper after the endorsement. “All of them. They lean too much. They’re supposed to just tell me the news and let me decide. ” All 77 counties in Oklahoma went for Mr. Trump. The last Democrat to carry the state was Lyndon B. Johnson in 1964, while the last one to carry an Oklahoma county in a presidential election was Al Gore in 2000. Still, there are Democrats in Enid, at least one of whom was pleased with the situation. “We gained one subscriber out of the endorsement editorial,” Mr. Funk said. “We lost 162, but we gained one. ” At Western Sizzlin that Sunday, Mr. Mullin ended up ordering a   steak and a baked potato without further incident, but the confrontation disturbed and puzzled him. He and his wife attend Willow View United Methodist Church, as do members of the man’s family. “Looking back on it, I think it was all talk, but at the time I thought there was a possibility that he might take a swing at me,” said Mr. Mullin, a member of the editorial board. “And I thought this is crazy. This is a newspaper endorsement. Some of the people almost seemed hurt. Like, ‘How can my newspaper’  —   in a small town like this, it’s their newspaper  —   ‘do this to me?’ I think there was almost a sense of betrayal. ”'"}, "time": 1742563549.5323882}