{"duration": 0.10822439193725586, "input_args": {"text": "'  Zero Hedge \\nHaving unveiled the first images of its new nuclear missile capable of reaching US soil, Russian President Vladimir Putin is warning today that Washington’s actions are “pushing Russian into a nuclear arms race,” forcing Russia “to develop its nuclear attack systems.” \\nYesterday, Russia reveals photos of a new highly advanced liquid fuelled heavy ICBM capable of evading anti-missile defences and hitting US territory with 10 tonne nuclear payload. \\nThe Makeyev Design Bureau – the designer of Russia’s heavy liquid fuelled Intercontinental Ballistic Missiles (“ICBMs”) – ie. of missiles capable of reaching US territory from Russian territory, has published the first picture of Russia’s new heavy Sarmat ICBM which is due to enter service shortly, probably in 2018. \\nThe picture is accompanied by a short statement which reads \\n“In accordance with the Decree of the Russian Government ‘On the State Defence Order for 2010 and the planning period 2012-2013,’ the Makeyev Rocket Design Bureau was instructed to start design and development work on the Sarmat. In June 2011, the Bureau and the Russian Ministry of Defense signed a state contract for the Sarmat’s development. The prospective strategic missile system is being developed in order to assuredly and effectively fulfil objectives of nuclear deterrent by Russia’s strategic forces.” \\nAnd now today, Putin explains: *PUTIN: INTERMEDIATE NUCLEAR FORCES TREATY SHOULD BE OBSERVED *PUTIN: RUSSIA, U.S. MUST BREAK VICIOUS CIRCLE OF CONFRONTATION *PUTIN: RUSSIA HAS TO DEVELOP ITS NUCLEAR ATTACK SYSTEMS *PUTIN: U.S. PUSHED RUSSIA TO ARMS RACE IN NUCLEAR SPHERE \\nPerhaps even more worrying are the comments from Obama administration officials declaration that war with Russia was all but inevitable (via AntiWar’s Jason Ditz) , \\n“With some Obama Administration officials openly advocating starting a war with Russia over Syria, it is noteworthy that a lot of top Pentagon officials are treating the conflict as all but inevitable. Army Chief of Staff Gen. Mark Milley hyped Russian modernization efforts, but declared that they ‘ will lose to the American Army. ‘ \\n“Russian officials have been cognizant of the possibility, insisting that Russia ‘can now fight a conventional war in Europe,’ comments which Gen. Milley dismissed as ‘bluster, hubris, bravado.’ and insisting that war with other nation-states ‘is almost guaranteed.’ \\n“Joint Chiefs chairman Gen. Joe Dunford also complained about recent modernization efforts within the Russian military, claiming that they are threatening American interests with their capabilities, while Deputy Defense Secretary Bob Work referred to them as America’s ‘competitor.’ \\n“Of course, the United States spends many, many times what Russia does on its military, but the fact that Russia has a proper military capable of defending the nation at all puts it in a total different category from most of America’s recent wars, and Russia’s massive nuclear arsenal makes it clear this is one war which, if the US launches it, they won’t be able to win outright.” \\nAs ZeroHedge noted previously, by contrast the US strategic deterrent still relies on missile systems such as the ground-based Minuteman III and the sea launched Trident II, which have their origins in the 1960s and early 1970s. With the Sarmat missile, which is supposed to enter service in 2018, the Russians will add another powerful modern advanced system to their strategic armory.  '"}, "time": 1742562640.229637}