{"duration": 0.13266825675964355, "input_args": {"text": "'ATLANTA  —   Demeitrus Williams has heard what Donald J. Trump has been saying recently about black people: That their neighborhoods were “war zones. ” That they struggle to get by on food stamps. That they see nothing but failure around them. Mr. Williams, 61, a retired postal employee who is   acknowledged that Mr. Trump’s remarks described a reality for some black people. But it was not his reality, or that of people he knew. And the fact that those generalizations, in which all   inhabit a hell of violence and dysfunction, came as part of an outreach effort on Mr. Trump’s part elicited from Mr. Williams an incredulous and slightly bitter cascade of chuckles. “Who’s he talking about?” Mr. Williams said Wednesday over lunch at Ponce City Market, an upscale development with a hip food court that draws an ethnically and racially mixed crowd. “I don’t know  —   most of the black people I know are educated and live in nice neighborhoods. Everybody in my family is required to have a degree. ” Dogged by suggestions that he has been running a racist campaign, Mr. Trump has been expressing concern for   more in the past week than at any other point in his presidential run and making a direct appeal for their votes. “What do you have to lose?” he has asked. But the unrelievedly dire picture he has painted of black America has left many black voters angry, dumbfounded or both. Interviews with roughly a dozen blacks here turned up no one who found any appeal in Mr. Trump’s remarks. More common was the suggestion that Mr. Trump was trying to appeal to whites who might support him. “I hear him not talking to black people, but talking to white people about black people so they will think he cares about black people,” said Alexis Scott, a former publisher of The Atlanta Daily World, a   newspaper. “The real thing that he’s trying to do is to try to protect some of the white vote by suggesting to them that he cares. ” Speaking invariably to almost   audiences, Mr. Trump has portrayed blacks as living lives of utter desperation. “What do you have to lose by trying something new, like Trump?” he asked a crowd in Virginia on Saturday. “You’re living in your poverty, your schools are no good, you have no jobs, 58 percent of your youth is unemployed  —   what the hell do you have to lose?” Marc Morial, the president of the National Urban League, said that black Americans faced challenges, but that Mr. Trump’s depiction of a hopeless, violent black America did not match reality. “It’s an inaccurate portrayal of the community that seeks to define the community by only its biggest challenges,” Mr. Morial said. “Black America has deep problems  —   deep economic problems  —   but black America also has a large community of striving, successful,   people: college educated, in the work force. ” Poverty is far more prevalent in black households than the general population, but the vast majority of   do not live in poverty. According to census data released last year, 26 percent of blacks live in poverty, compared with 15 percent of the country as a whole. Only about one out of every four households receiving food stamps in 2014 was black, according to the United States Department of Agriculture. One area where blacks lag severely is homeownership. Rates of homeownership for blacks have dipped over the past four years to 41. 7 percent in the second quarter of this year, the lowest rate among any racial group, according to the Census Bureau. The unemployment rate for blacks is nearly double the national average. Mr. Trump’s tone and strategy in courting the black vote is distinctly different from that of previous Republican presidential nominees, whose more formal outreach efforts had limited success. In 2004, for instance, President George W. Bush addressed the National Urban League, and in 2012, Mitt Romney appeared before the N. A. A. C. P. “Someone like George W. Bush, to his credit, actually went to black audiences with people who had real connections to black communities,” said Matthew B. Platt, a political scientist at historically black Morehouse College. “He actually made those kinds of connections to then filter down to regular black people. Trump is not doing anything of that sort. ” But he noted that Mr. Trump’s basic presentation to black voters was perhaps not altogether different from the one he has made to white voters. “It seems to me that Trump’s argument is this: ‘Your life sucks. Try something new. I’m something new,’” he said. “That’s the argument he’s making to black voters and, more broadly, that’s the entire Trump campaign. ” Mr. Trump would seem to have nowhere to go but up among   voters. A recent NBC   Street Journal poll found Hillary Clinton with a 91 to 1 percent advantage over Mr. Trump among blacks. Many say Mr. Trump’s role in leading the   birther movement that questioned President Obama’s birthplace doomed his chances with   voters. “Social media and YouTube have a record of what he’s said in the last year, much less the last five or six years,” said Andra Gillespie, an Emory University political scientist, who is black. “You can’t just make one speech, have a good week and then all of a sudden think people are going to forget everything you’ve done. ” Some black conservatives, however, defended Mr. Trump. Wayne Dupree, a radio host, posted a live video to Periscope, an app that allows users to   video, saying that Mrs. Clinton had been tricking black people for years. He urged blacks to look at the conditions they were living under. “Look to the left, look to the right and look in front of you and tell me if things haven’t changed,” he said. “Then why do you keep voting for the Democratic Party? Why do you keep voting for the same side?” He urged blacks to help get Mr. Trump “elected so that we can change America. ”’ “America needs to go a different route,” Mr. Dupree said. The Trump campaign rejected criticism with a statement from Lynne Patton, a black woman who is an assistant to the Trump family, accusing Democrats of treating black voters as a “monolith. ” In Atlanta on Wednesday, Nate Cohen, 35, a health care information technology worker, was among the   unimpressed by Mr. Trump’s efforts. Mr. Cohen’s most generous interpretation was that perhaps Mr. Trump had not done his homework. Perhaps he needed to hit the streets and see the variety of the black experience. “I don’t recall ever seeing him going out into those hedges and highways,” he said. “You can’t just go on what you see on TV. ” Certainly, he said, some live in dire poverty. Mr. Cohen’s side job is as a motivational speaker, work that takes him to troubled neighborhoods. But he said blacks and Latinos were not the only people living in such conditions. He said he had tried to give Mr. Trump a fair hearing, but had been turned off to him long ago. Mr. Trump, he said, will say “warped” things  —   like proposing to bar Muslims from entering the country or deporting all illegal immigrants  —   and then say things to “patch it up. ” He wondered whether Mr. Trump was appealing to whites, reinforcing stereotypes about blacks. “You’ve got to be mindful of who you affect, and who you infect,” he said, adding that Mr. Trump might be “infecting” his white audience with racist ideas. Or as Ms. Scott put it: “He is giving voice to every stereotype he’s ever heard. I heard someone say, ‘It’s like he only watches “The Wire,” and that’s what he knows about black people. ’” At Six Feet Under, a seafood restaurant popular among blacks and whites, Anthony Simpson, 55, said he had heard Mr. Trump’s comments, but paid them little mind. He said he had long dismissed Mr. Trump as “a joke. ” Mr. Simpson, who owns a demolition business, said he was not surprised that Mr. Trump had offended many black people, after the things he had said about Muslims and Latinos. “He eventually was going to get around to it,” he said.'"}, "time": 1742561798.3207848}