{"duration": 1.6357905864715576, "input_args": {"text": "'There’s courtroom drama, and then there’s Supreme Court confirmation hearing drama. As the Supreme Court nominee Judge Neil M. Gorsuch goes through his Senate confirmation hearings  —   which are taking place in an overheated political climate, and after Senate Republicans last year refused to consider Barack Obama’s nomination of Judge Merrick B. Garland  —   here are five books that capture dramatic nomination hearings from the past. Ethan Bronner’s “Battle for Justice” (1989) dissects the hearings for Robert H. Bork, who was nominated by Ronald Reagan in 1987. According to The Times’s critic Christopher   the “mesmerizing” book lays out the intellectual and ideological reasons that Bork failed. (In short: Liberals got away with oversimplifying Bork’s ideas, and Bork himself did an ineffective job of articulating his philosophy and vision.)   said the book, a “vital portrait of a political process,” was not overtly political, but was instead “more history than argument, and extremely dramatic history at that. ” Bork’s hearings were highly contentious at the time. Then came the   1991 hearings for Clarence Thomas, defined by Anita Hill’s accusations of sexual harassment, a spectacle fully recounted in “Strange Justice,” by Jane Mayer and Jill Abramson. (Mayer, now a staff writer at The New Yorker, and Abramson, who eventually went on to become executive editor of The Times, were then reporters for The Wall Street Journal.) Margo Jefferson, reviewing the book in The Times in 1994, said it recreated the hearings “in all their sleaze and silliness: the high stakes and the low blows, the   moralizing punctuated by moments of   street talk. . . . But Ms. Mayer and Ms. Abramson also take us behind the scenes, where fierce political maneuvering determined the outcome: The White House lobbied fiercely for Senate votes, and new alliances were forged between white and black evangelical ministers. ” Thomas succeeded Thurgood Marshall, the first   to serve on the country’s highest court, and the   story of Marshall’s own hearings is told in Wil Haygood’s “Showdown” (2015). Segregationist Southern senators, including Strom Thurmond, opposed Marshall’s nomination. (Thurmond would end up being the only Republican to vote against the confirmation.) “I didn’t want to write a traditional biography,” Haygood told Baltimore magazine in 2016. “When I looked at his 1967 Supreme Court confirmation hearings and looked at the other nominees who came before him, it struck me as stunning that all the other hearings before the Senate Judiciary Committee lasted four hours or less. . . . I just thought everything that took place in room 2228, where the hearings were held, told this great story about this nation  —   how we got from there to here  —   and about the life of Thurgood Marshall. ” Marshall was not the first trailblazing justice to be subjected to the rigors of the confirmation process. Melvin I. Urofsky’s “Louis D. Brandeis: A Life” (2009) is a full,   biography, but it does include a look at the controversy that ensued after Woodrow Wilson nominated Brandeis to the Supreme Court in 1916. As Alan Dershowitz wrote, reviewing the biography in the Book Review: “Urofsky believes that his religion played less of a role than his radical approach to the law, but it is impossible to separate the two, because the bigotry of the day associated his alleged radicalism with his Jewish heritage. ” For a broader take on the history of the nomination process, one can turn to “Advice and Consent,” published in 1992 by   Paul Simon, of Illinois. In the Book Review, the legal scholar Ronald Dworkin wrote that Simon offered a “thoughtful, modest and shrewd appraisal” of his and the Senate’s performance during the nomination hearings for Thomas and Bork. The book also provided a history of other important confirmation struggles and made suggestions for reforming the process.'"}, "time": 1742564231.3085256}