{"duration": 0.10505199432373047, "input_args": {"text": "'Iran has announced that it will prevent United States citizens from entering the country in retaliation against President Donald Trump’s visa ban against Tehran and six other   countries. [In a statement issued Saturday, Iran’s Foreign Ministry stated, “Iran will implement the principle of reciprocity until the offensive U. S. limitations against Iranian nationals are lifted. ” The statement made a distinction between “the American people and the hostile policies of the U. S. government. ” It continued to suggest that the restrictions against Muslims traveling to America “are an open affront against the Muslim world and the Iranian nation in particular and will be known as a great gift to extremists. ”  Trump’s ban on travelers from seven volatile countries, including Iran, targets radical Islamic extremism but does not ban travelers simply for their Islamic faith. It is, however, a direct reaction to the rise in   extremism throughout much of the Western world. Iran remains one of the foremost abusers of human rights, and sponsors of terrorism, in the world. Trump signed the executive order on Friday, temporarily banning individuals from Iran, Iraq, Syria, Sudan, Yemen, Libya, and Somalia from entering the United States. The order also lowered the ceiling of refugees allowed to enter the United States to 50, 000 during FY 2017. Further, the executive order includes a temporary block on visas for 90 days for “immigrants and  ” from the aforementioned nations, and specifically directs the Secretary of State to “request all foreign governments that do not supply such information [regarding refugee vetting] to start providing such information regarding their nationals within 60 days of notification. ” There are more than 1 million   living in the United States, with the largest concentration of them living in Los Angeles, California. This ban imposed by the Iranian government would prevent them from traveling back to to Iran. A senior Trump administration official pushed back against the notion that Friday’s executive order was a Muslim ban. The official “listed off several predominantly Muslim countries that the order does not apply to. The official said that the United States still took in more foreigners than any other country in the history of civilization and said that the number of people impacted by Friday’s executive order was relatively small,” as reported by the New York Time‘s Michael Schmidt. Regarding Iran, the official “said that the White House is aware of reports that Iran plans reciprocal steps in response to Friday’s executive order, adding that if those measures are indeed reciprocal, it means that the Iranians will review each individual on a case by case basis. ” Earlier on Saturday, Iranian President Hassan Rouhani criticized Trump’s intended wall across the U. S.  border. In a speech that was broadcast on Iran’s   TV network, Rouhani said, “Today is not the time to erect walls between nations. They have forgotten that the Berlin wall fell years ago. ” He echoed that statement on Twitter, writing, “Let’s help neighboring cultures, not build walls between nations. Let’s not forget what happened to the #BerlinWall. ” Let’s help neighboring cultures, not build walls between nations. Let’s not forget what happened to the #BerlinWall.  —   Hassan Rouhani (@HassanRouhani) January 28, 2017,  Following former Iranian President Hashemi Rafsanjani’s death earlier this month, Rouhani similarly wrote, “Today all people came to bid farewell to a man who made history Let us use this mood to build a bridge instead of a wall. ” امروز برای وداع با آن مرد تاریخ\\u200cساز همه آمده بودند؛ بیاییم از این فضا برای دوستی، #آشتی و وحدت ملی استفاده کنیم. بجای #دیوار، #پل بسازیم. pic. twitter.   —   حسن روحانی (@Rouhani_ir) January 10, 2017,  According to Reuters, Rouhani also took aim at Trump’s withdrawal of the U. S. from the   Partnership (TPP) trade deal on Monday, while speaking to a tourism conference in Tehran. “To annul world trade accords does not help their economy and does not serve the development and blooming of the world economy,” Rouhani said. “This is the day for the world to get closer through trade. ” Rouhani is facing a tough reelection fight in May. Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742564498.1873941}