{"duration": 0.14012575149536133, "input_args": {"text": "'Former U. N. Ambassador John Bolton joined SiriusXM host Alex Marlow on Wednesday’s edition of Breitbart News Daily to discuss the prospective relocation of America’s Israel embassy to Jerusalem. [Bolton said he was “concerned that the pace appears to have slowed down” on the subject of moving America’s embassy to Jerusalem.   LISTEN: “I think one of the things that distinguished Donald Trump, and you can see it even in his first days in office, is during the campaign he said ‘I’m going to do X, Y, and Z’  —   and miraculous to behold, he’s actually doing it on so many different fronts, internationally and domestically,” he said.  “The kind of exception, at this point, appears to be moving the embassy. As I think we’ve commented before, you can move the embassy by taking the plaque off the wall at our consulate building in Jerusalem and putting up a sign that says ‘U. S. Embassy.’ You can build a bigger embassy, the   embassy, obviously over a longer period of time, but you could make the dramatic move quickly,” Bolton argued. “I very much fear that what’s happening is that foreign countries, the State Department, maybe some inside the administration are saying, ‘Oh, but it’s going to cause difficulties. People are threatening to riot. It’ll hurt the interests of Israel and the United States,’ and this and that and the other thing, which is what they say every time this issue comes up,” he said.  “But once you slow down, once you miss the chance to strike dramatically in the early days  —   and there’s a diplomatic phrase for that, of course, in French we say ‘making it a fait accompli,’ an accomplished fact  —   once you give up that opportunity, the cost actually mounts. And so we’ll see what happens. We’ll know more, I think, when Prime Minister Netanyahu of Israel comes in the next few weeks, and see what he and the President discuss,” Bolton anticipated. He allowed that moving the embassy “would certainly necessitate a lot of active diplomacy to calm down people who might be concerned about it,” but said reneging on Trump’s stated commitment to the move would be tantamount to “allowing other people, in other countries, to tell us who we talk to, where we put our embassy. ” For that reason, Bolton thought Trump did a “fantastic thing when he took a congratulatory phone call from Tsai   the president of Taiwan”  —   an unprecedented move that caused “a lot of heart murmurings in some quarters, and upset Beijing, heaven forbid. ” “Here is a case where the United States, for years, has let Beijing tell us who we could talk to in Taiwan. Just think about that for a minute. And now we have other governments telling us where we can put our embassy in Israel. Can they tell us where to put our embassy in Canada?” he asked sarcastically. “I’m not talking about relations with Canada or Israel. I’m talking about Germany saying, ‘Well, you can’t put your embassy in Canada there. ’”  “Obviously the Middle East is a sensitive area,” he conceded. “You want to be prudent, you want to be careful. But you ought to do what the United States needs to have done. The qualms that others may have are things you need to alleviate, you need to deal with, you need to be reasonable about it, but they’re not qualms that stop you from acting in your own interest. ” Bolton said it was “absolutely” a good thing that Israel has been “emboldened” to build more settlements by Trump’s election. “There’s a huge legal battle over what the status of the   occupied territories is, going back to the League of Nations mandate, and the assumption of the mandate by the United Nations in 1945, and the termination of the mandate in Israel’s declaration of independence in 1948,” he recalled.  “I mean, we could spend hours going through this. Here’s the reality: the U. N. in 1967 basically said, after the   War, Israel can trade land for peace. Up until the resolution Obama allowed to go through, two days before Christmas, that was the basis for peace in the Middle East. That was the basis for Israel’s peace treaty with Egypt, for its treaty with Jordan. It could have been the basis of peace with others. ”  “Israel has the land. Let’s forget the legalities. Israel has control of the territory. They believe it’s their land, dating back historically, and they’re building settlements on it. I tell you what, nobody’s going to stop them,” Bolton declared.  “You can either deal with that reality and look for what a solution for the Palestinians would be  —   I don’t think it’s the   solution, I think it’s giving parts of the West Bank to Jordan, putting it under their sovereignty, Israel keeping the rest. Or you can just enjoy the rhetoric about how settlements are an obstacle to peace, and it’s really terrible, and so on and so forth. It’s the same sort of threatening rhetoric that accompanies talk about whether the U. S. will move its embassy to Jerusalem,” he said. “So I think the real answer, I think the Israelis know what they’re doing. I think they’re going to create their own facts on the ground, which is what the United States ought to do with the embassy,” he suggested. Marlow turned to President Trump’s executive orders restricting immigration from several   countries, orders which are certain to stir up controversy. Bolton noted those countries were also places where “we can have little or no faith in the sustained ability of the   governments of these countries to be able to tell us honestly the backgrounds of a lot of people who are applying for visas. ” “There is no effective government in Yemen now, for example, just to name one. Or Syria, while we’re on the subject,” Bolton said. “It’s a temporary ban. I think Trump during the campaign, although he made sweeping statements earlier, came back by the end of the campaign to a program very similar to what Ted Cruz articulated, very similar to what the George W. Bush administration put in place after  : that you’re concerned more about applicants for visas from countries that are sources of terrorism than you’re concerned about applicants for visas from countries that are not sources of terrorism. ”  “I would be more concerned across the board about somebody from Syria applying for a visa than I am about somebody from Iceland applying for a visa,” he said. “This is not hard to figure out. It doesn’t have anything to do with religion. It has to do with terrorism. ” “So getting the system under control  —   and I think law enforcement and intelligence officials, even in the Obama administration, testified that we didn’t have adequate vetting for visa applicants  —   is sensible. It’s what Trump said he was going to do. Nobody should be surprised at this,” Bolton concluded. Commenting on the recent court setback for Brexit, Bolton said he didn’t think the ruling was “quite as bad as it could have been,” and doubted it would be a serious impediment to British Prime Minister Theresa May “negotiating Brexit on her terms. ” “Some of the things they didn’t do in the court ruling are important,” he noted. “Number One, there’s no reference in this issue to the European High Court, the highest judicial body of the European Union, which could have been fatal. Given the way   have been subordinated to the European Union, that was not entirely out of the question. So that’s one big win there. ” “Second, none of the   devolved parliaments  —   whether in Ireland, Wales, or Scotland  —   are going to have any say in it,” he continued. “The court ruled this is a national matter for the United Kingdom as a whole, and that’s great. So Nicola Sturgeon and the Scottish National Party can go pound sand on this one. It’s going to be decided in Westminster by the House of Commons and the House of Lords. ” “In fact, they said it’s not a question of the Prime Minister’s authority to take Britain out of the European Union treaty, it’s an issue dealing with statutory law in Great Britain, because so much European law over these past 30 years has been imposed on Great Britain that it would take an act of Parliament to begin the exit process,” Bolton observed. “I don’t think that’s really going to be an obstacle. I think they in fact are talking about introducing a bill this week. It can be a very short bill. ” “The Labor party and the Liberal Democrats can moan and groan about it all they want, but Theresa May has a solid majority, and I think they’ll push it through,” he predicted. “In fact, I think Labor, the Liberal Democrats in particular, will just do themselves more damage by saying, ‘You know, by God, just because the people voted to leave the European Union doesn’t mean they’re as smart as we are! We’re going to substitute our judgment for theirs and try and prevent it from happening.’ You know, knock yourself out if that’s what you want to do. I just think it’s politically foolish on their part. ” “But I would have preferred a cleaner victory,” he added. “I think this decision to withdraw is prospective only. I don’t see why you need a parliamentary vote. But given the majority the conservatives have, I don’t even think they can slow it down that much. ” John Bolton is a senior fellow at the American Enterprise Institute, and presides over his own political action committee, BoltonPAC. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the audio of the full interview above.'"}, "time": 1742562549.0246112}