{"duration": 0.14377355575561523, "input_args": {"text": "'“Those who make peaceful revolution impossible will make violent revolution inevitable.” – John F. Kennedy \\n \\nReadyNutrition Readers, this article may seem to be inconsistent with one of my recent ones in the form of a letter thanking those who attempted to make a change by voting in the last election. There is, however, no inconsistency of thought, as the efforts to emplace a president who will actually make a change are still laudable on your part: you tried to accomplish a return to a Constitutional Republic by using the vote within the system. As I mentioned in a recent article, “ Are Government Puppet-Masters Using Riots to Incite a Civil War? ” there is still a lot of civil unrest occurring.\\nIs this a revolution? No, it’s far from it. It is a disgruntled group of Americans being goaded into acts and actions of stupidity by paid and trained left-wing agitators at the behest of their Marxist paymasters. Concurrently, in my recent article, “We Will Not Go Gently Into the Night: the Silent Majority Speaks,” I mentioned this:\\n“The war is far from over to restoring our nation to a Constitutional Republic where the governors derive their just powers from the consent of the governed…that’s you and I…and making things completely right.” \\nSince the election as many of you have undoubtedly noticed, there has been a lot of backpedaling by our new president-elect on the issues of Obamacare and on the general issue of replacing Washington insiders with people who are dedicated to restoring the Republic. So far we are seeing the potential appointments of people such as Jamie Dimon, CEO for JP Morgan-Chase to Treasury Secretary, and Reince Pribus, Chairman of the Republican Party to Chief of Staff. We are also seeing that the promised fence across our southern border with Mexico may never materialize.\\nWe are also hearing quotes from Trump, saying (after his meeting with Obama last week) that “Obama is a good man,” and also that he will not bring any charges against Hillary Clinton after the inauguration. What’s the point to all of this? The point is this:\\nMany promises were made to the American people before the election in the campaign that may just vanish, and the “transition” may be just a changing of personnel without any real change to the establishment…the one that is broken (non-functioning) while it is breaking the citizenry in half. \\nThis is how revolutions start. One of the problems with a revolution in the U.S. is an artificial cultural homogeneity. The “Great American Melting Pot” is just that: it “melted” all of the ethnic diversity out of the culture…destroying ethnic neighborhoods that were once culturally divided (no enforced segregation, mind you…just one of existence…of people with similar origins and cultures living together) that was the strength of America’s greatness at one time (until the conclusion of World War II). As a matter of fact, WWII was the proof that a nation can be united in war although truly multicultural in peace.\\nDuring WWII, our greatest successes in discovering enemy plans in Europe came as a result of intelligence gathered by German-American and Italian-American citizens. They were kids born in this country with two naturalized American citizens as parents who had been immigrants. They grew up with the language, customs, and culture of Germany and Italy, respectively. Their parents contributed to society, working and paying taxes. When the time came, these American sons and daughters used their gifts, their inherited language and culture in the service of the United States in ways that could not have been accomplished without them. For more on this read about the Jedburgh teams and the OSS (Office of Strategic Services) operatives who parachuted into Nazi-occupied Europe behind enemy lines.\\nThe mindset of all of the different ethnicities in the United States gave us an edge, because we were able to develop new and innovative methods and equipment that came from a “pooling” of those different cultural geniuses. Cultures make each nation so unique with an invaluable perspective when it comes to technological advancement and problem-solving. Case in point: the atomic bomb was developed by (among many others) Albert Einstein, a German-Jew, and Enrico Fermi, an Italian physicist.\\nAfter WWII with the cessation of hostilities and the advent of the Cold War, little by little the ethnic neighborhoods shrank throughout the larger cities. The culture of naturalized immigrants and citizens who came in the prescribed and lawful manner was passed on with the traditions taught to their children born in the U.S. This immigrant culture bequeathed to the American boys and girls deteriorated to be replaced by the big-box, fast-food culture: now we’re homogenous – a culture of consumers and shoppers. Ask someone of their point of origin and heritage and you may either receive a stare of incomprehension or an “I don’t really know that much about my family,” or such answer.\\nAsk them about what stores are in the local mall and they can draw you a map . \\nThen came the l960’s, termed by many a “cultural revolution,” although it was nothing of the sort. It was a counter -revolution, because it went against the fabric of the society with an attempt to destroy the existing religion, ethics, and morals, and denigrate the structure of the core unit of American society: the family. It wasn’t a revolution. It was an insurgency , to take key traditional values, beliefs, and practices and replace them with concepts of Marxism and anarchy after labeling the denigrating behaviors as “freedoms” and “liberalism.”\\nAn erosion of our culture is what we’ve seen, and the current national protests are not a “revolution,” but a counter-revolution: they are a revolt against the peaceful revolution that occurred when you voted in the last election. The current national protests are an attempt by the Leftists to force a change in the vote and prevent the degraded culture from recovering. In our next segment, we will detail actual revolutions: their history, component parts, and how they work in either a positive or a negative manner. Until then, keep the powder dry and your eyes on the horizon! JJ out. \\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson was a Special Forces Medic, EMT and ACLS-certified, with comprehensive training in wilderness survival, rescue, and patient-extraction. He is a Certified Master Herbalist and a graduate of the Global College of Natural Medicine of Santa Ana, CA. A graduate of the U.S. Army’s survival course of SERE school (Survival Evasion Resistance Escape), Mr. Johnson also successfully completed the Montana Master Food Preserver Course for home-canning, smoking, and dehydrating foods.\\nMr. Johnson dries and tinctures a wide variety of medicinal herbs taken by wild crafting and cultivation, in addition to preserving and canning his own food. An expert in land navigation, survival, mountaineering, and parachuting as trained by the United States Army, Mr. Johnson is an ardent advocate for preparedness, self-sufficiency, and long-term disaster sustainability for families. He and his wife survived Hurricane Katrina and its aftermath. Cross-trained as a Special Forces Engineer, he is an expert in supply, logistics, transport, and long-term storage of perishable materials, having incorporated many of these techniques plus some unique innovations in his own homestead.\\nMr. Johnson brings practical, tested experience firmly rooted in formal education to his writings and to our team. He and his wife live in a cabin in the mountains of Western Montana with their three cats.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 21st, 2016 We Will Not Go Gently Into the Night: The Silent Majority… Are Government Puppet Masters Using Riots to Incite a Civil… Majority of Americans Now Believe That Debt Is a Necessity Surviving Occupied America, Part 2 Sign of the Times: Riot Control Gear Sales Are Soaring… '"}, "time": 1742561873.98644}