{"duration": 0.05604147911071777, "input_args": {"text": "'We Are Change \\nThe Democratic operatives exposed by James O’Keefe’s Project Veritas claimed in a hidden camera video that they were also behind the video of the 47% comment that cost Mitt Romney the election — not a random bartender as previously believed.\\nBreaking on @oreillyfactor tonight: Scott Foval reveals who was really behind the @MittRomney 47% video. #Veritas @PVeritas_Action pic.twitter.com/Zr5ANuzSdq \\n— James O\\'Keefe (@JamesOKeefeIII) October 27, 2016 \\n\\nAt a private fundraiser in 2012, Romney made the mistake of stating that 47% of Americans are freeloaders — which was reported to have been caught on camera by a random bartender who was working the event. \\n“There are 47 percent of the people who will vote for the president no matter what. All right, there are 47 percent who are with him, who are dependent upon government, who believe that they are victims, who believe the government has a responsibility to care for them, who believe that they are entitled to health care, to food, to housing, to you-name-it,” Romeny had stated. “That that’s an entitlement. And the government should give it to them. And they will vote for this president no matter what…These are people who pay no income tax.” \\nIn the newly released Veritas footage however, Scott Foval, the former field director of Americans United for Change, admits that they were actually behind the video which was released by David Corn of Mother Jones. \\n. @oreillyfactor breaks new video showing @woodhouseb / Scott Foval was responsible for @DavidCornDC video, not \"bartender\" pic.twitter.com/IxpfHdqpB6 \\n— James O\\'Keefe (@JamesOKeefeIII) October 27, 2016 \\n\\nFoval explains that his group has been doing “insertions” to interrupt fundraisers and rallies as far back as 2000 and 2004, against George W. Bush — and that they were responsible for the one that ended Romney’s campaign. \\n“They do it all over the country, yeah. And then I don’t know if you remember, well from, they are the ones who negotiated to get that lawyer in Florida who recorded the 47% video,” Foval states. \\n“Wait, I thought that was a bartender,” the undercover reporter asks. \\n“It was actually a lawyer at the event,” Foval explains. “It was not a bartender.” \\n“The lawyer took his phone and had the bartender walk around with it and set it up,” Foval continues. “It was a whole coordinated operation to get the phone in because they had taken away all the cell phones from all the staff and so what they did was they set it up in the room.” \\nFoval continued to explain that the organization has a team of approximately 25 people who conduct these operations. \\nIn previous video releases from Veritas, Foval reveals how his organization had been working to incite violence at Trump rallies, using a tactic called “bird-dogging.” \\nThe hidden camera videos have also revealed their step-by-step voter fraud strategy. \\nEarlier in the day, the organization released their fourth undercover video, where Robert Creamer of Democracy Partners claimed that he was on daily calls with the Clinton campaign, and accepts a potentially-illegal foreign donation. \\n“The more money that was promised to Creamer, the more access Project Veritas Action journalists seemed to get,” Project Veritas said in their release . \\nO’Keefe has filed a formal complaint with the Federal Election Commission against both Clinton’s campaign and the Democratic National Committee based upon the shocking revelations that his team has uncovered. \\nDuring a rally in Gettysburg on Saturday, Trump promised that he would also be suing the DNC for inciting violence at his rallies, based on what he saw in the Project Veritas videos. \\nThe post Project Veritas: Implicated Democratic Operatives Claim Credit for Romney 47% Video appeared first on We Are Change .\\n'"}, "time": 1742561741.6610088}