{"duration": 0.07879114151000977, "input_args": {"text": "'KAIFENG, China  —   The rooms where   Chinese men and women once assembled to pray in Hebrew and Mandarin are silent. Signs and exhibits that celebrated centuries of Jewish life have disappeared. An ancient well, believed to be the last visible remnant of a   synagogue, was recently buried under concrete and a pile of earth. After locking down Buddhist monasteries in Tibet and tearing down church crosses in eastern China, President Xi Jinping’s campaign against unapproved religion and foreign influence has turned to an unlikely adversary: a small group of Jews whose ancestors settled in this now faded imperial city near the banks of the Yellow River more than 1, 000 years ago. A few hundred residents had staged a lively, sometimes contentious rebirth of Kaifeng’s Jewish heritage in recent decades, with classes, services and proposals to rebuild the lost synagogue as a museum. Some residents even migrated to Israel. For years, the city government tolerated their activities, seeing the Jewish link as a magnet for tourism and investment. But since last year, the authorities have come down hard on the revival, in an example of how even the smallest spiritual groups can fall under the pall of the Communist Party’s suspicion. The government has shut down organizations that helped foster Jewish rediscovery, prohibited residents from gathering to worship for Passover and other holidays, and removed signs and relics of the city’s Jewish past from public places. “The whole policy is very tight now,” said Guo Yan, 35, a tour guide who advocates a distinctively Chinese strain of Judaism and runs a small museum in an apartment filled with pictures of Kaifeng’s Jewish past. “China is sensitive about foreign activities and interference. ” Only about 1, 000 people claim Jewish ancestry in this city  —   a drop in China’s ocean of 1. 35 billion people or Kaifeng’s population of 4. 5 million  —   and only 100 or 200 of them have been active in Jewish religious and cultural activities, experts say. Nobody outside the government seems to know for sure why this tiny band of believers came to be viewed as a threat. But officials appear to have become alarmed about their growing prominence sometime last year as Mr. Xi’s government demanded that religious groups and foreign organizations bow to tighter controls. Judaism is not one of China’s five   religions: Buddhism, Catholicism, Islam, Protestantism and Taoism. “Xi has said that religion is a major issue, and when he speaks, that has consequences,” said a burly local businessman who has supported the Jewish revival and who, like others here, asked not to be identified for fear of retaliation by the authorities. “They don’t understand us, and worry that we’re being used. ” He and many of Kaifeng’s Jews, as well as their supporters abroad, said the clampdown did not spring from outright   which is relatively rare in China. Shanghai and Harbin, a northeast city, have organized displays and events celebrating their role protecting Jews who fled persecution in Europe. “It’s fear about religion, not just us Jews,” the businessman said. Until a few decades ago, the Jews of Kaifeng seemed destined to fade away, an obscure memory at the intersection of two ancient civilizations. Their forebears, possibly merchants from Persia, settled in Kaifeng when it was the vibrant capital of the Northern Song dynasty and built a synagogue here in the 12th century. For hundreds of years, they prospered largely free of persecution, surviving the rise and fall of successive dynasties. But their numbers dwindled as they intermarried with China’s ethnic Han majority. The synagogue crumbled away. By 1851, when European missionaries acquired a   Hebrew Torah in Kaifeng and later presented it to the British Museum, few if any residents could read it. Still, even after decades of Communist rule, some residue of Jewish identity survived in Kaifeng. Parents and grandparents told children of their roots and warned them not to eat pork. The revival here took off in the 1990s as Jewish tourists, scholars and businesspeople from around the world who were curious about this remote outpost of Judaism began to visit and share their knowledge. Several years ago, two organizations, the   Institute and Shavei Israel, set up offices and offered classes in Hebrew, Judaism and Jewish history, partly to counter Christian missionaries operating in Kaifeng. “We began with our old generation, which had no foundation,” Ms. Guo said. “But then all these different Jewish groups came in, bringing in different ideas and values. ” The authorities were ambivalent, hopeful that the interest from abroad could help economic development in Kaifeng  —   a charming yet dilapidated backwater amid China’s frenzied growth  —   but also wary of foreigners and of Judaism, a   religion here. “Anytime it seemed to cross the line of publicity, that’s when there always would be a pushback against the Chinese Jews,” said Moshe Yehuda Bernstein, a researcher in Perth, Australia, who has written about the revival in a forthcoming book. “The idea was: We’ll let you do it, but don’t let anybody know about it. ” But the current clampdown has gone much further than previous ones, residents said. Some blamed a report in The New York Times last year in which a city official attending a Passover banquet spoke sympathetically about the revival, apparently violating government guidelines. Others cited accounts through the community grapevine that a Jewish woman from Kaifeng had won asylum in the United States after claiming religious persecution. “The Kaifeng Jews are in a kind of survival mode again,” said Anson Laytner, a retired rabbi in Seattle and past president of the   Institute, who has worked with the Jews in Kaifeng and drawn attention to the clampdown. The institute pulled out of Kaifeng last year after its community worker there, Barnaby Yeh, came under police scrutiny. “I think it was the actions of a government that’s paranoid,” said Mr. Yeh, a   convert to Judaism now living in Maryland. Shavei Israel, which had been helping Kaifeng Jews visit and settle in Israel, was forced by the police to close its community center in 2014. Residents tried to keep the center going in a rented apartment, but that was ordered closed this year, one of them said. Even signs of the Jewish historical presence have been erased. An inscribed stone marking the site of the old synagogue was removed from the front of a hospital that occupies the grounds, and workers buried the ancient well behind the hospital. Two hospital employees said city officials had ordered the changes. “All this says that there are no Jews here,” one Jewish man said as he nervously looked around during an interview in a teahouse. He was one of several Jewish residents I met in Kaifeng who said they wanted to reassure the government that they were   patriots. But they also said they were afraid of speaking publicly, even to declare their patriotism. “Please remember, don’t make us out to be political,” the man said. “We just want recognition as Jews. ” Jews can still gather in small groups in their homes to pray, and there have been no arrests, they said. But many said police or state security officers were monitoring them. “Before, the Chinese government was very relaxed, but now we’re under more restrictions,” said You Yong, a member of one of the city’s eight historically Jewish clans, who now observes Shabbat, the Jewish day of rest, at home. The local office of the party’s United Front Department, which manages ethnic and religious affairs, referred questions to the city’s state security service, which deals with political threats and espionage. Officials there declined to comment. Jewish descendants in Kaifeng do not automatically qualify as Jews under Israeli law because their ancestry has been so diluted. But Michael Freund, the chairman and founder of Shavei Israel, said the Israeli government should raise their treatment with Chinese officials. “It needs to be done respectfully and delicately, but it needs to be done,” he said. A spokeswoman for the Israeli Embassy in Beijing, Efrat Perri, said the embassy “recently became aware of the mentioned developments in Kaifeng” and would “look into it in order to gain a better understanding of the facts. ” The Jewish families I met in Kaifeng seemed determined to preserve their revived identity. Some decorated their homes with traditional candlesticks for Shabbat, grainy    photos of grandparents, drawings of Kaifeng’s destroyed synagogue, and maps of Israel. One Friday evening, two couples invited me to join their Shabbat service, for which they had been studying a Torah reading. “You don’t recognize me as a Jew,” the host said, “but I recognize myself as a Jew, and that’s what is most important. ” He broke bread with his brawny hands, and after ceremoniously drinking homemade wine, his guests shared shots of baijiu, a potent Chinese liquor. “Judaism,” the host said, “is all about endurance. ”'"}, "time": 1742628571.1033905}