{"duration": 0.1233670711517334, "input_args": {"text": "'By Jonas E. Alexis on October 26, 2016 Philip Giraldi: “The new Pearl Harbor turned out to be 9/11.\" …by Jonas E. Alexis \\n\\nFormer counter-terrorism specialist and military intelligence officer of the C.I.A. Philip Giraldi has recently nailed the 9/11 narrative by saying that “ Israel, Saudi Arabia, and Pakistan just for starters may have been involved in or had knowledge relating to 9/11…” \\nWe all ought to applaud Giraldi for starting to investigate some of those issues because Giraldi is not just your typical guy. He is a historian. He has a Ph.D. from the University of London in European history and has been working as an investigative journalist for years. \\nGiraldi was a C.I.A. officer for eighteen years in places like Turkey, Italy, Germany, and Spain. He also speaks several languages, including Turkish, Italian, German, and Spanish. He has written articles for MSNBC, Fox News Channel, National Public Radio, Good Morning America, etc. \\nAccording to Giraldi, the 9/11 attack was almost certainly another Pearl Harbor, which is to say that the government almost certainly had it coming. The Neocons and the Bush administration, says Giraldi, were part of the problem largely because they were “pushing to increase U.S. military capabilities so that the country would be able to fight multi-front wars. The signatories of the neocon Project for the New American Century paper observed that was needed was a catalyst to produce a public demand to ‘do something,’ that ‘something’ being an event comparable to Pearl Harbor. Seventeen signatories of the document wound up in senior positions in the Bush Administration. “The new Pearl Harbor turned out to be 9/11. Given developments since 9/11 itself, to include the way the U.S. has persisted in going to war and the constant search for enemies worldwide to justify our own form of Deep State government, I would, to a large extent, have to believe that PNAC was either prescient or perhaps, more diabolically, actively engaged in creating a new reality.” \\nVT writers and editors have been saying that the 9/11 attack was indeed a covert operation for quite a while. And this is not some kind of “conspiracy theory.” Even Fox News, of all places, got it right when they made it quite clear that the Israelis almost certainly had enough knowledge about the 9/11 attack: \\nIsrael’s fingerprints are all over the 9/11 attack. In 2011 at least 200 Israelis were arrested. 140 of those were detained by the FBI right before the 9/11 attack. Many of those Israelis “had used cover stories to gain access to sensitive government buildings and the homes of American officials.” [1] The Washington Post, [2] the Telegraph, [3] and other media outlets such as the widely read French newspaper Le Monde [4] began to ask why many of those people were arrested. No one was able to answer the question because those Israelis were never prosecuted. \\nAccording to John Farmer, former senior counsel to the 9/11 Commission, the 9/11 Commission report is unreliable and many who wrote the report were misled.394 These issues prompted a number of physicists and professors—at least 75 of them—to postulate that more evidence was needed for the airplane hypothesis. \\nOne of them, Professor David Gabbard, declared, “We’re academics and we’re rational, and we really believe Congress or someone should investigate this.” [5] These doubters have been labeled “conspiracy theorists.” According to Sylvain Cypel of Le Monde, there is no doubt that the Israelis—at least the Mossad—were aware of the 9/11 attack before it happened. [6] \\nGiraldi again should be praised for his moral and intellectual candor. The similarities between 9/11 and Pearl Harbor are quite striking. Former US Senate candidate Mark Dankof and I will be examining the issues revolving around Pearl Harbor tentatively at the end of this year. Giraldi concludes his analysis with a sober thought: “If it can be demonstrated that the attacks carried out on that day were quite possibly set up by major figures both inside and outside the political establishment it might produce such a powerful reaction that the public would demand a reversal of the laws and policies that have so gravely damaged our republic. It is admittedly unlikely that anything like that could ever take place, but it is at least something to hope for.” \\nIf Solzhenitsyn is right, then the Powers That Be can’t triumph forever. So, there is no need for despair and there is every reason to be hopeful. Solzhenitsyn put it best: \\n“Our way must be: never knowingly support lies! Having understood where the lies begin—step back from that gangrenous edge! Let us not glue back the flaking scale of the Ideology, not gather back its crumbling bones, nor patch together its decomposing garb, and we will be amazed how swiftly and helplessly the lies will fall away, and that which is destined to be naked will be exposed as such to the world.” [7] \\n[1] Ben Fenton, “US Arrests 200 Young Israelis in Spying Investigation,” Telegraph , Mar. 7, 2002. \\n[2] John Mintz, “60 Israelis on Tourist Visas Detained Since Sept. 11,” Washington Post , Nov. 23, 2001. \\n[3] Fenton, “US Arrests 200 Young Israelis,” Telegraph , March 7, 2002. \\n[4] Sylvain Cypel, “Vast Israeli Spy Network Dismantled in the US,” Le Monde , March 5, 2002. \\n[5] Christina Aquith, “Who Really Blew Up the Twin Towers?,” Guardian , September 5, 2006. \\n[6] Cypel, “Israeli Spy Network Dismantled,” Le Monde , Mar. 5, 2002. \\n[7] Alexander Solzhenitsyn, The Solzhenitsyn Reader (Wilmington: ISI Books, 2006), 558. Related Posts:'"}, "time": 1742564417.2047658}