{"duration": 0.07987475395202637, "input_args": {"text": "'WASHINGTON  —   There was no filibuster for Clarence Thomas, whose Supreme Court confirmation hearings provoked a national uproar over sex, race and the behavior of powerful men. Antonin Scalia, for a generation the court’s irrepressible conservative id, earned 98 votes in the Senate. Ruth Bader Ginsburg, now the patron saint of liberal jurisprudence, got 96. But with the Senate careering toward a   showdown over President Trump’s nominee, Judge Neil M. Gorsuch, the body’s long history of relative collaboration on Supreme Court matters has come to this: Next week, the last bastion of comity is expected to fall over a plainly qualified,   nominee who had no major stumbles in his hearings. And each party’s justification can often be summarized with a schoolyard classic: They started it. “I worry for the institution,” said Senator Susan Collins, Republican of Maine, who broke with her colleagues last year in calling for a hearing and a vote on Judge Merrick B. Garland, President Barack Obama’s own plainly qualified,   nominee. “I think, at the risk of alienating everyone I have to work with here, that there’s real shortsightedness on both parts. ” Leaders of both parties seem largely resigned to the next act. With Republicans eager to vote on Judge Gorsuch’s nomination next week, he is seen as unlikely to attract the support of at least eight Democrats, which he needs to reach the 60 votes necessary to overcome a filibuster. And the Republican majority, led by Senator Mitch McConnell of Kentucky, has hinted strongly that it intends to change longstanding rules to elevate Judge Gorsuch with a simple majority vote if necessary. Mr. Trump has encouraged such a move. The specter of Judge Garland, whom Republicans refused to even consider in a presidential election year, has hovered over Judge Gorsuch’s nomination from the beginning, leaving Democrats and the party’s progressive base to stew over what they view as a stolen seat. But veteran lawmakers and scholars of the court have absorbed the present tumult in a deeper context: a prospective Senate nadir achievable only after years of creeping institutional shifts, a mutual recognition of the judiciary’s capacity to accelerate a party’s agenda, and a bipartisan embrace of hypocritical arguments and counterarguments, adopted and abandoned with the political winds. “This is more the coup de grâce than a new beginning,” said Jeffrey Rosen, president of the National Constitution Center in Philadelphia and an author on Supreme Court matters. “It may indeed make it impossible for presidents to confirm any nominee at any point in their terms unless they also have control of the Senate. ” Some past flash points are familiar  —   charged enough to enshrine “Bork” as a verb and forever alter the connotations of Coke cans  —   rendered already in history as signposts of the electrified politics surrounding the court’s nominees. Other episodes, like the escalating partisan tensions over federal judgeships, served to erode Senate cooperation on judicial matters in less immediately perceptible ways. A surge in spending from outside groups, particularly on the right, has also increasingly lent the proceedings a   feel. Then there was the precursor in 2013, when Democrats controlled the Senate under Mr. Obama. Facing a blockade of the president’s appeals court and executive branch nominees, the party changed the rules to bar filibusters for such positions, but left the filibuster for Supreme Court nominations untouched. Republicans have not forgotten. “I say to my friends on the other side of the aisle, you’ll regret this,” Mr. McConnell predicted at the time. “And you may regret it a lot sooner than you think. ” The Senate Democratic leader, Chuck Schumer of New York, has indeed said he regrets his party’s choice then, when Senator Harry Reid of Nevada was the Democrats’ leader. But the Supreme Court was meant to be different. Under current rules, the minority party can still prevent a vote on a nominee if more than 40 members band together in the filibuster. If 60 senators invoke “cloture,” the filibuster is broken and a full vote can proceed, with only majority support required. In an interview on Thursday at his office in the Capitol, Mr. Schumer said his party’s efforts were about more than protesting the treatment of Judge Garland. He cited concerns over Judge Gorsuch’s record on workers’ rights and his degree of independence from Mr. Trump and conservative groups like the Federalist Society, which pushed for Judge Gorsuch’s nomination. “It’s not vengeance for us,” he said. “It’s not payback. ” There has never been a successful partisan filibuster of a Supreme Court nominee. In 1968, senators from both parties joined forces to block Justice Abe Fortas, whom President Lyndon B. Johnson sought to elevate to chief justice. Their obstruction  —   “ironically, in the middle of a presidential election year,” Mr. McConnell noted this week  —   centered on Mr. Johnson’s   status and ethical questions surrounding Justice Fortas, among other issues. The Senate’s rejection in 1987 of Judge Robert H. Bork signaled a newfound focus on judicial philosophy and temperament, not merely a nominee’s qualifications, as grounds for credible opposition. Four years later, Justice Thomas’s explosive hearings and narrow confirmation, by a vote of 52 to 48, cemented the process as inescapably political, even as the next   of Supreme Court confirmations often proceeded with a bipartisanship that has summarily vanished. And for all the outcry over Justice Thomas, no senator chose to filibuster him. “It was a function of norms of the Senate, not rules of the Senate,” said Martin B. Gold, a former senior Senate staff member who is considered an authority on the body’s procedures and protocols. “The rules would have permitted what the norms did not. ” Justice Thomas is one of two sitting justices, along with Justice Samuel A. Alito Jr. to have fallen short of 60 votes, complicating Democrats’ recent claims that Judge Gorsuch must be held to a   “standard” for confirmation. There is likewise, with respect to Judge Garland, no rule prohibiting the consideration of Supreme Court nominees eight months before an election. Sanford V. Levinson, a Supreme Court expert at the University of Texas School of Law, said the present enmity stemmed as much from bitter quarrels over   judgeships as from past clashes over Supreme Court picks. He noted the series of filibusters against judicial nominees under President George W. Bush. “The Democrats did escalate,” Mr. Levinson said. “And the Republicans in turn escalated further with regard to doing what they could to delay Obama’s appointments  —   and then the kind of ultimate escalation with regard to Merrick Garland. ” In the interview, Mr. Schumer argued that the treatment of Judge Garland was “worse than a filibuster. ” And no one, he added, is forcing the Republicans’ hand. “If they change the rules, it’s their volition,” he said. It has been a trying moment for the   institutionalists of the Senate, members with a particular attachment to the body’s rituals and norms. At the same time, Republicans have generally declined to assign themselves any blame for the rancor. This week, Senator Orrin G. Hatch of Utah, the   Republican in the chamber, said the Democrats’ pursuit of a filibuster had become “demeaning to the Senate and to this country. ” Last year, both Senator John McCain of Arizona and Senator Ted Cruz of Texas suggested that they might seek to keep Mr. Scalia’s seat vacant indefinitely if Hillary Clinton won the election. But there is perhaps no surer signal of the Senate’s lurch toward confrontation than Senator Patrick J. Leahy, Democrat of Vermont and the body’s   member. On Monday, Mr. Leahy was quoted as saying he was “not inclined to filibuster,” even as he expressed his opposition to Judge Gorsuch’s nomination. Hours later, as liberal activists scolded him, the septuagenarian senator issued a clarification on Twitter. “I am never inclined to filibuster a SCOTUS nom,” he wrote, leaving the requisite wiggle room. “But I need to see how Judge Gorsuch answers my written Qs, under oath, before deciding. ”'"}, "time": 1742628580.0412395}