{"duration": 0.12078380584716797, "input_args": {"text": "'Keywords: Cardiovascular , diabetes , dietary fat , heart disease , sugar , sugar industry \\nSugar “does not have a unique role in heart disease.” When it comes to dietary claims made by the sugar industry, we need to take them with a grain of salt. \\nResearchers at the University of California, San Francisco have uncovered documents and communications dating back as far as the 1960s, revealing that the SRF (Sugar Research Foundation, now known as the Sugar Association) funded research to serve its own interest: to create a sweet image of sugar. \\nAt the time, heart disease was on the rise as was the consumption of dietary fat and sugar. Instead of trying to determine the true cause for the higher occurrence of the disease, the biased research focused everyone’s attention on fat. \\nUCSF’s finding, published in JAMA Internal Medicine, shows researchers at leading universities, including Harvard, were paid by the SRF in an effort to portray dietary fat as the major cause of heart disease. In the process, sugar’s role in the fatal disease has been ignored. Singing the Praises of Low-Fat Foods \\nAs a result of the biased research published in many esteemed publications, life in the second half of the 20th century was filled with misleading dietary recommendations and scary headlines. \\nWarnings regarding the dangers of dietary fat ran rampant. Eating fat, especially the saturated variety, was equivalent to clogging your arteries. Even eating an egg, containing 5 grams of the forbidden macro-nutrient, was considered a luxury not to be indulged in more than once per week. \\nLow-fat diets became the craze. In fact, “low-fat” labels decorated food packaging throughout groceries stores, from yoghurt aisles to frozen sections. Consumers felt good whenever they chose low-fat varieties over standard options. \\nYet this sense of well-being generated by the low-fat fad was unfounded. To add flavour to low-fat foods, sugar was the usual substitute. And the truth that has been uncovered is that sugar is a secret killer. It contributes not only to obesity and diabetes, but also to the leading cause of death worldwide: cardiovascular disease (CVD). A Time for Change \\nRecently the sugar industry’s funded research has been challenged by unbiased studies which reveal sugar to possess the unwelcome property previously, and falsely, attributed to fat: it leads to atherosclerosis. \\nJAMA Internal Medicine has published a study by a team of UCSF researchers showing that sugar, aside from causing diabetes and tooth decay, sets into motion several changes that bring on heart disease. In this study, the diets of 43 children were changed to replace added sugar with starch while maintaining the same amounts of protein, fat, complex carbohydrates, and total caloric intake. The results showed beneficial effects on LDL cholesterol and triglyceride levels as well as diastolic blood pressure. \\nAnother study, undertaken by researchers from Saint Luke’s Mid America Heart Institute and Albert Einstein College of Medicine and published in Progress in Cardiovascular Diseases, showed that consuming diets high in added sugar caused an increase in LDL (bad) cholesterol, total cholesterol, and triglycerides while lowering HDL (good) cholesterol. \\nThe new research results have brought about a change in worldwide dietary guidelines. From governmental associations to medical organisations and private practitioners are warning consumers and patients about sugar’s toxicity. \\nThe U.S. Dietary Guidelines for 2015 to 2020 recommend that added sugars make up less than 10 percent of a person’s daily calorie consumption. While the main reason for this recommendation is that added sugar constitutes empty calories and leads to a nutrient-deficient diet, the Guidelines also acknowledge that there is “strong evidence…lower intake of sources of added sugars are associated with reduced risk of CVD in adults.” \\nThe American Heart Association warns that “too much added sugar in your diet could significantly increase your risk of dying from cardiovascular disease.” It recommends lowering dietary sugar intake even further to a maximum of 6 teaspoons and 9 teaspoons for women and men, respectively. How Can Something Sweet Be So Bad? \\nAccording to one cardiologist, Dr Stephen Sinatra, sugar delivers its damage to the cardiovascular system via a surge in insulin. High levels of insulin wreak havoc on blood vessels’ endothelial linings. An inflammatory response ensues, causing the walls of the blood vessels to become clogged. In this way, the stage is set for heart disease. \\nAdd to that the well-known fact that sugar leads to diabetes, which raises the risk of heart disease, and the overall danger is compounded. Addictive Properties Exacerbate the Problem \\nIt seems that the sugar industry pushed us toward a secret killer just like the tobacco industry did. This notion seems even more valid in light of medical claims that sugar, like nicotine, is an addictive substance. \\nIn medical circles, addiction is an altered state of the brain which causes repetitive behaviour despite negative consequences. Experts state that studies on rats prove sugar to be more addictive than cocaine. \\nWhen our bodies digest sugar, they release dopamine and opioids. These neurotransmitters play a key role in the brain’s reward centre, which in turn causes addiction to the same substance that set off too much activity in this pleasure circuit. So What Do We Do Now? \\nWe need to gather public funding to carry out unbiased research on consumer goods, including foods. \\nFood labels should allow consumers to identify easily how much added sugar is present in every food item. \\nEvery processed food item should not be allowed to contain more than 10 percent of its total calories from added sugars. \\nWidespread education regarding sugar’s toxicity should reach from the classroom to our doctors’ offices. \\nEveryone deserves the chance to break the cycle of sugar addiction. \\nSources:'"}, "time": 1742561784.9254901}