{"duration": 0.09131217002868652, "input_args": {"text": "'The accusation that President Donald Trump’s 2016 campaign colluded with the Russians, and that he is trying to cover it up, looks increasingly like a classic Russian disinformation campaign  —   one designed to bring down the only president since the Cold War who has actually been willing to confront Russia in any meaningful way. [It is an article of faith on the left that Russia wanted Trump to win the election because Vladimir Putin anticipated a more pliant approach, signaled by Trump’s explicit desire to negotiate a better relationship. But the Russians may just as well have preferred Hillary Clinton, who had given Russia everything it wanted while serving as President Barack Obama’s Secretary of State  —   from the   “reset,” to a surrender of U. S. missile defenses in Eastern Europe, to the sale of 20% of America’s uranium reserves to a Russian company closely tied to the Russian state.  It is more plausible to suggest that Russia simply wants to disrupt American politics if it can get away with doing so, and would do the same regardless of which candidate won the election. Even if  —   for argument’s sake  —   Putin once preferred Trump, that would not preclude him from trying to undermine President Trump now, if possible. And in the “ ” complex, Putin has found a particularly potent weapon, aimed directly at the president. One could not imagine a better way to create havoc for an adversary  —   and the left is playing into the enemy’s hands, eagerly and mindlessly, forgetting its own slavish enthusiasm for Russia for nearly a century. Holman Jenkins, writing in the Wall Street Journal on Saturday, notes that Putin found a unique vulnerability in the   of contemporary American politics, which makes devotees on either side more willing to believe the worst about the other. Partisans on both sides might share a conspiratorial mindset when relegated to opposition status, but only the Democrats can harness the alchemy of the mainstream media to “normalize” fringe theories. Regardless, the flimsiness of the evidence against Trump is a clue. Jenkins notes that it was a dubious “dossier” that alleged that Russia had dirt on Trump that caused much of the initial suspicion last year  —   and that it may well have been fed by Russian sources for that purpose. Add to that the recent revelation that FBI director James Comey suspected that a key email  —   purportedly hacked by Russians, and which implicated Attorney General Loretta Lynch in a scheme to suppress any FBI investigation into Clinton  —   was a fake, and a pattern seems to emerge. Moreover, many of the recent intelligence leaks that have attempted to tie Trump to Putin have been   at best  —   in some cases, laughably so. The information that has been leaked could well have been fabricated  —   or at least fed to unwitting U. S. Intelligence sources who were ready to believe, and convey, the worst. Sen. Lindsey Graham  —   an early critic of Trump’s Russia policy  —   said as much on Sunday, when he speculated that an intercepted message from the Russian ambassador to his bosses back home, claiming that Jared Kushner wanted to set up a “back channel,” could well have been a   exposed on purpose to be intercepted by the U. S. Regardless, Trump is almost certainly right that the Russians are “laughing” at us. The entire political and media establishment is utterly consumed by an obsession with Russian influence for which there is no actual evidence. It is a hysteria worse than that of the McCarthy years, because in those days there really were American communists trying to take over the U. S. government on Moscow’s behalf. Thanks to the “  complex,” this may be the most powerful Russian disinformation campaign ever, and stands on the verge of bringing the American Republic to its knees. Journalists and elected Democrats are busily slapping each other on the back for “standing up for democracy. ” To the extent that they believe it  —   when they are doing the opposite  —   Russia is surely grateful. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563013.1595638}