{"duration": 0.0858154296875, "input_args": {"text": "'Share This \\nDonald Trump’s Diversity Chairwoman Brunell Donald-Kyei has been laying waste to anyone who takes her on, and she just shredded one of Michelle Obama’s favorite spokesmen, Brian Benjamin, who now works on Hillary Clinton’s campaign. When it came to the race card, Brunell was lethal, cutting down his every liberal lie. She tore him apart, then kicked him to the curb, as another Michelle and Hillary spokesman bit the dust. Michelle Obama’s favorite pundit Brian Benjamin (left), Hillary & her hot sauce (middle), Brunell Donald-Kyei (right) \\nBrian Benjamin kept an arrogant smile on his face as Donald Trump’s Diversity Chairwoman Brunell Donald-Kyei surgically sliced through Hillary’s pandering to the black community. They appeared on Fox and Friends a few days ago and the video is only getting more popular as interest in Brunell’s tactics is making headlines. \\nUnsurprisingly, Fox & Friends Monday has been focusing on the latest to emerge out of the WikiLeaks scandal, and one detail concerning the use of the phrase “ yo mama ,” suggested a pandering effort to an African American crowd by Clinton earlier this year. Joining Fox & Friends to discuss was vice-chair of the Trump National Diversity Coalition Brunell Donald-Kyei who said, “The pandering is not working. Black people just want a real seat at the table.” [via Mediaite ] \\nAs Brunell laid Benjamin out cold, he had to pull out the race card, but that was a wrong move. Brunell was waiting for it, and she launched into a tirade that made Hillary and her “hot sauce” in my purse comment look as stupid as it sounded, as poor Steve Doocy tried to moderate. \\nBrunell went off, saying the communities need jobs, not hot sauce and “yo mama” jokes. She added that the black community wants empowerment and the Democratic party to keep its promises. Benjamin was quick to interrupt, alleging Trump talks about law and order but ignores systemic issues between the community and the police. However, Brunell wasn’t about to let him get away with his lie. \\nShe quickly pointed out that mass incarceration happened under Bill and Hillary Clinton, telling Benjamin that he knows that too. “His wife [Hillary] was ok with that. So don’t go there,” she said. “Let Donald Trump fix it. Let a person who is a builder and a doer fix it.” \\nBenjamin tried to retort, calling Trump a racist, and that’s all it took to really cause Brunell to unleash. “ Not a loser, not a taco bowl, or needy Latino? Really? Are we going there? Catholics are bastardized. Are we going there? “ she asked, referring to the WikiLeaks emails that exposed the Hillary camp’s true thoughts and nasty remarks about many Americans. \\nBenjamin shot back, “Yea, let’s go there,” before Brunell finished him off, saying, “I went there, WikiLeaks is out in the streets, Sir. I read WikiLeaks. I read about the corruption.” \\nThis exchange proves that when these Hillary shills get beat, they turn to the race card every time. When Brunell hears that, as a black woman, she can go full throttle at Benjamin, and his nervous laughter and scoffing means he is embarrassed and lost this argument, which shreds Hillary’s whole narrative about why Americans shouldn’t vote for Trump. \\nHillary is a one note wonder. She has no positive record to run on, and her whole campaign is based on bullying Trump supporters. In her narrative, Trump is a Nazi and so are those of us who support him. So, we are fair game to be bullied — on the internet or in person as we have seen the paid thugs do. \\nIt’s all smoke and mirrors because it just doesn’t hold true, and Brunell brought that out as she left Benjamin, one of Hillary’s token black spokesmen, to languish as he failed to make anyone believe the lie Hillary is trying to sell to Americans. This is all Hillary’s got to run on, and it will not be enough to win.'"}, "time": 1742561861.2053404}