{"duration": 0.04632067680358887, "input_args": {"text": "'First Lady Melania Trump wept as    Marlana VanHoose sang the hymn “How Great Thou Art” during the Inaugural Prayer Service at the Washington National Cathedral in the nation’s capital on Saturday morning. [Hundreds of worshippers joined President Donald Trump the First Lady Vice President Mike Pence and his wife, Karen most of the Cabinet and Supreme Court Justice Anthony Kennedy for an ecumenical prayer, featuring a wide variety of faiths.  The service, which has become part of the inaugural tradition over the past several decades, sounded a message of national unity, echoing a theme that featured in several of Friday’s inaugural addresses as well. On Saturday morning, with politicians seated in the pews as ordinary congregants, and religious leaders and laypeople leading them in prayer, without the pomp and ceremony of the day before, there was a sense of humility shared by all in the chapel, as well as a palpable sense of joy. There were many highlights from the deeply moving service. VanHoose, however, provided the service’s most poignant moment. VanHoose  —   who is blind, and has mild cerebral palsy  —   performed the   hymn, whose words include: “I see the   hear the rolling   power   universe displayed. ” (Watch the videos below from different angles.)  The First Lady, seated in the front row, appeared to wipe away tears several times, and rose to her feet to lead a standing ovation when VanHoose had finished. Rabbis, imams, and representatives of a variety of Christian denominations, as well as several other faiths, offered songs and readings. The Jewish text, for example, was 1 Kings 3:   on King Solomon’s prayer for wisdom  —   and God’s answer. This reporter was quoted by Voice of America: “I felt in many ways this was the heart of the inauguration,” Pollak said. “It was the nation coming together in humility, praying together and asking God for help. ”   …     Political divisions among Americans are part of life, and perhaps they will be felt more intensely in the coming months, Pollak added, “but hopefully those who were present [at the cathedral] and those who watched throughout the country will remember how joyful it was to be together, because it’s moments like these that will guide us through the difficult times. ” UPDATE: President Trump’s eldest son, Donald Trump, Jr. tweeted a video of VanHoose’s performance with the comment: “One of the most incredible and moving performances I’ve seen from yesterday’s #NationalPrayerService. ” One of the most incredible and moving performances I’ve seen from yesterday’s #NationalPrayerService https:  .  via youtube,  —   Donald Trump Jr. (@DonaldJTrumpJr) January 22, 2017,  Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742564415.6918774}