{"duration": 0.02408313751220703, "input_args": {"text": "'\\nWell, well, well…take a look at this, from NBC :\\nThe FBI will re-open its investigation into Hillary Clinton’s use of a private email server, bureau director James Comey said in a letter to the Senate Judiciary Committee on Friday.\\n“In connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation … I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation,” he wrote.\\nHere’s the letter:\\nFBI Director Comey, in letter to members of Congress, says FBI is investigating additional emails in Clinton private server case pic.twitter.com/Ue0qlhqT5w \\n— Bradd Jaffy (@BraddJaffy) October 28, 2016 \\n\\nThe language in the FBI letter to Congress makes it clear that new evidence has been discovered and will be reviewed — meaning FBI agents will read these emails. NBC reports that it is “…unusual for the FBI to tell Congress it is looking over newly discovered evidence in a criminal inquiry that was otherwise closed.”\\nFBI Dir just informed me, \"The FBI has learned of the existence of emails that appear to be pertinent to the investigation.\" Case reopened\\n— Jason Chaffetz (@jasoninthehouse) October 28, 2016 \\n\\nWe are two weeks away from the end of the ridiculous circus that is this (s)election.\\nWhat kind if impact will a new investigation have (if any)? Clinton supporters certainly seem to defend her no matter what, and some believe she’s long been the Chosen One. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Lily Dane of The Daily Sheeple . \\nLily Dane is a staff writer for The Daily Sheeple. Her goal is to help people to “Wake the Flock Up!” '"}, "time": 1742628404.4503489}