{"duration": 0.039768218994140625, "input_args": {"text": "'The American Voter The American Voter \\nEvery four years, against anyone’s better judgment, the American people are entrusted to elect the next president. The Onion lets them tell their stories. The One Percenter MICHELLE CLARK, 22 \\n“I know exactly what I want in our next president, but look, we both know what’s going to happen if this interview ends up online: my Twitter account will be flooded with vulgar, misogynistic comments and brutal attacks on my appearance. I could talk about my thoughts on the economy or immigration, but the more thoughts I share, the more material I’m giving to some Reddit user who will tell me to perform the most perverse act he can think of and then tear into me for having an opinion—any opinion. So what’s the point of saying anything? Let’s just end this interview now.” The Millennial ZIAD AYOUB, 37 \\n“I don’t like those presidential candidates. Not a single one of them. They just don’t value human life like you and I do. I ask myself all the time how anyone could believe all the barbaric things these people believe. They refuse to see any point of view other than their own, and they have no problem going around and blowing up people that aren’t like them. I know they’re out there plotting horrible things right now. I don’t want them anywhere near me. I’ve got a wife and kids—think of what they might do to my family.” The Senior Citizen COURTNEY YOUNG, 36 \\n“I’m a single mom juggling three kids and a full-time job, so I don’t have time to listen to any long policy speeches. I know life’s going to get worse over the next four years, so the candidates need to just cut to the chase and tell me how shitty it’s going to get. Are you going to dick me over on my taxes? Dick me over on my kids’ medical bills? Dick me over on gas prices? I’m voting for whoever has the sack to come right out and say it.” The Immigrant Voter Voices The Onion asks ordinary citizens to share their thoughts, concerns, and staggering ignorance about the 2016 election. 1 What’s the most important quality for the next president to have? Scott Pullman '"}, "time": 1742563888.1058853}