{"duration": 0.04523611068725586, "input_args": {"text": "'Market analysts are anticipating an increase in fresh food sales as a result of the   Foods merger, according to a CNBC report. [Such a shift in the market would hurt brands like General Mills and Kellogg, according to the report. The transition from a mixed emphasis on processed and fresh foods to a greater emphasis on fresh products will hurt brands like Kellogg, who focus almost exclusively on processed foods.  “I would say it’s the smaller brands that are going to be most affected. Conagra and the midtier companies are probably going to be the most hurt. There’s probably a lot of independent brands that are owned privately around the country that have the least pricing power and will be hit hard by this,” Bernstein analyst Alexia Howard told CNBC. It’s not good news “for the cereal companies, but it’s generally not good news for packaged companies. ” Shares of Kellogg Company and General Mills declined sharply when the   Foods   was announced. Market trends suggest that consumers are moving away from processed foods and towards fresh products. Analysts suggest that the   Foods merger will serve to accelerate this market shift. “Shifts in the retail environment, particularly in North America, may pose risks broadly for   processed food manufacturers, including General Mills. Consumers continue to drive away from processed foods,” wrote Piper Jaffray analyst Michael Lavery ahead of the merger. “We expect continued downward pressure on pricing from intense retail competition, driven by retailers like Walmart, Aldi and Lidl and online retailers, too. ” Other analysts have credited online information with inspiring the move away from processed foods, which many now argue are bad for the consumer’s health. Bernstein analysis Alexia Howard claimed that consumers have developed a mistrust of legacy brands such as General Mills as a result of online dialogue on the health ramifications of eating processed foods. “That’s allowing new challengers or small brands gaining market share, and you’re seeing a fragmentation of the industry. Consumers, particularly mothers of small children, have started to talk about what’s in our food,” said Howard. “It’s created a distrust of the legacy products. That’s what’s reduced barriers to entry and allow a lot of new brands to come up, and that’s another big challenge. ” As the food market evolves, processed food companies like General Mills and Kellogg may be forced to shift the focus of their production to introduce some fresh food offerings. Kellogg announced in November that it was pulling ads from Breitbart. com because its 45, 000, 000 monthly conservative readers were not “aligned with our values as a company. ” In response, Breitbart News, one of the world’s top news publishers, launched a #DumpKelloggs petition and called for a boycott of the ubiquitous food manufacturer. Shares of Kellogg have declined by 9. 3 percent since the #DumpKelloggs campaign began. Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742564030.1932049}