{"duration": 0.11070442199707031, "input_args": {"text": "'On June 12 the New York Times editorial board claimed that President Trump is “helping terrorists” by refusing to talk gun control after London’s June 3 terrorist knife attacks. [Moreover, even though terror attacks are becoming more frequent in Britain and the whole of Europe, the NYT lauds Britain for putting  “civilian safety” before gun rights.  How safe were the civilians who walked on London Bridge June 3? The impetus behind the NYT editorial was Trump’s June 4 tweet: Do you notice we are not having a gun debate right now? That’s because they used knives and a truck!  —   Donald J. Trump (@realDonaldTrump) June 4, 2017,  The NYT reacted by describing Trump as “the candidate of the National Rifle Association” and suggested he did not want to talk gun control after the June 3 attacks because he “prefers to discourage any debate in this county about the lethal role played by easily obtainable guns. ” The NYT completely misses the fact that the June 3 attacks happened in London, not here, and they were carried out with knives, not guns. They also avoid connecting the dots. That is, they describe all the gun controls Britain has put in place but they fail to recognize that the controls were impotent to stop the June 3 attacks. If anything, those controls made the attacks easier to carry out because such controls meant Londoners would be defenseless. France has gun controls which are very similar to those in Britain, yet in 2015 alone terrorists were able to shoot 142 Parisians to death. This is why Trump spent time on the campaign trail stressing that gun control is not the answer but an armed citizenry is at least part of the answer. During a January 10, 2016, appearance on Meet the Press, Trump stressed that terrorists need to feel the sting of bullets being shot back at them. He said: If in Paris or if in California recently, where the 14 people were killed and probably others to follow —  in terms of that group because you have some people who are very, very badly wounded —  if in Paris they had guns or if in California [they had guns,] on the other side, where the bullets go both ways, not just in one direction. You wouldn’t have had the kind of carnage that you had. Gun control is not the answer. London has gun control —  the whole of Europe has gun control —  and they also have   terror attacks, knife attacks, truck attacks, and hammer attacks. They face attacks from rudimentary weapons and those attacks are often successful because they people lack a means to defend themselves. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com'"}, "time": 1742562691.828183}