{"duration": 0.10220050811767578, "input_args": {"text": "'Donald Trump Says Hillary Clinton Will Start WWIII With Russia, but Moscow Disagrees (Video)   Juan Cole / Informed Comment \\nDonald Trump alleged on Tuesday that if elected, Hillary Clinton would start World War III with Russia over Syria. He wondered how Clinton would be able to negotiate with Putin, whom she has demonized, and said that her plan for a no-fly zone over Syria would bring her into military conflict with the Russian Aerospace Forces flying missions over that country. To be fair, as the BBC points out, the US generals do share Trumps concerns in this regard. \\nJoseph Dunford, the Chairman of the Joint Chiefs Marine General Joseph Dunford, told the Senate Armed Services Committee, “Right now, senator, for us to control all of the airspace in Syria it would require us to go to war, against Syria and Russia.” \\nTrump pointed out that Russia has a nuclear arsenal, making brinkmanship with it extremely risky. \\nTrump is not reckoning, however, with Clinton’s extensive experience as Secretary of State, a job that is all about negotiation and horse trading and compromise. In fact, the position has pragmatism so baked into it that its incumbent often offends ideologues in Congress. It is no wonder that the office has not been a springboard to the presidency since the early decades of the republic. \\nSuperpowers don’t fight one another in the nuclear age. If Russia brandishes enough threats and weaponry, it will simply dissuade Clinton from her proposed no-fly zone. Ike Eisenhower back down over Hungary in 1956, and Johnson did nothing about the crushing of the Prague Spring in 1968. Russia is claiming Syria as a sphere of influence, and while the US is contesting that claim, it is unlikely to go mano a mano with Moscow over it. \\n  \\nSuperpowers fight proxy wars like Vietnam and Afghanistan. So is it possible that Clinton will give Syrian rebels shoulder-held missile launchers to use against Russian fighter jets? Sure. Although one reason that hasn’t been done is that they could end up being used against the Israelis. In any case, that Clinton will engage in a proxy war with Russia over Syria with far more vigor than President Obama is fairly obvious. That it will spiral out of hand is actually fairly unlikely, though it can’t be ruled out. \\nInterestingly, many high Russian officials and commentators in the Russian press, according to BBC Monitoring, do not agree with Mr. Trump, and indeed see Clinton as the pragmatist: \\n“Moskovsky Komsomolets (popular Moscow daily) www.mk.ru –“The Russian leadership hopes that pragmatism will prevail in US foreign policy after the presidential election… And Hillary Clinton is the one whom the Kremlin sees in the role of this main foreign policy pragmatist… Trump would, of course, be a more convenient partner than Clinton but the Kremlin has realised: no matter what its wishes and preferences are, Trump will not become president…” \\nThe article continues that it is the Kremlin that is playing brinkmanship, not Clinton, saying that Moscow has deliberately made relations so tense that Clinton may be forced to back down rather than risk a hot war. Editorial writer Mikhail Rostovsky does admit that if Clinton instead ratchets up tensions, “things could get out of hand.” \\nRussian journalists and officialdom seem largely to have written off Trump. Victoria Zhuravleva, senior researcher at the Russian Academy of Sciences’ Institute of International Relations and World Economy, wrote in Lyubov Glazunova that “the campaign for Trump is most likely to be over.” \\nStanislav Ivanov, “Carte blanche. Storming Mosul: what is next?”; bit.ly/2e5JL0b in Nezavisimaya Gazeta (centrist daily) www.ng.ru , says that Washington’s policy is to turn the Middle East into an arena of conflict between the Gulf monarchies and Iran. He expects the Mosul campaign to be prolonged, but for the Baghdad government to win in the end: “Under this scenario, Iraq and Syria may remain hostages to this confrontation for years to come and turn into a ground of permanent armed conflicts. The overseas puppet masters will try to take advantage of the existing ethnic and religious conflicts in the region.” \\nThe Russian press is also not concerned that Russia will be sanctioned over its air campaign against fundamentalist rebel forces in East Aleppo. \\nSo, rather than the chicken little hysteria of Trump about a world war and nuclear exchanges, many in the Kremlin see him as less pragmatic than Clinton and are expecting to work with her. They have already discounted the possibility of a Trump presidency, and so are readying themselves for a Clinton administration. The Russians met with Clinton a lot when she was Secretary of State and so know her well. They think she will blink rather than take US-Russian relations to the boiling point, and they admit that the Kremlin as the one playing brinksmanship. Trump can’t even get support for his wild charges from the the Kremlin itself, which sounds positively even-handed and practical in comparison. TAGS:'"}, "time": 1742561747.782609}