{"duration": 0.04706311225891113, "input_args": {"text": "'Açık ittifak, uzun itaat yazan Manlio Dinucci Barack Obama, ülkesini İtalya ile bir araya getiren « açık ittifak [ve] uzun dostluk » ile haklı olarak övündü. Gerçekten de bu Avrupa ülkesi, ABD’li efendisine çeşitli anlaşmalarla ve uzun bir uygulama ile boyundurukla bağlı durumda.\\nVoltaire İletişim Ağı | Roma (İtalya) | 2 Kasım 2016 français italiano English Español Parlamento muhalefetinin sessiz suç ortaklığında ulusal politikamıza müdahale ederek, İtalyanları referandumda « Evet » oyu kullanmaya çağıran Başkan Barack Obama, « yakın dostu Matteo (Renzi) »’ya, İtalya ve ABD arasında « açık ittifaklar, uzun bir dostluk » olduğunu söyledi.\\nİttifakların ve her şeyden önce İtalya’yı ABD’ye boyun eğdiren Atlantik İttifakının açık olduğu konusunda hiçbir şüphe yok. Avrupa Müttefik Yüksek Komutanı hala ABD Başkanı tarafından atanmakta ve diğer tüm kilit komutanlıklar ABD’nin elinde.\\nSoğuk Savaşın sona ermesinden sonra, SSCB’nin bölünmesi ertesinde Washington, « ittifakın komuta yapısını –yani ABD komutasını- mayınlayacak sadece Avrupalı aygıtların kurulmasını engelleyerek, NATO’yu bir nüfuz ve ABD’nin Avrupa işlerine müdahale kanalı olarak korumanın temel önemini » belirtiyordu. Jens Stoltenberg, « Avrupa büyük fikri » üzerine yapılan yuvarlak masa toplantısında şöyle diyordu: « Avrupa savunmasının güçlendirilmesinin bir tür NATO’nun tekrarı olmamasını, NATO’ya seçenek haline gelmemesini sağlamalıyız ». Bunun teminatı, 28 AB ülkesinden 22’sinin (Birleşik Krallığın birlikten çıkışından sonra 27’sinden 21’inin), Avrupa Birliği tarafından « ortak savunmanın temeli » olarak tanınan, ABD komutası altındaki NATO üyesi olmasıdır.\\nAB’nin dış ve askeri politikası böylece, temel çıkarları tehlikeye düştüğünde çıkar çatışmaları yeniden yoğunlaşan Avrupalı büyük güçlerin üzerinde amaç birliği yaptığı, asli olarak ABD stratejisine tabi durumdadır: yeni devletsel ve toplumsal öznelerin ortaya çıkması karşısında gittikçe daha da kararsızlaşan Batı’nın üstünlüğünü muhafaza etmek. Bunun için Çin-Rus stratejik mutabakatının meyvesi olan Şanghay İşbirliği Örgütü’nün, kendi alanını dünyanın en büyük bütünleşik ekonomik sahası haline getirebilecek kaynaklara sahip olduğunu düşünmek yeterlidir.\\nABD ve NATO stratejisi kapsamında –Beyaz Saray’ın belgelediğine göre- İtalya, « ABD’nin sağlam ve etkin müttefiki » olarak öne çıkıyor. « İtalya’nın, tüm ülkeye dağılmış bulunan tesislerde, ABD Savunma Bakanlığına bağlı 30 000 asker ve memura ev sahipliği yapması » gerçeği bunu ortaya koyuyor.\\nİtalya aynı zamanda, geniş bir « meydan okuma » yelpazesi için askeri güç ve finansman sağlayan « ABD’nin küresel güvenlik ortağıdır » : Kosova’da, Afganistan’da, Irak’ta, Libya’da, Suriye’de, Baltık Denizi’nde ve diğer yerlerde, ABD/NATO savaş aygıtının müdahil olduğu ve bulunduğu her yerde.\\nABD-İtalya ilişkisinin ne düzeyde olduğunu son bir olgu teyit etmektedir: İtalya’nın satın alma taahhüdünde bulunduğu, ABD’nin Lockheed Martin firmasının üretimi 90 adet F-35 avcı uçağından ilk iki tanesi, muhtemelen 8 Kasım’da, Puglia bölgesindeki Amendola üssüne varmak üzereler.\\nİtalya’nın, ikinci dereceden ortak olarak F-35 programına katılımının bedeli, resmi olarak 2016 Bütçe Yasasında belirtildiği gibi, 12 milyar 356 milyon Euro kamu parası artı, henüz tamamen operasyonel olmayan ve sürekli olarak güncellemelere ihtiyacı olacak avcı uçağının devam eden modifikasyonları için olası diğer harcamalar. Buna rağmen –Analisi Difesa’nın teyit ettiği gibi-, İtalya’nın kendi F-35’leri üzerinde « sınırlı bir hakimiyeti » olacak. Bir ABD yasası « görev verilerinin » (avcı uçaklarının muharebe sistemlerini yöneten software’ler) başkalarına aktarılmasını yasaklıyor. Dolayısıyla, Pentagon’un Rusya’ya karşı, « ulusal » topraklarımız üzerinde bugünkü B-61’lerin yerine konuşlandıracağı yeni B-61-12 nükleer silahlarının kullanımı için öngörülen İtalyan F-35 uçaklarını kontrol edecek olan ABD’dir.\\nManlio Dinucci Çeviri\\nOsman Soysal\\nKaynak\\nIl Manifesto (İtalya)'"}, "time": 1742628606.873471}