{"duration": 0.28917956352233887, "input_args": {"text": "'7 845 7 5 La campagne présidentielle du Front National financée par les Émirats Arabes Unis ? L’hypothèse est moins surprenante qu’il n’y paraît. Elle pose néanmoins les questions de l’indépendance du Front vis-à-vis de son éventuel sponsor et du jeu d’influence que joueraient les EAU. \\nLa campagne de Marine Le Pen financée par Les Émirats Arabes Unis? C\\'est Médiapart qui a lancé l\\'info vendredi, bientôt reprise par toute la presse. Alors on peut bien sur se demander pourquoi le premier parti de France aux régionales et dans les intentions de vote à la présidentielle en est à rechercher des financements à l\\'étranger. On peut aussi trouver curieux qu\\'un parti que d\\'aucuns qualifient de xénophobe reçoive des fonds de pays arabes. \\nPourtant, ce rapprochement entre le Parti frontiste et les émiratis n\\'a rien de surprenant. © AP Photo/ Ariel Schalit Primaire de la droite: Jean-Frédéric Poisson sera-t-il exclu pour ses propos polémiques à l\\'occasion des « estivales de Fréjus» en septembre dernier, Wallerand de St-Just, le trésorier du Front National avait été clair au micro de France 3:\\n« S\\'il faut aller emprunter à l\\'étranger, nous irons emprunter à l\\'étranger, il n\\'y a aucune exclusive àça. Que ce soit en Russie en Argentine ou aux États-Unis […] Et pourquoi pas au Moyen-Orient. » \\nRappelons aussi que c\\'est déjà faute de trouver des banques françaises prêteuses que le FN avait emprunté 2 et 9 millions d\\'euros à des banques russes en 2014. D\\'ailleurs, le financement du FN n\\'est pas épargné par les péripéties juridiques. En septembre 2015, Wallerand de Saint-Just et Jean-François Jalkh, l\\'un des vice-présidents du parti, avaient été mis en examen pour recel d\\'abus de biens sociaux dans le cadre du financement de la campagne des présidentielles et des législatives de 2012, via le micro parti « Jeanne ». \\nA propos du financement du FN, nous avons interrogé Gaëtan Dussausaye. Le Directeur national du Front National de la Jeunesse (FNJ) décrit une position claire et sans ambiguïté, qui ne dépend pas « des nécessités de financement » de la campagne électorale: \\n« Ce financement, nous le cherchons partout. Comme les banques françaises se refusent à prêter de l\\'argent à un parti politique — ce qui en soit est un véritable déni de démocratie — bien évidemment, on est contraints, on est obligés, d\\'aller chercher des financements à l\\'étranger ». \\nDes financements qui ne sont pas dénués d\\'arrière-pensées, selon Médiapart, qui mentionne une source proche de Marine Le Pen. Cette source aurait affirmé que les émiratis voulaient, en échange de leur soutien financier, que Marine le Pen évince le Qatar pour travailler avec eux si elle était élue. \\nGaëtan Dussausaye estime qu\\'il y a peu de chances que la candidate du FN accepte le marché: \\n« Le Front National est par définition un parti patriote. Nous sommes pour la souveraineté et l\\'indépendance de la France. On ne va pas chercher à se défaire des liens — poreux — qui existent avec l\\'Arabie Saoudite et le Qatar du fait des mandats de François Hollande et Nicolas Sarkozy […] pour se remettre sous l\\'influence d\\'un autre pays étranger. » \\nEvincer le Qatar à leur profit serait en tout cas cohérent pour les Émirats Arabes Unis. En effet, le Qatar et les Frères musulmans figurent au tableau des ennemis héréditaires d\\'Abu Dhabi. De son côté, le FN oppose volontiers les EAU au Qatar et à l\\'Arabie Saoudite. Ces deux pétromonarchies ont particulièrement renforcés leurs liens économiques, politiques et diplomatiques avec la France sous les mandats respectifs de Nicolas Sarkozy et de François Hollande. Du pain béni pour le Front National, qui dénonce les collusions entre ces pays et les groupes extrémistes d\\'engeance wahhabite qui déchirent le Moyen-Orient. © AFP 2016 BERTRAND LANGLOIS Face au FN, Robert Ménard \"Oz sa droite\" Une opposition qui lui a d\\'ailleurs valu des déboires avec la Justice française:\\nEn avril 2015, le Qatar avait porté plainte pour diffamation contre Florian Philippot, vice-président du Front national. Sa faute? Avoir critiqué le Qatar et l\\'Arabie Saoudite « Ces pays financent l\\'islamisme qui tue» sur Radio Classique et LCI, au lendemain des attentats de Charlie Hebdo. La plainte n\\'avait finalement pas aboutie, le Parlement européen refusant de lever l\\'immunité parlementaire de l\\'eurodéputé. \\nDans ce contexte, il n\\'apparait donc pas étonnant que le Front National s\\'en tienne à la ligne que nous expose Gaëtan Dussausaye: \\n« Nous avons vu, au profit de l\\'émergence de Daech, un certain engagement de ces pays à lutter contre ce nouveau totalitarisme du XXIème siècle. Là où des pétromonarchies telles que le Qatar ou l\\'Arabie Saoudite jouent un jeu trouble, de la même manière qu\\'un pays à la porte de l\\'Europe comme la Turquie de monsieur Erdogan. Donc évidemment nous préférons être en relation avec des pays qui ont des engagements dans la lutte contre Daech beaucoup plus clairs, beaucoup plus transparents. » © AFP 2016 Kirill Kudryavsev Présidentielles: rien ne peut fléchir Nicolas Sarkozy, même un scandale financier En tout état de cause, il est certain que l\\'Arabie saoudite, le Qatar et les EAU mènent une vraie lutte d\\'influence en France à coups de pétrodollars. Les EAU sont même en tête des investissements privés en provenance du Golfe en France, alors que le Qatar et l\\'Arabie saoudite exercent plus leur emprise dans les milieux politiques et parfois diplomatiques. Une emprise dénoncée en mars dans un dossier-choc de Marianne .\\nUn investissement des EAU sur le FN pourrait constituer un moyen pour eux de peser —à terme — sur la politique française. Mais au vu des chances plus que minces de Marine le Pen aux présidentielles de 2017, les EAU ne vont-ils pas se décourager? Affaire à suivre. \\nLes opinions exprimées dans ce contenu n\\'engagent que la responsabilité de l\\'auteur. ...'"}, "time": 1742563470.8396955}