{"duration": 0.10709023475646973, "input_args": {"text": "'22 1655 6 24 Gleich mehrere Polizisten in Bayern und Sachsen-Anhalt sind in den letzten Tagen bei Auseinandersetzungen mit „Reichsbürgern“ getötet bzw. verletzt worden. Zugleich werden immer mehr Fälle bekannt, wo sich Beamte zu den \"Reichsbürgern\" bekennen. Ein Paradoxon? © AFP 2016/ Ronny Hartmann Razzia in Bayern: „Reichsbürger“ schießt auf Polizisten – vier Verletzte Die Reichbürgerbewegung ist eine uneinheitliche Gruppe von Personen, die die Bundesrepublik als solche nicht anerkennen und sich das Deutsche Reich mit den Grenzen von 1937 zurückwünschen. Die „Reichsbürger“ gehen davon aus, dass das Deutsche Reich völkerrechtlich bis heute fortbestehe, da die Weimarer Reichsverfassung weder von den Nationalsozialisten noch von den alliierten Siegermächten des Zweiten Weltkriegs jemals abgeschafft wurde. Die Bundesrepublik sei hingegen nicht mit diesem identisch — somit verfassungsrechtlich, illegal und juristisch nicht existent.\\nZu der Razzia im mittelfränkischen Ort Georgensgmünd, bei der durch die Schüsse des 49-jährigen Jägers einer der vier Einsatzkräfte des SEK ums Leben kam und drei verletzt wurden, erklärte der Innenminister von Bayern, Joachim Herrmann bei der Pressekonferenz am letzten Mittwoch folgendes: \"Ich will ausdrücklich hervorheben, dass es auch Reichbürger gibt, die nicht gewaltverdächtig und nicht unbedingt extremistisch anzusehen sind.\" \\nAlle Reichsdeutschen als rechtsextrem zu bezeichnen hält der ehemalige Oberstleutnant der Kriminalpolizei und Rechtsextremismus-Experte von Exit-Deutschland, Dr. Bernd Wagner auch für falsch, aber: \\n„Die meisten von ihnen sind in der Tat rechtsextrem und man kann nicht die Augen davor verschließen, dass auch Rechtsextremisten anderer politischer Parteien und Organisationen bei den sogenannten Reichbürgern mitwirken.“ © Sputnik/ Ramil Sitdickov Preußen statt Bund: „Reichsbürger“ bestellt sich Kalaschnikow Vorfälle mit den sogenannten Reichsbürgern gibt es bereits seit Jahren immer wieder. Nichtige Anlässe wie etwa eine KFZ-Kontrolle oder die Identitätsfeststellung würden mit dem Verweis auf Nichtzuständigkeit abgelehnt. Da könne sich dann solch eine Auseinandersetzung hochschaukeln, bei der die Polizei gezwungen sei, teilweise mit körperlicher Gewalt zu reagieren, beklagt der Landesvorsitzende der GdP in Sachsen-Anhalt, Uwe Petermann, gegenüber Sputnik.\\nUm die Bildung einer Parallelgesellschaft zu verhindern und um den Schutz der Beamten und der Bevölkerung zu garantieren, müsse hier alles getan werden, um das staatliche Gewaltmonopol zu behalten, betont er. So müsse man Verstöße sofort ahnden, denn der Ansatz durch die Negierung der Bundesrepublik sei verfassungswidrig, erklärt der Gewerkschaftler: \\n“Aber ob nun diese Menschen die verfassungsgemäße Ordnung stürzen wollen, ist eine andere Frage. Sie versuchen sich intelligent zu verhalten und solche Dinge zu verschleiern. Somit müssen diese Personen durch den Verfassungsschutz beobachtet werden, um auch möglicherweise ein verfassungsfeindliches Vorgehen zu erkennen und dementsprechend durch den Staat reagieren zu können. Die Reichbürger sind kein geschlossener Verein, wie z.B. die NPD. Somit gibt es keine geschlossene Organisation, die man verbieten könnte. Man muss immer gegen einen einzelnen Reichbürger verfahren und sehen, wo dieser Gesetze verletzt hat. Das ist auch die Schwierigkeit, die der Staat derzeit hat.\" \\nAuch der Experte von Exit-Deutschland sieht es ähnlich: “Man kann in der Bundesrepublik, da es ein demokratischer Rechtsstaat ist, alle möglichen extremistischen Positionen vertreten. Mit der Tötung des Polizisten in Bayern ist aber nun ein Präzedenzfall geschaffen, der auf eine gesteigerte Aggressivität der Personenkreise hinweist. Und da wird das Thema Verbot verschiedener Strömungen insofern, dass sie sich organisatorisch gebunden zeigen, durchaus gestellt.” \\nVermehrt wurden zugleich in Bayern, Sachsen-Anhalt und Berlin Fälle bekannt, bei denen sich auch Beamte zu sogenannten Reichsbürgern bekannt haben. Die Behörden haben reagiert. Es wurden Disziplinarverfahren eingeleitet und zum Teil auch Beamte vom Dienst suspendiert. © AFP 2016/ DANIEL ROLAND „Reichsbürger“ in Georgensgmünd : Polizist erliegt Schussverletzungen \\nVon einem Trend könne man hier noch nicht reden, betont der Pressesprecher der GdP-Berlin, Benjamin Jendro, in einem Telefongespräch mit Sputnik. Doch es ist schon auffällig, dass allein in den letzten Wochen den Berichten zu Folge mindestens acht solcher Fälle bekannt wurden. Sind etwa Staatsbedienstete eher für Reichs-Ideologien anfällig? \\nDer Kriminologe und Rechtsextremismus-Experte Wagner kennt die Psychologie der Polizisten und erklärt dieses Phänomen folgendermaßen: \\n„Beamte sehen in einer relativ liberalen Rechtsordnung ein großes Problem. Es stört sie, wenn Gesetzte nicht eingehalten werden. Wenn auch eigene Staatskollegen recht freischaffend manches Gesetz interpretieren. Diese wünschen sich mehr Kohärenz und mehr Stärke des Rechts. Wenn nun die Rechtsordnung nicht eingehalten wird, ist es für diese Personen, auch in Verbindung mit manchen Diensterlebnissen, sehr schmerzhaft. Dafür gibt es Erklärungen. Und Reichsbürger geben eben einfache Erklärungen. Das öffnet den Kopf für alternative Ideen. “ © Fotolia/ bilderstoeckchen \"Reichsbürger\" empfing Polizei mit Waffe und Schutzweste - Pressekonferenz in Bayern Bernd Wagner hat viele Erfahrungen mit Aussteigern aus der Reichsbürgerszene und Organisationen, wie dem Freistaat-Preußen, Königreich-Deutschland oder den Selbstverwaltern. Auch einen ehemaligen Postminister der brandenburgischen Reichsregierung hatte der Gründer von Exit-Deutschland beraten. \\nImmer wieder bedauern ehemalige Aktivisten ihre verlorene Zeit in solchen Organisationen, stellt der Experte dabei fest. Man solle sich doch lieber den kritischen Fragen aus der Gegenwartshaltung nähern, gesellschaftliche Kritik im Rahmen einer bestehenden Rechtsordnung anbringen und sich politisch engagieren, meint er. Man dürfte allerdings stark annehmen, dass das Problem der der ansteigenden Militanz seitens dieser Gruppierungen nicht allzu bald und auch nicht von selbst wieder verschwinden wird. ...'"}, "time": 1742563958.8430967}