{"duration": 0.03177833557128906, "input_args": {"text": "\"Videos Podesta Emails Part 24: Wikileaks Releases Another 2,620 Emails; Total Is Now 39,511 Among today's emails, among the thousands of emails, in May 2015 email from Jen Palmieri to Joel Benenson of the Benenson strategy group suggests that Hillary Clinton knows everything about the Clinton Foundation donors. Be Sociable, Share! \\n\\nIn the aftermath of one of the most memorable October shocks in presidential campaign history, and down the final stretch in the presidential race which has just over one week left, Wikileaks continues its ongoing broadside attack against the Clinton campaign with the relentless Podesta dump, by unveiling another 2,620 emails in the latest, Part 24 of its Podesta release, bringing the total emails released so far to exactly 39,511. \\nThe release comes hours after Wikileaks warned that it was launching its “Phase 3” of election coverage this week.. \\nIn the latest, Sunday set, of emails Doug Band commented on Teneo’s relationship with the Clinton Foundation, saying “if this story gets out, we are screwed,” we learned that Google’s Eric Schmidt wanted to be “head outside advisor” to the Clinton campaign, and a potential conflict of interest with the Clinton Foundation assisting El Salvador in obtaining $50 million in cash. As usual we are parsing through the latest release and will bring readers the more notable emails. Among today’s emails, we find a May 2015 email from Jen Palmieri to Joel Benenson of the Benenson strategy group suggests that Hillary Clinton knows everything about the Clinton Foundation donors. We also find more direct involvement by Google’s Eric Schmidt, when in an April 2015 email to Cheryl Mills he tells her “I have put together my thoughts on the campaign ideas and I have scheduled some meetings in the next few weeks for veterans of the campaign to tell me how to make these ideas better.” A January 2012 email from Laura Graham to Cheryl Mills sheds some more light on the Teneo scandal: “Below see my draft. I really took a shot in the dark here and didn’t know how far we should go on these issues. I remain concerned that email will be forwarded to press and so am against sending an email altogether. If we want to include the broader list of individuals going to the PO (I left a marker in the text for that) then we obviously have to meet with people before any email or staff meeting.” A May 2013 email from Neera Tanden address to John Podesta discussing a WaPo article how a Super PAC plans to coordinated directly with the Clinton campaign leads to the following exchange: That’s fine But skirting if not violating law doesn’t help her INMHO This article originally appeared on ZeroHedge.com . Be Sociable, Share!\""}, "time": 1742562754.0848684}