{"duration": 0.20285606384277344, "input_args": {"text": "'CORK DORKA   Adventure Among the Obsessive Sommeliers, Big Bottle Hunters, and Rogue Scientists Who Taught Me to Live for TasteBy Bianca Bosker329 pages. Penguin Books. $17. Some people shuffle paper for their jobs. Sommeliers lick rocks. Well, not all sommeliers. But a number of them do, if they’re desperate enough to want to know the difference between the taste of blue slate and that of red. Some forgo brushing their teeth in the morning, or drinking hot beverages, or using perfume, scented laundry detergent, extra salt. Their palates  —   and their noses  —   are their instruments. Who would risk blistering or blunting them? Would a violinist leave her Stradivarius in a locked trunk on a sweltering day? She would not. Bianca Bosker’s “Cork Dork: A   Adventure Among the Obsessive Sommeliers, Big Bottle Hunters, and Rogue Scientists Who Taught Me to Live for Taste” is a compendium of bewitching and sometimes disgusting facts. (There’s an art to spitting, apparently.) Do ignore the subtitle, which is filled with about as many additives as your average plonk, and every bit as cloying. It’s deceptive. Bosker’s journey into this sodden universe is thrilling, and she tells her story with gonzo élan. I’m not one to let blurbers, often   into service by authors or publishers, do my work. But when the sommelier and blogger Madeline Puckette writes that this book is the “Kitchen Confidential” of the wine world, she’s not wrong, though Bill Buford’s “Heat” is probably a shade closer to this book’s sensibility and heart. “Cork Dork” is likely to find a large audience. The real miracle is that Bosker was sober enough to write it. “Most days,” she explains, “I was drunk by noon, hung over by 2 p. m. and, around 4 in the afternoon, deeply regretting the burger I’d devoured for lunch. ” Bosker was the technology editor of The Huffington Post when she heard about the World’s Best Sommelier Competition. She   videos. She marveled. She decided to change her life. For 18 months, she shadowed renowned wine fanatics, hoping to understand their obsession and to become a certified sommelier herself. The goal was more foolhardy than she knew. Sommeliers, at least in her hometown (New York) are a diehard lot. They’re best described as punctilious sybarites  —   “the most masochistic hedonists I’d ever met,” as Bosker writes. They spend evenings on their feet. During the day, they practice the arcane rituals of wine service, ingest a magnum of wine esoterica and, if they’re aspiring to become master sommeliers, sample more than 20, 000 kinds of wine so that they can make such blind declarations as: “This is a   blend from the right bank of Bordeaux from the village of   in the 2010 vintage of Grand Cru Classé quality. ” That’s a direct quote, by the way. It comes from Bosker’s friend  —   and Sherpa  —   Morgan Harris, a precocious, brassily opinionated sommelier at New York’s Aureole. He and other expert tasters are expected to become the Alan Turings of wine, deciphering flavors as if the Battle of the Atlantic depended on it. Bosker had exactly no experience in this field. But because she’s possessed of a jolly hubris, she manages to wheedle and bluff her way into a series of jobs for which she isn’t remotely qualified, and then to muscle her way into the most elite   group in Manhattan  —   which would be like me deciding I wanted to brush up on my baseball skills by joining the Yankees for spring training. She gets a quick, boozy education, and so do we. About how to decant properly, which is as difficult as sinking a hole in one. About how to serve, which involves more rules than cricket. (Whatever you do, do not show customers the back of your hand.) She gives great gossip. While trailing a “somm” at Marea, an upscale Manhattan restaurant, Bosker learns that management keeps SparkNotes on its 1 percenter clientele. They’re a confetti of acronyms, the most devastating of which is HWC, or “Handle With Care. ” (At other restaurants, it’s SOE, or “Sense of Entitlement. ” Ow.) Readers also get a feel for restaurant economics from “Cork Dork,” and this much is clear: Sommeliers are secret weapons, capable of adding extra zeros to the bottom line. They’ve mastered the fine art of the upsell, sometimes based on the semiotics of customer clothing and accessories alone. Is Dad wearing a $50, 000 Patek Philippe watch? Do not give him a bottle of Pinot Grigio if the most expensive one on your list is only $80. “YOU ARE NOT ALLOWED,” Harris booms. (Steer him toward a $270 bottle of Chablis grand cru instead.) I’d say that Harris deserves his own reality show, but in a sense, he already has one, as do some of the other somms that Bosker follows. They’re on the Esquire Network’s “Uncorked. ” It felt a bit dishonest of the author not to reveal it. And while I appreciated her bravado, I grew similarly queasy, as time wore on, with how she would congratulate herself for   her way into an event she had no business attending. Did she promise the organizers publicity in her book? A magazine article? Too often, she doesn’t say. On occasion, Bosker radiates youthful   maybe a touch of naïveté. But she is, in the main, great company as a narrator  —   witty, generous, democratic. She devotes many pages to singing the praises of taste and smell, which philosophers throughout the ages have considered the baser senses, and shows how just about any of us can sharpen them. She’s suspicious, as any good journalist should be, of cant  —   she’s a decanter!  —   and interrogates at length whether the florid language of the sommelier (“notes of vanilla, cassis and saddle leather”) is useful or even authentic. She shows up at one of her fancy tasting groups with a plastic cup of chervil and asks everyone to give it a sniff. They can’t identify it  —   even though they regularly claim to detect hints of the herb in what they drink. Eventually, she interrogates the entire notion of wine expertise, which in turn raises the biggest question of all: What does make a wine great? Especially if, as one damning study found, most judges in a California wine competition gave contradictory ratings to the same bottle of wine every time they tasted it? And if a wine economist explains that there’s little correlation between quality and cost once a bottle exceeds $50 or $60? (“After that,” Bosker writes, “brand, reputation and scarcity start to nudge up a bottle’s cost. ”) Bosker ultimately arrives at her own kind of homespun answer to what makes a wine special. It accommodates tastes high and low, and she’s still certainly capable of enjoying three different vintages of the fabled Château d’Yquem. “It tasted like the sun,” she writes. “It tasted like an experience that would never repeat itself. ”'"}, "time": 1742562779.478946}