{"duration": 0.04460954666137695, "input_args": {"text": "'WASHINGTON, D. C.  —   The Trump Administration fiscal year 2018 budget set to be released on Tuesday factors in the defunding of Planned Parenthood, assuming the   American Health Care Act passes into law. [Office of Management and Budget (OMB) Director Mick Mulvaney was asked at a Monday press briefing if the new budget defunds abortion provider Planned Parenthood. He replied, “yes,” but added that it does “because it assumes the American Health Care Act passes and the AHCA in its current form, which is the one we assumed  —   and that’s making a bunch of assumptions, here  —   that it assumes that passes and that defunds Planned Parenthood. ”  The new budget entitled, “A New Foundation for American Greatness” will be posted to the OMB website at 11:00 a. m. on Tuesday morning. Mulvaney told reporters at the Monday briefing that the budget focuses in on more money for defense, border security, law enforcement, veterans, and school choice. The AHCA struggled to pass the House and faces an uphill battle to passage in the Senate. Asked during the Monday briefing about changes to Medicaid, Mulvaney said, “We assume the Affordable Health Care Act that passed out of the House passes. That has some Medicaid changes into it. We wrap that into our budget proposals. We go another half a step further and ratchet down some of the growth rates that are assumed in the AHCA. ” Defunding of Planned Parenthood was a provision of the AHCA that President Donald Trump used to put pressure on the conservative House Freedom Caucus to vote for passage of the bill. The Director said that the budget balances in 10 years and funds the President’s priorities. Mulvaney will deliver the budget to the Hill on Tuesday and will testify before the House Budget Committee on Wednesday and the Senate Budget Committee on Thursday. Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742562312.057527}