{"duration": 0.2783184051513672, "input_args": {"text": "'It was supposed to be an edgy thriller that made statements about upper echelon decadence, while also utilizing the real world sex life of Tom Cruise and Nicole Kidman as a kind of doorway bridging the gap between reality and fantasy – something that does come up in other Kubrick films, such as 2001: A Space Odyssey. In this Kubrick film, however, we have a statement about who runs the “show.” The show is both the film itself, as well as reality, and Kubrick wants viewers to realize that reality is run by our present showmasters of the videodrome. The viewer is supposed to reflect upon the decadence of the Eastern elite establishment, but also notice that viewing the film itself is homage to present social hypocrisy, since the film is a wannabe voyeuristic step into the sex lives of others. In this regard, it functions as an initiation. None of the other analysts and commenters have really noticed this. Virtually every review I have read sees it as some elaborate “MKULTRA/Illuminati” mind control thing (as is supposedly everything on those sites), while other reviews from professors and academia see it as a social or psychological commentary. \\nI think it has elements of all this, but the real goal is, I believe, an initiation process. The viewer is watching the film because he or she is curious about Hollywood secrets and elite lives. Think of all the silly gossip magazines we have. The “average Joe” went to see the film for a glimpse of Nicole Kidman, and Kubrick wants the viewer to see the hypocrisy in such an action, given that most people will “judge” the film’s secret society cult. Eyes Wide Shut, then, is a descriptor of the audience, as well as the characters in the film, who don’t really understand the sociopolitical power base that runs things. The power base is not, according to Kubrick’s film, the average politician or wealthy doctor or lawyer in New York. Indeed, this is precisely Kidman and Cruise’s characters’ status: they are unwitting inductees. Thus throughout the film, the viewers eyes are wide shut to the reality of the power structure, just as Kidman and Cruise’s characters are, until the end, when they have their eyes “opened,” as they both say at the end. Let us proceed. \\nThe opening scene shows us Mrs. Harford (Nicole Kidman) between two pillars. This is the doorway to the initiation, in other words. The two pillars figure prominently in Freemasonry as the entrance way to the divine, as borrowed from Solomon’s temple: \\nNicole stands between two pillars – Jachin and Boaz, setting the initiatory tone for the film. \\nThe two pillars of Freemasonry borrowed from Solomon’s Temple, indicating the doorway to the “mysteries” \\nThe viewer is being told from the beginning that they are to undergo an initiation into how the “mysteries” and the secret societies work, particularly from a sociological perspective. The Harfords, we discover, are having marital troubles related to sexual frustrations. It is also significant that it is Christmas time, when the initiatory procedure takes place, as a kind of anti-traditional religious/anti-Christian statement. It is also important to remember that all details in a Kubrick film are significant – the placement of everything is meaningful and deliberate. \\nAs mentioned in the picture above, the film is full of mirrors, which are symbols of the psyche, the inner world as it were, as well as other worlds. This occurs in Alice in Wonderland, for example, and this theme, as well as the Wizard of Oz, both figure prominently, and are theosophical allegories . Most commenters who note this point to it as some kind of MKULTRA control mechanism, but I think that is far-flung – more realistic would be the usage of such stories as allegories or metaphors for transformation – the metamorphosis of initiation into the “mysteries,” if you will. Both stories have theosophic undertones and symbolism, and thus constitute initiatory tales as well. When the Harford’s arrive at the party, we see a clear symbol of what kind of initiation they are going to undergo – a Satanic one, as we see from the inverted pentagram: \\nThe doors of their perception are about to change as they enter the party marked with an inverted pentagram. \\nZiegler, Harford’s friend, invites the couple to his parties frequently under the auspices of eventually getting them to participate in the orgies. As it turns out, there are two parties, and Mr. Harford’s old college buddy, Nick Nightingale, plays piano for both. Initially, both Harfords resist the temptation to sleep with other people, yet appear to have the desire given their own marital sexual problems. However, what we continue to suspect is not that the events are randomly occurring, but rather that it has been organized. It is not an accident that Bill Harford’s college buddy has shown up. Alice gets drunk and is then hit on by Sandor Szavost, a wealthy Hungarian. Szavost is likely a reference to Anton Szandor LaVey , the founder and High Priest of the Church of Satan. I think this is a symbolic reference, just to let us know the crowd they are being allowed to party with is ultimately an upper echelon Satanic cult. It is also interesting to note that the original story (“Dream Story”) is written about a couple who undergoes the experience in upper class Austria around the turn of the century, since Germany is the origin of the actual members of the Order of Illuminati . \\nBill discovers that Ziegler is involved in some shady dealings, and apparently has some connection to drugs and beauty queens. “Mandy,” a beauty queen we later discover, is knocked out from drugs – ‘asleep’ and nude, and we will find Alice experience something similar. Mandy has almost overdosed, and Dr. Harford tells her she cannot keep doing what she is doing: we don’t know if it’s a suicide attempt or not. It is also interesting that the nude woman in the painting above Mandy is sprawled out in the same position, as if to allude to the film’s thesis of a thin borderline between fantasy or dream, and reality. \\nNext, we see the Harfords going about daily activities. Notice again the inverted pentagrams in the background: \\nMore inverted pentagrams pop up. \\nThe Harfords then have a big argument over sex and the desire to cheat, and Alice tells Bill she once wanted to have sex with a young man years ago at a hotel. Throughout their condo we see images of gateways in gardens, indicating again that this is a film about initiation. Gardens also bring to mind Eden, and the expulsion of Adam and Eve due to sin, or it could refer to their coming initiation into the “garden of the gods,” so to speak, as they are about to experience the underworld in overworld. \\nBill then leaves to visit a patient who has passed away, and begins his languorous escapade for an extra-marital affair. He finds out his patient’s daughter has a crush on him, but Bill decides to remain faithful and leaves. He begins to suspect marriage is bad for others, too, as Sandor had tried to convince Alice. Bill then roams the streets looking for sexual fulfillment, passing hookers and sex shops. He then gets harassed by a group of guys who (for no reason whatsoever) call him a homosexual, showing society’s obsession with sex. Bill bumps into a pretty hooker and is invited to her apartment. He concedes, and steps into the world of the lower class, finding that sex is an “issue” everywhere. More symbolic imagery is used, as we see the prominent placement of books on sociology in the whore’s apartment. Kubrick is showing us that he is making a statement on sociology – but not the one most people think. It’s the true sociology of how the world is really run. Bill is interrupted from his cheating and decides not to. There are also numerous masks inside the hookers apartment, showing you that society wears a mask, has a fake facade of Christianity – since there are Christmas trees everywhere – yet is anything but traditionally religious. Instead, the masks show society as a fraud. But beyond that, Kubrick wants the viewer to see that those who really run things are masked – they constitute a secret team of wealthy, upper class who remain in the shadows. In fact, this is in my estimation, to be another clue that the hooker is also not a real hooker – she is part of the secret society (hence the masks in her apartment), and is being used to reel Bill in, just like Nick Nightingale. Most hookers don’t study sociology. \\nThe whore is a hired member of the secret society and her apartment has masks as a clue. \\nBill leaves and runs across his buddy Nick playing at another club in town. Nick tells him about the after party – the second party that Sandor had mentioned to Alice it turns out, where Nick plays piano blindfolded. Bill is intrigued, and decides to try to sneak in, after tracking down a cheesy mask and costume at the only costume store still open. The password, Nick tells Bill, is “Fidelio,” bringing to mind the theme of marital faithfulness that has been constantly in question in the film so far. Bill finds the costume shop, named The Rainbow, which is what the two women who propositioned him at the party had already mentioned – that he can find what he is after “at the end of the rainbow.” This is a Wizard of Oz reference, and the mirrors and “Alice” have already suggested Alice in Wonderland. Bill is still oblivious, however, to the synchronicity which, in my opinion, has been planned. The events are Bill’s initiation, and he is being tested to see if he will be faithful either to his wife, his ambiguous sense of moral, or, ultimately, to the cult – hence, “fidelio.” It should be noted as well that the cult is clearly Satanic, and Lucifer, the fallen angel of Scripture, who sought to dethrone God, is the light-bearer. And of course light is a prism or rainbow. \\nBill finds what he has been led to – the end of the rainbow. \\nThe costume shop is run by a foreigner who pimps out his daughter, we discover, and I suspect this reference to underage sex also implies connection to the Satanic cult, since my analysis is that events are all planned. Tom then takes a cab to the mansion and sneaks in using the password. There we see a kind of initiation ritual where numerous models are inducted into the cult in a kind of mock Catholic mass, with Bill noticing everyone wearing masks. \\nMasked balls go back to ancient times, but the past few hundred years they have come to mark the party life of certain cadres of the upper echelons of power. Renaissance Britain had many masked balls, as well as France, and according to Vatican insider and exorcist, Malachi Martin in his famous book Hostage to the Devil, such ritual orgies certainly do take place. Bill is tricked into revealing his identity and we get the impression the cult is going to kill him, until a girl steps forward to “ransom” herself for him. I suspect this is Mandy from earlier in the film, who now wants out of the secret society. Her way out will be death, as Bill will discover her name in the obituary for an overdose. Here is a great example of a modern masked ball of upper class elites . \\nBill takes the cab home and Alice wakes up giggling and laughing, as if she had been drugged. He tells her she was dreaming, and she starts to cry. He asks what the “dream” was and she says it was “so weird” – “we were in a deserted city and our clothes were gone. We were naked and I was terrified and I felt ashamed. And I was angry because you…rushed away to find clothes for us. As soon as you were gone it was completely different. I felt wonderful. Then I was lying in a beautiful garden stretched out naked in the sunlight and a man walked out of the woods. He was the man from the hotel I told you about – the Naval officer. He stared at me and he just laughed. He just laughed at me….He was kissing me and then we were making love, then there were all these other people around us – hundreds of them everywhere – they were all fucking. And then I was fucking other men, so many I don’t know how many I was with. I knew I could see me in the arms of all these men…and I wanted to make fun of you, to laugh in your face. And so I laughed as loud as could. And that must have been when you woke me up.” \\nThis, in my opinion, is a key clue to the fact that they are both being inducted into the cult. Either Alice has been drugged and doesn’t recall being used, thinking it was a dream, or she is a willing part of the initiation process for Bill, insofar as she has already been brought in. Either are possible. Bill is distraught and tries to track down the cult again, but is warned not to inquire any further. Bill decides he still wants to have an affair, and calls up the whore, only to discover she is nowhere to be found and that she has aids. Bill leaves and wanders the streets again, only to find that he is being followed by shady characters. He finds out in the paper that Mandy has overdosed, and he goes to the morgue to find out that she had most likely been killed. Bill goes to talk to Ziegler and Ziegler reveals that he is in the cult and was there that night when Bill snuck in. Ziegler warns him to not investigate any further, while Bill is shocked that his good friend is part of a secret society magic sex cult. It is also interesting that Ziegler’s house is decorated with paintings of what appear to be British aristocracy. \\nZiegler tells him that he figured out that Nick had mentioned the cult. Ziegler tells Bill he had him followed and found out he had been seeking out why Nick had disappeared. Ziegler then says, “Bill, suppose I tell that everything that happened there, the threats, the girl’s warnings, suppose I said all of that was staged. That it was a kind of charade. That it was fake?…to scare the shit out of you to keep you quiet about where you’d been and what you’d seen.” Bill tells Ziegler he saw Mandy’s body, and Ziegler says she was the one at the party. Bill asks what kind of charade ends with someone ending up dead. In other words, we find out that it was a ritual killing. Bill comes home to find the mask that he had lost on the pillow next to Alice, who is asleep. In other words, we are to suspect either that Alice knows he was there, or she is telling him that she is involved. Bill breaks down and “tells her everything.” Bill has been initiated into top dog Satanic masonry – not just the local low-level stuff. Significantly, Cruise’s character gives the Masonic sign of Secrecy – the hand on the chest with forefinger extended up, as mentioned in of Richardson’s Monitor of Freemasonry , page 86. \\nOath of Secrecy \\nHere is Satanist Aleister Crowley giving the sign of secrecy. \\nBill confesses to Alice and they both are upset. After the confession the realize they had promised to take their daughter Christmas shopping that morning. In the shopping scene we see another inverted pentagram and a purposefully placed “Magic circle” game, as well as another display labelled “magic.” The couple has now stepped into the magic circle and their eyes are no longer shut. They have been “illuminated.” We had already seen a “magic circle” of models at the initiation ritual in the mansion. In the toy store, Bill and Alice discuss what they should do, deciding that they should be “grateful.” Alice says “we should be grateful that we have managed to survive through all our adventures, whether they were real or only a dream.” Bill asks if she is sure, and Alice says she will forgive one night and Bill says “No dream is ever just a dream.” Alice responds that they are “awake now, and hopefully, for a long time to come” “Forever,” they both say. ‘Let’s not say forever,” Alice retorts, “it frightens me. But I do love you, and you know, there is something very important we need to do as soon as possible – fuck.” \\nAlice and Bill are surrounded by pentagrams and the “Magic Circle.” \\nSo the film is certainly about the different issues of marital problems our society creates, with its decadence and veneer of Christianity, as well as its sexual issues, but that is only half the story. The story is about the couple “waking up” and seeing the social power structure as it really is – rich elites who are into bizarre cults and weird sex magic. If you want your eyes opened, this is the whole point of the film. The power structure is about power and sex, but not just any old thing – particularly ritualized sex and gnostic, masonic, Satanic cult versions. This was the point of the Eden imagery, as well as the Alice and Wonderland and Oz references – the transition both from a fantasy reality of the dreamworld and base sexual desires, into the fake world of the film itself, as well as the transition from eyes shut, to awake. Not only was it supposed to be an initiation for the couple, the viewer is supposed to be initiated to the nature of the underworld, as well. This is what all the other reviewers have missed. \\nOn March 7, 1999, only 4 days after screening a final cut of Eyes Wide Shut for his family and the stars, Stanley Kubrick was killed by the Satanic secret societies and it was claimed that he died in his sleep of “natural causes”.'"}, "time": 1742561827.1692574}