{"duration": 0.06219363212585449, "input_args": {"text": "\"By Sean Colarossi on Wed, Oct 26th, 2016 at 7:36 pm This type of language from someone who used to be a member of the United States Congress is abhorrent, but it's also to be expected in the Trump era of American politics. Share on Twitter Print This Post \\nHopefully, as a country, we’ll return to a time in our politics when violent language is shocking and rare. But this year, when the man at the top of the Republican ticket has repeatedly encouraged his supporters to revolt if he loses, isn’t likely to be that time. \\nOn Wednesday, former GOP Congressman Joe Walsh, a right-wing extremist who now hosts a talk radio show, followed his nominee’s lead and told urged his Twitter followers to grab their guns on Nov. 9 if Hillary Clinton is elected. \\nTweet: On November 8th, I’m voting for Trump. \\nOn November 9th, if Trump loses, I’m grabbing my musket. \\nYou in? \\n— Joe Walsh (@WalshFreedom) October 26, 2016 \\nThis type of language from someone who used to be – and thankfully no longer is – a member of the United States Congress is abhorrent, but it’s also to be expected in the Trump era of American politics. \\nAfter all, not long ago Trump himself instructed his supporters to revolt if Clinton decides to fulfill her constitutional duty and nominate Supreme Court judges. \\n“If she gets to pick her judges, nothing you can do, folks,” the Republican nominee said. “Although the Second Amendment people — maybe there is, I don’t know.” \\nMore recently, Trump said that he’d like to see what happens if Clinton’s bodyguards were disarmed. \\n“I think her bodyguards should drop all weapons. Disarm immediately,” he said. “Take their guns away, let’s see what happens to her.” \\nNot only does Walsh’s rhetoric align perfectly with what Trump has suggested at various points throughout this campaign, but it’s also a continuation of dangerous language that the former Republican congressman seems to enjoy using. \\nEarlier in the year, when five police officers were gunned down in Dallas, Walsh blamed President Obama, tweeting: “This is now war. Watch out Obama. Watch out black lives matter punks. Real America is coming after you.” \\nBefore Trump hit the scene, this type of rhetoric existed, but it often only came from the most extreme elements in either party. Now it has the encouragement of a major party presidential nominee. \\nOn Nov. 9, we shouldn’t hope that people take up arms to protest the results of the election. We should hope that when Trump loses, he’ll take a lot of this dangerous rhetoric with him.\""}, "time": 1742562193.7048345}