{"duration": 0.078338623046875, "input_args": {"text": "'Home / BREAKING NEWS / Leaked Email Proves New Clinton DOJ Investigator Tipped Off Hillary’s Campaign During First Investigation Leaked Email Proves New Clinton DOJ Investigator Tipped Off Hillary’s Campaign During First Investigation Claire Bernish November 2, 2016 1 Comment \\nJust yesterday, The Free Thought Project reported how the new Department of Justice investigation of Hillary Clinton is fated to fail from jump street, since Clinton campaign chair John Podesta’s best friend, Peter Kadzik, heads the probe — and now, evidence has surfaced veritably proving that theory. \\nAs Assistant Attorney General, Kadzik vowed in an anomalous letter to Congress Monday the Justice Department would “continue to work closely with the FBI and together, dedicate all necessary resources and take appropriate steps as expeditiously as possible” in its newly reopened investigation of Clinton’s emails, through documents from top aide, Huma Abedin, as discovered on the computer of her now-estranged and disgraced husband, Anthony Weiner . \\nBut, as it turns out, Kadzik gave Podesta the “Heads up” on March 19, 2015— via his personal Gmail account , not his government-issued email account — that “There is a HJC oversight hearing today where the head of our Civil Division will testify. Likely to get questions on State Department emails. Another filing in the FOIA case went in last night or will go in this am that indicates it will be awhile (2016) before the State Department posts the emails.” \\nTo say tipping off the Clinton camp about Department of Justice business — through a personal, more covert email account, no less — is an ethically and morally questionable move would be a serious understatement of the nature of the collusion. \\nIt would seem, if Kadzik indeed tipped off Clinton insiders more than once, the announcement of another probe only constitutes empty talk to placate politicians and the public now seething over continued revelations from Podesta’s emails now published on a daily basis by Wikileaks. \\nIn fact, this one email suggests the DOJ held intense bias in favor of Hillary Clinton during its first investigation — and with Kadzik again heading the second probe, any claims of ‘impartiality’ can be effectively abandoned. \\nReopening both the FBI and DOJ investigations has sparked serious contention both in and between the two, as well as spawning sharp criticism from former officials concerned protocol has been dismissed in the process. \\nRep. Adam Schiff said FBI Director James Comey’s publicly announcing the reopening its investigation put an “enormous hand on the scale in a political contest,” the Wall Street Journal reported . \\nSchiff, a former assistant U.S. attorney, said the FBI has guidelines preventing such public announcements as the information could sway, or be viewed as influencing, a ‘political contest in its final days.’ \\n“Clearly here the [FBI] director did not have the facts,” he railed, as the WSJ reported. “He had not read the emails. He didn’t know if they were significant or not, and I think we are seeing in all of its graphic character just why these DOJ policies exist.” \\nKadzik, in fact — as Wikileaks also revealed — had dinner with Hillary Clinton just one day after she testified before the House Select Committee on Benghazi last October. Further, as the Daily Caller reported , \\n“Podesta and Kadzik, the assistant attorney general for legislative affairs, were in frequent contact, other emails show. In one email from January, Kadzik and Podesta, who were classmates at Georgetown Law School in the 1970s, discussed plans to celebrate Podesta’s birthday. And in another sent last May, Kadzik’s son emailed Podesta asking for a job on the Clinton campaign.” \\nWith the DOJ at least minimally compromised with Clinton insiders and sympathizers — and the FBI additionally so, considering Comey’s decades-long relationship with the Clinton family — it would seem both investigations are doomed to fail, whether or not any of the players actually misbehaved. Share Google + Phil Freeman \\nDoesn’t matter, election results are in before the voting ends look and share before this is taken down http://82.221.129.208/basepaget2.html Jim Stone’found the hidden msm page that controls the narrative. Social'"}, "time": 1742562309.7338018}