{"duration": 0.04264950752258301, "input_args": {"text": "'  Proof Of George Soros Nazi Past Finally Comes To Light With Discovery Of Forgotten Interview George Soros has repeatedly called 1944 \"The Best Year of his Life.\" 70% of Mr. Soros\\'s fellow Jews in Hungary, nearly a half-million human beings, were annihilated in that year, yet he gives no sign that this put any damper on his elation, either at the time or indeed in retrospect.   15, 2016 When Hitler’s henchman Adolf Eichmann arrived in Hungary, to oversee the murder of that country’s Jews, George Soros ended up with a man whose job was confiscating property from the Jewish population. \\nGeorge Soros and other rich liberals who spent tens of millions of dollars trying to elect Hillary Clinton are gathering in Washington for a three-day, closed door meeting to retool the big-money left to fight back against Donald Trump. Since Soros name is very much in the headlines in 2016, let’s take a look at an interview he gave in 1998 about his Nazi past. Nazi collaborator Soros gave MILLIONS to Hillary Clinton’s failed campaign \\nSocial unrest groups like Media Matters have taken to the Internet in an attempt to “debunk the claims” and “correct the smears” about rumors of the Nazi past of their patron, George Soros. They say it is just malicious gossip and lies people make up about Soros because they don’t like him. Snopes.com chimes in as well in defense of Soros. But what about the “rumors”? Could they be true, are they true? \\nAs you will see and hear , not only are the rumors true, a long forgotten interview George Soros did on 60 Minutes has him gleefully confessing to his crime. \\nGyörgy Schwartz, better known to the world as George Soros , was born August 12, 1930 in Hungary. Soros’ father, Tivadar, was a fervent practitioner of the Esperanto language invented in 1887, and designed to be the first global language, free of any national identity. The Schwartz’s, who were non-practicing Jews, changed the family name to Soros, in order to facilitate assimilation into the Gentile population, as the Nazis spread into Hungary during the 1930s \\nWhen Hitler’s henchman Adolf Eichmann arrived in Hungary, to oversee the murder of that country’s Jews, George Soros ended up with a man whose job was confiscating property from the Jewish population. Soros went with him on his rounds. \\nGeorge Soros has repeatedly called 1944 “ The Best Year of his Life. ” 70% of Mr. Soros’s fellow Jews in Hungary, nearly a half-million human beings, were annihilated in that year, yet he gives no sign that this put any damper on his elation, either at the time or indeed in retrospect. During an interview with “Sixty Minute’s” Steve Kroft, Soros was asked about his “best year.” George Soros Interview Where He Admitted He Was A Nazi Collaborator: \\nHe was only to happy to admit his collaboration with the Nazis,in fact, he called those days the “best time of my life”. Click to watch, in context, that startling confession. \\nKROFT: My understanding is that you went out with this protector of yours who swore that you were his adopted godson. \\nSOROS: Yes. Yes. \\nKROFT: Went out, in fact, and helped in the confiscation of property from your fellow Jews, friends and neighbors. \\nSOROS: Yes. That’s right. Yes. \\nKROFT: I mean, that sounds like an experience that would send lots of people to the psychiatric couch for many, many, years. Was it difficult? \\nSOROS: No, not at all. Not at all, I rather enjoyed it. \\nKROFT: No feelings of guilt? \\nSOROS: No, only feelings of absolute power. SHARE THIS ARTICLE  '"}, "time": 1742628580.960785}