{"duration": 0.10620474815368652, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good morning. Here’s what you need to know: • Electoral map shrinks for Sanders and Cruz. After Donald J. Trump’s sweep of five primaries in Eastern states on Tuesday, and Hillary Clinton’s victories in four of five, there are few chances for Ted Cruz and Bernie Sanders to catch up in the delegate count. Here are our takeaways and what the candidates said after the results. Both   are looking ahead to the general election. Mr. Trump is giving a speech on foreign policy in Washington today, while Mrs. Clinton is sharpening her pitch for November. • On Capitol Hill. The Senate is near a deal for at least $1. 1 billion to fight the Zika virus, but the measure faces resistance from House Republicans. Despite lawmakers’ bickering, Mitch McConnell, the Senate majority leader, can point to some legislative victories, complete with Democratic support. • Sentencing for former House speaker. J. Dennis Hastert, 74, the   Republican House speaker in history, is expected to be sentenced today in federal court, after pleading guilty last year to a banking violation tied to accusations of sexual abuse. One of his accusers is suing him for $1. 8 million, the money he had been promised as compensation for the abuse. • Taking their lumps. Apple posted its first quarterly decline in revenue in 13 years, hurt by a drop in iPhone sales in China, the company’s most important market after the U. S. The restaurant chain Chipotle had its first quarterly loss as a public company, and Exxon Mobil was stripped of its top credit rating for the first time since the Great Depression. • At the Supreme Court. The justices will consider an appeal today from Bob McDonnell, the former Virginia governor who was convicted of public corruption for trading political favors for gifts and loans. The case could produce a major ruling placing limits on bribery laws. In a    decision on Tuesday, they said it was unconstitutional to demote a police officer based on the mistaken assumption that he had engaged in political activity. • Iraq in turmoil. Iraq’s Parliament has begun voting on a cabinet after protesters demanded government reforms and leaders untainted by corruption or sectarian connections. The political stalemate and the drop in prices of oil, the country’s main source of revenue, aren’t helping the effort to defeat Islamic State militants. • Police playbook gains a chapter. Police departments around the U. S. are turning to crisis intervention training in response to   shootings of people with mental illnesses.   percent or more of people fatally shot by the police have had a mental disorder. Separately, John R. Kasich often speaks about mental health on the campaign trail, and as his brother, Rick, has struggled with bipolar disorder. Rick Kasich gave us his first extended interview. •  A Volkswagen executive’s 2006 PowerPoint presentation laid out a strategy for rigging pollution tests. • Comcast is in talks to buy DreamWorks Animation, the boutique studio run by Jeffrey Katzenberg. • The founder of Chobani, a yogurt maker, surprised his 2, 000   employees with shares worth up to 10 percent of the company. • Here are snapshots of the U. S. and global markets. • Prince left no will, sister says. In newly filed court documents, the musician’s sister says that he died without a spouse, children or surviving parents, and that he had no will. That will surely complicate his financial estate and musical legacy, which includes a trove of unreleased songs. • Gaining new insights. Runners now have an exact schedule that will predict how their performance will decline as they age. Police officers are using artworks in museums to sharpen their ability to notice details. • Scoreboard. The Toronto Raptors and Atlanta Hawks are each one win away from advancing in the N. B. A. playoffs after their victories on Tuesday night. There were no N. H. L. games, which meant hockey players could work on having a good night’s sleep. • U. S. math scores decline. The average performance of the nation’s high school seniors dropped in math from 2013 to 2015, but it held steady in reading, according to results of a test released today. • Recipes of the day. Make a big batch of   oatmeal and you’ll have breakfast for days. Radish sandwiches are great for lunch or   hors d’oeuvres. Or try this classic tuna sandwich. While some Americans may snicker at snooker, it’s one of Britain’s most popular games, with millions who play and who watch live coverage on the BBC, and it’s growing in countries like China. The annual World Snooker Championship continues this week in Sheffield, England. The   winner Ronnie O’Sullivan was eliminated on Tuesday. Like cricket, another British creation, it has complicated rules. Snooker uses a larger table, and narrower pockets than the older game of billiards. It’s played with 15 red balls, a white cue ball and six balls of other colors. In short, once all 15 red balls have been pocketed, the colored balls  —   each worth a different number of points  —   must be sunk in a specific order. A “snooker” occurs when a player’s cue ball gets boxed in and can’t make contact with the ball he is next supposed to sink without fouling. The game was invented in 1875 by a British military officer stationed in India named Neville Chamberlain (no, not that Neville Chamberlain). At the time, the word snooker was a derisive term for a new cadet. The game is believed to have adopted the name because of the cadets’ susceptibility to crafty play. Your Morning Briefing is published weekdays at 6 a. m. Eastern and updated on the web all morning. What would you like to see here? Contact us at briefing@nytimes. com. You can sign up here to get the briefing delivered to your inbox.'"}, "time": 1742561908.5377526}