{"duration": 0.06362581253051758, "input_args": {"text": "'In the hours since Michael T. Flynn resigned as national security adviser late Monday, two narratives have emerged. One, embraced by many in the traditional legacy media, centered on what Mr. Flynn had done that led to his resignation: discussing sanctions against Russia in a conversation with the Russian ambassador, and then misleading Vice President Mike Pence about it. The other, which developed among the more   news media, focused on the leaks from Washington that had put pressure on Mr. Flynn to step aside, and whether these leaks were intended to damage President Trump. One narrative holds Mr. Flynn, and others who knew about his discussions, accountable. The other portrays Mr. Flynn more as a victim. The focus on leaks intensified on Wednesday, after The New York Times reported late Tuesday that Trump aides and associates had made repeated contact with senior Russian officials during the presidential campaign. Which narrative does Mr. Trump ascribe to? On Tuesday morning, he attributed Mr. Flynn’s resignation to “illegal leaks. ” On Wednesday morning, Mr. Trump again denounced the leaks in a blizzard of tweets. It is not unusual for news media to promote different story angles. And the division between   and   news organizations is certainly not new. But the rift between the mainstream media and more partisan news organizations has grown starker in the nearly four weeks since Mr. Trump took office, reflecting a widening political and ideological rift. The growing division means that some readers are getting their news through an   prism. Americans who get their information predominantly from Breitbart News, a   news and opinion site, for instance, or from the conservative Fox News are getting a very different version of the news from Americans who read The Washington Post or watch CNN. Late Monday night, as the news broke that Mr. Flynn had resigned, news organizations rushed to publish articles. Not Breitbart. For roughly an hour after Mr. Flynn’s resignation letter began circulating, Breitbart did not change the main story on its home page, which was about immigration policy. When Breitbart made the Flynn resignation its main story, around midnight, the account hewed closely to the facts of Mr. Flynn’s resignation and quoted heavily from his resignation letter. The site also put up a more analytical article that raised questions about the motives behind the government’s monitoring of communications between Mr. Flynn and the Russian ambassador. “Democrats are clamoring for a deeper investigation of Russian ties to Trump,” the article said. “But the more serious question is whether our nation’s intelligence services were involved in what amounts to political espionage against the newly elected government. ” The article also raised questions about how the news media got its information, reinforcing a distrust of the press that Mr. Trump and his administration have assiduously tried to foster. “The fact that the contents of Flynn’s phone conversation  —   highly sensitive intelligence  —   were leaked to the media suggests that someone with access to that information also has a political axe to grind,” the article said. The emphasis on the leaks continued into Tuesday afternoon with an article at the top of Breitbart’s site on the White House briefing and the assertion by Sean Spicer, the White House press secretary, that the leaks were an overlooked part of the reporting on Mr. Flynn. The narrative gained more steam on Wednesday morning, after the damaging reports Tuesday night: An article on the Breitbart home page seized on Mr. Trump’s early morning tweets attacking the coverage rather than the news about the Russian contacts. Fox News also advanced this   narrative on Tuesday and Wednesday. During one segment on “Fox  Friends” on Tuesday, Laura Ingraham, a conservative commentator and Fox News contributor, suggested that the leaks were politically motivated. “The long knives were out for Flynn almost the moment that he was announced,” she said. “I think this really was the death by a thousand leaks,” Ms. Ingraham added. “The leaks that were coming out of this administration and the transition, before the administration, were at a level that I don’t remember seeing for quite some time. ” Senator Ron Johnson of Wisconsin, a Republican, also focused on the leaks during an appearance on the channel. “Who tapped the phones, who was listening to it, who leaked it? I think those are legitimate questions to ask,” he said. “Let’s face it,” he later said, “leaks of this nature are incredibly damaging to America, to our national security, and we need to look into it. ” Tuesday night ended on a predictably outraged note, with Sean Hannity, a Trump supporter, suggesting on his show that the left was “willing to do anything to stop President Trump from draining the swamp and changing the status quo. ” “Impeachment of the president is clearly the end goal for the left,” Mr. Hannity added. “Facts, truth, it doesn’t really matter. Mike Flynn is just a small casualty of that bigger plan. ” On Wednesday, the main article on the Fox News home page highlighted the president’s condemnation of the leaks to the media. Journalists at more centrist news organizations, including CNN and NPR, attributed Mr. Flynn’s resignation to the strong reporting and investigative journalism that had exposed details of Mr. Flynn’s talks with Russia. Rather than casting aspersion on leaks about Mr. Flynn, these commentators praised their contributions to accountability journalism. Joe Scarborough, a host of MSNBC’s “Morning Joe,” went so far as to call the person who had leaked information “a patriot. ” “The only reason we’re finding out about it now is because a patriot did leak this to The Washington Post, did get this information out there, or else we wouldn’t have even known about it,” said Mr. Scarborough, a former Republican congressman from Florida. The Columbia Journalism Review, a publication that chronicles and analyzes the news media, was perhaps the most pointed. An article on Tuesday  —   with the headline “Flynn resignation shows leaks under Trump are working. Keep ‘em coming. ”  —   described how several recent leaks had ultimately forced the Trump administration to reverse course or make changes. “Some of these leaks have halted a Trump appointment and controversial policies in their tracks,” the article said, “and it’s a lesson showing how   and leaks to the press are vital for democracy. ”'"}, "time": 1742628501.2764266}