{"duration": 0.239119291305542, "input_args": {"text": "'PHOENIX  —   Inside a cramped committee room on the   campus of Arizona’s Capitol, Kelsey Lundy stepped to the podium to detail new legislation and the higher costs it would impose on struggling borrowers. But Ms. Lundy is not a lawmaker, a government employee or even a statehouse intern. She is a lobbyist for one of the nation’s largest lenders. That lender  —   controlled by the Fortress Investment Group, one of Wall Street’s most powerful private equity firms  —   wrote the bill. Months later, in 2014, the state’s legislators passed the law, making it easier to charge interest of 36 percent to borrowers living on the financial margins. The political access in Arizona was just one component of a broader effort to loosen consumer protection laws, according to emails obtained through public records requests. In nine other states, Ms. Lundy’s client helped win legislative changes, persuading lawmakers that it needed to raise costs to stay in business and serve borrowers. Since the 2008 financial crisis, Fortress and other private equity firms have rapidly expanded their influence, assuming a pervasive, if    role in daily American life, an investigation by The New York Times has found. Sophisticated political maneuvering  —   including winning government contracts, shaping public policy and deploying former public officials to press their case  —   is central to this growth. Yet even as private equity wields such influence in the halls of state capitols and in Washington, it faces little public awareness of its government activities, The Times found. Private equity firms often don’t directly engage with legislators and regulators  —   the companies they control do. As a result, the firms themselves have emerged as relatively anonymous conglomerates that exert power behind the scenes in their dealings with governments. And because private equity’s interests are so diverse, the industry interacts with governments not only through lobbying, but also as contractors and partners on public projects. Fortress, which manages more than $70 billion of investor money, encapsulates this new power dynamic. While little known outside Wall Street, Fortress covers a cross section of American life through companies it owns or manages. It controls the nation’s largest nonbank collector of mortgage payments. It is building one of the country’s few private passenger railroads. It helps oversee a company that manages public golf courses in several states. And it controls Ms. Lundy’s client, Springleaf Financial Services, a huge provider of subprime loans to borrowers with few other options aside from payday lenders often charging 300 percent. The Times’s investigation  —   based on thousands of pages of government records, court papers and securities filings, as well as interviews with borrowers, regulators and executives  —   pieced together how these seemingly disparate companies fall under the umbrella of one powerful private equity firm. The investigation also shed new light on the tactics these companies have used to reshape laws that hindered their growth. In Texas, Springleaf helped persuade lawmakers to allow for higher administrative fees. Springleaf won permission elsewhere to charge the maximum allowable rates  —   36 percent in Arizona and Indiana, higher than some credit cards  —   to a greater number of loans than ever before. And it pushed legislation allowing it to sell various insurance policies, including life and accidental death and dismemberment, which it lumps into the balance of its loans. In Arizona, Springleaf forged such cozy ties with lawmakers that the two sides became all but inseparable in the   process. One legislative official emailed Ms. Lundy: “If there is a specific statute that you want to mirror, please tell me the statute number. Thank you so much!” Another Springleaf lobbyist, when   listed the sponsor of the Springleaf bill as an employment reference. In Florida, where Fortress is building the passenger railroad, the firm took advantage of   politics: political aides becoming lobbyists, and vice versa. When an adviser to the governor moved into the private sector, he advocated for the train project, then returned to the governor’s office as chief of staff. Fortress’s interaction with Los Angeles County was rockier, and it reflected the firm’s complex web of financial interests. Los Angeles County officials believed that Fortress was buying the company responsible for upkeep of public golf courses. The county, swayed by Fortress’s long track record in owning golf courses, approved the deal. There was one problem: Fortress was not the buyer. The Times investigation found that the buyer was the Newcastle Investment Corporation, a different company with no golf experience and a history of financial problems. County officials were surprised to learn the buyer’s identity from The Times. Fortress said there was no need for county officials to worry. Newcastle pays Fortress to manage its business and investments. Wesley Edens, a former Lehman Brothers partner who   Fortress and is now its   also emphasized the positive effects of Fortress’s companies across the American economy. Fortress has replaced poorly performing banks, he pointed out, and has funded projects that no government could afford. “We are proud of the impact that   companies have provided to the individuals and communities that they serve,” Mr. Edens, who is also an owner of the Milwaukee Bucks basketball team, said in a statement. In an interview, Mr. Edens said that Fortress did not create Springleaf’s lobbying campaign, but supported it. Springleaf said it needed to raise costs to modify outdated laws and compete with less regulated lenders. And although Springleaf wants to raise costs on borrowers at a time of historically low interest rates, he said that the company was “so much more humane” than others offering   loans. Some customers agree. Joseph King, a Springleaf customer in Glendale, Ariz. said, “They’ve done right by me,” offering him credit when few others would. Some public agencies also applaud Fortress for creating jobs  —   the firm estimates as many as 10, 000 with the Florida railroad alone  —   and for investing in fields that others abandoned after the financial crisis. Private equity firms, onetime “corporate raiders” that made their name taking over distressed companies, have pushed into activities previously dominated by banks and local governments. This shift has upended the definition of private equity as the industry expands into real estate, infrastructure and lending. Although that transformation granted private equity new influence over government, Mr. Edens disputed that political connections generated special favors for the firm. “There is nothing surprising about support these companies have received, given the benefits they deliver to a broad cross section of Americans,” he said. Surrounded by his business partners and his daughters, Wes Edens stepped onto the balcony at the New York Stock Exchange, rang the opening bell and walked away a billionaire. It was Feb. 9, 2007, the day Fortress became the first Wall Street firm with a big private equity business to go public. It was a pivotal moment for Mr. Edens, a Montana native with a mop of blond hair. For private equity, a relative newcomer to modern capitalism, it showed that the industry had arrived. Today, six other private equity firms are publicly traded, and over 7, 500 are in operation worldwide, according to the data provider Preqin  —   more than ever before. Private equity firms “are ubiquitous, they are everywhere,” said Eileen Appelbaum, a senior economist at the Center for Economic and Policy Research who studies private equity. Everywhere includes the government. The amount the private equity industry spent on lobbying in 2015 was more than triple what it had spent a decade earlier, according to the Center for Responsive Politics. At the peak of the financial crisis, the figure was even higher. Political donations have increased nearly sixfold. Former House Speaker John Boehner’s chief of staff is now president of the industry’s lobbying group. That group, the American Investment Council, argues that the public has benefited from private equity. Pension funds have reaped 12 percent net returns from private equity over a recent   period, the group said. “Private equity funds have an aligned interest with their investors to produce strong returns,” said Bronwyn Bailey of the American Investment Council. The group also noted that the   Act, passed in the aftermath of the 2008 financial crisis, subjected private equity fund managers to additional oversight from regulators. Yet the group is lobbying the House to pass legislation that would unwind some of those requirements, government records reviewed by The Times show, underscoring the industry’s newfound influence. Fortress’s 2010 takeover of Springleaf, the subprime lender, further illustrates private equity’s evolution from niche industry into one of Wall Street’s most influential players. It also shows how a firm’s influence can flow from the companies it owns. Springleaf’s businesses were previously in the hands of the American International Group and Citigroup, two Wall Street powerhouses that needed billions of dollars in government bailouts to survive. Since buying Springleaf, Fortress has turned its $124 million investment into a stake valued at $1. 9 billion. The lender’s lobbying underpins some of that growth. In state house after state house, Springleaf lobbyists secured legislative victories, allowing the company to raise costs on borrowers. Springleaf argued that its successes were not particularly sweeping, noting that it lost in at least two states. “Because many state legislators don’t have sufficient legislative staffs or staff members with   expertise, if you want something done, you sometimes have to write the first draft yourself,” said John Anderson, an executive vice president at Springleaf. “It is unusual for legislation we propose to be enacted verbatim. ” One of Springleaf’s arguments to lawmakers has been that, without legislative changes, it would need to close more branches  —   driving borrowers to payday lenders. In 2008, Springleaf said, it had 21 Arizona branches, and at the time of the 2014 legislation seven remained. In contrast with   payday lenders, Springleaf offers installment loans that typically are larger and last longer. After buying its largest competitor last year and rebranding as OneMain Financial, the company is now the nation’s largest installment lender. Springleaf charges more than banks because its customers are riskier bets. According to Mr. Anderson, who says he reads every complaint that customers submit to regulators, Springleaf caps rates at 36 percent. The average Springleaf loan totals about $6, 093 and costs 26 percent, plus fees. At a Springleaf branch in a Phoenix strip mall, Gary Hundley agreed to pay nearly 36 percent on much of his roughly $4, 500 loan. He also took out unemployment and life insurance policies from Springleaf. Mr. Hundley repaid an earlier Springleaf loan, he said, and planned to chip away at the second, when medical problems forced him to miss work. About a month after taking out the second Springleaf loan, Mr. Hundley filed for bankruptcy, largely because of other debts unrelated to Springleaf. Springleaf then sued him, arguing that he had never intended to repay. As a result, Mr. Hundley is still liable for part of the debt, according to his lawyer, Anthony Clark, who said Springleaf “is no stranger to bringing these kinds of suits. ” “I was overwhelmed, but I planned to pay,” said Mr. Hundley, who had no trouble obtaining Springleaf loans despite previously declaring bankruptcy. Springleaf noted that in other bankruptcy cases it has agreed to lower payments. And it is within the company’s rights to sue. But Springleaf has occasionally straddled a legal line, records and interviews show. Consider the company’s insurance business. Although Springleaf’s life insurance and other policies are voluntary  —   and the company fully refunds premiums to borrowers who cancel their policies within 30 days  —   some policies are opened without customers’ approving them at the time. For instance, if a borrower pledges a car as collateral for a loan, but the auto insurance appears to have lapsed or is insufficient, Springleaf can impose its own insurance. Although Springleaf warns borrowers beforehand, and routinely cancels its coverage once they obtain an adequate policy, Springleaf acknowledged in a public filing that “because our customers do not affirmatively consent” to the insurance when it is purchased, “regulators may in the future prohibit” it. Some borrowers have separately complained to regulators that Springleaf embellished the collateral underpinning their loans. Lisa Williams, a    administrative assistant in   N. C. noticed an irregularity after receiving a roughly $3, 700 Springleaf loan: A lawn mower she posted as collateral was valued at $800. “There’s no way that that old thing was worth $800,” she said, giggling. A similar new mower retails for about $300. Loren Finnell, a mechanic in Tempe, Ariz. said he obtained a loan in 2014 after Springleaf listed a Dell computer and accessories worth $2, 000. “I didn’t even have a Dell. They were making it up. ” For Sheila Fargnoli, of Tucson, getting a loan from Springleaf was like a game of Mad Libs. A Springleaf employee, she recalled, asked questions like, “You must have a computer, right?” The employee also asked about musical instruments, but Ms. Fargnoli said she had previously sold her guitar for $1 at a yard sale. Nonetheless, Springleaf listed the guitar as collateral in the loan documents, Ms. Fargnoli noticed. She accused Springleaf in court papers of pressuring her to “misrepresent the value” of collateral, which Springleaf did not dispute. Springleaf said that the problems were isolated and that it had curtailed the use of household items as collateral. It also now prohibits using anything of immaterial value  —   say, a $1 guitar  —   to secure loans. The complaints have emerged as Springleaf presses its statehouse lobbying campaign. “Just in case you needed a little light reading, attached is the draft legislation that Springleaf would like to move forward,” Ms. Lundy, the Arizona lobbyist, emailed a Republican aide. Springleaf asked Representative T. J. Shope, a Republican, to sponsor the bill. And when a consumer advocate, Cynthia Zwick, published an   article opposing the bill, Ms. Lundy contacted Mr. Shope to say, “You should do a response. ” Later she added, “Let’s work on one tomorrow. ” Ms. Lundy also testified at hearings alongside Mr. Shope. Unable to answer a question, Mr. Shope deferred to Ms. Lundy. The lobbyist, he added, was “here to answer a lot of the technical questions. ” Not all of Ms. Lundy’s statements were accurate. In a “fact sheet” to lawmakers, she claimed that “similar legislation has passed in numerous states” with “only one state having opposition from one consumer advocacy group, none from AARP. ” Yet consumer advocates opposed the legislation in Florida and Indiana, and AARP attacked it in North Carolina. Springleaf said it was unaware of the opposition at the time. Ms. Lundy and Mr. Shope declined to comment. Their bill’s passage coincided with what Representative Debbie McCune Davis, an Arizona Democrat who opposed the bill, called “wining and dining. ” Springleaf’s lobbyists treated Mr. Shope to “food or beverages” soon after the bill passed, lobbying records show. And about a week after the Arizona bill passed, an email circulated in the House, alerting staff members that “dinner is courtesy of” Ms. Lundy. After similar legislation passed in North Carolina, Springleaf held a dinner for more than a dozen state lawmakers and their staff members. Still, some Democratic officials lamented the bill’s impact on borrowers. “It’s like needing a life preserver and getting an anvil,” said Roy Cooper, the North Carolina attorney general. Around the country, local officials opened letters from the American Golf Corporation, which managed their public golf courses. Fortress was buying the company, the letters announced. That seemed to be good news. American Golf’s letters, which Fortress helped draft, promoted Fortress’s “considerable experience with companies like ours. ” Some officials also received a document, stamped with Fortress’s logo, citing the firm’s ownership of other golf courses and its “firsthand experience” owning companies that form partnerships with local governments. To seal the 2013 deal, the letters included Fortress’s annual report showing its “substantial resources. ” The pitch worked. Parks department officials in New York City, and in Ventura County and San Dimas, Calif. promptly signed off on the deal. Los Angeles County took longer to scrutinize Fortress’s background before granting approval. But none of the officials had the full story. The buyer was not Fortress, but Newcastle Investment Corporation, The Times found in filings. The distinction  —   Newcastle is a different company with a close business relationship to Fortress  —   suggests that complex corporate structures can confuse governments and benefit private equity. All four parks departments said they were not told about Newcastle until contacted by The Times. Fortress and American Golf “should have fully disclosed accurate and complete information,” Los Angeles County officials said in a statement. If they had examined Newcastle, officials might have seen red flags. Newcastle had suffered a “material weakness” in internal controls two years earlier and received a “financial health grade” of D from the independent investment research firm Morningstar. In securities filings Newcastle acknowledged, “We have never owned or operated a golf business. ” Under Newcastle, American Golf took over some courses from competitors that were failing to pay rent. And yet, during Newcastle’s tenure, American Golf may not always benefit Los Angeles County. If Newcastle again runs into financial trouble, American Golf might have to be sold once more, a process that could eat up more government resources. American Golf, which must pay the county a cut of what it makes on carts and other golfing gear, also recently created a program that effectively minimizes some of those payments. Golfers who join the program do not pay for certain items that would be lucrative for the county. The program classifies the membership fee under driving ranges, which typically require a smaller payment to the county. Fortress, which argues that the program has attracted more golfers to the county, has benefited from the arrangement. Because Newcastle, and not Fortress, was the buyer, Fortress can enjoy the upside of American Golf without much risk. It works like this: Newcastle pays Fortress a fee to manage Newcastle’s business. But Fortress does not own a majority stake in Newcastle. So, if American Golf proves unprofitable, Fortress still collects fees from Newcastle, while avoiding major losses. These deals are a source of revenue for Fortress, whose executives have created five other companies like Newcastle. Last year, Fortress received more than $200 million in revenue from these companies, about a 50 percent jump from the year before. The golf course deal could serve as a cautionary tale for both private equity firms and the growing number of governments doing business with them. Unlike a typical private equity deal, transactions with public agencies call for greater transparency. Fortress, which has not been accused of wrongdoing by the governments, argues that it was transparent in the golf deal. The firm said it was speaking on behalf of Newcastle, which relies on it for    management. Although Newcastle has its own shareholders and board, Fortress is responsible for the company’s management, investments and other business decisions. In a statement, Fortress said that “there is no mystery about who owns American Golf” because it “is very clear” in Newcastle’s securities filings. But these filings were published after the local governments approved the deal. Fortress also pointed to a document labeled “draft,” which it said American Golf emailed to one Los Angeles County official, making reference to “Newcastle Investment Corp. and other funds. ” That official said he had no record of receiving the email. American Golf acknowledged that it had not sent the document to other towns. “It’s like being told you were getting a big red fire truck and then it turns out you get a little red wagon,” said Eric Preven, a TV producer who ran for public office in Los Angeles. With the help of his brother Joshua, a teacher, he first raised suspicions about the American Golf deal more than two years ago. Still, the quality of golf courses has not suffered since Newcastle bought American Golf, Los Angeles County said. Officials often vote an American Golf course best in the county. Newcastle and American Golf don’t own the courses. Instead, as part of an outsourcing plan, American Golf manages operations, making money every time a golfer tees off. Even before Newcastle bought American Golf from Goldman Sachs, it retained a   local lobbyist: Matt Knabe, whose father is Don Knabe, a member of the Los Angeles County Board of Supervisors. American Golf hosts the Knabe Cup, an annual youth tournament named in honor of the senior Mr. Knabe. His son’s lobbying firm, when questioned by local media about the relationship, has previously said there is no conflict because “Matt does not lobby” his father. There is no indication the Knabes directed American Golf to play down Newcastle’s role. In 2013, Don Knabe and the county board approved the sale of American Golf. At the time, the board appeared impressed with Fortress’s track record in working closely with local governments  —   citing in particular a letter from a Florida official praising Fortress. In that letter, the official from Florida’s Department of Transportation said he “had the pleasure” of working alongside Fortress in building a passenger railway known as All Aboard Florida. Along a   stretch of Florida’s eastern coast, Fortress is embarking on its boldest project yet: the nation’s only purely private intercity passenger railroad. The project, All Aboard Florida, is expected to take five years and nearly $3 billion to build. At speeds reaching 100 miles an hour, it plans to eventually carry passengers from Miami to Orlando, with stops in Fort Lauderdale and West Palm Beach. And if trains start rolling next year, as planned, and prove successful, the project may provide a template for private investment in public infrastructure for years to come. Yet this ambitious private project hinged on the blessing of government officials. The administration of Gov. Rick Scott of Florida conditionally agreed to lease out state property to All Aboard Florida, which plans to share the track with an existing freight train company. Federal regulators, after some initial concerns, concluded that the railroad’s safety plans met their standards. And a   nonprofit approved   bonds that can help finance All Aboard Florida’s business. Fortress, which owns both the passenger train and the freight rail, secured these victories through a mix of negotiations, public support, political power and a revolving door between the government and the private sector. Documents obtained through public records requests pull back a curtain on the lobbying that shaped the project. The documents, many previously unreported, spotlight the role played by Governor Scott’s aides. The governor’s former campaign manager teamed up with one of his former policy advisers to coordinate All Aboard Florida’s media strategy and meetings with the governor’s administration. They found a receptive audience, including an aide to Governor Scott who texted a Fortress employee, “Let me know if I can be helpful. ” Fortress stands to benefit from the project in several ways. The firm owns All Aboard Florida’s parent company, as well as the freight train operator sharing the track, which means it would profit from All Aboard Florida’s success. Fortress also controls land around the track, where it is developing rental housing. And even if the passenger rail flops, Fortress might benefit from All Aboard Florida’s track upgrades, which would enable its freight operator to carry more cargo at quicker speeds. (Fortress disputes this point, arguing that the upgrades are not needed to improve its freight operations.) Not everyone will benefit. Along Florida’s Treasure Coast  —   oceanfront counties that include some of the state’s richest and poorest areas  —   some residents worry that the train will disrupt their lives. In one county, the sheriff argued that the trains, 32 each day, “could have   implications” if they stranded patrol cars on one side of the tracks as trains passed. A hospital executive warned about ambulances idling at crossings. Two counties sued to halt the   bonds. Some residents also express a deeper concern: The train is literally passing them by. Towns without stops will get the headaches of rail traffic rumbling through, without the economic benefits. In Gifford, a   community pockmarked with abandoned homes, residents say they already live on the wrong side of the tracks. Fortress’s freight trains park there to exchange crews, delaying traffic and prompting local outcry. Fortress sees it differently, arguing that the freight trains stop there because it is safe to do so. Mr. Edens, who said the passenger line was open to adding more stops, remarked that “the handful of opponents of the project are focused on their own narrow   not the greater good. ” While critics say All Aboard Florida is unnecessary  —   a small number of Amtrak trains already travel from Miami to Orlando  —   Mr. Edens said it had the potential to revitalize local economies because mass transit is “one of the real cornerstones of economic growth. ” He called it a “real guidepost for how we can actually bring passenger trains back to the United States. ” Concerns that the new trains could cause traffic delays are unfounded, he said, citing data estimating that All Aboard Florida trains would take 45 seconds to clear crossings. All Aboard Florida said that it would be the only railroad in the country to operate “in full compliance with the latest and most stringent” federal safety requirements, and that it would help reduce car travel in the state. “We’re talking about seconds,” Mr. Edens said, adding that it was “not a meaningful” amount of time. William D. Snyder, the sheriff of Martin County, disagreed. “In my business, seconds absolutely matter,” he said. The train’s opponents dispute some of All Aboard Florida’s data about how long the trains will block intersections, saying the company’s assessment is based on   assumptions. Bob Solari, a commissioner in Indian River County, said that All Aboard Florida did not in “any meaningful way protect the people and property of the Treasure Coast. ” The safety concerns, however, did not ruin the railroad project, thanks in part to some political  . All Aboard Florida took shape after Governor Scott rejected $2. 4 billion in federal stimulus money for   rail between Orlando and Tampa, saying it made Florida taxpayers liable for losses. That decision, in 2011, effectively helped clear a path for an alternative train, though All Aboard Florida was still in its infancy at the time. Adam Hollingsworth was one of the governor’s aides involved in the decision to reject the stimulus money, emails show. At the time, he was a volunteer policy adviser. Months later, he went to work for one of All Aboard Florida’s sister companies. To push for the Fortress railway, Mr. Hollingsworth initially coordinated with Susan Wiles, Governor Scott’s former campaign manager. The railway also retained a lawyer who had previously worked for a government agency from which it needed a permit. This team’s background was helpful to All Aboard Florida, records show. The day before Mr. Edens of Fortress was to meet with the governor’s office, Mr. Hollingsworth texted a staff member. “You met Wes at the gov’s Christmas party,” he reminded her, referring to Mr. Edens. After the meeting, Mr. Hollingsworth wrote the aide: “Thank you! I am glad you and the gov were favorable inclined. ” Mr. Hollingsworth followed up when All Aboard Florida was about to announce its plans publicly. The aide responded, “Great news!” About four months later, Mr. Hollingsworth resumed working for the governor’s office, as chief of staff. Ethics rules prevented him from having further involvement with the train. Mr. Hollingsworth did not respond to requests for comment. Ms. Wiles praised him, saying he had honored his recusal. All Aboard Florida said it “did not need nor use Adam” beyond the scope of his duties, noting that it hired Ballard Partners, a prominent Florida lobbying firm. A spokeswoman for Governor Scott added that the state did not finance All Aboard Florida. Still, the company has benefited from government support. In addition to various regulatory approvals, All Aboard Florida has applied for funding from the federal railroad agency. And it accepted about $9 million in federal funds. In the future, it hopes to fund itself through bonds approved by the Florida Development Finance Corporation, a   nonprofit. The bonds are   but All Aboard Florida, not the government, is responsible for repaying them. Last year, the nonprofit’s board approved the bonds, which All Aboard Florida has yet to issue. Here, too, lobbying was at work. Before the board held a crucial hearing on the bonds, an All Aboard Florida representative emailed one of the board’s new members a reminder to submit the paperwork by close of business the next day “in order to get confirmed by the Senate. ” The email added, “Can I help with this?”'"}, "time": 1742628585.5010173}