{"duration": 0.11854410171508789, "input_args": {"text": "'Evgeny Sribnyjj / Shutterstock.com \\nSo it has happened: Hillary did not win! I say that instead of saying that “Trump won” because I consider the former even more important than the latter. Why? Because I have no idea whatsoever what Trump will do next. I do, however, have an excellent idea of what Hillary would have done: war with Russia. Trump most likely won’t do that. In fact, he specifically said in his acceptance speech: \\nI want to tell the world community that while we will always put America’s interests first, we will deal fairly with everyone, with everyone — all people and all other nations. We will seek common ground, not hostility; partnership, not conflict . \\nAnd Putin’s reply was immediate: \\nWe heard the statements he made as candidate for president expressing a desire to restore relations between our countries. We realise and understand that this will not be an easy road given the level to which our relations have degraded today, regrettably. But, as I have said before, it is not Russia’s fault that our relations with the United States have reached this point. \\nRussia is ready to and seeks a return to full-format relations with the United States. Let me say again, we know that this will not be easy, but are ready to take this road, take steps on our side and do all we can to set Russian-US relations back on a stable development track. \\nThis would benefit both the Russian and American peoples and would have a positive impact on the general climate in international affairs, given the particular responsibility that Russia and the US share for maintaining global stability and security. \\nThis exchange, right there, is enough of a reason for the entire planet to rejoice at the defeat of Hillary and the victory of Trump. \\nWill Trump now have the courage, willpower and intelligence to purge the US Executive from the Neocon cabal which has been infiltrating it for decades now? Will he have the strength to confront an extremely hostile Congress and media? Or will he try to meet them halfway and naively hope that they will not use their power, money and influence to sabotage his presidency? \\nI don’t know. Nobody does. \\nOne of the first signs to look for will be the names and backgrounds of the folks he will appoint in his new administration. Especially his Chief of Staff and Secretary of State. \\nI have always said that the choice for the lesser evil is morally wrong and pragmatically misguided. I still believe that. In this case, however, the greater evil was thermonuclear war with Russia and the lesser evil just might turn out to be one which will gradually give up the Empire to save the USA rather than sacrifice the USA for the needs of the Empire. In the case of Hillary vs Trump the choice was simple: war or peace. \\nTrump can already be credited with am immense achievement: his campaign has forced the US corporate media to show its true face – the face of an evil, lying, morally corrupt propaganda machine. The American people by their vote have rewarded their media with a gigantic “f*ck you!” – a vote of no-confidence and total rejection which will forever demolish the credibility of the Empire’s propaganda machine. \\nI am not so naive as to not realize that billionaire Donald Trump is also one of the 1%ers, a pure product of the US oligarchy. But neither am I so ignorant of history to forget that elites do turn on each other , especially when their regime is threatened. Do I need to remind anybody that Putin also came from the Soviet elites?! \\nIdeally, the next step would be for Trump and Putin to meet, with all their key ministers, in a long, Camp David like week of negotiations in which everything, every outstanding dispute, should be put on the table and a compromise sought in each case. Paradoxically, this could be rather easy: the crisis in Europe is entirely artificial, the war in Syria has an absolutely obvious solution, and the international order can easily accommodate a United States which would “ deal fairly with everyone, with everyone — all people and all other nations ” and “ seek common ground, not hostility; partnership, not conflict “. The truth is that the USA and Russia have no objective reasons for conflict – only ideological issues resulting directly from the insane ideology of messianic imperialism of those who believe, or pretend to believe, that the USA is an “indispensable nation”. What the world wants – needs – is the USA as a *normal* nation. \\nThe worst case? Trump could turn out to be a total fraud. I personally very much doubt it, but I admit that this is possible. More likely is that he just won’t have the foresight and courage to crush the Neocons and that he will try to placate them. If he does so, they will instead crush him. It is a fact that while administrations have changed every 4 or 8 years, the regime in power has not, and that US internal and foreign policies have been amazingly consistent since the end of WWII. Will Trump finally bring not just a new administration but real “regime change”? I don’t know. \\nMake no mistake – even if Trump does end up disappointing those who believed in him what happened today has dealt a death blow to the Empire. The “Occupy Wall Street” did not succeed in achieving anything tangible, but the notion of “rule of the 1%” did emerge from that movement and it stayed. This is a direct blow to the credibility and legitimacy of the entire socio-political order of the USA: far from being a democracy, it is a plutocracy/oligarchy – everybody pretty much accepts that today. Likewise, the election of Trump has already proved that the US media is a prostitute and that the majority of the American people hate their ruling class. Again, this is a direct blow to the credibility and legitimacy of the entire socio-political order. One by one the founding myths of the US Empire are crashing down and what remains is a system which can only rule by force. ORDER IT NOW \\nAlexander Solzhenitsyn used to say that regimes can be measured on a spectrum which ranges from regimes whose authority is their power and regimes whose power in in their authority. In the case of the USA we now clearly can see that the regime has no other authority than its power and that makes it both illegitimate and unsustainable. \\nFinally, whether the US elites can accept this or not, the US Empire is coming to an end. With Hillary, we would have had a Titanic-like denial up to the last moment which might well have come in the shape of a thermonuclear mushroom over Washington DC. Trump, however, might use the remaining power of the USA to negotiate the US global draw-down thereby getting the best possible conditions for his country. Frankly, I am pretty sure that all the key world leaders realize that it is in their interest to make as many (reasonable) concessions to Trump as possible and work with him, rather than to deal with the people whom he just removed from power. \\nIf Trump can stick to his campaign promises he will find solid and reliable partners in Vladimir Putin and Xi Jinping. Neither Russia nor China have anything at all to gain from a confrontation or, even less so, a conflict with the USA. Will Trump have the wisdom to realize this and use it for the benefit of the USA? Or will he continue with his anti-Chinese and anti-Iranian rhetoric? \\nOnly time will tell.'"}, "time": 1742563535.2697992}