{"duration": 0.2570359706878662, "input_args": {"text": "'by Yves Smith \\nYves here. What the informative post below fails to mention is that farm credit had become a hot political issue by the time the Farm Credit system was created. For more details on the struggle of indebted farmers to obtain political power, see The Populist Moment: A Short History of the Agrarian Revolt in America by Lawrence Goodwyn. As Matt Stoller wrote in 2010 : \\nA lot of people forget that having debt you can’t pay back really sucks. Debt is not just a credit instrument, it is an instrument of political and economic control. \\nIt’s actually baked into our culture. The phrase ‘the man’, as in ‘fight the man’, referred originally to creditors. ‘The man’ in the 19th century stood for ‘furnishing man’, the merchant that sold 19th century sharecroppers and Southern farmers their supplies for the year, usually on credit. Farmers, often illiterate and certainly unable to understand the arrangements into which they were entering, were charged interest rates of 80-100 percent a year, with a lien places on their crops. When approaching a furnishing agent, who could grant them credit for seeds, equipment, even food itself, a farmer would meekly look down nervously as his debts were marked down in a notebook. At the end of a year, due to deflation and usury, farmers usually owed more than they started the year owing. Their land was often forfeit, and eventually most of them became tenant farmers. \\nThey were in hock to the man, and eventually became slaves to him. This structure, of sharecropping and usury, held together by political violence, continued into the 1960s in some areas of the South. As late as the 1960s, Kennedy would see rural poverty in Arkansas and pronounce it ’shocking’. These were the fruits of usury, a society built on unsustainable debt peonage. \\nToday, we are in the midst of creating a second sharecropper society. I first heard the term “slaves to the bank” from a constituent fighting a fraudulent foreclosure. The details aren’t so important — this couple had been illegally placed in a predatory loan — but at one point, the wife explained that she and her husband were so scared they would have “given their first born to the bank to keep their home”. That was fear speaking, total unadulterated panic. And as we watch debt-holders use the ornaments of fear, such a loan sharking company that set up fake courts to convince debtors they were losing cases, we should recognize that what the creditor class wants is what they’ve always wanted: total dominance of our culture. \\nBy Sarah Quin Assistant Professor, Sociology, University of Washington. Originally published at the Institute for New Economic Thinking website Hoping to learn from other countries’ experiences in organizing finance for agriculture, more than 150 Americans were sent abroad in the summer of 1913 to investigate the minutiae of farm-credit systems in and around Europe. \\nThey were sent as far north as Norway and as far south as Egypt, with Ireland and Russia marking the western and eastern boundaries of the study. They learned of microcredit-like experiments to support small-plot tenant farming in Italy. In France they were told how farm credit embodied democratic ideals. In the Netherlands and Spain, commission members found counterparts who, like the Americans were doing, had looked to other European nations for ways to improve the management of farm credit. Perhaps the most anticipated stop of this trip would be in Germany, whose system of long-term farm credit distribution had achieved world renown. \\nThe key ideas brought home from Europe by commission members more than a century ago still shape today’s U.S. credit policy. The organizing principle of these ideas was the proposition that providing farm credit could be a low-cost and politically palatable form of economic policy through which government could help people help themselves. This paved the way for the Federal Farm Loan Act of 1916, which redesigned the U.S. system from the ground up by creating a new network of government-supported farm credit cooperatives. \\nThe Act was arguably a watershed in the use of credit as a federal policy tool whose impact was felt far beyond the agricultural sector. Before 1916, the national government used credit allocation more sparingly, as a temporary means to support expensive internal developments such as railways. After the Act, there was a continual expansion of programs that bought, sold, issued, guaranteed, or otherwise promoted the flow of credit to specific sectors or groups. In the United States today, one third of privately issued debt is backed by the government, not only through the Fed but also through the $3.4 trillion in loans guaranteed or held through a vast network of federal credit programs (if you include implicit guarantees of financial debt, the amounts are much, much higher ). As Marianna Mazzucato and L. Randall Wray have noted , these forms of credit support are a central part of how the federal government participates in the U.S. economy. This proliferation of government credit allocation seems remarkable in light of longstanding political attitudes on government involvement in the economy. \\nFarmers depend on credit for their livelihoods, using it not only to buy equipment and prepare land but also to feed their families in the lean months before the harvest. As the United States developed into an agricultural powerhouse , it faced a significant problem in moving capital reserves concentrated in eastern cities into the hands of small borrowers spread out across a vast and sparsely populated frontier. In the absence of modern day credit institutions, the West and South suffered destabilizing credit cycles of boom and bust, with mortgage rates sometimes twice as high as those in the Northeast. Many farmers believed that these higher rates were the unfair doings of parasitic financiers and middlemen. In the Jacksonian era, many farmers worried that government involvement in banks and credit would make the situation worse by adding corrupt politicians into the mix. Over time, however, Populist farmers came to believe that a stronger national government was needed to break bankers’ stranglehold over the supply of credit. \\nBy the 1890s, the question of farm credit was a polarizing national issue: a proposal to offer credit and currency backed by local storage units (called the Subtreasury Plan) became a wedge issue that threatened to undermine the coalition that made up the Southern Democratic Party. Credit distribution was one of the most acrimonious and destabilizing class divides of the era, but by the middle of the decade these credit debates had been eclipsed by the politics of free silver. Left unresolved, the credit problem lingered. \\nIn the first decade of the 20th century, a group of progressive reformers rediscovered the issue of “farm credits.” Worried about social disintegration in America’s heartland in the wake of massive urbanization, these reformers came to view the stable and affordable supply of credit as essential to farmers’ well-being, and through that, the well-being of the entire nation. But, being elites, they approached credit not as inherently exploitative so much as a technical problem to be solved. They looked to Europe for guidance and inspiration. Hence the tour. \\nBy the time committee members arrived in Germany, news of that country’s farm-credit success had traveled around the world, and some of its techniques were already adopted by other nations such as France. German lecturers told the group that German agriculture thrived not because of the quality of German soil, but because of the quality of German credit. The Americans were especially interested in one type of credit institution — the Landschaften , a network of local cooperative banks that issued covered mortgage bonds called Pfandbriefe . These Pfandbriefe bore a decidedly modest 3%-4% return. “The Germans prefer to sleep well rather than eat well,” one lecturer explained. \\nThe entire German credit system was built for stability rather than profit: it used conservative land valuations, careful regulatory standards, and local risk-sharing to assure its reliability. Whether this could be adapted to the American context was a serious question. A political economy professor lecturing in Halle warned the delegation that, while the Landschaften were the “perfect” means of mortgage credit, differences in political systems could make the system untenable in the U.S. When a delegate asked how the Prussians dealt with defective land titles, the speaker simply dismissed the question: “Well, that is an impossible thing in Prussia. We have no defective titles.” German farm credit distribution rested on a solid foundation of independent oversight and bureaucratic reliability. It was a far cry from the underdeveloped and scandal-ridden United States national government. \\nThe committee members returned home recognizing the technical superiority of the German system but debating its cultural and political adaptability to the United States. Would a conservative system of risk-sharing and oversight be embraced by Americans, who they deemed “ambitious, individualistic, desirous of acquiring means and property”? Would government “paternalism” kill Americans’ entrepreneurial spirit? Would American society accept the principle that farmers deserved special treatment when it came to accessing credit? \\nTo overcome these objections, proponents of a European-inspired farm credit policy spun it as government helping people help themselves , providing credit support could through farmers’ cooperatives. \\nThe divisive nineteenth century credit politics gave way to a vision of credit as an inoffensive means of economic development, of low cost to the state. Proponents argued that “wise legislation” to lower credit risk could unlock the value of the nation’s land, then estimated by one commentator at $40 billion. It was a huge potential payoff. Later scholars of credit programs would frequently note the same thing about the federal credit programs: compared to direct forms of welfare or other expenditures, credit support is cheap, since it can be implemented by government guarantees, tax expenditures, risk management techniques, and disbursements paid back over time, sometimes with interest. \\nThis logic was built into the structure of the Federal Farm Loan Act of 1916. The centerpiece of the Act was a proposed local version of the German system. The Treasury was authorized to fund 12 reserve banks in order to funnel credit to a network of new farmers’ lending cooperatives. The Department of Agriculture encouraged the formation of these lending cooperatives through a massive education effort. In a nod to American independence, the German system of risk sharing — in which members of the Landschaften were liable up to the full value of their property — was watered down. If the bank itself ran into trouble, American farmers would be liable for only 10% of their loan amount, rather than for the full value of their property. Since, over time, farmers could pay into the system and repay the state, the long-term costs of the program were expected to be low. Tax-exempt bonds would encourage a flow of funds into the reserve banks at the cost of some state revenue, but this was far less expensive than, say, directly subsidizing farmers. \\nFor all that the 12-bank structure mimicked the Federal Reserve Act, the creation of lending cooperatives meant that the FFLA was a far more complicated, experimental, and entrepreneurial design. A new system of farm credit was built from scratch. One observer at the time noted that \\n[i]n spirit the Act was revolutionary — its authors were convinced that American methods were not worth saving. \\nNot long after the passage of the Act, government officials recognized that the low cost and ideological palatability of the farm loan system could apply in other sectors. Credit support in the housing market ballooned during the Great Depression, and the postwar proliferation of credit as a tool of governance continues today. \\nIn the “Analytical Perspectives” section of the President’s budget, the chapter detailing the $3.4 trillion in loans held or guaranteed by the federal government reveals the diverse political uses of credit. Federal credit has military functions, including Defense Department loans for the purchase, stockpiling, and manufacturing of military materiel, and the Atomic Energy Commission’s use of guarantees to encourage nuclear science. Credit is also a tool of foreign policy: the United States exports food to other nations through USAID. Loans can serve as disaster relief, as both FEMA and the SBA include credit support to assist with natural disasters, and the federal government also provides loans directly to states for this purpose. Credit is also extensively used as part of energy and environmental policy, with geothermal and renewable energy, biorefineries, and synthetic fuels having all benefited from credit support. Tracing its use in housing, David Freund notes that the appeal of credit programs is that they seem like small market corrections rather than consequential state policies. And they have been used to support every major sector of the American economy. \\nThe Analytical Perspectives of the budget wraps the complexities of these programs in the dry academic language of market corrections. “Credit and insurance markets sometimes fail to function smoothly due to market imperfections … ” The implication is that this massive mobilization of debt and risk absorption by the federal government is best thought of as a technical adjustment to market imperfections, rather than, say, the American version of a developmental state. \\nThat language, I believe, is the moderate way of thinking about credit articulated during the progressive era, and now tailored for the neoliberal age. Like a nervous wizard, it asks us not to pay attention to the man behind the curtain, and for the most part, Americans comply. And why wouldn’t they? After all, the idea that credit support does not ask us to think hard about the social and political conditions of possibility for market success has been part of the appeal of credit support all along. 0 0 0 0 0 0'"}, "time": 1742562142.123073}