{"duration": 1.5791523456573486, "input_args": {"text": "'November 14, 2016 - Fort Russ News -  RusVesna - translated by J. Arnoldski -  \\n\\n\\nAround 500 terrorists have been killed by Russian air forces and the Syrian army in western Aleppo. \\nBandits from the Jaish al-Fath Islamist coalition suffered large losses after a failed offensive in western Aleppo which began at the end of October. More than 500 militants and dozens of units of military vehicles were destroyed under fire from Russian and Syrian aircraft and Syrian troops.  \\n\\n\\nAccording to the Syrian Observatory for Human Rights, the bandits’ losses reach up to 260 killed. \\nAs a result of the numerous defeats inflicted upon the Jaish al-Fath coalition in western Aleppo, government troops and their allies are preparing to switch their efforts to the southern districts of the Aleppo. \\nLebanese Hezbollah is preparing a major special operation in the district of Khan-Tuman with the aim of ousting terrorists from positions along the Aleppo-Damscus M-5 highway. \\nFollowing the retreat of the Jaish al-Fath gang, the Syrian army intends to exploit the fleeing and disorganized Islamists to regain control over a number of villages and commanding heights. \\nAs reported earlier , on November 11th the Syrian army and its allies continued to advance in western Aleppo. After breaking through militants’ line of defense, they took the Minyan and Al-Assad districts… \\n\\n\\n\\n\\nFierce fighting is ongoing between militants and the SAA in the Al-Assad district with the use of heavy artillery and volley-fire rocket systems… \\nIn addition, the liquidation of the field commander of the 314th militant regiment, Osama Darwish, known as Abu Il Harman, during clashes with SAA units in the Al-Assad and Minyan districts has been reported. \\n\\n\\n\\n\\nDuring clashes, Syrian troops managed to regain control over the southern triangle of the Al-Assad district and the Hamat Ad-Diyar and Al-Amal schools. \\nRussian and Syrian air forces are launching strikes at militant headquarters and roaming gangs in the Rashidin 4, Khan al-Asal, Gabat al-Basil, Al-Mansura, Maskana, and Kashish airport districts. This has resulted in the elimination of dozens of armored vehicles and large numbers of militants. \\n\\n\\n\\nMeanwhile, it has been repotred that groups involved in the Euphrates Shield operation, supported by Turkey, have announced the capture of the village of Talil north of the city of al-Bab northeast of Aleppo as a result of fighting against ISIS.  \\n\\n\\n\\n\\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742562505.3938706}