{"duration": 0.11931800842285156, "input_args": {"text": "'LOS ANGELES  —   For the past decade, Jeffrey Katzenberg’s identity has been indistinguishable from the DreamWorks Animation brand. A relentless advocate for his little studio, he became famous for making 40 phone calls and conducting three breakfast meetings before 10 a. m. (He always orders the same thing: Diet Coke.) Mr. Katzenberg’s campaign to keep DreamWorks Animation afloat, even as a changing film business made that increasingly difficult, came down to one desire: He wanted to be his generation’s Lew Wasserman, the M. C. A. chief who was Hollywood’s big everything  —   biggest political power, biggest cultural force, biggest business mogul. On Thursday, part of that dream ended. DreamWorks Animation, essentially the sole remaining piece of a splashy conglomerate founded in 1994 by Mr. Katzenberg, Steven Spielberg and David Geffen, said it would sell itself to Comcast’s sprawling NBCUniversal for $3. 8 billion. In return for a personal payout estimated at $420 million, Mr. Katzenberg, 65, will reluctantly step aside, having never quite managed to become that kingpin. The deal will provide NBCUniversal with family film franchises like “How to Train Your Dragon,” “Shrek” and “Kung Fu Panda” that it can use in its quest to compete with Disney in the global theme park, consumer products and children’s television businesses. But Hollywood was really only interested in one thing: Why did the intense and bespectacled Mr. Katzenberg, a   animation enthusiast, finally call it a day? For more than two decades, Mr. Katzenberg has been a fixture among Hollywood’s elite, sitting courtside at Los Angeles Lakers games with the likes of Leonardo DiCaprio and Rihanna and reigning over an annual Oscar   that draws every mogul in town. In 2012, he made White House officials blanch by insisting President Obama spend extended time chatting with donors at George Clooney’s mansion he got his way. But as Mr. Geffen has graduated to philanthropy, donating hundreds of millions of dollars and seeing his name go up on the walls of some of the country’s top cultural institutions, when he’s not sailing the world on his   and Mr. Spielberg has continued to make   films, Mr. Katzenberg has had to mostly focus on the grinding task of keeping DreamWorks Animation going. With that chapter closed, Mr. Katzenberg must now decide what to do. Stephen B. Burke, NBCUniversal’s chief executive and senior vice president of Comcast, suggested in a phone interview that Mr. Katzenberg could find a next act in digital media, perhaps following the example of Barry Diller, the former Hollywood executive who built  . (Mr. Katzenberg started his career at Paramount Pictures as Mr. Diller’s assistant.) Others wondered if Mr. Katzenberg was positioning himself for an ambassadorship should Hillary Clinton win the presidency. (After supporting President Obama in 2008, he has recently been one of Mrs. Clinton’s top  .) There is also the possibility that Mr. Katzenberg could follow Mr. Geffen’s example and turn to philanthropy. Mr. Katzenberg seemed unsure how to handle the questions about his future. He initially agreed to speak to a reporter. But that pledge was ultimately reversed, with a spokesman saying that Mr. Katzenberg instead wished the spotlight to shine on Comcast. At a 10 a. m. meeting on Thursday for DreamWorks Animation’s 1, 500 employees, held near a monumental fountain on the studio’s   campus in Glendale, Calif. Mr. Katzenberg struck an upbeat tone, according to attendees. “I rest easy in knowing that the house of dreams that we’ve spent the last two decades building together  —   the stories, the characters, the joy and the laughter  —   has found the best possible home,” he said, standing near two senior Universal executives. He added, “This is not a deal that we needed to do, but it’s the deal I’d always hoped would come along. ” The reality is that Mr. Katzenberg finds himself as both a winner and loser. After years of failed efforts to escape a    cycle driven by sporadic film releases, he finally found a rich solution for his company. Comcast paid more than many people thought DreamWorks Animation was worth. (“Comcast Overpays,” read the headline of a blog post written by Rich Greenfield, a BTIG Research analyst.) DreamWorks Animation shareholders will receive $41 a share in cash. “I think we can take their existing I. P. and do more with it,” Mr. Burke said. The price puts DreamWorks Animation on par with Lucasfilm, the “Star Wars” studio that Disney bought in 2012 for about $4 billion. And Mr. Katzenberg will retain a business platform, albeit a tiny one: Comcast said he would serve as chairman of a new entity, DreamWorks New Media, which will be made up of AwesomenessTV, an online studio and distributor of content aimed at teenage girls, and NOVA, a fledgling unit that uses   animation technology to assist companies like Nike and Burberry with marketing campaigns. (Contrary to reports, NBCUniversal has not decided what to do with AwesomenessTV, which is partly owned by Verizon, a Comcast rival. “You could imagine a situation where AwesomenessTV doesn’t stay as part of the company forever, but it could easily be the other way,” Mr. Burke said. “We don’t know. ”) Even so, Thursday was a day of loss for Mr. Katzenberg. People close to him said he struggled with the decision. In previous sale and merger attempts  —   notably one with SoftBank in 2014, followed by one with Hasbro  —   Mr. Katzenberg intended to come along for the ride by continuing to run the studio. But Comcast made it clear that it was only willing to pay such a high price if it could create synergies by folding DreamWorks Animation into its Universal Pictures unit, and that could happen only if Mr. Katzenberg ceded control. NBCUniversal wanted its own animation chief, Christopher Meledandri, the executive responsible for the “Despicable Me” franchise, to oversee all operations. Mr. Burke acknowledged that the sale was “not an easy thing for Jeff to grapple with,” adding, “It is his baby. ” The deal came together rapidly. Two weeks ago, Mr. Burke said he received a call from his boss, Brian L. Roberts, Comcast’s chief executive. They had heard a whisper that Mr. Katzenberg was considering a maneuver, possibly with a Chinese backer, to take his studio private. They thought that Mr. Katzenberg might instead sell to them. Mr. Roberts placed a call to Mr. Katzenberg, who immediately picked up the phone. Mr. Katzenberg told Mr. Roberts that, depending on Comcast’s price, he would love to talk. Mr. Roberts called Mr. Burke with the news, and the two men, along with a few other Comcast executives, flew to Los Angeles on April 15. The next morning at 7 a. m. the Comcast executives met Mr. Katzenberg and his top lieutenant, Ann Daly, at a downtown law office. The deal making quickly grew fast and furious, to use a term associated with a Universal movie franchise. The end of DreamWorks as a   company  —   Mr. Spielberg in December folded what remained of the company’s   film label into his Amblin Partners  —   reflects a changing Hollywood, where the collapse of the DVD market overwhelmed many independent studios. But the various DreamWorks enterprises also never quite gelled, perhaps because the aims of the company’s founders, despite their personal ties, almost always diverged. Mr. Spielberg, a prolific producer and director, was drawn to his own projects, and seemed often to make the most lucrative among them for companies other than DreamWorks. Mr. Geffen, a financial godfather to his partners, long ago lost interest in movies, and in 2008 withdrew from active involvement in the companies. Mr. Katzenberg, meanwhile, poured himself into DreamWorks Animation, which seemed forever trapped in a creative chase behind its rival Pixar, which often bested it at the box office and on the Oscar circuit. Mr. Katzenberg also got bogged down in an endless fight for positive quarterly earnings news and fresh capital. DreamWorks was founded shortly after Mr. Katzenberg left a senior Disney job amid deteriorating relations with then its chief executive, Michael Eisner. “Times change, the marketplace changes, the original reason the company was founded ceased to exist,” said Terry Press, a former DreamWorks executive who is now president of CBS Films. “The one thing that never changes,” she added, “is Jeffrey’s iron will to succeed. ”'"}, "time": 1742564431.3085327}