{"duration": 0.11093544960021973, "input_args": {"text": "'As Mayor Bill de Blasio of New York turns toward his   fight next year, an issue that galvanized his first run  —   achieving significant police reform  —   is suddenly becoming a liability. Caught in the gap between his soaring rhetoric as an outsider candidate and the realities of leading a city with a   sensitivity to crime, Mr. de Blasio is disappointing many who once supported him, in a community he can ill afford to lose: the black voters who propelled him to office. “All I know is, in all our circles, folks have conversations and there’s a buzz going around about the disappointment,” said Bertha Lewis, the former leader of Acorn who served on Mr. de Blasio’s transition team in 2014, but has become a vocal critic. “There’s a growing enthusiasm gap. ” Throughout the mayor’s term, there have been opportunities for him to live up to his image and his promise as a   police reformer. Instead, those issues have become magnets for dissent. Tens of thousands in extra pay for Daniel Pantaleo, the Staten Island officer who put Eric Garner in a fatal chokehold in 2014. Disciplinary records newly shielded from disclosure. Resistance to   legislation in the City Council. Continuing fidelity to a “ ” model of policing. Frustration can be heard at New York Communities for Change, a social justice advocacy group and early endorser of Mr. de Blasio in the 2013 Democratic primary, and from a former aide, Kirsten John Foy, whose handcuffing at a Brooklyn parade in 2011 helped galvanize Mr. de Blasio’s views on the need for changes in police practices. Last month, Mr. Foy stood alongside Representative Hakeem Jeffries, a Brooklyn Democrat and a possible challenger to Mr. de Blasio in 2017, at a protest outside Police Headquarters. At the Council, a growing number of members have been refusing to stand for the Pledge of Allegiance at the start of meetings, in part, they say, because of the administration’s handling of policing issues. Councilman Jumaane D. Williams, who was detained along with Mr. Foy in 2011, began the effort, saying his decision to offer the silent protest came after he learned that Officer Pantaleo accrued overtime pay while on modified duty. “That’s what brought me over the edge,” said Mr. Williams, a Democrat from Brooklyn. “I had to do something. ” On the other side, members of the Patrolmen’s Benevolent Association have orchestrated protests outside the mayoral residence at Gracie Mansion, and by the Prospect Park Y. M. C. A. where Mr. de Blasio regularly works out. In their view, he has already gone too far. Mr. de Blasio, seemingly cognizant of his potential vulnerability, has responded in recent weeks. After the city’s    police tactics became an issue in the first presidential debate between Donald J. Trump and Hillary Clinton, the mayor seized the opportunity to emphasize his opposition to the overuse of the tactics during the administration of former Mayor Michael R. Bloomberg, doing so on national television and local radio. On Friday, he said that he would press for changes to state law to allow greater transparency with police disciplinary records, a pledge that garnered a lukewarm response from reform advocates. The mayor moved swiftly last month to restrict overtime pay to officers on modified duty  —   like Officer Pantaleo  —   then headed to Harlem to bring his message to a gathering at the Rev. Al Sharpton’s National Action Network. In the speech, the mayor outlined his administration’s efforts to improve relations between the police and minority communities  —   fewer arrests retraining of officers on the use of force a commitment to reinventing community policing  —   while embracing demands for more in the future. “That’s the only way things change,” Mr. de Blasio said. “Keep those demands coming. Keep the pressure on. ” Mr. de Blasio has not yet announced new police reform initiatives. Phil Walzak, a top mayoral aide, said the mayor would do so during his campaign, but he declined to characterize them. “I don’t think at any point is anyone saying, ‘All done here,’” Mr. Walzak said. “There’s more to do. But this mayor is absolutely committed to real reform. He’s put real reforms in place, and there’s more to come. ” Mr. de Blasio is also facing    pressure to embrace a distant and difficult goal: the closing of the Rikers Island jail complex. His campaign has stuck to a simple message when it comes to the police: Crime is down, even with far fewer of the   arrests and police stops that fall heavily on black and Hispanic communities. Dan Levitan, a spokesman for the mayor’s 2017 campaign, said Mr. de Blasio had “proven New York City can improve   relations while remaining the safest big city in America. ” Mr. Levitan pointed to poll numbers showing that Mr. de Blasio’s support remained high among black voters and had remained steady on questions of   relations. Indeed, Mr. Sharpton said the mayor’s “basic supporters have been pretty much satisfied. ” Critics of Mr. de Blasio’s concede that there have been changes at the Police Department during his tenure. But they lament that the reforms have been unilaterally taken and directed by the police themselves. And they focus on the apparent absence of punishment for officers, even for those involved in the   deaths of unarmed black men, like Mr. Garner and Ramarley Graham, who was fatally shot in his Bronx home in 2012. “When your training fails you in the field, there’s no accountability for that,” said Councilman Robert Cornegy, a Democrat who represents parts of Brooklyn. But, he added despairingly, the issue may not cost Mr. de Blasio at the polls because black voters are already “disaffected” in their hopes for police reform. “They’re disappointed,” Mr. Cornegy said of his black constituents, adding: “The   community and the Caribbean communities love really hard, and, consequently, when they’re done, they’re done really hard. They’re not at a done period. ” Policing presents a tightrope for any New York mayor, perhaps none more so than Mr. de Blasio, who began his administration amid the high hopes of reformers and the skeptical eye of    officers. Those tensions burst into public view starting in 2014 after street protests arose in response to a grand jury’s decision not to indict Officer Pantaleo in Mr. Garner’s death, followed by the killing of two patrol officers in Brooklyn and a de facto work slowdown by officers, as some turned their backs on the mayor while he spoke at the officers’ funerals. Mr. de Blasio has at times presented what he hopes will be a new model of community policing in ways that are likely to appeal to    officers. “This is not social work this is crime fighting,” he said recently when asked of the program, in terms oddly reminiscent of  the early administration of former Mayor Rudolph W. Giuliani. Representative Jeffries said the mayor’s resistance to the Council’s legislating police activity, his continued support of   policing  —   a tactic that involves aggressively going after minor offenses to prevent major ones  —   and his embrace of a proposal to make resisting arrest a felony were “not the positions of a police reformer. ” “These are the positions,” he continued, “of someone who seems afraid to aggressively go at the police unions that defend the status quo. ” That feeling has been shared by some who worked in the de Blasio administration, and say they were drawn there by the promise of making deep changes to the criminal justice system. Dominique Day worked on justice initiatives at the Mayor’s Office of Criminal Justice until January. She said she left disheartened at the lack of zeal for changes, such as improving the quality of the information used in the increasingly   interactions between New Yorkers and the criminal justice system. “You have this really exciting rhetoric of reform that has been embraced by almost everyone, including the police and prosecutors,” she said. “But in practice, it’s business as usual. ”'"}, "time": 1742563401.4804225}