{"duration": 0.08973932266235352, "input_args": {"text": "'Science Alert Tue, 25 Oct 2016 Hints of an unidentified, extinct human species have been found in the DNA of modern Melanesians – those living in a region of the South Pacific, northeast of Australia. According to new genetic modelling, the species is unlikely to be Neanderthal or Denisovan – two ancient species that are represented in the fossil record – but could represent a third, unknown human relative that has so far eluded archaeologists. \\n“We’re missing a population, or we’re misunderstanding something about the relationships,” Ryan Bohlender, a statistical geneticist from the University of Texas, told Tina Hesman Saey at Science News. Bohlender and his team have been investigating the percentages of extinct hominid DNA that modern humans still carry today, and say they’ve found discrepancies in previous analyses that suggest our mingling with Neanderthals and Denisovans isn’t the whole story. \\nIt’s thought that between 100,000 and 60,000 years ago, our early ancestors migrated out of Africa, and first made contact with other hominid species living on the Eurasian landmass. This contact left a mark on our species that can still be found today, with Europeans and Asians carrying distinct genetic variants of Neanderthal DNA in their own genomes. And that’s not all they’ve given us. \\nEarlier this year, researchers investigated certain genetic variants that people of European descent inherited from Neanderthals , and found that they’re associated with several health problems, including a slightly increased risk of depression, heart attack, and a number of skin disorders. And a separate study published earlier this month found evidence that modern genital warts – otherwise known as the human papillomavirus (HPV) – were sexually transmitted to Homo sapiens after our ancestors slept with Neanderthals and Denisovans once they left Africa. \\nWhile our relationship with Neanderthals has been widely researched, how we interacted with the Denisovans – the distant cousins of Neanderthals – is less clear. The problem is that Neanderthals are well represented in the fossil record, with many remains having been uncovered across Europe and Asia, but all we have of the Denisovans is a lone finger bone and a couple of teeth that were found in a Siberian cave in 2008 . \\nUsing a new computer model to figure out the amount of Neanderthal and Denisovan DNA carried by modern humans, Bohlender and his colleague found that Europeans and Chinese people carry a similar amount of Neanderthal DNA: about 2.8 percent. That result is pretty similar to previous studies have estimated that Europeans and Asians carry, on average, between 1.5 and 4 percent Neanderthal DNA. \\nBut when they got to Denisovan DNA, things were a bit more complicated, particularly when it came to modern populations living in Melanesia – a region of the South Pacific that includes Vanuatu, the Solomon Islands, Fiji, Papua New Guinea, New Caledonia, West Papua, and the Maluku Islands. \\nAs Hesman Saey explains for Science News: \\n“Europeans have no hint of Denisovan ancestry, and people in China have a tiny amount – 0.1 percent, according to Bohlender’s calculations. But 2.74 percent of the DNA in people in Papua New Guinea comes from Neanderthals. And Bohlender estimates the amount of Denisovan DNA in Melanesians is about 1.11 percent, not the 3 to 6 percent estimated by other researchers. \\nWhile investigating the Denisovan discrepancy, Bohlender and colleagues came to the conclusion that a third group of hominids may have bred with the ancestors of Melanesians.” \\n“Human history is a lot more complicated than we thought it was,” he told her. \\nThis find is supported by a separate study by researchers from the Natural History Museum of Denmark, who analysed DNA from 83 Aboriginal Australians and 25 locals from the Papua New Guinea highlands. \\nAs we reported last month, this was the most comprehensive genetic study of Indigenous Australians to date, and it indicated that they are the oldest continuous civilisation on Earth, dating back more than 50,000 years ago. But the results revealed something else – DNA that was very similar to that of the Denisovans, but distinct enough for the researchers to suggest that it could have come from a third, unidentified hominid . “Who this group is we don’t know,” lead researcher Eske Willerslev told Hesman Saey. \\nUntil we have more concrete evidence of this hypothesised third human species (some fossils would be nice), we can’t prove this , and we should point out that Bohlender’s estimates have yet to be formally peer-reviewed , so they might shift with further scrutiny. And it could be that our identification of Denisovan DNA is more ambiguous than we think, given that our only source is a finger bone and a couple of teeth. \\nBut the evidence is mounting that our interactions with ancient humans were far more complex than we’d assumed, which shouldn’t be much of a surprise, when you think about it. Just because we don’t see them in the fossil record doesn’t mean they didn’t exist – preserving the remains of something for tens of thousands of years isn’t easy, and then someone has to be in the right place at the right time to dig them up. \\nHopefully, the more we investigate the genetic make-up of our most ancient societies, the more hints we’ll get of the rich and complicated history our species shared with those that didn’t make it to modern times. \\nThe results of Bohlender’s analysis were presented last week at the 2016 American Society of Human Genetics meeting in Canada. © Guido Amrein Switzerland/Shutterstock Melanesian children of Papua New Guinea Share:'"}, "time": 1742563161.0892572}