{"duration": 0.12691354751586914, "input_args": {"text": "'  years ago, Jeff Weaver was a lowly campaign aide driving an obscure   congressional candidate around Vermont in a Yugo. Now, Mr. Weaver is well known enough from his stinging appearances in the press and on television to be slammed by Cher. In April, the singer called #JeffWeaver “scum” on Twitter and, with the help of emojis, more scatological epithets. Cher is a devoted Hillary Clinton supporter. Mr. Weaver, 50, is Senator Bernie Sanders’s campaign manager and his closest aide and consigliere. As the Democratic race for president winds down, some party strategists have complained that Mr. Weaver is the Vermont senator’s enabler in chief, a true believer who could encourage his boss to keep fighting on after the June 14 primary in Washington, D. C. even though Mrs. Clinton has mathematically locked up the nomination. Others think Mr. Weaver may be the one person who can coax Mr. Sanders into a conciliatory stance. He hasn’t revealed much yet to reassure either camp. “Sure, there will be a roll call eventually,” he said in a phone interview on Friday, referring to the Democratic convention. “My plan until then is to help the senator do whatever he wants to do to further the political revolution. ” For the moment, at least, Mr. Weaver holds the political world in suspense: Is he going to broker a peace agreement or will he be the last man standing on the Bernie barricades? It’s a delicate moment in the Sanders campaign. Like the time’  music that shoos Oscar winners off the stage at the Academy Awards show, the cascade of Clinton endorsements this last week  —   President Obama, Senator Elizabeth Warren, Vice President Joe Biden  —   are drowning out Mr. Sanders’s   speech. On television, Clinton supporters continue to gingerly humor the senator, insisting he should take his time. In private, those same strategists drum their fingers, roll their eyes and look pointedly at their watches as they circle Mr. Weaver. Mr. Weaver, who is bald, bearded and wears glasses, looks like many other Washington political operatives who roundelay on cable news shows. Since the Sanders campaign started, he has become adept at   sparring, but he isn’t typical. Instead he is a rather glaring reminder of what has made the Sanders campaign so different  —   and unpredictable. Mr. Weaver had left politics and was running a comic book and gaming store in Falls Church, Va. when Mr. Sanders tapped him for the job he had never managed a presidential campaign before. (The recorded message on his personal cellphone still takes messages for Victory Comics.) He was an unlikely choice, but possibly the best one for the willful and demanding   democratic socialist who, after meeting with President Obama on Thursday, assured supporters at a rally in Washington, D. C. that “we are still standing. ” Mr. Sanders relies on longtime loyalists to work round the clock. Mr. Weaver calls himself Mr. Sanders’s lieutenant. (He didn’t say Robin, though when pressed he said his favorite superhero is Batman.) “I’ve worked for Bernie since I was 20 years old, so I am still inspired by what he has to say, but you know I’ve been with him so long,” Mr. Weaver said in a deserted hotel cafeteria on June 7, the day of the California primary. “I think one of the reasons why he asked me is that he knows I know how he thinks,” Mr. Weaver said. “I’m here to do what Bernie wants to get done. By and large I understand what that is before he   …     ” Mr. Weaver paused and changed tack. “Without having to ask him about it. ” Those who have worked with him on Capitol Hill say he is more influential than he lets on. “He is the one staff person who is both loyal to Bernie Sanders and clearly not intimidated by him in the least,” said Luke Albee, a former chief of staff to the Democratic Senators Patrick Leahy of Vermont and Mark Warner of Virginia. Mr. Albee met Mr. Weaver in the 1980s, when Mr. Weaver was a Boston University student lobbying Senator Leahy on behalf of Soviet Jewry. “He didn’t look like a typical student,” Mr. Albee said. “He was smart, a fast speaker and he looked 40. ” (Mr. Weaver later left B. U. after being suspended for, among other things, student protests against apartheid.) Mr. Albee said he didn’t know in which direction Mr. Weaver would prod Mr. Sanders, if any. “If I were to guess, I would think he wants to come up with a plan to land the plane smoothly,” Mr. Albee said. “At least I hope so. ” Carol Davis, the treasurer for Mr. Sanders’s first senate campaign, said she was astounded when Mr. Weaver was appointed campaign manager, but later decided it made sense. “With Bernie and Jeff, it’s sometimes hard to tell where one ends and the other begins,” she said. And perhaps accordingly, Mr. Weaver has been cast as the heavy in news reports that the dwindling Sanders campaign is riven between   and professional consultants who prefer to get back on the good side of the Democratic establishment. Mr. Weaver disagreed. “The senator, he drives this train,” Mr. Weaver said. “It’s not a   or   campaign. ” Mr. Weaver has made enemies on Capitol Hill and inside the Democratic National Committee, but he appears to get along quite well with his opposite number in the Clinton campaign, Robby Mook. In fact, Mr. Mook and Mr. Weaver seem to have the kind of   entente  —   and camaraderie  —   that the Soviet foreign minister Eduard Shevardnadze and Secretary of State Jim Baker shared during the Cold War. “I get along with Jeff extraordinarily well,” Mr. Mook said, noting that he speaks to Mr. Weaver by phone often. “He is obviously a tough opponent who did a masterful job, but I consider him a good and close colleague. ” Tad Devine, Mr. Sanders’s chief strategist, is described by some political analysts as the insider most eager to make peace with the Clinton forces. Mr. Devine said he thinks of Mr. Weaver as a friend and ally, not a rival. “Jeff looks tough and aggressive on television,” Mr. Devine said. “He’s smart and he’s not afraid to stay stuff. But off camera, he’s steady, really smart and good company. We laugh a lot. ” It was not so jolly inside the Sanders war room on Hollywood Boulevard in Los Angeles on the night of the California primary. The two top aides sat near each other as the returns began coming in, not so much together as in parallel play. Mr. Devine watched CNN on a laptop and made droll comments about the commentators. Mr. Weaver was crouched over a different computer with the campaign’s pollster Ben Tulchin, staring at early returns. Those results showed Mrs. Clinton with a much stronger lead than the Sanders team had hoped for, and the room grew quieter. Younger campaign aides studied their screens with the strained intensity of gamblers watching a roulette ball circle closer and closer to zero. Mr. Weaver maintained good humor  —   albeit gallows humor  —   and made phone calls. Mr. Weaver, while respected by his peers, isn’t a clubbable Washingtonian. When Vermonters refer to him as a “St. Albans boy,” they don’t mean he is an alumnus of the elite private school in Washington, D. C. that Al Gore and Secretary of State John Kerry attended. Mr. Weaver was raised in St. Albans, Vt. a small rural town near the Canadian border. He has   roots his grandmother was named Violet Champagne. He was educated by nuns and considers himself as social justice Catholic his three children attended Catholic schools. From 1985 to 1989, he was in the United States Marine Corps Reserves. While working for Mr. Sanders, he went to Georgetown law school, where he met his wife, Barbara Butterworth, 49, who shares his progressive politics and is a criminal defense lawyer for indigent clients. “Jeff enjoys taking on the powers that be,” Ms. Butterworth said. Mr. Weaver said he doesn’t know what he will do after the campaign. He said he wasn’t sure if he would return to the comics store. And he doesn’t seem likely to become a hired gun on the Democratic circuit. When asked what other politicians he could work for, Mr. Weaver gave the name of Paul Wellstone, the progressive Minnesota senator who died in a plane crash in 2002. The other name that came to mind was the California representative Barbara Lee, the only member of Congress to vote in 2001 against the authorization of use of force after the Sept. 11 attacks.   Mr. Weaver could certainly pursue a career as a    political commentator. He could also, he joked, make   infomercials, since he has lost 30 pounds during the campaign. He seems to be tickled by his sudden fame, and chuckled about a recent encounter on the MSNBC program “Hardball” with Chris Matthews. When Mr. Matthews scolded Mr. Weaver for not having yet released Mr. Sanders’s tax returns, Mr. Weaver pointed out that Mr. Matthews’s wife, Kathleen, didn’t release their tax returns when she ran for a Congressional seat last year. (Ms. Matthews lost the primary.) Mr. Matthews, clearly taken aback, suggested the analogy was unfair. “This is ‘Hardball,’ Chris,” Mr. Weaver replied evenly. Mr. Weaver, too, has campaigned for office. In 1990, he ran as an independent against the incumbent mayor of St. Albans. His concession words back then could turn out to be prophetic: “People haven’t seen the last of Jeff Weaver. ”'"}, "time": 1742563314.8684235}