{"duration": 0.07679080963134766, "input_args": {"text": "'RIO DE JANEIRO  —   The expulsions of ticket holders from Olympic sites after they protested Michel Temer, Brazil’s interim president, is fueling a debate over the limits of freedom of expression in a country that remains on edge amid a period of extraordinary political upheaval. Videos, news reports and   accounts that circulated widely in Brazil on Sunday on social media showed the removal of several fans at a women’s soccer match in the city of Belo Horizonte. They had lined up wearing   reading “Out with Temer” while holding aloft letters that read in English, “Come back democracy. ” Juca Kfouri, one of Brazil’s most prominent sports columnists, called the expulsions “repressive stupidity. ” “This will only encourage new demonstrations,” Mr. Kfouri said. The protest in Belo Horizonte, along with others at sites in Rio de Janeiro, pointed to the low approval ratings of Mr. Temer, 75, the career politician who emerged victorious in a power struggle against Dilma Rousseff, who was suspended to face an impeachment trial over claims that she had manipulated the federal budget to conceal economic problems. Ms. Rousseff, like Mr. Temer, is also deeply unpopular. But as she strays from the spotlight, Mr. Temer is receiving greater scrutiny over testimony tying him to illegal campaign financing operations. Executives at the construction giant Odebrecht told investigators that Mr. Temer had requested more than $3 million for his centrist Brazilian Democratic Movement Party. As part of a plea deal they are seeking, the Odebrecht executives said the payment had been made in cash through a unit used to deliver bribes, according to Veja, a newsmagazine. Mr. Temer has already been found guilty of violating campaign finance limits, a conviction that could make him ineligible to run for office for five years. In a statement, Mr. Temer’s media office acknowledged that he had requested the funds from Odebrecht but said they had been legally declared to the electoral authorities. Mr. Temer endured a chorus of boos when he briefly declared the start of the Olympics during the opening ceremony on Friday. Ticket holders appeared at various Olympic events over the weekend with placards reading, “Fora Temer” (Out with Temer.) A video of security personnel forcibly removing a protesting man from the stands of an archery competition provoked outrage among bystanders who witnessed the episode. Brazil’s Justice Ministry said in a statement that the man had been removed because he was “disrupting the concentration of the athletes. ” (Curiously, many Brazilian fans calling attention to themselves for loudly booing during an array of other Olympic competitions have not faced similar treatment from the security forces.) Mario Andrada, a spokesman for the Rio Olympics organizing committee, said in an interview that the Olympic charter included a policy prohibiting political propaganda in venues. “People who violate this requirement will kindly be asked to leave,” Mr. Andrada said. Still, many Brazilians are in no mood to be told where they can protest as the country fumes over colossal graft scandals involving political figures across the ideological spectrum. “Citizens should have the right to express their views in a peaceful way,” said Gabriel do Nascimento Guimarães, 31, an engineering professor. “I’m against removing anyone from a venue who is exercising their right of freedom of expression. ”'"}, "time": 1742562471.1576173}