{"duration": 0.06774449348449707, "input_args": {"text": "'First came the cellphone video of an   man being fatally shot by a Louisiana police officer, and the astonishing live feed of a Minnesota woman narrating the police killing of her   boyfriend during a traffic stop. Then came the horrific live television coverage of police officers being gunned down by a sniper at a march protesting the police shootings. And suddenly, the panoply of fears and resentments that have made this a foreboding summer had been brought into sharp relief. Police accountability and racial bias have been at the center of the civic debate since August 2014, when a black teenager was killed by a white officer in Ferguson, Mo. a suburb of St. Louis. Mass murders in Newtown, Conn. Charleston, S. C. Orlando, Fla. and too many other locales have revived gun violence as a social issue and national shame. Both black anger at police killings and the boiling frustrations of some whites who feel they are ceding their   place in society have been constant undercurrents in politics since January and the Iowa presidential caucuses. Now, in the space of three days, the killings of two black men by Louisiana and Minnesota police officers and the retaliatory murders of five Dallas officers, this time by a black Army veteran, have coalesced all those concerns into a single expression of national angst. In the midst of one of the most consequential presidential campaigns in memory, those convulsive events raised the prospect of still deeper divides in a country already torn by racial and ideological animus. Since the Thursday night sniper attack the national conversation has swung between bitterness and despair over seemingly unbridgeable gulfs in society. The New York Post’s front page blared “CIVIL WAR. ” The Drudge Report warned in a headline that “Black Lives Kill. ” Some Minnesota protesters on Thursday night chanted, “Kill the police. ” Police officers and sociologists alike say that racial tension is approaching a point last seen during the street riots that swept urban American in the late 1960s when disturbances erupted in places like the Los Angeles neighborhood of Watts and Detroit and Newark, during summers of deep discontent. “Even in the 1960s and 1970s, when there was a lot of tension around policing and civil rights and the antiwar movement, we’d never seen anything like what happened in Dallas,” said Darrel W. Stephens, the executive director of the Major Cities Chiefs Association and an instructor at the Public Safety Leadership Program in the School of Education at Johns Hopkins University. Mr. Stephens and other police officials said that departments were increasingly schooling officers in ways to avoid and defuse violent encounters with minorities. But other experts said the parade of cellphone videos depicting shootings of black men have only reinforced  ’ conviction that little has changed in six decades. “There is a constant bombardment of images of brutality against   and not just brutality, but   brutality,” said Paul Butler, a former federal prosecutor and a law professor at Georgetown University Law Center. This week’s videos, he said, were particularly devastating. “It’s visceral,” he said. “It hits you in the gut. It’s emotional and graphic, so it makes you feel worse. ” There are some parallels today to the 1960s. Those riots were largely touched off by violent encounters between blacks and the police. Scholars say and statistics show that attacks on police officers became an increasingly frequent   response to decades of inequality and mistreatment at that time. The Kerner Commission, established by President Lyndon B. Johnson, reported in 1968 that “Our nation is moving toward two societies, one black, one white  —   separate but unequal. ” And a white backlash became a driving force in the presidential campaign that year that saw a   Republican, Richard M. Nixon, end eight years of Democratic rule. Whether this week’s violence presages a repeat of that history is, of course, an unknown, as the nation’s first black president nears the end of two terms in office and the two political parties move toward their national conventions this month. But racial tensions are clearly rising. A June survey by the Pew Research Center found that only 46 percent of whites surveyed thought that race relations were generally good, a sharp drop from the 66 percent who held that opinion in June 2009, shortly after Mr. Obama took office. For blacks, the corresponding decline  —   to 34 percent last month from 59 percent in 2009  —   was even steeper. The same Pew survey found that about   of   thought that blacks in their communities were treated less fairly by the police than were whites a bare 35 percent of whites felt the same. In the hours after the Dallas ambush, stunned officials and civic leaders pleaded for citizens to repair the rips in the nation’s social fabric. “Our profession is hurting,” said the Dallas police chief, David O. Brown, who is  . “Dallas officers are hurting. We are heartbroken. There are no words to describe the atrocity that occurred to our city. All I know is that this must stop, this divisiveness between our police and our citizens. ” The Rev. Bryan Carter echoed him at a Friday memorial service for the fallen officers, saying: “We refuse to hate each other. We commit to pray together. ” President Obama, speaking on Friday from Warsaw, where he was attending a   NATO summit meeting, said of the police, “Today is a wrenching reminder of the sacrifices they make for us. ” He called the attack a “vicious, calculated and despicable attack on law enforcement. ” In a presidential race in which racial and ethnic divisions have become an issue, both Hillary Clinton and Donald J. Trump canceled political events on Friday. Mr. Trump called the events in Texas “an attack on our country. ” “It is a coordinated, premeditated assault on the men and women who keep us safe,” Mr. Trump said in a statement. “We must restore law and order. ” Mrs. Clinton wrote on Twitter on Friday, “I mourn for the officers shot while doing their sacred duty to protect peaceful protesters, for their families and all who serve with them. ” But on social media, there were salutes to the sniper, blame of the news media for dividing the nation, charges that black protesters had spread hysteria, calls for love, fear of civil war and laments that the country is headed toward an unbridgeable divide. Some activists said their movement would press on, demanding that the police be accountable. Aislinn Sol, a Black Lives Matter organizer in Chicago, said, “The disproportionate   violence against   has not changed,” adding, “What we have seen is a change in the response. ” In interviews, a number of police officials said that they believed the only lasting solution to the violence and division was to end the glaring inequalities that fuel them, but that they saw little hope for that. “We’re the most heavily armed violent society in the history of Western civilization and we dump this duty on   ” in police departments, Ed Flynn, the police chief in Milwaukee, said in an interview before Thursday’s killings. “The problem for American policing is we’re learning the hard way that our political establishment finds it far easier to develop a constituency at the expense of our police than to solve these social problems. ” Perhaps it was Attorney General Loretta E. Lynch who captured the day’s mood. “This has been a week of profound grief and heartbreaking loss,” she said on Friday. “After the events of this week, Americans across our country are feeling a sense of helplessness, of uncertainty and of fear. ” “We must reject the easy impulses of bitterness and rancor,” she added, “and embrace the difficult work  —   but the important work, the vital work  —   of finding a path forward together. ”'"}, "time": 1742628587.2209356}