{"duration": 0.14585566520690918, "input_args": {"text": "'GLASGOW  —   Russian athletes, under intense scrutiny after revelations of widespread doping, remain elusive to antidoping authorities, failing to provide updates on their whereabouts and training inside military areas that are inaccessible to   officials, according to the global watchdog for sports doping. “There are still challenges when working within Russia,” Rob Koehler, the deputy director general of the World   Agency, told dozens of government and sports officials on Sunday at the agency’s board meetings here. Mr. Koehler said that recent Russian cyberattacks on WADA made it difficult to trust the country, as did Russia’s refusal to admit to   doping after WADA published an investigative report in July that invoked forensic proof of violations. Russia’s national antidoping agency and laboratory remain decertified as a result of the investigation, and its track and field athletes are still barred from international competition. Mr. Koehler also said that the Russian authorities had locked down the Moscow lab’s storage facilities, hindering global investigators’ progress in analyzing doping samples. “To cross the line is a criminal offense,” Mr. Koehler said of the security perimeter, requesting that it be lifted. Sunday’s meetings focused on the future, not just for Russia but also for the antidoping agency itself, which has faced criticism that it was slow to pursue tips from Russian   for years. With momentum from a coordinated group of national governments that help fund WADA, the agency is now seeking a stronger role in unearthing antidoping violations and imposing discipline in response rather than deferring to sports organizations like the International Olympic Committee, which have financial interests in competitions. “It sounds like a very intriguing spy novel, the things this organization has to deal with recently,” said Edwin Moses, the American Olympic hurdler, who is on the WADA board. Minutes after Mr. Koehler’s report on the continuing obstacles in Russia, President Vladimir V. Putin’s antidoping appointee, Vitaly Smirnov, denied that the government had taken part in the elaborate cheating scheme that was detailed in the WADA report in July, weeks before the Rio de Janeiro Olympics. That report, which prompted WADA to urge the I. O. C. to bar Russia from the Rio Games, said that Russia’s internal intelligence service had helped breach doping controls at the 2014 Sochi Olympics. The report also said that Russia’s deputy sports minister had played a critical role in the effort to cover up doping. Mr. Smirnov, an    former Soviet sports official, said that the deputy sports minister, Yuri D. Nagornykh, had been fired and had never represented the government. “If a certain person is a criminal doesn’t mean the whole country is,” he said. Vitaly Mutko, a former sports minister for Russia who was recently promoted to deputy prime minister, was accused in the WADA report  —   written by the Canadian lawyer Richard McLaren  —   of being complicit in athletic cheating. Mr. Koehler expressed frustration that Mr. Mutko had suggested that the McLaren report was fabricated and that people associated with creating it could be prosecuted. Mr. McLaren has continued his inquiry into which Russian athletes benefited from the state system he detailed in July. The results are expected on Dec. 9, WADA said Sunday. At WADA’s last board meeting, in May, the agency detailed the challenges that   professionals had encountered in collecting doping samples in Russia, including athletes’ smuggling clean urine, offering bribes and climbing out of windows to escape when testers arrived at their doors. The difficulties have continued in recent months, Mr. Koehler said, noting that although there had been no reports of the most brazen behavior, people had been nonetheless uncooperative with the relatively few   officials dispatched to cover the whole country. The number of drug tests conducted in Russia this year amounts to about 10 percent of the usual total. That percentage represents about 1, 660 tests throughout the country, including hundreds of failed attempts to track down athletes at specified locations. Still, WADA’s president, Craig Reedie, called the current situation “a lot better than it was” a few months ago and said that he was eager to restore the country to good standing. “They are the biggest country in the world, a very enthusiastic sporting country,” Reedie said, though some have suggested that breaches such as those that happened at the Winter Games in Sochi, Russia, may warrant further sanctions at the 2018 Winter Olympics. “Not only do they want to take part in competition, but they want to host them. ” It can be expensive and logistically burdensome to host major athletic events, and Russian cities regularly welcome numerous major competitions. The International Bobsleigh and Skeleton Federation is set to hold the sports’ world championships in Sochi early next year. At Sunday’s public meeting and in private meetings in preceding days, officials in Glasgow discussed WADA’s own plans for overhaul, outlining a framework for strengthening the agency’s investigative powers with six employees dedicated to intelligence work. The board approved a policy to protect   as well as a proposal to empower WADA to discipline sports organizations and national delegations of athletes. Günter Younger, WADA’s new investigative chief and a former employee of the German criminal police and Interpol, emphasized that his work would be walled off within WADA and called   the backbone of his operations. “Everyone is picking on Russia,” said Mr. Younger, who in 2015 took part in the first   inquiry into doping there. He said that Russian   had inspired reforms in the first place, adding, “It was Russians who took down this system. ” Mr. Younger said that other informants might be more willing to come forward if they knew WADA could then mete out punishments to doping violators, as it is now seeking to do. “You need power,” Mr. Younger said. “If you’re an advisory body, you come at me with a feather  —   if there’s no punishment, why should I talk to you?” How exactly to assign WADA such authority, and when that authority might take effect, is unclear. It could be achieved through amendments to the global antidoping code, which would be voted on by board members at a future meeting. The I. O. C. is a signatory to that code, and it is unclear if the organization would challenge such a change. Mr. Reedie, whose longstanding ties to the I. O. C. have raised    concerns in the past, was   to the WADA presidency on Sunday in an uncontested vote. Last summer, he told The New York Times that WADA was better suited to give advice than to play an active regulatory role. “We’re not going to turn to people and say, ‘These are the rules obey them,’” he said in June. He said on Sunday that he regretted those words and that his outlook had evolved. “People pretty much thought WADA was a service provider,” he said of the agency’s   history. “I think as this whole business develops, now we may have a little more effective authority. ” Richard W. Pound, the founding president of WADA and a former I. O. C. executive, praised the prospect of WADA growing into a fiercer watchdog. “It’s a unique opportunity to make that step,” he said, “to go from cheerleader to regulator. ”'"}, "time": 1742562029.3466597}