{"duration": 0.04274725914001465, "input_args": {"text": "'The Corruption of the Clinton’s is like an endless dark pit of lies and manipulation. \\nI am so sick of Clinton’s and I can’t believe anyone would vote for her. This FBI that is lying and trying to change documentation should be held to a legal standard and people who have tried to hide documentation and have lied should be thrown in prison for treason! \\nAs far as how the media treats Hillary Clinton, if you’ve noticed, they treat her like a queen. The liberal media likes to pamper, lie, and make sure America knows she is the best option. We, however, know better. So does Jason Chaffetz. \\nFor those of you who do it know who Chaffetz is, he is the House Committee on Oversight and Government Reform Chairman who famously told the guy who destroyed Hillary’s email server that he was served on live TV. Now he just served up a brutal threat to Hillary Clinton and she is running scared. \\nHOUSE COMMITTEE ON OVERSIGHT AND GOVERNMENT REFORM CHAIRMAN JASON CHAFFETZ CONFIRMED IT WILL HOLD ADDITIONAL HEARINGS ON DEMOCRATIC NOMINEE HILLARY CLINTON’S PRIVATE EMAIL SERVER WHEN MEMBERS RETURN FROM RECESS. \\nNEW FBI DOCUMENTS RELEASED MONDAY SHOW UNDERSECRETARY OF STATE PATRICK KENNEDY PUSHING THE FBI TO DECLASSIFY EMAILS IN EXCHANGE FOR A “QUID PRO QUO” DEAL — A MOVE CHAFFETZ AND HOUSE PERMANENT SELECT COMMITTEE ON INTELLIGENCE CHAIRMAN DEVIN NUNES FOUND DEEPLY TROUBLING. \\n“Undoubtedly there will be, based on the documents the FBI released today there are new facts that need to be investigated. I’m very concerned about the quid pro quo that was in negotiation between the State Department and the FBI,” Chaffetz told The Daily Caller News Foundation. “Chairman Nunes and I believe Patrick Kennedy should be relieved of his duties immediately pending an investigation. This is a manipulation if not an outright crime and so we’re gonna drive into that.” \\nWhile the downgrade discussed between the agency officials didn’t come into fruition, the congressmen were clear they believe the proposal was inappropriate.'"}, "time": 1742562292.3348913}