{"duration": 1.825263500213623, "input_args": {"text": "'Sometimes the road to diet change can be fun Ad 728×90 – HBS Account – 2149237058061490 http://blogs.naturalnews.com/sometimes-road-diet-change-can-fun/ \\nBy Hesh Goldstein \\nPosted Friday, October 28, 2016 at 07:36am EDT \\nWhen I was a kid, if I were told that I’d be writing a book about diet and nutrition when I was older, I would’ve thought that whoever told me that was out of their mind. \\nLiving in Newark, New Jersey, my parents and I consumed anything and everything that had a face or a mother except for dead, rotting, pig bodies, although we did eat bacon (as if all the other decomposing flesh bodies were somehow miraculously clean). Going through high school and college it was no different. In fact, my dietary change did not come until I was in my 30’s. \\nJust to put things in perspective, after I graduated from Weequahic High School and before going to Seton Hall University, I had a part-time job working for a butcher. I was the delivery guy and occasionally had to go to the slaughterhouse to pick up products for the store. Needless to say, I had no consciousness nor awareness, as change never came then, despite the horrors I witnessed on an almost daily basis. \\nAfter graduating with a degree in accounting from Seton Hall, I eventually got married and moved to a town called Livingston. Livingston was basically a yuppie community where everyone was judged by the neighborhood they lived in and their income. To say it was a “plastic” community would be an understatement. \\nLivingston and the shallowness finally got to me. I told my wife I was fed up and wanted to move. She made it clear she had to be near her friends and New York City. I finally got my act together and split for Colorado. \\nI was living with a lady in Aspen at the end of 1974, when one day she said, ” let’s become vegetarians”. I have no idea what possessed me to say it, but I said, “okay”! \\nAt that point I went to the freezer and took out about $100 worth of frozen, dead body parts and gave them to a welfare mother who lived behind us. \\nWell, everything was great for about a week or so, and then the chick split with another guy. \\nSo here I was, a vegetarian for a couple weeks, not really knowing what to do, how to cook, or basically how to prepare anything. For about a month, I was getting by on carrot sticks, celery sticks, and yogurt. Fortunately, when I went vegan in 1990, it was a simple and natural progression. Anyway, as I walked around Aspen town, I noticed a little vegetarian restaurant called, “The Little Kitchen”. \\nLet me back up just a little bit. It was April of 1975, the snow was melting and the runoff of Ajax Mountain filled the streets full of knee-deep mud. Now, Aspen was great to ski in, but was a bummer to walk in when the snow was melting. \\nI was ready to call it quits and I needed a warmer place. I’ll elaborate on that in a minute. \\nBut right now, back to “The Little Kitchen”. Knowing that I was going to leave Aspen and basically a new vegetarian, I needed help. So, I cruised into the restaurant and told them my plight and asked them if they would teach me how to cook. I told them in return I would wash dishes and empty their trash. They then asked me what I did for a living and I told them I was an accountant. \\nThe owner said to me, “Let’s make a deal. You do our tax return and we’ll feed you as well”. So for the next couple of weeks I was doing their tax return, washing their dishes, emptying the trash, eating three squares a day and learning as much as I could. \\nBut, like I said, the mud was getting to me. So I picked up a travel book written by a guy named Foder. The name of the book was, “Hawaii”. Looking through the book I noticed that in Lahaina, on Maui, there was a little vegetarian restaurant called,” Mr. Natural’s”. I decided right then and there that I would go to Lahaina and work at “Mr. Natural’s.” To make a long story short, that’s exactly what happened. \\nSo, I’m working at “Mr. Natural’s” and learning everything I can about my new dietary lifestyle – it was great. Every afternoon we would close for lunch at about 1 PM and go to the Sheraton Hotel in Ka’anapali and play volleyball, while somebody stayed behind to prepare dinner. \\nSince I was the new guy, and didn’t really know how to cook, I never thought that I would be asked to stay behind to cook dinner. Well, one afternoon, that’s exactly what happened; it was my turn. That posed a problem for me because I was at the point where I finally knew how to boil water. \\nI was desperate, clueless and basically up the creek without a paddle. Fortunately, there was a friend of mine sitting in the gazebo at the restaurant and I asked him if he knew how to cook. He said the only thing he knew how to cook was enchiladas. He said that his enchiladas were bean-less and dairy-less. I told him that I had no idea what an enchilada was or what he was talking about, but I needed him to show me because it was my turn to do the evening meal. \\nWell, the guys came back from playing volleyball and I’m asked what was for dinner. I told them enchiladas; the owner wasn’t thrilled. I told him that mine were bean-less and dairy-less. When he tried the enchilada he said it was incredible. Being the humble guy that I was, I smiled and said, “You expected anything less”? It apparently was so good that it was the only item on the menu that we served twice a week. In fact, after about a week, we were selling five dozen every night we had them on the menu and people would walk around Lahaina broadcasting, ‘enchilada’s at “Natural’s” tonight’. I never had to cook anything else. \\nA year later the restaurant closed, and somehow I gravitated to a little health food store in Wailuku. I never told anyone I was an accountant and basically relegated myself to being the truck driver. \\nThe guys who were running the health food store had friends in similar businesses and farms on many of the islands. I told them that if they could organize and form one company they could probably lock in the State. That’s when they found out I was an accountant and “Down to Earth” was born. “Down to Earth” became the largest natural food store chain in the islands, and I was their Chief Financial Officer and co-manager of their biggest store for 13 years. \\nIn 1981, I started to do a weekly radio show to try and expose people to a vegetarian diet and get them away from killing innocent creatures. I still do that show today. I pay for my own airtime and have no sponsors to not compromise my honesty. One bit of a hassle was the fact that I was forced to get a Masters Degree in Nutrition to shut up all the MD’s that would call in asking for my credentials. \\nMy doing this radio show enabled me, through endless research, to see the corruption that existed within the big food industries, the big pharmaceutical companies, the biotech industries and the government agencies. \\nThis information, unconscionable as it is, enabled me to realize how broken our health system is. \\nI left Down to Earth in 1989, got nationally certified as a sports injury massage therapist and started traveling the world with a bunch of guys that were making a martial arts movie. After doing that for about four years I finally made it back to Honolulu and got a job as a massage therapist at the Honolulu Club, one of Hawaii’s premier fitness clubs. \\nIt was there I met the love of my life who I have been with since 1998. She made me an offer I couldn’t refuse. She said,” If you want to be with me you’ve got to stop working on naked women”. So, I went back into accounting and was the Chief Financial Officer of a large construction company for many years. \\nGoing back to my Newark days when I was an infant, I had no idea what a “chicken” or “egg” or “fish” or “pig” or “cow” was. My dietary blueprint was thrust upon me by my parents as theirs was thrust upon them by their parents. It was by the grace of God that I was able to put things in their proper perspective and improve my health and elevate my consciousness. \\nThe road that I started walking down in 1975 has finally led me to the point of writing my book, A Sane Diet For An Insane World. Hopefully, the information contained therein will be enlightening, motivating, and inspiring to encourage you to make different choices. \\nDoing what we do out of conditioning is not always the best course to follow. I am hoping that by the grace of the many friends and personalities I have encountered along my path, you will have a better perspective of what road is the best road for you to travel on, not only for your health but your consciousness as well. \\nAloha! \\nTo learn more about Hesh, listen to and read hundreds of health related radio shows and articles, and learn about how to stay healthy and reverse degenerative diseases through the use of organic sulfur crystals and the most incredible bee pollen ever, please visit www.healthtalkhawaii.com, or email me at heshgoldstein@gmail.com or call me at (808) 258-1177. Since going on the radio in 1981 these are the only products I began to sell because they work. Oh yeah, going to www.asanediet.com will allow you to read various parts of my book – “A Sane Diet For An Insane World”, containing a wonderful comment by Mike Adams. In Hawaii, the TV stations interview local authors about the books they write and the newspapers all do book reviews. Not one would touch “A Sane Diet For An Insane World”. Why? Because it goes against their advertising dollars. You might also like…'"}, "time": 1742563151.8101878}