{"duration": 0.025394678115844727, "input_args": {"text": "'Comments \\nRepublican nominee Donald Trump has been strategically placing certain people behind his him at rallies to create a false illusion about the diversity of his supporters. You may have noticed a man holding a “BLACKS FOR TRUMP” sign behind the racist rabble-rouser at his events, with a website URL “GODS2.com” underneath it. If you’ve wondered just what kind of black Americans could bring themselves to support Trump or if this election could get any weirder, well, hold on to your seat. \\nThe man holding the sign is “Michael the Black Man,” also known as Maurice Woodside or Michael Symonette. LittleGreenFootballs did some research and discovered that Michael isn’t your ordinary concerned citizen. He’s a former member of a murderous cult , Yahweh ben Yahweh, led by preacher Hulon Mitchell Jr. \\nMichael, along with 15 other Yahweh followers, was charged for allegedly conspiring in two murders; his brother, who was also in the cult, told jurors that Michael had helped beat one man who was later killed and stuck a sharpened stick into another man’s eyeball. But jurors found Michael (and six other Yahweh followers) innocent. They sent Mitchell away for 20 years in the federal pen. \\nMichael later reinvented himself as a radio host and an anti-gay, anti-Obama preacher and soon found himself in the spotlight at Republican events, whose organizers were delighted to have found another person of color to attack Obama without being obviously racist. His website, GODS2.com, is filled with the delusional, vaguely anti-Semitic rantings of a madman and homages to Yahweh. \\nThis may not mean much in the long run, but it’s worth pointing out just how outrageous the hypocrisy of the Trump campaign is. Trump attacked Democratic nominee Hillary Clinton when the father of the Orlando nightclub shooter appeared in the stands behind her at a rally out of chance, accusing her of associating with the father of a deranged murderer – but this man is actually being planted behind Trump because of his skin color. Related Items:'"}, "time": 1742561691.8211737}