{"duration": 0.04961276054382324, "input_args": {"text": "'Neil Gorsuch was confirmed to the Supreme Court on April 7 and this week will take part in deciding whether he and his fellow justices will hear the United States Courts of Appeals for the Ninth Circuit’s ruling which upheld California’s “good cause” requirement for concealed carry. [On February 13, 2014, a   panel of the Ninth Circuit ruled that the “good cause” requirement violated the Second Amendment. Judge Diarmuid O’Scannlain wrote the majority opinion for the 2014 decision and The San Francisco Chronicle quoted from that opinion, saying, “The right to bear arms includes the right to carry an operable arm outside the home for the lawful purpose of  . ”  On June 9, 2016, the Ninth Circuit reversed itself and ruled in favor of California’s “good cause” requirement by stating that Americans have no right to carry a concealed handgun outside of their home for  . Lacking such a right, the court found it acceptable that Californians demonstrate a “good cause” or good reason for needing a gun with them for protection. The Chicago Tribune reports that Gorsuch will be part of the process by which SCOTUS will decide whether to hear the Ninth Circuit’s rejection of Americans’ right to carry a concealed handgun outside the home for  . Gorsuch will participate in the decision which will be made in “private conference with his new colleagues Thursday. ” Throughout his Senate confirmation hearings, Gorsuch stressed his adherence to the SCOTUS’ ruling in District of Columbia v. Heller (2008). That ruling reaffirmed Americans’ natural, individual right to keep and bear arms. At question in the Ninth Circuit’s 2016 decision is the scope of that right and whether one natural right —  in this case, the right to bear arms —  can be limited without also limiting rights to speech, religion, and security in one’s person, among other rights. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742561822.2526684}