{"duration": 0.0548708438873291, "input_args": {"text": "'Monday in California at the Stanford Graduate School of Business, former Obama White House chief of staff and current Chicago Mayor Rahm Emanuel said Democrats needed to “take a chill pill” and prepare for a   build up of the party.  Emanuel said, “2016, now Democrats are in the lowest level since 1928 in the House of Representatives and the lowest level since 1925 in the state houses. Not really good. ” adding,”It is hard to image it getting lower. ” He explained “You got to go out and create a farm team. In ’06 and ’08 everybody goes, ‘Oh that’s when we took back the House.’ You know I got a lot of crap for recruiting Iraq War vets, football players, sheriffs, business people. I said well they are running in Republican districts. I wanted to take cultural issues off the table and I wanted to present economic issues. We as Democrats like to walk around ideally  —    No you got to be ruthless enough. We recruited people who matched the district. If you’re running in a Republican district, you got to get at somebody who can win in a Republican district. Winning is everything. You don’t win, you can’t make the public policy. I say that because it is hard for people in our party to accept that principle. Sometimes you just got to win. Okay? Our party likes to be right even if they lose. ” He continued, “Democrats love doing a fire squad in a circle. Stop that. Don’t attack, they are too moderate. Forget about it. Stop it. This guy and these people are about to do something on the tax code, the regulatory environment and things that are more threatening than what a fellow Democrat might slightly disagree with you on. Stop it. We’re not strong enough to do that. ” He added, “It took us a long time to get this low. It ain’t gonna happen in 2018. Take a chill pill, man. You gotta be in this for the long haul. And if you think it’s going to be a quick turn around like that, it’s not. ” (  The Hill) Follow Pam Key On Twitter @pamkeyNEN'"}, "time": 1742561933.387972}