{"duration": 0.07631826400756836, "input_args": {"text": "'RT \\nNorth Dakota, which ranks second in the US in terms of oil production, endured almost 300 oil spills in under two years and yet managed to avoid reporting a single one of them to the public, according to a new report. \\nDocuments viewed by the Associated Press indicate that, since January 2012, as many as 750 “ oil field incidents ” were recorded in North Dakota. The distinction between spills and incidents was not immediately clear but presumably was related to the magnitude of the accident. \\nNorth Dakota, which borders Canada and has an estimated population of under 700,000 people, is like many other states heavily involved in oil production in that it is not required by law to inform the public about oil spills. Yet with the potentially devastating consequences a spill could have in a state that relies on farming and water resources, citizens have begun lobbying for greater access to information. \\nDennis Fewless, director of water quality for the state Health Department, told the AP lawmakers and regulators in North Dakota are also reconsidering the current state of affairs after a wheat farmer stumbled across a major oil spill last month. That incident was not made public knowledge until 11 days later, when reporters asked. Questions have also been raised as to whether the relationship between the pipeline’s operator, Tesoro Logistics, with regulators is too close for comfort. \\n“ We’re certainly looking at that now and what would be a threshold for reporting to the public ,” he said. One option he said regulators are considering is a method to better track the spills that occur. Officials “ really have to dig through our database to get specifics ,” he said of the current situation. \\nNorth Dakota pumps out millions of barrels of oil every day and installed nearly 2,500 miles of new transport pipelines in 2012. There is now enough pipeline, a total of about 17,500 miles, in North Dakota to travel the distance from Los Angeles, California to New York City. The state ranks behind only Texas as the most productive, yet farmers are still unaware that the land they till every season could be tainted. \\n“ What you don’t know, nobody is going to tell you ,” Louis Kuster, a wheat farmer located near the north-western city of Stanley, said. Kuster explained how, earlier this month, he watched as truckloads of oily dirt were driven away from a nearby farm. \\n“ We have no idea how big the spill is and why it happened ,” he said, speculating it may have been from a broken pipeline although no one can be quite sure. “ I’d try to get more information from the state but I’m too busy getting my harvest in .” \\nIn 2013 alone there have already been 291 so-called “incidents.” Of the roughly 2,209 barrels that were lost, all but 490 were contained and cleaned up at the well site. Most of the spills that companies reported to the state totaled less than 10 barrels. \\nNearly 500 barrels of oil spilled in 2012, the result of 153 pipeline leaks. \\n“ That’s news to us ,” said Don Morrison, director of the environmentally-minded Dakota Resource Council. “ The public really should know about these. If there is a spill, sometimes a landowner may not even know about it. And if they do, people think it’s an isolated incident that’s only happening to them .”'"}, "time": 1742564305.3686152}