{"duration": 0.05334043502807617, "input_args": {"text": "'Update: Banks apologized for forgetting about Spielberg’s film The Color Purple during her speech, in a statement posted to her Twitter account Thursday. [“When I made the comments, I was thinking of recent films Steven directed, it was not my intention to dismiss the import of the iconic #TheColorPurple,” she wrote.  pic. twitter.   —   Elizabeth Banks (@ElizabethBanks) June 15, 2017,  “Those who have the privilege and honor of directing and producing films should be held to account for our mistakes, whether it’s about diversity or inaccurate statements. I’m very sorry,” she added. Original story below:   Elizabeth Banks “called out” legendary director Steven Spielberg in a speech at the Women in Film awards ceremony at the Beverly Hilton Hotel Wednesday, accusing Spielberg of never having cast a woman as a lead in a film in his   career. In an acceptance speech, Banks  —   who directed and starred in the 2015 sequel to the cult hit Pitch Perfect  —    reportedly discussed the lack of female representation in Hollywood and specifically   the        according to the Wrap. “I went to Indiana Jones and Jaws and every movie Steven Spielberg ever made, and by the way, he’s never made a movie with a female lead,” Banks charged. “Sorry, Steven. I don’t mean to call your ass out but it’s true. ” While most of Spielberg’s films do appear to revolve around male leads, at least three have featured lead roles for women his first film, 1974’s The Sugarland Express, which starred Goldie Hawn 1985’s The Color Purple, which starred Oprah Winfrey and Whoopi Goldberg and last year’s The BFG, which starred child actor Ruby Barnhill. An upcoming film about the Pentagon Papers is set to star Meryl Streep as Washington Post publisher Kay Graham. Spielberg has also produced several titles with leading roles for women, including 2009’s The Lovely Bones, starring Rachel Weisz, and 2005’s Memoirs of a Geisha. The Wrap reported that an audience member pointed out The Color Purple to Banks, but she moved on in her speech. Banks  —   who is set to direct an upcoming reboot of Charlie’s Angels  —   was feted at the Women in Film event by former Democratic presidential candidate Hillary Clinton, for whom she had campaign during the 2016 race. Clinton told the audience that she had not yet seen the superhero film Wonder Woman, but predicted she would enjoy it. “Something tells me that a movie about a strong, powerful woman fighting to save the world from a massive international disaster is right up my alley,” Clinton said.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562140.5694406}