{"duration": 0.08657169342041016, "input_args": {"text": "'500 rape threats in 4 days: Female MPs face constant abuse –... 500 rape threats in 4 days: Female MPs face constant abuse – report By 0 41 \\nDeath threats and sexual harassment against female politicians are rife and eating away at democracy, according to a new international study of women MPs. \\nA series of interviews with female MPs by the Inter-Parliamentary Union (IPU) reveals that more than 40 percent had suffered death and rape threats, as well as intimations of physical violence or abduction, while serving in office. \\nRead more \\nMost abuse took place online and often included threats to their children also. \\nOne European MP claims to have received “more than 500 threats of rape on Twitter” over a mere four days. \\nIPU Secretary General Martin Chungong admitted the survey was small but representative. \\n“It makes clear that the problem is much more widespread and under-reported than we realize,” he said. \\n“The parliamentary community must speak out against sexism and harassment and make clear that it cannot be tolerated as the price to be paid for women’s political involvement.” \\nIn May, British politicians launched the ‘Reclaim the Internet’ campaign to challenge online abuse. \\nThe scheme came after Labour MP Jess Phillips claimed she once received 5,000 Twitter notifications with users debating whether or not they would sexually assault her. There were more than 600 direct rape threats, she said. \\nHampstead and Kilburn MP, Tulip Siddiq, said she too received regular online abuse including threats on her life. \\nOne-time Labour leadership hopeful Angela Eagle was the target of homophobic abuse after challenging Jeremy Corbyn earlier this year. Her Wallasey constituency office was also vandalized when someone threw a brick through a window. \\nFormer Prime Minister David Cameron was once accused of sexist behavior towards Eagle after he told her to “calm down, dear” during a Commons debate. \\n“If a woman speaks loudly in parliament, she is ‘shushed’ with a finger to the mouth. That never happens when a man speaks loudly,” a European parliamentarian interviewed by the IPU said. \\nRead more \\nThe IPU study also showed that more than one in five of all politicians quizzed has experienced sexual violence during their term, and one in three had witnessed attacks on colleagues in parliament. \\nAlmost 80 percent said they had been psychologically abused, causing them to suffer panic attacks or permanent trauma. \\nAccording to the IPU report, female politicians “said they must constantly deal with old-school thinking about their appearance, how they express themselves and behave, and the role they should play.” \\n“More generally, their excessively or insufficiently feminine demeanour is a subject of regular and widespread comment, attacks and derision. The same is true of their conjugal status, emotional, sexual and family life, imagined or real,” it added. \\nDespite this, the majority of women surveyed said the abuse would not stop them from running for another term in office. \\n“Parliaments need to put their own house in order if they want to lead by example and stop discrimination and violence against women in all walks of life,” said Chungong. \\n“The effectiveness of parliaments, progress toward equality between men and women and the vitality of democracy itself all depend on it. \\n“The parliamentary community must speak out against sexism and harassment, and make clear that it cannot be tolerated as the price to be paid for women’s political involvement.” \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742563963.297214}