{"duration": 0.06343555450439453, "input_args": {"text": "'by Alliance for Natural Health – USA \\nThey’re dangerous, even deadly, but hugely profitable. Big Pharma has bought politicians and doctors. Only the American public can stop it by refusing the product. Action Alert! \\nMost people are understandably afraid to say no. They don’t know enough about medicine. We understand. We aren’t doctors and never offer medical advice. But the Internet has put most medical research at your doorstep, including information about drug side effects and risks. And there are integrative doctors who can offer sound advice on the subject. \\nAre we as a society addicted to legal drugs? Are we also wasting huge amounts of money on substances that all too often offer more harm than benefit? Let’s consider these numbers: 60% of Americans take one or more prescription drugs. 15% of Americans take five or more prescription drugs. Some, many more. There are no studies on the interaction of all these drugs. 10% of Americans take an antidepressant medication; for women in their 40s and 50s, it’s 25%. 25% of Americans over the age of 45 take a statin drug, despite much evidence of harm , including promoting diabetes. Doctors write about 6 million prescriptions for proton-pump inhibitors (a class of acid blocking drugs) each year, making these drugs the third highest selling class of drugs on the market. This is happening although logic and evidence suggest that most people, especially older people, suffer from too little stomach acid , not too much. \\nStatins and acid blockers only begin to describe the problems. \\nA recent study found that elderly patients were able to reduce their risk of death by 38%. How? By “ de-prescribing ”—reducing the number of prescription drugs they were taking. \\nProperly prescribed prescription drugs are the fourth leading cause of death in the country; they cause an estimated 1.9 million hospitalizations a year and 128,000 deaths. Another 840,000 hospitalized patients are given drugs that cause serious adverse reactions. These are just hospital numbers. And even in hospitals, there is reason to believe that most of the injury from drugs is hard to isolate and therefore not reported. \\nEven if a drug does not kill or hospitalize us, there can still be serious side effects. One study found that adverse drug effects reported to the FDA more than doubled in the last decade—and these figures are based on voluntary reports. Some researchers estimate that fewer than 10% of adverse events are actually reported . \\nAnother risk to taking prescription drugs: they often deplete the body of nutrients. This is a serious issue. Last week , we reported that the US Department of Agriculture estimates that 90% of the American public is deficient in at least one nutrient; it is common to be severely deficient in many. Magnesium is an essential co-factor with more than 300 different enzymes regulating different processes throughout the body. If magnesium is scarce, it may be routed to the heart, where it is especially needed, and other parts of the body suffer over time. Or it may even be inadequate in the heart. \\nAnother example is vitamin D. A number of drugs can interfere with the body’s absorption of vitamin D, including antacids, anticonvulsants, antiretrovirals (AIDS drugs), and some antibiotics. A meta-analysis found that those with what conventional medicine considers low vitamin D in the blood and integrative doctors consider very low (lower than 30 ng/ml) were twice as likely to die prematurely from all causes. As much as two-thirds of the US population may be below that level (David Williams, Alternatives Newsletter , September 2014). \\nThe list goes on. COX-2 inhibitor drugs, which include some non-steroidal anti-inflammatory (NSAID) drugs (ibuprofen, aspirin), reduce vitamin B6 levels in the body. This is in addition to the risk they present for internal bleeding and other medical complications. For further information, Dr. Julian Whitaker has a helpful reference chart explaining which drugs deplete the body of which nutrients. \\nThe irony is that many doctors prescribing multiple drugs to their patients will advise them NOT to take a vitamin or mineral supplement while on the drug, when in fact the need for supplements is increased. \\nThere are more reasons to wonder about these drugs. Unlike natural treatments, which give your body the nutrients it needs to heal itself, they directly interfere and force biological outcomes. This is bound to produce unintended consequences. \\nIn addition, virtually all drugs are chlorine-based, but little or no research has explored whether this in itself is a risk. While a tiny amount of chlorine is natural to the body, higher amounts are toxic. The effects of ingesting, breathing and absorbing this chemical on a daily basis, as Americans do, are largely unknown. \\nKeep in mind also that 80% of the prescription drugs consumed in the US come from China or India . While drugs made overseas must theoretically meet US standards, in reality, widespread quality issues abound. \\nThink of the irony here. The prescription pill that costs a few pennies to make but sells for hundreds of dollars is made in China to save another penny. Does this make sense? \\nBecause the FDA was so deficient in inspecting foreign drug manufacturers, a law was passed in 2012 that requires the agency to inspect foreign pharmaceutical manufacturing facilities as frequently as domestic facilities. But the numbers don’t add up. India and China each have about 500 drug manufacturing plants registered with the FDA. The FDA has nineteen staff members in India, and is working on increasing the number of inspectors in China from eight to twenty-seven. \\nA report by the Health and Human Services’ Office of the Inspector General (OIG) found that the agency was not able to meet the legal requirements. Before the 2012 law was passed, the Government Accountability Office found that the FDA inspected 11% of foreign drug facilities in FY 2009, noting that at such a rate, it would take the agency more than nine years to inspect these facilities just once. And who are the inspectors? How do we know that they have not been bought off? \\nMeanwhile the same FDA that is utterly failing to meet the inspection requirements demanded by law has issued proposed rules on new supplements which cannot possibly be implemented without huge additions to staff, and which will also cripple and even destroy the supplement industry. Why is it doing this? The only reason we can think of is that the FDA is so beholden to the drug industry it is supposed to regulate, but which is actually providing much of its funding. \\nAction Alert! Write to Congress and the FDA, urging them NOT to move forward with the NDI guidance Please send your message immediately. \\nRead the full article at ANH-USA.org. Published on November 17, 2016'"}, "time": 1742628492.4119084}