{"duration": 0.031703948974609375, "input_args": {"text": "'A Mexican priest who has performed more than 6, 000 exorcisms in his   career says that he does not fear the devil, because the devil is afraid of him. [In a recent interview, exorcist Father Francisco López Sedano insisted that the devil exists and that he is not a mere personification of evil but an actual being. “Jesus often confronted Satan himself and spoke with him,” he said. “You do not talk with a thing, you talk to a person. ”  The priest, who normally treats three to five cases a day, says that he has personally spoken with the devil on many occasions. “Who are you to expel me?” Satan has challenged him. “And I answer: ‘I am nobody, but I come from Christ, your God and Lord and you leave right now, I command you in the name of Him to go away!” he said. Lopez Sedano said that Linda Blair’s portrayal of a possessed person in The Exorcist film is not so far from reality. “When the devil is present, anything can happen,” he asserts. One particularly memorable case was that of a boy in his late teens who “pushed five enormous, extremely heavy benches that not even 10 people could have moved. He had a tremendous strength,” he said. Possessed people “can climb walls, yes, and even fly,” he said. Lopez Sedano says he became an exorcist not by personal inclination but “out of necessity,” after witnessing some very serious and painful cases of demonic possession. “Before, I did not think the devil could act so aggressively. It seemed fanciful, not realistic. ” A fellow priest also told Father Lopez that fighting the Evil One was an obligation. “You have to get into this by the Lord’s command,” he said. The Word of God carries three mandates from Jesus, the priest added, “to preach the word of God, heal the sick and cast out demons. ” All three of these are still in force in the church, he said, but many priests do not dare to engage the devil because “they are afraid of him. ” Others, he said, simply do not believe in the devil. The priest said that he has had cases in which people have gone to their pastor with their problems, but he has responded: “You are imagining things, that doesn’t exist. ” And the person leaves without knowing what to do, “because at night ‘someone’ bothers him, hits him, throws him out of bed, throws him against the wall,” he said. Demonic possession manifests itself in many ways, Father Lopez says. “A person possessed by demons may start screaming, barking like a dog, shrieking or writhing on the ground like a snake. There are a thousand ways,” he said. The priest claims that he is not afraid because God protects him. “If he didn’t, nobody would get into this work,” he said. “The devil is afraid of me. ” What the devil looks for is “to turn us away from God,” the priest said. “He wants to make us lazy, tire us out, fill us with distrust, make us despair and hate. Everything negative,” he said. What he really likes is “to separate us from God, frighten us, threaten us, and keep us trembling,” he said. Lopez Sedano said that the devil often enters people because they let him in, because they play around with occult practices. “People let the devil in. He would not mess with us if we did not open doors for him,” he said. “That is why God forbids practicing magic, superstition, witchcraft, sorcery, divination, consultation of the dead and spirits and astrology. ” Those are the lands of “lying and deceit,” he said. According to the priest, consulting horoscopes is ridiculous, but can also be dangerous. Thinking that the stars influence our lives is “the biggest lie,” Lopez said. “They’re a million miles away! They are bodies made up of metals and gases, how are they going to influence us?” “The same goes for magic, which is to attribute to things a power they do not have,” the priest said. “Carrying around a horseshoe because it’s going to give me good luck is a lie,” he said. Despite the grim reality of the devil, Lopez Sedano says he keeps a positive attitude toward life. “My hope is confirmed because on the cross Christ already triumphed,” he said. “He won the absolute war,” he said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742628609.3043602}