{"duration": 0.07962346076965332, "input_args": {"text": "'Facebook’s Building 8 “moon shot” division is developing a direct    interface, allowing users to type words with their mind. [Scientific American reports that Facebook is working on a device that would allow users to type words using a   interface (BCI). The device would reportedly be strapped to a user’s head and decode words thought by the user, with those words then typed on a computer or smartphone at speeds of up to 100 words per minute.  The device aims to use light waves to accurately read brain waves, a challenging feat, as current BCI’s must by surgically implanted into the user’s brain to function and can only translate neural impulses into simple actions. Users with these types of BCI’s can answer yes or no questions and click a mouse cursor but at slower speeds than what Facebook hopes to achieve. Facebook’s BCI would use optical fibers to direct photons from a laser source through a person’s skull and into the cerebral cortex, focusing on the areas of the brain responsible for speech. Regina Dugan, head of Facebook’s Building 8 and former executive at DARPA, explained the BCI would “sample groups of neurons [in the brain’s speech center] and analyze the instantaneous changes in optical properties as they fire. ” Facebook’s BCI “would measure the number and type of photons that are bounced off the neurons” in the brain’s cortex, sending that information to a computer that would use   software to translate the information into readable text. Mark Chevillet, Building 8’s technical lead on the project, said, “In this system we’re looking to decode neural signals from the stage just before you actually articulate what you want to say. ” Adam Gazzaley, founder and executive director of U. C. San Francisco’s Neuroscape translational neuroscience center, says that regardless of whether or not Facebook succeeds in the development of their BCI, their research could prove invaluable to science in the future. “We have increasing struggles to squeeze money out of the National Institutes of Health, especially to do     projects like what Facebook is describing,” said Gazzaley. “It’s a great sign and should be encouraged and applauded if large companies in the consumer space are taking such serious efforts to be innovative in neuroscience. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742562148.9094079}