{"duration": 0.12134051322937012, "input_args": {"text": "'Since even before the presidential primaries began, the idea of a Donald Trump presidency made some celebrities threaten they would leave the country if it happened. Here are 18 celebrities who pledged to flee the United States and live in exile in the event of a Trump win. Let’s make them to stick to it! \\nVia Yournewswire 1. Barbra Streisand \\n\\n“I can’t believe it. I’m either coming to your country if you’ll let me in, or Canada,” the singer told 60 Minutes in an interview in August. Streisand has been a vocal supporter of Clinton’s candidacy, and appeared at a high-profile fundraiser for the candidate in New York City earlier this year.\\n2. Bryan Cranston \\n\\n“I would definitely move. It’s not real to me that that would happen. I hope to God it won’t,” Cranston said in October of the possibility of a Trump victory. The Breaking Bad star suggested he would take a permanent vacation to Vancouver.\\n3. Miley Cyrus \\n\\nThe young pop star said she would “move out da country” if Trump, whom she called a “ f*cking nightmare ” were to win the election.\\n“My heart is broken into a 1 pieces…I am moving if this is my president! I don’t say things I don’t mean!” she wrote in an Instagram post.\\n4. Lena Dunham \\n\\nThe Girls star said there is a “ 100 percent chance ” she will pick up and move to Canada if Trump prevails on Election Day.\\n“I love Canada. I think that it’s a great place, and there’s an area in Vancouver that I find beautiful and appealing, and I can conduct business from there,” the actress and Clinton surrogate said.\\n5. Amy Schumer \\n\\nThe comedian and Trainwreck actress said Spain would be her destination of choice if Trump wins the presidency.\\n“My act will change because I will need to learn to speak Spanish,” Schumer said in an appearance on the BBC’s Newsnight in September. “Because I will move to Spain or somewhere. It’s beyond my comprehension if Trump won. It’s just too crazy.”\\n6. Jon Stewart \\n\\nThe former Daily Show funnyman may want to connect with billionaire space pioneer Elon Musk if Trump wins; he told People magazine last year that he would consider “getting in a rocket and going to another planet, because clearly this planet’s gone bonkers.”\\n7. Cher \\n\\nThe same goes for pop icon Cher, who wrote on Twitter that she would be moving to Jupiter if Trump wins. The “Believe” singer has appeared with Hillary Clinton at campaign events this year.\\n8. Chelsea Handler \\n\\nThe comedian and talk-show host said she had already made a contingency plan in the event of a Trump win.\\n“I did buy a house in another country just in case,” Handler said in an interview on ABC’s Live with Kelly and Michael in May. “So all these people that threaten to leave the country and then don’t — I actually will leave that country.”\\n9. Samuel L. Jackson \\n\\n“If that motherf*cker becomes president, I’m moving my black ass to South Africa,” he later told Jimmy Kimmel.\\n10. Whoopi Goldberg \\n\\nThe comedian and The View co-host has repeatedly trashed Trump on the ABC daytime talk show.\\n“Listen, he can be whatever party he wants to be,” she said during an episode in January. “What he can’t be is he can’t be the guy that says it’s your fault stuff isn’t working. That’s not the president I want. Find a way to make stuff work.”\\n“Maybe it’s time for me to move, you know. I can afford to go,” she added.\\n11. Neve Campbell \\n\\nThe Scream and House of Cards actress said she would move back to her native Canada if Trump wins the election.\\n“They see someone off the cuff and broad, and they think ‘ok, that’s the voice we need, just someone honest,’” Campbell told the Huffington Post of the motivation behind the Republican candidate’s support. “But his honesty is terrifying.”\\n12. Keegan-Michael Key \\n\\nThe Key and Peele star also said he’d flee north to Canada in the event of a Trump presidency.\\n“It’s like, 10 minutes from Detroit,” the comedian told TMZ in January. “That’s where I’m from; my mom lives there. It’d make her happy too.”\\n13. George Lopez \\n\\n“If he wins, he won’t have to worry about immigration. We’ll all go back,” the Latino comedian and TV star told TMZ shortly after Trump announced his candidacy in 2015.\\n14. Ne-Yo \\n\\nThe R&B singer said he’d be moving to Canada “straight away” if Trump wins.\\n“Me and Drake gonna be neighbors if Donald Trump becomes president,” the singer told TMZ in October.\\n15. Rev. Al Sharpton \\n\\nThe civil rights activist told attendees at a Center for American Progress event in February that he would be looking for flight reservations if Clinton did not triumph on Election Day.\\n“I’m also reserving my ticket to get out of here if he wins. Only because he’d probably have me deported anyhow,” Sharpton said.\\n16. Raven Symoné \\n\\nThe former View co-host and Disney Channel star is probably already on a flight out. During a February episode of the talk show, the actress said she would move to Canada “if any Republican gets nominated.”\\n17. Amber Rose \\n\\nWhere would she move? Unspecified.\\n“I can’t even think about it! I’m moving, I’m out! I can’t. And I am taking my son with me!” she told US Weekly.\\n18. Ruth Bader Ginsburg \\n\\nThe Supreme Court Justice claimed she will move to New Zealand.\\n“I can’t imagine what the country would be with Donald Trump as our president… Now it’s time for us to move to New Zealand,” she told The New York Times.\\n'"}, "time": 1742562552.825975}