{"duration": 0.033318519592285156, "input_args": {"text": "'ITALY: African Muslim illegal alien freeloaders are demanding to have designer clothes and better food African MUSLIM illegal migrants who took the streets in protest and blocked traffic in Venice this week are now demanding real designer clothes (Armani and Hugo Boss), no knockoffs, and say they don’t like having to eat so much pasta in their meals. Breitbart (h/t Emma) Lorenzo Chinalleto, whose cooperative hosts migrants at the Hotel Byron in the Venice province, said migrants respond with displeasure when receiving clothes from Catholic charity Caritas and other charitable bodies, because the goods are unbranded. He explained: “Unfortunately they come to Italy with the asylum reception systems of northern Europe as a model. When they arrived we gave them clothes, standard clothes. “But they want brand-name clothes like Armani and Boss, and they asked for Pirelli shoes. These are their models. When they came to us, they didn’t have clothes, but they all had smartphones,” the Italian added . Forty of the migrants hosted at the Hotel Byron took to the streets to express their dissatisfaction, blocking the traffic. In a video (below) taken outside the hotel on Monday protesters can be seen shouting, in English, that they don’t want to eat pasta. The migrants originate mostly from Senegal, Nigeria, Somalia, Mali and Ghana, Il Gazzettino reported . Migrants frequently hit the headlines in Italy protesting their living conditions in the country, which has recently been hit hard by several earthquakes. In May a group of “unaccompanied minors” launched a violent protest in order to be transferred from Fondachelli Fantina, complaining that there were “too few entertainment possibilities” in the town. After they had completely destroyed the reception centre to the point where it cannot be used again, the Interior Ministry transferred the migrants to a luxury hotel. In June migrants staying in a small town in Sardinia protested for several days demanding better meals, a television set in every room, and a daily coach to take them to the island’s capital, Cagliari. Tensions in the town ran high as the migrants brandished sticks and smashed property. Regional director of the populist Sardinian Action Party, Marcello Orrù, commented on the controversy. He said: “It is intolerable for us to continue to accept these people who don’t like the welcome offered, the meals and their lodgings at the hotel for free. And who then protest to have a television in the room and a daily bus take them to Cagliari for free. “It’s too easy to accuse us of racism and xenophobia, but we refuse to accept this total and grave injustice to the Sardinian people. These boys are muscular and equipped with the latest model iPhones. “I say if they want a TV in the room and maybe even a masseuse, they must be loaded on a ship and sent back to Africa immediately. With a one-way ticket”.'"}, "time": 1742628402.4463007}