{"duration": 0.11293792724609375, "input_args": {"text": "'Posted by Madeline | Oct 26, 2016 | 2016 , Daily Blog | 0 | Thanks Heru! By Lisa Brown, 10/19/2016 I find it interesting to experience/observe. I can see their desire to expose/honor their hearts, yet their confusion at losing their masculine persona if they do. I can see their beauty, magnificence and purity of their soul and their not knowing how to BE a MAN and feel all this stuff emerging within them. I can also see them put stronger walls up trying their best to hold on to old realities not true anymore, fear of feeling, hurt, failure and losing control, letting anyone in, being let down, abandoned, judged….. which do not occur on NEW Earth. \\nIt is no different than when we woke up (women and feminine energy men), yet it is, for they’ve lived this life of strength, of being powerful, of being strong and surviving everything. For the really really masculine energy man (or women, but we are talking about men right now), their softness brings forth fear of vulnerability….. which is so totally the opposite, for we must allow ourselves that rawness/that vulnerability in order to truly feel again, to bring the walls of protection down, to not live in the fear of being alone…. \\nWhen our soul awakens, we desire connection, deeply, yet we seek it in others first. Experience after experience activates our unworthiness, feeling of not-good-enough, lack of intimate lasting connection, rejected for not being “enough” in others minds, where they are not in-tune with their own sacred soul. \\nWE are in the vibrations of the very masculine man awakening now…. more and more. It’s important to support them, show them that they can be masculine and honor their soul at the same time. It’s important to open up and share, to show them it’s safe to be seen. It’s important to not impose, not pressure, not push… just hold the space for them to open up on their own and not feel threatened as they do. It’s important for the women to support the men now, yet in very different ways than before. \\nThose who have opened their hearts KNOW that our relationships are very different here. We do not hold attachments, cords, expectations or needs anymore. All New Earth relationships are powerful, beautiful, freeing, supportive, empowering, inspiring and a co-creative experience of in-service to ourselves, each other and all on earth. They are to usher in the new era, this one now, through unity, peace, respect, support, contribution and Divine Love. \\nMany men have been trying to wake up, going through their distortions, shedding old human needs and exchanging them for new desires to take their place in this new world now. The more human masculine energy, the more safety, protection and survival mechanisms there were. Judgment is huge and it’s scary when your whole world starts to change for you and you don’t have a choice anymore. \\nWomen, it’s your time to step-up, to BE the one that already understands. To BE the one who holds that space and the STABILITY in place. When the old starts to collapse, crumble, dissolve, when emotions start to surface that you didn’t know were there, when nothing makes sense and you don’t understand why you can’t keep it together anymore and be the one that everyone could depend on physically…. we all know what this is like… we’ve been there. \\nWe’ve been through the collapse to move into creation of the new. To re-birth ourselves, our own realities and now the men do this too. There are many who were not ready before, yet those times (vibrations) are gone. You will start to see more men awaken, especially the strong ones, and the fear of “how” to deal with this… part of your job as an Ascended BEing, as a Master BEing, as a Light Tower and a Keeper of NEW Earth is to not just hold the space but show them how it’s all not only going to be okay, it’s going to be awesome. \\nIt doesn’t matter what body we are in, female or male. Men now identify with their masculine bodies as an expectation that they are supposed to be the strong one, the providers, the one’s that don’t break…. when we know better…. \\nWhen the soul awakens, the human aspect does break/dissolve, and it doesn’t matter what bodies we are in. This process is genderless… We all have human masculine, human feminine and we have Divine Masculine and Divine Feminine too. \\nRelationships built or formed out of unconsciousness collapse, end, re-shape or transform, often all of these….. Some go their separate ways while each evolves, awakens, dies/re-births/grows up as Spirit/Soul in physical body form. \\nMany women’s/partner’s/friend’s roles will be to support others and super masculine man now ready to open up. Just because they struggled before, resisted before, doesn’t mean they still are/will. When you show them (WayShower) that you can handle it, you can be the support, you can even be the provider if need be, then they can honor themselves without the weight of everyone depending on them to do it all by themselves anymore. \\nAs masculine/feminine are re-defined, according to ENERGY and that each can fill all of these roles themselves, then the balance can shift easily, and each as they honor themselves and step up into their own roles, can support others ready to do this too. \\nFinancial support is also a part of this, which can be emasculating if viewed through human eyes. When one realizes that money is just energy to support us all, they let go of the mis-perceptions and definitions once held by who did what role. In the old paradigm, Money was associated with power, which was a masculine thing. NOW money is an expression of gratitude, love, respect, contribution and is to support those stepping into/fulfilling their SOUL’s Purposes and Roles here. When the focus is taken off of money and put on what is truly important, the SOUL, then each can flourish, each can receive, each can share, each contributes the ENERGY of what is important to create a whole new reality of UNIFIED EXISTENCE here. \\nStrength is through the purely open true warrior heart. Power is the knowledge and wisdom that comes through your own connection AS PURE SOURCE LIGHT within. Abundance is an existence. Divine Sacred Love is what makes the difference here. Union is when Souls come together, to work together, to be together and to bring forth realities consciously together. We all have to/had to do this ourselves so that we could create/anchor/hold the foundation of a whole new/remembered existence here. \\nYour SOUL can see the awakening Soul of another. You can expand the space or shut it down/close portals. What’s appropriate will be determined by how conscious, present and open each is…. As a Master, you have the capability to see, understand and do more than you did as a limited and lacking human. Your energy makes the difference…………. They are going to need to pull away, be alone, sleep and have someone to talk to without being judged. The human aspect doesn’t believe it’s safe to open up, without being attacked, judged or imposed upon. It’s up to you to show that it is. Masculine energy believes it when they see it. You prove it by BEing your higher self all of the time. Their soul will emerge as you do. \\nHigher Consciousness Existence. I love you. \\nLisa Transcendence Brown'"}, "time": 1742563197.5625536}