{"duration": 0.03560829162597656, "input_args": {"text": "'Yes, Donald Trump has fallen behind in the national polls. All of them. But here’s a number you don’t hear enough: 41 percent of voters are still supporting him. Four out of every 10 people. Who are they, exactly? In the latest episode of The   we spoke with a man who may be better qualified than anyone to answer that question: J. D. Vance, who grew up in the heart of Mr. Trump’s America, Appalachia, where stubborn poverty, economic decay and class resentment were as firmly rooted as the coal mines. His new book, “Hillbilly Elegy,” now No. 6 on the New York Times best seller list, may be the best explanation yet of Mr. Trump’s political rise. It is a deeply personal memoir about growing up poor in Rust Belt Ohio that doubles as a cultural anthropology of the white underclass that has flocked to the Republican presidential nominee’s candidacy. In our interview, Mr. Vance explains who these voters are, what animates them and why they have responded so powerfully to Mr. Trump’s message. “These people feel ignored in a very substantive way,” he said, especially by the Republican Party, with which they have long identified. “They’re not addressing the sense of crisis that I think a lot of these people feel in their own lives and that they see in their own communities,” Mr. Vance said. “So along comes Donald Trump,” he continued, “talking the way that they talk and simultaneously speaking to their concerns over trade and over the economy, so it’s not super surprising that they’ve gravitated towards him. ” Mr. Vance mixes compassion for the plight of his family, friends and neighbors with cleareyed judgments about what he says are the personal failings and flawed thinking that have made it impossible for many of them to escape those circumstances. “It’s about reacting to bad circumstances in the worst possible way,” he writes in the book. “It’s about a culture that increasingly encourages social decay instead of counteracting it. ” In the episode, I’m joined by my colleagues Nick Confessore and Nate Cohn, who discuss the   in Mr. Trump’s campaign, which seems to confirm his almost singular focus on white, economically insecure voters. We also discuss whether that segment of the electorate can really put him in the White House. Please let us know what you think of the show. You can reach us at therunup@nytimes. com, or find me on Twitter, and you can leave ratings and feedback on iTunes. From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. (This link might help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “The  ” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, just tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. (This link might help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for the name of the series and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, just click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742628572.3348832}