{"duration": 0.16777920722961426, "input_args": {"text": "'“What is left when unhungry? ,” Justin Vernon sings midway through “22, a Million,” his third album as Bon Iver. It’s one of many questions this    songwriter and   asks of himself in the course of the album. And it’s answered, in some ways, by the songs themselves on Bon Iver’s most diverse, noisiest, shortest, knottiest and most experimental album so far. Due for release on Sept. 30, “22, a Million,” is one more sharp turn in a career that has carried Mr. Vernon from   obscurity in Wisconsin clubs to festival stages and the Grammys, including an improbable detour via   and Kanye West. The songwriter and pianist Bruce Hornsby  —   one of Mr. Vernon’s avowed influences and, lately, a collaborator  —   described Mr. Vernon in a phone interview as “a soul singer who creates these unique and beautiful sonic landscapes on which to perform. ” Those landscapes have grown ever more painstakingly inventive. Making the album, Mr. Vernon said earlier this month, was at times spontaneous, at times convoluted and often uncertain. “It was a long moment, these last few years, thinking: What am I doing? What do I want to do it for?” he said. Mr. Vernon needed five years, three of them concentrated on writing and recording the new album, to clarify for himself what Bon Iver means and sounds like, now that he can count on a worldwide audience to keep him “unhungry. ” “I feel both blessed and cursed by the fact that I can do whatever I want at this point,” Mr. Vernon said in a rare extended interview in the recording studio at Pioneer Works in Brooklyn, a gallery and performance space in Red Hook where he is on the advisory board. “I have more recognition than I had ever wanted to deal with. ” The pressure he felt was not commercial. “22, a Million” is a bumpier ride than Bon Iver’s previous albums. It constantly mixes distorted and manipulated sounds with natural ones, and it deliberately veers away from pop familiarity. But it also progresses toward solace, grounding its closing songs in steadfast melodies and consoling harmonies. “It’s important to me to not pay any attention to questions of, ‘What’s your legacy going to be?’ or ‘What are you going to leave behind?’ or ‘How do you work into the current scene?’ or ‘How do you relate to the  ? ’” Mr. Vernon said. “I find all of that stuff not only distracting but kind of the opposite of what it all means. ” Wearing loose pinstriped pants and a dark gray   that revealed some of his many tattoos, with a neatly trimmed beard and casually tousled hair, Mr. Vernon was by no means the introvert his songs might suggest. Affable and articulate, he was eager to delve into and at least partly decrypt his work. The polite   of his Midwestern upbringing came through, but Mr. Vernon battles excessive modesty. “I got in a friendly argument with Kanye West about the word humble once,” he recalled. “He said, ‘Have you ever looked up the word humble?’ I was like, ‘Actually I don’t know if I have.’ And he showed me the definition of it, and it’s far more   kind of the problematic Midwestern ‘Sorry!’ mentality, than I realized. ” He continued, “I took a lot out of that conversation. Ultimately, I think it’s great to serve others and everything, but I think there’s a certain point where it’s diminishing returns for the people around you if you’re not showing up and being who you are. ” “22, a Million”  —   the title reflects Mr. Vernon’s numerological whims  —   is the   successor to the 2011 album “Bon Iver, Bon Iver,” which sold more than half a million copies in the United States and won Grammy Awards for best alternative album and best new artist. Grammy recognition “didn’t change anything about me,” he said. “It did make me realize that there are people out there that really care about monetary success and recognition for the commodity that is music, like way more than I do. Not to say I don’t care about recognition. I like when people like a song, but I certainly don’t care as much as some folks out there. ” The first Bon Iver album, “For Emma, Forever Ago,” was a nearly solitary work. Mr. Vernon wrote and recorded it after the breakup of both his longtime band and a relationship, in his father’s chilly hunting cabin in Wisconsin during the winter of   and it was full of pensive ballads with translucent layers of guitars and vocals. “For Emma” quietly won hearts, eventually selling half a million copies. It also brought Bon Iver to the attention of Mr. West, who sampled “Woods,” a song from a 2009 Bon Iver EP, and went on to feature Mr. Vernon at concerts and as a songwriting collaborator on “My Beautiful Dark Twisted Fantasy,” “Watch the Throne” and “Yeezus. ” The second Bon Iver album, “Bon Iver, Bon Iver” was both more expansive and more ambiguous. Mr. Vernon built his own studio, April Base, in his hometown, Eau Claire, Wis. The music was still gracious, mostly     as Mr. Vernon welcomed a broader range of collaborators and instruments, bringing a lapidary detail to the arrangements, while the lyrics posed new riddles. In the interview, Mr. Vernon noted that “Perth,” which opens that album, and “” which concludes it, rhyme with “birth” and “death. ” The   continue: A song title on the new album, “10 Death Breast,” rhymes with “ . ” Mr. Vernon found plenty of distractions before settling in to work on “22, a Million. ” He toured the world with the large band he needed to recreate “Bon Iver, Bon Iver” onstage, an elaborate and demanding project. “I didn’t ever plan on having that much popularity, and being from Wisconsin, whatever amount that I could have dreamt about, I was not prepared for any of that,” he said. One thing that weighed on him was being photographed constantly, he said his face is noticeably absent from the artwork of the new album. “I felt very exposed, with scarred skin from the whole experience. Not that it was all bad, but it wore down these outer layers, and everything kind of hurt. ” When the tour ended, he turned to collaborations: producing albums for the Blind Boys of Alabama and the folky English group the Staves, and regrouping and touring with his    band Volcano Choir. He started and closely curated a festival, Eaux Claires, with Bon Iver headlining alongside its influences and favorites. And, gradually, he pushed himself to write new songs. Instead of having his guitar at their center, they largely relied on a portable synthesizer and sampler along with a customized Vocoder and thoughts of the heady blend of Duke Ellington’s saxophone sections one new song, he said, weaves about 150 saxophones into its mix. A turning point came when Mr. Vernon traveled to Greece, alone and  . He found himself singing the line “It might be over soon” into the sampler, hearing it as a kind of mantra that could suggest relief, loss, mortality or a reason to get to work. “The bad stuff might be over soon, but maybe the good stuff might be over soon,” he said. “So you’d better figure out how to enjoy this life and participate in it. ” Back in Wisconsin, Mr. Vernon worked like both a   and a   producer. He improvised with musicians in his studio, then culled snippets that might engender songs he toyed with loops and effects he let samples lead him to ideas. Where he had organized “Bon Iver, Bon Iver” around places, he decided to unify his new album with numbers. Each song title on “22, a Million” begins with a number that holds a private significance for Mr. Vernon. He has always been drawn to the number 22. While growing up and playing sports, he chose it as his jersey number he also, he said, sets   alarms to 22 minutes after the hour. As he chopped up the phrase “It might be over soon” in the sampler, “soon” began to turn into “two, two”: 22. The album opens with “22 Over Soon” and concludes with the hymnlike “1000000, a Million. ” “Being 22 is me,” he said, “and then the last song being a million, which is this great elusive thing: like, what’s a million? The album deals a lot with duality in general and how that works into the math. I was big into Taoism in college, and the paradox of duality, and how it’s always one thing and the other  —   you can never have one thing without the other. So it’s 22 being me and a million being the Other. That was a way to look at it as a circle. ” He also delved into sonic manipulation. “A big thing for me on the album was, how do we get something to sound accidental or new or fresh,” he said. When he was dissatisfied with the overly digital sound of “22 Over Soon,” he and his engineer took a cassette (Neil Young’s “Unplugged”) pulled out the tape and crumpled it and wrote on it with a marker. Then they recorded the track onto it, creating distortion and dropouts. Other songs toy with recording speed, ending up between standard pitches. The   that runs through all of Bon Iver’s songs emerged anew in lyrics and song titles that draw on thoughts of consecration, prayer and God. A spacious yet fragile ballad, “666 Upsidedowncross,” presents the singer as an uncertain pilgrim, musing, “I don’t know the path. ” The album booklet cites the anguished Psalm 22  —   “Why are you so far from saving me?”  —   alongside the song “33 ‘God’,” which includes samples from a gospel choir. “When you use enough of that language, it perks some people’s ears up,” Mr. Vernon said. “I do love those words, I love the word consecration, these holy words so to speak. I like using them in a way people haven’t heard before, or right next to a bunch of swear words. It’s just fun  —   it puts a smile on my face. ” But there was also a more serious undercurrent. He added: “For me from a very early age, music has been my religion. It’s been my way of understanding, it’s been my way of celebration, it’s been my way of contemplation. ” As Bon Iver   Mr. Vernon is thinking hard about  . “When I made the last record, actually both records, I very much felt like I’d healed myself,” he said. “Oh, I got done, and oh! now I’m better. And this one, I’m smarter than that. Now that this album’s done, as much as I healed a lot of things by making it, I know that it’s an ongoing thing. The river does not end. ”'"}, "time": 1742564171.8699884}