{"duration": 0.03151583671569824, "input_args": {"text": "'Creepers of the web, rejoice! Now you can find someone’s social media account just by taking their picture. [Jack Kenyon, founder of smartphone app Facezam, says that it “could be the end of our anonymous societies. ” Kenyon outlines the function of the app with alarming clarity: “Users will be able to identify anyone within a matter of seconds, which means privacy will no longer exist in public society. ”  Facezam uses Facebook’s   user information database to match the picture you snap with the person’s social media information. It claims a less than   turnaround on most queries. In testing, its facial recognition has maintained about 70% accuracy. If you do not want to participate, you are unfortunately out of luck. Being one of the almost 2 billion Facebook users means that you are already part of the developer database that Facezam uses for identification. And Facebook already uses facial recognition to suggest who should be tagged in your photos, so the proverbial prize is right there for the taking. The app is set to launch on March 21, but Facebook itself may stand in the way. The social network says that Facezam “violates [their] terms” and that they are “reaching out to the developer to ensure they bring their app into compliance. ” Kenyon, however, disagrees. He says that his company has “looked into this,” and they remain “confident the app won’t be violating Facebook’s terms. ” Furthermore, he claims the ramifications of the app could have “a mix of positives and negatives” and that it could even help to reduce crime. Right now, the only way to reduce Facezam’s effectiveness is to obscure your face in pictures. If you are prone to wearing sunglasses, or have hair that falls across your face, you may be fortunate enough to reduce the chances of being identified by a stranger’s phone to about 55%. **UPDATE** Facezam has been revealed as a hoax, with their website stating, “This was a publicity stunt by Zacozo Creative, a Viral Marketing Agency. ” Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742562454.3298702}