{"duration": 1.5170655250549316, "input_args": {"text": "'Fifty interesting facts about Russia 31.10.2016 Print version Font Size 1. Russia is the largest country in the world. The country has \\u200b\\u200b17,075,400 square kilometers, which makes Russia 1.8 times larger than the United States of America. The territory that Russia takes on planet Earth practically equals the surface area of \\u200b\\u200bplanet Pluto.2. Russia is home to the world\\'s largest active volcano - Klyuchevskaya Sopka. Its height is 4 kilometers 850 meters. The volcano shoots columns of ash up to eight kilometers high and becomes even taller with every eruption. Klyuchevskaya Sopka volcano erupts for the past 7,000 years.3. The subway system (metro) of St. Petersburg is the deepest in the world. Its average depth - 100 meters.4. The number of bridges in St. Petersburg exceeds the number of bridges in Venice three times. 5. The oldest Christian church on the territory of Russia is the ancient temple of Thaba-Yerdy located in Ingushetia, Jeirakh District. It was built in VIII-IX centuries. Three oldest of existing churches are located in the village of Nizhny Arkhyz in Karachay-Cherkessia. The temples were built in the X century.6. The Trans-Siberian Railway is the longest railway in the world. The Great Siberian Way, connecting Moscow with Vladivostok, is 9,298 kilometers long. The railway crosses eight time zones, passes through 87 cities and towns and crosses 16 rivers, including the Volga.7. Lake Baikal in Siberia is the deepest lake in the world and the largest source of fresh water on the planet. Baikal holds 23 cubic kilometers of water. All the world\\'s major rivers - the Volga, the Don, the Dnieper, the Yenisei, the Ural, the Ob, the Ganges, the Orinoco, the Amazon, the Thames, the Seine and the Oder would have to flow for almost a year to fill the basic, equal to the volume of Lake Baikal.8. Russia is the only country whose territory is washed by 12 seas.9. Russia is only four kilometers far from America. The is the distance between the island of Ratmanova (Russia) and the Kruzenshtern Island (USA) in the Bering Strait.10. The distance from Moscow to Chicago is smaller than the distance from from Chicago to Rio de Janeiro.11. In the cultural capital of Russia, St. Petersburg, there are 2,000 libraries, 221 museums, 100 concert organizations, more than 80 theaters, 80 clubs and houses of culture, 62 cinemas and 45 art galleries.12. The Ural Mountains are the oldest mountains in the world. The Karandash Mount located in the Kusinsky area near the village of Aleksandrovka was formed 4.2 billion years ago. The historical names of the Ural Mountains are - the Big Rock, the Siberian Rock, the Earth Belt, the Belt Rock.13. In Moscow, there are seven exactly the same high-rise buildings: two hotels, two office buildings, two residential buildings and the University. In English, this ensemble is known as the Seven Sisters, whereas in Russian, the buildings are known as Stalinist skyscrapers. The style, in which the skyscrapers are built, is called the Stalinist gothic.14. The Moscow Kremlin is the world\\'s largest medieval fortress.15. The total length of the Kremlin walls is 2,235 meters.16. In Moscow, there is a large fountain that contains drinking water. The fountain is part of the architectural group \"Alexander and Natalie\" with a sculptural composition of Pushkin and Goncharova in a graceful rotunda.17. St. Petersburg is the world\\'s northernmost city with a population of over one million people.18. The area of \\u200b\\u200bSiberia is 9 million 734.3 thousand square kilometers, which accounts for nine percent of the world\\'s land.19. Russia borders with 16 countries: Norway, Finland, Estonia, Latvia, Lithuania, Poland, Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia, North Korea, Japan and the United States. Russia also borders on two unrecognized states: South Ossetia and Abkhazia.20. The number of Kalashnikov assault rifles in the world is larger than the number of all other assault rifles combined. 21. Russia proclaimed equal rights for men and women before the United States. In Russia, the right to vote was granted to women in 1918, in the United States - in 1920.22. Russia had never known slavery. The period of the most distinguished form of feudal dependence, serfdom, was shorter in Russia than, for example, in England and most of Europe. Serfdom in Russia had milder forms. Russian serfdom was abolished in 1861, whereas the United States abolished slavery in 1865.23. On January 16, 1820, the Russian expedition led by Thaddeus Bellingshausen and Mikhail Lazarev discovered Antarctica.24. The most famous computer game -Tetris - was created by Russian programmer Alexey Pazhitnov in 1985. This game became popular in the Soviet Union, and then, in 1986, in the West.25. Ivan the Terrible was not a tyrant, his rule was unprecedentedly mild for his time. During his rule, Russia\\'s size was equal to that of Europe, but Ivan the Terrible executed 100 fewer people in comparison with European kings during the same period of time - 3-4 thousand people against 300-400 thousand.26. Ivan the Terrible did not kill his son.27. Trains of the Moscow metro run more often than in any other subway system in the world. At rush hours, intervals between trains is only 90 seconds. There are stylized trains in the Moscow metro, for example, a train called \"Watercolors\" that represents a traveling exhibition of paintings.28. In Peterhof, near St. Petersburg, there are 176 fountains, 40 of which are huge and five are built as cascades.29. The Russian samovar is an ancient version of the electric kettle. The samovar was powered by coal, but its function was to boil water. 30. In the Russian town Oymyakon, the lowest temperature of air was recorded. The cold record was set in 1924, when temperates dropped to -71.2 °C.31. In the Novosibirsk Institute of Cytology and Genetics, there is a monument to the laboratory mouse that knits the DNA.32. During the Second World War, metro stations were used as bomb shelters. As many as 150 babies were born there during air raids. 33. In Russia, there are many beautiful excursion and hiking routes. The most famous one of them is the so-called Russian Golden Ring, as well as the Silver Ring of Russia and the Great Ural Ring.34. The total length of 12 lines of the Moscow metro is 310 kilometers.35. In the 18th century, Russia was the third largest empire in the history of mankind, occupying the territory from Poland in Europe to Alaska in North America. 36. The West Siberian Plain is the largest plain in the world.37. The Hermitage is one of the largest and oldest museums in the world. The Hermitage stores three million works of art from the Stone Age to the present. If a visitor pays only one minute of their attention to each exhibit, it would take them 25 years to see all the exhibits of the Hermitage. 38. A half of the city of Chelyabinsk is located in the Urals, whereas the other half - in Siberia. Strangely enough, the coat of arms of Chelyabinsk depicts a camel. It turns out, however, that Chelyabinsk used to take caravans of camels 200 years ago. 39. A while ago, Moscow had more billionaires than any other city in the world.40. The Russian Public Library is the largest library in Europe and the second largest in the world after the United States Library of Congress. The Russian Public Library is located in Moscow, it was founded in 1862.41. On the opening day of a 700-seat McDonalds restaurant on Pushkin Square in Moscow, the line of people willing to go there made up 5,000 individuals at 5 a.m. During the first day of work, the restaurant served 3,000 customers. To this day, the McDonald\\'s on Pushkin Square remains the most visited McDonald\\'s in the world.42. The State Hermitage Museum keeps a flock of cats against rodents. Each cat of the Hermitage has a passport with a photo.43. In Altai, there are more than 820 glaciers that occupy a total area of \\u200b\\u200b600 square kilometers.44. In Russia, a new sport has recently emerged in Russia - helicopter golf. Two helicopters, equipped with 4-meter sticks, play two balls one meter in diameter. Each team consists of five people.45. Russia regularly appears on lists of least friendly countries in the world, but this is just a misconception based on cross-cultural differences. In Russia, children are taught not to smile for no reason, as this kind of behavior displays light-mindedness. In fact, the Russians are friendly and are always ready to help a foreigner.46. \\u200b\\u200bIn 2002, the city of Yekaterinburg was put on UNESCO\\'s list of 12 perfect cities in the world.47. The largest bell ever cast is the Russian Tsar Bell made by Ivan Motorin and his son Mikhail. The weight of the Tsar Bell is 12,327 puds and 19 pounds, or 201 tons and 924 kilograms. The Tsar Bell is 6 meters 14 centimeters tall. 48. The city of Suzdal takes only 15 square kilometers of land and has the population of a little over 10,000 people. Yet, there are 53 churches in Suzdal. 49. The Russian Federation consists of eight federal districts, which are divided into 83 regions -subjects of the Federation, including 21 national republics. According to the Constitution, each republic is assigned to a titular ethnic group. The Russian republics take 28.6% of the territory of Russia, which is home to 16.9% of the population of the country. Ethnic Russians account for approximately 83% of the Russian population. However, the Russian Constitution does not contain a word about the Russian people. This legal mishap is one of the most pressing domestic problems of the Russian Federation, and it will be settled sooner or later.50. A myth about a myth: the Russians think that Americans think that bears walk in the streets of Moscow. In fact, bears do not appear in Russian city streets, and the Americans do not have a stereotype of the wild Russia.Newsinfo'"}, "time": 1742562616.115927}