{"duration": 0.13730621337890625, "input_args": {"text": "'WASHINGTON  —   Republicans in Congress plan to move almost immediately next month to repeal the Affordable Care Act, as   Donald J. Trump promised. But they also are likely to delay the effective date so that they have several years to phase out President Obama’s signature achievement. This emerging “repeal and delay” strategy, which Speaker Paul D. Ryan discussed this week with Vice   Mike Pence, underscores a growing recognition that replacing the health care law will be technically complicated and could be politically explosive. Since the law was signed by Mr. Obama in March 2010, 20 million uninsured people have gained coverage, and the law has become deeply embedded in the nation’s health care system, accepted with varying degrees of enthusiasm by consumers, doctors, hospitals, insurance companies and state and local governments. Unwinding it could be as difficult for Republicans as it was for Democrats to pass it in the first place and could lead Republicans into a dangerous    where the existing law is in shambles but no replacement can pass the narrowly divided Senate. Democrats would face political pressure in that case as well. It is not sheer coincidence that at least one idea envisions putting the effective date well beyond the midterm congressional elections in 2018. “We are not going to rip health care away from Americans,” said Representative Kevin Brady, Republican of Texas and chairman of the Ways and Means Committee, which shares jurisdiction over health care. “We will have a transition period so Congress can develop the right policies and the American people can have time to look for better health care options. ” Senator Lamar Alexander, Republican of Tennessee and chairman of the Senate health committee, said: “I imagine this will take several years to completely make that sort of transition  —   to make sure we do no harm, create a good health care system that everyone has access to, and that we repeal the parts of Obamacare that need to be repealed. ” But health policy experts suggest “repeal and delay” would be extremely damaging to a health care system already on edge. “The idea that you can repeal the Affordable Care Act with a   or   transition period and not create market chaos is a total fantasy,” said Sabrina Corlette, a professor at the Health Policy Institute of Georgetown University. “Insurers need to know the rules of the road in order to develop plans and set premiums. ” Details of the strategy are in flux, and there are disagreements among Republicans about how to proceed. In the House, the emerging plan, tightly coordinated between Mr. Ryan and Mr. Pence, is meant to give Mr. Trump’s supporters the repeal of the health law that he repeatedly promised at rallies. It would also give Republicans time to try to assure consumers and the health industry that they will not instantly upend the health insurance market, and to pressure some Democrats to support a Republican alternative. “I don’t think you have to wait,” Representative Kevin McCarthy of California, the majority leader, told reporters this week. “I would move through and repeal and then go to work on replacing. I think once it’s repealed, you will have hopefully fewer people playing politics, and everybody coming to the table to find the best policy. ” Under the plan discussed this week, Republicans said, repeal will be on a fast track. They hope to move forward in January or February with a budget blueprint using   reconciliation instructions, which would allow parts of the health care law to be dismembered with a simple majority vote, denying Senate Democrats the chance to filibuster. They would follow up with legislation similar to a bill vetoed in January, which would have repealed the tax penalties for people who go without insurance and the penalties for larger employers who fail to offer coverage. That bill would also have eliminated federal insurance subsidies, ended federal spending for the expansion of Medicaid, and barred federal payments to Planned Parenthood clinics. But in the Senate, Republicans would need support from some Democrats if they are to replace the Affordable Care Act. The budget reconciliation rules that would allow Republicans to dismantle the Affordable Care Act have strict limits. The rules are primarily intended to protect legislation that affects spending or revenues. The health law includes insurance market standards and other policies that do not directly affect the budget, and Senate Republicans would, in many cases, need 60 votes to change such provisions. Repealing the funding mechanisms but leaving in place the regulations risks a meltdown of the individual insurance market. Insurers could not deny coverage, but they would not get as many healthy new customers as they were expecting. Hospitals would again face many uninsured patients in their emergency rooms, without the extra Medicaid money they have been expecting. Even a delay of two to three years could be damaging. Health policy experts said the uncertainty could destabilize markets, unnerving insurers that have already lost hundreds of millions of dollars on policies sold in insurance exchanges under the Affordable Care Act. “Insurers would like clarity on the shape of the replacement plan to continue participating on exchanges if Obamacare is repealed,” Ana Gupte, an analyst at Leerink Partners who follows the insurance industry, said Friday. Republicans are hoping that Mr. Trump will be able to use his bully pulpit to lean on vulnerable Democrats up for   in states Mr. Trump won, such as Senators Joe Manchin III of West Virginia and Jon Tester of Montana. “When that date came and you did nothing, if you want to play politics, I think the blame would go to people who didn’t want to do anything,” Mr. McCarthy said. But Democrats may not be so quick to break. “If they are looking at fixing what’s there, I’ve been wanting to work with Republicans for years now,” said Mr. Tester, whose state cast just 36 percent of its vote for Hillary Clinton. “But if they are going to take away provisions like   conditions, lifetime caps,    I think they are barking up the wrong tree. ” And some moderate Republicans see peril in repealing first and replacing later, favoring instead a simultaneous replacement to ensure a smooth transition. “We are firing live rounds this time,” Representative Charlie Dent, Republican of Pennsylvania, said. “If we repeal under reconciliation, we have to replace it under normal processes, and does anyone believe that the Senate Democrats, with their gentle tender mercies will help us?” Republicans said they would work with the Trump administration on replacement legislation that would draw on comprehensive plans drafted by Mr. Ryan and Representative Tom Price, the Georgia Republican picked by Mr. Trump to be his secretary of health and human services. Any legislation is likely to include elements on which Republicans generally agree: tax credits for health insurance new incentives for health savings accounts subsidies for state   pools, to help people who could not otherwise obtain insurance authority for sales of insurance across state lines and some protection for people with   conditions who have maintained continuous coverage. Republicans said they hoped that the certainty of repeal would increase pressure on Democrats to sign on to some of these ideas. Democratic leaders, for now, feel no such pressure. Republicans “are going to have an awfully hard time” if they try to repeal the health law without proposing a replacement, said Senator Chuck Schumer of New York, the next Democratic leader. “There would be consequences for so many millions of people. ”'"}, "time": 1742564518.2885773}