{"duration": 0.025679349899291992, "input_args": {"text": "'\\nWin or lose, Trump has left his mark, and America has changed.\\nOn the eve of the election, many Republican insiders and loyal commentators are acknowledging what has become apparent – that rise of Trump signals not just a different 2016 cycle, but an entirely new constituency – one defined by populism, by trade, by class. by the impact on jobs and economics.\\nCharles Krauthammer stated on Fox News that Trump is the new power broker in the GOP and the de facto “king maker” – regardless of who wins the election. The demographics of the party have changed:\\n\\nInterestingly, Bill Clinton also gets it. The former president has been on the stump – ostensibly to differentiate his wife from President Obama – pointing out the fact that the middle class has been abandoned, and that these desperate people are turning to populist because they have lost something tangible in the last eight years.\\nAs The Daily Sheeple reported :\\nA leaked Democratic fundraising speech Bill Clinton gave back in 2015 shows the former president telling donors that thanks to Obama, lower-income whites have lower life expectancies because they “don’t have anything to look forward to when they get up in the morning” now.\\nBill is tacitly acknowledging the impact that terrible trade deals have had on the American economy and jobs over the last 30 years…\\nNot only is Bill trying to sound like a straight-talking mix of Bernie Sanders and Donald Trump, he is acknowledging the same new party identities that voters have assumed.\\nWhile Hillary may take the electoral college votes handily enough, the popular votes will reflect a sentiment of anger and unrest in the population.\\nAs the NY Times noted :\\n[Democrats/Hillary campaign] have effectively swapped much of their working-class white base for the so-called rising demographic of millennials, nonwhite voters and suburbanites clustered near cities such as Denver, Miami, Las Vegas and Washington.\\nFrom watching these communities, it will become clear on Tuesday why Mrs. Clinton’s party enjoys a structural advantage in the Electoral College. But this election may also hasten the day when more of the heartland becomes out of reach, illustrating what Democrats lost as much as what they gained. \\nThe common thread is that a combination of trade deals and economic policies has destroyed the wealth of “everyday Americans” – shrinking the middle class and piling pressure onto the lower and working classes who must increasingly depend upon government assistance for their survival.\\nRead more: \\nTrump Accuses Fed of Not Raising Rates Because Obama “Doesn’t Want a Bubble Burst” Until He Leaves \\nEPIC RANT: Fed Up American Explains Why Trump Will Win: “Somebody With Balls” \\nCollapse Strategist: “We’re In The Terminal Phase… Economic Pain Like We’ve Never Seen Before” \\nTrump Tuesday Means A Shift Of Power for Establishment… And They Are Freaked \\nDavos Insider Vows Trump Defeat: “It Doesn’t Matter Who the GOP Puts Up, Hillary Will Win” '"}, "time": 1742628545.5528805}