{"duration": 0.13974499702453613, "input_args": {"text": "'AUGUSTA, Ga.  —   Fred Couples, playing in his 32nd Masters this year, said he had never seen wind so fierce at Augusta National Golf Club. “Brutal,” Couples said of the conditions during Thursday’s first round. “So difficult, so hard. ” Gusts up to 40 miles per hour blew waves of sand from the greenside bunkers, forming little twisters of grit that forced fans sitting nearby to protect their faces with scarves and jackets. Approach shots landed on greens only to be blown backward into ponds and creeks. Trees not normally in play became new hazards because wind bent branches just enough to put them in play and make them threats to   shots. “A day to fight,” Phil Mickelson said. “Guessing what the wind would do to your ball was the game within the game all day. ” It was also a day that started with the world’s hottest golfer, Dustin Johnson, withdrawing from the tournament just minutes before he was to step onto the first tee because of a back injury sustained falling on a staircase Wednesday night. At roughly the same time that Johnson was exiting, Jordan Spieth, who blew his chance at winning last year’s Masters with a stunning   7 on the 12th hole, made an equally startling quadruple bogey on No. 15. It will probably not be remembered as vividly as the 2016 catastrophe, but it was just as spectacular  —   an unfathomable 9. The first round was, however, still a day of golf, which is to say it was mystifying and indecipherable. As most of the field stumbled around the grounds with   faces and expressions of bewilderment, one player waltzed across the   layout without distress or strain. Charley Hoffman shot a    65 to take the   lead by four strokes. Given the conditions, it may have been one of the better opening rounds ever at the Masters. Hoffman had nine birdies  —   including 2s on the course’s four par 3s  —   and two bogeys. “On a day like today, like everyone else I was just trying to make par and not shoot myself out of the tournament,” Hoffman said. “But I started getting some shots close to the hole, and then I couldn’t remember missing a putt. ” Hoffman’s closest pursuer was William McGirt, who shot 69. Lee Westwood, a frequent Masters contender but never a major winner, was a stroke behind McGirt with a    70. A gaggle of golfers finished at one under par, including three major championship winners: Justin Rose, Jason Dufner and Mickelson. “It was a day when experience mattered,” Mickelson said. “The wind was going to magnify your misses, and the guys who miss in the wrong spots will make big numbers. “I love these conditions. Certainly challenging, but that’s O. K. ” Also at one under par was Sergio García, who has long been tormented at Augusta National, and the precocious    Matthew Fitzpatrick, playing in just his third Masters. Hoffman, playing in his fourth Masters, did not have an auspicious start to his round: He needed three putts on the third and fifth holes. But, having played well here before, he remained patient. “I step on this property, and it just feels special,” Hoffman said. “Off the tee, it just suits my eye. And I’ve been working hard on my putting. I’ve learned here that you have to be aggressive on your putts. You can’t be afraid to run the ball 3 feet past. ” And Hoffman, a Texan, is used to playing in blustery conditions. At the 2015 Masters, he was in second place after the second round and finished tied for ninth as Spieth claimed the championship. Asked Thursday what lesson he took from contending two years ago, Hoffman said: “I learned that I hit it as good as Jordan. He just made more putts. So the lesson was to make more putts in the Masters. ” Hoffman was eight under par over his final 13 holes. That kind of performance mocked what was going on most of the day, as some of the best golfers in the world were humbled. The former British Open champion Louis Oosthuizen shot a 77, as did the 2007 Masters champion Zach Johnson and last year’s British Open winner, Henrik Stenson. Adam Scott, Webb Simpson and Bernhard Langer, each a major champion, joined Spieth at three over par. Spieth’s score was respectable given his trouble on the 15th, a debacle that included a pitch shot into the pond fronting the green, and three putts. Dustin Johnson, who had won his last three tournaments, warmed up for his afternoon tee time but ultimately decided he could not play because he could not follow through on his swings  —   even at 80 percent of normal effort. Johnson fell Wednesday while walking down a   staircase at his rented home in the Augusta area. With the opening round completed, the Masters field seemed eager to flee the vicinity. As the sun set, sand was still being blown from the bunkers onto other parts of the property. And not a single golfer was hitting golf balls on the practice range. They had had enough. When McGirt’s round was complete  —   and his was a fruitful   round  —   he was asked where on the golf course the gusts had been at their worst. He answered, “From holes 1 to 18. ”'"}, "time": 1742563835.3743236}