{"duration": 0.05463242530822754, "input_args": {"text": "'LONDON  —   The shortlist for this year’s Man Booker Prize for Fiction, among the most prestigious literary honors in the world, includes six books by authors from Britain, Canada, South Africa and the United States, the prize committee said on Tuesday. The nominees for the award, which comes with a cash prize of £50, 000, or around $66, 400, were chosen from a longlist of 13 names, which was announced in July. The shortlisted books are: ■ The Canadian author Madeleine Thien’s “Do Not Say We Have Nothing,” about the legacy of the Cultural Revolution in China. ■ The American writer Paul Beatty’s “The Sellout,” a satire on black life in the United States. ■ The   author David Szalay’s “All That Man Is,” a series of nine stories about male protagonists. ■ The Scottish writer Graeme Macrae Burnet’s “His Bloody Project,” a historical thriller inspired by a multiple homicide in the 19th century. ■ The South   British novelist Deborah Levy’s “Hot Milk,” a    story about a young   woman. ■ “Eileen,” the debut novel by the American author Ottessa Moshfegh, which centers on a young woman working at a juvenile detention center in 1960s New England. Ms. Levy is the only author on the list to have been shortlisted before, in 2012, for “Swimming Home. ” Neither “My Name Is Lucy Barton,” by the Pulitzer Prize winner Elizabeth Strout, nor the Nobel Prize laureate J. M. Coetzee’s “The Schooldays of Jesus,” both of which made the longlist, reached the final stage. In 2014, the Man Booker, which had been limited to writers from Britain, Ireland, the Commonwealth and Zimbabwe, opened up to include submissions from any author whose work was published in Britain and first written in English. The Jamaican author Marlon James won the prize last year for his epic, “A Brief History of Seven Killings,” which revolves around a 1976 assassination attempt against Bob Marley. Past novelists who have won the award include leading literary names like Hilary Mantel, Ian McEwan, Margaret Atwood and Salman Rushdie. The winner will be announced at a ceremony in London on Oct. 25.'"}, "time": 1742561878.0419996}