{"duration": 0.1174614429473877, "input_args": {"text": "'BERLIN  —   A strong relationship with the United States is a bedrock of German foreign policy, so when Chancellor Angela Merkel met President Trump on Friday, German journalists and analysts scrutinized their body language and the tone of their remarks for clues about how they might work together. “Not warm, but not distant,” wrote the   newspaper Süddeutsche Zeitung in its online edition on Saturday. “It could have been a lot worse,” Germany’s   daily, Bild, wrote of the relationship that is the cornerstone of the NATO alliance and vital to global security. The initial reaction from Ms. Merkel’s spokesman, Steffen Seibert, emphasized the positives. Mr. Seibert welcomed Mr. Trump’s support of efforts to resolve the crisis in Ukraine and  the president’s confirmation of the importance of NATO. Mr. Seibert also reaffirmed Germany’s commitment to spend 2 percent of its gross domestic product on its military by 2024, as pledged during last year’s NATO summit meeting. But that did not seem to be enough for Mr. Trump, who insisted on Twitter early Saturday that Germany owed the alliance “vast sums of money. ” “Despite what you have heard from the FAKE NEWS, I had a GREAT meeting with German Chancellor Angela Merkel,” he wrote. “Nevertheless, Germany owes vast sums of money to NATO  the United States must be paid more for the powerful, and very expensive, defense it provides to Germany!” According to figures released by the alliance, Germany spent 1. 2 percent of its gross domestic product on its military in 2016, compared with 3. 6 percent for the United States. As security experts have pointed out, NATO members spending more on their defense does not automatically translate into more money being sent to Brussels or Washington. The style of making one point and swiftly changing direction reminded some foreign policy experts of the way Mr. Trump acted on the campaign trail, when his position on certain issues could veer wildly from one day to the next. “Once again, we’ve seen Dr. Jekyll and Mr. Hyde,” said Sylke Tempel, the editor in chief of Internationale Politik, published by the German Council on Foreign Relations, remarking on the approach that Mr. Trump took during the leaders’ joint news conference on Friday. “He was Mr. Jekyll while reading his statement, saying nice things about economic ties, his commitment to Ukraine, common friendship all the niceties,” Ms. Tempel said. “Then, in the    session, he’s his old self: disparaging the media, criticizing the British. ” Although memories of Ms. Merkel’s warm relationship with President Barack Obama remain fresh in the minds of many Germans, it took repeated meetings over several years before the chancellor reached that level with Mr. Obama. During a joint news conference in Dresden in June 2009, she displayed stiff body language and a chilly formality, months after she had denied Mr. Obama permission to speak in front of the Brandenburg Gate during the 2008 presidential campaign. In 2006, Mr. Obama’s predecessor, President George W. Bush, sought to win her over with a playful shoulder rub, a move abruptly rebuffed by the pragmatic chancellor. One year later, however, at the summit meeting of the Group of 8 industrialized nations, she coaxed Mr. Bush to voice support for her vision of a global plan to combat climate change. Yet both of Mr. Trump’s most recent predecessors followed diplomatic conventions and worked within the institutions established after World War II to foster communication and cooperation among nations. Mr. Trump’s “America First” approach and his disparagement of global trade agreements have caused uncertainty among German politicians and industry leaders. Asked by a German journalist about this approach, the president insisted that while he was not against trade, the United States had been treated unfairly in global trade agreements. “But I am not an isolationist,” he said. Less than 24 hours later, however, Mr. Trump’s government refused to back a pledge to fully oppose trade protectionism at a meeting in   Germany, of the finance ministers of the Group of 20, which comprises industrial and   countries as well as the European Union. Participants last year had agreed to resist “all forms” of protectionism. Germans have been both fascinated and horrified by Mr. Trump’s willingness to ignore the strictures of diplomacy when dealing with foreign leaders. For example, he has castigated Ms. Merkel for allowing refugees to flow into Germany in 2015, and he has called into question   War II alliances, including NATO and the European Union. Germans have not been entirely sure what to make of him. “One thing we can depend upon, that we saw yesterday: Donald Trump says what he wants,” Nikolaus Blome, deputy editor of Bild, wrote in its online edition. “He has predictable political interests. What he doesn’t have is a predictable way to pursue them. ” Ms. Tempel, of the German Council on Foreign Relations, said simply: “If this mission was really about getting a first impression, you got your first impression. ”'"}, "time": 1742561654.15332}