{"duration": 0.27106714248657227, "input_args": {"text": "'Perhaps, you have not heard of Kurt Eichenwald. He is a Vanity Fair contributing editor and Newsweek senior writer. He has around 182,000 followers on Twitter. Many of the messages sent from his account receive hundreds if not thousands of retweets. He has influence so that is why I am taking the time to say what Eichenwald will not write. And that is go fuck yourself.\\nWhy should Eichenwald go fuck himself? Does Eichenwald deserve to be told to do this? Or am I, as people commonly say when met with profanity, better than that? Let’s see.\\nEichenwald published a nearly 3,000-word screed centered on an encounter in the Philadelphia International Airport with someone who said they were a fan of his work. In fact, as Eichenwald admits, he almost assaulted this person.\\nThe man recognized him from a news program. According to Eichenwald, the man thanked him for his reporting on Donald Trump. He expressed outrage that Trump won and added, “Get back to work.” Eichenwald apparently lacks the ability to engage in basic social interactions with those who say they are his fans because he thought he detected a bit of “arrogance.” So, he asked who the man voted for.\\nInstead of telling Eichenwald it was none of his damn business, the fan was friendly. He said he voted for Green Party presidential candidate Jill Stein. A gasket blew inside Eichenwald. He interrupted his fan and said, “You’re lucky it’s illegal for me to punch you in the face.” He told his fan to go fuck himself (although Newsweek and/or Eichenwald apparently do not want to print it so the column says he told the fan to “have sex with himself”).\\nEichenwald bashes Stein and Bernie Sanders supporters and blames them for spreading “conspiracy theories” that helped cost Democrats the election. The entire column is a toxic slab of slime with a level of contempt and hostility that is staggering, given that he centers it on someone who claimed to be a fan of his work. One can only imagine what he would have done if that person said they were not a fan but tried to talk to him.\\nThis is absolutely the wrong reaction to the outcome of the election, however, it is the culmination of the worst genre of reporting and writing pumped out to the masses and popularized in the last year: vote shaming.\\nJournalists like Kurt Eichenwald feel it is their place to shame voters for their choices and tell them what to do. At the same time, trust in journalists, who work for mass media, is at a historic low. Is it any wonder why people trying to navigate a broken and corrupt electoral system that only gives them two choices every four years do not have confidence in the press, which elevates people who will attack them for refusing to fall in line?\\n“Shut the Hell Up” Eichenwald goes off on a “certain kind of liberal” he cannot stand, the kind that preens about their “narcissistic purity as they cast their ballot for a person they know cannot win.” This is truly rich coming from someone, who is a contributing editor for a magazine with a synonym for narcissism in its name, and who updates his followers on what he is doing with his stocks and uses his Twitter to prattle on and on about himself. The post does not address the substance of the so-called myths until about 1,000 words after he calls more attention to the struggle he endured trying to diligently write about Trump for the past months.\\nIn blunt terms, Eichenwald states, “I have no problem with anyone who voted for Trump, because they wanted a Trump presidency. I have an enormous problem with anyone who voted for Trump or Stein or Johnson—or who didn’t vote at all—and who now expresses horror about the outcome of this election. If you don’t like the consequences of your own actions, shut the hell up.”\\nEichenwald acts like he performed a public service, and without him, the electorate never would have been able to tell the difference between Clinton and Trump. He somewhat contradicts his demand to shut the hell up, too.\\n“If they supported Trump or truly didn’t care who won after acquiring a real understanding of both candidates’ positions—rather than spouting some self-indulgent, bumper-sticker logic—I have no complaints,” Eichenwald asserts. “If they opposed Trump while refusing to do what they could to keep him out of office—that is, vote for the only other candidate who could win —then they need to go perform sex with themselves. And I mean that in much cruder terms.”\\nWhich brings us back to the basic idea that Eichenwald should go fuck himself. And I can print that without writing it out in some censored form so I can later pat myself on the back for maintaining some semblance of civility.\\nStein Voters Could Not Have Helped Clinton Win If They Were “With Her” During election night, Carl Bialik of FiveThirtyEight.com reported , “As of current vote counts, the number of voters who cast ballots for candidates other than Clinton and Trump exceeds Trump’s winning margin — or lead, in races that haven’t yet been called — in many important states, including Arizona, Florida, Michigan, Pennsylvania and Wisconsin. But don’t pin Trump’s win on those voters who eschewed the two major candidates. Not all of them would have voted for Clinton had they been forced to choose only between her and Trump. And some might not have voted at all. Far more Democrats in Florida in 2000 voted for George W. Bush than voted for Ralph Nader.”\\nNate Cohn of the New York Times even said Stein is not responsible for Clinton’s defeat.\\nTrump earned a sizable chunk of votes from Obama voters. Bialik reported on November 11, “A smaller share of eligible voters cast ballots in 2016 than in either of the previous two presidential elections,” and it was lower in states that went for Clinton.\\nThis is probably the case because the Clinton campaign did not craft a message geared toward winning white working class or white middle class voters. She did not make overhauling free trade agreements a cornerstone of her campaign, and that hurt her in states like Michigan . It also could be that the Clintons represent something in establishment politics that millions of Americans felt they needed to reject.\\nHowever, Eichenwald is so enraged by the self-determination of voters—citizens who would vote for candidates on the ballot that the system intentionally tries to suffocate—that he insists the reason Clinton lost is because liberal Democrats are “consumed by provably false conspiracy theories.”\\nOh Boy! Someone Gave Eichenwald A Peek at a “Republican Playbook” Against Sanders The “conspiracy theories” liberal Democrats (i.e. Sanders supporters) “believe” is the Democratic National Committee is an “all-powerful” entity that rigged the election against Sanders and Sanders would have won against Trump.\\nEichenwald maintains “Sanders had not yet faced a real campaign against him” so he would not be able to win. By the end of May, the Clinton campaign had misrepresented Sanders’ role in the civil rights movement, accused Sanders of attacking President Obama for being “weak,” disingenuously claimed Sanders’s plan for single-payer healthcare would “dismantle Obamacare” to scare voters, and suggested the Sanders campaign planned to commit voter fraud in Iowa, allowed “Bernie Bros” to spread “vicious lies and sexism,” and sided with right-wing Republicans against immigration reform.\\nThe campaign also dishonestly attacked him as a supporter of anti-immigrant Minutemen vigilantes, had a surrogate grotesquely claims Sanders’s wife, Jane, palled around with Sheriff Joe Arpaio, insisted Sanders supported the indefinite detention of immigrants, fabricated attacks on him for supposedly voting against the auto bailout, and pushed the inaccurate idea that he supported market deregulation in 2000. They also went after him for being a “single issue” candidate and pushed the notion that he ran for Democrat just to get “media attention” for himself, like he was an egomaniac.\\nAt a Univision debate in March, a video clip of Sanders praising Cuban leader Fidel Castro was played. Clinton attacked Sanders over his remarks and used Cuban exiles in Florida to attack him for opposing U.S. imperialism in Cuba.\\nDespite all of those attacks, Sanders still appeared to do better than Trump in the polls and was ahead of Trump in a few state polls, where Clinton was behind Trump.\\nWhat’s most incredible about Eichenwald going off on Sanders supporters for “conspiracy theories” is the fact that he peddles and fabricates conspiracy theories in his work. For example, he published an entire piece claiming NSA whistleblower Edward Snowden acted as a Chinese spy because he told the Washington Post to publish documents on the same day the U.S. had a meeting with China about surveillance. He also pushed propaganda that Snowden left all the documents in Hong Kong.\\nEichenwald claims to have seen the “Republican playbook” for attacks on Sanders. They bear a striking similarity to attacks already pushed out to the public. Sanders was asked about a rape fantasy essay he wrote when he appeared on “Late Night with Seth Meyers.” He said, “It was bad fiction. I learned my lesson.” The Sanders campaign told the Washington Post it was a “dumb attempt at dark satire intended to attack gender stereotypes in the 1970s, and it looks as stupid today as it was then.”\\nThat Sanders “sponsored a bill to ship Vermont’s nuclear waste to a poor Hispanic community in Texas, where it could be dumped,” was an attack pushed by the David Brock-funded Blue Nation Review , and it was part of a viral graphic fact-checked by PolitiFact in September 2015. PolitiFact deemed it “ largely accurate .”\\nRepublicans may have enjoyed attacking him for his sympathy to the Sandinistas in Nicaragua, but Clinton tried the attack on him for his comments on Castro and that did not gain much traction outside Cuban exile communities in Florida. Simply, that kind of attack that hearkens back to the days of Ronald Reagan does not have much currency with the electorate these days.\\nA lot of these attacks Republicans planned to deploy were already peddled by Clinton. In that regard, whether they would have been effective is highly questionable.\\nThe next fan who encounters Eichenwald should probably run into him and knock his coffee over so it lightly burns his crotch because this sentiment is vile:\\nWhen Sanders promoted free college tuition—a primary part of his platform that attracted young people—that didn’t mean much for almost half of all Democrats, who don’t attend—or even plan to attend—plan to attend a secondary school. In fact, Sanders was basically telling the working poor and middle class who never planned to go beyond high school that college students—the people with even greater opportunities in life—were at the top of his priority list.\\nAsshole, they do not plan to go to college because they cannot afford it. He pushed for free college tuition so poor, working class, and middle class Americans could go to college without graduating in an ocean of debt. Once more, go fuck yourself, Kurt Eichenwald!\\nEichenwald is oblivious to the fact that Democrats may have deployed these Republican attacks or perhaps he does not care. Sanders supporters on Twitter have sent messages directed at him suggesting Sanders would have beat Trump and that is enough to piss him off and lead to this awful excuse for a political rant.\\nOf Course The DNC Should Have Backed Clinton Before Primary Ended Turning to the other myth, Eichenwald argues it was “stupid” for anyone to believe the Democratic National Committee had rigged the Democratic primary. He maintains that they do not have the power to do such a thing.\\nEichenwald cleverly crafts a frame that makes it easy to obscure political corruption that upset voters. What really happened is the DNC was a captive of the Clinton campaign that did everything the Clinton campaign wanted to serve its needs, even if that meant Sanders was put at a disadvantag e.\\nThe DNC and Clinton campaign falsely accused the Sanders campaign of “stealing” voter file data. The Hillary Victory Fund funneled millions of dollars through state parties to the DNC. Democratic women supporting Sanders faced forms of retaliation .\\nNearly half of superdelegates in the Democratic establishment lined up to support Clinton by July 2015, before a single vote was cast in a primary.\\nNow, Eichenwald makes a big to-do about the allegations that the debates were rigged without bothering to specifically mention the contents of a memo written by Clinton campaign chief administrative officer Charlie Baker in April 2015.\\nIt reads:\\nThrough internal discussions, we concluded that it was in our interest to: 1) limit the number of debates (and the number in each state); 2) start the debates as late as possible; 3) keep debates out of the busy window between February 1 and February 27, 2016 (Iowa to South Carolina); 4) create a schedule that would allow the later debates to be canceled if the race is for practical purposes over; 5) encourage an emphasis on local issues and local media participants in the debate formats; and 6) ensure a format that provides equal time for all candidates and does not give the moderator any discretion to focus on one candidate.\\nThe campaign mostly succeeded because from February 11 to March 6 there were no debates even though there were major primaries. Regardless of whether more debates were added to the schedule in 2016, it also worked with the DNC to fight Sanders’ efforts to schedule more debates.\\nEichenwald declares, “Once only one candidate can win the nomination, of course the DNC gets to work on that person’s behalf.” He contends after May 3 there was no chance Sanders would win. But before the primary, the DNC and Clinton campaign were coordinating on opposition research in preparation for a campaign against the Republican nominee. This is hugely alienating to the millions of Democratic voters, who do not support the corporate Democratic politics of Clinton, and had the DNC approached the election differently they may not have faced such discontent during the general election.\\nAs if all of the above weren’t enough, here is another reason to thrust your middle fingers in the air next time you see Eichenwald at an airport:\\nDebates cost money, and the more spent on debates, the less available for the nominee in the general election. Plus, there is a reasonable belief among political experts that allowing the nominees to tear each other down over and over undermines their chances in the general election, which is exactly what happened with the Republicans in 2012.\\nThis is quite anti-democratic. To Eichenwald, Democrats should not debate issues and defend their records in numerous debates, even though the election lasts for around 18 months, because it gives Republicans ammunition to attack the Democratic nominee. He also advocates against spending money on debates so it can go to a nominee that already benefits from side-stepping loopholes expanded by Citizens United . For that alone, I hope he gets stuck on an elevator with millennial Sanders supporters for hours but loses his voice and can’t chime in to lecture them.\\nEichenwald is not the only journalist with prejudice toward democracy. But let’s be clear: at minimum, all presidential candidates able to get a percentage of support in a national poll, qualify for federal matching funds, or get on enough state ballots to win the number of electoral votes needed to become president should have a right to run in elections in the United States.\\nYet, Eichenwald concludes, “If you didn’t vote for the only person who could defeat [Trump] and are now protesting a Trump presidency, may I suggest you shut up and go home. Adults now need to start fixing the damage you have done.”\\nFor all of the crass, sanctimonious, and self-righteous bullshit, because this is the kind of journalism we need to destroy, I say put your middle fingers proudly in the air and shout it loud. Go fuck yourself, Kurt Eichenwald!\\nThe post Go Fuck Yourself, Kurt Eichenwald! appeared first on Shadowproof .\\n'"}, "time": 1742562277.1148348}