{"duration": 0.1564314365386963, "input_args": {"text": "'US Sent Huge Weapons Shipments To Saudi Arabia Weeks Before Yemen Funeral Bombing Without U.S. support there’s no way Saudi coalition could wage the war at this level.” | October 28,   Members of the Higher Council for Civilian Community Organization inspect a destroyed funeral hall as they protest against a deadly Saudi-led airstrike on a funeral hall in Sanaa, Yemen, Thursday, Oct. 13, 2016. \\nPublished in partnership with Shadowproof . \\nThe United States shipped hundreds of millions of dollars in weapons to Saudi Arabia just weeks prior to the Saudi-led coalition’s funeral bombing in Sanaa, Yemen, according to a new analysis of U.S. government data conducted by Shadowproof. \\nThe October 8 bombing killed 140 and wounded over 500. It was widely condemned by human rights groups and exposed U.S. support for the Saudi-led war in Yemen to greater scrutiny. \\nIn response to a query from Shadowproof about the funeral strike, State Department spokesperson Frankie Sturm replied, “We have regularly expressed our concerns to the Saudi-led coalition, and urged them – as we have urged all sides, including the Houthis – to take all feasible measures to mitigate harm to civilians and civilian objects and return to a cessation of hostilities.” \\nDespite the US government’s purported desire for a “cessation of hostilities” and “concerns” for civilians, Shadowproof’s analysis shows that large quantities of U.S. weapons continue to flow to the Saudi government, impeding a sustained ceasefire and enabling civilian carnage. \\nIn July and August, the U.S. shipped Saudi $8.8 million in bombs, $47.3 million in parts for bombs, 313 guided missiles worth $26 million, one military helicopter worth $15.7 million, and 334 armored fighting vehicles and 19 armored vehicles, which together are worth over $197 million. \\nFrom April to July, when peace talks were active, the U.S. shipped $50 million in armored vehicles and $82 million in parts for bombs. Talks broke down in July and were followed by a major increase in coalition air assaults in Yemen. \\nFollowing the attack on a funeral, the U.S. government announced it was “ reviewing ” its support for the Saudi coalition; however, as of October 10 , there were no changes to U.S. military support for coalition operations. \\nA UN-brokered ceasefire implemented in April ushered in a major reduction in fighting. Yet, U.S. weapons shipments continued. \\nIn fact, over the course of President Barack Obama’s administration, it has approved a staggering $115 billion in weapons sales to Saudi Arabia—including a $1.29 billion sale in November 2015, which included over 19,000 bombs and a $1.15 billion sale of tank components, ammunition, and other weapons. \\nThe U.S. government has also provided logistical and intelligence support that has facilitated the Saudi coalition’s carnage. \\nGiven Saudi’s dependence on the U.S. government for military support, it is difficult to overstate the degree of influence the U.S possesses over the Saudi government. For example, Bruce Riedel, a senior fellow at the Brookings Institution said in April, “If the United States of America and the United Kingdom tonight told King Salman that this war has to end, it would end tomorrow.” \\nKristine Beckerle, who researches Yemen for Human Rights Watch, told Shadowproof, “The Saudi-led coalition’s air campaign in Yemen has been devastating for civilians, hitting marketplaces, factories, homes and hospitals. There is no question US weapons have been used in some of these unlawful attacks, including one of the most deadly. The US should be suspending arms sales to Saudi, until it not only curbs unlawful strikes but also credibly investigates those that have already occurred.” \\nA survey conducted by the Yemen Data Project found that, from the beginning of the Saudi coalition’s air campaign in Yemen in March 2015, through August of 2016, more than one-third of the coalition’s 8,600 strikes hit non-military targets. \\n“The coalition is responsible for twice as many civilian casualties as all other forces put together, virtually all as a result of air strikes,” UN human rights chief Zeid Ra’ad al-Hussein said back in March. \\nNasser Arrabyee, a journalist in Sanaa, told Shadowproof, “In the first weeks of the war the battle for Sanna was over, all the military sites were destroyed, yet the coalition strikes continue on a daily basis, often hitting civilians.” \\nThe U.S. government continues to insist the Saudi coalition isn’t intentionally targeting civilians, but Colette Gadenne, who heads Médecins Sans Frontières’ (MSF) Yemen mission told Shadowproof, “We’ve seen airstrikes hit civilian locations so often. For example, there was a strike on a crowded marketplace in Harad at 8 pm on July 4. It took place after people broke their Ramadan fast. And we only know about the strikes we see directly.” \\nThree MSF hospitals, one MSF mobile clinic, and an MSF ambulance were attacked by coalition forces. \\nAfter the funeral attack, images appeared on social media allegedly showing fragments of a U.S-supplied tail fin for a JDAM guidance kit for a U.S-made Mark 82 500 lb. bomb. \\nAli Al-Ahmed, an expert on Saudi Arabia at the Institute for Gulf Affairs and himself a Saudi, told Shadowproof the Saudis indeed target civilians. \\n“They couldn’t defeat [the Houthis] on the battlefield so they’re killing women and children, bombing schools, to get that result,” Ahmed explained. \\nBack in 2010, U.S. Army whistleblower Chelsea Manning disclosed a State Department cable from the same year that showed the U.S. government provided “imagery” of the Yemen border to the Saudi government, despite evidence Saudi aircraft were attacking civilians when attacking Houthis in northern Yemen. Assistant Minister of Defense and Aviation Prince Khaled bin Sultan appealed to a U.S. ambassador to give them a Predator drone to help limit civilian casualties. \\nAnother cable from 2009 that was also disclosed by Manning shows the U.S. government approved military assistance for Saudi Arabia or Yemen if aid was not used against Houthis. Since then, the U.S. government has allowed the Saudi Kingdom to pull them into an open-ended war. \\nWith regard to al Qaida, Ahmed noted, “Hundreds of Saudi jets and their allies bombing Yemeni forces have avoided bombing…positions in Yemen of al Qaida.” \\n“The Saudi air force is really becoming the air force for al-Qaida,” Ahmed said. “The Saudi bombings have helped mostly one group: al-Qaida.” \\nAhmed also stressed the bombings fuel “anti-Americanism.” Prior to the war, the Yemeni government cooperated closely with the U.S. in counterterrorism matters. \\nIn a letter to President Obama, 36 members of congress urged him to block the $1.15 billion arms deal announced in August. The letter stated, “Amnesty International has documented at least 33 unlawful airstrikes by the Saudi Arabia-led coalition across Yemen that appear to have deliberately targeted civilians and civilians facilities, such as hospitals, schools, markets, and places of worship. These attacks may amount to war crimes.” \\nAccording to a recent report by Reuters, the coalition has hit sites the U.S. government put on a “do not strike” list. The U.S. designated these locations as being vital infrastructure for delivery of food aid and for post-war reconstruction. \\nThe Saudi coalition declared as a target the entire Saada Governorate (measuring 4,000 square miles), which borders Saudi Arabia. It also reportedly used incendiary weapons, white phosphorous, as well as cluster weapons, which are banned by most countries. \\nBoth of these weapons were supplied by the U.S. \\nThe war’s effect on civilians in Yemen is enormous. “The jets overhead scare the children. There is no place people can go to be safe, even hospitals are hit in strikes. The population is traumatized,” Gadenne said. \\nMore than 10,000 civilians have been killed since the Saudi-led coalition began, including more than 1,000 children. More than 80 percent of the population now requires some form of humanitarian assistance for survival. \\nBeatriz Ochoa from Save the Children told Shadowproof, “The number of children that are severely malnourished has doubled to 370,000 since the beginning of the coalition bombing. 1.6 million women and children under 5 are suffering from acute malnutrition with over 14 million, or roughly half of Yemen’s population, are considered food insecure.” \\nThe coalition imposed a blockade, which has resulted in shortages of medicine and food, as well as price spikes and hoarding of goods. \\nRecently, there was a reported cholera outbreak, which may exacerbate the already dangerous health crisis. \\nAnother serious concern is unexploded ordnance. “A 16-year-old girl was collecting firewood in Sadaa, and there had been an air strike in the area 3 months prior. An unexploded ordnance went off and she lost a leg,” Gadenne recalled. \\nMs. Gadenne said MSF has seen victims from unexploded ordnance all over the country. Research from Amnesty International found thousands of unexploded munitions in northern Yemen, following a 10-day tour of the region earlier this year. \\nThe dire humanitarian crisis resulting from the war has given rise to a great deal of anger in Yemen, according to Arrabyee. “Yemenis see the war as an American war, as the coalition couldn’t carry out the strikes in Yemen without U.S. support. There is a big campaign saying Americans are the ones killing the Yemenis people.” \\nWilliam Hartung from the Center for International Policy told Shadowproof the U.S. is directly involved in Yemen, even if it’s not the one dropping the bombs. \\n“Without U.S. support there’s no way Saudi coalition could wage the war at this level,” Hartung said. “The large weapons deals and mid-flight refueling provided by the U.S. play an important role in Saudi’s ability to conduct strikes in Yemen.” Be Sociable, Share!'"}, "time": 1742563190.563658}