{"duration": 0.04319143295288086, "input_args": {"text": "'In a video message to young Catholics throughout the world, Pope Francis proposed the Virgin Mary as a model of active Christian discipleship, noting that she was no passive “couch potato. ”[The Vatican released the video message on Tuesday in preparation for the next World Youth Day, to be held in Panama in 2019.  The Virgin Mary, Francis said, “encourages us with her faith,” when she acknowledged that the “Mighty One has done great things for me. ” She also “knew how to give thanks to God who looked upon her littleness,” he said, and “recognised the great things that God was accomplishing in her life. ” Importantly, the Pope noted, Mary did not sit by idly but “set off to visit her cousin Elizabeth who was old and needed her to be close by. ” “Mary did not stay at home because she was not a young couch potato who looks for comfort and safety where nobody can bother them,” Francis said. “She was moved by faith because faith is at the heart of Our Mother’s entire life story. ” In his message, the Pope told young people that God is watching over and calling them, looking at all the love they are able to offer. “Like the young woman of Nazareth,” he said, “you can improve the world and leave an imprint that makes a mark on history —  your history and that of many others. ” “The Church and society need you,” he added. “With your plans and with your courage, with your dreams and ideals, walls of stagnation fall and roads open up that lead us to a better, fairer, less cruel and more humane world. ” The Pope also encouraged young people to cultivate a relationship of familiarity and friendship with Mary as “our Mother,” urging them to speak to her “as you would to a Mother. ” “Together with her,” he said, “give thanks for the precious gift of faith that you have received from your elders, and entrust your whole life to her. She is a good Mother who listens to you and embraces you, who loves you and walks together with you. ” “I assure you that if you do that, you will not regret it,” he said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742564600.1855354}