{"duration": 0.1305844783782959, "input_args": {"text": "\"By Arun Gupta / inthesetimes.com \\nThe reckoning is here for progressives and the Democratic Party now that the unthinkable has happened. Most of America, shell-shocked, is asking how Hillary Clinton and the entire Democratic establishment could lose to a woman-bashing, Mexican-deporting, Muslim-hating, white-supremacist-embracing charlatan? \\nSimple. Trump captured the historical mood with his message of white nationalism and economic populism. Then he threaded an electoral college needle against an atrocious candidate. Clinton has a lead in the roughly 120 million votes cast for the two major-party candidates, while Trump essentially won with some 107,000 votes. That’s his combined margin in Wisconsin, Michigan, and Pennsylvania. \\nClinton failed to defend firewall states like Michigan and Wisconsin, devoting huge resources to insurance states like Florida and Ohio. But here is why she really lost: Clinton had close to 9 million fewer votes than Barack Obama did in 2008, and roughly 5 million fewer votes than he did in 2012. There’s no getting around the fact that much of the Democratic base repudiated Clinton. \\nIt is tempting to say Trump won because of FBI Director James Comey’s outrageous letter 11 days before the election that re-opened the email investigation. Nate Silver, one of the few forecasters who gave Trump a significant chance of winning, suggested Comey may have cost Clinton up to 3 points . That additional margin could have helped hand Clinton a decisive win. And if that happened, there would be no soul searching about an angry white revolt against elites. \\nBut Comey never told Clinton to set up a private email server. Just like WikiLeaks never told Clinton to deliver secret speeches to investment banks. “Crooked Hillary” stuck because of the Clintons’ own doings: the emails, their foundation, $22 million in speaking fees, two-faced policy positions. The primaries were a flashing red light warning of these troubles. Bernie Sanders posed a serious challenge to Clinton despite her backing by the entire party establishment. Even then, if she had tapped Sanders to be her running mate, she might have won because of his appeal among millennials. \\nBut instead of tending to the Democratic base demanding single-payer health care, a Green New Deal and free higher education, Clinton veered right with a Democratic National Convention espousing militarism, American exceptionalism and God. This strategy blew up in Clinton’s face. More Democrats voted for Trump than Republicans voted for Clinton . \\nPlus, Clinton would never pick a social democrat like Sanders because she is neoliberal to the bone. During the 1990s the Clintons erected much of the scaffolding of neoliberalism with NAFTA, the repeal of Glass-Steagall , the Commodity Futures Modernization Act , the media-monopoly-creating Telecommunications Act , ending welfare and passing laws for the mass deportation of immigrants. \\nThe Clintons kicked off a run during which Democrats have owned the White House for 16 of the last 24 years. Instead of countering the Republicans, they have battered the working class—white, brown, Black—who watched as businesses shuttered and communities shriveled. Obama failed to help workers in a meaningful way despite his resounding mandate. He spent his political capital to save Wall Street and design a health care system more beneficial to the for-profit industry than its patients. \\nMeanwhile, millions lost their homes, sank into joblessness and descended into poverty. People of color generally realize the Republicans were much more hostile to their interests so they stick with the Democrats. But white workers outside a shrinking labor movement didn’t see either party as particularly hospitable to their interests. \\nThat gave Trump an opening. He radically transformed the GOP in a year, turning it into an anti-free trade and anti-interventionist party reluctant to cut retirement programs. His trick was to stoke the right’s racism and misogyny, which is now being portrayed as a regular Joe backlash against arrogant coastal elites. \\nThe racism directed toward Obama helped to form Trump’s foundation, especially the Tea Party and birtherism. But Trumpism is a fluid identity. Obama won Indiana in 2008, a state that was about 84 percent white then, and performed better among nearly every subgroup of whites in his two victories than Clinton did in 2016 . In fact, according to The New York Times’ Nate Cohn , “Clinton suffered her biggest losses in the places where Obama was strongest among white voters. It's not a simple racism story.” \\nThat is true. It is racism, but it’s not simple. Trump took workers’ social and economic ills produced as much by Democrats as by Republicans, and he fed them through a racial grinder to make his alt-white sausage. He created an identity that a majority of the white working class and middle class flocked to. It is racist, but it’s not fixed. And much of this failure to retain a majority of the white working class in the Democratic Party lays with organized labor, which does little organizing beyond get-out-the-vote and contract negotiation campaigns. \\nUnions have the resources to painstakingly win workers of all stripes over to social-democratic policies. But for that to happen, organized left forces need to push labor hard. As shown by WikiLeaks , many prominent labor leaders suck up to pro-Wall Street Democrats and sideline policies that would show workers government can be a force for good, and not fear, in their lives. And in this election, Clinton held a slim 8-point advantage among voters from a union household. In Ohio, CNN exit polls showed Clinton losing union households by a 12-point margin , a larger margin than she lost non-union households. This is a clear lesson to unions that they have not been listening to their members. \\nTrump’s victory is a declaration of a social civil war. We know what many of these battles will be, and it’s going to be a dark four years. But just as the Republican Party has been upended, so have the Democrats. The task ahead is to defend those communities and people most at risk from Trumpism, build power where the left does have real potential—cities of all sizes and deep-blue states—and focus on organizing principled, inclusive radical movements that can shift the entire political terrain rather than uselessly pouring energy into the black hole of the Democratic Party. \\nARUN GUPTA is a graduate of the French Culinary Institute in New York and has written for dozens of publications including the Washington Post , the Nation , The Progressive , Telesur English , and the Guardian . He is the author of the upcoming Bacon as a Weapon of Mass Destruction: A Junk-Food-Loving Chef’s Inquiry into Taste (The New Press). 0.0 ·\""}, "time": 1742562500.711758}