{"duration": 0.04262590408325195, "input_args": {"text": "'Charts Indicate Now May Be an Excellent Entry Point For Silver Posted on Tweet Home » Silver » Silver News » Charts Indicate Now May Be an Excellent Entry Point For Silver Calling an end to the correction in silver is tricky, but technical analyst Clive Maund sees an intermediate base forming for silver stocks, a “classic buy spot.” Submitted by Streetwise : \\nAlthough at first glance it’s a tricky call, because superficially a bear flag appears to be completing in silver, on closer inspection it now looks like silver’s correction is done and an intermediate base pattern is completing . If so, we are at an excellent entry point for many silver stocks, which have been savagely beaten down over the past several months—a necessary correction following their outsized run-up earlier in the year. \\nOn its one-year chart we can see that silver’s corrective action from early July has brought it all the way back to its steadily rising 200-day moving average, a classic buy spot, where a potential intermediate base has formed. This corrective action has more than completely unwound the earlier overbought condition. \\nHowever, there are grounds for concern on two counts. One is that the steep drop early in October broke the price below the uptrend line shown, and the other is that the pattern that has since formed looks very much like a bear flag at first glance. If it is, another sharp drop will follow soon. \\nThus, it is interesting to observe that the volume pattern is not consistent with this being a bear flag. Instead, it is consistent with this being an intermediate base pattern. To properly examine the volume pattern in this sideways formation, we need to refer to a three-month chart, which opens it out sufficiently to see what is going on in detail. \\nBuy 2017 30 gram Gold Pandas and Buy 2017 Silver Panda Coins On Pre-Sale Now! Secure Your 2017 Panda Coins Today at SD Bullion! \\nOn the three-month chart, we can see in detail the tight pattern that has developed following the sharp drop early in October. It looks like a bear flag until you look at the volume. Instead of a volume pattern consistent with a bear flag, which would feature greater downside volume days than upside volume, and a steady trend to lighter volume, we have the exact opposite over the past couple of weeks—greater upside volume days and a trend of increasing volume. To steal a term from Infowars or Zero Hedge, this suggests a “false flag” that will lead to an upside breakout. \\nOn silver’s seven-year chart we can see the 2011–2015 bear market in its entirety, and how breakout from the major downtrend channel led to a not-particularly impressive rally up to important resistance, where the advance stalled out and reaction set in. The relative feebleness of the rally following the breakout from the downtrend is not a cause for concern, as in the early stages of a bull market gold tends to outperform silver—and it certainly didn’t bother silver stocks any. Silver’s next major upleg should take it above this resistance, albeit perhaps after something of a battle, and then on toward the next important resistance level in the $26–27 zone. \\nAlthough silver’s long-term, 20-year chart presents a more messy picture than gold’s 20-year chart, it does also show that the 2011 bear market may be viewed as a big correction to the major bull market advance from late 2001, as is the case with gold. Unlike gold’s corrective bear market, which stopped at a major support level related to an extensive period of trading in 2008–2009, silver dropped down through its corresponding support level on its corrective bear market, and found support at a lower level related to an extensive period of trading in 2006–2007. All of this does mean that, so far, silver has been underperforming gold. \\nClive Maund has been president of www.clivemaund.com, a successful resource sector website, since its inception in 2003. He has 30 years’ experience in technical analysis and has worked for banks, commodity brokers and stockbrokers in the City of London. He holds a Diploma in Technical Analysis from the UK Society of Technical Analysts. Want to read more Gold Report articles like this? Sign up for our free e-newsletter, and you’ll learn when new articles have been published. To see recent articles and interviews with industry analysts and commentators, visit our Streetwise Interviews page. This entry was posted in Gold News , Silver News and tagged Clive Maund , gold update , silver update . Bookmark the permalink . Post navigation'"}, "time": 1742628607.4386375}