{"duration": 0.08747053146362305, "input_args": {"text": "\"It’s our go to response. When the lights are out and the floorboard creaks. When a branch taps a slow waltz against the window pane and our hackles dance a primordial shimmy, we ask the question. The oldest question. “Is there anyone there?” \\nTurns out, the answer is yes. Not The Alien Contact We Expected \\nIt was a little thing really. Giant leap for mankind moments often are. There were no ships hovering over national landmarks, no grainy footage of aliens being dissected on steel-gray slabs. No ‘take me to your leader moments’ at all. \\nNo, our first potentially legitimate brush with alien intelligence came as one might expect; from the nocturnal laboring of two dedicated scientists. \\nIt was the kind of science you don’t get to see. The methodical pace, the slow transition from hypothesis to data that is the hallmark of good research. The pair painstakingly surveyed a patch of sky simply because it was in need of surveying. They examined some 2.5 million stars, and in doing so, E.F. Borra and E. Trottie of Quebec’s Laval University might have made the single most important discovery in human history. \\nYou see, while the vast majority of the stars they examined were acting in exactly the way they had expected, a tiny fraction of them – 234 in total – were not. \\nThey were exhibiting bizarre modulations that defied easy explanation; they could not be attributed to any known natural phenomena. Indeed, they didn’t look natural at all. \\nThey looked like someone, or rather something, was attempting to communicate with us. \\nLike, for real. \\nBecause these were the kind of signals that one might expect an extraterrestrial intelligence (ETI) to use if they were attempting to communicate with us. they were using the oldest known method of attracting attention in the dark \\nThey were shining a light at us. Great Expectations \\nIn a study published in 2012, Borra had proposed this very approach. He wrote : “Consider an extraterrestrial civilization that is more advanced than ours. Let us assume that they want to signal their existence to other civilizations. This is not an easy task considering how vast the universe is. The best chance of being seen is by being accidentally detected during astronomical observations. They know, on the basis of their own experience, that a scientifically advanced civilization observes the sky and takes spectra of astronomical objects. In particular, spectroscopic surveys are carried out.” \\nThese surveys would inevitably reveal the very same modulations that the two Canadian scientists just discovered. Utterly dissimilar to the usual background ‘noise’ of the universe, once detected, they would warrant further investigation. Like ships sailing on a pitch black sea, an alert lookout could easily differentiate between the naturally occurring light flashes of reflected moonbeams or distant lightning, from the frantic signalling of a nearby vessel. \\nAt least, that’s the theory. \\nStill, there was yet more compelling evidence that this was indeed an attempt at communication. \\nThe 234 stars in Borra and Trottier’s study all had one thing in common. The modulations all came from stars very much like our own Sun, the only star that we know for certain harbors intelligent life. Phone Home? \\nThe most obvious answer is that we need to dig deeper; as Borra acknowledged: “ Extraordinary claims require extraordinary evidence .” \\nThe need for further research notwithstanding, a very real question needs to be explored. Could we, and indeed should we, attempt to communicate back? \\nThe practical considerations are not insignificant. The signal device, a powerful laser of some kind, could be based on Earth but would have to shine its beam to a space station that contained mirrors capable of redirecting the light to the targets. \\nSuch a station would have to be sent on a long lonely voyage of around 614 astronomical units or about 20 times further than Pluto, something Barros described as being : “Not an overwhelmingly large distance.” \\nIndeed the distance the mirror would have to be placed would scale with he distance of the civilization we were trying to contact. Using an existing technology known as a solar sail we could : “Reach Pluto in 5 years. For an ETI at a 100 lt-yr distance from Earth, the (mirror’s) location would thus be reached within 10 years. \\nAn attempt to reach a civilization even further away would of course take longer, perhaps a century or more and whilst Barro admitted that: “This is a long time.” \\nHe remained adamant that it was not : “…Overwhelmingly so, considering that the ETI civilization may be thousands of years older than ours.” \\nHumanity then, is on the cusp of being able to send similar signals ourselves. But should we? This Island Earth \\nAccording the Professor Stephen Hawking, it might not be such a good idea. While he is convinced that we are not alone in the universe he cautioned that : “We should be wary of answering back.” \\nIn Hawking’s view, a meeting between two civilizations would resemble Christopher Columbus’ historic meeting of Native Americans. \\nSomething that he noted : “Didn’t turn out so well.” \\nStill, whether we chose to respond or not remains peripheral to the sheer magnitude of the discovery. That intelligent alien life is not only out there but that they are trying to say hello. If true, it points to a universality of at least one pervasive human emotion. \\nCuriosity. \\nIt’s still not definite; it’s still only a ‘probably,’ but we’ve never been closer to a possible answer. It would be nice to finally know for sure. After all, we’ve been wondering for so long. \\nAs the Epicurean philosopher and poet Lucretius once said : “Nothing in the universe is unique and alone and therefore in other regions there must be other earths inhabited by different tribes of men and breeds of beasts.” \\nYeah, there must be. \\nWatch the teams proposal as to where the light pulses are coming from here: \\nFeatured Image By Beckie Via Flickr/ CC-2.0 About Grownmangrumbles \\nI'm a full- time, somewhat unwilling resident of the planet Earth. I studied journalism at Murdoch University in West Australia and moved back to the UK where I taught politics and studied for a PhD. I've written a number of books on political philosophy that are mostly of interest to scholars. I'm also a seasoned travel writer so I get to stay in fancy hotels for free. I have a pet Lizard called Rousseau. We have only the most cursory of respect for one another. Connect\""}, "time": 1742628306.434731}