{"duration": 0.08065104484558105, "input_args": {"text": "'TEL AVIV  —   President Donald Trump’s inauguration rabbi criticized the president and his administration for its seeming reticence to clarify its position on Israel’s sovereignty over Jerusalem, but added that he was confident the president would erase all doubts once he arrives in Israel next week. [Speaking to the Algemeiner on Tuesday, Rabbi Marvin Hier  —   the founder and dean of the Simon Wiesenthal Center (SWC) in Los Angeles  —   said he believes Trump will reaffirm his stance that “Jerusalem is the eternal capital of Israel. ”  “Trump is not going to let it stand that the Kotel (Western Wall) is going to be under the sovereignty of another nation, or that it’ll be ‘internationalized,’ as the Vatican would like,” Hier said. “Those are unworkable suggestions that are never going to be agreed upon by the State of Israel. Trump has made it clear on so many occasions that Jerusalem is the eternal capital of Israel, so it would be quite a reversal for him to state differently on this occasion. ” Hier’s remarks came after a press briefing earlier in the day by Trump’s National Security Adviser H. R. McMaster, who declined to give direct answers when pressed as to whether the U. S. regards the Western Wall as part of Israel. McMaster only said that the matter was a “policy decision. ” On Tuesday, White House Spokesman Sean Spicer affirmed that the holy site is “clearly in Jerusalem. ” The debate swirling around the Trump administration’s position on Israel intensified in recent days when it was revealed that a senior member of the U. S. delegation reportedly angrily shouted at his Israeli counterpart that the Western Wall was “part of the West Bank. ” However, it later emerged that the official was David Berns, a political counselor at the U. S. Consulate in Jerusalem who took up the role during the Obama administration. Later that day, the White House said that Bern’s position did not reflect that of the administration or the president. On Tuesday, McMaster confirmed that Prime Minister Benjamin Netanyahu’s request to accompany the president on his visit to the Western Wall would not be fulfilled, stating that “no Israeli leaders” would be joining the president. Even though Trump will be the first sitting president to go to the Western Wall, the White House said it would be in the framework of “a private visit. ” The Western Wall, together with the Temple Mount complex and the eastern part of Jerusalem, was captured during the 1967 Six Day War. Its final status has not been agreed on by the international community, which views it as a core issue in the conflict with the Palestinians. “The notion that there is a question as to whom the Kotel (Western Wall) belongs to is just preposterous,” Hier said. “This is an unnecessary blunder on the part of, firstly,   officials, and then McMaster. To leave open the suggestion that the sovereignty of the Kotel is attached to the West Bank is just   to me. ” Hier repeated his belief that Trump would clarify matters after he arrived in the country. “When President Trump arrives in Israel, I don’t think there will be any doubt over who has title over the Kotel,” he told the Algemeiner. Also on Tuesday, a senior U. S. official said Trump still intends to fulfill his campaign promise of relocation. “We’ll move the embassy, just give us time,” the official was quoted as saying.'"}, "time": 1742564137.4298744}