{"duration": 0.07527422904968262, "input_args": {"text": "'0 Add Comment \\nWITH 400 schools shut and 200,000 students not attending lessons, striking teachers have provided children with an insight into what their life will be like on the dole after they leave school. \\n“It obviously wasn’t the ASTI’s intention, but it’s an interesting lesson for my three lads, sitting around on the couch, bored out of their holes thinking ‘is this it? Is this all I can do?’ That’s basically the dole like. Things being largely out of your control. Good to get training in early,” shared concerned parent Olwyn Nelligan. \\nAs youth unemployment remains worryingly high in Ireland at over 15%, teachers striking for better pay have inadvertently given their students a window into what life will be like post-second level education for many of them as despite being keen to learn and further themselves all they have is free time on their hands. \\n“Teachers are striking for better pay, and if they were granted it, it would could serve as a way for the government to show it cares about education standards in Ireland and those who provide it,” explained one teacher on strike, pleading with the government to show the education sector the respect it deserves. \\nA government spokesman did respond when we put the teacher’s concerns to them earlier today. \\n“We. Don’t. Care. I thought that was pretty obvious. Have you not being paying attention to our policies for the last few years at all?” the spokesman responded. \\n“Having said that teachers are the rock bed of the foundation of the first steps of a child’s life, blah, blah, blah,” the spokesman added. \\nThe government refused to comment on ongoing funding concerns with several IT colleges, or lengthy waiting lists for third level students wishing to access counselling services. \\nSome 99% of the country was backing the ASTI’s bid to be paid for supervision work until they learned it may require an increase in their taxes in order to fund it.'"}, "time": 1742563756.3549323}