{"duration": 0.09190940856933594, "input_args": {"text": "'NEWPORT NEWS, Va.  —   President Trump on Thursday used the country’s most advanced,   aircraft carrier as the    backdrop for his push to rebuild America’s armed forces with a $54 billion increase in military spending. Speaking in the hangar bay of the   Gerald R. Ford, which this year will become the nation’s largest and most powerful warship, Mr. Trump said the Navy  —   and other military services  —   must grow and modernize. “We will make it easier for the Navy to plan for the future and thus to control costs and get the best deals for the taxpayer,” the president said. “The same boat for less money, the same ship for less money, the same airplanes for less money. ” Ever the showman, Mr. Trump arrived on the carrier in dramatic style, landing on the flight deck aboard his helicopter, Marine One. He emerged with a sharp salute and wearing his trademark red Make America Great Again baseball cap. One deck below, watching on large screens, hundreds of sailors and others let up a huge cheer for the commander in chief. After touring the ship, the president was lowered to the hangar bay on the massive elevator that carries fighter jets between the decks. To the sounds of Lee Greenwood’s “God Bless the U. S. A. ,” Mr. Trump strode into the crowd  —   wearing a Gerald R. Ford baseball cap. Mr. Trump marveled at the ship’s size, calling it “4. 5 acres of combat power and sovereign U. S. territory, the likes of which there is nothing to compete. ” “It is a monument to American might that will provide the strength necessary to ensure peace,” he said. The Ford is the first of a new, more technologically advanced class of aircraft carrier, and cost about $13 billion to build after cost overruns and years of delay. But Mr. Trump did not mention those challenges, saying instead that he supports expanding to a   Navy, from the current 10. He said ships like the Ford will allow him and future presidents to project American power in distant lands. “Hopefully it’s power we don’t have to use. But if we do, they are in big, big trouble,” he said to cheers from the sailors. Mr. Trump asserted, as he did during the presidential campaign, that the Navy is now the smallest it has been since World War I. The Navy swelled from 245 ships in 1916 to a peak of over 6, 000 during World War II, downsizing between conflicts and bulking up during the Korean and Vietnam Wars. From the 1970s, the Navy gradually began to shrink to a total battle force of 275 ships as of September 2016. But that fleet includes 10 aircraft carriers, 22 cruisers, 63 destroyers, 11 amphibious assault ships and 68 submarines, 14 of which are armed with nuclear warheads. These are far more powerful than the fleets of World War II. So comparing the navies of the past and today is “like comparing the telegraph to the smartphone they’re just not comparable,” Ray Mabus, the secretary of the Navy under President Barack Obama, said in 2012. Lawmakers in both parties have already expressed deep skepticism about Mr. Trump’s military spending proposal, in part because of its potential to increase the nation’s deficit and in part because of the administration’s assertion that it would deeply slash nonmilitary spending to compensate. But the president’s desire to expand the military was a core promise during his campaign for the White House. American politicians often seek to associate themselves with the country’s enormous, gleaming war machines. Mitt Romney, the 2012 Republican presidential candidate, announced his choice of Speaker Paul D. Ryan as his running mate on the retired battleship Wisconsin. But sometimes the moment goes awry. In 2003, President George W. Bush stood on the deck of the aircraft carrier Abraham Lincoln to declare that the military phase of the Iraq war was over. He spoke in front of a banner that proclaimed “Mission Accomplished. ” The war continued for years. Aides to Mr. Trump are hoping that the images of the president on the Ford are more positive.'"}, "time": 1742563535.8353634}