{"duration": 0.07715773582458496, "input_args": {"text": "'in Climate Change — by Nadia Prupis — November 15, 2016 The researchers say 82 percent of “core ecological processes” on land and sea have been affected by climate change in a way that has not been expected “for decades.” (Photo: Lwp Kommunikáció/flickr/cc) \\nClimate change is already affecting life on Earth, despite a global temperature increase of just 1°C, according to a new study published in the journal Science on Friday. \\nNearly every ecosystem on the planet is being altered, and plants and animals are being so affected that scientists may soon be forced to intervene to create “human-assisted evolution,” the study, titled The Broad Footprint of Climate Change from Genes to Biomes to People , found. \\nThe researchers say 82 percent of “core ecological processes” on land and sea have been affected by climate change in a way that had not been expected “for decades.” \\nCo-author and professor John Pandolfi of the University of Queensland said , “Temperature extremes are causing evolutionary adaption in many species, changing them genetically and physically. These responses include changes in tolerances to high temperatures, shifts in sex-ratios, reduced body size, and migration of species.” \\n“Understanding the extent to which these goods and services have been impacted allows humans to plan and adapt to changing ecosystem conditions,” he said. \\nDr. James Watson, associate professor of planning and environmental management at UQ’s School of Geography, added, “We are simply astonished at the level of change we observed which many of us in the scientific community did not expect to see for decades.” \\nThe changes have manifested in some species shifting to higher or lower ground as the planet heats up, while others are becoming smaller, “as a higher surface-area-to-body-mass ratio makes it easier to stay cool,” the Independent reported . The outlet wrote: \\nFor example, six species of woodland salamander in the Appalachian Mountains have undergone an average eight per cent reduction in body size over the past 50 years. \\nSlightly smaller lizards might not sound like something to overly concern humans, but there is evidence this response is also affecting important sources of food. \\n“These multi-level biological impacts of climate change will affect humans. Increasing disease outbreaks, inconsistent crop yields, and reduced fisheries productivity all threaten our food security,” said co-author Dr. Tom Bridge. \\nAverage global temperatures have risen 1°C since the industrial era. The study states that this has “already had broad and worrying impacts on natural systems, with accumulating consequences for people. Minimizing the impacts of climate change on core ecological processes must now be a key policy priority for all nations.” \\nThe study called on governments to follow through on the promises made in the Paris climate agreement , which aims to keep global warming below a 1.5°C threshold—although an increasing amount of scientists are sounding the alarm that even those pledges may be too little, too late. \\n“Time is running out for a globally synchronized response to climate change that integrates adequate protection of biodiversity and ecosystem services,” the study continued. \\n“It is no longer sensible to consider this as a concern for the future—if we don’t act quickly to curb emissions it is likely that every ecosystem across Earth will fundamentally change in our lifetimes,” said Dr. Watson. This work is licensed under a Creative Commons Attribution-Share Alike 3.0 License Share this:'"}, "time": 1742563158.7746673}