{"duration": 0.0714561939239502, "input_args": {"text": "'Clintons Are Under Multiple FBI Investigations as Agents Are Stymied   Source: Wall street on parade \\nDisgraced Former Congressman Anthony Weiner and His Wife, Longtime Hillary Clinton Aide, Huma Abedin \\nCurrent and former FBI officials have launched a media counter-offensive to engage head to head with the Clinton media machine and to throw off the shackles the Loretta Lynch Justice Department has used to stymie their multiple investigations into the Clinton pay-to-play network. \\nOver the past weekend, former FBI Assistant Director and current CNN Senior Law Enforcement Analyst Tom Fuentes told viewers that “the FBI has an intensive investigation ongoing into the Clinton Foundation.” He said he had received this information from “senior officials” at the FBI, “several of them, in and out of the Bureau.” (See video clip from CNN below.) \\nThat information was further supported by an in-depth article last evening in the Wall Street Journal by Devlin Barrett. According to Barrett, the “probe of the foundation began more than a year ago to determine whether financial crimes or influence peddling occurred related to the charity.” Barrett’s article suggests that the Justice Department, which oversees the FBI, has attempted to circumvent the investigation. The new revelations lead to the appearance of wrongdoing on the part of U.S. Attorney General Loretta Lynch for secretly meeting with Bill Clinton on her plane on the tarmac of Phoenix Sky Harbor International Airport on the evening of June 28 of this year. Not only was Bill Clinton’s wife under an FBI investigation at the time over her use of a private email server in the basement of her New York home over which Top Secret material was transmitted while she was Secretary of State but his own charitable foundation was also under investigation, a fact that was unknown at the time to the public and the media. \\nThe reports leaking out of the FBI over the weekend came on the heels of FBI Director James Comey sending a letter to members of Congress on Friday acknowledging that the investigation into the Hillary Clinton email server was not closed as he had previously testified to Congress, but had been reopened as a result of “pertinent” emails turning up. According to multiple media sources, those emails were found on the laptop of Anthony Weiner, estranged husband of Hillary Clinton’s longtime aide, Huma Abedin. \\nWeiner was forced to resign from Congress in 2011 over a sexting scandal with more sexting scandals to follow . Early this month, on October 3, the FBI raided Weiner’s apartment in New York with a search warrant in hand and seized multiple electronic devices. At least one of those devices had been used by both Weiner and Abedin to send email messages. The search warrant had been obtained following a detailed report that had appeared in the Daily Mail newspaper in the U.K. in September, showing sordid, sexual emails that Weiner had allegedly sent to a 15-year old girl in North Carolina. According to the content of the published emails, Weiner was aware that the girl was underage.'"}, "time": 1742562030.2154367}