{"duration": 0.03148531913757324, "input_args": {"text": "'Panic Grips Italy Residents : Strong Earthquakes October 27, 2016 An officer of the State Forestry Corp national police stands in front of a collapsed church in Campi di Norcia, central Italy, October 27, 2016. \\nThree earthquakes paralyzed Italy\\'s Umbria, Marche and Lazio regions throughout the night. Residents express unshakable fear. The series of earthquakes comes just two months after hundreds were killed by another one nearby. Many residents of Campi, a town of about 200, slept in their cars as aftershocks rocked the region. First tremor measured magnitude of 5.4, second at 6.1 and third one 4.9, aftershock came a couple hours after that, and dozens of weaker ones followed. Officials say that the first tremor served as a serious warning and residents fled their homes. \\n(CAMPI, ITALY) After the night came daylight revealing widespread damage in central Italy on Thursday after strong earthquakes overnight caused panic and fear among residents just two months after a quake nearby killed hundreds. No one was killed this time, but dozens of people sustained minor injuries and about four others more serious ones, Italy\\'s Civil Protection Agency said. \\nMany residents of Campi, a town of about 200, slept in their cars as aftershocks rocked the Umbria, Marche and Lazio regions throughout the night. The earthquake on Aug. 24 in the same area killed nearly 300 people and destroyed several towns. \\n\"I can\\'t shake off the fear,\" said Mauro Viola, 64, who said he had not sleep and had spent the night outside. \\nPolice had blocked off the road to his home with a park bench, and Viola said a chapel beyond his house had collapsed. \\nThe three quakes, about two hours apart, damaged several buildings, including Campi\\'s late 14th century church, San Salvatore a Campi di Norcia, whose rose-windowed facade was reduced to rubble. The quakes were probably a result of August\\'s seismic break, Massimiliano Cocco from Italy\\'s National Institute of Geophysics and Vulcanology told the Corriere della Sera newspaper. \\nThe first tremor measured magnitude 5.4, causing many people to flee their homes and the second was stronger at 6.1 magnitude. A 4.9 aftershock came a couple hours after that, and dozens of weaker ones followed. Rescue workers set up some 50 beds in a quake-proof building for people who could not sleep in their homes. \\n\"The first tremor damaged buildings, with the second one we had collapses,\" fire department official, Rosario Meduri, said. \\nHe had come from southern Italy before Wednesday\\'s tremors to help secure structures damaged by the August earthquake that hit some 50 km (30 miles) to the south. \\nWhile massive boulders that tumbled down the valley had yet to be cleared from the roads, on the whole there was a sense of relief. \\nThe fact that the first earthquake was weaker than the second probably helped save lives because most people had already left their homes, Interior Minister Angelino Alfano said on state radio. \\nHe also said that a decree now being voted on by parliament to pay for the immediate costs of the August tremor could be extended to cover the latest series of quakes. \\nContributed by Reuters.'"}, "time": 1742628511.5032914}