{"duration": 0.1309680938720703, "input_args": {"text": "'Waking Times \\nAt long last, significant attention is being drawn to the corporate and political practices being used to force the Keystone and Keystone XL pipelines on the people of North America. Protests at the Standing Rock Sioux Indian Reservation in North Dakota are being put down by a brutal militarized police force working in service of private corporations, banks, and investors, and the world has been able to watch live streams of the events on social media. \\nWhile it is both inspiring and heart-breaking to see what happens when water people peacefully resist the oppression of the corporate state, much of the attention, deservedly so, is on the struggle of the Sioux and their interests in protecting their sacred ancestral lands, their treaty rights to reservation land, and the protection of their water supplies. \\nWhat is going under-reported, however, is the fact that the Keystone pipelines jeopardize the land and water rights of millions of people in North America, and that for years this project has been met with resistance by property owners, activists and even celebrities. The struggle we see now at Standing Rock is but another in action in a growing legacy of fighting this project. \\n“Whether you are aware of it or not, there is a revolution brewing in the backyards of the United States and Canada. The issue is over the development of a colossal pipeline that will deliver ‘ tar sands crude ‘ bitumen, a form of unrefined shale oil mixed with an undisclosed mixture of chemicals, from the highly contested Alberta, Canada Tar Sands project to oil refinery markets across the Midwestern US and the Gulf Coast of Texas.” ~ Alex Pietrowski , September 2013 The Legacy of Resistance Builds \\nResistance to the Keystone pipeline began as early as 2010, shortly after the multi-billion dollar project was commissioned, and much of the focus until now has been on stopping the Canada-to-Texas Keystone XL pipeline, the fourth stage of the Keystone project, which was to bring tar sands crude from Canada into the U.S. for refining in Houston, TX, and ultimately for export. \\nFirst nations in Canada and America have an established history of citizen interventions against the tar sands and Keystone projects, and in 2012, members of the Lakota tribe took direct peaceful action to stop Trans Canada from trespassing on native lands with a convoy of equipment. \\n“Lakota families refuse to allow passage of a convoy of trucks and equipment servicing the Keystone XL Pipeline. Blocking the highway with non-violent resistance, the determination of the Lakota in rejecting the convoy can be viewed as inspiration to all who oppose the destruction of our environment to temporarily meet energy demands. A temporary victory for sure, but an opportunity to revisit the idea of non-violent resistance and an opportunity to celebrate” [ Source ] \\nThe following video captured a portion of the confrontation between police and tribal elders: \\nAlong the route residents who refused to sell out have been hit eminent domain land seizures and forced to watch police protect construction crews tearing up forest and wetlands to hastily install pipelines on their land. In 2012, actress Daryl Hannah was arrested while standing in solidarity with then 78-year-old East Texas landowner Eleanor Fairchild as her land was bulldozed, and many smaller actions have taken place with little to no media attention. \\nThe following short film, Line in the Sand, was produced in 2013, capturing the growing movement of resistance to the Keystone project: \\nIn 2015, after years of public outcry, president Obama rejected the Keystone XL , which is only a part of the total Keystone pipeline project, and only time will tell how oil companies and the government will movie forward in pushing this on North Americans. \\nNow that other portions of Keystone are being challenged as the project moves forward in North Dakota, the corporate state is being forced to reveal its hand in full by cracking down with multiple law enforcement agencies geared up for civil unrest, something which until Standing Rock had not fully materialized. The police state which enforces corporate law over human rights is now coming under intense scrutiny, but as is the nature of oppression, they appear more determined than ever to follow orders and apply as much force as needed to crush the non-violent actions. When will they begin killing people over this? \\nMedia attention on popular struggles that aim to achieve victory by peaceful, non-violent means is exceptionally rare, yet is absolutely critical for resistors to win. The legacy of resistance to this pipeline has been building for years, and this is starting to feel like Mother Nature’s last stand. Will our attention shift to something else now, or will even more people unite in protection land and water? “This is not just about my land, it is about all of our country.” ~ Eleanor Fairchild Read more articles by Alex Pietrowski . About the Author \\nAlex Pietrowski is an artist and writer concerned with preserving good health and the basic freedom to enjoy a healthy lifestyle. He is a staff writer for WakingTimes.com and Offgrid Outpost , a provider of storable food and emergency kits . Alex is an avid student of Yoga and life. \\nThis article ( Before Standing Rock – The Legacy of Resistance Against the Keystone Pipeline ) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Alex Pietrowski and WakingTimes.com . It may be re-posted freely with proper attribution, author bio, and this copyright statement. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742563245.8641677}