{"duration": 0.23521828651428223, "input_args": {"text": "'FOR decades, automakers have been able to count on a fundamental fact of American life: You pretty much need a car to get around. But lately, novel technologies, including   services like Uber and advances in   cars, are creating new alternatives for commuting, shuttling children and going to the store  —   particularly in urban settings. There are also demographic and economic trends in play. Many younger Americans do not consider owning a car a goal or necessity  —   or a necessary expense. So carmakers are looking ahead to a day when the automobile plays a smaller role, or even no role at all, in many people’s daily routines. “The historical model is you buy a car and it’s in your garage most of the time,” said Glen DeVos, vice president for engineering and services at Delphi Automotive, a big developer and supplier of automobile technology. “It’s the   expensive thing you buy after your home, so if you can get around without owning a car, there are a lot of economic reasons people may not own a car, or own only one instead of two. ” One clear sign of the shift is the increasing energy that carmakers are devoting to a design category the auto industry refers to as the “the first   mile” challenge. It refers to the short distances some people must travel from home or work to a local destination, often a mass transit station. Not so long ago, this challenge was strictly a matter for transportation authorities, and barely registered with automakers. “People really didn’t think of the first   mile issue because the car was the primary way to get around,’’ said Erica Klampfl, the global future mobility manager at Ford Motor Company. “You just drove your car to your destination. ’’ In many ways, the industry’s race to solve the   challenge involves the development of   vehicles, an effort involving various carmakers, technology companies and   firms. General Motors and its partner, Lyft, an Uber rival, are about to begin testing a fleet of   cars ferrying passengers short distances in Detroit and other cities. Uber already has similar trials underway in Pittsburgh and has just expanded its tests to San Francisco. Next year, Delphi Automotive expects to have   Audis providing rides to mass transit stations in a section of Singapore. Ford, meanwhile, has vowed to begin producing a   car, with no steering wheel and no pedals, by 2021. The vehicle would be intended for   services in large cities. If these types of cars and services proliferate, Mr. DeVos at Delphi said, people will have more freedom to not own automobiles. Monica Manjarres, a    college student, is embracing that freedom. She lives in Azusa, Calif. 24 miles east of Los Angeles. In the last year, the Los Angeles County Metropolitan Transportation Authority has opened miles of new light rail extensions to its subway system, including a light rail link to Azusa. “If I want to visit my sister in Pasadena, I can walk to the train and it’s a   to   ride,” Ms. Manjarres said. “If you drive, the traffic is usually horrible. ” After she graduates this semester from Azusa Pacific University with a degree in exercise science, Ms. Manjarres says, she hopes to find a job she can reach by train. “I can confidently say I don’t really need a car,” she said. Kelly Skow has all but come to the same conclusion. A    video producer, Ms. Skow lives in Hollywood and commutes on the Los Angeles subway using the new Expo rail extension that goes to Santa Monica, where her office is. She usually covers the first and last mile of the trip on foot. “I only drive maybe once a week, usually to go shopping on weekends,” she said. During the week, her boyfriend uses her car to get to his job. “I had barely ridden the subway before the Expo Line opened, but now I’m using it a lot more and it’s great. Parking in L. A. is a nightmare and you don’t have to deal with that. ” The twist in Ms. Skow’s story: She works for TrueCar, a website that provides automotive pricing and information to help connect consumers with   and   dealers. Forecasters expect people in metropolitan areas to own fewer cars in the future. But they are not ready to predict a big drop in the total number of vehicles sold, which this year will total more than 17 million cars and light trucks in the United States and about 75 million globally. That is, in part, because so many people have more than a last mile to cover. Automakers are generally betting that sales of vehicles to fleet services will offset any decline in sales to individual consumers. Boston Consulting Group predicts that 44, 000 cars will be sold to   fleets in North America in 2021, more than making up for an expected net decline in consumer sales of about 8, 000 vehicles. The bigger impact might be on how the automotive industry  —   not just carmakers, but also fleet service operators, parts makers and the like  —   makes its money in years to come. According to the consulting firm PwC, the global automotive industry generates about $400 billion a year in profits about 41 percent of that  —   or about $164 billion  —   comes from new vehicle sales. By 2030, PwC forecasts that even as overall automotive profits grow to about $600 billion, only about 29 percent of that will come from new vehicle sales. By then, PwC predicts that “mobility services’’  —   including   and other types of   transportation services  —   will represent 20 percent of the automotive industry’s profits. Ford is among the automakers angling to be in position if that shift occurs. “We are on the cusp of a revolution,” Mark Fields, Ford’s chief executive, said at the Los Angeles Auto Show in November. Cars, he said, “are no longer our entire game. ” The company sees mobility services as potentially more profitable than its traditional business of making and selling cars. Manufacturing vehicles requires billions of dollars in investments in plants and engineering  —   costs that are often difficult to recoup. Mobility services would require less upfront investment, Robert Shanks, Ford’s chief financial officer, said in an interview. “Margins could be more like 20 percent instead of the 8 percent we are trying to get to today,” he said. Some of Ford’s mobility efforts don’t involve cars at all. Ford is sponsoring a   program in the San Francisco area, with the goal of having 7, 000 blue,   bikes in operation by 2018. In recent months, the company has also begun demonstrating a motorized conveyance device, created by its engineers, to help people cover the last mile  —   especially if they are carrying luggage or groceries that would make walking a challenge. Called the   it looks like a giant white hockey puck. The passenger stands on it as it travels to her destination, or she can set a parcel on it and have the   follow along. Ford has no plans to put it into production, but the company says it represents the unconventional ways it is thinking about the transportation future. Glimpses of a less   future, and the emergence of new   options, are evident in Southern California, where the new rail system has given many more people easy access to mass transit. Ms. Skow and other residents of Santa Monica, population 92, 000, can now hop on the Expo Line and ride all the way from the coast to downtown Los Angeles, 16 miles to the east. Although Ms. Skow walks to the train, the Santa Monica municipal government has tried to make it easier to reach any of the city’s three Expo Line stops without using a car. Its bus network was completely reorganized to deliver passengers to the stations in time to catch trains. For   service, after buses stop running, riders can get discounted cab rides. The last mile is more of a challenge in Azusa, a city of about 48, 000 that is less compact and walkable than Santa Monica and does not have as big a bus network. Ms. Manjarres, the college student, lives only a short walk from a station. But so many commuters still drive their cars to the train that the city doesn’t have enough parking for them. Theirs is more than a   gap to bridge. “People coming to the train will park in residential neighborhoods or retail parking lots,” said Troy Butzlaff, Azusa’s city manager. That is why the city is building an     solution: a   parking garage.'"}, "time": 1742564284.3260593}