{"duration": 0.07919764518737793, "input_args": {"text": "'by PAUL FASSA \\nThe old adage of an apple a day keeps the doctor away still has some validity. And new research has discovered apple juice three times a week helps prevent Alzheimer’s and heart disease. \\nDr. Thomas Shea, a neurobiologist, and his research team at the University of Massachusetts topped off 10 years of studying apples’ effects on brain health. They used test tubes, Petri dishes, and mice for years. Then finally they confirmed their findings with a human clinical trial . \\nTwenty-one AD patients from ages 72 to 93 were fed four ounces of apple juice twice daily for thirty days. There were improvements with memory as well as the negative emotional moods normally associated with AD victims. \\nDr. Shea concluded that by drinking apple juice only three times per week, you would reduce your chances of Alzheimer’s by 75%. And there are other benefits. Other animal studies have demonstrated that apples protect the heart, increase lipid metabolism, and reduce inflammation. \\nA Florida State University study by Dr. Bahram Arjmandi, involving several women aged 45 to 65, discovered that a heavy diet of apples reduced LDL in the women by 23% in six months. The women also lost three and a half pounds on average. How to Juice Apples Yourself \\nConventionally grown apples usually top the Environmental Working Group’s (EWG) “Dirty Dozen” list of excessively pesticide sprayed fruits and vegetables. Eat only organically grown apples or apples that are locally grown. \\nOften locally grown small orchard apples are not sprayed, but they are not USDA certified organic. This is often due to the time and money it takes to get that approval. So locally grown could be a solution for less expensive non-toxic apples if you are assured they are not sprayed. \\nDon’t bother with store bought pasteurized apple juice. Organic raw and unfiltered apple juice is better. But the best way to go is juicing just enough apples to drink at one sitting each time. Since Big Ag apples top the list of the “dirty dozen” (the 12 most sprayed foods), you should invest in organic apples. \\nA slow speed masticating juicer is recommended. It can be single auger (masticating screw) or double auger. You can Google slow speed masticating juicers and shop for what works for you. This is a worthwhile investment if you intend to do any juicing. I’ve been very pleased with my Omega single auger juicer with its 15 year parts guarantee. \\nThis type of juicer eliminates the extra fiber that inhibits rapid absorption while concentrating the juice of several items in one drink and preserving the enzymes that a high speed juicer may destroy. And it’s easy to clean. \\nDo not peel the apples. Cut them into pieces small enough for the juicer and include the core, seeds and all. Adding a small piece of peeled ginger root into the juicer adds more inflammatory protection. A freshly squeezed lemon can be added also. This should be done at least three times a week. Early Alzheimer’s Disease (AD) Symptoms \\nIt’s best to launch a three prong attack if confusion, fog, and memory loss is creeping in as a matter of daily life. The apple juice approach is good, but it may not be enough if AD symptoms have already set in. \\nOrthomolecular medical doctors specialize in curing with high dose vitamin and mineral supplements, such as IV mega-dose Vitamin C. They have had a good deal of success with all types of brain issues using large doses of niacin, aka vitamin B3. It shouldn’t be buffered as niacinamide, it needs to be plain niacin. This helps generate ATP for cellular energy in the brain. Read more here. \\nConsuming a tablespoon of pure cold pressed coconut oil twice or more daily has even reversed advanced Alzheimer’s. Dr. Mary Newport reversed her husband Steve’s advanced Alzheimer’s, which couldn’t be improved with pharmaceuticals, after discovering fresh virgin coconut oil has MCTs (medium chain triglycerides) that the liver can easily convert to molecular energy enhancing ketones . \\nSome health experts are considering Alzheimer’s Disease diabetes 3. AD victims suffer from dysfunctional insulin in the brain, thus starving brain cells of glucose needed for cellular metabolism. But ketones replace the glucose that’s in short supply in an AD victim’s brain. \\nCoconut oil also helps create “good cholesterol” that forms much of the tissue in the brain and also protects the central nervous system with a myelin coating . \\nRepairing and protecting central nervous system tissue and providing easily produced ketone energy into brain cell to reverse Alzheimer’s is something Big Pharma cannot come close to claiming. Thus far Big Pharma’s solutions for AD have been ineffective with damaging side effects. \\nStay natural, my friend. \\nPaul Fassa is a contributing staff writer for REALfarmacy.com. His pet peeves are the Medical Mafia’s control over health and the food industry and government regulatory agencies’ corruption. Paul’s contributions to the health movement and global paradigm shift are well received by truth seekers. Visit his blog by following this link and follow him on Twitter here \\nSources:'"}, "time": 1742564150.6138957}