{"duration": 0.04756879806518555, "input_args": {"text": "'Despite the left’s attempt to deny it, some   protesters are indeed paid to show up  —   including those from a growing number of tech companies who are paying their employees to participate in   rallies. [The San Francisco Chronicle reported on Saturday, in an article titled “Bay Area demonstrators may be paid to protest, by employers,” that the “common accusation lobbed at liberal protesters” that “they’re being paid to protest” is at least partially based in fact.  According to the Chronicle, “an increasing number of companies have unveiled policies that allow employees to take paid time off work for political or civic activities, such as protesting, canvassing, voting, volunteering or even running for office. ” The progressive movement’s vocal opposition to President Donald Trump has translated into employers (at least, those who can afford it) providing paid leave as a way to increase political engagement after what many of them took as a devastating loss. Adam Kleinberg, CEO of San Francisco marketing firm Traction, reportedly allows employees two paid “Days of Action” to participate in political rallies and protests annually. “It’s not sufficient anymore to say we’re a profit engine and we’re making money and screw everything else. It’s part of our responsibility to be engaged, to be active,” William Morgan, CEO and founder of   startup Buoyant, told the Chronicle. His company reportedly offers about three to four weeks of paid time off to its workers, who are able to use the time for political activity or vacations. “We as individuals, we as companies exist in an ecosystem. We’re only here because there’s this environment around us. It can’t just be a   relationship. ” The Chronicle notes that while the majority of these companies are on the smaller side, and tend to have more liberal workforces, larger companies like Facebook are looking to entertain similar policies. They reportedly told employees that they could use paid leave time to attend and participate in   May Day demonstrations. However, the Chronicle also notes that some companies who offer their employees paid leave for political action have experienced an intense backlash.'"}, "time": 1742562273.1949246}