{"duration": 0.18840479850769043, "input_args": {"text": "'HOBOKEN, N. J.  —   New Jersey Transit train No. 1614 just did not stop. It did not stop at 8:45 a. m. when it was scheduled to halt at the train station here at the height of Thursday’s rush hour. It did not stop when it slammed into a concrete and metal barrier at the end of Track 5. And it did not stop as it roared across the concourse and through the station’s structural supports, leaving in its wake a mess of tangled metal and debris, at least one person dead, scores of injured, and a host of questions about what might have caused the fatal crash. In more than two decades working as a New Jersey Transit employee, Michael Larson said he had never seen anything like it  —   a train car weighing some 100, 000 pounds flying off the tracks into a busy station. “The first thing I heard was the explosion of it hitting the bumper block,” he said, describing how the train “flew through the air” and barreled along the concourse, causing part of the station’s roof to collapse on top of it before screeching to a halt. Mr. Larson had one word for the scene: “Horrifying. ” The front passenger car took the brunt of the damage, and most of the more than 100 people injured were in the train, officials said. But the person who was killed, Fabiola Bittar de Kroon, 34, was on the platform after the canopy of the roof collapsed. Many of those who emerged unscathed or only slightly wounded spoke of how one small thing  —   like the decision to get a cup of coffee or to walk a few steps faster to beat the crowd  —   had spared them serious injury. One woman said she could feel a gush of wind as the train crashed only yards away. A man spoke of how a beam from the ceiling collapsed only feet from where he stood. Tom Spina was in the terminal when he heard a “sort of a crackling noise, the lights flickered a little and then there was a loud crash. ” Mr. Spina walked toward the chaotic scene. “You saw folks bleeding from the head, limping folks were on the ground,” he said. “It was awful. ” As harrowing as the experience was for those on the platform, passengers inside the train described how the confusion and chaos were made all the more frightening when they were plunged into darkness at the moment of impact. A seemingly mundane morning commute suddenly turned to tragedy. No. 1614 had left Spring Valley, N. Y. at 7:23 a. m. a crowded train on the Pascack Valley line. Commuters said that nothing seemed out of the ordinary as they approached Hoboken Terminal. In fact, many said they did not suspect anything was wrong until the crash itself. Then, in the darkness, all they could hear at first were screams. Slowly, the scope of the devastation came into focus for those on board, with witnesses describing how people  —   some unconscious  —   were trapped in the debris, and others were staggering away from the scene, covered in dust and blood. Bhagyesh Shah, who was in the second car, is one of many commuters who prefer to be as close to the front of the train as possible so they can quickly exit and make their way to the PATH train into Manhattan. “We were thrown off our feet,” Mr. Shah told reporters. “The train just didn’t stop. It just kept going and going and going. ” Some people broke through emergency windows on the train to escape, while others scrambled out of doors that were pried open. At the same time, other commuters were rushing to the wreckage, joining with rescue workers in a frantic effort to help the most seriously wounded. Rick Ciappa, a safety inspector for New Jersey Transit, was going about his morning duties at the station when he heard the “deafening bang” of the crash. He ran toward the mangled train, where he saw dozens of dazed passengers, many of them bloodied or trapped. “I’ve never seen that kind of fear. It was awful,” said Mr. Ciappa, who helped passengers to safety. “Everyone was just completely stunned and terrified. ” Nassima Toumi, who is nine months pregnant, had stopped for coffee on her way to work as a personal trainer at Crunch when she heard the commotion from the terminal. She went looking for her husband, who was headed for the light rail, and saw him in tears. “My husband was there crying,” Ms. Toumi said. “He’s a big guy and not that emotional. ” Then she saw bodies strewn on the ground and shot some video with her phone. The video shows a woman lying on the ground, not breathing, with a leg split open. Ms. Toumi said she saw a man walking by “all covered with blood all over and his eye is gone. ” “It was very scary,” she added. For much of the morning, rescue workers struggled to extricate those who were trapped and to treat the injured. The streets outside the   station were quickly transformed into a sea of red and blue lights as ambulances and rescue vehicles converged on the scene. The most severely wounded were taken to the Jersey City Medical Center. To deal with the flood of patients, hospital officials there turned the cafeteria into a triage area, dealing with injuries from cuts and bruises to more serious lacerations and contusions. About a dozen of those injured remained in critical but stable condition on Thursday evening, hospital officials said. The cause of the crash remains under investigation, but officials said there was no immediate indication that it was anything other than accidental. Officials would say only that the train was traveling much too fast at the time of the crash. The engineer survived, officials said, and was treated at a hospital and released. He was said to be cooperating with investigators.'"}, "time": 1742563879.1777234}