{"duration": 0.03728747367858887, "input_args": {"text": "'November 15, 2016 \\nFormer Smiths frontman Morrissey says he is ‘currently contemplating the warm, welcoming embrace of early retirement’ after his album of songs for children ‘Hello Young Persons Everywhere’ failed to chart this weekend. The album, a long-standing ambition for the singer, contains a number of reworked children’s standards including ‘This Old Man, He Played One’ and ‘The Wheels on the Bus’ along with a selection of self-penned numbers including ‘Algebra is a Frightful Bore’ and ‘It is Inadvisable to Commence Your Sentences With a Gerund’. ‘It was my intention to offer today’s younger folk entertainment of an improving nature’ remarked the singer ‘as an alternative to the abominations that are the likes of Hannah Montana and Chuggington. It appears that the entertainment industry has pulled together along with the British Brainwashing Corporation to prevent such an endeavour from ever succeeding.’ Another organisation no longer supporting the singer is The Early Learning Centre who had planned a promotional tie-in with the album’s release. They withdrew support upon hearing the lead single ‘I Know an Old Woman Who Swallowed a Fly’: ‘I know an old woman, who swallowed a fly, And because of this careless old lady, This innocent fly will die Fly will die (x5) ‘I know an old woman, who swallowed a fly, Oh ignorant greedy old woman, I hope that you suddenly die, Hurry up and die (x7)’ Morrissey is keen to stress that despite quitting music, he will not be shunning the limelight. ‘I am already in negotiations with the producers of QI about joining their fragrant and estimable team. Meanwhile, I am ready to unleash my first book for the teenage market. I consider it a necessary counterbalance to the inanities of Eugenia Lavender and Budgie the Helicopter.’ The book: ‘Eats, Shoots and Dates: How the Poor Grammar and Punctuation of Others Has Long Ruined my Chances of Finding Lasting Love’ is published by McMillan in March. Share this story... \\nPosted: Nov 15th, 2016 by Skylarking Click for more article by Skylarking .. More Stories about: From The Archives 0'"}, "time": 1742562441.6066628}