{"duration": 0.1449594497680664, "input_args": {"text": "'Illegitimate Stock Markets Back Hillary By Daily Bell Staff - November 01, 2016 \\nThe Stock Market Has a Favorite in the Election … On the evening of Sept. 26, two interesting things happened. First, Hillary Clinton won a decisive debate victory over Donald Trump in the first presidential debate, as judged by prediction markets (and later, by polls). Second, financial markets abruptly experienced large, abnormal swings. Economists Justin Wolfers and Eric Zitzewitz have documented this extraordinary convergence in a new paper, titled “What do financial markets think of the 2016 election?” – Bloomberg \\nThis Bloomberg article actually questions conclusions regarding stock market support for Hillary, but adds: “So Wolfers and Zitzewitz make a strong case.” \\nIndeed the study has attracted a lot of attention, though one of the reasons is obviously because it is a pro-Hillary study and apt to be picked up by the mainstream media. \\nThe larger question, of course, is why equity markets would find an anti-freedom, pro-war candidate attractive. \\nMore: \\nThe most likely explanation is that financial markets think a Clinton victory would be good for the economy …. \\nWe saw some of the opposite happen when stock markets plunged on Friday, immediately after an announcement by FBI Director James Comey that the agency was reviewing new evidence in a probe related to its investigation of Hillary Clinton’s use of a private e-mail server while she was secretary of state. \\nWhy would markets not like Trump? Well, it’s pretty obvious. Trump’s mercurial temperament, unconventional ideas and lack of governing experience would create large doubts about the direction of all sorts of government policy — just the sort of thing that makes investors uneasy. \\nThis really doesn’t make much sense. On almost every front, Bill and Hillary Clinton’s actions over decades have been inimical to freedom. If investing and trade thrive in free-market environments, then markets should not reflect a pro-Clinton bias. \\nThe reason that markets are pro-Clinton is probably because markets – especially stock markets – are not expressions of free markets. That sounds strange because stock markets, especially, are seen as expressions of capitalism. \\nOf course “capitalism” is not necessarily an appropriate nomenclature but that’s an article for another day. \\nThe point is that corporations and the stocks that offer investment opportunities are not necessarily any more legitimate than central banks. Neither corporations nor central banks are “normal” expressions of a free-market system. \\nCentral banks fix the price and value of “money” via interest rate manipulation. This price fixing has the force of law. If you don’t obey – or agree – you can end up in prison. \\nCorporations are artificial entities that the founders of the US greatly feared. (See here and here ). Before the Civil War corporations were almost non-existent. \\nCorporations are also the outcome of government force. They are in existence because of intellectual property laws, corporate personhood, monopoly central banking and regulations that prop them up. \\nWithout significant government support, modern corporations would not exist and neither would their “stocks.” \\nThe titanic nature of modern corporations is the outcome of government manipulation. The “investment” opportunities presented by such quasi-government monopolies would not be viable in a normal free-market environment. \\nPeople simply don’t realize how distorted modern economies are. They are entirely artificial creations, dependent on state-enforced central banking and industrial monopolies. \\nAnd this is why “stock markets” prefer the Clintons in this election cycle. It’s because large industries depend on government to sustain their artificial competitive advantages. \\nOne can certainly speculate what a real free-market would look like within the context of stock markets. Probably such markets would be a good deal smaller and oriented toward a select clientele rather than a mass audience of “investors.” \\nMost people would make their living in the trades or in others ways that were directly in demand. Societies would probably be more agrarian-based – as they used to be. Savings would gradually appreciate in value as technology brought down the price of goods and services on a regular basis. \\nThe stampeding of savers into stock markets is surely an unnatural occurrence. It has been promoted because those who control stock markets and their corporations want people to feel that their net worth is tied up in the current system. \\nIronically, this system does not provide much wealth to the average individual. Most people in the West are relatively impoverished and times are growing more difficult not less so. Middle classes seem to be shrinking rather than expanding. \\nConclusion: Many people in the West and certainly in the US would be glad to see real entrepreneurism flourish in the context of companies aligned with a fully competitive marketplace. Stocks and stock markets would still exist of course, but they would reflect a bias toward freedom rather than fascism.'"}, "time": 1742564398.5298278}