{"duration": 0.06325006484985352, "input_args": {"text": "'Global Research – by Al-Jazeera \\nRamallah, occupied West Bank – Enas Taha, a resident of the Palestinian village of Kafr al-Deek in the occupied West Bank, has become desperate. \\n“Since the [water] crisis started in June, the municipality has been able to supply water for only one hour twice a week,” Taha told Al Jazeera. “I am checking the weather forecast every day; they announced rain three weeks ago, but it has not come yet. The only thing I can do is to pray to God.” \\nMany West Bank communities are facing similar problems, amid an acute water shortage that has lasted for months. In the Salfit, Jenin and Hebron governorates, some villages have gone as long as 40 days in a row without running water. \\nIn mid-July, residents in the Bethlehem area staged a sit-in for days to protest against the shortages, sparking clashes between Palestinian youths and Israeli forces. \\n“It is a very stressful situation. I have to consider and prioritise every single drop of water I use,” Taha said. “We have barely enough to drink, cook, shower and use the bathroom. Sometimes I don’t do the laundry or clean the house for weeks. It is hot and dusty. This is exhausting.” Enas Taha shows her garden, which has turned brown due to the severe water shortages since June [Eloise Bollack/Al Jazeera] \\nSome Palestinians have joked that the water bill collector comes to their homes more often than water. As demand rises, the cost of drinking water has skyrocketed, with some families spending up to 30 percent of their meagre incomes to purchase it. \\nIsrael implements a policy of water cuts each summer, but this year, it reached an unprecedented peak. In early June, Israeli water company Mekorot informed the Palestinian Water Authority (PWA) of summertime supply cuts totalling more than 50 percent – and the cuts, while not as dramatic, remain in effect today, more than a month after the official end of summer. \\n“We are in regular contact with [Mekorot] to find a solution, but they constantly give us different excuses, such as the increase in demand, rising temperature, etc,” Deeb Abdelghafour, the PWA’s director of the water resources department, told Al Jazeera. \\nThe notion that the region is suffering from water scarcity is a myth, he added: \\n“We have been facing shortages for decades, and the reason is not natural, but man-made – meaning the Israeli occupation and Israeli control over water resources in the Palestinian territories.” \\nIsraeli officials have stated that water resources are shared equally in Israel and the occupied Palestinian territories. Israel’s Coordinator of Government Activities in the Territories, a unit in the Israeli army, noted that Israel provides 64 million cubic metres of water to the Palestinians annually, even though it is only obliged to provide 30 million under the Oslo accords. \\nHowever, disparity is evident in the lush gardens, parks and swimming pools in illegal Israeli settlements. The key difference is that Palestinian villages in the West Bank are not connected to the national water grid, relying instead on local underground supplies. \\nPalestinians living in remote areas have been hit the hardest by the ongoing water crisis, as access roads are often poor and the additional costs of delivery result in higher prices. \\n“We need special 4×4 trucks to drive on the unpaved roads, and it can take up to two hours to reach the communities,” said Hafez Hureini, a resident of at-Tuwani village and leader of the South Hebron Hills Popular Committee. Taha shows her empty beehives: ‘Last year, we had bees so we could produce our own honey, but all the bees died due to lack of water; there are not enough flowers’ [Eloise Bollack/Al Jazeera] \\nOver the summer, Israeli media reported that illegal Jewish settlements in the West Bank were also suffering from daily disruptions to water supplies, prompting the Israeli government to establish a new drilling site, Ariel 1, which would provide 250 cubic metres of water per hour. \\nAbdelrahman Tamimi, director of the Palestinian Hydrology Group for Water and Environmental Resources Development, said that this was not where water was needed the most. \\n“The wells should be drilled where there is important demand, such as north and south of Jenin, south of Hebron, or northwest of the Jordan valley. Why in Ariel, I wonder, as a hydrologist? There is already a well there; they can simply improve its capacity … [This measure] was definitely not designed to supply Palestinian communities,” Tamimi told Al Jazeera. \\nIn the meantime, Israel has accused Palestinians of tapping into pipes, with the Israeli Water Authority asserting that 5,000 cubic metres of water is stolen every day by Palestinians. \\n“We are aware there is water theft … However, we should ask ourselves why are the people stealing water? Simply because they are thirsty,” Abdelghafour said. \\nAt the same time, increased water demands owing to growing Israeli and Palestinian populations is stretching the limits of existing water infrastructure. Most of the water network was installed in 1967, when Israel occupied the West Bank. Today, the diameters of the pipes are inadequate, and the system is reaching the end of its life cycle. \\n“Even to upgrade infrastructure in Area A and B is a headache,” Abdelghafour said. “They [Israel] impose long and complicated procedures in order to issue permits to import the smallest pieces or equipment.” \\nData released by the Israeli Water Authority shows that a large expansion in agriculture in the settlements has led to an estimated rise of 20 to 40 percent in water consumption this year. \\n“The [Palestinian Authority] has no solution for the water crisis. In my opinion, Israel has used this summer to put more pressure on us to purchase desalinated water, so they can allocate groundwater for the settlements and their future expansion,” Tamimi said. \\nSince 2005, five desalination plants have been built in Israel, now producing approximately 50 percent of the country’s water supply. \\n“We don’t want to substitute water from desalination plants for our historical rights to all shared water resources,” Abdelghafour said. “Once we have our basic rights, based on equitable allocation of resources and international law, then we can think of other development options, such as desalination or treatment of waste water.” The original source of this article is Al Jazeera'"}, "time": 1742628514.9129403}