{"duration": 0.10933041572570801, "input_args": {"text": "'\\nIn the aftermath of one of the most memorable (c)october shocks in presidential campaign history, Wikileaks continues its ongoing broadside attack against the Clinton campaign with the relentless Podesta dump, by unveiling another 596 emails in the latest Part 22 of its Podesta release, bringing the total emails released so far to exactly 36,190, leaving less than 30% of the total dump left to go.\\nAs usual we will go parse through the disclosure and bring you some of the more notable ones.\\n* * *\\nIn a February 2012 email from Chelsea Clinton’s NYU alias, aj66@nyu.edu, to Podesta and Mills, Bill and Hillary’s frustrated daughter once again points out the “frustration and confusion” among Clinton Foundation clients in the aftermath of the previously noted scandals plaguing the Clinton consultancy, Teneo:\\nOver the past few days a few people from the Foundation have reached out to me frustrated or upset about (fill in the blank largely derived meetings Friday or Monday). I’ve responded to all w/ essentially the following (ie disintermediating myself, again, emphatically) below. I also called my Dad last night to tell him of my explicit non-involvement and pushing all back to you both and to him as I think that is indeed the right answer. Thanks\\nSample: Please share any and all concerns, with examples, without pulling punches, with John and Cheryl as appropriate and also if you feel very strongly with my Dad directly. Transitions are always challenging and to get to the right answer its critical that voices are heard and understood, and in the most direct way – ie to them without intermediation. Particularly in an effort to move more toward a professionalism and efficiency at the Foundation and for my father – and they’re the decision-makers, my Dad most of all.\\nA February 2015 email from Neera Tanden lashes out at David Brock of the Bonner Group, profiled in this post: “ Money Laundering Scheme Exposed: 14 Pro-Clinton Super PACs & Non-Profits Implicated. ” As a reminder, the Bonner Group, as we showed last month, may be a money laundering front involving various SuperPACs and non-profit institutions:\\n\\nIn the email Tanden says that:\\n“Brock/Bonner are a nightmare: Really, Suzie Buell isn’t giving to the superpac? I wonder how that got in this story “ Big donors holding off making pledges to pro-Hillary Clinton super PAC “,\\nand concludes by saying that “ Sometimes HRC/WJC have the worst judgement. ”\\n\\nIn retrospect, she is right.\\n* * *\\nSpeaking of “donor advisor” Mary Pat Bonner , the following email from March 2009 hints at potential impropriety in shifting money from one democratic donor group to another, the Center for American Progress :\\nI have moved all the sussman money from unity ’09 to cap and am reviewing the others. I will assess it and keep you informed\\nSomething else for the DOJ to look into after the elections, perhaps?\\n* * *\\nAnd then there is this email from August 2015 in which German politician Michael Werz advises John Podesta that Turkish president Erdogan “is making substantial investments in U.S. to counter opposition (CHP, Kurds, Gulenists etc.) outreach to policymakers” and the US Government.\\nJohn, heard this second hand but more than once. Seems Erdogan faction is making substantial investments in U.S. to counter opposition (CHP, Kurds, Gulenists etc.) outreach to policymakers and USG. Am told that the Erdogan crew also tries to make inroads via donations to Democratic candidates, including yours. Two names that you should be aware of are *Mehmet Celebi* and *Ali Cinar*. Happy to elaborate on the phone, provided you are not shopping at the liquor store.\\nThe email :\\n\\nThis should perhaps explain why the US has so far done absolutely nothing to halt Erdogan’s unprecedented crackdown on “coup plotters” which has seen as many as 100,000 workers lose their jobs, be arrested, or otherwise removed from Erdogan’s political opposition.\\nSource \\n'"}, "time": 1742561981.0471537}