{"duration": 0.09312152862548828, "input_args": {"text": "'Mon, 24 Oct 2016 00:00 UTC © Fitzgerald Griffin Foundation/Russia Insider President Obama, Vladislav Krasnov, Ph.D An Open Letter to Barack Obama Dear Mr. President: As your presidential duties will soon expire, I want you make sure your Nobel Peace Prize is deserved: Please instruct your officials to return to the path of negotiations with Russia , be it the Syrian crisis, the lapse of the plutonium nuclear arms control deal or Ukraine. By so doing, you will bequeath to your successor —whomever it might be— a solid foundation on which to build a healthier and more peaceful Planet Earth. The United States should re-commit to the policy of non-interference in domestic affairs abroad that our Founding Fathers consistently proclaimed and adhered to. Instead of imposing our cherished values of \"free-market\" and \"democracy\" abroad, let us rely on the wisdom of a man who risked the reputation of a \"traitor\" when he defied King George\\'s war on American colonies. I am talking about Edmund Burke, the British philosopher and father of modern conservatism. Like ancient Greeks he argued that each country is entitled to its own form of government, be it democracy, republic, monarchy, tyranny or despotism, each of which tend to evolve into its opposite. Therefore, the colonies do not have to bow to the King. Burke\\'s monument now graces Washington DC. In respect to Russia, remember that Empress Catherine the Great refused King George\\'s request to send Russian Cossacks help him quell George Washington\\'s rebellion. During the Civil War, while Europe\\'s powers-- Great Britain, France, and Spain—tried to take advantage of President Lincoln\\'s problems with the South, Tsar Alexander II who had just abolished serfdom in Russia, sent Russian Navy to the harbors of New York and San Francisco as a gesture of Good Will. More recently, in spite of the USSR\\'s unconcealed hostility to \"Capitalist\" America, the two countries were able to co-operate in the defeat of Nazi Germany and Japan, and then keep the bitterness of Cold War in check. After 1991, the Communist Russia is no more. The New Russia has been espousing the same values of private property, free enterprise, multi-party free elections, secular government, and freedom of speech and religion— as we do. To be sure, the post-1991 Russian road has been rocky, but this because we meddled on the side of the Russian oligarchs and because it takes years and decades to cultivate free enterprise and democracy in a country that had none for 73 years. In late 1980s, when I was writing Russia Beyond Communism: A Chronicle of National Rebirth (Westview Press, 1991), Soviet soldiers were forbidden to wear crucifix. Now General Sergei Shoigu, Russia\\'s Minister of Defense, would not enter the Red Square without crossing himself publicly. President Vladimir Putin is regularly seen in a church in front of an icon and has addressed Russian Muslims in a mosque and Jews in a synagogue. It\\'s a truly tectonic shift in global affairs since the end of the Cold War in 1991. Therefore, I say, Mr. President, take a breath of fresh air and do what it takes to make your Nobel Peace Prize count: Leave the legacy of peace-seeking negotiations with Russia from which your successor will not deviate lest he or she be called an abominable war monger. More than any other two countries, Russia and the United States are called upon safeguard Peace, Freedom and Commerce not just from San Francisco to Vladivostok, but on the entire Planet Earth. So help us God! Sincerely, W George Krasnow, Ph.D. (aka Vladislav Krasnov) President, RAGA.org October 10, 2016 W. George Krasnow (also published as Vladislav Krasnov), Ph.D., runs the Russia and America Goodwill Association, a non-profit organization of Americans for friendship with Russia. Formerly, he was a professor and director of Russian Studies at the Monterey Institute of International Studies in California. Under the name of Vladislav Krasnov he published three books: Solzhenitsyn and Dostoevsky: A Study in the Polyphonic Novel, Russia Beyond Communism: A Chronicle of National Rebirth, Soviet Defectors: The KGB wanted List. His op-ed columns have appeared in The Wall Street Journal, New York Times, International Herald Tribune, San Francisco Examiner, San Diego Union, and Dallas Morning News. © www.whitehouse.gov'"}, "time": 1742562118.944022}