{"duration": 0.07023501396179199, "input_args": {"text": "'A police detective in the north Texas community of Frisco is struggling to overcome paralysis and find a way to return to service as a police officer. [Detective Daniel Bardwell became paralyzed after becoming infected following a surgery to repair damage caused by a   illness. Doctors diagnosed the   police veteran with Crohn’s disease at the age of 17, Fox News reported. Despite the illness, he joined the police force.  Several times, Bardwell underwent painful surgeries to repair damage to his intestines. However, in August, he encountered something he never dreamed he would face. Following his surgery, Barwell developed a staph infection that left the police officer paralyzed from the chest down.  The infection settled in the detective’s spine, WFAA reported. He went to sleep one night with a pain in his neck. When he awoke, he could no longer move anything below his chest. “If you’d have given me a choice of a million things that would have happened, this is not one,” Bardwell told the Fox News reporter. For months, the police detective has struggled through treatments and therapy to attempt to overcome this setback and return to the job he loves. “All of a sudden, something like this happens and you realize all the components that actually go into standing up,” he explained. The detective, who works in the crimes against people unit of the Frisco Police Department is not facing the challenge of recovery alone. Bardwell’s wife of 18 years, Jill, is standing by her man. She said she is excited about the progress he is making. “We’ve seen from a toe wiggle to finger movement to being able to lift his right leg,” she said. “And with each of those, we just celebrate. ” She said his goal is to walk again. “Daniel says it is a matter of when, not if. Maggie Lastukhin, a physical therapist at Baylor University Medical Center, told WFAA, “I’ve never seen a work ethic like his before. He never says no. He never complains. ” His fellow officers are also doing what they can to help by raising money for a wheelchair accessible van. The goal is for Bardwell to be able to drive himself to work when he is ready to return, officials said. “Everybody wants to help to do their part, whatever it may be  —   little or big,” Officer Ryan Chandler told Fox 4 News reporters. “So I think that they are really feeling that love from the police department now. ” The community of Frisco is also chipping in. A local Schlotzsky’s Deli is donating a portion of this weekend’s proceeds. Others have set up a “YouCaring” account to help with expenses not covered by insurance. “It’s been humbling. That’s the best word to use when I think about all the support we’ve gotten,” Daniel told WFAA reporters about the support he has received. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.'"}, "time": 1742562174.4104366}