{"duration": 0.08199024200439453, "input_args": {"text": "'UN special rapporteur on Palestine blasts Israe By Stephen Lendman \\nHow many years of illegal Israeli occupation of Palestine are too many? How long will the international community tolerate its vicious persecution of millions of defenseless people? \\nHow long will its longstanding slow-motion genocide policy be allowed to continue unchallenged? \\nEvery day is Kristallnacht in Palestine, especially in lawlessly blockaded Gaza under siege, subject to Israeli terror-bombing and incursions at its discretion, slaughtering civilians indiscriminately because who’ll intervene responsibly to stop the horrors Palestinians endure. \\nIn his first report to the UN General Assembly, Special Rapporteur on the Situation of Human Rights in Palestine Michael Lynk described deplorable conditions, unacceptable, yet persisting, with nothing in prospect likely to change things without international community intervention. \\nCalling for an end to nearly half a century of illegal occupation, he said that “[t]he Palestinian economy is without parallel in the modern world. Israel’s occupation is denying Palestine’s right to development and severely hampering its ability to attain even the minimum targets of the Sustainable Development Goals ( SDGs ).” \\nIsrael systematically breaches fundamental international laws unaccountably. Apartheid worse than South Africa’s is institutionalized. State terror is official policy. Israel treats Palestinians the way Hitler persecuted Jews. \\n“Poverty is rising,” said Lynk. “Unemployment is rising to epic levels. Food insecurity is becoming more acute. The Palestinian economy is becoming more stifled and less viable under the occupation. Israel’s deliberate fragmentation of [Occupied Palestine] and lack of development has negatively impacted human rights.” \\nConditions are “seriously deficient in its respect for the legal principles and obligations embedded within the right to development.” \\n“The deepening of the occupation, the constriction of basic human rights and the utter absence of a political horizon leading to self-determination for the Palestinians have reinforced an atmosphere of despair and hopelessness.” \\nPraising regional human rights groups for their courage and commitment to justice, Lynk explained that “[t]hey face scorn and worse . . . If a just and compassionate peace is ever to come to the Middle East, we will owe much to these fearless advocates.” \\nIn mid-October, in testimony before Security Council members, B’Tselem Executive Director Hagai El-Ad called for UN action to end nearly half a century of illegal Israeli occupation. \\nIsraeli UN envoy Danny Danon accused him of “defam[ing] us in front of the international community.” Israel threatened to revoke his citizenship. \\nHuman rights workers for Palestinian liberation risk life and liberty. El-Ad concluded his remarks, saying: “For most of my country’s existence, the world has allowed it to occupy another people. I have lived my entire life, every single day of it, with that reality.” \\n“Millions of Israelis and Palestinians know no other reality. We need your help. Fifty years of ‘temporary’ occupation are too long for even a single person on this planet to accept such a contradiction in terms.” \\n“The rights of Palestinians must be realized; the occupation must end; the UN Security Council must act; and the time is now.” \\nStephen Lendman lives in Chicago. He can be reached at lendmanstephen@sbcglobal.net. His new book as editor and contributor is “ Flashpoint in Ukraine: US Drive for Hegemony Risks WW III .” Visit his blog at sjlendman.blogspot.com . Listen to cutting-edge discussions with distinguished guests on the Progressive Radio News Hour on the Progressive Radio Network. It airs three times weekly: live on Sundays at 1PM Central time plus two prerecorded archived programs. Commentary . Bookmark the permalink .'"}, "time": 1742563587.205759}