{"duration": 0.10007333755493164, "input_args": {"text": "'Good morning.  We’re trying something new for our readers in Europe: a morning briefing to   your day.  What do you like? What do you want to see here? Email us with your feedback at europebriefing@nytimes. com. Here’s what you need to know: • The Iraqi government has begun its battle to reclaim Mosul from the Islamic State. The militants’ hold on the sprawling city lent the most credence to their claim to rule a fledgling nation. European Union foreign ministers are meeting today to discuss recent developments in Syria. Rebels claim to have captured the village of Dabiq, forcing the Islamic State from a stronghold. • Russia’s furious response to American, British and French accusations of war crimes in Syria sent diplomatic relations into the kind of tailspin not seen for decades. Some analysts believe that President Vladimir V. Putin is raising the stakes for coming negotiations over Syria. Talks are expected to resume in Lausanne, Switzerland, on Saturday. • France is confronting entrenched   bias, brought to a head after a Chinese migrant living in a Paris suburb was beaten to death. The death exposed the complexities of the country’s volatile racial tensions, which have often been portrayed too simplistically as defined by frictions involving the large Muslim minority. Economic weakness and a rise in inequality appear to be causing a disturbing growth in ethnic nationalism in countries around the world. • A court in London is considering whether a set of archaic rules known as the royal prerogative would allow Prime Minister Theresa May to start the clock on leaving the E. U. without the kind of involvement Parliament is demanding. And The Sunday Times of London published an  “Brexit” column that Boris Johnson, now the foreign secretary, wrote before deciding to embrace the movement. “Hold your breath,” he wrote. “Think of Britain. Think of the rest of the EU. ” • Silicon Valley is taking sides in the U. S. presidential race as the election on Nov. 8 approaches. Much of the sentiment being openly expressed is in opposition to Donald J. Trump, but Peter Thiel, a tech billionaire, is giving $1. 25 million to support his candidacy. Meanwhile, Republican leaders and election officials from both parties are countering claims by Mr. Trump that a conspiracy is underway between the news media and the Democratic Party to commit vast election fraud. The candidates’ third and final debate is on Wednesday, with most polls heavily favoring Mrs. Clinton. • Montenegro’s governing party won parliamentary elections on Sunday, according to unofficial results, but failed to secure an absolute majority. The outcome of coalition negotiations will determine whether the country continues on its Western course under the longtime prime minister, Milo Djukanovic, or turns back to Russia, its traditional ally. • A sweeping accord on banning hydrofluorocarbons reached in Kigali, Rwanda, could be even more   than the Paris climate accord. And it might not have happened without the active backing of the world’s chemical companies, which are disrupting their own businesses to fight climate change. • Russia and India are moving forward with a revitalized relationship after signing billions of dollars’ worth of military and energy deals at a summit meeting over the weekend. • China is in the midst of a dizzying housing bubble, but the growing use of mortgages could make this property boom particularly unstable. • E. U. trade ministers will meet on Tuesday to decide on a free trade deal with Canada, known as CETA. • Here’s a snapshot of global markets. • The Economist: “Europe Is Trying to Teach Its Gender Norms to Refugees. ” Teaching sexual conventions is tricky, especially when there is no agreement on what those norms should be. • NPR: “In Fight Against Food Waste, Brits Find A Worthy Battlefield. ” A campaign encouraged food manufacturers to reduce the portion sizes of prepackaged meals. • Deep Dives: “The (Mobile) Games Women Play. ” A   reminder that many of the people downloading games to their smartphones are women. • In Aleppo, Syria, a drone video reveals destruction so complete that our architecture critic says it obliterates even a sense of time. “At a glance,” he writes, “the video could show Berlin in 1945 or Grozny, 2000. Mass death erases all distinctions. ” • The death of Thailand’s revered king has brought both the country and the crown prince, above, to the brink of an ascension neither appears to be ready for. His lavish lifestyle in Germany has caused great anxiety in the kingdom. • China sent two astronauts to an orbiting space lab for a   stay earlier today. Beijing’s space program calls for a permanent space station by 2018, an unmanned rover to Mars in 2020 and an astronaut to the moon in 2025. • The United States has been so successful protecting wild horses in the West that   herds are overgrazing public lands. About 46, 000 horses are now held on ranches at a cost of $49 million a year. Weather and wars are responsible for many disasters these days. But two centuries ago, one was caused by an unusual culprit: beer. On Oct. 17, 1814, the London Beer Flood took the lives of eight people in a densely populated slum known as St. Giles Rookery. A series of vats exploded at a brewery, breaking through a wall. Witnesses described a wave of porter ale and debris up to 15 feet high. An “immense mass of ruins” is how one newspaper described the scene. Among the victims were said to be a mother and daughter having tea. Others killed included mourners attending a wake. Decades earlier, the poverty of St. Giles inspired “Gin Lane” by the artist William Hogarth. Perhaps because of the neighborhood’s reputation, accounts of onlookers trying to scoop up the free booze became part of the tragedy’s lore. A local pub pays tribute to the anniversary with special beers on tap. One that was once served was called the Beer Flood Porter. Sean Alfano contributed reporting. Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at europebriefing@nytimes. com.'"}, "time": 1742563751.3217866}