{"duration": 0.05891680717468262, "input_args": {"text": "'Amaal Elhaaj is fighting the same radical Islamic terrorism that threatens people around the globe, including in her home country of Libya. She is also a Muslim who agrees with President Donald Trump’s travel order and his effort to keep Americans safe. [In fact, Amaal and the eight other Libyans who were granted visas by the Trump State Department came to the United States to seek help from the United Nations and the United States to achieve stability in their country and to gain support for all Muslims in Libya, not just what Amaal calls “political Islam” in power there, including the Muslim Brotherhood.  Members of that delegation, made up of tribal leaders and women activists and organized by the National Movement of Libya (NML) believe that the political processes led by the United Nations in Libya have been more accommodating to Islamists than tribes that represent much larger areas and far more people, partly due to the influence of foreign powers, including the United States under the Obama administration. “I believe Trump is not fighting Muslims just because they are Muslims,” Amaal told Breitbart News. “And the decision he made, I can accept it   …     because he has to make sure the people who enter America are not the wrong people. ” Amaal added that most Libyans are peaceful people who would not commit terrorists acts. “They were trying to empower political Islam in Libya,” Amaal said. ”This is the truth. ” Amaal said NML isn’t advocating for the exclusion of Islamist groups, with the exception of terrorist groups, but that they want the U. N. to respect Libya’s demographics and strengthen cooperation with tribal groups and representatives of cities and civil society. NML consists of groups that both supported and did not support Libyan dictator Muammar Gaddafi during the 2011 revolution, with members reconciling with the help of facilitators. During the delegation’s visit to New York City and Washington, D. C. this week, members met with officials from the U. N. Security Council, the U. S. State Department, the U. N. Development Program, the Permanent Mission of the United Kingdom to the U. N. and the U. S. Institute for Peace. Amaal, who fled her country in 2014 after being targeted for activism for women’s rights and human rights, including her efforts to be elected as the first female Libyan Prime Minister, said her countrymen who now live in the U. S. aren’t united about the future of Libya. “There are some in the Libyan community in the United States that support the Muslim Brotherhood and are happy about what is happening in Libya,” Amaal said. “Many of those who support the Islamists have dual citizenship. But there are many American Muslims that work hard against terrorism, and we appreciate what they have done and are doing,” she added. Libya has experienced years of violence and lawlessness since the   ouster of Kadhafi, with rival parliaments and governments trading barbs and militias fighting over territory and the country’s vast oil wealth. Militias loyal to former prime minister Khalifa Ghweil, whose administration was replaced by the   government last year, have stepped up a campaign of defiance against its authority. For her part, Amaal plans to move back to a safe area in Libya and continue her activism. “I want democracy,” Amaal said. “I want justice. ” The Libyan delegation was sponsored by the Network for Religious and Traditional Peacemakers and the Libya Institute for Advanced Studies, with the support of Finn Church Aid.'"}, "time": 1742563377.4531121}