{"duration": 0.22320055961608887, "input_args": {"text": "'By In5D on November 15, 2016 in Awareness , Spiritual Awakening \\nby Kim Hutchinson, Guest writer, In5D.com \\nPreface: I wrote this article to help people who are unhappy with American election results. I hope it helps to bring you peace and understanding. The Election \\nWednesday morning when I awoke to news of Donald Trump’s ascendancy to the position of President of the United States my first reaction was disbelief. I found myself wondering if I had jumped timelines overnight. Although I did my best to ignore the campaign that waged south of the border, with so many high octane soundbites it was impossible to tune out. Consequently, I was sure Hilary Clinton was a shoe-in. \\nTo shake off the surreal vibe, I headed to the kitchen for a bracing cup of coffee. Thinking that the biggest shock of my day was now behind me, I was ill-prepared for the turmoil that lurked on my laptop. Facebook and email were abuzz with upset posts. Although there were plenty of celebratory message by elated Trump supporters, the majority of reactions I read were negative. Even more distressing were the conflicts that erupted online between friends and coworkers. \\nRather than weighing into the fray, I energetically cleared myself and readjusted my focus to a higher perspective . I then channeled divine love and sent it out into the world for all in need of reassurance. While in communion with my highest self, I also put my faith in my highest self to bring me divine guidance so I could help people deal with their distress. This is when I was reminded of my activities the day prior. Soul Ages \\nOn Tuesday, the day of the U.S. election, I was guided to revisit a book I had read several years ago called The Instruction. In it, author and psychic Ainslie MacLeod described soul ages in a very enlightening manner. Before I proceed in explaining the difference in soul ages, I should point out that all souls are the same age because we are eternal, but we employ the term ‘soul age’ as an indication of the amount of Earth / 3D experience a being has. Young and Old Souls \\nFor simplicity sake, MacLeod broke soul ages into 10 levels. He then sub-divided them into two groups. The first five levels represent young souls, with the remaining five being old souls. Each Earth lesson mastered helps the soul to mature. Souls who complete their Earthly education finish at Level 10. At this point, the soul is ready to ‘graduate’ or ascend Home. \\nThe difference between young and old souls is their primary motivation. Young souls are motivated by fear, leading to the need for security, safety and ultimately, power. Old souls are motivated by love, which drives their need to self-perfect, self-heal and ultimately transcend polarity back into unity consciousness and divine love. This is not to say that young souls are unloving and old souls are never scared. Both young and old souls feel fear and love. Young Souls and Politics \\nA soul’s journey begins with the basics of Level 1, and then progresses through the levels, learning increasingly more complex lessons as it goes. Young souls are driven by a need to protect themselves. Weapons, walls, armies, and strictly enforced laws are all part of that protection. They crave structure and conformity in their personal lives too. This includes moral codes, fundamental religious practices and a traditional family and social structures. The younger the soul the more black-and-white his or her perspective. \\nAt Level 4 the soul has acquired enough 3D/Earth experience to start branching out into the world. Evolving from fear to love is hard, but given enough time and experience most young souls eventually master their fear to become paragons of confidence, worldliness and leadership. In fact, the majority of politicians are Level 5 souls. This is the group who rules the world. They thrive on power, money and prestige. \\nIt’s interesting to note that Level 5 politicians rely heavily on the support of Level 3 souls, such as in the case of war. The politicians who make the decision to engage in conflict need soldiers to fight, the majority of whom come from Level 3. In turn, Level 3 souls tend to idealize their leaders, along with their country, so this is truly a symbiotic relationship. Old Souls \\nBy contrast, Levels 6 – 10 are old souls. They look inwards for strength, guidance and inspiration . \\nLevel 6 is the hardest in some ways because they remember feeling on top of the world and having all the answers. Now, they’ve gone through a spiritual awakening which shattered their paradigm and left them unsure of themselves and their world. Through a spiritual connection, they begin to find their way, eventually regaining their sense of purpose. \\nSubsequent levels draw heavily on intuition to help them bring amazing creations, inventions and works of art into the world. At Level 8 many became activists for worthy causes such as environmental issues. This frequently pits them against the younger souled politicians. By Level 9, the soul is knee-deep in self-healing. \\nThen, by Level 10, souls are so peaceful in their own skin that they no longer are concerned with prior Earthly pursuits. These senior citizen souls are quite baffling to young souls who see them as eccentric and rather strange. In fact, old souls and their ways, tend to scare young souls. Soul Ages and the US Election \\nBy now, you’ve probably figured out that connection between soul ages and the President Elect Donald Trump. In case not, it’s very simple: Trump ran on a platform that appealed to young souls. The concepts of wall-building and limiting immigration, for example, appeal to people who are innately afraid of what lies beyond their borders. Think back to the Middle Ages and earlier, when the majority of souls were young, and thus needed the protective walls of fortified towns. The concept may seem archaic to old souls but, rather than judging, it’s important to keep in mind that every old soul went through a similar young soul journey. Collective consciousness may have evolved beyond medieval times, but there are still pockets of souls who are learning young soul lessons. Earth School \\nTaking the educational model a step farther, imagine Earth as a one room schoolhouse. Grades 1 – 12 (soul ages 1 – 10) are all together in the same classroom. The younger students (young souls) on the left side and the older students (old souls) on the right. Within those two sides, students are grouped together with others in the same grade level so that they can learn cooperatively. Throughout each day, the teacher (life) delivers lessons to each group. Afterward, students work on their assignments with the help of their peers. \\nOld souls tend to forget what it is like to be a young soul, just as young souls struggle to understand old souls . Such is life. Even though we’re all here together, we’re not all working on the same lessons at the same time. \\nLife is based on mastery learning; souls learn at their own pace. Some have lived 100s or even 1000s of past lives, whereas others have only been here a handful of times. It’s important to keep that perspective when dealing with souls who are at different levels than you. After all, it is folly to expect a student in grade 2 to understand grade 11 Calculus. That doesn’t mean the student won’t one day excel at Calculus; it’s just not going to happen in this lifetime. The Bifurcation of Worlds \\nThe election in the US shone a spotlight on the chasm between young and old souls. That gap was always there, but now everyone is acutely aware of it. I believe the election is serving as a catalyst for the separation in worlds. Old souls are preparing to graduate and go on to university ( ascend into 5D ), whereas the young souls are staying here to carry on with their 3D education. The divisiveness and shocking nature of the election campaign and results is helping to polarize the two soul groups while, at the same time, awakening those who would like to move into the higher dimensions. The Solution? Old Soul Compassion \\nAlthough it can be hard for everyone to see eye-to-eye, the ‘burden’ of compassion and understanding, rests on the shoulders of the old soul . If you’re reading this article, I assume you’re an old soul, therefore this message is for you: You, Old Soul, have the experience and wisdom needed to find a place of loving compassion in your heart for the struggle of the young souls. You also have the ability to channel love and peace into the world through your heart and soul connection. The vibration of love is much higher, and therefore far more powerful, than fear and hate. \\nSo, when you see something that causes you fear and/or anger, resist the urge to give into the darkness. Instead, meditate; or, clear yourself, breathe deeply; and think of somebody you love in order to move your consciousness into your heart. Then, focus on the peace within, and let your divine love flow outward in all directions. In doing so you are helping to heal the very influence that upset you while also raising your vibration and that of the ascending Earth. Addendum: Beyond Soul Ages \\nAs a side note, I wish to add that soul ages are but one factor at play here. Not all pro-Trump votes came from young souls. In fact, many old souls chose Trump due to his lack of affiliation, and unwillingness to cooperate, with the puppet masters who have long wielded the true power behind the government. This, too, is part of the transformation and separation of worlds. But that’s a topic for another article! \\nAbout the Author : Kim Hutchinson of ClayhutHealing.ca is a Mystical Guiding Star whose soul journeys through time, space and dimensions to offer healing to people worldwide. Kim specializes in Multidimensional Dream Healing. RELATED ARTICLES FROM IN5D: '"}, "time": 1742562711.1246088}