{"duration": 0.06673312187194824, "input_args": {"text": "'ReadyNutrition Guys and Gals, “Old Man Winter” is starting to rear his ugly head. Yeah, so what? So there is a difference this year on three fronts. The first has to do with the weather itself, and the second is the situation in the U.S. and the world. Throughout history winter has been (at times) so severe as to cause large numbers of deaths and great hardships. Throughout history warfare has been conducted during the winter months after the harvest has been taken in. Between you and I, the harvest is being taken in, and the whole world has been on the brink of war for quite some time. The third front: in the U.S., with the election.\\nWeather, War and Domestic Issues Could be a Recipe for Disaster Let’s address the weather portion first. Think Progress posted an article on the polar vortex shift that will affect our winter considerably. The polar vortex is usually “confined” to an area around the North Pole. It is a gigantic, constantly-moving system of air that is circulating and swirling. As the site mentioned, the last polar vortex shift affected more than 200 million people in 2014. I can attest to the fact that I was one of them: in January of 2014, it was -26 Fahrenheit outside of my cabin, and never rose above -10 Fahrenheit for almost the entire month.\\nFrom the perspective of a global war, the Ukrainian-Russian situation is intensifying with the Ukrainian Army moving troops and equipment into Eastern Ukraine for operations against the separatists. As we speak, a Russian fleet is sailing toward Syria. The fighting in Syria between Assad’s forces and the Russian army and the Islamic terrorists is burning fiercely. The U.S. and Russia are facing off toward a nuclear war. North Korea continues to test missiles and threatens an EMP (Electromagnetic Pulse) and/or nuclear attack on the U.S. about once a week.\\nThat “third front” of the domestic situation in the U.S…. believe it or not, here is the highest potential for something bad to occur. Such is because Obama will think nothing of enacting Martial Law with either the advent of civil unrest and rioting, and/or a nuclear war. The volatility and unpredictability of the situation can be the undoing of the entire country.\\nHow to Prepare for Winter-Related Emergencies So what does this have to do with winter? Everything . Everything you can imagine. All the supplies in the world won’t do you any good if you have no way to heat your home , cook your food, and stay warm at night. Hope all of your home-canning supplies and provisions are in wide-mouth Mason jars. Hope you have a plan in effect, ready to go. And if not? Here’s a few suggestions.\\nYou can pick up a small, portable woodstove that will burn between 50-100,000 BTU’s that will fit right inside of your fireplace. It might be a good idea to get one of them. A good wood supply (in past articles I’ve been telling everyone how important it is to build up their wood supply in the summer and early fall) that is kept dry and is well-seasoned. As well, having some fatwood or quick ways to start a fire will help you expedite the process to warm the home. Plastic, weather stripping , aerosol foam insulation , and aerosol rubber weatherizing spray : these should be in your arsenal to patch holes and close up any gaps in your house to completely weatherize it. Tools : hammers, chainsaws, bowsaws, axes, hatchets, and mauls: to split and cut wood if necessary. The primitive saws are good, especially if you want to save the gas. Generators : I recommend the Honda 2000 EU i that is as quiet as a mouse. If you buy two of them, you can couple them and double the power output. They also run on eco drive to conserve fuel, and can be fitted. On bottled water : I have a well, and I use old Gatorade and Powerade bottles to store my water, and rotate it frequently. If you have bottled water in the manner that I do, then make sure you are about ¾ full on the bottles, to leave room for expansion if the bottle freezes. Then you’re still sure about the water, and it won’t burst through the bottle. If your refrigerator goes out (lack of power): have coolers so that you can store your food outside. Better frozen than rotten, and except for eggs, most everything can be frozen and then thawed out and used again. Warm clothing and blankets : especially sleeping bags. I prefer extreme cold weather Army issue (the newer stuff with Thinsulate) and Gore-Tex cover . Small stoves : I recommend the ones running on dual fuel (such as the Coleman Peak series for single burner stoves), as well as the two and three burner Colemans with the green exterior. Port-a-potty with plenty of extra bag-liners : subjected to a polar vortex and then getting hit with an EMP is the combination for problems with the toilet , whether on a municipal system or a septic system. Use the port-a-potty that is in the shape of a chair with a bucket, lid, and seat incorporated. You can always burn the waste later, and you’ll conserve on water as well as prevent any plumbing problems from looming up. It would also behoove you to stock up on matches, lighters, and fire-starting equipment. The more you prepare now, the better it will be for you when you face all of these and similar challenges. It is part of your daily planning that you have, so that you’re planning ahead instead of playing catch-up from working behind. Keep fighting that good fight, and stay warm! JJ out! \\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson was a Special Forces Medic, EMT and ACLS-certified, with comprehensive training in wilderness survival, rescue, and patient-extraction. He is a Certified Master Herbalist and a graduate of the Global College of Natural Medicine of Santa Ana, CA. A graduate of the U.S. Army’s survival course of SERE school (Survival Evasion Resistance Escape), Mr. Johnson also successfully completed the Montana Master Food Preserver Course for home-canning, smoking, and dehydrating foods.\\nMr. Johnson dries and tinctures a wide variety of medicinal herbs taken by wild crafting and cultivation, in addition to preserving and canning his own food. An expert in land navigation, survival, mountaineering, and parachuting as trained by the United States Army, Mr. Johnson is an ardent advocate for preparedness, self-sufficiency, and long-term disaster sustainability for families. He and his wife survived Hurricane Katrina and its aftermath. Cross-trained as a Special Forces Engineer, he is an expert in supply, logistics, transport, and long-term storage of perishable materials, having incorporated many of these techniques plus some unique innovations in his own homestead.\\nMr. Johnson brings practical, tested experience firmly rooted in formal education to his writings and to our team. He and his wife live in a cabin in the mountains of Western Montana with their three cats.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 2nd, 2016 Keeping Warm in Winter When You Lose Power this Winter, Here’s What… How to Build a Winter Home Emergency Kit How to Get a Year Supply of Firewood for $20! Seven Places Where WW3 Could Start at Any Time '"}, "time": 1742628516.3483274}