{"duration": 0.0315394401550293, "input_args": {"text": "'Stock Market Plunges As FBI Re-Open Clinton Investigation Wall Street is gripped by fear the \"system is about to be shaken up\", analysts say Posted on October 29, 2016 by Baxter Dmitry in News , US // 0 Comments \\nThe stock market plunged as the FBI announced it is reopening the investigation into Hillary Clinton’s use of private e-mail and mishandling of classified information, a politically explosive development just 11 days before the presidential election. FBI Dir just informed me, \"The FBI has learned of the existence of emails that appear to be pertinent to the investigation.\" Case reopened \\n— Jason Chaffetz (@jasoninthehouse) October 28, 2016 \\n“ In connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation ,” Director James Comey said in a letter to committee chairmen in Congress. “ I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information. ” \\nEndless scandals \\nComey said he can’t say how long the new investigation will take – raising the possibility that Clinton could go into Election Day on Nov. 9 with the new probe unresolved and still hanging over her campaign. \\nThe Dow Jones plunged 150 points as news of the investigation broke. Bloomberg reported , “ U.S. stocks erased gains as markets again showed themselves sensitive to perceptions about Clinton’s prospects. The Mexican peso dropped, a reflection of Trump’s plan to renegotiate trade pacts with the country and reduce immigration. “ \\nImpeachment \\nThere was also turmoil in betting markets, as the odds on a Trump presidency rose by double digits. Odds on a President Hillary Clinton being impeached in her first term also skyrocketed, as the Democratic nominee faces up to a future engulfed by endless scandal. On Thursday Clinton warned her supporters the next 11 days will be rocky – but the bumpy ride will continue long after the election. \\nThough Hillary remains favorite with betting markets, the pattern is remarkably similar to odds for Brexit in the weeks before the vote. The Remain camp was considered a certainty until weeks before the referendum, with a sharp dive in the last week. Analysts believe a repeat of the British anti-establishment vote is on the cards. \\nOne of Hillary Clinton’s most vocal critics on the business side is finance commentator and markets expert Jim Rickards. Jim is on a world tour promoting his book, ‘The Road to Ruin – The Global Elites’ Secret Plan for the Next Financial Crisis’ and gave an interesting interview on ABC Australia. \\nRickards says that the polls are misleading and Trump “ will probably win ” and, if he does stock markets, so heavily invested in a Clinton win will crash 10% and gold will rise $100 over night. \\n“Bigger than Watergate” \\nTrump celebrated the FBI’s decision at a Friday afternoon rally in New Hampshire. \\n“ This is bigger than Watergate ,” Trump told the crowd, which began chanting “ lock her up ” after he told them about the probe. \\n“ I have great respect that the FBI and Department of Justice have the courage to right the horrible mistake that they made ,” Trump said. “ This was a grave miscarriage of justice that the American people fully understood .” \\nHouse Speaker Paul Ryan, a Wisconsin Republican, said in a statement that “ This decision, long overdue, is the result of her reckless use of a private email server, and her refusal to be forthcoming with federal investigators. ”'"}, "time": 1742628472.5694048}