{"duration": 0.06074047088623047, "input_args": {"text": "'Is California Governor Jerry Brown preparing to run for President against Donald Trump in 2020? Today, as I listened live to his State of the State address, I couldn’t help but thinking that Brown sure sounds like he wishes he ran in 2016. [After swearing in Xavier Becerra as the new California Attorney General, to replace the seat vacated by   Senator Kamala Harris ( ) Governor Brown launched into what sounded much more like an opening bid for a presidential campaign against Donald Trump, rather than the bitterly   tirade most expected after reading the title of his speech: “California is Not Turning Back, Not Now, Not Ever. ”  Even though the word “Trump” was not in the speech, Brown’s focus was unmistakeable.  Instead of addressing the real state of the state  —   the faltering economy in what has become one of the most unfriendly states to business owners  —   Brown bragged about how great California is, and threw down the gauntlet to Washington, D. C. He waxed poetic about how California is still the sixth largest economy in the world, and tied the future of the nation to California’s destiny: “When California does well, America does well  …    when California hurts, America hurts. ” The   governor was surprisingly animated, upbeat and optimistic. Describing California as the “beacon of hope to the rest of the world,” his short speech revisited what he described as California’s successes of his past terms in office: All these items were received in the   chamber with raucous cheers and loud applause that seemed more appropriate at a campaign rally than the august Assembly chamber. At one point, Brown went uncharacteristically off script and again sounded like he wished he were president when claiming he would fight to defend for “Planned Parenthood” funding. It is unclear how he plans to keep that promise, as leader of the state likely to have the least influence in the Trump administration. Gov. Brown went to great lengths to highlight and praise the role of immigrants in California’s success, erasing the line between legal and illegal immigrant. When it came to the epic battle so many California Democrats have picked with President Trump, Brown’s approach was more intellectual. He discussed how his family came to California, mentioned his father being governor 60 years ago, and  ending that reverie with an exhortation to fight the federal government with a “spirit that will get us through the difficulties ahead. ” California’s   governor reserved his toughest words for the “new oresident” over climate change. Brown acknowledged the “deep divisions,” stating that “alternative facts” and “attacks on science” were deeply disturbing.   He warned that democracy is a   system, and that in the massive protests over the weekend, we “witnessed vast, inspiring fervor” that represented the true heart of the people. In one moment that was classic Brown  —   and perhaps why he earned the name “Moonbeam”  —   he praised Trump for wanting to build roads, bridges and railroads (with a chuckle over the   rail debacle) and said in a whimsical way, sounding more like a hippie than governor of the largest state: “Amen to that, brother!” And that wasn’t the only area where Brown sought to be seen as a leader of more than just his own party. At one point near the end of the speech, he called out his more vitriolic colleagues to accept “reality” and work to be more respectful of “Republicans”  —   who really are people, too. But that’s not likely to distract many Californians from the stark reality of what was once their California dream. Brown inadvertently revealed the true state of the state  —     overtaxed, and over committed to the point it cannot even repair the state highways or pay out pensions owed without levying yet another tax. Surprisingly, Brown acknowledged federal supremacy in the area of immigration, but then highlighted how California has staked out protections for “undocumented Californians,” reiterating his commitment to defy any enforcement of federal law that threatens illegal aliens in the state. Bragging that California had become a sanctuary state under the Trust Act  —   which allows no criminal aliens to be turned over to federal authorities for deportation  —   and granted drivers licenses for illegal aliens, as well as giving them   free college tuition, Brown made it clear he will defend the state he described as the “Great Exception. ” By acknowledging that Covered California (the state’s version of ObamaCare) requires tens of billions in funding from the federal government, Gov. Brown gave President Trump an opening  —   and revealed the Golden State’s Achilles heel.  By repealing ObamaCare, and ending this massive subsidy, California’s budget will fail. California may be an exceptional state in many ways, but it will not be the “great exception” when it comes to basic budget math. To borrow the governor’s own words, you can’t make 2 times 2 equal anything but 4  —   not even in California. No wonder so many Americans are fleeing California for an “alternative reality”  —   one without Governor Jerry “Moonbeam” Brown. Tim Donnelly is a former California State Assemblyman. Author, Patriot Not Politician: Win or Go Homeless, FaceBook: https:  . facebook. . donnelly.  Twitter:  @PatriotNotPol'"}, "time": 1742562546.036471}