{"duration": 0.04481244087219238, "input_args": {"text": "'Wednesday on Fox News Channel’s “Hannity,”  deputy assistant to President Donald Trump weighed in on the report that former National Security Adviser Susan Rice was behind the “unmasking” of Trump transitional officials in raw intelligence after the 2016 presidential election.  Gorka explained how some Trump officials could be targeted for political means under the current requirements for surveillance. “Look, the president has been explicit here, Sean,” Gorka said. “We’re going to allow the mandated authorities  —   the congressional committees to do their work. We’re not going to do witch hunts. That’s what the left radical, progressive political elite does with their enemies. So, we’re going to let the system deal with this as it should. ” “But again, your guests, I listen to your radio show as I was coming into the show today,” he continued. “You had a former operative talk about how it’s not rocket science to engineer a network analysis of telephone calls, who is calling who. If you want to attack me or Steve Bannon or Steve Miller or Kellyanne Conway, you say, ‘Oh, they regularly call their nephew in Canada. Well, that’s a foreigner. I don’t need the same kind of intelligence authorities to intercept a foreign call. Then you start to find a way to unmask all of these conversations so that you can make political profit. That’s a very, very tenable theory. And that’s the kind of thing we have to find out if it was really happening. Because if that’s the case, that is weaponizing intelligence for political purposes against your other party. ” When asked by Hannity how this compared to Watergate, Gorka suggested it paled in comparison. “Losing 14 minutes of audiotape in comparison to this is a little spat in the sandbox in the kindergarten,” Gorka replied. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563666.0284271}