{"duration": 0.14101696014404297, "input_args": {"text": "'Liberals are ecstatic that a judge in Hawaii is writing immigration policy for the entire country, and that policy is: We have no right to tell anyone that he can’t live in America. (Unless they’re Christians  —   those guys we can keep out. )[As subtly alluded to in the subtitle of Adios, America: The Left’s Plan to Turn Our Country into a Third World Hellhole, the goal of liberals is for the poor of the world to have a constitutional right to come here whenever they want.  I can’t help but notice that the Third Worlders aren’t moving to liberals’ neighborhoods. After nearly 1 million Rwandans were murdered by other Rwandans in 1994, our government asked itself: Why not bring more of this fascinating Rwandan culture to America? Ten thousand of them poured in. So far, nearly 400 have been convicted in the United States of lying on visa applications about their role in the genocide. And that’s why we have to tighten our belt, America! Massive international investigations don’t come cheap. Almost every immigration case is a con, something we find out every time there’s a San Bernardino shooting and half the familyturns out to have scammed our immigration officials. One hundred percent of the “humanitarian” cases are frauds. Earlier this month, Rwanda’s Gervais Ngombwa was convicted for lying on his immigration application by claiming to have been a victim of the 1994 genocide. In fact, he was a   perpetrator  —   even featured in Rwandan newspaper articles as a leader of the genocide. For most of the last two decades, Ngombwa has been living in Iowa with his wife and eight children in a house built by Habitat for Humanity  —   because no Americans need houses. He came to the authorities’ attention a couple years ago by setting that house on fire after a domestic dispute, then filing a fraudulent $75, 000 insurance claim. Another Rwandan genocidalist living in America was featured in Adios, America: Beatrice Munyenyezi, granted refugee status as an alleged victim of the genocide, even though she, too, had helped orchestrate it. Munyenyezi was living safely living in Kenya when she applied for a refugee visa to America. The welfare is way better here. And, luckily for us, she had a “chronic medical condition” that required constant attention from a New Hampshire hospital. Hesham Mohamed Hadayet arrived in the U. S. on a tourist visa, then immediately applied for “asylum” on the grounds that he was persecuted in Egypt  —   for being a member of an Islamic terrorist group. Being a member of a noted terrorist group cannot be used to block you from coming to America, thanks to Barney Frank’s 1989 amendment to the Immigration and Naturalization Act, because liberals love this country so very, very much. Being a talented neurosurgeon from Switzerland, however, is disqualifying. Hadayet’s refugee application wasn’t denied until he’d already been living here for three years. When he was called in for a visa overstay hearing, he didn’t show up, and the INS didn’t bother looking for him. After allowing Hadayet to mill about America for another year, our government granted him permanent residency and a work permit. On the Fourth of July following the   attack, Hadayet shot up the El Al ticket counter at the Los Angeles International Airport. I guess the Egyptians were right! As bodies were being cleared away from the ticket counter, including Hadayet’s, his wife blamed America for the attack, denying her husband had anything to do with it. “He is a victim of injustice,” she explained. “In America, they hate Islam and Arabs after Sept. 11. ” At least immigrants are grateful. Immigration bureaucrats are so determined to transform America without anyone seeing what they’re doing that the INS initially refused to release Hadayet’s file to congressional investigators, in order to protect his “privacy. ” Of course, anybody could miss Egypt’s designating someone a terrorist. And maybe the INS’s test for Rwandan “refugees” is: Would this person be able to convince Rolling Stone magazine that “Haven Monahan” raped her? How about Rasmea Yousef Odeh? She waltzed into America after having been convicted and imprisoned in Israel for a supermarket bombing that left two Hebrew University students dead, and also for the attempted bombing of the British consulate in Israel. She was released in a prisoner exchange  —   whereupon Odeh made a beeline for the U. S. True, Odeh wasn’t subjected to the   vetting accorded the humanitarian cases, like the Boston Marathon bombers (we were warned by Russia) Hadayet (we were warned by Egypt) or the Blind Sheik (same). But how did our immigration authorities miss a CONVICTION FOR BOMBING IN ISRAEL? Apart from the terrorism, welfare, and fraud, what great things did any of them do for our country? Ngombwa was a custodian at the Cedar Rapids Community School District in Iowa, a job that, evidently, no American would do. Munyenyezi had a job as an advocate for refugees  —   just one of the many jobs being created by immigrants. Hadayet ran a failing limousine company and was $10, 000 in debt. Odeh was an unemployed waitress and a Palestinian grievance activist. Recently, she’s been heavily involved in     male protests, because who doesn’t like incessant Third World unrest? In 1960, 75 percent of the   in America were from Europe. Today only about 10 percent are. More than a third of all post —  Teddy Kennedy act immigrants  —   not just the wretched humanitarian cases  —   don’t even have a high school diploma. What is the affirmative case for this? How is it making America better? Improving the schools? The job market? Crime? The likelihood of terrorism? Can the liberals doing cartwheels over a district judge’s announcement that everyone in the world has a right to come here (except Europeans and Christians) give us the   analysis they’re using? Twenty million Third World immigrants give us ( __ ) terrorists, ( __ ) welfare recipients, ( __ ) uncompensated medical costs, ( __ ) discrimination lawsuits, but it’s all worth it because ( _________________ )?'"}, "time": 1742561919.4781885}