{"duration": 0.044788360595703125, "input_args": {"text": "'By Claire Bernish at thefreethoughtproject.com\\nPresident Obama contemplated arming the already controversial ‘moderate’ Syrian rebels weapons to “defend themselves against Russian aircraft and artillery” as his Plan B for Syria when all else failed in the effort to oust Assad — but although this treacherous plan has been effectively shelved, it remains an option for whomever next ascends to the White House.\\nAccording to a new report from the Washington Post , Obama’s Plan B has neither been “approved or rejected” in the U.S.’ disintegrating and increasingly complex campaign to depose Syrian President Bashar al Assad — which has, of course, precipitated a perilous proxy war with staunch Syrian ally, Russia.\\nSkepticism over allowing the CIA to provide various anti-Assad terrorists — euphemistically termed moderate rebels by the U.S. — with “truck-mounted antiaircraft weapons that could help rebel units but would be difficult for a terrorist group to conceal and use against civilian aircraft” apparently forced the plan to be tabled, the Post reports.\\nIn the U.S. program to topple Assad, the CIA has armed and trained defectors from Syrian military known as the Free Syrian Army — whose own defectors went on to form the Islamic State — as well as other terroristic groups virtually indistinguishable from one another except for their political ideologies.\\nThese issues factored into restrictions on weapons the U.S. would provide to their sponsored rebels; but, as the Post explains:\\n“Rebels chafed at the restriction, complaining that it left them vulnerable to air attack by Assad and, more recently, Russia.”\\nPlan B was envisaged as a compromise by the CIA.\\nBut the complex state of affairs in Syria has led not only the FSA, but other ‘moderates,’ to ‘radicalize’ — complicating U.S.’ goals and frustrating Russian efforts to purge the embattled nation of terrorists. While the Pentagon’s public goal has duly sought to wrest control from Assad and fight the Islamic State, the CIA program of arming rebels is widely considered counterproductive — if not, perhaps, nefarious.\\nPlan B, despite potentially devastating repercussions, retains stolid support from top officials, including unsurprisingly CIA Director John Brennan and Secretary of Defense Ashton Carter — but has lost favor recently with former proponents, including Secretary of State John Kerry.\\nKerry and other skeptics rightly grasp providing heavy artillery to rebels fighting Russia-backed Syrian government forces to down Russian aircraft — which would undoubtedly turn the smoldering U.S. proxy battle into an all-out war with Russia.\\nAdditionally, the Post reports, a growing number of U.S. officials feel the contentious CIA program has only proven to bedevil the ultimate goal of regime change, and, as one unnamed ‘senior official’ noted, CIA units are “not doing any better on the battlefield, they’re up against a more formidable adversary, and they’re increasingly dominated by extremists,” adding, “What has this program become, and how will history record this effort?”'"}, "time": 1742562189.376228}