{"duration": 0.05990743637084961, "input_args": {"text": "'Mexicans are Whining About Illegal Immigrants Stealing Their Jobs \\nZeiger October 29, 2016 Why can’t I hold all these illegals? \\n“When South America sends its people, they’re not sending their best. They’re not sending you, Jose. They’re not sending you. They’re sending people that have lots of problems, and they’re bringing those problems with us. They’re bringing drugs. They’re bringing crime. They’re rapists. And some, I assume, are good people. \\n“It’s time to erect a great wall on the southern border of Mexico and keep our borders secure. Let’s make Mexico great again.” \\nWFAA 8 : \\nThis sweltering Mexican village sits about 1,200 miles south of Texas, but the complaints about foreigners would sound familiar in the Lone Star State: People crossing the river illegally from the south are driving down wages, taking over neighborhoods and taxing social services. Others are gaming the countryâ\\x80\\x99s legal immigration system by overstaying their visas. \\nTens of thousands of Central American migrants have passed through here fleeing their homelands, most trekking northward to seek asylum in the United States. But an increasing number are stopping and settling just north of the Suchiate River, the shallow body of water that separates Guatemala and Mexico. \\nWhether they are biding their time or looking for permanent residency, the uninvited arrivals have tapped into a nativism that puts more pressure on an already tense and poverty-stricken region of Mexico. \\nâ\\x80\\x9cIn Arriaga, there are neighborhoods that are made up entirely of immigrants from El Salvador and Guatemala,â\\x80\\x9d said Jose Maria Morales Cruz, a retired teacher who was born and raised in the small town. â\\x80\\x9cAnd those who live here now donâ\\x80\\x99t want to continue to the other side. Here, they are supported by their fellow countrymen.â\\x80\\x9d Is that so? \\nWow, that really sucks, huh, Pedro? \\nYou have my full sympathies there. \\nYou should really seal those borders quick, I reckon. \\nMorales said he canâ\\x80\\x99t blame the immigrants for wanting a better life, some fleeing gang wars that have made Honduras and El Salvador two of the most violent countries in the world. After all, thousands of Mexicans have migrated for years to the United States, he said, leaving poverty and violence behind. But he can see why some Mexicans arenâ\\x80\\x99t high on the idea of immigrants originally headed for the United States staking a claim in Mexico. Just take a trip to an auto repair shop or other blue-collar business, he said, and youâ\\x80\\x99ll see why. \\nâ\\x80\\x9cThe people that are from here [earn] 80 or 100 pesos a day,â\\x80\\x9d Morales said. â\\x80\\x9c[Then] a Guatemalan or El Salvadoran comes and they are offered 50 or 60 pesos. And they accept because at least they can eat, right?” Haha, silly rednecks. Stop with your paranoia about having illegals stealing your jobs. Get educated. \\nMexicans canâ\\x80\\x99t do anything about the violence plaguing Central America, but if they want to understand why some Central Americans are settling in instead of moving on they can look to their own government, analysts argue. Another refrain familiar in Texas â\\x80\\x93 that the government has no control over the country’s borders â\\x80\\x93 echoes here. \\nIt’s hilarious that the Mexico is getting swamped by low-skill brown immigrants, while they’re encouraging their own poor people to illegally enter the US to send money back into the country. \\nWhat goes around, comes around, huh? \\nI wonder if they have Jews in Mexico screaming that it would be racist to shut down the southern border? I’ll bet they do. Everyone has these “people” in their country making them do things. \\nMaybe they can ask Trump to help them build their walls after the Glorious Leader rises to power. That is, after we’re done building our own wall, of course.'"}, "time": 1742563209.2239108}