{"duration": 1.4566643238067627, "input_args": {"text": "'Donald J. Trump implored supporters on Thursday to rally behind him by portraying himself as a victim of “false smears” from a growing number of women accusing him of making unwanted advances  —   a brazen attempt to stabilize his campaign amid a new round of criticism from Republican allies and a searing denunciation by Michelle Obama. By Thursday night, at least six women had publicly accused Mr. Trump of groping and forcibly kissing them over the decades, a pattern of sexual assault that he denied in the presidential debate on Sunday after bragging about such behavior in a 2005 recording that was unearthed last week. Mr. Trump dismissed all the allegations on Thursday and even lashed out at one of the women, a former writer for People magazine, seemingly implying that she was not attractive enough for him. “Look at her  —   look at her words,” Mr. Trump said at a rally in West Palm Beach, Fla. “I don’t think so. ” The allegations about Mr. Trump’s treatment of women became the   focus of the political world, a remarkable turn as the sexual history of a presidential nominee became a dominant and unavoidable issue in the final weeks of the race. Rarely, too, has a candidate in a general election so darkly insinuated that a conspiracy of forces was trying to undermine him and his admirers, as Mr. Trump did Thursday at events in the battleground states of Florida and Ohio. With Hillary Clinton assuming a low profile on Thursday to keep the public focus on Mr. Trump, Mrs. Obama drew wide praise from Democrats and on social media for her intensely personal remarks about the revulsion and depression that she felt over Mr. Trump’s comments about women. Speaking to several hundred voters and students at Southern New Hampshire University, Mrs. Obama said she could not “stop thinking about this  —   it has shaken me to my core. ” “This is disgraceful, it is intolerable, and it doesn’t matter what party you belong to,” Mrs. Obama said. “No woman deserves to be treated this way  —   none of us deserves this kind of abuse. ” The New York Times reported on Wednesday night that two women said Mr. Trump had touched them inappropriately, forcefully groping or kissing them. Their stories echoed a 2005 recording on which Mr. Trump boasts of being able to sexually assault women because of his celebrity. Other news organizations, including The Palm Beach Post, BuzzFeed and People magazine, also reported on women who had troubling encounters with Mr. Trump, who said at the debate Sunday that he had never acted on his “locker room talk” in the 2005 recording. In a series of messages posted on Twitter on Thursday morning, Mr. Trump called the Times article a “total fabrication” and denied charges by the People magazine writer, Natasha Stoynoff, that he had forced his tongue down her throat while she was working on an assignment about his first anniversary with his wife, Melania. But at his rallies in West Palm Beach and later in Cincinnati, Mr. Trump also unveiled a new campaign strategy, beseeching his supporters to view him as a political martyr for their cause and stick by him in the face of ugly accusations about his personal conduct. “I take all of these slings and arrows, gladly, for you,” Mr. Trump said to cheers in West Palm Beach. “I take them for our movement, so that we can have our country back. Our great civilization here in America and across the civilized world has come upon a moment of reckoning. ” Mr. Trump said that “a conspiracy against you, the American people” was underfoot, charging that the Clinton campaign, the news media and other forces were trying to vilify parts of the electorate that did not share their views. “The establishment and their media neighbors wield control over this nation through means that are very well known  —   anyone who challenges their control is deemed a sexist, a racist, a xenophobe and morally deformed,” Mr. Trump said. “They will seek to destroy everything about you, including your reputation. They will lie, lie, lie, and then again, they will do worse than that. They will do whatever’s necessary. ” And he spoke about how Mrs. Clinton had met “in secret with international banks to plot the destruction of U. S. sovereignty in order to enrich these global financial powers, her   friends and her donors,” phrasing that drew criticism from the   League as reminiscent of historical slurs against Jews. Mr. Trump also warned through his lawyer that he might sue The Times for libel if it did not retract the article and apologize. “Your article is reckless, defamatory and constitutes libel per se,” Marc E. Kasowitz, Mr. Trump’s lawyer, wrote in a letter to The Times. “It is apparent from, among other things, the timing of the article, that it is nothing more than a politically motivated effort to defeat Mr. Trump’s candidacy. ” David E. McCraw, vice president and assistant general counsel for the Times, wrote to Mr. Kasowitz that the newspaper “did what the law allows: We published newsworthy information about a subject of deep public concern. ” “If Mr. Trump disagrees, if he believes that American citizens had no right to hear what these women had to say and that the law of this country forces us and those who would dare to criticize him to stand silent or be punished, we welcome the opportunity to have a court set him straight,” Mr. McCraw wrote. The Clinton campaign said that the latest allegations showed that Mr. Trump was unfit to be president and that he lied in the debate Sunday. Mrs. Clinton, at a   in San Francisco on Thursday, leveled a broad attack on Mr. Trump over his past insults and treatment of people. “It’s more than just the way he degrades women, as horrible as that is,” she said. “He has attacked immigrants,   Latinos, people with disabilities, P. O. W. s, Muslims and our military, which he’s called a disaster. There’s hardly any part of America that he’s not targeted. ” At the rally in New Hampshire, Mrs. Obama was particularly withering about how Mr. Trump’s treatment of women was, in her view, a sign of weakness. “We simply cannot endure this or expose our children to it any longer, not for another minute, let alone another four years,” the first lady said. “Now is the time to stand up and say, Enough is enough. ” The Trump campaign has been thrown into turmoil by the allegations and the damage that the recording has done to his standing among women and with the Republican leaders who have disavowed him or revoked their endorsements. National and state polls show Mr. Trump’s support has plummeted in the last two weeks. In an effort to turn things around, he has stepped up his personal attacks on Mrs. Clinton and her husband, former President Bill Clinton, over his marital infidelity. Mr. Trump also dispatched his daughter Ivanka to the Pennsylvania suburbs on Thursday in the hope that she could lift his standing in the crucial swing state. Some of Mr. Trump’s staunchest allies have been unusually critical of him during the most difficult stretch of his campaign. Newt Gingrich, the former House speaker and presidential candidate in 2012 who wanted to be Mr. Trump’s running mate, suggested on Thursday that there were two Donald Trumps. “There’s a big Trump and a little Trump,” he said in an appearance on the Fox Business Network. “The little Trump is frankly pathetic. ” But at Mr. Trump’s rally in West Palm Beach, the candidate’s most ardent fans stood by him. Mr. Trump said that he would soon provide evidence that the allegations of improper behavior were not true. He claimed that the women who were coming forward were not properly vetted and that in some cases their stories did not add up. But it was The Times that was the particular target for his scorn. He said he was preparing to sue and contended that “the great editors of the past from The New York Times and others, ladies and gentleman, are spinning in their grave. ” Mr. Trump appeared to take comfort from the cheering crowd as he lamented the hurtfulness of the attacks he has been facing. Describing the “horror show of lies, deceptions and malicious attacks” Mr. Trump told his supporters: “This election will determine whether we remain a free nation or only the illusion of democracy, but are in fact controlled by a small handful of global special interests, rigging the system and our system is rigged. ”'"}, "time": 1742563762.5388467}