{"duration": 0.03669285774230957, "input_args": {"text": "\"Share on Facebook Medicinal marijuana is fast becoming more accepted as a a legitimate treatment thanks to scientific studies and patient's testaments. A recent change in legislation has created fears that Monsanto are about to try and cash in on this new treatment. Despite the fact that the U.S. Government are unwilling to change national laws, five states are about to vote to change their marijuana laws in November, and it looks likely that they will vote to join the states that have already legalized it. With more states choosing to legalese, there is a real fear that big pharmaceutical companies that are notorious for being profit-driven at the expense of health will wade into this new market. In 2015, it came to light that Monsanto, the agrochemical corporation wanted to get involved in the marijuana business. The news was met with a great deal of contempt from medicinal marijuana enthusiasts, and was followed by a statement from Monsanto that they had no interest in expanding into this field. In April, Spokeswoman, Charla Lord told the Willamette Week “Monsanto has not, is not and has no plans for working on cultivating cannabis.” But activists kept a close watch on Monsanto's movements and sure enough their suspicions were correct when it was revealed that they had made the first ever genetically modified strain of marijuana, and was also looking to patent the product. In an effort to stop Monsanto having the monopoly on this,a pioneering biotechnology startup based in Portland have launched an online interactive guide that maps the genetic evolution of the marijuana genome, thus making it public property and harder for Monsanto to lay a claim to it. The startup is called Phylos Bioscience, and it has been collecting samples of marijuana strains for over two years in order to sequence the plant's DNA. The are developing a software that presented a 3-D visualization of the data, and it is about to be revealed. Named 'Galaxy' the interactive guide allows you to take a tour round a three-dimensional projection of the genetic information they have drawn from the plant. Phylos Bioscience hope that by making this information public, they can keep the information in the hands of the underground societies where it began, and out of the hands of the commercial companies. Sales and Marketing Manager of Phylos Bioscience, Carolyn White has said “Sample collection was a huge part of this process. One side was a collaboration with growers, dispensaries and labs to collect modern samples, and the other a process of hunting down ancient landrace strains from all over the world.” “We've collected samples from all over the world, and cataloged the genetic information encoded in their DNA,” Dr Holmes, Phylos's chief science officer and molecular and evolutionary biologist and Phylos Bioscience co-founder told The New York Times. Because of this data collected by Phylos Bioscience, it could mean better protection of intellectual property rights of marijuana growers and keep it away from the likes of Monsanto. Related:\""}, "time": 1742628425.6364584}