{"duration": 0.03163599967956543, "input_args": {"text": "'49ers Fans Care More About Victories Than Kaepernick Elliott Almond, Mercury News, October 24, 2016 \\nColin Kaepernick’s first home start in a year didn’t stop the pessimism that has left red-jerseyed 49ers’ patrons in a football funk. \\nThousands of empty red seats at Levi’s Stadium underscored San Francisco’s freefall that continued unabated Sunday in a 34-17 defeat to the Tampa Bay Buccaneers. \\nFew were thinking about Kaepernick’s season-long activism in which he again kneeled during the national anthem to protest oppression against minorities. These days, fans just want to see their team win a game after six consecutive defeats. \\n{snip} \\nAfter leading the 49ers to a promising 14-0 first-quarter lead, Kaepernick and the offense sputtered. He completed just 16 of 34 passes for 134 yards with one touchdown and one interception. \\nKaepernick’s scrambling–he led the team with 84 rushing yards on nine carries–and occasional flashes of accurate downfield passing, weren’t enough, even with the 49ers firmly in the game midway through the fourth quarter. \\n{snip} \\nKaepernick donned a T-shirt Sunday paying tribute to the Black Panther Party, an Oakland activist group that celebrated its 50th anniversary this weekend. The quarterback said the shirt was a gift from his girlfriend, MTV host Nessa Diab. \\nLast week, he wore a shirt with Muhammad Ali’s face before the game at Buffalo. \\nKaepernick’s protest against police shootings of unarmed African Americans has been divisive because some say it is disrespectful to veterans. A recent survey by Yahoo Sports and YouGov found that a decline in NFL ratings partially is attributed to the quarterback’s action. \\n“I don’t know much about ratings and how they are affected,” he said in a postgame interview. “But I don’t understand why ratings would go down fighting for justice for people, to try to stop oppression, especially in the league that is predominately black.” \\n{snip}'"}, "time": 1742562412.333753}