{"duration": 0.08313798904418945, "input_args": {"text": "'November 2, 2016 555 Russian and Turkish military chiefs meet in Moscow today as Russia publicly demands withdrawal of all Jihadis from Aleppo. Share on Facebook Following the failure of the Al-Qaeda attempt to break the siege of the Jihadi held district of Aleppo, Russia’s President Vladimir Putin is giving the Jihadis in eastern Aleppo what is effectively an ultimatum. The terms of this ultimatum have been set out by General Valery Gerasimov, the Chief of the Russian military’s General Staff: “Taking into account that our American colleagues are incapable of separating the opposition from terrorists, we appeal to all the leaders of armed groups directly to stop combat actions and leave Aleppo with their arms.” (bold italics added) To this end two corridors have been opened to enable the Jihadis to retreat, one heading towards the Turkish border, and the other heading to the Al-Qaeda controlled western Syrian city of Idlib. In addition there are a further six humanitarian corridors for civilians to use if they want to leave. Gerasimov is currently engaged in meetings in Moscow with General Hulusi Akar , the Chief of the Turkish military’s General Staff, who is currently visiting him in Moscow. Having despaired of getting the US to separate Al-Qaeda/Jabhat Al-Nusra from the other Jihadis in Aleppo, and getting them to withdraw, it is likely the Russians are trying to agree the same thing with the Turks. Indeed Gerasimov’s comments today essentially say as much. Given that the Jihadis fighting in Syria totally depend on Turkey for their supplies, if the Turkish leadership tells them to quit eastern Aleppo there is a possibility that they may finally accept that the game is up and heed the call. The same thing has after all recently happened in other Syrian towns and cities, including in the formerly Jihadi controlled suburbs of Damascus. Note that Putin’s ultimatum is phrased differently from the way it was before. The Kerry-Lavrov agreement of 9th September 2016 offered the non Al-Qaeda Jihadis the option of staying in eastern Aleppo after they had separated themselves from Al-Qaeda/Jabhat Al-Nusra, who the agreement implicitly required to leave. In the subsequent discussions in the UN Security Council that took place around the proposed French Resolution, the Russians made it clear that the Al-Qaeda/Jabhat Al-Nusra was required to leave, and this was the demand the UN envoy Staffan de Mistura supposedly supported, though as I have discussed previously the terms under which he did it actually nullified it. Now Putin through Gerasimov is demanding that all Jihadi fighters in eastern Aleppo leave, irrespective of whether they belong to Al-Qaeda/Jabhat Al-Nusra or not. In other words over the course of the autumn, as the US has hesitated and reneged on its promises, the Russians have quietly raised their demands. They now want Aleppo totally rid of Jihadi fighters and handed over entirely to the Syrian government. This was surely the Russian objective all along, but it has now been made clear. As to what happens if the Jihadi fighters in eastern Aleppo reject this demand, Gerasimov pointed it out to them : “The militants’ efforts to break loose from the city have failed. The terrorists have suffered huge losses in manpower, weapons and equipment. They are unable to pull out of the city.” In other words the Jihadis in eastern Aleppo are trapped with no way out and no-one is coming to their rescue. According to RT’s Arabic service (as reported by the Iranian news agency Fars) the Jihadis have themselves admitted that they suffered casualties (dead and wounded) numbering between 2,200 and 2,500 men in their failed attempt to break the siege of eastern Aleppo over the last few days. Meanwhile the Syrian aligned Al-Masdar news agency is reporting that it has been told by a Syrian army source that following the deployment of elite and Special Forces troops to Aleppo, if the Syrian army returns to the offensive “unlike the previous offensives in Aleppo City, this assault will not be halted for any reason.” Gerasimov is reported to have said that the ceasefire to enable the Jihadis to retreat from Aleppo will take effect at 9:00 am local time on Friday 4th November 2016, and will expires at 7 pm on the same day. However if the Jihadis agree to leave Aleppo and take actual steps to do so, that period will presumably be extended. Much will probably depend on the outcome of the talks General Gerasimov is having with General Hulusi Akar today. '"}, "time": 1742563558.2644572}