{"duration": 0.12291264533996582, "input_args": {"text": "'INDIANAPOLIS  —   Back in June, Kanye West was rumored to be playing a secret concert at the New York club Webster Hall after Hot 97’s Summer Jam festival. Well after midnight, the street was filled with hundreds of young people waiting for a chance to see their hero. The show itself didn’t happen, but at one point, a car drove past, and Mr. West poked his head out of the sunroof. The crowd surged and surrounded him after a minute or two, the car pulled away from the throng, leaving a trail of fans chasing it up Third Avenue. It was a beautiful expression of fanaticism engineered by an artist who uses frenzy as paint. And it provided an unexpected foreshadowing of the opening night of Mr. West’s “Saint Pablo” tour  —   celebrating his February album, “The Life of Pablo”  —   which came to Bankers Life Fieldhouse here on Thursday night. This performance was like that scene writ large, captured in a consumable experience. There was no formal stage: Mr. West delivered the entire concert from platforms that hovered about 20 feet above the arena floor and beamed light in every direction. The platforms floated out above the crowd slowly, like an Imperial Star Destroyer soaring through space in “Star Wars. ” At one end of the room was a large screen projecting blurred images from cameras filming Mr. West from various angles, including the ceiling. For much of the night, Mr. West performed on a smallish square platform, tethered to the center by a rope that ran up under his coat as it tilted at various precarious angles. He moved in circles and danced across the floor, using the restraint as a tool at times he sat at the edge and let his feet dangle, and at one point lay prostrate and extended his hand to the crowd, offering a benediction. It made Mr. West both improbably close and tantalizingly out of reach. He was the host, but also a reveler. For the first 20 or so minutes, the crowd maintained a circle around the platform as it crept from one side of the room to the other, staring up at Mr. West and pointing their camera phones while he worked through the more bruising end of his catalog: “All Day,” “Famous,” “Mercy,” “Don’t Like (remix). ” But then, those in the throng realized that they could use the    space beneath Mr. West as well, and the floor became a   party, like a warehouse rave or, when the beers were flying, a mosh pit at a hardcore show. On each side of the floor, a couple of dozen speakers were blasting physically overwhelming bass, literally pushing fans away from the edges and toward the center. It was a minimalist, elaborately efficient way to deliver an arena show: It got Mr. West closer to both ends of the room, and also to both the fans on the floor and those in the cheap seats way up top. There was even blurring between the insiders and the outsiders  —   among the revelers on the floor were some of Mr. West’s intimates and members of his extended creative team: Virgil Abloh, Scooter Braun, Travis Scott, ASAP Bari. If you were on the floor, you could choose your own way to experience the show  —   in thrall to Mr. West in the sky, dancing in the light beneath him, or soaking it all in from the fringes. There was little distraction: Mr. West performed to a combination of prerecorded tracks and live accompaniment by the singer Tony Williams the producer and   Mike Dean and Caroline Shaw, the Pulitzer     composer and vocalist, all of them dressed in black and occupying a small stage at one end of the floor. Mr. West’s   innovation is the latest in a year full of them Drake, Beyoncé and Rihanna have all made concerted efforts on their tours to shrink oversize spaces, a reconsideration of the   power dynamic of   live concerts for the age of   intimacy and immediacy. The setup wasn’t without its complications, though. On two occasions, Mr. West stopped the music because he perceived the tangle of people beneath him to be a little too rowdy. And he spent much of the second half of the show on a larger platform  —   banging out a beat on an MPC for “Runaway,” speaking to the crowd and playing some brighter songs, like “Good Life” and “All of the Lights”  —   but stayed closer to the center of it, making him harder to see from the floor. Often Mr. West uses speeches during his shows as a way of collapsing the space between him and the audience, but given that this concert’s physical dynamism did that for him, he kept the talking to a minimum. He began one segment by saying, “Now that I have kids, my perspective has changed,” before thanking the chief executive of Nike, a company he’s had a contentious relationship with in the past, and also Adidas, his current footwear partner. He doubled down on his insistence that art and commerce should play nice. “Dreams are possible,” he said, but conceded, “Every day is a struggle. ” It was almost two hours into the performance at that point, and the crowd’s bubbling energy had crested and leveled off. The lights were brighter, and Mr. West remained contemplative, working through bits of “30 Hours” and “Real Friends,” some of the quieter moments from “The Life of Pablo. ” By the time he got to “Only One,” from 2014  —   delivered from the perspective of his mother, who died in 2007  —   the room was almost quiet. Here again, Mr. West played with spatial relations  —   not between him and the crowd, but between him and the unknown, as a circular red light descended over him like a portal to the heavens. Then came   snippets of the gospel choir in “Ultralight Beam,” delivering slashes of ecstatic faith, followed by the cleansing pulse of “Fade,” and a bath of ambient vocals and synthesizers. When the lights came up, Mr. West had evaporated into the mist.'"}, "time": 1742562545.7091093}