{"duration": 0.17484068870544434, "input_args": {"text": "'Print \\nWatching Hillary Clinton run from a hardball question like a roach from Raid should give every American a sense of satisfaction. When a reporter asked the former secretary of state about the Project Veritas undercover videos , which featured disgraced former Democratic operatives Scott Foval and Bob Creamer bragging about provoking violence at Trump rallies and perpetrating mass voter fraud, Clinton panicked and pulled the plug on the entire press conference. “I know nothing about this,” said Clinton. “I’m not — I can’t deal with every one of [James O’Keefe’s] conspiracy theories but I hope you all have something to eat and something to drink on the way back to New York. Thank you!” \\nConspiracy theories? Was she really trying to imply that videotaped confessions from two of her surrogates amount to a “conspiracy theory?” Yes, she was. It’s become something of a habit for her — every time Hillary wants to deny plain facts she calls them a “conspiracy theory” — which is quite delicious coming from Ms. “Vast Rightwing Conspiracy” herself. \\nTo call something a “conspiracy theory” doesn’t reveal much about its validity. Of course, some conspiracy theories are legitimately kooky. Tune in to Coast to Coast AM for a while to see what I’m talking about, or listen to Jesse Ventura expound on secret US government weather control machines in Alaska. Most of these loony conspiracy theories originate on the political Left, by the way, such as the assertion that Lee Harvey Oswald was “sheep-dipped” to look like a communist so that JFK’s real capitalist/imperialist murderers could make a clean getaway. \\nBut other conspiracy theories are at least plausible. Whenever two or more people plot in secret, that’s a conspiracy. Anyone who suspects that a conspiracy’s afoot is by definition a conspiracy theorist. If you come home from vacation to find a car parked on your lawn and the back yard strewn with red Solo cups, you might suspect that your teenaged sons conspired to throw a raging party. That’s a conspiracy theory. Watergate was a conspiracy among at least the four burglars. The ensuing coverup was a conspiracy that reached all the way up to the president. Watergate has been proven to most people’s satisfaction so we don’t think of it as a “theory” anymore, but there was a time, in the nascent stages of the investigation, when the whole picture was not yet known. In other words, it was a conspiracy theory — and yet it turned out to be true. \\nHillary Clinton employs the term “conspiracy theory” because of its derisive connotation. What she means by it is that a certain accusation — in this case that her campaign has engaged in illegal election tampering — is so absurd that it would be a waste of her time to respond. It’s crazy talk . File it over there with alien abductions and Illuminati shadow governments. \\nUnfortunately for Hillary, the “conspiracy theory” alleged by Project Veritas happens to be very credible. Just listen to Democratic operative Scott Foval’s videotaped confession: \\nWe’ve been busing people in to deal with you f***ing assholes [Republicans] for fifty years and we’re not going to stop now. We’re just going to find a different way to do it. \\nFoval’s “different way” is using rental cars rather than buses to get impostors from polling place to polling place on election day. That’s a conspiracy theory for sure but not an unreasonable one. It’s the same old shenanigans Democrats have been pulling since the heyday of Tammany Hall. Lying, cheating, and ballot box-stuffing — it’s what Democrats do. Richard Daley did it in Chicago, Lyndon Johnson did it in Texas, and Hillary Clinton’s doing it nationwide. \\nHillary Clinton and her media sycophants have gotten a lot of mileage out of the “conspiracy theory” dodge this election season. When Mrs. Clinton was haunted by persistent rumors of ill health, the media countered them with accusations of conspiratorial thinking. In a column conveniently titled “Can We Just Stop Talking About Hillary Clinton’s Health Now?” the Washington Post’s Chris Cillizza wrote : \\nBeyond the Clinton conspiracy theorists who believe she had something to do with Vince Foster’s death and that she was secretly responsible for everything from Y2K to the SpaceX explosion last week, it’s hard to plausibly insist, based on the available data, that Clinton is ill. \\nHuffPo contributor Melissa Jeltsen went even further, blaming both conspiratorial thinking and — you guess it! — bigotry : “Let’s get real: The wild conspiracy theories around Clinton’s health are a convenient way to mask misogyny inside ‘legitimate’ medical concerns.” \\nAs it turns out, those “conspiracy theories” weren’t so “wild” after all. Hillary Clinton later collapsed after a 9/11 memorial service but refused to go to the hospital for fear that her critics would be proven right. Thank goodness for camera phones — if the incident hadn’t been recorded, Hillary would be claiming that it never happened while maligning anyone who said otherwise as a nutty conspiracy theorist — and the press would be helping her. After the incident, Clinton admitted (or “admitted”) that she was stricken with walking pneumonia, a conveniently transitory illness. If you suspect that she suffers from a more permanent medical condition you’re probably a “conspiracy theorist.” It’s becoming painfully obvious that Hillary Clinton’s definition of a “conspiracy theory” is anything that contradicts her lies. \\nThe “conspiracy theorist” epithet has become the media’s lazy retort to every possible attack on their candidate — and make no mistake about it, she is their candidate. Earlier this month, CNN contributor Jackie Kucinich dismissed talk of Bill Clinton’s sexual assaults on various women as “conspiracy theory land,” which is frankly outrageous. Bill’s accusers form a line around the block, almost as long as Bill Cosby’s. We know at very least that he’s a sexual harasser and, if the most serious accusations lodged against him are true, a rapist as well. He has a track record that simply cannot be denied. Oddly enough this “conspiracy theory” would actually be a conspiracy theory if, as Kucinich implies, the accusers were lying because it would imply some shadowy group working behind the scenes to smear Bill Clinton with an endless barrage of slander. The simpler, non-conspiratorial explanation is just that Bill is a horndog off his leash. \\nJackie Kucinich is in fact a bona fide member of her own little conspiracy. In April 2015, the Clinton campaign held an “off the record” cocktail party with friendly reporters hosted at the Manhattan home of prominent Clinton supporter Joel Benenson. Among those journalists (if you can call them that) was Jackie Kucinich. According to a hacked email: \\nMuch of the group consists of influential reporters, anchors, and editors. The goals of the dinner include: (1) Giving reporters their first thoughts from team HRC in advance of the announcement (2) Setting expectations for the announcement and launch period (3) Framing the HRC message and framing the race (4) Enjoying a Frida[y] night drink before working more. [Emphasis added.] \\nWhile many reporters on the list have impotently protested that their presence at the event does not amount to media coordination with a campaign, it’s hard to make the case that Kucinich is not a Clinton lackey after she spouted Clinton campaign talking points about Bill’s predatory nature on national television. It takes a certain gall for Kucinich, one of Hillary Clinton’s known co-conspirators, to go on television and whine about “conspiracy theories.” \\nNearly everyone on earth harbors “conspiracy theories” because conspiracies really do happen. Most people, however, prefer not to think of their own conspiracy theories as such because of the negative connotation associated with the term. Some conspiracy theories are downright silly but others are quite plausible. There are enough real conspiracies in the world to concentrate on the ones that are reasonably substantiated, such as Hillary Clinton’s coordination with dirty tricksters Foval and Creamer. As the conspiracy theory television program The X-Files used to say, “The Truth Is Out There.” Don’t be afraid to pursue it.'"}, "time": 1742563361.047666}