{"duration": 0.2633523941040039, "input_args": {"text": "'Email \\nCaracas. \\nWhat happened last week in Venezuela has the appearance of a demolition derby. President Nicolás Maduro, whose PSUV socialist party is something like a rickety 1970s Thunderbird, picked up speed on Friday and smashed into the opposition’s equally crusty ride as it was lurking around the edges of the field, lost in daydreams about an easy transition. \\nIt was a good move. As a result of the collision, a few doors fell off Maduro’s already scrappy vehicle. The opposition, on the other hand, was left with an almost completely crippled and useless chassis. Moreover, Maduro had formerly assured that the Vatican’s hulking Impala station wagon — experienced in all kinds of fairground acts — was at hand to steamroll whatever remained in the field. \\nAs always, Venezuelan politics offers stunning demonstrations about how to struggle radically for power. Years of sitting on what is possibly the planet’s largest oil reserves have provided a rich training ground in power games that far exceed the imagination of most of the world’s politicians. This latest move on the part of the government was one that required careful balancing and timing, despite the smashup nature of its concluding step. \\nHere is how the whole thing happened. The government had been facing the ugly prospect of a referendum to revoke the president in 2017. This voting process, even if it wouldn’t take Chavism out of power (since the constitution dictates that the vice president will assume power if the president is revoked during the last two years of his term), would almost surely have showed high disapproval of the government. What to do? It was a burning question since the Venezuelan opposition had already won an ample majority of votes in last year’s parliamentary elections. \\nThe headquarters of actually-existing Chavism was not going to passively let itself be immolated. First, it worked out a way to slow the opposition’s apparently inexorable advance toward the referendum by having the Supreme Court rule that the twenty percent of the voting population’s signatures needed to go forward with this process should be collected in every one of Venezuela’s twenty-three states. This is something hard, though not impossible, for the opposition to do in states with dispersed populations. \\nHowever, it also worked on another more daring angle: that of claiming that the one-third of fraudulent or questionable signatures in the more than a million and a half signatures already collected to initiate the referendum process should invalidate the whole procedure and require the referendum’s indefinite postponement. \\nThis latter was a bold and dangerous move. So first the government bloc began testing the ground, by having the invalidation decision confirmed by lower penal courts. It only had the National Electoral Council pronounce once it had secured the support of the head of the military, Vladimir Padrino López. With that key piece in place, it revved up the apparatus’s engines and went barreling into the opposition with the new ruling, smashing up its prospects of a referendum. \\nMaduro is an experienced driver and knew that sparks would fly: that there would be yelps about violation of the rule of law, protests, international commotion, etc. Indeed, there was smoke and fire but in the end the Socialist Thunderbird, however clipped in the wings, would be sitting in the middle of the field with almost nothing else budging. \\nThis is all very interesting and surely worth studying in poli-sci departments worldwide. But is it good for anything except maintaining power? \\nThe truth is that the left finds itself up against the ropes globally. For that reason, the consensus in Cuba, China and Venezuela today seems to be that one must maintain power and sovereignty at any price. Even if it means smashing up your own apparatus and adopting two-thirds of the program of your enemy. In a radical revision of traditional leftist politics, today’s rebellious governments hope that by preserving a minimally sovereign platform, they will at some later day be able to resume advancing on the social front. \\nThis is a hope, but it is far from being a certainty. From their celestial repose, Marx and Lenin may be peering down at today’s leftist governments and be genuinely puzzled by their bizarre, even desperate politics. Yet those who have boots on the ground can look to Maduro and recognize that at least he is not doing nothing. Despite a few bruises on his forehead, the President is now humming My Way in a battered machine that undoubtedly dominates the field.'"}, "time": 1742562955.0141737}