{"duration": 0.09421038627624512, "input_args": {"text": "'Subscribe \\nDear GOP Presidential Candidate Donald Trump, \\nI just watched a portion of your interview from Sunday night and I was appalled. You seriously need to be put over someone’s knee. \\nYou are running for the highest leadership position in this country and you are carrying on like a spoiled little toddler, stomping your feet and throwing temper tantrums and hollering all over social media. Hollering things like “Stop calling me names!”“I hate you!”“You’re being mean to me!”“I’m telling my mommy!” are not things that an adult man does – those are things that a toddler does. \\nHere is a prime example : “In what is now a familiar pattern, Donald Trump took to Twitter following his interview in order to trash the interviewer and whine about how the questions were supposedly stacked against him.” \\nGuess what? Running this country is HARD. It isn’t for whiners. Not once have I heard President Obama whine about you running him through the ringer about his birth certificate. Not once have I heard him whine when people in public office have disrespected him. Not once have I heard him whine when Congress has voted against his programs simply because he is a black man and they don’t like him. Not once in almost seven years has that man whined that Fox News has said something bad about him. Not once. Let that sink in. \\nI ain’t your mommy, but I am a mom. Nothing more – Just A Mom. I have a normal kid. But for a few minutes here I’m going to pretend you’re my son because you really seem to need a mom’s advice. When my kid has a temper tantrum, she gets sent to her room. When she can talk calmly to adults, she is allowed to come out and we discuss what she did wrong. \\nI’m thinking that maybe no one ever did that for you. No one ever said “No” to you. You never got a spanking, literally or figuratively. \\nYou are acting like an insufferable ass. The United States is not a dictatorship. It is not a corporation that you can run into the ground and file bankruptcy on. It is a democratic government that is set up with three distinct branches of government. Those three branches of government are designed to act with a series of checks and balances to ensure that no one person has the authority or the ability to make horrid decisions, treat people in a sucky way, and waste our tax dollars on frivolities. \\nHere is a link to a children’s website , where they spell it out at a level that even you should be able to comprehend. \\nBy saying “ We’ll see “ every time the interviewer reminded you of this system of checks and balances you displayed your ignorance of how our government works. My 12-year-old knows more about government than you appear to. \\nThis is not a media circus for you to use to continue pumping hot air into the atmosphere. Global climate change is already a problem and your constant bloviating is causing more detrimental effects than the farting cows. Stop treating this campaign like your very own little playground. It isn’t. Our government is a democracy – that means that if hell freezes over and you do somehow manage to gain the presidency you work for us, the people of this country. \\nHere’s a thought – instead of building a wall that will cost billions, why don’t you propose an amnesty program that could be enacted for a couple million? The sheer cost of deporting millions of people, only to turn around and let them back in ‘legally’ is an astronomical burden to place on already over-burdened tax payers. It is also the DUMBEST idea I have ever heard. Does having all that money remove any shred of common sense? Do you possess any ability to think reasonably? \\nYou would be amazed at how many cost-cutting things can be enacted if you think about them and come up with common sense solutions. The end goal is what you want to accomplish. \\nSince your fellow Republicans are going to be the biggest stopping block on any type of an amnesty program – sell them on what they stand to GAIN from doing this as opposed to booting everyone out and building an asinine wall. \\nYou can’t just think about “The Donald” and how he feels about things. You have to consider each and every person in this country. You have to take our tax dollars and use them in the best way possible to make life better for us. This isn’t all about you. You’re just a potty-mouthed little boy that needs a bar of soap to wash your mouth out and a time-out to reflect on your actions lately. \\nYou can’t act like a spoiled little toddler if you expect to be taken seriously as a GOP presidential candidate. You need to stop that silliness right now. Get your head out of your ass and look around. You have no clue how to run a government. If you want to continue acting like a toddler, no one will ever take you seriously. The voters in this country will not subject themselves to being ruled by a spoiled brat. \\nGrow up, Donald.'"}, "time": 1742562206.3491328}