{"duration": 0.06533694267272949, "input_args": {"text": "'Trump convocará mañana mismo las elecciones a primera dama NO DESCARTA TENER UN EQUIPO \"COORDINADO Y EFICIENTE\" DE VARIAS PRIMERAS DAMAS Primera dama \\nCon la intención de garantizar que su mujer es “la mejor americana disponible en estos momentos”, el nuevo presidente de los Estados Unidos, Donald Trump, convocará con carácter de urgencia las elecciones a primera dama. “Las últimas elecciones demuestran que la democracia funciona, por lo que creo que la figura de la esposa del presidente no debe ser ajena a este proceso y su figura debe ser valorada y juzgada por todo el mundo”, ha declarado el magnate esta mañana desde Washington. \\n“No podemos estar seguros de que Melania sea la primera dama correcta si no se somete a una competición con todas las otras mujeres mayores de edad de los Estados Unidos”, ha explicado el nuevo presidente de los Estados Unidos. \\nSegún Trump, los americanos están ya acostumbrados a valorar y opinar sobre mujeres con severidad “por lo que votarlas en unas elecciones no será un problema”. \\n“Mañana pondremos en fila a todas las candidatas y yo mismo elegiré a la mejor en un proceso democrático transparente y justo”, ha insistido. \\nTrump, sin embargo, ha tenido unas palabras cariñosas con su actual esposa y confía en que no tendrá problemas en ser elegida primera. “Melania, mi actual mujer, ya superó un proceso muy duro de elección en su país de origen, en las bodegas del barco que la trajeron a Estados Unidos y en el sótano oscuro en el que a escogerla, no va a tener ningún problema en resultar vencedora en las elecciones”, ha explicado el presidente. \\nEl político también cree que sería bueno para el país que la primera dama “fueran dos mellizas” o incluso un equipo de primeras damas “a fin de garantizar la mayor eficiencia posible”. \\nPese a su confianza en Melania, fuentes de la Casa Blanca han informado de que Trump apuesta por el continuismo de Michele Obama en el cargo. “No sólo ha mostrado solvencia durante cuatro años sino que puede ser una experiencia interesante tanto para ella como para mí”, defiende el presidente. \\nSegún las fuentes, su hija Tiffany es otra de las candidatas preferidas por el propio Trump.'"}, "time": 1742564415.016317}