{"duration": 0.07729649543762207, "input_args": {"text": "'Tomi Lahren suggested in an interview that the Clintons are responsible for multiple murders.\\nA prominent journalist working at Glenn Beck’s TheBlaze who had endorsed Hillary Clinton is suggesting in a new interview that Bill and Hillary Clinton are responsible for multiple murders.\\nTomi Lahren spoke about comments she recently made about the Clintons having a high body count and that Bernie Sanders is only supporting Hillary out of fear he might mysteriously disappear in an interview on The Jamie Weinstein Show .\\nWeinstein asked Lahren during the interview: ‘You think Bernie Sanders is supporting Hillary Clinton because he’s afraid he is going to mysteriously disappear. You went on to say that the Clintons have a high body count. Do you believe that the Clintons really are killing people?’\\nShe responded by saying: ‘You know, sometimes we look at patterns and we look at things that are happening and sometimes you can’t dismiss everything as a conspiracy.’\\nWeinstein then asked Lahren if she was referring to the conspiracy theory held by some that the Clintons were somehow responsible for the death of Vince Foster, a close friend of the couple who was found dead in 1993 of what was later ruled to be a self-inflicted gunshot wound.\\n‘The list – I will let your listeners go on and look at some of these examples and they can decide for themselves,’ said Lahren.\\n‘But there’s been some mysterious circumstances that have surrounded – we just saw, what with the DNC leaks and then what happened to a person that worked for the DNC that was in charge of that?’\\nLahren was referring to the death of Seth Rich, who was murdered near his home in Washington DC this past July.\\nSoon after, DailyMail.com learned that he was set to start working for Hillary’s campaign.\\nWeinstein pointed out to Lahren that Rich’s parents said they do not suspect anything ‘suspicious,’ to which she replied: ‘Well, his family doesn’t want to be in a body bag either, Jamie.\\n‘I have got to be honest with you. What was it? He came in and was robbed, but his wallet and his watch weren’t taken? So he was robbed and what was he…’\\nAnd another claim: ‘Sometimes you can’t dismiss everything as a conspiracy,’ said Lahren (Clinton above with Vince Foster, whose death Lahren also finds mysterious)\\nOne more claim: Lahren also spoke about the death of DNC worker Seth Rich (above), saying his parents are keeping quiet out of fear of ending up in a ‘body bag’\\nAt this point Weinsten jumped in to say: ‘You think he might have been killed by the Clintons?’\\nLahren responded to this by stating: ‘I don’t know if he was killed by the Clintons or a Clinton hit person. I’m not going to sit here and be what you want me to be which is a conspiracy theorist, but I will say…’\\nWeinsten then cut in briefly to point out he was just asking Lahren questions.\\nLahren continued: “I think there are a lot of circumstances that surround the Clinton family that aren’t explainable and I will let people go on and research it for themselves. And if they think there is something fishy going on, I leave it to them. I certainly do.”\\nSource \\n'"}, "time": 1742562017.1687458}