{"duration": 0.04730081558227539, "input_args": {"text": "'\\nThis article was written by Paul Joseph Watson and originally published at Infowars.com . \\nEditor’s Comment: Leftist have lived up to the hype, and thrown temper-tantrum violence as everyone expected. How anyone could have supported Hillary, rather than support her prosecution is something that will continue to boggle the mind. In the meantime, angry and disappointed DNC voters are waging violence and tempting the country into a full-blown martial law scenario. \\nProbably, these episodes will die down within hours, but there is always the threat that such non-sense and support for a would-be tyrant will continue and flourish. Just look how far George Soros & co. took the riots in Ferguson, Baltimore and dozens of other cities. The population’s buttons are being pushed, and the country is being tested. Best to be prepared just in case things get further out of hand. \\nHillary Supporters Burn American Flag, Riot, Threaten to Kill Trump After Losing Election \\nby Paul Joseph Watson\\nRioting hit the streets of Portland and Oakland as Hillary Clinton supporters reacted badly to Donald Trump’s election victory, while death threats against the new president-elect flooded social media. \\nWindows were broken and cars were set on fire in Oakland as irate protesters lit flares and blocked freeways.\\n\\n“A protestor was struck by a vehicle on the eastbound lanes of Highway 24 although it was not immediately clear what the extent of the victim’s injuries were,” reports Fox 5 .\\nAnti-Trump protest reaches Telegraph and Channing #berkvote pic.twitter.com/RuuFPEGHE7 \\n— Anderson Lanham (@AndersonLanham) November 9, 2016 \\n\\nProtest grows as participants light flares #berkvote pic.twitter.com/12AnGlAiEB \\n— Anderson Lanham (@AndersonLanham) November 9, 2016 \\n\\nStudents also hit the streets of Eugene and Portland, Oregon to protest against a democratic election. Demonstrators could be heard chanting “bitch” and “f*ck Trump” as they marched in unison.\\nUniversity of Oregon be mad #riot #ElectionNight #TRUMP @realDonaldTrump pic.twitter.com/SFi3MJDdb3 \\n— Delaney Stipe (@stipe_d) November 9, 2016 \\n\\ntheres a crowd going thru campus chanting this #ucsc #electionday pic.twitter.com/Jq0OGEEUxK \\n— Emilio (@habituaImind) November 9, 2016 \\n\\nSome of the students burned a U.S. flag.\\n\\nThe irony of the riots is that many pro-Clinton media outlets previously circulated the talking point that Trump supporters would be likely to stage violent unrest after they lost the election.\\nTwitter was also inundated with death threats , with leftists either hoping for or personally expressing their willingness to carry out Trump’s assassination.\\n\\n\\nThis article was written by Paul Joseph Watson and originally published at Infowars.com . \\nPaul Joseph Watson is the editor at large of Infowars.com and Prison Planet.com .'"}, "time": 1742562057.42936}