{"duration": 0.1335773468017578, "input_args": {"text": "'We Are Change \\nFBI finds new emails related to Clinton investigation — and they came from investigation into Anthony Weiner’s sexting. The new emails were reportedly uncovered after the FBI seized devices belong to Huma Abedin and her husband, Anthony Weiner. Prosecutors issued a subpoena for Weiner’s cell phone and other records in late September amid allegations that he had been sexting with a 15-year-old girl. AP Photo\\nThe FBI will reopen its investigation into Hillary Clinton’s private email server after learning of “the existence of emails that appear to be pertinent to the investigation,” FBI Director James Comey wrote in a letter to congressional leaders on Friday.\\nComey said the team in charge of looking into Clinton’s server briefed him on Thursday on new emails it found “in connection with an unrelated case.”\\n“The FBI cannot assess whether or not this material may be significant,” Comey wrote, adding, “I cannot predict how long it will take us to complete this additional work.”\\nHere’s the full letter: \\nThe emails were reportedly uncovered after the FBI seized devices belong to Huma Abedin and her husband, Anthony Weiner, the New York Times reported , citing law enforcement officials. Prosecutors issued a subpoena for Weiner’s cell phone and other records in late September amid allegations that he had been sexting with a 15-year-old girl.\\nPrevious reports indicated that only three relevant emails were found, but a federal official told the Times on Friday afternoon that the number of emails uncovered through Abedin’s and Weiner’s devices numbered in the thousands.\\nClinton gave a rally on Friday after the news broke, but did not mention the FBI’s announcement.\\nStocks fell sharply after the FBI’s announcement. \\nDonald Trump responded to the news at a rally Friday, saying, “Hillary Clinton’s corruption is not on a scale we have ever seen … The FBI and the Justice Department now have the chance to right the horrible mistake that they made” in not previously recommending that Clinton be charged with criminal wrongdoing.\\nHouse Speaker Paul Ryan released a statement renewing his call for the Director of National Intelligence to suspend classified intelligence briefings for Clinton, who, he said, “was entrusted with some of our nation’s most important secrets, and betrayed that trust by carelessly mishandling highly classified information.”\\nMany on Twitter have condemned the FBI’s handling of the announcement that it would reopen the investigation.\\n“It’s bad enough having the media do the ‘raises questions,’ substance-free innuendo thing. Worse when the FBI director does it. Disgraceful,” economist Paul Krugman tweeted on Friday . “Comey needs to provide full info immediately. Otherwise he has clearly made a partisan intervention, betraying his office.” \\n“I have zero faith that anyone will handle this responsibly,” former Obama speechwriter Jon Favreau wrote . “It’s insane. He [Comey] at least owes the country a press briefing — anything more than a vague letter.”\\n“Director Comey should give a more complete explanation. Is this reviewing newly found emails? Is this reopening? Too much at stake,” wrote John Weaver , the former campaign strategist for Gov. John Kasich of Ohio.\\nClinton’s email scandal has dogged the Democratic presidential nominee for more than a year. In March 2015, she first admitted to exclusively using a private email account to send and receive work-related emails while she served as secretary of state. The controversy compelled her to hand over roughly 30,000 work-related emails to the State Department, which have been released in batches since last year.\\nBut she deleted about 30,000 additional emails from her server that she said were “personal” in nature before handing it over to the FBI in August, five months after she gave individual emails to the State Department.\\nNBC’s Pete Williams reported Friday that the newly discovered emails were not among those originally withheld by Clinton or her campaign and were found on a “device” in a separate investigation. The decision to reopen the investigation was not related to emails released by WikiLeaks or to Russian hacking, Williams said.\\nA US official also told the Associated Press that the newly discovered emails relating to the FBI’s Clinton investigation did not come from her private server.\\nDemocratic nominee Hillary Clinton looks at her mobile phone as she leaves her house to attend Congressional Black Caucus Foundation’s Phoenix Awards Dinner at the Washington convention center in Washington Thomson Reuters\\nAfter examining her emails for more than a year, the State Department issued a scathing report in May concluding that she “did not comply” with its policies when she chose to use a personal email account to conduct government business.\\nThe State Department faulted Clinton and previous secretaries of state for poorly managing email and other computer information and for slowly responding to new cyber-security risks.\\nTwo months later, the FBI decided not to recommend that the Justice Department bring charges against Clinton, saying Clinton’s conduct did not meet the threshold used to prosecute past violators who shared classified information over unclassified channels.\\n“In looking back at our investigations into mishandling or removal of classified information, we cannot find a case that would support bringing criminal charges on these facts,” Comey said in July, after the FBI interviewed Clinton for three hours about her use of the server while at the State Department.\\nTrump has called the FBI’s determination “very unfair” and has said that if he were elected president, he would “lock her up” over her email scandal.\\nClinton’s unusual email system was originally set up by a staffer during Clinton’s 2008 presidential campaign. It replaced another private server used by her husband, Bill Clinton.\\nThe new server was run by Bryan Pagliano, who had worked as the IT director on Hillary Clinton’s campaign before she joined the State Department in May 2009. In 2013 — the same year she left the State Department — Clinton hired a small Denver-based IT firm named Platte River Networks to oversee the system.\\nClinton has since apologized for using the email server while insisting she never sent or received information marked “classified” using her private email account.\\nThe news tops off a particularly bad week for the Clinton campaign, which included both the release of a hacked memo published by WikiLeaks titled “Bill Clinton, Inc.” that raised questions about the blurring of lines between the Clinton Foundation charity and the Clintons’ personal finances and news that health-insurance premiums on the exchanges set up by the Affordable Care Act were set to increase significantly in 2017. \\nFollow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT  \\nThe post The FBI will reopen its investigation into Hillary Clinton appeared first on We Are Change .\\n'"}, "time": 1742563662.17776}