{"duration": 0.0487213134765625, "input_args": {"text": "'  BAZINGA! Donald Trump Has Ten Point Swing In Polls BEFORE FBI Reopened Crooked Hillary Investigation The poll was conducted Oct. 24-27 among a random national sample of 1,148 likely voters with a margin of error 3 points. According to the poll, Republicans appear more energized, as 81 percent of registered Republicans signaled that they are likely to vote, up six points from last week.   29, 2016 Republican Presidential nominee Donald Trump is rising in the polls, according to the latest ABC News/Washington Post poll. \\nEDITOR’S NOTE: Just so you know what you’re looking at here, let me break it down for you. Liberal news organ ABC News took a poll among likely voters for the time period of October 24-27, and it showed Trump up by 7 points and Crooked Hillary down by 3. That’s a 10 point increase for Donald Trump, all that happening before the game-changing announcement by the FBI on reopening the investigation on Crooked Hillary and her illegal emails. Bazinga! \\nDonald Trump is now at 45 percent with likely voters , up seven points from his low of 38 percent earlier in the month. Hillary Clinton is at 47 percent while Gary Johnson is at four percent and Jill Stein is at two percent. Newt Gingrich: Trump is likely ahead in the polls \\nThat marks a seven point jump for Donald Trump in just four days. Trump’s opponent Hillary Clinton has seen her numbers drop three points in the same time period, making a 10 point swing in Trump’s favor. \\nAccording to the poll , Republicans appear more energized, as 81 percent of registered Republicans signaled that they are likely to vote, up six points from last week. \\nEighty-six percent of Republicans now support Trump, up from 82 percent last week, and 84 percent of Republican leaning independents are now supporting Trump, up six points from last week. \\nThe poll was conducted Oct. 24-27 among a random national sample of 1,148 likely voters with a margin of error 3 points. Partisan divisions are 37-29-29 percent, Democrats-Republicans-independents. source \\n '"}, "time": 1742563909.3819246}