{"duration": 0.05914783477783203, "input_args": {"text": "'OUTRAGE: College Removes All American Flags, Veterans Protest \\nAll eyes are on notorious Hampshire College located in Amherst, Massachusetts. The Pioneer Valley community well-known for tolerance and social liberalism has many community members up in arms (figuratively speaking) over recent staff decisions and student behaviors surrounding flags. \\nFollowing President-elect Trump’s presidential win in the U.S., a group of students at this particular college were so displeased with the final results that their own American flag was lowered to half-staff in an act of expression . The same flag was later maliciously burned and discovered this past Veteran’s Day. \\nThe burnt flag was then replaced by staff with a new flag, but later after “consulting with constituents” an official decision was made to remove not only the American flag, but all flags in order to have a conversation about what the American flag truly represents without simultaneously flying said flag, which was an apparent flag-trigger across an array of viewpoints in regard to flags. \\nDuring the ongoing internet and communal static that has ensued thereafter, the President of Hampshire College, Jonathan Lash, has insisted that the school has been “…Periodically flying the flag at half-staff to mourn deaths from violence around the world…” \\nThe statements made by President Lash and the official Facebook page of the campus both strongly imply that the flag was not lowered as a result of the election but rather as a way to generally mourn violence around the globe. \\nSome outraged citizens are veterans and relatives of veterans, and some are not. Those currently opposed to the school’s and student’s behavior seem to have one thing in common- discontent for what they see as offensive acts and a disgrace to the democratic process and liberty that allows such a college to exist. \\nA protest has been arranged for veterans and others to show their disapproval of the school’s flag-lowering decision. The protest will take place this coming Sunday 11/27. \\nChicopee veteran Delfo Barabani Jr., said in a message that “The idea is to have as many people as possible carry an American Flag near the Hampshire campus.” \\nThe internet has been lively on the school’s Facebook page which has been swarmed by thousands of commenters posting eagle and flag stickers: \\nYou may remember mention of the school when NBC’s SNL and then-skit-comedian Jimmy Fallon poked fun at how liberally-minded the campus was in a weekly skit that depicted Fallon as an ignorant stoner living in an on-campus dorm. It will be interesting to see how the mainstream network spins the character of this same demographic come protest-time Sunday now that their narrative encompasses support for the polar opposite. \\nIt will certainly be telling to witness how cable news approaches such a divided issue during a time when public confidence in mainstream news networks has reached an all time low. This is of course due to distrust following WikiLeaks revelations that indicated many mainstream networks and broadcasters colluded with the Clinton campaign to both shut down Bernie Sanders in the primaries and win the presidential election [sic]. \\n\\nThe Hampshire College Facebook posts concerning this matter can be read in full below: \\n@ November 21 at 3:59pm EST Hampshire College [fb]: A Statement from President Lash: “Some months ago, the Hampshire College Board of Trustees adopted a policy of periodically flying the flag at half-staff to mourn deaths from violence around the world. Last week, in the current environment of escalating hate-based violence, we made the decision to fly Hampshire’s U.S. flag at half-staff for a time while the community delved deeper into the meaning of the flag and its presence on our campus. This was meant as an expression of grief over the violent deaths being suffered in this country and globally, including the many U.S. service members who have lost their lives. Our intention was to create the space for meaningful and respectful dialogue across the many perspectives represented in our community. Unfortunately, our efforts to inclusively convey respect and sorrow have had the opposite effect. We have heard from many on our campus as well as from neighbors in the region that, by flying the flag at half-staff, we were actually causing hurt, distress, and insult. Our decision has been seen as disrespectful of the traditional expression of national mourning, and has been especially painful to our Hampshire campus colleagues who are veterans or families of veterans. Some have perceived the action of lowering the flag as a commentary on the results of the presidential election – this, unequivocally, was not our intent. After some preliminary consultation with campus constituents (much more is needed), we decided on Friday that we will not fly the U.S. flag or any other flags on our college flagpole for the time being. We hope this will enable us in the near term to instead focus our efforts on addressing racist, misogynistic, Islamophobic, anti-immigrant, anti-Semitic, and anti-LGBTQ rhetoric and behaviors. I ask our campus to join me in a commitment to living up to the ideals of our mission: to insist on diversity, inclusion, and equity from our leaders and in our communities; to constructively resist those who are opposing these values; and to actively and passionately work toward justice and positive change at Hampshire and in the world.” \\n\\n@ 11/22/16 12:39pm EST [Note this post was edited by the Hampshire College page several times at the time this was published, this was the most recent version that the Facebook page posted] Hampshire College wrote on fb: Hampshire College respects all the feedback on our decision to remove the flag from our college flagpole for a period of time as our campus discusses what the flag represents to all members of our community. This decision is not and was never a commentary on the presidential election; our goal is to make this discussion a learning opportunity by giving voice to the range of viewpoints on campus across cultures, and hopefully find common ground. This is not a campus-wide ban as some media have mistakenly reported, campus members are free to individually display their own flags; this only pertains to our flagpole. As the College closes for Thanksgiving, our social media staff are on holiday break and are unable to respond to questions and to ensure posts adhere to community standards. As a result, we are suspending FB Comments through the Thanksgiving break. Emails may be sent to [email protected] Share:'"}, "time": 1742628527.6928482}