{"duration": 1.718189001083374, "input_args": {"text": "'vivienda \\nLas comunidades de vecinos son un hervidero de gente y personalidades, cada una diferente a las demás. ¿Tú de qué tipo eres? Con este test, te ayudamos a descubrirlo. \\n1. Hay que pagar, entre toda la comunidad, una rampa de acceso para un vecino minusválido. ¿Qué haces? \\nA. Muestras tu disconformidad y alegas que no es culpa tuya que todavía no se hayan inventado las sillas de ruedas voladoras. Como alternativa, propones que sus familiares lo suban por la ventana con una cuerda. “Así subí yo el sillón y va de puta madre”, añades. \\nB. Accedes, a condición de que el vecino minusválido vaya a ver tu obra “Desenfrena 2”, un espectáculo que, según tú, “mezcla el clown, la improvisación y toneladas de buen rollo”. El vecino minusválido va, pero no puede entrar porque la hacéis en el sótano de un bar de La Latina. \\nC. No has respondido a la circular que te metieron por debajo de la puerta para comunicártelo. Como tampoco respondiste a la de hace tres meses, en la que se te informaba de que se iba a reformar el ascensor, ni a la de hace un año, en la que se te recordaba que llevas dieciocho meses sin pagar los gastos de comunidad y sin responder a ninguna circular. \\nD. Afirmas estar totalmente de acuerdo, pero indicas que, antes de comenzar el proyecto, te gustaría “conocer la opinión de las bases y de todos y cada uno de los españoles, esa es la única forma de avanzar hacia el cambio”. El vecino minusválido sigue esperando a día de hoy a que te decidas. \\n2. El resto de vecinos se ha quejado de ti, ya sea por ruidos, malos olores u otras conductas molestas. ¿Cómo actúas? \\nA. Dices que es imposible que hayan oído la televisión, la minicadena o el transistor, pues llevas meses sin encenderlos por no gastar. Como mucho, te oirían a las dos de la mañana destrozando a hachazos un mueble para hacer leña con él, “que la calefacción no la regalan”. \\nB. Les explicas que has convertido tu piso en un espacio “off” de teatro y que no puedes controlar los aplausos y los vítores del público. En realidad, los vecinos se quejan de tus sollozos y tus súplicas cuando no va ni una persona a ver tu nueva obra: “Insomnium”, un thriller psicológico de sólo 3 minutos de duración. \\nC. Iban a meter un escrito oficial por debajo de tu puerta para comunicártelo, pero ya no caben más cosas, hay unas 587 cartas y circulares que sigues sin leer. \\nD. Les reúnes a todos y, con la voz entrecortada por las lágrimas, aseguras que la situación es fruto de una conspiración de El País y otras grandes compañías. \\n3. La vecina de al lado está sufriendo un incendio en su piso. ¿Cuál es tu reacción? \\nA. Aprovechas las llamas que salen por el balcón de la mujer para descongelar unas croquetas que no habías cocinado hasta ahora “porque el aceite tampoco lo regalan”, Una vez que la vecina ha fallecido devorada por las llamas, le das el pésame a sus hijos y les pides que te abonen los 25 céntimos que un día le dejaste a la señora en el súper. \\nB. Llamas a los bomberos y, cuando llegan, no te separas de ellos para preparar tu nuevo papel en “Fuego en la piel”, una comedia romántica que narra la historia de amor entre un bombero y una mujer que se está quemando viva, y que estrenarás dentro de poco en el desván del Bar Pruden e Hijos. \\nC. Tu vecina se resigna a morir y ni siquiera trata de pedirte ayuda. Sabe que no harás absolutamente nada. \\nD. Medio barrio observa el suceso desde la calle, así que sales a la ventana y aprovechas para dar un discurso de media hora sobre los beneficios del mestizaje ideológico. \\n4. Te toca ser el nuevo presidente de la comunidad de vecinos. ¿Cómo te desenvuelves con el nuevo cargo? \\nA. Lo primero que preguntas es dónde está tu coche oficial y tu tarjeta black. \\nB. En las juntas de vecinos, ya les has interpretado tus obras “5 microsegundos con Mario”, “Los monólogos de la crisis” y “What happened to our love?”. En una semana, medio edificio ha empezado a buscar otro piso al que mudarse. \\nC. Los vecinos llevan esperándote 4 horas, 56 minutos y 27 segundos en la primera reunión que debías presidir. Comienzan a sospechar que no vas a asistir. \\nD. Diecisiete vecinos se amotinan contra ti, negándose a reconocerte como presidente de la comunidad. Entre lágrimas, acabas dimitiendo y llamas a Jordi Évole por si le interesa una entrevista sobre el tema. \\nMayoría de respuestas A: Eres el vecino rata . Es ridículo que te hayamos incluido en el test porque no vas a leer esto jamás, llevas más de tres años sin encender el ordenador por no gastar electricidad. \\nMayoría de respuestas B: Eres el vecino actor de microteatro , sueñas con despuntar sobre los escenarios pero, por ahora, no te llega ni para pagar el teléfono. \\nMayoría de respuestas C: Eres el vecino muerto . Nadie sospechó del terrible olor que salía de tu casa desde hacía meses porque, antes de fallecer, se te conocía como el vecino guarro. \\nMayoría de respuestas D: Eres Pedro Sánchez .'"}, "time": 1742564067.2450778}