{"duration": 0.0813450813293457, "input_args": {"text": "'Comments \\nWith the effects of recent politicized FBI leaks now frighteningly clear, senior Democratic lawmakers are calling on the Justice Department to probe the bureau for leaks to the Trump campaign. Specifically, they’re calling for an investigation into how Trump co-conspirator Rudy Giuliani knew about the FBI reopening its investigation into Hillary Clinton’s private email server before director James Comey made his scheming announcement in a letter to Congress last week. \\nRepresentatives Elijah Cummings (D-MD) and John Conyers Jr. (D-MI), the ranking Democrats on the House Committees on Oversight and Government Reform and the Judiciary respectively, sent a scathing letter Friday to Inspector General Michael Horowitz. “It is absolutely unacceptable for the FBI to leak unsubstantiated — and in some case false — information about one presidential candidate to benefit the other candidate,” they wrote. “Leaking this information to former FBI officials as a conduit to the Trump campaign is equally intolerable.” \\nGiuliani has repeatedly bragged about obtaining leaked information from former FBI agents. Just a few hours before the Cummings and Conyers letter was sent, the former New York mayor was asked on “Fox and Friends” if he knew of the reopened investigation before Comey’s announcement. He replied , “Did I hear about it? You’re darn right I heard about it, and I can’t even repeat the language that I heard from the former FBI agents.” \\nFor his part, Giuliani has denied having any role in leaking the information to the public, though he has in interviews he has been quick to tout his connections to the FBI and has served as somewhat of a middleman between leakers at the bureau and the Trump campaign. He has been adamant about how “outraged” FBI agents are at the bureau’s handling of the Clinton email scandal. Then, two days before Comey sent his letter to Congress, he said that the Trump campaign “has a couple of surprises left” that would be “enormously effective.” \\nThe Representatives’ letter also criticized the media’s unquestioning use of unsubstantiated “anonymous sources” from the FBI, singling out Fox News’ Bret Baier in particular. On Wednesday Baier ran a story claiming that the FBI’s investigation of Clinton would “continue to likely an indictment,” a lie so nefarious that he felt compelled to actually apologize for his false claims, a rather uncharacteristic occurrence at Fox News. \\nThe letter comes against the backdrop of an FBI that has increasingly been implicated as a source of a partisan leaks to the Trump campaign. Certain agents and even high ranking officials at the bureau – which in its demographics is similar to Trump’s base – have apparently been funneling sensational and often false anti-Clinton information to the Trump campaign. “These unauthorized and inaccurate leaks from within the FBI, particularly so close to a presidential election, are unprecedented,” the letter said. “For this reason, we are calling on your office to conduct a thorough investigation to identify the sources of these and other leaks from the FBI and to recommend appropriate action.” Related Items:'"}, "time": 1742564354.7602727}