{"duration": 0.02210259437561035, "input_args": {"text": "'30 Mins After FBI News, Hillary Exited Plane… Did One Dirty Thing Before Posted on October 30, 2016 by Robert Rich in Politics Share This \\nWe know that the FBI reopening its investigation of Hillary Clinton’s emails couldn’t have been good news for the presidential hopeful, but the fact that it took her a whopping 30 minutes to exit her plane after landing speaks volumes on the matter. However, it seems that Hillary made sure to do one dirty thing before walking down those stairs. \\nCrooked Hillary is a cowardly schemer – and her recent actions go to prove just that. Mad World News reported Friday that after the news broke of FBI Director James Comey reopening their investigation, Hillary was seen rapidly exiting her plane and ignoring reporters before darting into her SUV. Just In: Clinton declines to answer questions about the FBI as she deplanes in Cedar Rapids. Sat on tarmac for 30 minutes after news broke. pic.twitter.com/zC115U7YNp \\n— Adam D. Brown (@aduanebrown) October 28, 2016 \\nHowever, recent reports indicate that her dodging the matter at hand began far before that point . In fact, Hillary’s staff made sure to disable the plane’s Wi-Fi after the news broke so that the reporters onboard wouldn’t learn of the matter until they got on the ground. Of note as we wait for Clinton: plane had no wi-fi today. One adviser after we landed: \"We\\'re learning about this just like you all are.\" pic.twitter.com/CjsH71LJNo \\n— Phil Mattingly (@Phil_Mattingly) October 28, 2016 \\nOf course, Hillary made sure to stay far away from the media seats until she got off the plane, but it didn’t end there. As reporters had questions about Hillary, an adviser used President Barack Obama’s time-old line saying — “We’re learning about this just like you all are.” Clinton’s plane did not have WiFi. Her advisors learned about the FBI letter when you did. https://t.co/C0uSXheh1i https://t.co/BAGhckS2aN \\n— CNN (@CNN) October 28, 2016 \\nAlthough CNN tried their best to make it sound as if they didn’t have Internet access on the plane at all, the Wall Street Journal’s Byron Tau came forward saying that Hillary’s plane is equipped with Wi-Fi. Hillary has been dodging the consequences of her actions since the beginning of her campaign, but this is a new low for even her. The Hillary plane has wifi. https://t.co/dLZ0tigZhP \\n— Byron Tau (@ByronTau) October 28, 2016 \\nAt this point, she knowingly put those in charge of getting information to the world in the dark in order to protect herself. Too bad for her, running only gets you so far in terms of justice. She will one day have to face the music. \\nAs the saying goes – “you can run, but you can’t hide,” and the noose that all those guilty of treason get in the end seems to be getting closer and closer every day.'"}, "time": 1742628593.081415}