{"duration": 0.04960203170776367, "input_args": {"text": "\"0 comments \\nIn a four-minute speech beforeÂ an Ohio audience reportedly to publicize his new movie “Trumpland,” staunch liberal Michael Moore delved into the mindset of Donald Trump’s appeal. In doing so, he inadvertently made the best case for a Trump presidency we’ve heard yet. \\n“Theyâ\\x80\\x99re not racists or rednecks, theyâ\\x80\\x99re actually pretty decent people,” Moore surprisingly said of Trump supporters. “So, after talking to a number of them, I sort of wanted to sort of write this.” \\nHere is an excerpt from his speech: \\nDonald Trump came to the Detroit Economic Club and stood there in front of the Ford Motor executives and said: if you close these factories, as you are planning to do in Detroit, and rebuild them in Mexico, I am going to put a 35% tariff on those cars when you send them back and nobodyâ\\x80\\x99s going to buy them. \\nIt was an amazing thing to see. \\nNo politician â\\x80\\x94 Republican or Democrat â\\x80\\x94 had ever said anything like that to these executives. And it was music to the ears of people in Michigan and Ohio and Pennsylvania and Wisconsin. The Brexit states. You live here in Ohio. You know what I am talking about. \\nWhether Trump means it or not is kind of irrelevant because he’s saying the things to people who are hurting. And it’s why every beaten down, nameless, forgotten, working stiff, who used to be part of what was called the working class, loves Trump. He is the human Molotov cocktail that they’ve been waiting for; the human hand grenade that they can legally throw into the system that stole their lives from them. \\nWatch: If you make this go viral, Trump will win. It's 4 minutes that makes the choice in this election crystal clear. #EarlyVoting pic.twitter.com/UOgqSfet6a \\n— Jared Wyand đ\\x9f\\x87şđ\\x9f\\x87¸ (@JaredWyand) October 25, 2016 \\nIf we make this go viral, Donald Trump could indeed win the election… And wouldn’t that be just rich, considering Michael Moore is one of the most loathsome liberal windbags we’ve been forced to endure during this election season. \\nSHARE this if you areÂ voting for “the human hand grenade” Donald Trump!\""}, "time": 1742561902.930438}