{"duration": 0.1793529987335205, "input_args": {"text": "'WASHINGTON  —   As Senate Republicans embark on a flurry of confirmation hearings this week, several of Donald J. Trump’s appointees have yet to complete the background checks and ethics clearances customarily required before the Senate begins to consider   nominees. Republicans, who are expected to hold up to five hearings on Wednesday alone, say they simply want to ensure that the new president has a team in place as soon as possible. “I believe all the  ’s cabinet appointments will be confirmed,” Senator Mitch McConnell of Kentucky, the majority leader, said. But Democrats are calling for the process to be slowed and for the hearings to be spread out. That, they say, would allow more time to vet the nominees. “Our first overarching focus is getting tax returns and ethics forms,” said Senator Amy Klobuchar, Democrat of Minnesota. In a letter to Senators Chuck Schumer of New York and Elizabeth Warren of Massachusetts, the leader of the Office of Government Ethics, Walter M. Shaub Jr. said on Friday that “the announced hearing schedule for several nominees who have not completed the ethics review process is of great concern to me. ” He said the packed schedule had put “undue pressure” on the office to rush its reviews of the nominees and he knew of no other occasion in the office’s four decades when the Senate had held a confirmation hearing before the review was completed. Mr. Schumer responded on Saturday by saying that the letter had made clear that the Trump transition team colluded with Senate Republicans to “jam through” the nominees. Several of the nominees are millionaires or billionaires and have vast webs of financial interests that must be untangled. The Trump transition team issued a statement on Saturday evening defending its handling of the nomination process. Richard W. Painter, a law professor at the University of Minnesota who served as chief ethics counsel to President George W. Bush, said he thought none of the nominees could receive a full vote on the Senate floor before the vetting was complete. Norman Eisen, Mr. Obama’s ethics counsel in his first term, said the paperwork delays were “totally  . ” The status of the background checks and ethical clearances can change by the day. Republicans say they expect the missing documents to be submitted for all the nominees eventually. The hearings are scheduled to begin on Tuesday, with testimony from Senator Jeff Sessions of Alabama, the nominee for attorney general, and Gen. John F. Kelly, the pick for homeland security secretary. On Wednesday, the parade of nominees is expected to include Rex W. Tillerson, the choice for secretary of state Betsy DeVos, the pick for education secretary and Representative Mike Pompeo of Kansas, the nominee to lead the C. I. A. Later in the week, the billionaire investor Wilbur L. Ross Jr. chosen as commerce secretary, and Andrew F. Puzder, the labor secretary pick, are scheduled to come before congressional panels. While some of Mr. Trump’s nominees, notably Representative Tom Price of Georgia, the choice for health secretary and an ardent opponent of the Affordable Care Act, are certain to receive hostile receptions, large numbers of Democrats will probably vote for many others. Still, Democrats are preparing a furious assault against the nominees by going after the   himself and trying to drive a wedge between them over his most incendiary promises, like banning Muslim immigrants and bringing back torture. “Where will they come down?” Mr. Schumer, the new Democratic leader, asked in an interview. “Will they try to persuade the president that’s the wrong way to take America?” Democrats plan to keep the focus on the   to a degree with few historical parallels. New presidents usually serve as a backdrop this year, by contrast, Mr. Trump’s words will loom over the hearings as Democrats press the nominees to take a position on them. Democrats have little chance of blocking any of the nominees, having given up the use of the filibuster in such cases when they were in the majority, but they say Mr. Trump has handed them ample political ammunition. Mr. Sessions is certain to be asked whether he, as attorney general, would make good on Mr. Trump’s pledges to get a special counsel to “jail” Hillary Clinton over her email server. General Kelly can expect questions about whether he favors Mr. Trump’s call to build a wall on the Mexican border and create a database on Muslims. Mr. Pompeo is likely to be asked about his views on Mr. Trump’s support for waterboarding and his skepticism about the intelligence agencies’ findings on Russian election meddling. Mr. Tillerson will probably face a grilling over Mr. Trump’s vow to “cancel” the Paris climate accord. Mr. Tillerson has spent hours trying to quietly assure lawmakers that he would take a more distant stance than Mr. Trump on the Russian president, Vladimir V. Putin, with whom Mr. Tillerson had close relations as the head of Exxon Mobil. The Trump transition team, which did not comment on the background checks, is bracing its nominees for questions about the  ’s more controversial positions, according to people with knowledge of the preparations. But officials would not say what tack the nominees would take in responding. “I have no doubt that the   and a number of his comments will come up,” said Sarah Isgur Flores, a spokeswoman for Mr. Sessions’s confirmation team. “But Senator Sessions has a long record of service himself. ” Mr. Sessions will testify before the Judiciary Committee, which is generally friendly territory for sitting senators. But he is likely to face blistering questions from Democrats who are concerned about his civil rights record. In the 1980s, racially charged accusations derailed his nomination to a federal judgeship. Senator Dianne Feinstein of California, the top Democrat on the Judiciary Committee, said she would press Mr. Sessions to say where he stood on Mr. Trump’s pledges to have a special counsel further investigate Mrs. Clinton’s emails. “Hillary’s situation is done, and other than some kind of gross retribution, there’s no reason for that to even be something to look at,” Ms. Feinstein said in an interview. By posing tough questions, said Sarah A. Binder, a political scholar at George Washington University, Democrats will try to lure the nominees into inflicting political damage on themselves by adopting some of Mr. Trump’s more divisive language. She said the terrain was so risky that the nominees might be better served by adopting a stance usually seen only from judicial nominees: “Don’t take a position. ” Democrats intend to use all the procedural moves available to slow the process on the Senate floor, possibly spending up to 30 hours per nominee, denying Mr. Trump a full cabinet when he takes office. Republicans are indignant. “Holding up confirmations just for delay’s sake is irresponsible and it is dangerous,” said Senator John Cornyn, Republican of Texas. He added, “This is a dangerous world we are living in, and why in the world would we want to make it even more dangerous just to let our colleagues delay for delay’s sake   Trump getting to fill his cabinet, particularly these important national security offices?”'"}, "time": 1742564064.744723}