{"duration": 0.13538241386413574, "input_args": {"text": "'  WashingtonsBlog \\nCNN’s Jake Tapper hit the nail on the head last night, as he was speaking about why people voted for Trump. \\nTapper said that most Americans are sick of the income inequality, globalization, and politics-as-usual that the status quo have given us. \\nHe even pointed out that only a handful of people have gotten rich off of globalization, and a lot of people have been left behind . \\nIndeed, exit polls last night showed that the economy was the number 1 concern for voters. The Guardian reports : \\n“It’s the economy, stupid” was a phrase coined by her husband’s adviser James Carville in the 1992 election and, in many ways, it ought to have helped Democrats again in 2016. Barack Obama helped rescue the US from the financial crash and presided over a record series of consecutive quarters of job growth. \\nUnfortunately for Clinton, many Americans simply did not feel as positive. Stagnant wage levels and soaring inequality were symptoms of the malaise felt by many voters. Trump successfully convinced them to believe this was caused by bad trade deals and a rigged economy. \\nDespite being pushed in this direction by Sanders in the Democratic primary, Clinton never really found a satisfactory response. Her volte-face on trade sounded – and was later proved by leaked emails – unconvincing at best; deeply cynical at worst. \\nSimilarly, Brexit – the other recent vote which went against all political forecasts – was largely a vote by those who lost out on the benefits of globalization … that only a handful of fatcats really profited from. \\nLeaders of the Brexit campaign noted the confluence of the two votes: \\nJeremy Corbyn described Mr Trump’s victory as “an unmistakable rejection of political establishment” . \\nUkip leader Nigel Farage – who went to the US to appear at a Trump campaign rally – said he was handing over his mantle as the creator of political earthquakes to the new President, saying that 2016 was “the year of two great political revolutions”, adding: “I thought Brexit was big, but boy, this looks like it’s going to be even bigger”. \\nN igel Farage has issued this statement following Donald Trump’s victory. \\n“Today, the establishment is in deep shock. Even more so than after Brexit. What we are witnessing is the end of a period of big business and big politics controlling our lives. \\nVoters across the Western world want nation state democracy, proper border controls and to be in charge of their own lives. \\nI commend Donald Trump for the courage with which he has fought this campaign and I look forward to a closer relationship between the USA and the UK. We now have a President who likes our country and understands our post-Brexit values. \\nPrepare for further political shocks in the years to come.” \\nVoters in the UK and the world’s strongest nation, the U.S., have both rebuked the status quo, including neoliberal trade and economic policies. \\nWhat’s next? \\nThe rebellion will spread … \\nFor example, it’s so probable that Merkel’s Christian Democratic Union party will be thrown out on its ear that Merkel is already trying to distract with silly claims that the Russians will hack the German election. \\nPostscript: There are, of course, other reasons that Trump won. But the economy is the main one.'"}, "time": 1742562464.1934483}