{"duration": 0.08393406867980957, "input_args": {"text": "'Satanic Temple YES, Ten Commandments NO? October 26, 2016 \\nA Satanic Temple opens its doors in Massachusetts proud to display their \"religious\" symbols! But removing the Ten Commandments is OK? With up to 50,000 members in chapters around the world, TST has garnered colossal media attention in the last three years. Outside of New England, TST has taken legal action against the placement of edifices of the Ten Commandments in civic settings, including statehouses. The Satanist group has intervened in various school districts to contest prayer or challenge Christian clubs. Salem is headquarters to this Anti Christian group. \\n(SALEM,Massachusetts) Horror is not contained to October 31st alone. A controversial Satanic temple has set up its international headquarters in Salem Massachusetts. Just one mile from historic sites where ironically in the 16th century witches were hunted and killed. \\nThe building is a former funeral home, inaugurated last month by activist Malcolm Jarry, a self-described “secular Jew” who co-founded The Satanic Temple (TST) in 2013. It also houses an art gallery in honor of the heathen idol Baphomet, a “sabbatic goat”. Behind the two-story building, an eight-foot tall statue of Baphomet sits in a plain shed, where visitors can pay to view it. \\nWith up to 50,000 members in chapters around the world, TST has garnered colossal media attention in the last three years. Chief among Jarry’s causes are marriage equality and women’s reproductive freedom. Any issue related to the government using religion to restrict individual freedom is also likely to engage temple leaders, some of whom staged a 2014 “Black Mass” at Harvard University to push the envelope on religious freedom. \\nOutside of New England, TST has taken legal action against the placement of edifices of the Ten Commandments in civic settings , including statehouses. To illustrate how such displays violate religious freedom, the temple has insisted it be allowed to erect goat-headed Baphomet statues in the same locations. TST is also planning to take on some schools’ use of isolation, denial of bathroom access, and corporal punishment of children. For the 49-year-old Jarry, there is not much conflict between being Jewish and a Satanist. As a matter of fact, the two identities have come to inform each other, he said. \\n“I see it like Buddhism,” said Jarry. “Satanism is something that can co-exist with being a Jew,” he said. \\nIn addition to Jarry’s belief that Judaism and Satanism can co-exist, there are parallels with how Judaism and Satanism have been branded by their detractors, he said. \\n“The false accusations that have been thrown at Jews historically are similar to what some people say about Satanism,” said Jarry, mentioning accusations of blood libel and — more recently — fabricated allegations that Israel perpetrates genocide against Palestinian children. \\nIn recent weeks, TST has been in the news for one member’s attempts to deliver a Satanist invocation at Boston City Hall . The opportunity to open meetings with prayers is by invitation only, and only mainstream religions have ever been asked, said Jarry. \\n“If the decision is that only we cannot deliver an invocation, then we will sue and we will win,” \\n“We expect to be treated in the same manner as all other religions and will sue for all of the same rights,” said Jarry, adding that TST’s campaigns are fueled by “the importance of standing for freedom of expression and against tyrannical authority.” \\nAccording to Salem city officials, only a handful of citizens have expressed concern about the Satanic temple’s arrival to one of New England’s top tourist destinations. TRUNEWS counted about 20 churches in Salem alone, and not one Christian expressed concern? Where is the church? The TST has a clear agenda to stop Christians from evangelizing and in their quest they are winning legal battles to do so. With each Christian symbol taken down or expression of faith being censored, this groups\\' agenda advances. Again I ask, where is the church? \\nOriginal article by Times of Israel. \\n——- Article by , Correspondent for TRUNEWS Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE!  '"}, "time": 1742562304.4325624}