{"duration": 0.04144477844238281, "input_args": {"text": "'opednews.com - Advertisement - I am a progressive who will NOT be sheeple herded into voting for HillaryClinton. The Democratic Party remains too firmly wedded to war and Wall Street. In its current condition of corrupt dependence millions of Americans will continue in worsening condition even if the Democrats win the presidency and Congress. We progressives have been marginalized by \"educational\" propaganda, non-exposure to negative facts and alternatives to the point where our numbers are too small to be influential. The counter -- argument, \"What would happen if all of you progressives refrained from voting for Clinton and Trump won?\" can not be universalized. It does not confer sufficient probability on the conclusion \"I, a progressive, should vote for Clinton\" for any progressive to accept it. We are just too few. Democrats have performed so poorly for millions of Americans since the first Clinton regime that it is certain we (including middle income, professionals) will continue to lose relative financial position and sufficient income for a stable life, rather than prosper, under a Clinton Administration. Stubborn, Marginalized Old Progressive License DMCA All progressives and any peace -- loving liberal democrats, even nationalist Republicans should insist, as a condition of getting our votes, that Clinton offer a stand - still cease fire unless fired upon peace truce to all opponents, Sunni and Shia, we are fighting against in person (or by aid to another local side) in all disputed lands, (Afghanistan, Iraq, Libya, Syria, Yemen, etc.) in exchange for the same by these groups, AlQaeda, ISIS, etc. Our offer should include an embargo against our selling any more weapons to contested governments in those lands in exchange for the opponents\\' promise to publicly discourage any obstruct further terror attacks in western countries. These wars must stop now with a World Peace, Re-partition and Resettlement conference to follow. - Advertisement -'"}, "time": 1742563557.8463612}