{"duration": 0.14890599250793457, "input_args": {"text": "'COLUMBUS, Ohio  —   So here we are, nearing the end of 2016’s     race to the bottom. Through it all, through his ugly caricatures of Mexicans and Muslims, through her pretzel contortions to explain her emails, through the Russian hacking and the 3 a. m. Twitter rants and the rest, this was always going to be a “hold your nose and vote” election. But at Tommy’s Diner, a colorful Columbus institution in a   neighborhood once known as The Bottoms, “hold your nose and vote” is giving way, for some people, to “hold your nose and don’t vote. ” The distaste for the presidential election is obvious almost anywhere you look here in the capital of a swing state where in July 2015 Gov. John Kasich of Ohio (remember him?) became the 16th of 17 Republicans who hoped to succeed President Obama. Aaron Burnside, 23, a   law student at Ohio State University, was at the student union that day, listening with optimism as Mr. Kasich declared that “the sun is rising” in America  —   words that now seem so quaint. Never for a minute did Mr. Burnside, who described himself as a “   fiscally conservative, socially liberal” Republican, imagine himself not casting a ballot on Election Day. But on Thursday, with early voting underway here and Mr. Trump and President Obama in town, Mr. Burnside had no idea whether he would vote for president. “It depends on how I feel that morning,” he said. He will go to the polls  —   it’s his civic duty  —   to back his party in   races Senator Rob Portman, a Republican, is fending off a challenge from Ted Strickland, a Democrat and former governor. Mrs. Clinton seems too far to the left for him, he said never a Trump fan, he found the Republican nominee’s vulgar boasts of grabbing women’s genitals “disgusting. ” So he feels stuck, as do many voters. As early voting begins in Ohio and elsewhere, many Americans are approaching the election with a sense of dread. In a CBS News poll released earlier this month, just 46 percent of likely voters said they were very enthusiastic about going to the polls, down from 62 percent in late October 2012, according to a New York   News poll. What’s uncertain this year is how many people will cast reluctant votes and how many won’t vote at all. At the diner, Tommy is a gregarious Greek immigrant and American citizen named Tom Pappas, who loves politics but keeps his business nonpartisan. The walls are covered with photos of Democrats and Republicans in equal numbers, and of Elvis Presley, Marilyn Monroe, Tommy’s grandchildren and Ohio State football stars. Mr. Pappas, 63, and his wife Kathy, 57, have owned the diner for 28 years. Kathy Pappas, who bakes the baklava and bread pudding, pays little heed to politics (she leaves that to Tommy) but this year finds it impossible to escape. “I turn on the radio, looking for the traffic or the weather,” she said, “and what do they talk about?” Mrs. Pappas said she has always voted. “But I don’t know if I’m going to this year,” she said. “I just don’t care for either one, and I don’t trust either one. There’s just not a good feeling either way you look, and that’s sad. ” Every day 400 to 500 people pass through Tommy’s customers run the gamut. Breakfast on Thursday brought a group of retirees,   white men in red   who had spent the morning building tables and chairs at a furniture bank for the needy two retired social studies teachers with their daughter, an acupuncturist (also an herbalist) and her boyfriend, a tattoo artist a group of bus drivers a retired firefighter, plus the usual smattering of lawyers and state workers. The acupuncturist, Keri Ondrus, 31, has given up on voting altogether she has taught English in Costa Rica, and was involved in the Occupy Wall Street movement, describing herself as a “total idealist” and ‘‘anarchist’’ who feels there must be another way to repair the world. Her parents, Charlotte and Bill Ondrus, the retired teachers, will vote for Mrs. Clinton. “You guys are not enthusiastic about Hillary,” their daughter said. “I know,” her mother replied, “but I’m scared to death of Donald Trump. ” Lunchtime brought a    team of bail bondsmen an Air Force veteran and gun rights enthusiast wearing one of Mr. Trump’s “Make America Great Again” ball caps and a   pistol in a sleek, black Velcro case on his belt and a   young     artists, preparing for a show at Wright State University in Dayton. “Why would I waste my time?” Kyle Steed, 23, a composer with the group, said of voting, adding that he would rather spend his time helping the homeless as a volunteer. His friend Shamere Griffin, 21, another of the artists, shook her head wordlessly, seeming to fight back tears. She said she could never vote for Mr. Trump, given his characterizations of blacks, Muslims, Mexicans and women. She wants an America in which she doesn’t have to remind “my little brother, when he walks down the street, to walk with his hood down,” and has no confidence that Mrs. Clinton can deliver that. She will stay home. “Let’s just be real,” Ms. Griffin said. “What has she done for us? That’s what I want to know. What has she done for my people?” Ohio is politically engaged in 2012, when President Obama ran against Mitt Romney, 70. 5 percent of registered voters cast ballots, compared with 57. 5 percent nationwide, and one in three voted early. Some election offices reported long lines when early voting began here Wednesday David Pepper, chairman of the Ohio Democratic Party, called Mr. Trump a “turnout machine” for Democrats. But an   Street Journal poll released Thursday  —   and conducted after the emergence of a videotape showing Mr. Trump saying he groped women  —   found the Ohio race virtually tied. “I’m very motivated,” declared Robert Tannous, a    lawyer in a dark blue suit, as he navigated his way around a waitress during the lunchtime rush. Motivated to vote for whom? “Hillary Clinton,” Mr. Tannous said. “And the sad thing is, I’m a lifelong Republican. ” George Wolf, a 73, a retired firefighter who owns a small heating and air conditioning business here, comes to Tommy’s every morning for the crispy corned beef and a dose of friendship. A longtime Republican, he says he “cannot allow Hillary Clinton to get in,” and proceeds to tick off the reasons. “When you mention Benghazi, I get really upset,” he said, referring to the 2012 attack on a United States diplomatic mission in Libya. “Four people died she doesn’t seem to care. ” Then there are her emails. And her paid speeches: “I just don’t like the fact that a politician is out to make money,” Mr. Wolf said, adding that he would vote for Mr. Trump, which he views as better than not voting at all. He does not feel good about it. “He went bankrupt as a   man, that doesn’t help me pay my bills,” said Mr. Wolf, who added that he did not like Mr. Trump’s nasty nicknames  —   “Crooked Hillary,” for example. “That’s a child talking,” Mr. Wolf said. He backed Mr. Kasich in the primary, but came around to Mr. Trump after the Ohio governor dropped out of the race. Roughly a third of all Clinton and Trump backers say the main reason for their choice is that they oppose the other candidate, a recent Pew Research Center survey found. Millennial voters, ages 18 to 29, are especially discouraged and looking for a political outsider who can inspire them  —   one reason they rallied around Mrs. Clinton’s primary opponent, Senator Bernie Sanders of Vermont. Picking at his chili and   sandwich, Mr. Burnside sounded absolutely deflated. His dining partner was his mentor, Steve Fitch, 68, a Clinton supporter. They were talking about Mr. Fitch’s work as a commercial litigator Mr. Burnside was seeking guidance on how he could use a career in law to “resolve conflicts. ” The 2016 campaign seemed antithetical to the younger man’s dreams. Mr. Burnside was asked if he ever thought about that. “Oh,” he said. “All the time. ”'"}, "time": 1742562030.817722}