{"duration": 0.04528069496154785, "input_args": {"text": "\"You are here: Home / US / 6 Brutal Truths About Democrats The 2016 Election Has Revealed 6 Brutal Truths About Democrats The 2016 Election Has Revealed October 29, 2016 Pinterest \\nSeth Connell reports that a new video released from Project Veritas provides evidence that Hillary Clinton herself worked in the operation to rig the election to ensure a win. \\nThis video is the third installment from Project Veritas, which has released two previous undercover videos showing Democratic operatives discussing highly unethical and illegal campaigning activities. \\nThe videos revealed such damaging information that two top Democratic operatives were released from their position; when people from the Clinton camp step down, you know it’s bad . BREAKING: Rigging the Election – Video III: Creamer Confirms @HillaryClinton Involvement https://t.co/ozb1frZ7rR #Veritas @PVeritas_Action \\n— James O'Keefe (@JamesOKeefeIII) October 24, 2016 \\nThis third installment includes a shocking number of insights into how the Democratic Party has been running the Clinton campaign. Several of the most memorable quotes from the video include: \\n“Nobody is really supposed to know about me.”-Aaron Black \\n“So Brad, and Bob, and Lux, and myself are all part of the old school method where, it doesn’t matter what the freakin’ legal and ethics people say, we need to win this motherf**ker.” -Aaron Black \\n(In regards to the “Donald Duck” characters showing up at Trump events): “Skalar [Clinton operative] had gone to some buddy of his who is one of her body people and she explained the idea to Hillary. And Hillary just loved it. Let me tell you something, I think she has the right instinct here. This thing is working, is resonating but that story is not exactly what you want to hear about how presidential decision-making happens.” -Robert Creamer \\nThe coordination between the Clinton Camp, the DNC, and Americans United for Change is a rather obvious violation of federal campaign finance laws regarding expenditures. DNC chair Donna Brazile was also involved in the coordination with the Clinton Camp as well. \\nAdditionally, Robert Creamer discussed why the Donald Duck idea had to be owned by AUFC and not by the DNC. \\n“The duck has to be an Americans United For Change entity. This had to do only with some problem between Donna Brazile and ABC, which is owned by Disney, because they were worried about a trademark issue. That’s why. It’s really silly.” \\nLater in the video Creamer revealed why that is the case: \\n“Donna Barzile had a connection with them and she didn’t want to get sued.” \\nAnd finally, an explicit admission about Hillary’s desires, straight from Creamer himself: \\n“We originally launched this duck because Hillary Clinton wants the duck.” \\nWatch the full video below: \\nThis certainly seems to be illegal campaigning, based on these videos. One of the interns even stated that there was a whole slew of reasons why responsibilities had to be divvied up, because the whole scheme was a mess. And why is that? Because they are violating campaign coordination law, so they have to. \\nIt’s truly unbelievable. A plethora of revelations now show us how corrupt Hillary Clinton and the DNC are, yet there are still millions of people that support them. If these revelations continue, and they still support her, what can you really say? \\nWhen corruption penetrates this deeply, and when the citizens still wholeheartedly back those who are driving the corruption, the country is in serious danger. \\nGod help us.\""}, "time": 1742563278.218753}