{"duration": 0.04989886283874512, "input_args": {"text": "\"Dictionnaire visuel Quand l’art s’invite dans les usines de l’Oural Depuis des temps reculés, l'Oural est synonyme d'industrie lourde : il fut un temps où la région était même la plus industrialisée au monde. Mais les temps changent, et cette région russe montagneuse est aujourd'hui plus célèbre pour ses projets artistiques. Nouvelles galeries, street art, Biennale d'Art de la Jeunesse… Les artistes émergents fourmillent, sans oublier les racines industrielles de la région. Faites défiler vers le bas pour voir plus Denis Tarasov Guennadi Vlassov est né en 1943 à Sverdlovsk (aujourd'hui Ekaterinebourg). Il est diplômé de l'école de commerce Ouralmach en 1961. OuralMach était un géant de la construction de machines, véritable étendard de l'industrie soviétique. Denis Tarasov Vlassov a travaillé comme artiste d'usine à partir de la fin des années 1960 jusqu'au début des années 1990. Il concevait des journaux muraux, écrivait des slogans et peignait des affiches satiriques. Denis Tarasov A la fin des années 1980, il aménage l'intérieur de la salle des outils de l'un des ateliers avec des répliques de célèbres paysages peints par des artistes russes et quelques unes de ses propres créations. Denis Tarasov Parmi les travaux connus, il a notamment copié la Fille à l'attelage en train de faucher par Arkadi Plastov, qui peignait des scènes de la vie quotidienne dans le style du réalisme socialiste. Denis Tarasov Dans les années 1980, les travailleurs eux-mêmes ont commencé à choisir des thèmes pour leurs armoires à outils – la plupart étaient des représentations de la nature. Au crépuscule de l'industrialisation, l'art était considéré comme un moyen de s'évader de la grisaille de l'usine. Denis Tarasov A l'heure de la modernisation, les peintures sont comme une bouffée d'air frais dans le royaume endormi des immenses machines condamnées au silence. Denis Tarasov Il y a quelques années, quelques uns de ces travaux ont fait leur apparition sur internet et ont retenu l'attention de plusieurs commissaires d'exposition d'Ekaterinebourg, qui ont présenté les conteneurs de Vlassov en tant que projet spécial lors de la Biennale d'art contemporain de la ville. Denis Tarasov Les conteneurs de Vlassov sont un exemple de la façon dont des objets de la vie de tous les jours se transforment en art contemporain une fois transposés dans une galerie. Denis Tarasov « Nous avons travaillé ici pendant des années et avons eu largement le temps de profiter de son art ! » , rigolent des travailleurs d'OuralMach en regardant passer des visiteurs de l'exposition. Denis Tarasov Le mot « exposition » est d'ailleurs un peu fourvoyé : malgré l'apparition de commissaires, de critiques d'art et de journalistes dans l'atelier, rien n'a vraiment changé à l'usine. Facebook\""}, "time": 1742628443.3262486}