{"duration": 0.029681682586669922, "input_args": {"text": "'As Anti-Media reported Monday, analysis of recent events suggests President Vladimir Putin may have ulterior motives in sending the largest Russian naval fleet since the Cold War steaming toward the Mediterranean Sea. He may, in fact, be initiating the first stages of militarily securing the long-desired Turkish Stream pipeline.\\nAs highlighted , positioning the aircraft carrier-led fleet just off the western coast of Syria in the Mediterranean also strategically places it between friendly nations to the north and south — Turkey, with whom the pipeline deal was officially signed last week, and Egypt, with whom Russia is now expanding ties both militarily and economically.\\nBut in truth, the agreements being struck around the Mediterranean — while unquestionably important in their own right — are indicative of a much broader, and rather recent, Russian pattern.\\nOn the southeast border of Russian ally, Iran, for instance, lies Pakistan. Russia raised eyebrows back in September when it announced that for the first time in modern history Russia and Pakistan would conduct joint military drills — a signal Russia’s influence is spreading across Asia.\\nIn October, it was reported additional joint exercises between the two nations had been scheduled for 2017.\\nPakistan’s neighbor to the east is India. In mid-October, it was announced Russia’s largely state-owned oil company Rosneft, along with other partners, would invest around $12.9 billion in India’s Essar Oil. Additionally, a Russian state investment fund would work with an Indian counterpart to invest $1 billion toward Indian infrastructure.\\nReported at the same time was the fact that Russia has also agreed to sell missiles to India, as well as to establish a joint venture to build military helicopters in the country. India, incidentally, will participate in 2017 drills with Russia and Pakistan.\\nFarther east, the story has been much of the same.\\nWhile officially pivoting from the United States to China last week, Philippines president Rodrigo Duterte proudly declared it was now China, the Philippines, and Russia against the world. While it may have sounded like wishful thinking on Duterte’s part at the time, it’s nonetheless the case that days ago the Russian ambassador to the Philippines said Duterte’s government should make a wish list of the types of assistance it wants from Moscow.\\nConsidering China has of late been strengthening relations with regional countries, such as it has with the Philippines — and, as it happens , Vietnam, who will also participate in the 2017 drills with Russia, Pakistan, and India — one could be forgiven for concluding the burgeoning Russian-Chinese superstate has an eye on locking down the entire coastline in the northern Indian Ocean.\\nEven loyal U.S. satellite, Saudi Arabia — which currently finds itself sandwiched between established Russian ally Iran to the northeast and, as Underground Reporter has previously outlined , what could very well be the new Russian ally of Egypt to the west — may be beginning to get swept up in pro-Russian sentiment.\\nOver the weekend, it was reported the Saudi energy minister has just invited his Russian counterpart to meet with Gulf Arab energy bigwigs in Riyadh in an effort to stabilize the global oil market.\\nSo while Putin’s sailing of the Russian fleet toward the Mediterranean Sea may, indeed, as many have suggested , be about power projection in the Middle East — which doesn’t negate the possibility the fleet also has every intention of laying waste to Aleppo — it’s difficult, given the emerging pattern, not to conclude that Russia and cohort China are making a move toward something much, much bigger.\\nThis article ( How Putin’s Plan to Collect Former US Allies Could End the American Empire ) is free and open source. You have permission to republish this article under a Creative Commons license with attribution to James Holbrooks and UndergroundReporter.org . \\n'"}, "time": 1742628521.5679219}