{"duration": 0.07477712631225586, "input_args": {"text": "'LONDON  —   Talks between the luxury house Louis Vuitton and workers at its ateliers across France were extended on Thursday, a day after scores of the company’s employees staged a walkout for the first time in 15 years to demand wage increases. Shortly before a deadline that had been imposed by Louis Vuitton, both sides agreed to prolong discussions, the company announced. While the employees are back at work for now, the image of striking leather workers on Wednesday might have had especially negative connotations for the luxury brand. For luxury businesses  —   where profits are often   and the bespoke craftsmanship at its ateliers is front and center in marketing messages  —   a nasty shadow could be cast over those seen to be exploiting workers who cater to the whims of the elite. Louis Vuitton, known for its   monogrammed leather goods and the   skills of its French master craftsmen and women, is the jewel in the crown of its parent company, LVMH Moët Hennessy Louis Vuitton, the largest luxury group in the world by sales. The hourlong walkout on Wednesday, which was first reported by Agence   started with employees gathering in front of their various production facilities across France at 7:30 a. m. Union representatives from Force Ouvrière and the Confédération Française Démocratique du Travail told Agence   that the workers were staging the protest after a wage increase offer from Louis Vuitton management failed to meet expectations. The company had offered a gross raise of 30 euros a month, or about $31. 95, for every employee, union representatives said  —   far lower than the €55 workers requested. Managers had also offered raises of an additional €10 to €20 a month for 80 percent of workers. As the luxury industry has grappled with an increasingly volatile trading climate because of geopolitical instability, fluctuating foreign exchange rates and the demands of consumers, LVMH  —   for the most part  —   appeared to be weathering the storm. In 2016, it posted record results, with total sales of €37 billion. Sales from its fashion and leather goods division  —   which does not break out results by brand  —   rose 8. 2 percent in the fourth quarter of 2016, to €3. 78 billion. The label also registered 9 percent organic growth, beating analysts’ estimates of about 5 percent. The latest set of strong results appears to have been one motivating factor for the workers’ strike, the first in over 15 years, according to a Force Ouvrière representative,   Damelincourt. “Calling for a walkout at Vuitton is tough, people are afraid of being seen badly,” Mr. Damelincourt said. “But today, a good part of the employees have mobilized to show their dissatisfaction. ” “Louis Vuitton has once again registered an exceptional year of results in 2016, and we are proud to have contributed to this result,” he added. “We now want a remuneration worthy of our commitment. ” Mr. Damelincourt said that the turnout for the strike was 30 percent of all employees from the workshops in Issoudun and in Condé, more than 50 percent from the facilities in Asnières, and 25 percent to 50 percent of employees in workshops in the Ardèche area and in the Drôme. But LVMH had a different story. Louis Vuitton has 18 leather workshops, including 12 in France four of the French sites were involved in the walkout action on Wednesday, a company spokesman said. Louis Vuitton employs a total of 3, 100 atelier workers in France, hired 370 new employees last year and continues to be a highly   place for creative workers to seek employment, the spokesman said. “In addition to their 13 months of payment every year, employees had in March 2017, for the last business year, the equivalent in   of between four and five months in compensation,” the spokesman said, adding that this type of bonus was relatively rare in France. About two weeks before the start of the French presidential election, where employment laws are a major topic of debate, the impact of labor conflicts continues to be a problem in several business sectors. The French air traffic control walkout last month caused a   1, 500 flight cancellations, according to estimates by the commercial aviation group Airlines for Europe. In 2016, the country was paralyzed by strikes of pilots, train drivers, taxi drivers and garbage collectors. The unrest, alongside other factors such as a fear of terrorist attacks, has played a part in a decline in tourism to France, currently the most visited country in the world.'"}, "time": 1742562921.9592447}