{"duration": 0.11643743515014648, "input_args": {"text": "'  Since 2011, VNN has operated as part of the Veterans Today Network ; a group that operates over 50 plus media, information and service online sites for U.S. Military Veterans. Citigroup bank chose Obama’s 2008 cabinet – WikiLeaks By VNN on October 31, 2016 The single biggest beneficiary was Citigroup, which was given $45 billion in cash in the form of a government stock purchase, plus a $306 billion government guarantee to back up its worthless mortgage-related assets. Obama’s cabinet – 2008 \\nWSWS.Org. \\nOne month before the presidential election of 2008, the giant Wall Street bank Citigroup submitted to the Obama campaign a list of its preferred candidates for cabinet positions in an Obama administration. This list corresponds almost exactly to the eventual composition of Barack Obama’s cabinet. \\nThe memorandum, revealed by WikiLeaks in a recent document release from the email account of John Podesta, who currently serves as Hillary Clinton’s campaign chair, was written by Michael Froman, who was then an executive with Citigroup and currently serves as US trade representative. The email is dated Oct. 6, 2008 and bears the subject line “Lists.” It went to Podesta a month before he was named chairman of President-Elect Obama’s transition team. Why is this Ex-Citigroup Executive Pushing TPP “Fast Track”? \\nThe email was sent at the height of the financial meltdown that erupted after the bankruptcy of Lehman Brothers on September 15 . Even as Citigroup and its Wall Street counterparts were dragging the US and world economy into its deepest crisis since the 1930s, they remained, as the email shows, the real power behind the façade of American democracy and its electoral process. \\nFroman’s list proved remarkably prescient. As it proposed, Robert Gates, a Bush holdover, became secretary of Defense; Eric Holder became attorney general; Janet Napolitano, secretary of Homeland Security; Rahm Emanuel, White House chief of staff; Susan Rice, United Nations ambassador; Arne Duncan, secretary of Education; Kathleen Sebelius, secretary of Health and Human Services; Peter Orszag, head of the Office of Management and Budget; Eric Shinseki, secretary of Veterans Affairs; and Melody Barnes, chief of the Domestic Policy Council. \\nFor the highly sensitive position of secretary of the Treasury, three possibilities were presented: Robert Rubin and Rubin’s close disciples Lawrence Summers and Timothy Geithner. Obama chose Geithner, then president of the Federal Reserve Bank of New York. Geithner, along with Bush Treasury Secretary (and former Goldman Sachs CEO) Henry Paulson and Fed Chairman Ben Bernanke, had played the leading role in organizing the Wall Street bailout. \\nRubin had served as Treasury secretary in the Bill Clinton administration from 1995 until 1999, when he was succeeded by Summers. In that capacity, Rubin and Summers oversaw the dismantling of the Glass-Steagall Act (1933), which had imposed a legal wall separating commercial banking from investment banking. Immediately after leaving Treasury, Rubin became a top executive at Citigroup, remaining there until 2009. \\nA notable aspect of the Froman memo is its use of identity politics. Among the Citigroup executive’s lists of proposed hires to Podesta were a “Diversity List” including “African American, Latino and Asian American candidates, broken down by Cabinet/Deputy and Under/Assistant/Deputy Assistant level,” in Froman’s words, and “a similar document on women.” Froman also took diversity into account for his White House cabinet list, “probability-weighting the likelihood of appointing a diverse candidate for each position.” This list concluded with a table breaking down the 31 assignments by race and gender. \\nCitigroup’s recommendations came just three days after then-President George W. Bush signed into law the Troubled Asset Relief Program, which allocated $700 billion in taxpayer money to rescue the largest Wall Street banks. \\nThe single biggest beneficiary was Citigroup, which was given $45 billion in cash in the form of a government stock purchase, plus a $306 billion government guarantee to back up its worthless mortgage-related assets. The President and Wall Street – 2008 \\nThen-presidential candidate Obama played a critical political role in shepherding the massively unpopular bank bailout through Congress. \\nThe September financial crash convinced decisive sections of the US corporate-financial elite that the Democratic candidate of “hope” and “change” would be better positioned to contain popular opposition to the bailout than his Republican rival, Senator John McCain of Arizona. \\nAs president, Obama not only funneled trillions of dollars to the banks, he saw to it that not a single leading Wall Street executive faced prosecution for the orgy of speculation and swindling that led to the financial collapse and Great Recession, and he personally intervened to block legislation capping executive pay at bailed-out firms. \\nThe same furtive and corrupt process is underway in relation to a new U.S. administration. \\nFroman’s email is one of many thousands released by WikiLeaks from the account of Podesta. HILLARY CLINTON, FORMER SECRETARY OF STATE’S “PRIVATE EMAIL SERVER” HACKED \\nThose communications, such as the Froman email, which expose who really rules America, have been virtually ignored by the media. \\nThe pro-Democratic Party New Republic called attention to it in an article published Friday , but the story has received little if any further coverage. \\nThe media has instead focused on salacious details of Republican presidential nominee Donald Trump’s sexual activities, designed, in part, to divert attention from the substance of the Clinton campaign-related emails being released by WikiLeaks and other sources. \\nThe New Republic drew attention to the Froman memo not because it opposes such machinations, but as a warning to the interests it represents that they must move now to influence the eventual composition of a Hillary Clinton administration. \\n“If the 2008 Podesta emails are any indication, the next four years of public policy are being hashed out right now, behind closed doors,” wrote New Republic author David Dayen. “And if liberals want to have an impact on that process, waiting until after the election will be too late.”'"}, "time": 1742564323.0350392}