{"duration": 0.0660400390625, "input_args": {"text": "'Politico reports that Obama administration staffers are mourning the repeal of regulations that they had spent years crafting but which are being eliminated by a Republican Congress under the 1996 Congressional Review Act. [Many of the regulations were promulgated late in President Barack Obama’s term, in the hope of locking the incoming Trump administration into   policies it would not be able to reverse.  Former Interior Department Office of Surface Mining Reclamation and Enforcement director Joe Pizarchik told Politico that Congress had “ignored the will of the people” in repealing regulations such as a restriction on mountaintop coal mining that he had championed. But critics would argue that the proliferation of such regulations, made and enforced by unelected bureaucrats, is precisely why Trump won in the first place. The Congressional Review Act was passed after New Gingrich’s 1994 Republican Revolution precisely to act as a break on a runaway federal bureaucracy. Kimberly Strassel of the Wall Street Journal pointed out last month that while the law is usually reserved for regulations passed in the previous 60 days, it actually allows Congress to repeal many of the regulations that were created under Obama over the past eight years, because the federal agencies never reported their regulations to Congress: Here’s how it works: It turns out that the first line of the CRA requires any federal agency promulgating a rule to submit a “report” on it to the House and Senate. The   clock starts either when the rule is published or when Congress receives the report —  whichever comes later. “There was always intended to be consequences if agencies didn’t deliver these reports,” Mr. [Todd] Gaziano of the [Pacific Legal Foundation] tells me. “And while some Obama agencies may have been better at sending reports, others, through incompetence or spite, likely didn’t. ” Bottom line: There are rules for which there are no reports. And if the Trump administration were now to submit those reports —  for rules implemented long ago —  Congress would be free to vote the regulations down. There’s more. It turns out the CRA has a expansive definition of what counts as a “rule” —  and it isn’t limited to those published in the Federal Register. The CRA also applies to “guidance” that agencies issue. Think the Obama administration’s controversial guidance on transgender bathrooms in schools or on Title IX and campus sexual assault. It is highly unlikely agencies submitted reports to lawmakers on these actions. On January 30, President Trump issued an executive order providing “that for every one new regulation issued, at least two prior regulations be identified for elimination. ” Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563852.1492631}