{"duration": 0.0645151138305664, "input_args": {"text": "'Should Donald Trump hamstring the U. S. economy, rip off the consumer, despoil the landscape, give succour to America’s enemies and promote junk science  —   all in order to keep a “seat at the table” with people who despise him and think he’s an idiot? [To some people  —   including several senior members of the Trump administration  —   the answer isn’t immediately obvious. Which is why this week both a leading U. S. scientist and a number of top Senate Republicans have had to urge the president to see sense and ignore the siren voices urging him to stay in the UN’s Paris climate agreement.  The 20 top Republicans, led by Majority Leader Mitch McConnell,  . have signed a letter warning the president that remaining in Paris “would subject the United States to significant litigation risk that could   your administration’s ability to fulfill its goal of rescinding the Clean Power Plan. ” Meanwhile, the distinguished physicist Will Happer  —   long mooted as a possible Science Advisor in the Trump administration  —   has argued that staying in Paris will not only be pointless but will be a betrayal of Trump’s election promise to voters that he would pull out. Climate policy, however, poses a grave threat. Yes, those who engineered the Paris Agreement will be upset if the United States withdraws. Withdrawal will also outrage the many who profit from climate alarmism. But remaining in the Paris Agreement will not sit well with many of those who voted for Mr. Trump in part because of his campaign promises to withdraw from the agreement. These voters rightly perceived that the agreement would benefit a privileged international elite, at the expense of the common people of the United States and of the rest of the world. You might think that such interventions ought to be unnecessary. President Trump is, after all, an avowed climate skeptic who has already taken several important steps towards tackling the Green Blob, most recently by promising to eliminate “nearly $1. 6 billion in international programs aimed at promoting green energy and fighting global warming. ” Among the targets on his hit list: the United Nations’ Green Climate Fund (GCF) which hands out money for programs to adapt or mitigate global warming the Clean Technology Fund and the Strategic Climate Fund  —   saving $239 million and the Global Climate Change Initiative, saving U. S. taxpayers $362 million. But Trump is still wavering over the Paris climate agreement, which senior members of his administration, including Jared Kushner, daughter Ivanka, and Secretary of State Rex Tillerson are urging him not to quit. Anyone puzzled by the fact that the former CEO of Exxon is supporting an agreement totally opposed to the company’s business model and shareholder interests really needs to read this   piece by Steve Milloy. Exxon, Milloy explains, like most Big Oil companies has effectively been hijacked by green activists. As described in George Washington University professor Jarol B. Manheim’s 2004 book “  and the    Elite: The Progressive Attack on the Corporation,”   political activists met and decided after the election of Ronald Reagan in 1980 that one way back to political power was to become activist shareholders in publicly owned corporations. That is, they would exercise the rights and status of shareholders to pressure, if not, capture corporate managements so as to use corporate resources and influence to help achieve their political agenda. It has been an enormously successful strategy for the activists, especially when it comes to the controversy over climate change. Not only do many of the largest and     corporations now openly advocate for climate policies, even oil and gas companies have been pressured into pursuing policies that militate against their own products. This is one of the many disastrous side effects of the growing power of the green blob: it is stopping businesses from doing business, making everyone poorer as a result. As Milton Friedman famously wrote in 1970: “There is one and only one social responsibility of business  —   to use its resources and engage in activities designed to increase its profits so long as it stays within the rules of the game, which is to say, engages in open and free competition without deception or fraud. ” So businesses serve as society’s wealth generators. They are not governments, charities, or activist groups. When it comes to climate, Exxon Mobil’s job is to create wealth via production and sale of oil and gas  —   not to participate in the dubious pursuit of returning the atmosphere to   Revolution conditions. Amen, bro. Mr President  —   jobs, the economy and the American way are in peril here. Are you listening?'"}, "time": 1742564045.700685}