{"duration": 0.2332930564880371, "input_args": {"text": "'The problem with emerging naked from a flaming temple is that it’s hard to top. It’s hard to top, that is, unless you happen to have a dragon with a flair for dramatic timing. So it went on Sunday, as Daenerys Targaryen wrapped up this week’s “Game of Thrones” with a stump speech for the ages. Populist rhetoric? Check. I know most khals prefer an elite inner circle of bloodriders, Dany told the assembled, but I want you all. Relatable local reference? Check. I remember like it was yesterday, Khal Drogo promising me the Seven Kingdoms at the Mother of Mountains, easily my favorite mountain in Essos. Demonization of outsiders? You better believe it. Look at them over there, with their iron suits and stone houses. They think they’re better than you, but we’re going to show them different. Oh and by the way, did you happen to notice that I’m sitting on an actual dragon right now and let me hear you say it: Are you with me? Now and always? They were. It’s hard to blame them  —   it was quite the performance. I was ready to air out some iron suits and tear down a stone house or two myself, and I don’t even own an arakh. Dany’s dragon rally wrapped up an episode titled “Blood of My Blood,” which you may recall is how Dothraki leaders and bloodriders address one another. The phrase also applied neatly to nearly every other story of the night. There was the excruciating      in Horn Hill, as well as the loathsome Walder Frey’s harsh treatment of his own   . (Welcome back, Tobias Menzies.) In King’s Landing, the marriage of Tommen and Margaery and their ongoing issues create all sorts of awkward ties between the Lannisters and Tyrells. That whole thing’s not going to end well. Finally there was Uncle Benjen, the brother of Ned Stark, who made a heroic return to the story, saving Bran and Meera from their Wight pursuers with some sort of flaming mace. (I guess all the other Wights got lost?) But first back to Dany. The speech, a near copy of the one Khal Drogo made in Season 1, was fiery enough to almost make me overlook a couple of things. One was the convenience of Drogon’s arrival, as alluded to above. You’ll recall that he was the one who kicked off this whole Dothraki revival tour at the end of last season by dumping Dany in a field and apparently disappearing. Now he’s back at her beck and call? Or are we to believe that Drogon knew all along that Dany’s capture was for the best in the long run? (Can dragons have greensight?) I guess another possibility is that this was the plan all along  —   that once Dany realized where she was, she hatched a plan to be captured and assume command of the Dothraki forces. But if that was the case, why not just use the dragon to do it? (Or why leave the ring for Daario and Jorah to find?) It’s not a huge thing, but I hope the writers clarify at some point rather than continuing to rely on the Drogon ex machina route. The other thing: Dany didn’t exactly refute Daario’s point that she was a conqueror, not a   did she? Rather, he almost seemed to remind her oh yeah, I’ve been meaning to rile up everyone with my dragon  …     My colleague James Poniewozik recently wrote about Dany’s inclination toward “permanent revolution,” contrasting it with Tyrion’s belief in realpolitik solutions. Will Tyrion’s steadying hand be enough to offset Dany’s   proclivities, or at least keep her from burning everything up the way her mad father did? She certainly seems to have a knack for it. I assume that was him, the Mad King Aerys II, in Bran’s visions. He seemed just as charming as advertised. It was interesting that the show chose to include him in the same episode that found Dany reaffirming her   toppling intentions  —   could it have been a warning? Which is to say: Are we sure we want Dany to be successful in her attempt to retake Westeros? She’s been a sympathetic character largely because she’s been a liberator of the oppressed, but isn’t that also an expedient way to build an army? Have we been backing someone who would actually be a disastrous ruler? For the record, I would love it if the mother of dragons turned out to be a villain in this story, though I don’t really expect it to go that way. (The dragons seem destined to be the fire opposing the White Walkers’ ice.) But there could be a fascinating reckoning coming, though it likely won’t be anytime soon. This is Dany we’re talking about  —   so far she’s more prone to spinning wheels than breaking them. It could take her another season and a half just to get back to Meereen. Speaking of leisurely arcs, Benjen’s been missing for a while  —   it turns out he was killed by White Walkers but saved by a strategic dragonglass stab by some forest children. (Read that sentence again this show is so nutty sometimes.) Bran spent much of the escape trying to boot up like a   cable box, downloading seemingly the entire story, including some intriguing things we haven’t seen yet. (Troubling thought: What if this whole show ends with Bran staring at a snow globe?) The good news for Bran is that he traded a Hodor for a ranger, an upgrade in ability if not in heart. (No offense, big guy, wherever you are.) The previous   Raven brought in Benjen to watch Bran’s back, and he also suggested that they’d all be returning to the main story soon, hopefully, by heading to the Wall to wait for the Night King. I’m sure Jon Snow will appreciate having another formerly dead guy around, too  —   maybe they can start a support group. Back in King’s Landing, the High Sparrow is proving cagier than many of us probably expected (or wanted). The joint   offensive came to naught because the Sparrow and Margaery brought Tommen into the fold. What just happened? Mace the lovable doofus asked his mother in King’s Landing. “He’s beaten us,” she replied. Of course, it’s easy to look smart when your opponent is an inbred   a few swords shy of a throne. (If Joffrey’s penalty for Jaime and Cersei’s sins was psychopathy, Tommen’s would seem to be imbecility.) Not only did Tommen thwart the planned overthrow of the Faith Militant by embracing it, he shunted Jaime off to deal with the Blackfish situation at Riverrun. That’s fine with me: I like Jaime better on the road, anyway, especially if he takes Bronn with him. (The preview of next week’s episode seemed to suggest as much.) Cersei was good with it, too. “Stand at the head of our army where you belong,” she told him. “Show them what Lannisters are   …    ” And then they both got so fired up with all the revenge talk, they collapsed into each other’s arms. Don’t ever change, you crazy kids. I don’t think for a second that Margaery is buying any of the Sparrow rhetoric  —   if you had any doubt that she was a formidable operator, notice how slickly she avoided her own walk of shame. But I’m actually more intrigued by the person we’ve seen hardly at all: her brother Loras. When we last saw him, he was coming apart, groveling in the dirt and ready to do anything to make it all stop. I can’t help thinking the show is setting him up for some sort of shocking kamikaze act. Tommen is too valuable to Margaery  —   she controls him and if he goes, she’ll be left looking for another heir to hook up with. (I don’t even know who would be next, aside from the eternally rowing Gendry.) Jaime is heading out to Riverrun. So that leaves   …     Cersei? Would the show go there? She has a trial by combat coming up, as she reminded us Sunday. And when’s the last time anything went wrong at one of those? Sorry  —   I meant “right. ” When’s the last time anything went right at one of those? Finally, over at Tarly Acres, Sam’s big reunion with his family combined the real twin pillars of “Game of Thrones”: Awful fathers and terrible dinner parties. Meeting the prospective   is always tense, even if you don’t belong to a loathed people and your significant other isn’t hated by one of his parents. Which is to say: Gilly never really stood a chance of being accepted. And Sam knew it, strategically withholding all potentially inflammatory information from his letter. “It wasn’t a very large piece of parchment,” he explained pathetically, which I enjoyed. But hey, at least they got a nice sword out of it. I’m not totally sure why the show’s spending so much time on Sam and Gilly, aside from perhaps using them to stand in for all the humble family units at risk of getting ground up by these clashes between more powerful clans. That said, you saw Sam’s house. He’s not exactly the salt of the earth. I imagine the whole point of the homecoming was to put that Valyrian steel sword in Sam’s hands for future use. You will never wield that sword, his father told him, which I imagine most of us heard as “you will definitely be wielding that sword before long. ” It happened quicker than I thought, but good for him. With a dad like that, he deserves it. • It looks like our long, faceless nightmare may almost be over: Arya has effectively cut her ties with the House of Black and White. We thought she seemed unlikely to kill the Meryl Streep of Braavos and she did not, which no doubt delighted the horrible Waif. (Jaqen’s “don’t let her suffer” absolutely went in one ear and out the other.) I’m happy for Arya to introduce the Waif to Needle and then move on, perhaps as a new understudy to replace the troupe’s resident Eve Harrington. I’m not sure we’ve seen the last of those guys, based on the warmth between Arya and the actress, and the casting of Richard E. Grant as the temperamental playwright. • I don’t think we’re through with Jaqen either, or he with Arya. I suspect all the apparent exceptions he’s made for her  —   overlooking her nobility, giving her another chance after she killed Meryn Trant  —   signal an agenda he hasn’t revealed yet. I do think we’re done with stick beatings though, and for that, a man is glad. • “I think our father could learn a thing or two from your father,” Sam’s sister told Gilly, which made me laugh, and then made me feel guilty for laughing. Craster was the worst, which is saying something on this show. • You need at least 1, 000 ships, Daario told Dany. Hmm, if only there were a couple of renegade siblings with a bunch of ships   …     • Hodor. (Never forget.) • What did you think? Was dinner at the Tarlys the worst one yet? What did you make of Bran’s visions? Who’s naming these swords, anyway? (Heartsbane?) Who’s been the most reprehensible father on this show? Please let us know in the comments.'"}, "time": 1742562295.7575634}