{"duration": 0.07884025573730469, "input_args": {"text": "'The Wall Street Journal in an editorial over the weekend said Democrats are trying to squelch the story of Susan Rice’s unmasking of Trump campaign officials, and the House and Senate Intelligence committees should investigate the former national security adviser. [“The House and Senate Intelligence committees should investigate what she did and why,” the Wall Street Journal argued in an April 28 piece.  Last month, blogger Mike Cernovich and other news outlets reported that Rice had unmasked, or identified the names, of Trump campaign officials caught up during surveillance of a foreign target. The piece said Democrats raised a fuss in 2005 over   Bush official John Bolton doing the same thing but with far more justification, due to the job he held, but are now “going all in to squelch” the story. “Then Senators Joe Biden and Chris Dodd kicked up a fuss that, as Undersecretary of State for Arms Control and International Security, Mr. Bolton had 10 times over four years asked for the names of American officials who were swept up in National Security Agency monitoring. ” “Democrats and their press allies are going all in to squelch the Susan Rice ‘unmasking’ story, insisting that the decision by Barack Obama’s national security adviser to seek the name of at least one Trump campaign official was routine and no big deal,” it said. For example, it said, “House Intelligence Committee Democrat Adam Schiff released a tutorial on why unmasking is ‘lawful.’ ‘Susan Rice Did Nothing Wrong,’ said an NBC headline, quoting no one on the record. ” The Wall Street Journal editorial also pointed out that while Rice and Democrats have defended her actions as “not uncommon,” Democrats and the media in 2005 characterized it as unusual. At that time, Dodd claimed unmasking was “rarely requested” and “infrequently” by “political appointees such as Mr. Bolton. ” The New York Times also reported that requests to unmask “are not common, particularly from policy makers. ” The editorial also argued that there was no apparent reason for Rice to have requested the unmasking of Trump campaign officials’ names, contrary to her explanations. “Ms. Rice had no direct intelligence duties in her NSC post, and no Democrat has provided a valid reason that Ms. Rice might have needed to unmask anyone associated with the Trump presidential campaign,” the editorial said. Rice has denied doing anything “untoward” with the intelligence she received, as did Bolton. But Democrats had drawn up a list of 36 individuals that he clashed with and called on National Intelligence Director John Negroponte to rule out they were the target of Bolton’s unmasking. And while House Intelligence Chairman Devin Nunes ( ) has stepped aside from his committee’s Russia probe after complaints from   activist groups that he discussed unmasking in public, Democrats in 2005 “couldn’t stop talking to the press,” the piece said. The piece also pointed out that names unmasked by Bolton have still never made it out to the public, in contrast with the illegal leaking in February of phone conversations held by former Trump National Security Adviser Michael Flynn. “Twelve years on, not one of the 10 individuals unmasked by Mr. Bolton has had his or her identity leaked. By contrast, the Washington Post reports that no fewer than nine Obama appointees or career officials leaked or confirmed the identity and conversations of unmasked former Trump adviser Michael Flynn. “If John Bolton’s unmasking was questionable, then Mrs. Rice’s was more so. The House and Senate Intelligence committees should investigate what she did and why. ” Rice is expected to be among witnesses asked by the House intelligence committee to testify in its ongoing probe of Russian interference in the elections.'"}, "time": 1742564617.050039}