{"duration": 0.1631629467010498, "input_args": {"text": "'. Ever Heard of CAPTAGON? The Drug of the ISIS Terrorists Captagon? What’s that you may ask? Captagon is the addictive drug used by some of the numerous terro... http://humansarefree.com/2016/11/ever-heard-of-captagon-drug-of-isis.html Captagon? What’s that you may ask? Captagon is the addictive drug used by some of the numerous terrorists, jihadis, mercenaries and Western-backed rebels in Syria – including Al-Nusra and ISIS . Captagon (aka fenethylline, Biocapton or Fitton) was first produced in 1961 as a mix of amphetamine and theophylline. It became illegal in most countries in 1986 due to WHO pressure. Being a stimulant, it fuels feelings of euphoria, fearlessness and power, gives you an energy rush before the crash, and numbs emotions and empathy.These are of course all qualities which are ideal for soldiers who want to kill and not feel the pain. Apparently, captagon is playing a significant role in the Syrian War , both economically and in terms of its mood-altering ability. Multiple drug busts have occurred since 2010. Last year in November 2015, Turkish authorities confiscated 11 million Captagon pills (1800 kg and worth an estimated US$220 million) that were destined for Syria . Last month in October, Lebanese police seized 3.5 million Captagon pills that were headed for Saudi Arabia. Is the drug another avenue by which the Western alliance (NATO-US-UK) is trying to influence and control the outcome of the Syrian War ? Drugs and Soldiers: A Connection Old as Humanity Itself There is long history of tyrants, monarchs, despots, army generals and military leaders feeding drugs to their soldiers to enhance their performance. A very early example is Alexander the Great, whose army relied on the opium poppy plant for its morphine (and from which modern heroin is made). The morphine allowed his soldiers to walk and fight with grave injuries and achieve astonishing feats of endurance. In more recent history, in both world wars, American and German soldiers used amphetamines during battle. Historian Norman Ohler recently released a book “Der totale Rausch” (which literally translates as “Total Rush”) which exposes the Nazi use of drugs during WWII. This article quotes Norman:“… the (German) soldiers used Pervitin, a German product patented in 1937 that contains methamphetamine, which is known today as crystal meth. It was freely available as a medicine until 1939. “In Berlin, it became a drug of choice, like people drink coffee to boost their energy. People took loads of Pervitin, across the board. The company wanted Pervitin to rival Coca Cola. So people took it, it worked and they were euphoric …”The Nazi rise to power was fueled by their military industrial complex (funded by Americans and Wall St.), including IG Farben , their powerful pharmaceutical conglomerate which was the ancestor of Big Pharma today. Hitler himself was said to be addicted to opiates:“The first thing I wanted to see were the personal notes of Hitler’s personal physician Dr Theodor Morell –… these notes were quite elaborate, describing how he treated Hitler over the years, including things like “injection as always” and “Eukodal,” which is a strong opiate.” The opium poppy, source of morphine and heroin, used by Alexander the Great for his soldiers Captagon: The Force Behind Crazed ISIS Fighters Can captagon explain, at least to some degree, the crazed attitude of ISIS fighters? We don’t have definitive proof, but we do have a collation of many anecdotes and quotes indicating that the amphetamine-based drug is a factor. The Washington Post collected these ones:“You can’t sleep or even close your eyes, forget about it,” said a Lebanese user (featured in this BBC documentary ) “and whatever you take to stop it, nothing can stop it.”“I felt like I own the world high.”“Like I have power nobody has. A really nice feeling.”“There was no fear anymore after I took Captagon.”“So the brigade leader came and told us, ‘this pill gives you energy, try it,’” he said. “So we took it the first time. We felt physically fit. And if there were 10 people in front of you, you could catch them and kill them. “You’re awake all the time. You don’t have any problems, you don’t even think about sleeping, you don’t think to leave the checkpoint. “It gives you great courage and power. If the leader told you to go break into a military barracks, I will break in with a brave heart and without any feeling of fear at all — you’re not even tired.”The world was first horrified by the cruelty of mercenaries like ISIS who were defiling historic sites and beheading prisoners. Was some of that barbarism due to drug-induced states? Where is the Captagon Being Made? The Cuban based website Prensa Latina released a short article in 2015 claiming that “according to experts, the North Atlantic Treaty Organization (NATO) began production of Captagon in 2011 in a laboratory in Bulgaria and it is now manufactured elsewhere in the world. “Part of the profits from the illegal trade in Captagon, experts say, is used to finance armed extremist groups that are trying to overthrow the Syrian government led by President Bashar al-Assad.”The article, however, does not mention which “experts” it got its information from. While this fits in with what we know of NATO – a US-controlled, aggressive military organization which invades sovereign nations like Libya on the flimsiest of pretexts to gain territory and control for the New World Order – there still needs to be more research done to determine the source of captagon. Other sources suggest it is being produced in Sunni rebel areas. Captivated by Captagon The word captagon, coincidentally, is a mix of the words “captivate” and “Pentagon”– interesting given the addictive nature of the drug and the potential US role in providing it. War and drugs have a long history together, whether it be because the soldiers are been fed drugs by their commanders, or because the war itself is being fought over the land and fields that grow the drug-producing plants (Vietnamese and Afghani heroin, Latin American cocaine). In his article CIA Drug Wars Could Explain Why Syrian ‘Rebels’, ISIS Violence Fuelled by Captagon Pills , journalist Patrick Henningsen writes that:“the deliberate strategic dispensing of potent narcotics in a paramilitary, insurgency theater … is a common technique employed by US intelligence agencies … more often than not, these drugs are the X-factor which fuels the extreme violence we see, and it’s used to terrorize local populations and produces more extreme graphic imagery for western media consumption.“The result: it aids in the generation of western fear, and public calls for Washington & Co to “step-up” its military activity in the region – in order to “keep us safe” in cozy America. A vicious cycle. Isn’t this what we’ve seen in Syria so far?” By Makia Freeman Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742562750.565668}