{"duration": 0.06537961959838867, "input_args": {"text": "'During a rally in Tuesday night in Florida, Hillary Clinton lied. Wait a second, that’s not surprising. That’s like saying the sky is blue . . . unless you’re a liberal, in which case you’ll probably say “the sky is green” and “how dare you discriminate against it.” \\nVia TruthAndAction \\n\\nAt least you can say this about Hillary Clinton, she’s consistent. She’s a consistent liar, a consistent hypocrite and most of all, she’s a consistent criminal. Unlike most of her past lies, which have somewhat intricate and easy to believe for the lazy minded, her latest lie is so far-fetched and comes at a time when she’s seeking as much sympathy as she can get, that you would have to be the world’s biggest idiot to believe it.\\nDuring her rally in Florida, Hillary claimed that she was in New York City on 9/11. The only problem is that she wasn’t. Not even the media can back up this claim, because many of them wrote sob stories about how she was in Washington that day.\\nUh oh . . .\\nNot only was she not in New York, there’s a story published by Politico about exactly what she did that day and how she reacted when she heard the news. Clinton did go to New York, but not until the following the day.\\nShe had CNN on as she talked on the phone with her legislative director when the first plane hit. Then the second. By the time she got to the Capitol, the Pentagon had been hit by a third plane. Capitol police were evacuating Senate office buildings. She dialed her daughter, who was in New York. She dialed her husband, who was in Australia. She and other senators received a briefing at the Capitol police station early in the evening. And after “a day indelibly etched in my mind,” and as nightfall approached, Clinton joined congressional colleagues on the steps of the Capitol, standing next to some of her fiercest political opponents, singing “God Bless America” with tears in her eyes. \\nHer statements came as she was opening old wounds revolving around the Pulse night club in Florida. She claimed that she was in New York on 9/11 and that she would defeat ISIS and protect America. Does that include from herself? Let’s hope she doesn’t get the opportunity.\\nSource: dailycaller.com \\n'"}, "time": 1742563282.9686193}