{"duration": 0.13366127014160156, "input_args": {"text": "'In Charlotte, N. C. the lines for the first wave of early balloting last month forced some voters to wait more than two hours. In Las Vegas last weekend, voters were still waiting outside a polling place in a Mexican grocery store two hours after it was set to close. In New York City on Election Day, voters who spilled out of polling sites snaked through schoolyards and around entire city blocks. There are two ways to interpret these scenes. “It does give some indication of the health of our democracy that you have all these people who are excited enough to vote that they’ll wait in a long line,” said Stephen Pettigrew, a Ph. D. candidate in Harvard’s department of government who studies polling lines. “But it’s also an indication, at least in some areas, that there is a problem. ” One problem is that some groups are much more likely to face long lines than others. Another, according to Mr. Pettigrew’s research on recent elections, is that the people who do wait are less likely to vote in the future as a result. Early voters, urban voters and minority voters are all more likely to wait and wait and wait. In predominantly minority communities, the lines are about twice as long as in predominantly white ones, Mr. Pettigrew has found. And minority voters are six times as likely as whites to wait longer than an hour to vote. Those disparities have persisted even within the same town or county, suggesting they don’t reflect simply the greater difficulty of putting on elections in populous cities. “That means members of minority communities are forgoing wages they’re having to juggle child and family care and all sorts of other things that white voters don’t have to do,” said Charles Stewart III, an M. I. T. political scientist. (In a presidential election, he has estimated, all this waiting nationwide adds up to a billion dollars in lost wages.) Voting essentially costs people more in minority communities, and that also makes them particularly susceptible to the long wait’s other effect. Mr. Pettigrew’s research suggests that for each hour   voters wait, their probability of voting in the next election drops by one percentage point. That may not sound like a lot, but Mr. Pettigrew estimates that this means 200, 000 people didn’t vote in 2014 because of the lines they encountered in 2012 (and that’s accounting for the lower turnout we’d expect in a midterm election). Even the most effective     tactics budge turnout by only three or four percentage points, at best. So long lines are a relatively powerful way to influence behavior. In concerns over minority turnout in particular, the public’s focus has fallen much more on the consequences of stricter voter ID laws and fewer early voting days. But long lines can have a similar effect, depressing turnout too. Mr. Pettigrew, whose data also shows that predominantly white precincts tend to receive more voting machines and poll workers, doesn’t argue that these patterns necessarily prove discrimination. Election officials may have reacted slowly, for example, to shifting dynamics in who votes. Historically, white turnout has been higher than black turnout  —   a pattern broken for the first time in 2012. But regardless of whether party officials are actively trying to depress minority turnout  —   a question litigated extensively over the last several years as the Supreme Court has weakened the Voting Rights Act  —   the effective outcome of these disparities matters. “I can understand long lines randomly appearing in places because of weird idiosyncratic forces,” Mr. Pettigrew said. “I think it’s not O. K. for there to be this systematic pattern in certain areas of long lines. ” For the vast majority of voters, this issue never arises. In 2012, voters waited an average of about 14 minutes to cast a ballot. Only about 5 percent waited longer than an hour. But that small fraction, in a presidential election, is several million voters. Those voters might be deterred in the future for several reasons. As the costs of voting rise, research suggests, people are less likely to do so. And many of us vote not because we think we’ll cast the deciding ballot, but for the civic experience  —   the chance to get that sticker, to join in the communal exercise, to feel patriotic. If the experience itself (or the customer service around it) is unpleasant, that undercuts one of the main reasons to do it. Mr. Stewart’s own surveys also show that people who wait longer to vote have less confidence that their votes are counted accurately. As a result, long waits may signal to voters that the entire election system is flawed. Just as unfair traffic stops can test faith in the criminal justice system, dysfunctional lines may undermine belief in American elections. And so why vote next time? In North Carolina, where a federal court struck down voting restrictions that it said targeted blacks with “almost surgical precision,” there were reports this election of black voters who encountered long lines and gave up. “In America, we have heightened awareness about racial disparities,” Mr. Stewart said. “And isn’t it really sad to say here’s yet another area in which the racial disparities exist, particularly in light of the fact that one of the top goals of   political activism for a century has been access to the poll. ”'"}, "time": 1742563819.276217}