{"duration": 0.047643184661865234, "input_args": {"text": "'President Donald Trump’s pick for the Office of Management and Budget’s deputy director post was grilled not for his budgetary principles, but for his Christian faith by former Democrat presidential candidate Sen. Bernie Sanders.[  During a hearing of the Senate Committee on the budget this week, Sanders essentially told nominee Russell Vought that Christians are bigoted and, therefore, should not serve in public office. Sanders pointed to an article Vought wrote in January 2016 about Dr. Larycia Hawkins, a political science professor at Wheaton College, Vought’s alma mater, who was placed on administrative leave after wearing a hijab to support Muslims. Hawkins had consulted with the Council on   Relations (CAIR) prior to donning the hijab. In a Facebook post, she had also suggested that Christians and Muslims worship the same God. Vought took issue with Hawkins’ post in a piece at the Resurgent, from which Sanders quoted. Excerpts from the exchange are as follows: Sanders: “Muslims do not simply have a deficient theology. They do not know God because they have rejected Jesus Christ, His Son, and they stand condemned. ” Do you believe that that statement is Islamophobic? Vought: Absolutely not, Senator. I’m a Christian, and I believe in a Christian set of principles based on my faith. Sanders: Forgive me, we just don’t have a lot of time. Do you believe people in the Muslim religion stand condemned? Is that your view? Vought: Again, Senator, I’m a Christian, and I wrote that piece in accordance with the statement of faith at Wheaton College. Sanders: I understand that. I don’t know how many Muslims there are in America. Maybe a couple million. Are you suggesting that these people stand condemned? What about Jews? Do they stand condemned too? Vought: Senator, I’m a Christian. Sanders: I understand you are a Christian, but this country [is] made of people who are not just —  I understand that Christianity is the majority religion, but there are other people of different religions in this country and around the world. In your judgment, do you think that people who are not Christians are going to be condemned? Vought: Thank you for probing on that question. As a Christian, I believe that all individuals are made in the image of God and are worthy of dignity and respect regardless of their religious beliefs. I believe that as a Christian that’s how I should treat all individuals. Sanders: Do you think that’s respectful of other religions?   …     I would simply say, Mr. Chairman, that this nominee is really not someone who this country is supposed to be about. I will vote “no. ” “In my view, the statement made by Mr. Vought is indefensible, it is hateful, it is Islamophobic, and it is an insult to over a billion Muslims throughout the world,” Sanders said. “This country, since its inception, has struggled, sometimes with great pain, to overcome discrimination of all forms.   …     We must not go backwards. ” Sen. Chris Van Hollen ( ) decided Sanders’ line of questioning was worthy of pursuing further at the same time he denied they were attacking Vought’s Christian faith. “I’m a Christian, but part of being a Christian, in my view, is recognizing that there are lots of ways that people can pursue their God,” Van Hollen said. “No one is questioning your faith.   …     It’s your comments that suggest a violation of the public trust in what will be a very important position. ” Writing at the Atlantic, Emma Green asserts, “It was a remarkable moment: a Democratic senator lecturing a nominee for public office on the correct interpretation of Christianity in a confirmation hearing putatively about the Office of Management and Budget. ” She continues: Article VI of the U. S. Constitution states that “no religious test shall ever be required as a qualification to any office or public trust under the United States. ” On Wednesday, Senator Bernie Sanders flirted with the boundaries of this rule during a confirmation hearing for Russell Vought, President Trump’s nominee for deputy director of the Office of Management and Budget. David French writes at National Review: This is a disgraceful and unconstitutional line of questioning from the man who came close to being the Democratic nominee for president. He’s not only imposing a religious test for public office in direct violation of Article VI of the United States Constitution, he’s gone so far as to label this decent man  —   who’s seeking to serve his country in a vital role  —   as “not someone who this country is supposed to be about. ” Vought expressed entirely orthodox Christian beliefs. There is nothing “extreme” about his statements, and they mirror the statements of faith of countless Christian churches and schools across the land. Are these believers also not fit for public office? I’ve written that Christians and Muslims don’t worship the same God. I suppose that means America’s not “about” me, either. Family Research Council (FRC) which has launched a petition calling on Sanders to “apologize for his religious bigotry,” states, “Our Constitution guarantees there will be no religious litmus test. Americans should never be forced to choose between their faith and public service. ” “Actually, Russell Vought is exactly what this country is about,” FRC states. “He’s exercising the belief that America was founded upon: that we are one nation, under God. The ability to voice that belief —  even in the public square —  is the same vision that brought the Pilgrims to America. ” “But after two terms of trying to drive Christianity underground, the Left isn’t about to declare a cease fire,” it continues. “If Bernie Sanders’s comments are any indication, they’re more determined than ever to wipe men and women of faith off the public service map. ”'"}, "time": 1742628545.309992}