{"duration": 0.050812482833862305, "input_args": {"text": "'News, information and analysis from the black left. Black Agenda Radio for Week of Nov 21, 2016 Submitted by Nellie Bailey a... on Mon, 11/21/2016 - 20:44 2016 presidential campaign Green Party: Part of the Solution \\n“I fully expected that we were going to get at least five percent of the vote,” said Green Party vice presidential candidate Ajamu Baraka . “I suspect that when push came to shove, particularly in those swing states, people held their nose and voted for the lesser evil.” Nevertheless, it is essential that the Greens continue to put forward “transitional demands that are meant to galvanize people and win concessions from the state, but also that you keep people focused on the fact the real objective is to transform this system, to take power from the capitalist state.” No World War, But Plenty of Domestic Oppression \\n“I think the threat of World War Three has receded significantly,” said author, activist and historian Paul Street . However, “I don’t know if I’ll think that of Trump in two years,” he added. “The more immediate dangers seem to be: police statist assaults on undocumented Latino immigrants, a registry of Muslims, and a potential designation of Black Lives Matter and civil rights activists as quasi-terrorists. The other great, existential threat is runaway climate change because Trump has pledged to thoroughly deregulate energy.” Saving Mumia and Others from a Curable Disease \\nActivists in the Free Mumia movement plan a rally on December 9, in Philadelphia, to pressure prison officials to treat the political prisoner and thousands of other inmates suffering from hepatitis C. “Healthwise, Mumia is not doing good at all,” said Pam Africa , of Concerned Family and Friends of Mumia Abu Jamal. “He has the appearance of good health, but he’s itching all over” and “his health is declining.” A judge ruled that Pennsylvania prison officials are obligated to treat Abu Jamal, but he used a technicality to avoid ordering that the cure actually be administered. Pam Africa said next month’s rally will also highlight unsafe, blackish water in prisons. At one facility, she said, “young people coming into the prison are losing their hair.” U.S. Election Ran on “Fear” and “Betrayal” \\n“It is accurate to say that economic discontent played a part” in Hillary Clinton’s defeat at the polls, said Mumia Abu Jamal . But he thinks other factors were at least as important. “The Trump campaign represented, not just fear, but profound paranoia, and also white revenge for the darkening of America.” However, “if Trumpism represented vengeance, then Clintonism represented betrayal,” because the Democrats failed to stand up on issues vital to their base constituencies. Torture, Anyone? \\nFormer Kansas Republican congressman Mike Pompeo is likely to be named CIA director in the Trump administration. “He’s a big fan of torture,” said Ray McGovern , a former CIA analyst who now spends most of his time trying to rein in the national security state. McGovern told Paul Jay, of The Real News Network, that Pompeo “visited Guantanamo, he said it was great, and then said, “As far as I can see, those prisoners are gaining weight.’” President Obama must share the blame. “If Obama had the strength of his convictions, he would have gotten rid of the torturers in the CIA,” said McGovern. “He let them stay, and now they’re having a celebration.” Black Agenda Radio on the Progressive Radio Network is hosted by Glen Ford and Nellie Bailey. A new edition of the program airs every Monday at 11:00am ET on PRN. Length: one hour.'"}, "time": 1742564122.0687256}