{"duration": 0.07671141624450684, "input_args": {"text": "'Juanita Broaddrick, the woman who accused Bill Clinton of raping her twice in a hotel room in 1978, slammed Madonna and other celebrities for leading a women’s march against Donald Trump yesterday while ignoring the plight of Clinton’s female sexual assault accusers during the presidential election. [Broaddrick, who charged that Hillary Clinton tried to silence her about the alleged rape, further labeled yesterday’s women’s march “just more a part of the fake news that they are trying to perpetuate. ”  “And their rhetoric,” added Broaddrick.  “They are so disappointing. ”  She was speaking on this reporter’s Sunday talk radio program, “Aaron Klein Investigative Radio,” broadcast in New York’s AM 970 The Answer and NewsTalk 990 AM in Philadelphia. Regarding Madonna, who delivered a     speech at yesterday’s event, Broaddrick stated: “I could never take her seriously. She, or when Meryl Streep spoke out. I could never take any of them seriously. Because they did not take us seriously. ” Continued Broaddrick: “None of these women have ever stood up for the women who were abused and raped by Bill Clinton. We’ve never gotten any support. I do not understand it. I mean, you don’t support an evil candidate just because she is a woman. And to me that is all this amounts to, Aaron. Is their candidate who was absolutely corrupt lost to Mr. Trump. Mr. Trump is the only one that stood up for us.   …    ”It’s unbelievable. That they didn’t come out for the women that were against their candidate. The women that were abused by Bill Clinton. It’s still unbelievable. If it weren’t so sad it is almost laughable. I don’t understand why they do not support us. I don’t understand it. ” Time reported on Madonna’s speech at the women’s march: “To our detractors that insist that this march will never add up to anything, f —   you,” Madonna said. The singer said the expletive three times during her speech at the march, saying it took “this horrific moment of darkness to wake the f —  k up. ” The “Vogue” singer said marginalized communities would be under threat during the Trump administration, which is why hundreds of thousands of women took to the streets in protest. “Yes I am outraged,” she said. “Yes I have thought an awful lot about blowing up the White House, but I know that this won’t change anything. We cannot fall into despair. ” The mission statement for yesterday’s march claims that the gathering is meant to send a message “that women’s rights are human rights” and pledges to fight against those who have demonized “survivors of sexual assault. ” Last October, Breitbart News released an exclusive video interview in which Broaddrick recounted what she described as the   experience of being raped by Clinton. The YouTube video has since garnered over one million views. Watch it here: In another Breitbart News exclusive video, Broaddrick recounted an alleged encounter with Hillary Clinton in which Broaddrick says the future presidential candidate attempted to intimidate her into being silent about the alleged rapes. Broaddrick said she believed that Hillary Clinton knew that her husband had raped her during their encounter. Watch that video here:   Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742561853.192288}