{"duration": 0.0672910213470459, "input_args": {"text": "\"0 comments \\nAnthony Weiner (aka Carlos Danger) and his Pandora’s email box may just do in Huma Abedin AND Hillary Clinton. It just gets wackier and wackier by the minute. Huma testified that she turned over ALL devices that had State Department information and communications on them. Not so much. One wonders how 10’s of thousands of her emails got on Weiner’s laptop. Did she put them there or did he get copies of them for some sleazy reason? As DC churns, the soap opera continues. \\nIt definitely looks like Huma Abedin lied… in fact, perjured herself. Currently, Huma is nowhere to be found. Word has it she is holed up at home and Clinton is distancing herself from her. Hey Hildabeast… that’s not going to save your skanky behind. This time, you don’t have plausible deniability because you and Abedin were literally joined at the hip. Her crimes are your crimes. What’s worse, remember those pesky laptops that the FBI said they destroyed? Nope, they lied and kept them. Panicking now would be good guys. \\nFrom The Daily Beast : \\n…the new information that the FBI found State Department-related email on her home laptop also calls into question whether Abedin in fact turned over all of the devices she used to send and receive email while working at State. \\nOn June 28, 2016, Abedin said under oath in a sworn deposition that she looked for all devices that she thought contained government work on them so the records could be given to the State Department. (These records were subsequently reviewed by the FBI.) \\n“How did you go about searching for what records you may have in your possession to be returned to the State Department?” Attorney Ramona Cotca for Judicial Watch asked her. \\n“I looked for all the devices that may have any of my State Department work on it and returned — returned — gave them to my attorneys for them to review for all relevant documents. And gave them devices and paper,” Abedin answered. \\nThat’s definitely a problemo for the Clinton campaign. Now, Huma is claiming she has no idea how all those emails got on that laptop. She’s using the Schultz defense: “I know nothing!” And all of this was uncovered when Weiner couldn’t keep his Johnson where it belonged. He’s being investigated for approaching a 15 year-old girl in a sexting sting by the FBI. Four devices were seized in that case and surprise, surprise, surprise! Lookie what they found. Since the email scandal case was not officially closed yet, they had to reveal additional evidence found. Plus, those laptops that weren’t destroyed (oops!) are now being investigated. Not good for the Clinton camp. \\nA source told Fox News that there were over 10,000 emails of Huma’s on Weiner’s laptop… and they were ‘pertinent’ to the email investigation. It sounds to me as if Huma kept a copy of everything just in case, if you get my drift. The only thing holding up the crap from hitting the fan is the DOJ is refusing to give a warrant to the FBI for the laptop. But at some point either they will have to or a federal judge will stop in. Timing is everything here. \\nHuma won’t be able to play dumb or lie her way out of this one and I suspect Hillary knows that. The question is, will she implode before or after the election? Related Items Terresa Monroe-Hamilton \\nTerresa Monroe-Hamilton owns and blogs at NoisyRoom.net . She is a Constitutional Conservative and NoisyRoom focuses on political and national issues of interest to the American public. Terresa is the editor at Trevor Loudon's site, New Zeal - trevorloudon.com . She also does research at KeyWiki.org . You can . NoisyRoom can be found on Facebook and on Twitter .\""}, "time": 1742628410.076242}