{"duration": 0.17711901664733887, "input_args": {"text": "'Things India should do to improve its Olympic performance Posted on Tweet (Image via catchnews.com) \\nIn August 2016, Prime Minister Narendra Modi had formed a task force to plan for the next three Olympics. This was followed by our mainstream media writing the usual “ 10 things the task force should do to improve Indian sports ”, “ 7 ways India can ensure a better showing at Tokyo 2020 Olympics ”, “ How to win 20 Olympic medals by 2020 ” or “ India can get you 10 medals in 2020 if you spend Rs 480 crore ” kind of stuff. Two months down the line, all is forgotten. \\nSince we are not a satire site but a serious website, it was against our ethos to jump the gun and write such an article. Instead we have done painstaking research for the last 2 months and come up with our suggestions. \\nHere are our suggestions: \\n(A) Due to our colonial mindset, cricket dominates the sporting scene in India. Cricket in its purest form was meant for the aristocratic families of England who had nothing better to do with their time and wanted a game which would keep them occupied for days. It is not suitable for common working class Indians who have to earn a living. India was once the superpower in hockey and there is no reason why we cannot be once again. \\nOur Verdict: Create a social media campaign to boycott cricket. Force organizations who sponsor cricket to donate at least 5 Crore rupees for sponsoring other sports. Impose hefty fines on cricket commentators. Force Ravi Shastri to do commentary for hockey and kabaddi matches. \\n\\n(B) It is common to find people in Delhi and the surrounding NCR region flaunting their power and influence. One has often heard the phrase “Tu Janta hai mera baap kaun hai?” flaunted by these folks. This craving for recognition through power has prompted several impressionable kids in the NCR Region to take up aggressive sports to flaunt their power. Just look at the number of Olympic medalists from the NCR region who have won Olympic medals in aggressive sports: \\nAbhinav Bindra(2008) – Shooting Sushil Kumar (2008 and 2012) – Wrestling Yogeshwar Dutt (2012) – Wrestling Sakshi Malik(2016) – Wrestling \\nFurther, Gagan Narang who won the bronze in shooting in 2012, was brought up in Chennai and Hyderabad but his parents hail from the NCR region which explains it. \\nThe ripple effect from NCR is so strong that even Rajyavardhan Singh Rathore from neighboring Rajasthan won silver medal for shooting in 2004. \\nPoor Saina Nehwal found it difficult to practice a non-aggressive sport like badminton in NCR and had to shift to Hyderabad to become a champion and win a bronze medal in 2012 Olympics. \\nOur verdict: Channelize the aggressive and power flaunting energy of the NCR kids early on and we can be assured of a few medals from here in every Olympics. \\n\\n(C) Eastern and southern India has produced many Olympic medalists like Karnam Malleswari in Weightlifting, Mary Kom in Boxing, Leander Paes in Tennis and P. V. Sindhu and Saina Nehwal in badminton along with the likes of Dipa Karmakar who show a promise in a sport where India was never in the reckoning. \\nOur verdict: Just provide encouragement and things will improve. \\n\\n(D) Our intellectuals and elites attribute the poor showing of India to poverty. But then what explains western India’s poor show considering that it has two of the most prosperous states, Gujarat and Maharashtra. \\nThe last medal a person from Maharashtra won at the Olympics was Khashaba Dadasaheb Jadhav in Wrestling in 1952. But then Maharashtra is home to cricket legends like Sunil Gavaskar, Sachin Tendulkar and of course the cricket commentary of Ravi Shastri. This explains it. \\nBut what about Gujarat then? We are not mainstream media and we do not claim to have expertise on everything and we admit we do not have the answer. But the mainstream media which questioned Modi on everything else has kept quiet about this. Why? \\nOur verdict: We do not have an answer to this. But we will not keep quiet like the mainstream media. Why did Gujarat not produce a single Olympic medal winner? Will Modi answer? \\n\\n(E) Given that the elites blame the lack of facilities in our country for our poor show in Olympics, what stops the kids of these elites from excelling at sports? With cheap skilled manpower to help, they should have done well. Unfortunately, the Indian elites believe in a sense of entitlement and are not willing to work hard. Sport is a meritocratic activity and only performance matters. That is the reason sport is one stream in India which is dynasty free, except for brave exceptions like Rohan Gavaskar who are willing to fight against all odds. \\nA friendly media and intellectuals’ ecosystem can make a failed politician look successful, a failed actor a superstar or a news trader a journalist. But this ecosystem cannot make a cricket duck look like a cricket century. \\nThis explains why the son of one of India’s greatest cricketers, Mansoor Ali Khan Pataudi, who captained Indian cricket team despite having vision in only one eye, chose his mother’s profession rather than his father’s. His biggest sporting achievement to date remains winning a 100 meters sprint in an Amul Macho ad. \\nNow, you also know why the daughter of Prakash Padukone chose acting or why the son of Dilip Sardesai chose journalism. \\nOf course, there are exceptions like Leander Paes who went on to become a tennis star despite his father being a member of Indian hockey team and mother being member of Indian basketball team. He is also wise in that he choose tennis over hockey or basketball. Given his ability to get in trouble with his doubles partners, may it be Mahesh Bhupathi, Rohan Bopanna or Sania Mirza, one wonders how he would have fared in basketball or hockey which has a team of more than 2 players. \\nOur verdict: Lack of facilities is not an excuse, at least for the Indian elites. \\n\\n(F) Every other Indian boy wants to become a cricketer. For those boys who look beyond cricket, analysis of Indian Olympic winners show that men have only won in hockey and aggressive sports like shooting, boxing and wrestling, except for Norman Pritchard in 1900 who was anyway born to British parents and moved to Britain soon after winning the medals. \\nOf course Leander Paes is an exception but we already told you why he did not play hockey and also how aggressive he is even towards his partners. \\nOur verdict: Do not expect anything from Indian men beyond hockey and aggressive sports. \\n\\n(G) Compared to Indian men, Indian women have won medals in a variety of sports and have been very inclusive, such as Karnam Malleswari in weightlifting, Saina Nehwal and P. V. Sindhu in badminton, Mary Kom in boxing and Sakshi Malik in wrestling. The fact that women got opportunity to train and win in sports like boxing and wrestling that are considered the domain of men show how fake the propaganda of the feminist intellectuals is. \\nThese feminists intellectuals will form stereotypes based on their opinions and peddle it as facts. Being into responsible journalism, we cannot do that. So we decided to explore an angle we thought was a cause for concern. While it’s true that this decade has seen the rise of likes of P. V. Sindhu and Sakshi Malik, what concerned us was, “Why is there no one to carry forward the legacy of P. T. Usha and Anju George? Why is Indian falling backwards in women’s athletics?” \\nWe did some investigative journalism and the results will shock you. The reason is not patriarchy but colonial hangover. All of India’s women medal winners have won in indoor sports like boxing, wrestling, badminton and weightlifting. As per our investigation, small school girls are interested in participating in difficult indoor games like gymnastics but they are scared to play any outdoor games for fear that it will darken their skin. Naturally, India is falling behind in women’s athletics. \\nOur verdict: Ban fair skin creams. This single action will ensure India wins more medals. Change the slogan “Beti bachao, beti padhao” to “Beti bachao, beti padhao, gorepan ka dabaav na dalo.”'"}, "time": 1742562481.238601}