{"duration": 0.09067225456237793, "input_args": {"text": "'“Most people don’t think data management is sexy,” says Jared Auerbach, owner of Red’s Best, a seafood distributor in Boston. Most don’t associate it with fishing, either. But Mr. Auerbach and a few other seafood entrepreneurs are using technology to lift the curtain on the murky details surrounding where and how fish are caught in American waters. Beyond Maine lobster, Maryland crabs and Gulf shrimp, fish has been largely ignored by foodies obsessing over the provenance of their meals, even though seafood travels a complex path. Until recently, diners weren’t asking many questions about where it came from, which meant restaurants and retailers didn’t feel a need to provide the information. Much of what’s sold has been seen as “just a packaged, nondescript fish fillet with no skin,” says Beth Lowell, who works in the   prevention department at Oceana, an international ocean conservation advocacy group. “Seafood has been behind the curve on both traceability and transparency. ” What’s worse is that many people have no idea what they’re eating even when they think they do. In a recent Oceana investigation of seafood fraud, the organization bought fish sold at restaurants, seafood markets, sushi places and grocery stores, and ran DNA tests. It discovered that 33 percent of the fish was mislabeled per federal guidelines. Fish labeled snapper and tuna were the least likely to be what their purveyors claimed they were. Several years ago, Red’s Best developed software to track the fish it procures from small local fishermen along the shores of New England. Sea to Table, a family business founded in the   with headquarters in Brooklyn that supplies chefs and universities, has also developed its own   software to let customers follow the path of their purchases. Wood’s Fisheries, in Port St. Joe, Fla. specializes in sustainably harvested shrimp and uses software called Trace Register. And starting this fall, the public will be able to glimpse the international fishing industry’s practices through a partnership of Oceana, Google and SkyTruth, a nonprofit group that uses aerial and satellite images to study changes in the landscape. The initiative, called Global Fishing Watch, uses satellite data to analyze fishing boat practices  —   including larger trends and information on individual vessels. From a young age, Mr. Auerbach had romantic notions about fishing, specifically the idea of catching fish to feed his family and neighbors. “It’s cool in this day and age that people wake up in the morning and go make a living interacting with nature and feeding their community,” he said. He went into commercial fishing straight out of college, taking a job on an Alaskan salmon boat and later returning to New England to work on lobster boats and learn more about the fishing industry there. Soon after Mr. Auerbach founded Red’s Best in 2008, he realized that a combination of government regulations and commercial fishing’s embrace of technology were effectively threatening the existence of small fishing boats. Yet smaller boats travel short distances and catch fewer fish, which Mr. Auerbach said improves their quality. “We try to push people to eat local, traceable fish,” he said. Like most other seafood distributors, he was relying on an antiquated,   carbon copy system that was so cumbersome, he was routinely shuffling paperwork until 2 a. m. “The boat would get a copy at the point of unloading,” Mr. Auerbach said. “The government would get a copy. I’d file a copy. And then I’d write in the prices. ” As for paying the fishermen: “I’d have to get checks and then match the checks to the paperwork and mail them. It was an absolute nightmare that wasn’t scalable. ” Now the Red’s Best software does that work. For instance, a company driver backs a truck down to the long wooden pier in Woods Hole, Mass. each afternoon, so that fishermen can load their bluefish, striped bass, bonito, conch, horseshoe crabs and other seafood. But instead of a thick pad of paper and carbon sheets, the driver wields a waterproof wireless computer tablet with a Bluetooth mobile printer. “He’s putting their catch data directly onto the internet, and our whole staff all over the country can see in real time as fish is being unloaded onto our truck,” Mr. Auerbach said. When the fish arrives at Red’s Best’s Boston plant, it is instantly received into inventory and reported to the federal government. The company affixes a traceability label on each box of fish. The label has a   bar code that can be scanned by smartphones to reveal who caught the fish, where and how. A unique web page is automatically created for that fish. Buyers, typically   wholesalers throughout the country, and their customers can scan the code to learn the story behind the fish. Mr. Auerbach, who has 100 employees, projects the company will sell 20 million pounds of seafood this year, caught almost exclusively by 1, 000 small vessels. Eventually, Red’s Best hopes to sell directly to consumers. “Like, a bluefin tuna is being unloaded right this second in Provincetown, Mass. and you buy a pound of it to be delivered to your home tomorrow,” he said. “I want that tuna sold as deep into the supply chain as possible. ” By that he means ideally the fish will travel from the company’s Boston hub directly to home cooks’ refrigerators. Currently, people can buy Red’s Best fish at its store at the Boston Public Market, at several farmers’ markets, or shipped through AmazonFresh and, starting last week, FedEx. “I got the data,” he said. “I got the fish. I know people want it. ” Sea to Table hopes to sell fish directly to home chefs starting this year, too. But local seafood can cost more than many Americans are accustomed to paying, which partly accounts for the rampant seafood fraud in this country. “U. S. fisheries are very well managed and are actually growing nicely,” said Michael Dimin, the founder of Sea to Table. “But the U. S. consumer’s been trained to buy cheap food, and imported seafood is really cheap because of I. U. U. fishing. ” I. U. U. stands for illegal, unreported and unregulated. The result is unsustainably fished, cheap seafood flooding American fish markets and grocery chains. “To us, the secret is traceability,” Mr. Dimin said. “If you can shine a light on where it came from, you can make informed decisions. ” Mr. Auerbach concedes that some local fish is expensive, but he maintains that many   varieties are affordable. “Maybe halibut and scallops are for the wealthy,” he says. “But dogfish, skate, porgy and mackerel are all very inexpensive, healthy and great tasting. ”'"}, "time": 1742628324.5012045}