{"duration": 0.08736801147460938, "input_args": {"text": "\"Your Horoscopes — Week Of November 1, 2016 HOROSCOPE November 1, 2016 Vol 52 Issue 43 Aries | March 21 to April 19 Unexpected and startling events in the coming days will compel you to become more familiar with your monthly menstrual cycle. Taurus | April 20 to May 20 Please stop insisting you have nothing left to live for. The phrase you’re looking for is “never had a reason to live.” Gemini | May 21 to June 20 Your firstborn child will have your eyes, thanks to delivery complications and the organ-donor sticker on your driver’s license. Cancer | June 21 to July 22 Attempts to run away from the problem will fail this week when the problem turns out to be a short-circuited treadmill. Leo | July 23 to Aug. 22 Your future as a songwriter ends almost before it begins when you find that someone has already compared the depth, power, and beauty of their love to an ocean. Virgo | Aug. 23 to Sept. 22 The universe has a funny way of balancing things out. Prepare to lose your other eye by the end of the month. Libra | Sept. 23 to Oct. 22 All of those hurtful mother-in-law jokes will come back to haunt you this Friday when you suddenly run out of hurtful mother-in-law jokes to tell. Scorpio | Oct. 23 to Nov. 21 People say you’re a control freak, but if you had your way, they’d say it a little slower and maybe even a touch louder. Sagittarius | Nov. 22 to Dec. 21 There is a time and place for everything, except for your loud and incompetent scat singing. Capricorn | Dec. 22 to Jan. 19 For centuries fire was a sacred symbol of vitality and strength. Keep this in mind as you roll around frantically on your kitchen floor this Thursday. Aquarius | Jan. 20 to Feb. 18 Look to nature for encouragement and inspiration this week. Do this for as many ungodly hours as it damn well takes. Pisces | Feb. 19 to March 20 You’ll be honored as a true war hero, proving once and for all how dire the situation in Iraq has become. Share This Story: WATCH VIDEO FROM THE ONION Sign up For The Onion's Newsletter \\nGive your spam filter something to do. Daily Headlines \""}, "time": 1742562763.1441922}