{"duration": 0.08559894561767578, "input_args": {"text": "'#DraftOurDaughters: Feminist Hillary Supporters Vow To Fight War With Russia For Us \\nEric Striker October 28, 2016 Liberated af \\nWomen have come a long way since the sexual revolution. Through subsidization and affirmative action that makes up centuries of mean-spirited discrimination, they’ve shown their grit in a number of fields the Old Boys Club never thought possible. They’ve blown past the fitness tests which lives hinge on as firefighters , they demonstrate amazing coolness and discipline as police officers , and have become billionaires revolutionizing blood work as we know it. \\nAnything you can do, women can do better! I don’t know why men even exist anymore! \\nA majority of women are, according to most polls, hopeful that they will be able to push new frontiers by electing the first female president of the United States. And while the Patriarchy has in the past asserted that a world run by women would essentially mean world peace, sexist bigots will be proven wrong if Hillary takes office and makes good on her promise to start a nuclear war with Russia over Syria for no coherent reason. Gen X and single women, who are too confident and smart for any man to want to marry, are the biggest Hil fanatics. \\nRawwrrr, come turn off this Pussy Riot, Putin! \\nYet, even with all this progress, there’s still one last He-Man Woman-Hater’s club that looks down on women from their glass ceiling, hogging up all the glory for themselves. Did I say glass ceiling? I meant grass floor: Mmmm , Man Tears \\nThe only place in modern American culture where you will see a white male portrayed with dignity, honor and pride is in military recruitment ads. In these ads, the black man is shown at best as a white man’s equal, rather than as a smarter, better-looking, more masculine superior, in contrast to many movies, TV shows and most commercials. In the last Iraq War, white privilege and racism meant that in our very diverse country, non-Jewish white males were overrepresented among fatalities, and are heavily over represented in frontline and infantry roles. \\nWhile Neo-conservative (((Jennifer Rubin))) and others of her (((ilk))) dedicate their columns to mocking, attacking and threatening white males based on nothing but who you are, the mange-inflicted yentl buckles at the knees when you put on that uniform and die in one of the many wars she pushes for. \\nGet it through your thick skull you racist, privileged, baby-dicked white boy goyim: the only thing you’re good for is to fight for Israel! \\nIn light of this institutional patriarchy and privilege, #DraftOurDaughters has emerged to raise consciousness. This social media campaign is composed of Hillary Clinton’s coalition of non-whites and women – shut out of military combat roles by worthless racist rednecks – eager to make her dream of a World War with an emerging and more advanced superpower come true. \\nWe need women, blacks, Mexicans, and especially Jews (.02% of the US military while 2% of the US population) to come on in. Women especially, who have been shut out of Selective Service for the draft, should be given priority over men when the draft comes in order to mitigate decades of discrimination. \\nHere are some of the memes already floating around. #DraftOurDaughters is grassroots progress Martin Luther King Jr. (Peace Be Upon Him) would be proud of. I encourage you to make your own and put them up on Twitter, we’ll show that rude bigot Vladimir Putin what the New America can do:'"}, "time": 1742564601.1862075}