{"duration": 0.3255016803741455, "input_args": {"text": "'Russia , The Episodes by Julien PAOLANTONI (France) \\nWhat follows is the continuation of series of essays “Brief History of Russia”, produced by the French political and financial analyst Julien Paolantoni. The first set was published by ORIENTAL REVIEW in January 2015 and covered the period from the IXth to the middle of XVIth century. Introduction \\nPart 1 of this series was aimed at explaining the foundation of the Russian state, by discussing its early influences in the cultural and political fields. As the subject of the present part is to provide insight on how Russia reached the status of superpower, it is necessary to briefly get back to the reign of Ivan III . \\nAlthough the reign of the tsars started officially with Ivan IV , Ivan III (“Ivan the Great”) played a critical role in the centralization of the Russian state, after having defeated the Mongol army in 1480. \\nMeanwhile, the extension of the Russian land was eased by the death of Casimir IV , the king of Poland, in 1492 and the fact that Casimir’s son, Alexander, was willing to cooperate with the Russians, so he wedded Ivan’s daughter Helena soon after accessing the throne of Lithuania, as an attempt to avoid open conflict with his powerful neighbor. Unfortunately for him, Ivan III’s clear determination to appropriate as much of Lithuania as possible, finally obliged Alexander to wage war against his father-in-law in 1499. It was a complete disaster for Lithuania and in 1503 Alexander eventually purchased peace by ceding to Ivan III Novgorod-Seversky, Chernigov and seventeen other cities. \\nWith the unification of the state’s heartland almost complete, the country was ready to assert itself on the international stage. One figure sums up Russia’s fast expansion: from 1550 to 1700, Russia’s territory grew by 35000 km2 a year (which is approximately the size of Netherlands today). [1] \\nTherefore, Russia became a superpower way before the early 19 th century, more precisely before the Concert of Europe set up by the Congress of Vienna (1815) … The Reinforcement of Tsardom \\nConventionally, the Tsardom of Russia is considered by historians as the period running from Ivan IV’s claim to be the “Ruler of all Rus’ ” in 1547 to the foundation of the Russian Empire by Peter the Great in 1721. \\nIvan IV’s coronation ceremony was modeled after those of the Bizantine emperors, and six years later Moscow became known as the Third Rome due to the takeover of Constantinople by the Ottoman Empire, leaving Moscow as the only legitimate center of the Orthodox Church. During the late 1550’s, he subordinated the Russian nobility to an unprecedented degree (a simple provocation was generally enough to get forced into exil or even executed). [2] \\nOR note : the alleged “cruelty” of the reign of Ivan IV was notably exaggerated in Western historiography, basing on two very biased and controversial “sources”– prominent writing by the exiled British diplomat Jerome Horsey “ Observations in seventeen years’ travels and experience in Russia” and “ A Brief Account of the Character and Brutal Rule of Vasil’evich, Tyrant of Muscovy” , written by a vague Pomeranian mercenary Albert Schlichting. The only Russian language source of Ivan IV’s “tyrany” is a dubious chronicle composed in Novgorod the Great when the city was under Swedish rule in 1611-1617. Meanwhile the number of victims of his 37 years long reign were far l ess then of the single St.Bartholonew’s day massacre in France, when up to 30 thousand of Huguenots were assassinated during the night on Aug 24, 1572, but no one in the West dares to call Charles IX of France The Butcher… At the same time the standard title of Ivan IV in English (The Terrible) is fantastically misleading. The Russian title Грозный has absolutely different connotation in the Russian language. Translating it correctly, it should sound as The Awesome. The Terrible in Russian is “Ужасный” and no Tsar could obtain such title even theoretically. \\nNevertheless, Ivan IV is regarded as a key Russian statesman because in 1550 he promulgated a new code of laws (the Sudebnik ), introduced the self-management of rural regions, established the Zemsky Sobor , which was the first representative body on a large scale in Russian history (it happened on a local scale in Novgorod though, as mentioned in the first part of this series) and was also able to decrease the influence of the clergy on politics. [3] Ivan IV managed to annex the Khanates of Kazan in 1552, and those of Siberia and Astrakhan later but his long Livonian War for the control of the Baltic coast and access to sea trade turned out to be a costly failure. [4] Indeed, in 1558 he engaged his country in a twenty-five year war against Sweden, Denmark and the Polish Lithuanian Commonwealth, which resulted in the failure to secure a critical position in the Baltic Sea. In the meantime, Devlet I of Crimea hoped to take advantage of the difficulties of the Russian army on the Baltic front to repeatedly sack the Moscow area. This northern threat was combined with insecurity on the southern border, where the Nogai Horde pillaged the land and enslaved local inhabitants. [5] Nevertheless, these conquests enabled Ivan IV to gain access to Central Asia and to control the entire Volga River. It also brought a significant Muslim Tatar population into Russia, which officially emerged as a multiethnic and multiconfessional state, even if Russia has ever been a cosmopolite country since its foundation. \\nHowever, Ivan IV’s hostility toward the nobility weakened his country in the short term ( according to other assessments, taking power over the greedy oligarchy by Ivan IV was the first effective act of reinforcement of the central authority in Russia, an endeavour, repeated later by Peter the Great, Stalin and Putin – OR ). In 1565, the Tsar divided Russia into two parts: the oprichnina (his private realm) made up of some of the largest and richest districts and the zemshchina (the public domain). By doing so, Ivan IV got rid of a large number of people who helped in the expansion of Russia. This process reached its climax during the “Massacre of Novgorod”, in 1570, while trade significantly decreased. The weakening of the aristocracy combined with low harvests (a lot of peasants left Russia to escape from excessively high taxes, others were killed as part of the repression), military losses and epidemics enabled the Crimean Tatars to burn down Moscow and raid central Russia in 1571. [6] Besides, the joint coalition made up of Sweden, Denmark and the Polish-Lithuanian Commonwealth was successful in halting Russia’s expansion for the first time of its history. \\nIvan IV’s domestic policy and foreign policy ultimately led Russia to one of the darkest ages of its history, a time of civil war and social struggle known under the name of the “ Time of Troubles ”. Time of Troubles, 1598 – 1613 \\nThis unstable period runs from the death of Feodor Ivanovich, the last tsar of the Rurik Dynasty to the establishment of the Romanov Dynasty , which would lead the country until the Revolution of 1917. \\nBetween 1601 and 1601, extremely cold summers destroyed crop fields which led to famine and social unrest. They were allegedly caused by the eruption of a volcano in Peru in 1600, massively pouring out sulfur dioxide into the atmosphere, which is supposed to have resulted in the formation of sulfur acid preventing the sunlight to reach properly the Earth’s surface. \\nThe Polish-Lithuanian army added further turmoil in the country by carrying out several invasions during the Polish-Muscovite war (1605-1618). In 1605, they also installed an impostor on the throne of Russia: False Dmitry I , who claimed to be the legitimate son of Ivan IV. The turning point occurred at the Battle of Klushino in 1610, when the Russian-Swedish army was defeated, which enabled a group of Russian aristocrats, the Seven Boyars, to depose the tsar Vasily Shuysky , who gained power by killing False Dmitry I. The Polish prince Władysław IV Vasa became tsar and violently repressed the opposing Muscovite crowd, while another impostor, False Dmitry II , also claimed to be the rightful heir of Ivan IV but failed in his attempt to seize power. An important fact is that all the fake tsars had support from the Catholic Church, because the Polish-Lithuanian leaders wanted to convert the Russian people. Here is certainly the origin of the anti-catholic (and sometimes anti-Polish) feeling in Russia. [7] ( Not exactly – the Rome’s endeavours to bring Constantinople’s Church domains under Latin amice were permanent since the Great Schism in 1054 – OR ). Kuzma Minin and Dmitry Pozharsky \\nFinally, an army led by Kuzma Minin (a merchant) and Dmitry Pozharsky (a prince from the Suzdal area) managed to crush the foreign forces and to expel them from Moscow on the 4 th of November, 1612. Pozharsky ran the provisional government of Moscow with the help of his assistant, Dmitry Trubetskoy, until a new tsar was elected by the Zemsky Sobor . [8] \\nThe death toll during the Time of Troubles was heavy: according to Sergey Solovyov, tens of thousands died in riots and battles. [9] This dark period was influential in the emergence of Russian nationalism, and the 4 th of November is now celebrated every year as a Unity Day (the tradition was established in 1613 by the new elected tsar, Mikhail Romanov and brought back by Vladimir Putin in 2005, because the bolshevik revolutionaries had replaced it by a day celebrating the revolution of 1917). \\nThe unification of the Russian society around the Romanov dynasty set the framework for the powerful Russian Empire to come. The Establishment of the Romanov Dynasty \\nThe first task of Mikhail Romanov was to restore peace. It was eased by the weakening of his two main enemies, Sweden and the Polish-Lithuanian Commonwealth due to a conflict between the two entities, which provided Russia with the opportunity to make peace with the former in 1617 and with the latter in 1619, at the price of limited territory losses. Those territories were recovered by the Treaty of Pereyaslav , signed with the Zaporozhsky Cossacks in 1654, which basically entailed the russification of Dnipro stepes known as Ukraine today, as a reward for the military support offered by the tsar Alexey I during the Khmelnytsky rebellion, in an area formerly under Polish control. [10] \\nThis treaty immediately sparked the Russo-Polish War, which had far reaching consequences. Indeed, it ended with the Treaty of Andrusovo (1667), whose major feature is the losses of Kiev and Smolensk for Poland, which fell under Russian control. [11] An alliance between the political elite and the nobility then resulted in a dramatic deterioration of peasants’ conditions in all of Russian-controlled territories, as they were charged taxes 100 times higher than a century ago. [12] Obviously, popular rebellions frequently took place, such as the Salt Riot (1648), the Copper Riot (1662) and the Moscow Uprising (1682). \\nIn 1672, Peter I, who would become known as Peter the Great, founder of the Russian Empire was born in this unstable period. In 1682, Feodor III and Peter became tsar with his mother as regent, because he was only 10-year old. He had to wait until the death of his mother in 1694 to actually exercise power (his half-sister, Sophia, managed to seize power in 1682 and ruled the nation until Peter’s mother deposed her seven years later). At this time, Russia was already the largest state in the world (three times the size of continental Europe), which would imply several challenges for the latter statesman. Foundation of the Russian Empire \\nPeter I initiated the tradition of the “reforming tsar”. From his reign on, all tsars were judged on their ability to modernize the economy and Russian society as a whole, and also on their ability to gain influence abroad. The protection of the homeland was not ambitious enough anymore. [13] Following this new doctrine, Peter I’s initial military campaigns were directed against the Ottoman Empire, because he wanted to gain a foothold on the Black Sea, by taking the town of Azov. [14] \\nBut his attention quickly turned to the north, as Russia was denied access to the Baltic Sea by Sweden. In 1699, it led Peter I to sign a secret alliance with Russia’s main foe during the 16 th and 17 th centuries, that is to say the Polish–Lithuanian Commonwealth, to wage war against Sweden, also with the help of Denmark. The Great Northern War ended in 1721, when Sweden had to cede provinces situated east and south of the Gulf of Finland, thereby securing Peter I’s coveted access to the sea. In 1703, it was in this area that he founded St Petersburg, designed as a “window opened upon Europe” which was to replace Moscow as the nation’s capital from until 1918. Therefore, the conquest of the northern front was a well-prepared plan and Peter decided to assume the title of emperor as a celebration of these conquests, thus replacing the Tsardom with the Russian Empire in 1721. \\nUnder his reign, Russia became an absolutist state molded on the European standards of that time. Indeed, Peter the Great replaced the Boyar Duma (which was a council of nobles, not to be confused with the modern State Duma, which is the lower house of the Russian parliament; the upper house being the Federal Council of Russia) with a nine-member supreme council of state, called the Governing Senate. Its mandate was to oversee administrative, judicial and financial affairs, and its main achievement has been to collect taxes more effectively: tax revenues tripled over the course of Peter the Great’s reign. [15] \\nHowever, in 1722 he displayed his Table of Ranks, whose aim was to determine position and status of everybody in the tree branches of the administration (the military, civil and court services) according to skills rather than according to birth or seniority. He also required state service from all the nobles. Thus, it created an educated class of noble bureaucrats who had to demonstrate their ability to carry out administrative tasks. In this regard, Russia was more developed than other absolute European monarchies, such as France. [16] Peter the Great also undertook a government reform, which officially incorporated the Orthodox Church into the administrative structure but in fact it became a tool of the emperor, as he replaced the patriarchate with the Holy Sinod (a collective entity) led by a government official. [17] \\nIn 1725, Peter the Great died, leaving an unsettled succession as he failed to choose the next tsar before dying (he passed a law which abrogated traditional rules of succession, based on the law of primogeniture). Obviously, the following decade was marked by various plots and coups. As a result, the critical factor to take the throne over became the support of the palace guards. The Era of Russian Palace Revolutions \\nPeter the Great’s wife, Catherine I , was the first woman to ascend the throne of Russia, paving the way for a century almost completely dominated by women, including her daughter Elizabeth and Catherine the Great. Both continued Peter the Great’s policies in modernizing Russia, but Catherine I’s humble origins was considered as a state secret by later generations of tsars. [18] \\nAt the time of Peter’s death, the Russian army was without contest the largest in Europe. The military budget amounted to 65 % of the government yearly income but Catherine I decided to slash military expenditures because the nation was at peace. She was assisted by a Supreme Privy Council, led by Alexander Menshikov , a close friend of Peter the Great who took an active part in the Azov campaign against the Ottoman empire (1695 – 1696) but was accused of corruption (he looted Poland and defrauded the Russian government of around 100 000 rubles, a significant amount of money at that time). Another prominent member of the Council was Peter Tolstoy, an ancestor of the famous novelist, who helped Menshikov in his attempt to raise Catherine I to the throne. Andrei Osterman , was in charge of foreign affairs and was also minister of commerce, while another member of the Council, Dmitry Golitsyn advocated for a constitutional monarchy and would become much more influential later, under the reign of Peter II. Then, Catherine I’s son-in-law, Karl Friedrich, was allowed to enter the Council. [19] Catherine I \\nCatherine I ordered the construction of the first bridges of St Petersburg, but because of her poor health Menshikov was the real leader of the country and he ultimately took over most of the functions of the Governing Senate. \\nWhen she died in 1727, Peter the Great’s grandson, Peter II , was crowned tsar. But he was only 11 year old at that time so he was manipulated by Menshikov until he became severely ill and replaced as Peter II’s senior advisor by Andrei Osterman and Vasily Dolgorukov (the latter joined the Council under the reign of Peter II). Peter II died before he could marry Dolgorukov’s daughter Catherine and he didn’t name a legitimate successor, thereby throwing Russia into another succession struggle. [20] \\nIn 1730, Dmitry Golitsyn came up with the idea of turning Russia into a constitutional monarchy, in which the tsar’s executive power would be limited by the Council, and his constitutional project was known as “The Conditions” was signed by the new elected tsar, Anna Ioannovna . In fact, it was called “The Conditions” because she had to accept them prior to ascend the throne. The new dispositions provided that declaration of wars, international treaties, new taxes and using of public revenues were to be approved by the Council. However, Anna Ioannovna revoked her approval of the Conditions only two days after having signed, and dismantled the Council in the meantime, with a significant support from the nobles who were not close enough to a member of the Council to defend their interests. \\nTo strengthen her power she restored the security police and was assisted by Ernst Johann von Biron , who forced around 30 000 people into exile in Siberia, mainly Old Believers (traditional orthodox believers who didn’t approve the reform of the Orthodox Church). They also repealed Peter I’s legislation about the nobility’s state service requirements and the primogeniture law. Therefore, estates could be subdivided again and nobles were not compelled to complete the state service anymore. Besides, they further deteriorated the conditions of the serfs, who now the landlords’ permission before moving to find work elsewhere. \\nFrom 1733 to 1736, Russia allied with Austria and took part in the War of Polish Succession against France and Spain, to prevent the election of a French candidate to the polish throne. Later, Russia and Austria waged war against the Ottoman Empire in order to gain territory in the Azov area, but the death toll was high, mainly due to diseases. This was a major war regarding Russian history because it marked the beginning of the state’s military effort to expand southward, an enterprise that would reveal successful under the reign of Catherine II. Anna Ioannovna named Ivan VI , son of Anna Leopoldovna and the Duke of Brunswick, as her successor and Biron as his regent. \\nHowever, Peter the Great’s daughter Elizabeth seized the throne in 1741, assisted by the Preobrazhensky Regiment, an elite regiment of the Russian army formed by her father in the late 17th century, which distinguished itself during the Great Northern War. \\nShe reigned for twenty years and was much more effective than her immediate predecessors (the regency of Biron was marked by high taxes and other economic issues, not to mention the fact that his German origins gave Russians the feeling of losing their independence). Her reign was marked by major cultural and scientific events, such as the foundation of Moscow University (1755) and the Imperial Academy of Arts (1757), along with the emergence of Russia’s first leading scholar, Mikhail Lomonosov . She also ordered the construction of the Smolny Cathedral and the modernization of the Winter Palace in Saint Petersburg (at a cost of 2,500,000 rubles just for the Winter Palace) \\nHer administration partly followed Peter I’s legacy, as they restored the Governing Senate’s powers and abolished capital punishment but also followed Elizabeth predecessors’ efforts to increase the nobility’s control over the serfs, who now needed their landlord’s approval to marry. Under a new law, nobles were also allowed to exile their serfs to Siberia. \\nRegarding foreign policy, Sweden ceded the southern part of Finland located east of the river Kymmene, which became the boundary between the two states Russia ( Treaty of Abo , 1743). This success has been credited to the diplomatic skills of Alexey Bestuzhev-Ryumin , the new vice chancellor, who represented the anti-Franco-Prussian wing of her council. His aim was to bring about an alliance with England and Austria. That’s certainly why Louis XV and Frederick II of Prussia made several attempts to get rid of him, without success. Then, Russia took part in the War of Austrian Succession (1740-1748) and the Seven Years’ War from 1755 to 1762, the first one under an alliance with Austria and Great Britain against Prussia and France and the second one under an alliance with Austria and France against Prussia and Great Britain. Bestuzhev was the main Russian diplomat at the Congress of Aix-la-Chapelle (1748) which put an end the War of Austrian Succession. He managed to take Russia out of the Swedish imbroglio, enabled Russia to assert herself in Sweden, Turkey and Poland while isolating Frederick II and improving diplomatic relations between Elizabeth and the courts of London and Vienna. Alexey Bestuzhev-Ryumin \\nIn 1758, he got fired, without reason according to the future Catherine II : “He was relieved of all his decorations and rank, without a soul being able to reveal for what crimes or transgressions the first gentleman of the Empire was so despoiled, and sent back to his house as a prisoner.” [21] Nevertheless, the identity of his foes was well known: the French and Austrian ambassadors, but also Vice-Chancellor Mikhail Vorontsov (who also took part in the previous plot against Bestuzhev, known as the Lopukhina Conspiracy, which was designed by Jean de Lestocq, who was earlier part of the coup d’état which brought Elizabeth to the throne). \\nThe Seven Year’s War was rather successful for Russia but ended suddenly as a result of mounting financial difficulties and the empress’ death in 1762. Her successor, Peter III , grandson of Peter the Great, took Russia out of the war. \\nStill, his reign was short and unpopular, especially within the clergy which was expropriated, while the serfs working on its lands were freed. Peter III also proclaimed religious freedom, which has been seen as a challenge to the authority of the Orthodox Church. Besides, he made huge territorial concessions to Prussia and even signed an alliance with Frederick II. Russian troops were soon deployed against Austria. This dramatic diplomatic shift led to a new balance of powers in Europe. \\nFurthermore, Peter III’s national policy didn’t match at all the interests of the elite: he abolished the secret police set up by his grandfather, fought corruption within the administration and introduced public interest litigation (i.e. the possibility of conducting a lawsuit to defend the public interest). He also established the first state bank in Russia, thus rejecting the nobility’s monopoly on money creation and trade. Regarding economic policy, he supported mercantilism by forbidding the import of sugar and other products that could be found in Russia. Thereby, he carried out to some extent a westernization of Russian society. But Peter III’s wife, Catherine, took advantage of his unpopularity to set up a coup d’état against him with the help of her lover’s brother, Alexey Orlov, who murdered him in 1762. \\nThe new empress took the name of Catherine II and Peter’s assassination marked the end of the era of palace revolutions. The Reign of Catherine II \\nThe Russian Enlightenment began under the reign of Elizabeth, who the establishment of the Moscow University and the Imperial Academy of Arts. However, the movement received a significant boost under the reign of Catherine the Great . She considered herself as an enlightened despot, claiming to be especially influenced by the ideas of Montesquieu and Voltaire. She even had an extended correspondence with the latter. In this perspective, she continued the westernization of Russian society undertook by Peter III, and supported burgeoning manufactures. [22] Catherine the Great \\nCatherine II’s political reforms went beyond improving Russia’s bureaucracy developed under Peter the Great, contrary to what has been said by her opponents, who claimed that her adherence to the Enlightenment was just a pretext to expand her power. \\nIndeed, she established state-run primary schools, which provided basic education, exalted patriotism and innovation but most importantly, in 1767 she wrote a statement of legal principles called Nakaz (which means Instruction), clearly influenced by the ideas of the French Enlightenment, in order to replace the Sobornoye Ulozheniye , which was the legal code established in 1649 by the Zemsky Sobor under the reign of Alexey I. It proclaimed the equality of all men before the law, disapproved torture and death penalty, thus anticipating some of the issues raised by the later United States Constitution. By the way, a less known predecessor of the American Constitution has been the Corsican Constitution drafted by Pasquale Paoli in 1755, mainly inspired by the ideas of Rousseau. [23] \\nSome of Catherine II’s advisors suggested creating a council to regulate legislation but this proposal was firmly rejected, and when she feared that she was beginning to lose some authority she reverted to the ways of the past: autocratic rule. Officially, she ruled with the Senate but it possessed no legislative powers. She also bolstered the grip of the nobility over the nation’s affairs. Indeed, nobles no longer had to serve the central government, as the law had required since Peter the Great’s time, and many of them received major roles in provincial governments. \\nCatherine had a paradoxical thought: on the one hand she proved to have been deeply inspired by contemporary French philosophers but on the other hand she consolidated autocratism. A famous illustration of this is the treatment received by Alexander Radishchev, a social critic who was exiled to Siberia due to his pamphlet against the regime, entitled Journey from St. Petersburg to Moscow (1790). [24]. In 1773, she also crushed a major peasant uprising led by a Cossack named Pugachev, who managed to take the city of Kazan before being defeated. Operational map of the Russo-Turkish war in 1768-1774 \\nRegarding foreign policy, Catherine II successfully waged war against a weaker Ottoman Empire and advanced Russia’s southern boundary to the Black Sea. In 1774, the Treaty of Kuchuk-Kainarji gave the regions of Yinsdale, Kerch and parts of the Yesidan region to Russia, which also assumed military protectorship of the Crimean Khanate and became the formal protector of Orthodox Christians in the Ottoman Empire. In 1783, Catherine took control the Crimea, helping to spark another War with the Ottoman Empire four years later. In 1792, Russia expanded southward to the Dniestr river through the Treaty of Jassy , thereby annexing most of the Yesidan region. This treaty almost achieved the empress’ “Greek Project” which consisted in renewing a Byzantine Empire under Russian control, after having thrown the Ottomans out of south-eastern Europe. \\nRussia also expanded westward thanks to the increasing weakness of Poland. Indeed, Catherine signed an alliance with Prussia and Austria to share the Polish–Lithuanian Commonwealth. Although the partitioning of Poland greatly added to Russia’s territory and prestige, it also meant a common border with both Austria and Prussia, which were two potential competitors for hegemony over Eastern and Central Europe. Moreover, the empire became more difficult to control because of a more ethnically heterogeneous population. For instance, Catholic Poles staged several uprisings against the Russian occupation, while Jews were deported to the western part of the empire, thus paving the way for anti-Jewish policies later. In 1791, the same three powers abrogated the Polish Constitution of 1791 under the pretext of fearing the emergence of radicalism, an excuse also used to acquire further territories from Poland (Russia was now in control of most of Ukraine and Belarus). This new partition led to the Kościuszko Uprising in Poland, which ended with the third partition of the country in 1795. \\nBy the time of her death in 1796, Catherine’s expansionist policy had definitely turned Russia into a major European power. This new role drove the Russian empire into a series of wars against the other major European force, the Napoleonic empire, which also claimed hegemony over Europe, and this had far-reaching consequences for Russia and the rest of Europe. Russia under Alexander I \\nIn 1812, Napoleon made a huge mistake when he declared war on Russia after an argument with the new emperor, Alexander I , who ascended the throne after the murder of his father in 1801. Unprepared for winter warfare, thousands of French troops were killed by the Russian regular army, which also received a significant help from peasants, despite all the pro-nobility policies implemented ever since the reign of Anna Ioannovna (traditional French assertions that Napoleon was defeated by the General Frost in Russia look naive but… face-saving – OR) \\nAfter having defeated Napoleon on the eastern front, Alexander became known as the “savior of Europe” and this status enabled him to join the Congress of Vienna (1815), which was to redraw the map of Europe, on a comfortable diplomatic position. Russia was given most of the Duchy of Warsaw, called “Congress Poland”, and was also allowed to keep Finland, which it had annexed from Sweden six years ago. France and Great Britain refused the original plan advocated by Alexander I and approved by von Hardenberg, who represented Prussia, under which Prussia would trade her polish territories for Saxony. The French and British diplomats refused the deal because Poland would not serve as a buffer state between the two East-European powers anymore. [25] \\nBut the most important consequence of the Congress of Vienna is not even the reshaping of Europe: it opened the tradition of oligarchic diplomacy, as only five powers (Austria, Russia, Prussia, Great-Britain and France) met to discuss the future of world relations. In an important essay, Bertrand Badie showed that the international system didn’t evolve so much since 1815, the G8 and NATO having replaced the Concert in his role of Directory of the World. [26] \\nRegarding domestic policy, Alexander I’s main achievement has been to bring Russia close to a constitutional monarchy, with the help of his main advisor, Mikhail Speransky . Indeed, the State Council was created in order to improve technique of legislation with the intention of making it the Second Chamber of representative legislature and the Governing Senate was reorganized as the Supreme Court of the Empire. He also introduced political responsibility to the crown for his ministers. A constitution project was stopped in 1810, due to growing resistance from the conservative nobility, especially from Nikolai Karamzin (a famous historian) and also because the Napoleonic wars became the major issue facing the Empire. Conclusion \\nPart 2 of this series detailed how Russia progressively asserted herself on the international stage. Hopefully, it would have pointed out the complexity of Russian politics during the period studied. \\nThe country expanded dramatically, saw the implementation of various law codes quite advanced regarding the standards of the time, consolidated his nature of multicultural nation but also roughly repressed opponents to the imperial regime. \\nIn a nutshell, Imperial Russia relied on a combination of principles of the Enlightenment and conservative ideas, expressed by the charismatic statesmen of the Romanov Dynasty, who established the Russian identity on the global stage. The long hesitation between autocratism and a constitutional monarchy, as well as the continuous decrease of the influence of the clergy on politics in favor of the nobility are there to remind of the complex, paradoxical situation of Russian society. \\nPart 3 will be dedicated to the progressive downfall of the dynasty, until its abdication in 1917, opening a new era, the one of Soviet Russia. Russian Empire at the beginning of XIX century \\n\\nJulien Paolantoni is a Credit Risk Consultant for Natixis in Paris. He graduated from Sciences Po Bordeaux (MA International Affairs) and the University of Bordeaux (BA Public Law & Political Science, BSc Economics & Management). He can be reached at \\nENDNOTES: \\n[1] Richard Pipes, Russia under the Old Regime, Penguin Books, revised edition, 1997 \\n[2] Glenn E. Curtis (ed.), “Muscovy” in Russia: A Country Study, Library of Congress, 1996 \\n[3] Paul Bushkovitch, Religion and Society in Russia: The Sixteenth and Seventeenth Centuries, Oxford University Press, 1992 \\n[4] Janet Martin, Medieval Russia: 980-1584, Cambridge University Press, 2008 \\n[5] William Urban, “The Origin of the Livonian War”, Lithuanian Quarterly Journal of Arts and Sciences , vol. 29, 1983 \\n[6] R. G. Skrynnikov, Ivan the Terrible, Academic International Press, 1981 \\n[7] George Vernadsky, A History of Russia, Yale University Press, 1961 \\n[8] Chester S. L. Dunning, Russia’s first civil war: The Time of Troubles and the founding of the Romanov dynasty, Pennsylvania State University Press, 2001 \\n[9] Sergey Solovyov, History of Russia from the Earliest Times, Academic International Press, 1997 \\n[10] Chester S. L. Dunning, op. cit. \\n[11] Glenn E. Curtis (ed.), op. cit. \\n[12] Theda Skocpol, States and Social Revolutions: A Comparative Analysis of France, Russia and China, Cambridge University Press, 1979 \\n[13] Cynthia H. Whittaker, “The Reforming Tsar: The Redefinition of Autocratic Duty in Eighteenth Century Russia”, Slavic Review , vol. 51, 1992 \\n[14] Lord Kinross, The Ottoman Centuries: The Rise and Fall of the Turkish Empire, Harper Perennial, 1979 \\n[15] Paul Dukes, A History of Russia: Medieval, Modern, Contemporary, Duke University Press, 3rd edition, 1997 \\n[16] Nicholas V. Riasanovsky and Mark D. Steinberg, A History of Russia, Oxford University Press, 8th edition, 2010 \\n[17] Walter G. Moss, A History of Russia, Vol. 1: To 1917, Anthem Press, 2003 \\n[18] Catherine Evtuhov, David Goldfrank, Lindsey Hughes and Richard Stites, A History of Russia: Peoples, Legends, Events, Forces, Wadsworth Publishing, 2003 \\n[19] Alan Wood, The Romanov Empire: 1613-1917, Bloomsbury USA, 2007 \\n[20] Gregory L. Freeze, Russia: A History, Oxford University Press, 3rd edition, 2009 \\n[21] Robert K. Massie, Catherine the Great: Portrait of a Woman, Random House, 2011 [22] James H. Billington, The Icon and the Axe : An Interpretive History of Russian Culture, Vintage, 1970 [23] Dorothy Carrington, “The Corsican Constitution of Pasquale Paoli (1755–1769)”, The English Historical Review , 1973 [24] David M. Lang, The First Russian Radical: Alexander Radischev, 1749-1802, Greenwood-Heinemann Publishing, 1977 [25] Adam Zamoyski, Rites of Peace: The Fall of Napoleon and the Congress of Vienna, Harper Perennial, 2008 [26] Bertrand Badie, La diplomatie de connivence: les derives oligarchiques du système international, La découverte, 2011 RELATED POSTS'"}, "time": 1742628512.708391}