{"duration": 0.046224117279052734, "input_args": {"text": "'Posted on November 1, 2016 by Sean Adl-Tabatabai in News , UK // 0 Comments \\nThe director general of the MI5 intelligence agency in the UK has declared Russia a “threat to national security” in a grave warning on Monday. \\nSpeaking with the Guardian , Andrew Parker warned that Russia is currently using all of its cutting-edge tools in order to undermine Britain. \\nPresstv.com reports: \\n“It is using its whole range of state organs and powers to push its foreign policy abroad in increasingly aggressive ways – involving propaganda, espionage, subversion and cyber-attacks. Russia is at work across Europe and in the UK today. It is MI5’s job to get in the way of that,” he told the UK’s prominent paper. RELATED CONTENT Ukraine President Warns Of World War 3 With Russia \\nHe said that Russia has already some intelligence officers in the UK and has been threatening the UK covertly for decades, but “what’s different these days is that there are more and more methods available.” \\nMoscow is using cyberwarfare to target military secrets, industrial projects, economic information as well as the British government and foreign policy, he added. \\nHe went on to say that Moscow “defines itself by opposition to the west and seems to act accordingly.” \\nRelations between Russia and the west soured after people in Ukraine’s Black Sea peninsula of Crimea voted for rejoining the Russian Federation in a referendum in March 2014. \\nThe West branded the move as Moscow’s annexation of the territory, with the US and its allies in Europe accusing the country of having a hand in the conflict in eastern Ukraine. \\nRussia’s relationship with the US and the UK has also become unfriendly over the crisis in Syria, where Moscow has been conducting an air campaign at the request of the Syrian government to fight Daesh terrorists there since September 30, 2015. \\nUS-led coalition has also been conducting airstrikes in Syria to purportedly target terrorist groups like Daesh since 2014, but they openly fund and equip militant groups who are waging war against the government of Syrian President Bashar al-Assad. \\nOn October 20, British Prime Minister Theresa May called on European leaders to unite against Russia and stop what she referred to as Russian “atrocities” in Syria. \\n“It is vital that we work together to continue to put pressure on Russia to stop these appalling atrocities, these sickening atrocities, in Syria,” the premier said. \\nRussia’s military campaign has helped the Syrian government defeat the Takfiri terrorists in many regions across the country.'"}, "time": 1742561891.1954675}