{"duration": 0.10034489631652832, "input_args": {"text": "'‘They Don’t Speak For Me’— Evangelical PhD SLAMS Religious Right Leaders Supporting Trump By Stephanie Kuklish   \\nEvangelical Christians have been major players in the 2016 elections with their unrelenting support of Republican presidential nominee, Donald Trump, but Alan Noble, Ph.D., is putting his foot down and letting the Religious Right know what they are doing is wrong. \\nIn a current op-ed for Vox , Noble takes to history, the Bible, and the way of the conservative to point out that somewhere in the recent past, Evangelicals have lost their sense of priority in the character of a man. When discussing the release of tapes where Trump was caught admitting to sexually assaulting women Noble stated: “Evangelicalism has been sharply divided over Trump, and so my hope was that this tape would finally persuade the remaining evangelical defenders of Trump to abandon him. But for the most part, that’s not what happened.” \\nJust as we have seen numerous times in the media, while many Trump supporters were running in the other direction, there were still an enormous amount of influential conservatives battening down the hatches and riding through this storm, still defending the man. \\nMen like Jerry Falwell Jr., Ben Carson, Tony Perkins, Mike Huckabee, and more , have either stayed steady with their support or have come back to the “Trump Side,” shortly after jumping ship, all taking the stance that America should focus less on character and more on policy. Noble discusses the Christian Conservative view this election season by saying : “Jalsevac makes explicit the logic of so many leaders on the religious right: Character is fundamentally private and only tangentially related the public work of policymaking and politics. Sin is still bad, but since we are all sinners, and since we are not electing a “pastor in chief,” what matters most is what kind of president the candidates would be. The real is the political. Everything else is just style.” \\nHere is the kicker, though, the pushing off of character and focusing on policy way of thinking for the Christian Conservative was the complete opposite when former President Bill Clinton confessed to his indiscretions while in office. In fact, the Southern Baptist Convention passed a “ Resolution on the Moral Characters of Public Officials ,” after Clinton’s incident stating: “WHEREAS, Some journalists report that many Americans are willing to excuse or overlook immoral or illegal conduct by unrepentant public officials so long as economic prosperity prevails; and WHEREAS, Tolerance of serious wrong by leaders sears the conscience of the culture, spawns unrestrained immorality and lawlessness in the society, and surely results in God’s judgment (1 Kings 16:30; Isaiah 5:18-25); and … Therefore, be it RESOLVED, That we, the messengers to the Southern Baptist Convention, meeting June 9-11, 1998, in Salt Lake City, Utah, affirm that moral character matters to God and should matter to all citizens, especially God’s people when choosing public leaders; and … Be it finally RESOLVED, That we urge all Americans to embrace and act on the conviction that character does count in public office, and to elect those officials and candidates who, although imperfect, demonstrate consistent honesty, moral purity, and the highest character.” \\nUltimately what this is saying is that if someone is placed in office with a severe lack of personal conviction, it can ultimately harm everyone involved; an entirely different viewpoint than the rhetoric they are putting forth about support for Donald Trump. And don’t be mistaken, this position was held and represented as late as 2015 when Mike Huckabee responded during an interview to the millennial viewpoint of Bill Clinton’s indiscretions by saying : “Probably not, for two reasons. One, they were infants when it all happened. And the second reason is that growing up in a moral climate in which people just don’t seem to care that much about other people’s lives. They don’t make the connection between personal character and public character. They don’t seem to think that there is a correlation. I think there is. I think if a person will lie to an individual, they will lie to a country. I think if a person is not honest with themselves, they’ll be dishonest with the voters. And so I do think character matters, I believe it always had. It doesn’t mean we elect perfect people. We don’t, we never have, we never will, but I do think that it matters that a person represents himself or herself with a level of authenticity and that doesn’t always happen Hugh, and I do think it’s one of the pitfalls of our current political environment.” Via Vox \\nSo while public figures like James Dobson endorse Trump with the, “We are electing a commander-in-chief not a theologian-in-chief,” he was damning the idea of not holding Bill Clinton responsible for his moral character. In 1998, while President of Focus on the Family , Dobson wrote : “As it turns out, character DOES matter. You can’t run a family, let alone a country, without it. How foolish to believe that a person who lacks honesty and moral integrity is qualified to lead a nation and the world! Nevertheless, our people continue to say that the President is doing a good job even if they don’t respect him personally. Those two positions are fundamentally incompatible. In the Book of James the question is posed, “Can both fresh water and salt water flow from the same spring” (James 3:11 NIV). The answer is no.” \\nIt seems to me the winds of the religious, political race have changed drastically and not to fit the idea that the Bible represents, but to satisfy lead religious bodies in their political views. As we are condemned for our lack of character in our everyday lives, Trump’s character is swept to the side as nothing more than a luxury for a political candidate. \\nFeatured Image Via The Daily Beast About Stephanie Kuklish \\nI am a 30 something writer passionate about politics, the environment, human rights and pretty much everything that effects our everyday life. To stay on top of the topics I discuss, like and follow me at https://www.facebook.com/keeponwriting and https://facebook.com/progressivenomad . Connect'"}, "time": 1742561946.4880738}