{"duration": 0.09179997444152832, "input_args": {"text": "'Alfonse M. D’Amato, a former United States senator, has given many speeches in his day, trying to rouse his peers into action. Not all have worked. But of all those failed exhortations, none  —   at least, none known so far  —   have occurred on a JetBlue Airways flight, ending with Mr. D’Amato’s removal from the plane. Mr. D’Amato, 79, who represented New York as a Republican from 1981 to 1999, was removed from a JetBlue flight in Fort Lauderdale, Fla. after causing a conflict, according to the airline. The episode, captured in part on cellphone videos taken by passengers, was on a New   airplane at Fort   International Airport on Monday, days after a gunman killed five people there. The JetBlue flight, which had been scheduled to depart around 1:40 p. m. Monday, did not take off until about 8 p. m. after delays. During the delay, Mr. D’Amato stood in the aisle and urged other passengers to walk out with him, according to video of the episode. “We can still speak in this country,” Mr. D’Amato said in the video. “I am making an appeal to all you people. Stand up for what’s right and walk out with me. ” At least one unidentified passenger stood to join him. “I’m going,” he said. It is not exactly clear what prompted Mr. D’Amato’s response. The crew was trying to move passengers to address a weight imbalance, an airline spokesman said. A passenger, Jeffrey A. Wurst, said that the plane’s captain explained that about 10 people needed to move to the back of the plane from the front to balance how the cargo had been loaded. “I saw Al D’Amato go to the back, to one of the last rows,” Mr. Wurst said. “People spotted him and asked to take pictures. The captain then asked for more people to move. D’Amato gets up and starts” shouting, he said. Eventually, the police were called. An officer from the Broward County Sheriff’s Office can be seen walking toward Mr. D’Amato in the video. Mr. D’Amato seems to refer to the issue with the seats, speaking during an announcement that the plane would take off once everyone was seated. “I’m getting thrown out because I stood up and said to the captain, ‘Why don’t you do what you’re supposed to do? ’” Mr. D’Amato says in the video. “If you’re supposed to move two or three people, move them. And so he got annoyed at that, and I’m getting thrown out. ” As he walks by the open cockpit door, Mr. D’Amato can be seen telling the captain that he is a “poor excuse” for a leader. He turns to a flight attendant and appears to curse. JetBlue said that decisions to remove passengers from flights were not made lightly. “If a customer is causing a conflict on the aircraft, it is standard procedure to ask the customer to deplane, especially if the crew feels the situation runs a risk of escalation in flight,” the company said in a statement. Gary Lewi, a spokesman for Mr. D’Amato, said that the former senator was in Florida to visit an ailing friend. Mr. Lewi cited Mr. D’Amato’s frustration over the long delay and “sleep deprivation” as factors in the incident. “Anyone who knows Senator D’Amato knows he speaks his mind,” Mr. Lewi said in a statement. “JetBlue has apologized to the senator for overreacting, and the senator apologized for speaking his mind at a time when he clearly had left his patience at the gate. ” The sheriff’s office said it had referred the matter to JetBlue. The airline said no further action would be taken. The intensity of emotions raised by travel and the ubiquity of social media have combined to produce a perpetual stream of caustic episodes that spin into viral news after being captured on cellphone cameras. This year, tempers flared in the wake of an emotional presidential election. A video of a supporter of the   Donald J. Trump, taunting other passengers on a Delta Air Lines flight from Atlanta to Allentown, Pa. spread widely in November. The airline eventually barred the passenger for life. Weeks later, a man was kicked off a JetBlue flight about to depart from Kennedy International Airport after causing a disturbance upon learning Ivanka Trump and her husband, Jared Kushner, were on the flight. His husband posted about it on Twitter. Mr. Wurst said that what concerned him most about the D’Amato episode was the lack of civility. “What I find disappointing in the situation is that we were one terminal away from where a tragedy erupted on Friday,” he said.'"}, "time": 1742564309.0839365}