{"duration": 0.037687063217163086, "input_args": {"text": "\"Search Selective Outrage Over SPLC’s 'Anti-Muslim Extremist List' Leftists and atheists appalled that SPLC’s hit list of Islam critics includes…Leftists and atheists. October 31, 2016 Robert Spencer \\nSam Harris thinks it’s “unbelievable” that Maajid Nawaz and Ayaan Hirsi Ali made it to the Southern Poverty Law Center’s hit list of “Anti-Muslim Extremists.” He said nothing about me or the other people whom the SPLC included, which is not surprising, since he has quite recently expressed willingness to acquiesce in other contexts to the demonization that the SPLC list exemplifies. \\nHemant Mehta of The Friendly Atheist blog ably sums up the outrage over Nawaz and Hirsi Ali being included: “If criticizing religious beliefs makes them extremists, then it won’t be long before other vocal atheists end up on that list too. And make no mistake, that’s what Nawaz and Hirsi Ali are doing. That’s all they’re doing. They’re not anti-Muslim; they work with moderate Muslims. They’re critical of the worst aspects of Islam.” \\nThe problem with being angry about Nawaz and Hirsi Ali being on the SPLC list, but silent about everyone else who is on it, is that what Mehta says about Nawaz and Hirsi Ali can quite accurately said about everyone else on the list. If criticizing religious beliefs makes them “extremists,” then it won’t be long before everyone who dares to utter a critical word about Islam will be on the list — and that is indeed the objective of the list: to stigmatize and marginalize any and all such critics. Mehta protests that Nawaz and Hirsi Ali are “not anti-Muslim; they work with moderate Muslims. They’re critical of the worst aspects of Islam.” \\nBut no one would think that the other 13 were “anti-Muslim” if it hadn’t been for the Southern Poverty Law Center and the Hamas-linked Council on American-Islamic Relations (CAIR) and their allied groups insisting that we were all these years, in their avidity to conflate opposition to jihad terror and Sharia oppression with hating a group of people — a tactic designed to discredit opposition to jihad terror and Sharia oppression. Mehta and co. are falling for and validating the same smear tactics hey are decrying when used against their friends. \\nAnd as for working with moderate Muslims, for 13 years Jihad Watch has contained this invitation : “Any Muslim who renounces violent jihad and dhimmitude is welcome to join in our anti-jihadist efforts.” It is Nawaz (as well as other moderates) who has attacked me, in what appears to have been a cynical attempt to gain support for himself among Muslims; I never attacked him, and would have have been happy to work with him otherwise. \\nIn complaining that Nawaz and Hirsi Ali are merely “criticizing religious beliefs” and are “not anti-Muslim,” Mehta is strongly implying that the others on the SPLC list are doing something beyond “criticizing religious beliefs” and are indeed “anti-Muslim.” On Twitter the last couple of days I’ve seen many people express outrage that Nawaz has been lumped in with the likes of Spencer; but when I ask them what the big difference is between us, or for quotes from me that are actually “bigoted,” they go silent. \\nMehta, Harris, Haider and the others who are only angry with the SPLC’s hit list because it included Nawaz and Hirsi Ali are, by their selective outrage, acquiescing to and legitimizing the SPLC’s demonization of the other people on the list. (In his own defense, Hemant Mehta wrote me to explain, somewhat unsatisfactorily: “I focused on those two because they’re well known in atheist circles.”) This is a self-defeating choice for them to have made, for the SPLC has never identified anyone whom it considers to be a legitimate critic of Islam, and never will: the point of lists such as the one they released yesterday is to demonize and silence everyone who dares say something about Islam that is not warmly positive. \\nThe turn of Mehta, Harris, and Haider will come for the same treatment. One wonders if, when this happens, there will be anyone left to speak for them who has not already been smeared as “anti-Muslim,” with their tacit approval.\""}, "time": 1742628606.826408}