{"duration": 0.34374237060546875, "input_args": {"text": "\"10 Questions For Every Atheist By Jonathan Lenhardt on November 10, 2014 Subscribe \\nThe Liberal Conservative is back here at Liberal America! I won’t make a big to-do about it since I’m willing to wager most folks don’t remember me anyway. All you have to know is that I’m an Atheist and a fiscally conservative, socially liberal Republican who detests the Tea Party with a fiery passion. I don’t always agree with full-fledged conservatives or liberals, but I do believe we can at least tolerate each other just enough to live side-by-side. \\nSo, what brings me back after such a long absence? Believe it or not it’s not politics. It’s something I hold even more close to my heart: my aforementioned Atheism. See, I stumbled upon this article here courtesy of the kind folks at TodayChristian.net . It’s appropriately titled “10 Questions For Every Atheist” and was posted on their web site back in July with the subheading “Some Questions Atheist Cannot Truly and Honestly REALLY Answer! Which leads to some interesting conclusions?”. \\nLook, I won’t lie. I stopped reading right there. I mean…some questions Atheist (not Atheist s , mind you) cannot truly and honestly REALLY (for added emphasis) answer? Interesting conclusions? In the words of my generation, “Challenge accepted!” I decided I was going to respond right then, right there. Game on. Without any further delay, let’s get on with it… \\nQuestion #1: How Did You Become an Atheist? \\nRight off the bat we start with a question that no Atheist would have any trouble answering. Like me personally, I simply started thinking for myself around age 13; asking very serious, very real questions about the world we live in. Would an all-merciful god allow children to go hungry? Would an all-powerful god allow innocent people be tortured and killed? Soon I discovered that I had quite a few questions and no real answers. “God’s will”, “Thy will be done”, “God will one day vanquish evil”; these are not real answers. If it’s any god’s will for the world to be as horrible as it is and has been, then I wouldn’t believe in it even if I knew it existed. That would be like having a sports hero you discovered was a child pornographer. Any decent human being would stop believing in that hero. \\nQuestion #2: What happens when we die? \\nOur loved ones mourn while we are buried, burned or donated to science. We lose all of our senses, our ability to think. We cease to exist. It’s a pretty scary thought. One that often quite literally makes me bolt up awake at night having to shake the thought off. The thought being, “I am going to die one day and then that’s it.” Scary as it is, it makes me appreciate this life more even if I continue to only live it about a quarter of the way to its fullest. At least I’m enjoying myself. \\nQuestion #3: What if you’re wrong? And there is a Heaven? And there is a HELL! \\nThen I’m wrong; and God is either all-merciful like religious folk claim or he/she/it is a total jerkass. I do like how “hell” is in ALL CAPS in this question as if it’s supposed to be scary, though. Cute. Also, the punctuation is wrong; and, you never start a sentence with “and”. \\nQuestion #4: Without God, where do you get your morality from? \\nEmpathy mainly. Empathy is a human trait, not a religious one. Logic is another source of my morality; as is reason. I’d also like to point out that so far these are really easy to answer… \\nQuestion #5: If there is no God, can we do what we want? Are we free to murder and rape? While good deeds are unrewarded? \\nOkay, I first noticed this with Question #3: this is actually three questions in one which I think is cheating. Would it be so wrong for Today Christian to call this article “ 14 Questions For Every Atheist “? It’s like they chose 10 because it sounds stronger. Kind of sounds like the same reason why there are Ten Commandments . \\nEither way, let’s start with the first one. We can do whatever we want within the confines of the law of the land. Man’s law, that is. You’ll notice that if I sleep with my neighbor’s wife – which I might; I am a heathen , after all – I won’t go to prison for it. Nor will I go to prison for looking at my buddy’s PlayStation 4 and thinking, “Aw, I want one!” \\nThe second one? I could cite the law answer again, but this question deserves a more human answer. What kind of monster wants to murder and rape people? Is your archaic book the only reason you don’t murder and rape? Do you constantly have to fight those urges – only winning out when you spot your Holy Bible on the book shelf and remember that if you do those things you’ll end up in hell? If the answer is no, then you wouldn’t murder or rape people either. That’s called humanity and – again – empathy . \\nFinally, “While good deeds are unrewarded?” If the only reason you do good is for a pat on the back and recognition, then you’re not moral. You’re a creep. A needy creep. \\nQuestion #6: If there is no god, how does your life have any meaning? \\nOur lives are defined by the good we do for others (with or without recognition, to reference the previous question), our families, our friends, etc. I don’t need an invisible space daddy to tell me what my life means. I give my life meaning every day in one way or another. I want to be a writer who entertains people through literature, film, the occasionally whacky joke, etc. Making people laugh, smile, think, and the like – even if that dream fails – is the definition of my life. If I can make one person enjoy their day every day, then my life is complete. I did that. I gave it that meaning. By myself . I didn’t even have an instruction book! You can’t even put together IKEA furniture without an instruction book (and an AI helper, and a rocket ship, and a…) and yet I’ve figured out my life’s meaning without one. \\nQuestions #7: Where did the universe come from? \\nWe don’t know. That’s something religion folks don’t seem to understand. Saying “I don’t know” or “we don’t know” isn’t an admission of defeat. We just don’t know. Yet. Maybe we’ll never know. There are brilliant minds working on it; but, until we have cold hard proof that a space magician created everything we aren’t going to blindly believe it. There are theories. Quite a few of those theories are logical in a scientific sense. Will we ever prove it? That’s a damn big thing to prove. That being said, only the biggest, most self-indulgent egomaniacs of the scientific community do what hardcore religious people do and say their theory is 100% for sure without being able to absolutely prove it time and time again. “God just went click” is both simplistic and embarrassingly naive. I say that without trying to sound condescending. However, it’s a simple case of “I’ll believe it when I see it.” Or when I’m otherwise able to verify it. \\nQuestion #8: What about miracles? What all the people who claim to have a connection with Jesus? What about those who claim to have seen saints or angels? \\nUgh! Another question that’s actually three questions within a question. Okay, fine… You’re aware mental illness is a thing? Okay, I’ll be less jerk-ish. \\nThis makes me think of people who claim or are related to or otherwise know people who claim to have had a “near-death experience” or NDE. The problem with that whole thing is that it’s suspiciously similar to the effects the centrifuge test has on the men and women training to be astronauts or fighter pilots. Those folks experience the same visions – often of saints, angels, dead relatives, etc. NDE’s are nothing more than the brain vividly hallucinating sights, sounds, and the “light at the end of the tunnel” as blood rushes from the brain to other parts of the body as it struggles to both maintain equilibrium and struggle to keep living . \\nThrow in people who claim to see UFOs, Bigfoot, Slenderman, El Chupacabra, and Michael Bay’s talent to this next part: some people make stuff up for attention. It’s true. Or for financial gain. Or just for the goddamn fun of it. Dishonest people exist . Everywhere . \\nAs for people who claim to have a connection with Jesus? They’re probably hearing voices in their head. That’s mental illness . If a voice in my head tells me it’s a good idea to go to a random child’s birthday party, cold cock the clown in the chin, poo on the cake, and make love to the child’s mother on the picnic table in front of the whole party, then I too would claim Jesus told me to do it since I? really wouldn’t want to go to jail or the asylum . \\nTo wrap up Questions #8a, 8b, and 8c: miracles. Aren’t those the same things that have become strangely scarce now that cameras and other recording devices exist? \\nQuestion #9: What’s your view of Dawkins, Hitchens and Harris? \\nThey could be less militant. Look, my fellow heathens, I’m a whole-hearted Atheist. I do not believe in any gods or supernatural beings of any kind and I fully understand the atrocities often carried out in the name of religion. That being said, I don’t automatically leer down at those who are faithful. It’s true that I used to leer down on people who were. That is until I was with my now ex-girlfriend (we broke up over stuff other than religion, mind you). She mellowed out my Atheism on account of the fact that she was raised Roman Catholic and still remained pretty spiritual in one sense or another as an adult while she also just happens (happened?) to be a wonderful person. Now, Dawkins, Hitchens, and Harris (you’ll notice I use the Oxford comma in my writings, but to each their own) are brilliant, funny, and kind of a jerk, respectively. I understand how militant Dawkins is and Hitchens was; but, I have a hard time believing that if a faithful person respectfully approached them as a human being and simply wanted a light, brief conversation that they’d be or would have been anything but appreciative of the respect shown. Harris? Who knows? I think he’s kind of a jerk. He’s shown himself to be so in the past and I’m not even talking about the Real Time thing with Ben Affleck . I don’t think that he was behaving at all bigoted on that occasion. \\nQuestion #10: If there is no God, then why does every society have a religion? \\nBecause every society has roots that go back to a people who knew nothing and tried their best to explain things like fire, lightning, the sun, the moon, etc. That’s how religion started: by people who knew nothing . That evolved (wink, wink) into people who wanted power which has now evolved (nudge, nudge) to people who want money; especially here in the United States. \\nThe Tea Party – which I will never be affiliated with despite being a Republican – is basically owned by people (namely the Kochs) who are using those people’s faith as a method of moral, “spiritual” corruption. The Kochs and the politicians they own – which are voted into power by the people they control through this hysteria which is primarily faith-driven – don’t give a rat’s asshole about the well-being or happiness of the “Tea Patriots” or “Tea Baggers” or anyone for that matter. They wouldn’t piss on you if you were on fire; mostly because they are working to privatize pissing on people who are on fire and they’d really rather you paid for that service. \\nBy the way, ever noticed how each society’s religion is different? That there is no single religion? It’s almost as if each society made up their own shit along the way… \\nHere’s My Final Thought \\nLook, being an Atheist isn’t about being an elitist. Hell, Atheists all have different lifestyles, different hobbies, different daily routines, different tastes, preferences, opinions, political views, alignments; for Christ’s sake we have different favorite movies, shows, musicians, genres, sexual positions, drugs, doctors, lawyers, ways to make fun of Michael Bay, etc. Atheism isn’t a singular entity. It is a vast, diverse, wonderful place where all are welcome to discuss or even disagree so long as they discuss and disagree politely. \\nThe only thing all Atheist groups share is that we don’t believe in god, the devil, Zeus, Odin, healing crystals, the medicinal uses of wind chimes or any of that stuff. We’re happy to live peacefully with you if you’re happy to live peacefully with us. The only reason Atheists tend to appear so combative is because pretty often? we are the ones under attack and so we are always on guard . Be it by the laws religious politicians push or name-calling on Facebook or willful ignorance about the state of the country and world or seeing good people suffer throughout the world we find ourselves and our views threatened simply because we choose not to worship on our knees. We choose instead to live on our feet. We help others not because we are told it is moral by a deity, but because we feel it’s the right, just, human thing to do. \\nLet us know your thoughts at the Liberal America Facebook page . Sign up for our free daily newsletter to receive more great stories like this one. \\nAbout Jonathan Lenhardt \\nI'm Jonathan Lenhardt; fiscally conservative, socially liberal Republican. I'm pro-choice, pro-2nd Amendment, anti-Tea Party, and happily atheist just to name a sparse few things about me. You can direct all hate mail to [email protected] Also, you can find me on Google+, Twitter (@JonLenTheLC), and I have an L.C.-specific Facebook page (Jonathan Lenhardt, The Liberal Conservative). Connect\""}, "time": 1742564469.4268405}