{"duration": 0.13677978515625, "input_args": {"text": "'Bernie Sanders Could Replace President Trump With Little-Known Loophole Read this article and then share with your friends. By Matt Masur / huffingtonpost.com \\nHere is exactly what we need to do to save our great society. The information here is what we’ve all been waiting for. By doing this we can make Bernie the president on Inauguration day rather than President-elect Donald Trump . \\nActually, no we can’t. There is no loophole that allows a random person to assume the office of president. That’s pretty basic common sense but yet you clicked or even shared this article anyway. Now that right there is the real point of this post… \\nOur social media sites have been flooded with misinformation in the past few months. While this has always been a problem, it now appears to have exploded over this election season. We are seeing post after post stating just plain illogical things and this is not a problem unique to any one side. \\nEven more dangerous are the posts that don’t appear to be far-fetched until you dig into the details. The big problem with that… People don’t dig for the details. \\nThere will be many people who clicked share on this post because of its headline. They may not even click to open the story. They will never actually read these words. Ironically these are the folks who need to hear it the most. \\nAs John Oliver correctly pointed out Sunday night, folks are being fed what they want to hear and they’re eating it up like a starving person. The most important thing in a functional society is a well-informed public. What we have now is not only uninformed but misinformed masses. That’s something that should scare us all. The most important thing in a functional society is a well-informed public. What we have now is not only uninformed but misinformed masses. \\nHow do we combat this problem? Easy, we have to do some work. While I could give a long dissertation on what exactly that means, no one has the patience to read it all, so here are five quick steps that’ll fit in a meme… \\n1. Read first. Then share. I myself am guilty of basing comments or even clicking share based on the headline. This is the worst thing any of us could do. Stop being lazy. \\n2. Check the source (and their sources). In the age of new media true and valid information comes from non-traditional sources but so does a lot of garbage. Any article that posts facts, figures or quotes should provide a source for that information. If there is no backup for their claims, move on. \\n3. Watch out for recycled stories. One thing that seems to be feeding into the misinformation problem is when old stories are being presented as happening now. Check the date on the story before you read on. You’ll be shocked to see how many are from another time and aren’t applicable to the current event you thought they were talking about. \\n4. If you care about facts, ignore the blatantly slanted. Having a slant or taking a position on a story is not wrong in itself. What is wrong is when these ideas are taken as unbiased fact. You can avoid all of this by simply avoiding those sites to start with. Any website with the words: Conservative, Liberal, Democrat, Republican, etc. in the title are just advertising how slanted they are. That’s ok if you choose to live in your side’s bubble but please don’t have any delusions that these stories reflect the whole picture. \\n5. Google it. God (and Sergey ) gave us Google for a reason. If you see a story that’s unbelievable or has no sources or even if it does, verify. See if the same facts are reported across multiple outlets. See if anyone disputes these facts. Read these pieces and then make up your mind. \\nIf we could all take these simple steps our society would be a better place. We all have opinions and leanings. There is nothing wrong with that but could we at least all come from a starting point based on facts and reality? \\nThe truth is, sharing illogical things begins to erode YOUR credibility and it makes you look foolish. Trust me, I speak from experience. \\nNow go share this, please. 0.0 ·'"}, "time": 1742628329.2603815}