{"duration": 0.056058645248413086, "input_args": {"text": "'Multiple White House sources confirmed to Breitbart News on Sunday evening that reports earlier on Sunday that Sebastian Gorka, a deputy assistant to President Donald Trump, is somehow leaving the White House are incorrect. [“Incorrect,” one source told Breitbart News when asked about reports from the Washington Examiner and CNN that Gorka was leaving the White House.  A second White House source with direct knowledge of these matters confirmed to Breitbart News that the reports are wrong. The Washington Examiner’s Sarah Westwood reported on Sunday that Gorka, an   News national security editor, was leaving the White House for another federal agency. “Sebastian Gorka, deputy assistant to President Trump, will soon accept a position outside the White House, two sources told the Washington Examiner on Sunday,” Westwood wrote: Gorka’s new role will deal with the “war of ideas” involved in countering radical Islamic extremism, a senior administration official said, and will entail an appointment to a federal agency. Gorka has served for months on the Strategic Initiatives Group, an internal organization within the White House, and as a national security adviser. His exit from the White House comes amid increased speculation that a reported lack of a security clearance prevented him from fully performing in his job. But a source told the Washington Examiner that Gorka’s role in SIG was always meant to be temporary, and suggested he had been placed there while administration officials created a   position for him elsewhere in the government. An official said Gorka has been in a “holding pattern” while he waited for the position, which will not be at the State Department, to be established. A spokesman for the National Security Council said he did not “personally know” the details about Gorka’s move. A White House source said Gorka’s role has always been unclear and said Gorka never had national security issues in his portfolio. “This guy has always been a big mystery to me,” the source said of Gorka’s contributions to the staff. It turns out that these sources had inaccurate information. So did “administration officials” who talked anonymously to CNN, which published a similar report. “Sebastian Gorka, a controversial national security aide in the White House, is expected to leave his job, several administration officials confirm to CNN,” CNN’s Jim Acosta and Eric Bradner wrote on Sunday. “One senior administration official said Gorka is expected to find an opportunity outside the White House soon. Another said it’s possible he would take another job in the administration, but added it’s more likely he will leave altogether. That official said Gorka was simply generating too much controversy for the White House. ” Gorka has been under constant assault from the left, including many media attacks that falsely claimed he has   ties. But a BuzzFeed report from Mitch Prothero in Hungary found that Gorka actually has no   or Nazi ties, despite scores of inaccurate reports and claims from   organizations that he did.'"}, "time": 1742561987.2330863}