{"duration": 0.10679221153259277, "input_args": {"text": "\"By Roger I. Roots, J.D., Ph.D. October 28, 2016 \\nJust days ago , I reported on the federal trial of the “Malheur 7” (Ammon Bundy, Ryan Bundy, Shawna Cox, Jeff Banta, David Fry, Neil Wampler and Ken Medenbach,) in Portland, Oregon. I was privileged to have a front-row seat at the trial as a volunteer paralegal and legal researcher for Ryan Bundy, who represented himself throughout the proceedings. \\nAlmost everyone who followed the “Oregon Bundy case” predicted convictions all around. A dozen co-defendants pled guilty before the trial began. Virtually every attorney I spoke with expressed the sentiment that defending the accused was a lost cause. Coverage of the case in Oregon’s largest circulating newspapers presented the case wholly from a prosecution perspective. My inbox contains more than one email urging me to abandon my efforts to help the defense. \\nAs I sat at the table between Ryan and the Ammon Bundy team throughout the six-week trial I was able to discern that evidence at the trial was diverging sharply from the prevailing narrative outside the courthouse. The defendants were accused of conspiring to prevent employees of the U.S. Fish & Wildlife Service and Bureau of Land Management from performing their duties at the Malheur National Wildlife Refuge in rural eastern Oregon. Yet federal prosecutors failed to produce a single piece of evidence of any specific threat aimed at a USFWS or BLM employee. \\nThe U.S. Justice Department alleged in Count 1 that the seven defendants (and many others) had engaged in an “armed standoff” at the federal wildlife refuge with the intent of scaring away the various government employees who normally work there. Every defendant was utterly innocent of the allegation. Some were not even aware that federal employees normally worked there). Several defendants were also charged with firearm possession in federal facilities with the intent to commit a federal felony (the conspiracy alleged in Count 1). And two defendants, Ryan Bundy and Ken Medenbach, were accused of stealing federal property valued over a thousand dollars. \\nIn fact, Ammon Bundy and the other defendants took a monumental (and quite daring) stand for the plain text of the Constitution when they occupied the Malheur Refuge in January of this year. They pointed to Article I, Section 8, Clause 17 of the U.S. Constitution which seems to plainly forbid the federal government from owning land inside the states unless the states agree to sell such real estate to the federal government. \\nNeedless to say, the present reality in the American west is in sharp contrast to this piece of constitutional text. The feds claim to own and control millions of acres of land in western states—most of which (such as the Malheur Refuge area) was never purchased from state legislatures or anyone else. \\nThe most frightening revelations from the Malheur 7 trial involved the lengths which the U.S. government went to in its prosecution. During the Bundy occupation, the FBI literally took over the tiny nearby town of Burns, Oregon and transformed it into an Orwellian dystopia. There were license plate scanners mounted on utility poles, drones throughout the skies, and military transport vehicles speeding across the countryside. FBI agents captured and monitored every phone number connected between every accused occupier. Federal and state police appeared in such numbers that their total numbers will probably never be fully tallied. \\nThe occupation was met with a bonanza of government spending by agencies at every level. The U.S. Fish & Wildlife and BLM employees who were supposedly too frightened to go to work were put up in luxury hotels, along with their families. (In the aftermath of the occupation, the feds have spent further millions to “rebuild” the Refuge, supposedly because the occupiers tainted it; prosecutors were openly planning on asserting the inflated “bill for damages” at sentencing in the event the defendants were convicted.) \\nMost startling of all were the undercover government informants that were revealed in the trial. After weeks of wrangling and arguing with defense lawyers, the Justice Department finally stipulated that at least nine undercover informants were planted among the Refuge occupiers. Thus, informants outnumbered the defendants on trial. One informant was even a “bodyguard” for Ammon Bundy and drove him to his arrest. Another informant admitted he trained occupiers in shooting and combat skills. \\nAfter a week of deliberating over the evidence, the jury came back with its verdict yesterday afternoon, acquitting every defendant. (Jurors said they were divided regarding an accusation that Ryan Bundy aided and abetted the theft of government property when he and others climbed utility poles and took down two of the government’s surveillance cameras.) \\nThere are reports that the U.S. Justice Department spent $100 million on the case. But twelve Americans saw through the government’s cloud of disinformation and dealt a mighty blow for liberty. The Best of Roger I. Roots, J.D., Ph.D. Tags: Roger Roots, J.D., Ph.D. [ ] is attorney, sociologist, and a member of the advisory board of the Fully Informed Jury Association. He is author of The Conviction Factory: The Collapse of America's Criminal Courts .\""}, "time": 1742562549.5181596}