{"duration": 0.04385733604431152, "input_args": {"text": "'November 11, 2016 - Fort Russ News -  RusVesna - translated by J. Arnoldski -  \\n\\n\\nThe Federal Security Service (FSB) of Russia has published footage of the arrest of saboteurs from the Ukrainian defense ministry in Sevastopol. \\nAs reported earlier, a saboteur-terrorist group from the Ukrainian ministry of defense planning terrorist attacks on military targets in Crimea was arrested in Sevastopol.  A source from Russian security agencies told Interfax: “All three of the arrested are citizens of Ukraine. They are suspected of preparing acts of sabotage on the peninsula.”   \\n\\n“Russian law enforcement had operative information on saboteurs’ infiltration of the peninsula around two weeks ago. Tight surveillance followed them to identify their contacts, routines of travel and communication, and the operation contributed to the identification of informants on the peninsula. In this regard, new arrests are not ruled out,” he added.  \\nIt is now known that the detainees in Sevastopol were staff officers of the Main Intelligence Directorate of the Ministry of Defense of Ukraine. They pleaded guilty and offered confessions. \\nDuring the search of their apartments, a map was discovered with marked military facilities and infrastructure targets on the Crimean peninsula. The source added that “considering the interrogations of those arrested, it has been established that they were preparing acts of sabotage against power plants, water purification plants, and also gas distribution networks in Crimea.”  \\n\\nThe video footage shows the capture of one of the Ukrainian terrorists and the search of his apartment, where FSB officers found weapons and ammunition. The clip also shows security forces recovered a package, presumably of explosives, from an underground safe.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742564244.5382369}