{"duration": 0.14941668510437012, "input_args": {"text": "\"By Muhammed Ali Carter on November 2, 2016 Lebanon's future now rests in the hands of a man older than the supreme leader of Iran. Lebanese celebrate in the streets of the coastal city of Batroun after election of former general Michel Aoun as president \\nThe news didn’t come as much of a surprise in the end. Presidential posters with Michel Aoun’s face were already being hung around east Beirut before the results had even been released but now it’s official, Lebanon has finally elected a new president! Michel Aoun, a Maronite Christian and former military chief, was elected on Monday making him the country’s 17th president, ending a two-year political vacuum in the country’s top post that had left Lebanon paralysed. Aoun now takes the reigns of a country heavily plagued by poverty, joblessness, a massive refugee overload with refugees from various countries, practically non-existent public services, constant threat of war from their southern neighbour Israel, and bomb attacks from Salafi terrorists. \\nInterestingly enough, this is the second time that Aoun has been announced the President (according to himself) when he and the Christian-led military government of East Beirut appointed itself in 1988 and anyone who dared disputed this was met with violence, which did eventually occur. Aoun even went on to fight a ‘war of liberation’ against the Syrian Arab army forces stationed in Lebanon during 1990 [i] which ended in failure and forced Aoun to flee his native land into exile in France. [ii] \\nThe man behind the poster \\nAoun is considered, by his supporters, to be a strong leader with a military background who knows how to play the political field to achieve his goals. On the other hand, most Lebanese I have spoken to about Aoun have offered plenty of negative feedback even from people who I assumed would throw their full support behind the old boy. Corrupt, untrustworthy, an overall slippery character who has been lucky enough to pick the right partners since his return to Lebanon after his 15-year exile. \\nI have to admit, the side of my personality that appreciates dark comedy chuckled at the picture of President Aoun sitting in the big chair of the Baabda presidential palace with just the slightest whisper of a cheeky smile on his face. The last time Aoun held the Baabda palace, the Syrian army under the authority of Michel Aoun, pictured at the presidential palace in Baabdaafter being elected President of Lebanon. \\nPresident Hafez Al-Assad of Syria, bombed him out in a US-backed attempt to illuminate a stubborn Lebanese nationalist troublemaker. Yet now, twenty-six years later, Bashar Al-Assad (the son of Hafez) offered his personal congratulations to Aoun on his election victory. [iii] Just maybe, President Aoun also shares my dark humour, which would explain his sly self-satisfied smirk while he sat in his long-awaited prize seat. Despite all the odds, he has returned to Lebanon and claimed what he had always wanted, the presidency. \\nAoun carries with him a considerable amount of political baggage from a long career full of conflict, civil war and side switching which has left many in Lebanon questioning if this old-school lord of war is the man worth appointing to end the political stalemate which some have suggested – Lebanon would be better off remaining politically frozen – instead of appointing a man who has fought against the Assad administration in Lebanon during the late 80’s but now fully backs Assad and Hezbollah in Syria. This is a totally understandable stance given the lack of honest candidates available in Lebanese politics, however, the fact remains that Lebanon has been left completely disabled by the political deadlock which is pushing the country to the brink. \\nI personally agree with the Progressive Socialist Party and Druze leader Walid Jumblatt who said on Twitter prior to the vote that it’s time to elect ‘any’ president to escape the presidential vacuum. [iv] \\nWhy elect Aoun now? \\nI have a growing concern that behind closed doors some very egotistical and conniving millionaires are beginning to see the massive potential gas wealth just sitting off the Lebanese coast [v] but Lebanon’s political class has been far too busy infighting among themselves to invest in steps towards harvesting and selling Lebanese gas. \\nIsrael & Egypt also have their eyes on this untapped wealth lying below the Mediterranean. [vi] Perhaps this could be why so many old adversaries of Aoun have decided to suddenly put an end to their refusal to back Hezbollah’s ally for president; Hariri who is smart enough to see this type of opportunity on the horizon and just about desperate enough to surrender his staunch opposition to Aoun’s candidacy in return for inclusion in any future plans. Given Hariri’s recent bad luck with his struggling business in Saudi Arabia, I wouldn’t put it past him. [vii] \\nImagine, Saad Hariri, who is still eagerly perusing the trial and conviction of what he believes where Hezbollah hitmen who Michel Aoun (L) at news conference, beside Lebanon’s former prime minister Saad al-Hariri, after Hariri announced that he will back Aoun to become president \\nassassinated his father, Rafic Hariri, is now willing to throw his vote to Hezbollah’s candidate in order to secure the position (also for the second time) as prime minister. \\n\\nCertainly there are many more aspects to consider in what has been a rollercoaster two-year timeline leading up to yesterday’s grand finale but I suspect that Lebanon’s political godfathers are smart enough to realize they are sitting on a potential trillion dollar money maker which, now, is at risk of being high jacked if they continue pussyfooting around over never ending, decades-old sectarian feuds. \\nWhat Could Aoun Bring? \\nDuring my last trip to Lebanon, I was shocked to see how even the average middle-class Lebanese struggle with the lack of basic services. The country is a mess and the only institution that is worth any praise is the Lebanese army that has coped remarkably well under the strains of constant terror attacks from radical Salafi terrorists [viii] , the rise of regional sectarianism and a huge lack of money & equipment. \\nAoun, the one-time proxy of Saddam Hussein [ix] (the Iraqi dictator who fought a long bloody war against Iran) is now considered the candidate who confirms an Iranian political victory over its competitor for political influence in Lebanon, Saudi Arabia. \\nWhat has largely held the country back is the fact that Lebanon has been stuck in a vicious game of tug-of-war between Saudi & Iran. Lebanon’s refusal to pick a side has left the country empty handed with no vision of a safe future. Saudi has cancelled a desperately needed arms deal with a pathetic excuse, blaming the deal cancellation on a statement made by Lebanon’s foreign minister (who happens to be Aoun’s son-in-law) Gebran Bassil who refused to accept a Saudi-proposed statement referring to Hezbollah as a terrorist group. [x] The Saudi produced statement Left, Lebanon FM Gebran Bassil. Centre Maronite Patriarch Beshara Rai. Right, Michel Aoun President of Lebanon. \\nalso demanded all Arab league members to condemn Iran which both Lebanon & Iraq refused to do. \\nHowever, in previous attempts to remain neutral, Lebanon has also refused to accept any Iranian or Russian offers to provide free arms deliveries to the Lebanese army in order not to upset the countries ties to the US or the Gulf. Now that Aoun holds office, Lebanon may have the guts to finally accept Iran’s offers of arms and economic support to better supply its security forces and enhance Lebanese ability to protect itself and boost its frail economy. \\nI have to give Aoun credit, In his first speech after becoming president, he pledged to fight corruption and protect Lebanon from the fires raging around it, referring to the Syrian civil war. Aoun was also talking tough against Israel according to Hezbollah’s Al Manar-TV with promises to liberate contested territory which Aoun labelled an “Israeli occupation,” referring to Israeli-occupied parts of the Golan Heights. Iran too has been quick to hail Aoun with congratulations. Ali Akbar Velayati a veteran MP of the Islamic Republic, described the choice as a victory for Iran and its allies in Lebanon because the Lebanese president is “a very significant ring in the chain of the Islamic resistance,”. [xi] \\nAoun has been willing to publicly side with Iran’s ally Hezbollah and his son-in-law foreign minister Bassil refused to condemn Iran politically while under pressure to do so from most of the Arab league, so it seems fair to expect that Aoun’s Lebanon would be willing to build bridges between Beirut and Tehran, despite the offence this would cause to the Gulf. \\nWhether you like Aoun or not all that really matters at such a desperate stage is whether he has what it takes to do a good job or not. Yes, he is old and has a dodgy past but to be frank everyone in Lebanese politics does. There is not a single candidate who could make all sides happy and there is probably not a single candidate who will not abuse his position to one degree or another but if Aoun is willing to at least take care of the country’s basic needs then most Lebanese would accept his leadership with just the usual contempt and frustration towards their political class which is typical of the Lebanese. \\nLebanon has huge potential to be a successful nation but big challenges must be met with strong, relentless and above all tireless leadership that has a clear vision of what it wants to make the country great again. The President has to be able to balance a relationship with various national (and in some cases sectarian) rival political blocks as well as large international powers, some of which are brutal adversaries, to get the best deal for Lebanon. \\nIran is a country which, like Lebanon, has massive economic opportunities; Lebanon could do very well if they decide to open their doors to Iran on an economic level without childish sectarian restrictions being imposed by Saudi Arabia. \\nLong road ahead \\nLebanon is one of a few countries in the middle east with a better educated, modern society which allows many basic freedoms which are considered unacceptable elsewhere in the region. I cannot say in all good continence, that Aoun has what it takes to lead Lebanon to greatness, he has certainly not earned that type of praise from his past exploits. \\nI just hope the old boy has a genuine intention as well as the physical will-power to tackle all of Lebanon’s various conundrums. Considering Lebanon’s future now lies in the hands of an 81-year-old right wing Christian who is known by his followers as “the general” I think you could all understand my concerns following his appointment. \\nLebanon needs new ideas, the Lebanese establishment has been leaning towards the US & Saudi Arabia for years which has produced nothing tangible on any level. Iran has proven itself, (despite what the Saudi or Israeli media have to say) as a more practical, rational and generally sober partner in the region. I have argued that countries like Lebanon should look to explore the possibility of building potentially prosperous relations with Tehran who for a long time been genuinely interested in building working relationships, especially with Lebanon. \\nLebanon needs to get over its old fruitless relationships and open its doors to whoever is willing to provide real tangible economic support, this is key if Aoun wishes to pursuereal internal reform and investment in Lebanon’s knackered institutions. That has to be the priority for any administration seriously planning to turn Lebanon around. \\nI hope, for Lebanon’s sake, that Aoun will have the capability to reform Lebanon but given his history, age and the massive mountain of difficulties Aoun needs to drag the country over before noticeable changes can be achieved, you can’t blame me for choosing to remain sceptical \\n\\nReferences \\n[i] “Aoun calls majority cowards for not waging war on Syria” . Ya Libnan. 25 April 2008. Retrieved 18 May 2008. “During this period Aoun became critical of American support for Syria and moved closer to Iraq, accepting arms supplies from Saddam Hussein.” \\n[ii] BBC News (31 October 2016) Lebanon: Michel Aoun elected president, ending two-year stalemate, Available at: http://www.bbc.co.uk/news/world-middle-east-37821597 \\n[iii] France 24 News (31 October 2016 – 20H45) Syria’s Assad congratulates Lebanon’s new president, Available at: http://www.france24.com/en/20161031-syrias-assad-congratulates-lebanons-new-president \\n[iv] Nayla Tueni (Saturday, 22 October 2016 KSA 08:47 – GMT 05:47) Lebanon needs a strong president, not a president by force, Available at: http://english.alarabiya.net/en/views/news/middle-east/2016/10/22/Lebanon-needs-a-strong-president-not-a-president-by-force.html (Accessed: Saturday, 22 October 2016). \\n[v] The Daily Star Lebanon (http://www.dailystar.com.lb/Business/Local/2016/Oct-19/377101-its-too-early-for-lebanon-to-celebrate-gas-wealth-study.ashx) It ’ s too early for Lebanon to celebrate gas wealth, Available at: http://www.dailystar.com.lb/Business/Local/2016/Oct-19/377101-its-too-early-for-lebanon-to-celebrate-gas-wealth-study.ashx (Accessed: October 19, 2016). \\n[vi] Tani Goldstein () Israel willing to use force to protect gas finds, Available at: http://www.ynetnews.com/articles/0,7340,L-3910329,00.html (Accessed: Published: 24.06.10 , 17:02). \\n[vii] By AFP for The Jordan Times (Last updated at Mar 27,2016) Workers suffer in Saudi Arabia as once-mighty Hariri firm falters, Available at: http://www.jordantimes.com/news/business/workers-suffer-saudi-arabia-once-mighty-hariri-firm-falters (Accessed: Mar 27,2016). \\n[viii] Matteo Tomasini (Spring 2010) The Salafi Jihadist Threat in Lebanon. [Online]. Available at: http://fletcher.tufts.edu/~/media/Fletcher/Microsites/al%20Nakhlah/archives/pdfs/Tomasini%20The%20Salafi%20Jihadist%20Threat%20in%20Lebanon.pdf \\n[ix] The New Arab (Date of publication: 21 October, 2016) Former ally slams Hariri’s nomination of Aoun for presidency, Available at: https://www.alaraby.co.uk/english/news/2016/10/21/former-ally-slams-hariris-nomination-of-aoun-for-presidency \\n[x] THE LEVANT NEWS — BEIRUT (Feb 20, 2016) Lebanon Foreign Ministry rejects blame in Saudi aid row, Available at: http://the-levant.com/lebanon-foreign-ministry-rejects-blame-in-saudi-aid-row/ (Accessed: ). \\n[xi] Oren Dorell (12:28 a.m. EDT November 1, 2016) Lebanon chooses a president supported by Iran and Hezbollah, Available at: http://www.usatoday.com/story/news/world/2016/10/31/lebanon-chooses-president-supported-iran-and-hezbollah/93064358/ Related Posts:\""}, "time": 1742628364.109138}