{"duration": 0.15009689331054688, "input_args": {"text": "'Center for Security Policy President Frank Gaffney joined SiriusXM host Alex Marlow on Wednesday’s Bretibart News Daily to talk about the crisis in North Korea, and whether the Trump administration will be able to break a cycle of provocations and negotiations that stretches back for decades. [Gaffney said things could be different this time, and maybe not in a good way, because “North Korea is now in a position to attack with horrific effect the United States itself  —   not just our friends and allies and forces in the region, but the continental mainland of the United States. ”  “One of the ways in which they could do that, we believe, is through unleashing, perhaps via a nuclear device overhead  —   currently there are two North Korean satellites circling the Earth, and passing over the United States with regularity, that could conceivably house an electromagnetic pulse optimized nuclear weapon,” he explained. If detonated, such a weapon could “take out the United States by destroying our electric grid,” an offensive capability Gaffney described as a “ ” even before North Korea develops   intercontinental ballistic missiles. “These are real threats that are now to us, here at home,” he said. “I think that somewhat changes the ‘Groundhog Day’ exercise that we’ve been going through for decades now. ” Gaffney quoted Vice President Mike Pence talking about putting an end to “willful deception,” by which he meant “the willful deception of the North Koreans as they have entered into a succession of agreements with us, including that they would not get nuclear weapons  —   which of course they predictably violated with impunity. ” “In fact, they were rewarded for doing it, in subsequent negotiations and concessions made to them,” he added.  “But there’s another kind of willful blindness, or willful deception if you will, that’s operating here. And that is I believe the deception we’ve indulged in, in this country, with respect to China,” Gaffney said. “We’re endlessly told the Chinese are the solution to this problem. If only the Chinese will restrain their clients in North Korea, this problem will be at least mitigated, if not eliminated. ” He said the truth of the matter is, “the record is pretty clear that the Chinese consider bad behavior from North Korea to be a strategic asset for them. ” “Far from constraining it, I think they’re enabling it  —   no question about that  —   but I think they actually find it very expedient to use against the United States, notably as just one example in the course of conversations with Donald Trump,” he observed. “Within days of ending a campaign in which he promised to brand them  —   as they are  —   a currency manipulator, in the interest of inducing the Chinese to behave as intermediaries and constrain North Korea, the president has said ‘oh, no, no, they’re not a currency manipulator.’ I think that’s the kind of evidence of bennies that flow to the North Koreans, and principally to the Chinese, that enable the North Koreans to keep on keeping on  —   in fact, to become more dangerous with Chinese help. ” Marlow turned the conversation to Tuesday’s shooting rampage in Fresno, where suspect Kori Ali Muhammad targeted white victims and reportedly shouted “Allahu akbar!” as the police took him down. The Associated Press has been criticized for refusing to print the phrase as Muhammad said it, instead rendering it in English as “God is great!” Gaffney further argued that this common translation of “Allahu akbar” is incorrect. “It means ‘Allah is greatest,’” he said. “Not God, some Abrahamic faith God, but Allah isn’t just great or even greater, he is greatest. This is the jihadist battle cry. It’s what you are supposed to say when you are killing infidels, to assure that if you’re killed in the process you’ll get credit for it as a shaheed, a martyr, a guy who is sacrificing himself for the greater glory of sharia. ” “It’s almost a parody these days that the reflexive response of law enforcement, if it isn’t ‘nothing to see here folks,’ it certainly is ‘nothing to see here in the way of sharia supremacism,’” he complained.  “Now, this guy may have a lot of other issues. Apparently he’s homeless, he hated white people  —   I get that. But when he says those words, you cannot ignore the fact that probably somewhere, maybe because of what he’s been hearing on the news, or maybe because of something he’s been hearing in jail, where a lot of guys are getting converted to jihad, or Muslims going in come out   jihadists. Whatever the provenance of it, you cannot ignore the fact that he probably had somewhere in his DNA this belief that it would enhance his standing with Allah, or at least advance Allah’s cause of imposing on everybody  —   Muslim and   alike, by the way  —   this toxic ideology of sharia,” said Gaffney. “I’ve had it, frankly, with these guys in law enforcement who are willfully blind,” he exclaimed. “We respect people doing their duties, God knows, but when they incessantly repeat this like it’s some kind of incantation, it’s a disservice to the public, and it suggests malfeasance on their part in terms of protecting us from these kinds of threats. ” Marlow next asked Gaffney about reports that the first “DREAMer”  —   a young illegal alien protected under President Obama’s extension of Deferred Action for Childhood Arrivals  —   has been deported under President Trump. Many view the deportation of people brought to the United States as children by their parents to be unfair, since the children had no say in the matter. Gaffney agreed with Marlow’s proposal that DACA provides an incentive for illegal aliens to bring their children across the border, so removing that incentive will help reduce the volume of illegal border crossings. “It is fundamentally about the rule of law,” Gaffney declared. “These happen to be particularly sympathetic characters. They didn’t, as you say, have a say in coming here  —   their parents brought them sometimes in utero, but nonetheless brought them here. As a result the Obama administration, and many Democrats, and a lot of Republicans for that matter, were kind of willing to look the other way as President Obama essentially waived the law and created new regulations that would enable them to stay here permanently. ” “I hope that this action isn’t one that will be countermanded by President Trump as he learns of it, probably from the news, having in the course of his campaign and I think subsequently said he would try to find a way to accommodate these people,” Gaffney continued. “It does come down to the magnet, and that’s what we’ve got to turn off. More people being attracted to come to this country  —   and I think to the extent that you can figure the kids at least will get a permanent place here, if you can get them across the border, is a magnet and should be turned off, along with the others. ” Marlow sought Gaffney’s take on the special referendum in Turkey that gave President Recep Tayyip Erdogan vastly increased powers, and secured him in office for over a decade to come. “What was shocking was that he very narrowly won, which suggests to me that he had to steal a lot of votes in order to get across the   mark,” Gaffney said. He saw Erdogan as “dead set on, and now one very important step closer to achieving, the caliphate that he has had his eyes set on since he was a young mayor in Istanbul. ” To that end, Gaffney recalled, Erdogan established an Islamist political party with his old ally Fethullah Gulen, who now lives in   in the United States, and is blamed as the mastermind of all Turkish unrest by Erdogan. “He’s trying to convert Turkey from a   basically secular,    democratic nation into one that is now increasingly just another dangerous Islamist republic,” he warned. “And that I think is going to be bad for the Turks, it’s for sure bad for Europe, and I think will be a real problem going forward, as it has been to an extent for a while now, for the NATO alliance. Because let’s recall they are a member of NATO. They are privy to its secrets. They have access to its technology. ”  “The fact that Erdogan is this president, now dictator effectively, is I fear going to be increasingly moving his country into alliances with the Islamic State, with   with the Muslim Brotherhood, with Russia, with China. It makes this a very serious problem for our security interests and those of the NATO alliance, he said. Gaffney said it was a mistake for President Trump to call Erdogan and “congratulate him on what is, in fact, a contested election. ” He was uncertain who recommended this course of action to Trump, but said “there are obviously lots of people in his administration who are inclined to think that if we just do more of what Obama did  —   which is try to romance, and accommodate, and even appease these sharia supremacists, and that’s what Erdogan is  —   that they’ll behave better. ” “I think that’s a mistake,” he judged. “I wish the president hadn’t made that call. But more to the point, I think we’re going to have to give some very serious thought, there is no institutional arrangement to decoupling a NATO ally from the alliance. We’re going to have to try to figure out how to do that because otherwise, I think we’ve got a potential enemy inside our huddle. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563096.5970829}