{"duration": 0.018858909606933594, "input_args": {"text": "'A United Airlines pilot was removed from a plane before a flight from Austin to San Francisco Saturday evening after going on a rant over the intercom system. [The pilot, who showed up late to her flight wearing “street clothes,” spoke to passengers “over the intercom about her divorce and the presidential election,” the Daily Mail reported.  “Sorry I’m late, the reason I’m late is I’m going through a divorce,” she said. Some of the pilot’s comments made passengers feel uncomfortable, “causing them to question her ability to fly the plane. ” Passenger Randy Reiss said the pilot seemed friendly at first, “but things took an awkward turn when she pointed out an interracial couple sitting in first class. ” “It quickly turned from playful to scary,” Reiss told BuzzFeed News. Passengers said the pilot said that she was going to be on Oprah and then commented on the 2016 presidential election. “Look, I don’t care if you voted for Trump or Clinton, they’re both assholes,” she said. She also said she would let her   fly the plane because he is a man, and she told passengers they could disembark the plane if they didn’t feel safe. “So I’ll stop, and we’ll fly the plane. Don’t worry. I’m going to let my   fly it. He’s a man,” she laughed. “Okay, if you don’t feel safe, then get off the airplane. But otherwise, we can go. ” Reiss left the plane after her outburst and wrote on Twitter that half the passengers on the plane followed suit. United Airlines spokesman Charlie Hobart said the pilot was removed from the flight and a new pilot and crew took her place. United Flight 455 was delayed for more than two hours before the plane took off from Austin. “We removed her from the flight, (and) we’re going to discuss this matter with her,” Hobart said, according to the   Statesman. “We were looking out for our customers to get them to where they needed to be. ”'"}, "time": 1742628475.177664}