{"duration": 0.047545671463012695, "input_args": {"text": "'How far can USA go to take revenge on Russia for \\'cybercrimes?\\' 07.11.2016 The United States continues an extremely aggressive campaign to accuse Russia of cyberattacks that may undermine confidence in the results of the US presidential election. US top officials have released quite a number of statements about possible responses to Russia that would at least create a stir inside the Kremlin. NBC has recently reportedб citing high-ranking sources in the US intelligence community, that US military hackers infiltrated the computer networks responsible for managing power supply and telecommunication systems of Russia. US hackers have reportedly gained access to \"Kremlin\\'s networks\" and made them vulnerable to cyber attacks from the United States. Presidential press secretary Dmitry Peskov, commenting on the report, said that the security of Russian computer systems was ensured in accordance with current threats. The Russian Foreign Ministry demanded an official reaction from the United States in connection with the NBC report. Print version Font Size \"The absence of an official response from the US administration would speak for the existence of state cyber-terrorism   . Should the threats be implemented, Moscow will have a right to bring appropriate charges against Washington,\" official spokeswoman for the Russian Foreign Ministry Maria Zakharova said. It is worth noting that NBC plays a leading role in the campaign about the response from the USA to the attacks from hackers working for the Russian intelligence and the Kremlin.\" In mid-October, US Vice President Joseph Biden told NBC about the elaboration of responsive measures against Russia. NBC later reported that the Obama administration was considering unprecedented covert operations against Russia in response to what US officials see as interference in the American presidential elections .\" Noteworthy, the head of NBC Universal Jeffrey Shell appears on Russia\\'s list of sanctioned persons. However, the report said that the US administration was engaged in the process to collect certain documents to \"discredit\" the Russian leadership. In general, however, this is exactly what the US and Western media have been doing during the recent four years. Generally speaking, the subject of external interference in US elections is a new feature of American election campaigns. To which extent is Russia prepared to respond to Washington\\'s threats? One may believe, of course, that all of this is simply a part of the election campaign. Yet, the subject of the \"Russian threat\" has become one of the central topics of Hillary Clinton\\'s campaign. Will it continue developing if she takes offices as president? Washington Post columnist David Ignatius wrote, for example, that Obama allegedly personally warned Vladimir Putin about the inadmissibility of interference in the American elections. The Russians have supposedly taken the warnings. This is just an example of the implementation of political technology. This technology seems strange for Russia, but it lives very well in the USA. A lot has been done for the purpose, and it does not look like the project is going to end after November 8. InfoWatch CEO Natalya Kaspersky believes that Russia should take the threats from the USA seriously. \"Technically, such attacks are possible,\" she told Pravda.Ru. \"We have pretty good protection systems. Unfortunately, it is difficult for Russia to resist to the US technology, because basic infrastructure elements are of American origin. No matter what methods of protection we may apply to a particular system, we will not be able to go as deep as we need if the system is of American origin. It will be hard struggle,\" she noted. \"Of course, we would need to have Russian software and preferably hardware at basic infrastructure elements,\" said Natalya Kaspersky. The head of Safer Internet centre Mark Tverdynin said that NBC reports were \"exaggerated.\" \"It is unlikely that someone has penetrated into our computer systems, because such attempts would be visible at once. If it had happened, our authorities would have reported about it. I think that Russia can show good resistance to such attacks. It appears to be a propaganda move,\" the expert told Pravda.Ru. \"Switching to domestic software and hardware is a must, of course, but it would require significant resources. We need to use the scientific and technical potential. This requires a priority attention, as this is a part of Russia\\'s national defense,\" the expert added. Oleg Artyukov Read article on the Russian version of Pravda.Ru US promises to attack Russia because of made up hackers'"}, "time": 1742628478.3761375}