{"duration": 0.038262367248535156, "input_args": {"text": "'Ready Nutrition October 27, 2016 \\nAt our house, back to school means back to kids bringing home germs. When the leaves start turning, I start reaching for my cough drops, feeling that all too familiar tickle in my throat. If I can, I try to drink tons of water, wash my hands like crazy, and keep the bug from taking hold. But once I know I’m past the point of no return, the following things can help cut the duration of my cold and get me back to my busy life. \\nDo you know how to tell the difference between a cold and a flu virus? \\nSleep Helps You Heal \\nYou probably know this already: one of you body’s first ways of signaling that all is not right internally is to make you very tired and sluggish. Don’t fight this feeling! Take a day or two off of work , if need be. Sleeping early and often during a cold can significantly cut the duration and intensity of a common cold. Sleeping allows your body to rest and recuperate—taking 10 hours of rest now could save you days down the line. Chances are you’ll pass out right away, but if you have trouble getting good sleep (particularly if your cold symptoms include coughing and congestion) put yourself in a dark, cool room with a white noise machine and a high-quality humidifier. \\nAvoid catchall cold medications that are high in alcohol. Even though these drugs might seem like they’re helping you pass out, what you need is good quality, REM sleep. Alcohol can disrupt your natural, restorative sleep patterns and leave you feeling groggy. If you’re certain you need some assistance with sleeping, some people swear by melatonin as a natural sleep aid. \\nExercise (Even If You Don’t Feel Like It) \\nSo, you’ve succumbed to a cold, you’ve slept a solid 8 hours and you’re still feeling under the weather. You should definitely skip your workout today, right? Wrong! Even though the LAST thing you probably feel like doing is slogging through your exercise routine, you don’t want to flake out altogether. Movement and respiration actually speed up the healing process (doctors believe working out causes immune cells to respond to and attack viruses at a faster rate). But instead of doing your normal intensity workout, try doing light cardio such as walking or even speed walking. Listen to your body—if it feels like you can do more, push yourself a little. If you fell like you want to die, dial it back. And of course, it’s not polite to spread germs at the gym, so taking a walk outdoors or at least avoiding a community treadmill is much appreciated.'"}, "time": 1742628404.683565}