{"duration": 0.0548403263092041, "input_args": {"text": "'Ulster’s Democratic Unionist Party, which is expected to prop up Theresa May’s minority government over the coming months, has spurned Tory Remainers who hoped they would force the Prime Minister to ask the EU for a   ‘Soft Brexit’. [According to ITV’s Robert Peston, a source within the DUP “was very keen to be quoted” as saying that his party “completely backs [May’s] vision of Brexit”  —   and not that of her Chancellor of the Exchequer, Philip Hammond.  While both May and Hammond campaigned for a Remain vote during the EU referendum, the Prime Minister has subsequently endorsed what supporters call a “Clean Brexit“ taking Britain out of the bloc’s Single Market and its associated Free Movement regime, as well as the Customs Union which precludes   from conducting an independent trade policy. Remain diehards, who want a ‘Soft Brexit’ in which Britain would remain party to the Single Market and Customs Union in order to maintain the closest possible links to the European Union, term this a “Hard” or “Extreme” Brexit. Hammond’s team at HM Treasury  —   the engine room of the Remain campaign’s ‘Project Fear‘ under his predecessor George Osborne  —   are said to have entered “  mode” as he canvasses support for such a deal. DUP backs Theresa May’s vision of Brexit, not Philip Hammond’s  —   ITV News https:  .   —   Robert Peston (@Peston) June 15, 2017,  If Peston’s source is reliable, however, it seems the ‘Soft Brexit’ faction have lost crucial leverage. It had been claimed that the DUP, which is keen to see a minimum of economic friction between Ulster and the Irish Republic after Brexit, would at least back their calls for Britain to stay in the Customs Union. The ITV presenter has been led to believe that the DUP is “100 per cent committed to the UK leaving the Single Market AND the Customs Union”  —   having preferred to use its bargaining power to press for plans to introduce   for the winter fuel allowance and scrap the pensions triple lock to be dropped. Leavers within the Government are predicting ferocious resistance to Brexit from without the Cabinet as well as within, with one minister predicting  “utterly bitter, trench warfare” as opposition politicians and Tory rebels “fight us line by line, in committees, on the floor and in the Lords, for months and months on end. ”'"}, "time": 1742563355.7357183}