{"duration": 0.11858987808227539, "input_args": {"text": "'KABUL, Afghanistan  —   Abdul Ali Shamsi had already covered a lot of ground before he moved to Kandahar Province to become deputy governor a year and a half ago. Mr. Shamsi was at the vanguard of a new generation of Afghan leaders. From an early job as a security guard in Kabul, he became a security expert in Helmand Province and moved up in the provincial government there. And he helped found the Afghanistan 1400 youth political movement, starting public campaigns to console victims of violence around the country and to raise support for Afghan governance. “These efforts have two impacts: One is we stand up against things we believe are wrong, but the other more important factor is we project courage,” he told The Guardian newspaper a few years ago, as he was spearheading an effort to clean up and reopen a lakeside picnic spot in Kabul after a Taliban attack. “We enable people to stand up against violence, people who in many ways have been passive because of fears instilled among the population. ” On Tuesday, Mr. Shamsi, 38, became a victim of the kind of violence he had helped others withstand, killed along with 10 other people when explosives placed within the Kandahar governor’s guesthouse detonated during a reception for visiting Arab officials. He was the third Kandahar deputy governor to be killed in the line of duty in just a few years, and he knew, in taking the job, that he would be just as much a target as his two predecessors  —   one a young poet and writer who was gunned down in a university classroom and, before that, an engineer who was killed by a suicide bomber on his way to work. The attack in Kandahar this week seemed expressly aimed at breaking down the cause that Mr. Shamsi and his colleagues were dedicated to: trying to restore faith in government after years of devastating war and disappointing failures. Among the dead were an Afghan senator and a member of Parliament, five officials from the United Arab Emirates and an Afghan envoy to the United States, according to officials. Eighteen others were wounded. The governor of Kandahar, Humayoon Azizi, and the ambassador of the United Arab Emirates, Juma Mohammed Abdullah   were among the wounded, but their injuries were not considered   said Gen. Abdul Raziq, the security chief of Kandahar Province. The president of the United Arab Emirates, Sheikh Khalifa bin Zayed   said in a statement that the officials were in Kandahar “to carry out humanitarian, educational and development projects. ” He ordered flags to be flown at   for three days of mourning in his country. The explosions in Kandahar capped a bloody day in Afghanistan. A bombing targeted a meeting of militia commanders in the Helmand provincial capital, Lashkar Gah, killing from seven to 11 people, according to various Afghan officials. Hours later, a double bombing that was claimed by the Taliban killed at least 38 people and wounded 86 others outside the Parliament during the early evening rush hour. Even by the standards of Kandahar, which has a long history of officials and elders being targeted in complex attacks over the years, the extent of the security breach raised questions. To get to the governor’s guesthouse requires passing through multiple security checks, and measures were so tight on Tuesday before the dignitaries’ visit that, according to one official, Mr. Shamsi’s own car was even searched. General Raziq said that an intense investigation into the attack was starting, and that the national security adviser was coming to Kandahar to lead the effort. In an interview, the police commander said the guesthouse had been under construction for months, with about three dozen workers coming to the site each day, raising the possibility that explosives could have been smuggled in that way. “We have detained several people who were working there, and they are under investigation,” General Raziq said. The general, who  has survived dozens of attacks himself, barely escaped this one. He said he had walked out of the hall to offer his evening prayers in the next room when the explosives went off. “I wasn’t finished with my prayers when the loud explosion occurred,” General Raziq said. “It shook the whole building, blew out the windows, and the entire hall was in flames that were out of control. ” Many of the bodies were burned beyond recognition, Afghan officials said. And despite the government’s formally declaring Mr. Shamsi among the dead, his brother, Fazal Bari Shamsi, said the family had yet to receive the body, which was awaiting DNA testing for identification. On Wednesday, tributes poured in after it was confirmed that Mr. Shamsi was among the dead. President Ashraf Ghani was described as openly grieving, remaining solemn through his morning meeting with aides and describing Mr. Shamsi’s death as a profound loss for the country. “This unfortunate and poor nation had such need for you,” wrote Baryalai Helmand in a Facebook post about Mr. Shamsi. “The martyrdom of youth like you breaks our back. ” Shaharzad Akbar, who was one of the founding members of Afghanistan 1400 along with Mr. Shamsi, posted another emotional tribute. “He always gave us morale  —   in the hardest days he was hopeful, and in the darkest moments patriotic,” Ms. Akbar wrote. “He was more experienced than most of us. With me, a much younger girl with much less experience, he would interact with such respect that it would put me to shame. ” The political group found itself developing a side specialty in trying to rebuild after violence. When a gruesome massacre took place in western Farah Province, Mr. Shamsi was among the group of young leaders who traveled to the province to console the residents of the shaken city. As the most experienced of the lot, having dealt with death and violence during his years in Helmand and the American troop surge, he often took the lead in those kinds of delegations. One of Mr. Shamsi’s first acts on the job the day he became deputy governor in August 2015 was to visit the elderly father of his assassinated predecessor, Abdul Qadeem Patyal, to pay his respects. Dawa Khan Meenapal, then the provincial director of culture in Kandahar and currently a deputy spokesman for Mr. Ghani, was with him. “It was the atmosphere of a funeral, especially after Patyal’s children came to the room,” Mr. Meenapal said about the visit. “The two deputy governors before him had been martyred. Shamsi knew that working in Kandahar meant being mentally prepared for that. ”'"}, "time": 1742563224.456564}