{"duration": 0.0633230209350586, "input_args": {"text": "'BERLIN  —   The bicentennial of the birth of Karl Marx was supposed to bring his hometown, Trier, Germany, an important exhibition about his life and an increase in tourism. But an offer from China to present the city with a nearly    bronze statue of Marx, the   intellectual who was one of the writers of “The Communist Manifesto,” is overshadowing the festivities a year before they begin. After months of discussion and more than an hour of lively debate, the City Council in Trier, in western Germany near the border with Luxembourg, decided on Monday to accept the gift from the Chinese government, by the sculptor Wu Weishan. However, the Council left open the thorny questions of how large it would be and where in the city it would stand. “Karl Marx is one of the most important citizens of this city, and we should not hide him,” the mayor of Trier, Wolfram Leibe, told the public broadcaster SWR before the vote. Statues of Marx, who was born in Trier on May 5, 1818, and later lived in Berlin, London and Paris, were common throughout Eastern Europe during the Cold War, and several still survive in Germany’s formerly communist eastern states, including in Berlin. But his birthplace, firmly in the former West Germany, has struggled with how best to remember its famous son. The city, which is on the banks of the Moselle River and in an important   area, has increasingly become a destination for tourists from China, but many residents are nevertheless uncomfortable with accepting a gift from the Chinese government. “China is not a free country, quite the opposite,” a Trier newspaper quoted Tobias Schneider of the Free Democratic Party in Trier as saying on Monday. “We could draw up a long list of human rights violations. Do we want to allow such a rogue regime to set up a statue of Karl Marx in the heart of our city?” The Chinese told city officials they were offering the statue to honor the bicentennial and as a symbol of the strong ties between the countries. The Chinese government agreed to cover about   of the cost of a pedestal for the statue and its installation, estimated at 105, 000 euros, or about $112, 000. But after word spread about the gift, many residents balked at the idea of a bronze version of the father of communism towering over the Simeonstiftplatz, the city’s square, which is named for a church that once stood there. City authorities erected a wooden   in the square to give residents an idea of how it might look. In the end, a majority of the Council voted to accept the statue, although perhaps a smaller version of it than was originally envisioned, with a final height to be determined later. It would be unveiled as part of the city’s attempt to   Marx’s work and the turbulent time in which he lived, through exhibitions and intellectual discussions. “This debate is less about human rights, aesthetics or location” of the statue, Richard Leuckefeld’s of the Green Party said. “It is about getting the city out of a predicament, because those responsible have failed to honor Karl Marx. ”'"}, "time": 1742561855.130116}