{"duration": 0.11153388023376465, "input_args": {"text": "'License DMCA \\nThe following was originally published in The Nation \\nThe \"Blob\" -- the epithet Obama speechwriter Ben Rhodes used to scorn Washington\\'s inbred, vainglorious, bipartisan foreign-policy elite -- is striking back. In a series of foreign policy reports designed to influence the incoming administration, Greg Jaffe of The Washington Post reveals , the Blob will publicly criticize Obama\\'s \"reluctance\" to exercise America\\'s military prowess and call for a more \"muscular,\" \"interventionist,\" assertive policy, from the South China Sea to the Russian border, but particularly in the Middle East. They are pumping for more war. \\nThe names are familiar -- former secretary of state Madeline Albright and former Bush national security adviser Stephen Hadley lead the Atlantic Council task force. Former Bill Clinton NSC adviser Brian Katulis and former Bush deputy secretary of defense Rudy deLeon are senior fellows at the Center for American Progress. The inescapable Martin Indyk heads a Brookings group of former top officials from Obama, Bush, and Clinton administrations. \\nThese are the apostles of American exceptionalism, from the neoconservatives who promoted the invasion of Iraq to the \"indispensable nation\" liberal interventionists who championed regime change in Libya. Virtually without exception, all supported Bush\\'s invasion of Iraq, the most catastrophic foreign policy debacle since Vietnam. Virtually without exception, none were held accountable for that folly. \\nThe reports -- and the Blob -- share two conclusions. They censure Obama for excessive timidity. \"There\\'s a widespread perception that not being active enough or recognizing the limits of American power has costs,\" the Post quotes Philip Gordon, a senior foreign-policy adviser to Obama until 2015. \"So the normal swing is to be more interventionist.\" - Advertisement - \\nAnd all favor ramping up US military activity -- on the Russian borders, in the South China Sea, and particularly in the Middle East, promoting no-fly and safe zones in Syria, more special forces, more aggressive use of air power, more military aid, and a more integrated security partnership. The objective is not only to defeat ISIS and Al Qaeda and its offshoots militarily, but to create order in war torn Iraq, Syria, Yemen, Libya, and Somalia, as well as to counter Iran and Russia in the region. \\nThe Obama years demonstrate the dangers of \"restraint\"? Say what? The Obama administration is currently fighting wars in five countries and bombing seven. It toppled Gaddafi in Libya and left the country in chaos. Its regime change campaign in Syria ended in a brutal civil war. It backs the Saudi ravaging of Yemen. It helped spark a street coup in Ukraine, and moved military forces to the Russian border, reviving a new Cold War. It has bolstered US naval forces in the South China Sea as part of containing China. US Special Forces were active in more than 100 countries last year. Obama has signed off on more weapons sales and transfers than Bush. None of this has worked out very well, but neither did George W. Bush\\'s \"damn the torpedoes\" policy. If Obama represents excessive restraint, may the gods save us from what comes next. \\nThe Blob still believes that America has the writ and the power to decide. We are \"indispensable,\" bearers of law and democracy at the end of a cruise missile. Our insurgents are by definition \"moderates.\" Our clients -- Israel, Egypt, Saudi Arabia, Jordan, Turkey, the United Arab Emirates, Oman, from military dictatorship to desert sheikdom -- have, in the words of the CAP Report, \"internal cohesion\" and domestic \"political legitimacy.\" Despite conflicting interests, they are allies against terror (even though some like Saudi Arabia provide significant funding for both the terrorists and the religious zealots that inspire them.) \\nFor the Blob, caution comes not in objective but in strategy. Only the most unhinged call for putting \"boots on the ground.\" This leads to a disconnect. They limit the military strategy -- to drones, air power, advisers, intelligence cooperation, military aid, training -- without trimming the objectives. It is hard to see this as anything other than a demented recipe for endless wars without victory. \\nIn this age of bitter partisanship, characterized by unrelenting Republican obstructionism in Congress and now Trump\\'s stoking America\\'s rancors, much attention has been paid to the dangers of division. But the utter failure of the center and the bipartisan elite has been neglected. In the Middle East and elsewhere, the Blob has driven us into one folly after another. Yet they still fill the highest offices and the most lavishly appointed think tanks. And they are still calling for more. - Advertisement - \\nAmerica\\'s civilizing movements -- civil rights, women\\'s, LGBT, the DREAMers -- have transformed this country. An emerging populist movement -- Occupy Wall Street, Bernie Sanders, the Fight for 15, fair-trade and financial-reform campaigns and more -- is on the march. Now we desperately need new thinking and a revived peace movement to take on the Blob and its endless wars. View Ratings | Rate It http://www.ourfuture.org \\nRobert L. Borosage is the president of the Institute for America\\'s Future and co-director of its sister organization, the Campaign for America\\'s Future. The organizations were launched by 100 prominent Americans to challenge the rightward drift ( more... )'"}, "time": 1742561963.0922117}