{"duration": 0.16584038734436035, "input_args": {"text": "'Taking the Woo-Woo Out of Meditation Oct 27, 2016 0 0 \\nWhich will it be? Zazen, Vipassana, Transcendental, Mantra, Dzogchen, Mindfulness, or one of the numerous other types of mediation? With everyone from business tycoons to sixth-generation monks practicing meditation, along with people like rapper, 50 Cent, publishing mogul, Rupert Murdock, singers, Sting, and Alanis Morisette – how do you pick through the woo-woo and get to the nitty gritty facts about a meditation practice? \\nFortunately, meditation has been proven beyond the fairy tale images of cross-legged sadhus, mendicants, sages and yogis peacefully serene in some verdant forest or awe-inspiring temple. There are now over 3,000 scientific studies on the benefits of meditation, with more coming to the fore all the time. \\nBoth alternative-medicine gurus and Harvard researchers alike have now picked apart various types of meditation to learn that it is more effective than just sitting still , but all it really amounts to is this: learning to do one thing, mindfully, at one time . \\nMeditation has been proven to boost immunity, reduce depression and anxiety, increase empathy, and boost creativity. It can even help improve emotional intelligence and help wounds heal faster. It isn’t a magic pill, but it might come close. \\nHere’s a shocking truth about meditation, though. It won’t solve all your problems. As Jack Kornfield, a man responsible for helping to popularize meditation in the West in the 1970s has written , \\n“While I benefited enormously from the training in the Thai and Burmese monasteries where I practiced, I noticed two striking things. First, there were major areas of difficulty in my life, such as loneliness, intimate relationships, work, childhood wounds, and patterns of fear that even very deep meditation didn’t touch. \\n“Second, among the several dozen Western monks (and lots of Asian meditators) I met during my time in Asia, with a few notable exceptions, most were not helped by meditation in big areas of their lives. Meditation and spiritual practice can easily be used to suppress and avoid feeling or to escape from difficult areas of our lives.” \\nHere’s what meditation will do for you. Meditation is like working out for the brain. If you flex a muscle often enough, it becomes stronger. For many of us, focus is transient. If we try really hard, we might be able to focus for a few minutes. Most of us really only concentrate on one thing at a time for seconds. T he average person thinks approximately 48.6 thoughts per minute, according to the Laboratory of Neuro Imaging at the University of Southern California. That adds up to a total of 70,000 thoughts per day . \\nNow ask yourself, among those many thousands of thoughts, which are constructive? Which are about the present moment, and not about hopes for the future or fears from the past? Which thoughts are happy? Which are sad? Which are helping you to achieve what you want in this lifetime, and which thoughts are holding you back? Do your thoughts help you to merge seemingly inconsistent facts in reality, or are they just a random mess which you can never seem to make sense out of? Are you regularly thinking calm, focused thoughts, or are they scattered? \\nWhile different types of meditation affect us variously, they all make lasting changes in the brain, no differently than if you were to practice playing the piano every day, or if you consistently went to the gym and lifted weights. For example: \\nVipassana meditation also known as insight meditation has this effect on the brain: It creates a thicker right insula which is involved in the cognitive-emotional processes which create greater empathy and self-awareness . The right temporal area of the brain has increased blood flow and activity. This area is responsible for the process of hearing . The right parietal area is greatly activated. This area of the brain is in charge of processing touch . Attention and focus are increased as evidenced by a thicker right frontal cortex. Brain wave changes include increased activity within the left-prefrontal cortex is associated with positive affect and happiness. People who suffer from depression tend to have underactivated left-prefrontal regions. Also, the sites “C3/C4” on a QEEG tend to become increasingly active during this type of meditation. These are areas within the motor system associated with moving your right hand. \\nTranscendental Meditation (TM) has a tendency to create restful alertness. This is what happens to the brain: The frontal lobes of the brain, associated with focused attention and advanced cognitive function become more active. The parietal areas of the brain become more active. This area of the brain is associated with spacial recognition of the awareness of objects in our environment. The major sensory area of the brain, the thalamus, becomes more activated in long-term TM practitioners. Activity in he basal ganglia, the area of the brain responsible for controlling voluntary motor movement, procedural learning, and emotion is decreased. Brain waves as measured by EEG’s with TM meditators include the increase and coherence of Alpha waves . Coherence simply means that the brain waves are being transmitted across both hemispheres of the brain, thus improving neural communication across a greater distance. This results in full-brain thinking. Alpha waves as a result of TM does not usually occur with other meditative practices. The ‘back’ or posterior of the brain tends to work more efficiently, with synchronization in these quadrants. Alpha synchronization may also serve as a “carrier” frequency for 20 Hz beta waves (cognition) and 40 Hz gamma waves (perception). \\nTibetan Loving-Kindness Meditation practitioners experience exactly more of the aim of their meditation – unconditional loving kindness. On brain scans, this shows up as: Decreased parietal activity. This area of the brain is responsible for our spatial orientation, and our visual attention . Frontal activity is increased. The left prefrontal cortex shows particular changes in this type of meditative practice, which translates as more positive emotions and greater self-control . Thalamus activity tends to increase (whereas in TM, activity in this area decreases.) Brain wave changes include a tendency to display higher than average amplitude of 40 Hz gamma waves. This phenomenon is associated with advanced perceptual functions, binding of information, as well as intelligence. Those who have mental deficits tend to elicit significantly less 40 Hz activity throughout their brain. Those who practice this type of meditation will also show more Gamma waves, most often associated with less of a ‘me’ focus, and the ability to engage in loving-kindness. Gamma waves tend to be synchronized within the frontal and parietal regions of the brain. This can lead to an enhanced ability to focus as well as states of emotional bliss. \\nSo, without the ‘woo,’ what can meditation do for you? It depends on what you are looking for. If you seek better focus, or more compassion, they are both benefits of a consistent meditative practice. There are additional meditative practices that build grey matter, and still more than can help with depression and pain or lower stress levels. Like any worthwhile endeavor, meditation takes practice. The results are dependent upon which brain muscles you build and flex.'"}, "time": 1742562184.1494863}