{"duration": 0.11977815628051758, "input_args": {"text": "'Andrew Walther, vice president of communications for the Knights of Columbus  —   the world’s largest Catholic fraternal order  —   joined SiriusXM host Alex Marlow for a special edition of Breitbart News Daily live from the Conservative Political Action Conference (CPAC) to discuss his   calling for Christian refugees from the Islamic State (ISIS) to be given priority consideration. [“I’ve been over to Iraq twice in the last year, the last time with Congressman Chris Smith, taking a look at how Christians were being overlooked by the aid program of the U. S. government, getting basically no money from the U. S. or the UN,” Walther said.  LISTEN: “What we’ve discovered and been advocating against at this point is that these people are really being left out,” he said. “ISIS came in, killed a lot of them, drove them all from their homes in Nineveh and elsewhere. The upshot of that was the U. S. just sort of stood by, did not have a plan for helping communities. ”  “Now I think we have the opportunity to change things,” said Walther. “These people faced genocide once, then they faced the sort of overlooking by the U. S. and now I’m told that there are signs that things are starting to change  —   that there’s a new openness among government officials there in Iraq, U. S. government officials, to helping these communities that have been overlooked for so long. ”  “How this happened was simply a matter of an argument that we have to take care of everybody, so all the money goes to the big camps,” he explained. “Christians don’t go to the big camps because, of course, they get persecuted and targeted for violence at the big camps, and so, as a result, they get nothing because there’s no thought about prioritizing, or even helping, or making sure that you don’t leave out these little communities that could disappear. In the case of Christians, their numbers have declined in Iraq by almost 90 percent in the last decade. ” Walther said he found some of the reactions to President Trump’s executive order on immigration “very confusing. ” “The idea that we would prioritize people for religious persecution  —   people who had suffered, in the case of several of these countries, genocide  —   and it was religious minorities in general, let’s be clear: It wasn’t just Christians. Yazidis, Mandaeans, Shabak  —   I mean, there were a lot of people that were targeted like this. When you look at that, and you see this reaction, you have to wonder if these people have missed the history lesson on what the U. S. has done for the past hundred years,” he said.  “After World War I, we prioritized the Christian community in the Middle East because it was almost completely destroyed by the Ottoman genocide of 1915 and ’16 and again in ’22. It was the U. S. that stepped in,   partnerships, the State Department was involved, the whole bit,” Walther explained.  “Second, after World War II, the U. S. takes an enormous number of Jewish refugees from Europe. Why? Not because there weren’t as many or more refugees from the German, French, and Italian populations, but because everybody understood that they had faced genocide, and they needed a special kind of priority. That didn’t mean that other refugees didn’t get in. It just meant that the Jewish refugees  —   and you can see this in the numbers  —   got some priority,” he said.  “Even more recently, you’ve had Democratic sponsorship of things like the Lautenberg Amendment, which prioritizes religious minorities from Iran, which are Christians, Jews, and those of the Baha’i faith,” he noted. “Suddenly, we have an executive order that says we’re going to prioritize religious minorities, and it’s the end of the world. I really don’t understand why that is, and I don’t understand why people don’t understand that this has been the U. S. policy for a very long time. ” Marlow quoted from Walther’s   a passage in which he noted that only   of one percent of Syrian refugees admitted into the U. S. in 2016 were Christians, even though they make up ten percent of the Syrian population. “Certainly, it’s a de facto inequity, and I think you’ve seen a lot of the    —   I was looking at one this morning  —   that are making the case that refugees from other countries are getting in at a greater rate. Christians are getting in from Iran, Iraq, and these other places, so what the president said about Syria is wrong,” said Walther.  “No, what the president said about Syria is actually right. It has been very hard for Christians to get in,” he argued. “A lot of people are saying that it’s not really discrimination they don’t want to come in. I got an email two days ago from the Syriac Catholic patriarch, who I would imagine knows what’s going on with his people, who tells me they do want to get in. They’re applying for refugee status, and they never hear back from places like the U. S. and Canada. They’re ignored, or they’re rejected. So which is it? I’ve got to believe that he knows what he’s talking about. ”  “I was with the archbishop of Aleppo two years ago. He stood on our stage, and he said, ‘What’s happening, in terms of the refugee system, is unjust.’ I think these guys who are living in places like Aleppo know what’s going on,” he said. Walther was confident the CPAC audience understands “the importance of protecting religious minorities around the world, the importance of human rights” and that “threats to human rights can have a religious nature. ” “I think that people here also, you see there is support in the polling, and there is support in general, I think especially in groups like this, for making sure that we don’t overlook these minorities in the Middle East,” he added. Marlow asked if the Knights of Columbus have experienced any decline in membership or influence due to the “secularization of America. ” “No, we have found a consistent way to grow for   years,” Walther replied. “The fact of the matter is that I think people get excited about the kinds of things we do. They get excited about the work we do on the   issue. They get excited about the work that we do in communities around the country to help our neighbors. They get excited about issues like helping Christians in the Middle East. The persecution of Christians in the Middle East gets our guys fired up. ” “We’ve raised more than $12 million for these people on this issue,” he announced. “I think we have a very strong network in the U. S. and also internationally, of guys that are really committed to their faith and also to helping in a variety of ways. ” When Marlow asked how much of a setback the eight years of Obama were for the cause of helping persecuted Christians in the Middle East, Walther cited criticism from his friend the Archbishop of Erbil that “it was a mistake for your country to come here in 2003, and it was a bigger mistake for you to leave in 2011. ” “He’s the guy taking care of 100, 000 Christians in Erbil,” he noted. “You have a situation where once this happened in 2014, once ISIS rolled through, the U. S. basically did nothing for these minority communities. We let them die. We let the ISIS program of dechristianization and sort of radicalizing of the region just occur without any kind of input. We let the Yazidis go. We let the Mandeans go. All of these little groups that have been there for thousands of years were not prioritized, were not even paid attention to. This was a story that I heard over and over there. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the full interview audio above.'"}, "time": 1742563167.0892045}