{"duration": 0.18528342247009277, "input_args": {"text": "'November 20, 2016 at 6:09 pm \\n“She well documents everything.The history in these United States as well as elsewhere is all an illusion,people are trapped in a matrix.” \\nYou say this as if existence itself is NOT an illusion. It very well could be. How would we know? glitter 1 November 21, 2016 at 2:43 pm \\nEd_B, \\n“You say this as if existence itself is NOT an illusion. It very well could be. How would we know?” \\nYou know by now where I’m coming from.People,the inhabitants on this planet are born,they live and die,never truly understanding how they/we got here,the purpose/meaning of life and where they/we are going once the last breath is taken. Here is my simplest answer/response: \\nJohn 14:6King James Version (KJV) \\n6 Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me. \\nIt’s either true or a lie.It can be accepted as such or rejected. Eric \\nActually I already knew about Graham. Was a little shocked about Nixon. But not really. \\nThis is a BIG CLUB. And you ain’t in it. Guido November 19, 2016 at 3:26 am · Reply \\nFor those in the alt-media who were already on the anti-Trump bandwagon long before Trump won the election, NOBODY he proposes to man his cabinet (whether allegedly or actually) will pass their litmus test. They will be sure to find fault with EVERY one of his selections or rumored selections, and then revel in their own “brilliance” by telling us in their articles, videos and posts that they warned us. Essentially, Trump’s alt-media critics are doing the job of the MSM, who on the very next day after Trump won the election went on a tear about how he was planning on staffing his cabinet with insiders. \\nIt’s clear that those who engage in this sort of “reporting” are intent on disrupting Trump’s support base by giving the impression that he is defaulting on his promises and engaging in business as usual. I’m dubious of anyone who engages in perpetual rumor and speculation by relentlessly parroting names that are circulating about as part of an organized disinfo campaign. When the choices are made and announced, then we could fairly engage in worthy critique if need be. Every one of us is bound to find fault with at least someone in his cabinet. This is all completely normal because no reasonable person ever expected that his choices would be saints who were free of all unsavory baggage. But the key word here is REASONABLE, something that is sorely lacking these days. \\nIn so far as the aftermath of the election, the MSM seriously miscalculated the intelligence of the American people in the days following the election. They thought that by giving the pampered protesters carte blanche coverage, their support base would grow beyond all proportions as a mass anti-Trump movement swept the nation. Instead, the shattered hearts of the coddled candy-asses who lack the basic fortitude to handle defeat of ANY kind, has been laid bare for all too see. They are the poster children of everything that is wrong with the deviant and dysfunctional left in the US. The Purple Revolution is backfiring miserably as the nation is waking up to the reality that a minority of snot-nosed deplorables are attempting to rip the country apart at the seams. It ain’t gonna fly, no matter how much cash massa Soros pumps into their basket. \\nNo, the left isn’t quite dead yet, but it’s gasping for air. The cat’s out of the bag now, and the blowback that will come down the pike in the following months will leave no doubt as to what side of history this gaggle of miscreants will end up on when the final chapter is written. Ed_B November 20, 2016 at 6:55 pm · Reply \\n@Guido \\nAgreed. The back-stabbing has commenced and all the sore losers in our country are lining up to receive free blades from their masters. Perhaps it is they who could use some time in a “re-education camp”? \\nIt’s now clear all with an IQ above room temp that the MSM have completely sold their credibility for political access and favors, which leaves them with NOTHING of any value to sell. \\nBut all this is OK. Their complaining and whining will pale to insignificance when Trump succeeds with various promises he’s made. Not that he can keep them all, of course, but the general direction in which he moves will be a substantial improvement over the past 8 years. \\nSpeaking of idiots, lol… did you see where Obama was telling Trump that he “needs to be tough with the Russians”? I almost choked on my morning coffee over that one. The dish rag is counseling the pit bull on how to be tough! LOL!! Guido November 20, 2016 at 7:30 pm · Reply \\nEd, did you ever see that video where Barry is pretending to workout with weights? Tough? Not quite. What about that one where he’s throwing the first pitch at a major league ballgame? Not exactly my idea of toughness. Compare this pansy to footage of Vlad engaging in the martial arts, shooting firearms, riding horseback shirtless, or hobnobbing with that outlaw biker club in Russia (some of whose members volunteered to fight with the pro-Russian resistance in Ukraine after the US-led coup). Granted, it’s all theater, but it does get the point across in no uncertain terms. \\n8 years of Barry has been too much to take, but just think of the entire generation of numbskulls and meatheads who not only went through their formidable years while this fool played pretend at the White House, but actually cite him as one of their top influences and heroes. It’s no wonder these wanna-be community organizers and communist revolutionaries are prancing around the streets at professional protests chanting the trendiest slogans of the week. \\nOh well, at least mommy and daddy have a bit of free time to themselves while the kiddies are away playing dress-up. But they’ll be back to the basement soon enough. videoctr November 19, 2016 at 6:37 am · Reply \\nI like the idea of calling the alt-media, new media instead. I also like the idea suggested in this interview, to not only confiscate George Soros money and arrest him. Also, efforts should be made to go after the Rothschild globalists if they are connected with funding radical groups. Confiscate their wealth the same way drug dealers money is confiscated by the police. dcm November 19, 2016 at 9:43 am · Reply \\nHello Sean , My take away from this video which will challenge you . The interviewee espoused a core premise of modernism , when a person physiologically internalizes this concept , the process of natural or organic , if you will , understanding is diminished. Put hand in fire – hot it burns- etc . This psychological meme ( what is called modernism) is man made , a product of what is referred to as the “enlightenment” period historically . The names of the practitioners of this FALSE meme is recorded historical fact , as well the reason for the development of, and the spread of. My challenge for you is to search human history for societies that practiced infanticide as well societies that practiced sodomy , were there cultures that practiced both at the same time ? Or did one diminish and the other take over , or variations such as open human murder , referred to as human sacrifice. What was the out come of these cultures ? Millicent November 19, 2016 at 10:31 am · Reply \\nI decided to make a project of tracking some of the dumbest statements made on this blog… \\nWhen I saw Glitter make the “call” for December 2016 PM price points of $100 Silver and $3500 Gold back in February of 2016 I knew that I had a winner. \\nDecember will come & go and his “call” will not be even remotely close. Eric will keep yammering his psycho babble about books, how I’m stupid, etc., etc. but the the fact remains that Glitter did not have a clue about what he was predicting and somehow I will be blamed for calling him out and telling him he was a moron for making that “call”. \\nEric keeps asking why I say that he is being conned. Eric is so hopelessly immersed in the con that he has become a part of it and will probably never wake up to the fact. Eric \\nMillicent, \\nYou ARE stupid. I’m sorry I have to be the one to tell you. \\nNow can you at least have a little credibility and tell me what the con is? If you want to make a point, provide some information. \\nMonetary base and Fed’s balance sheet increased 5 fold. There’s no good reason why the Gold price won’t increase by at least the same amount. \\nDon’t forget to remember my speculative prediction of $2500 Gold/$60-$75 Silver by end of 2017. \\nToo bad you missed my Trump wins in a landslide if there is an election. Nailed that one. \\nMillicent = useless eater and comment critic. bt \\neric ,return email at [email protected] have message for you'"}, "time": 1742561659.694031}