{"duration": 0.14402341842651367, "input_args": {"text": "'WASHINGTON  —   By the time Richard B. Spencer, the leading ideologue of the   movement and the final speaker of the night, rose to address a gathering of his followers on Saturday, the crowd was restless. In 11 hours of speeches and panel discussions in a federal building named after Ronald Reagan a few blocks from the White House, a succession of speakers had laid out a harsh vision for the future, but had denounced violence and said that Hispanic citizens and black Americans had nothing to fear. Earlier in the day, Mr. Spencer himself had urged the group to start acting less like an underground organization and more like the establishment. But now his tone changed as he began to tell the audience of more than 200 people, mostly young men, what they had been waiting to hear. He railed against Jews and, with a smile, quoted Nazi propaganda in the original German. America, he said, belonged to white people, whom he called the “children of the sun,” a race of conquerors and creators who had been marginalized but now, in the era of   Donald J. Trump, were “awakening to their own identity. ” As he finished, several audience members had their arms outstretched in a Nazi salute. Mr. Spencer called out: “Hail Trump! Hail our people!” and then, “Hail victory!”  —   the English translation of the Nazi exhortation “Sieg Heil!” The room shouted back. These are exultant times for the   movement, which was little known until this year, when it embraced Mr. Trump’s campaign and he appeared to embrace it back. He chose as his campaign chairman Stephen K. Bannon, the media executive who ran the  ’s most prominent platform, Breitbart News, and then named him as a senior adviser and chief strategist. Now the movement’s leaders hope to have, if not a seat at the table, at least the ear of the Trump White House. While many of its racist views are well known  —   that President Obama is, or may as well be, of foreign birth that the Black Lives Matter movement is another name for black race rioters that even the   children of undocumented Hispanic immigrants should be deported  —   the   has been difficult to define. Is it a name for   political provocateurs in the internet era? Or is it a political movement defined by xenophobia and a dislike for political correctness? At the conference on Saturday, Mr. Spencer, who said he had coined the term, defined the   as a movement with white identity as its core idea. “We’ve crossed the Rubicon in terms of recognition,” Mr. Spencer said at the conference, which was sponsored by his organization, the National Policy Institute. And while much of the discourse at the conference was overtly racist and demeaning toward minorities, for much of the day the sentiments were expressed in ways that seemed intended to not sound too menacing. The focus was on how whites were marginalized and beleaguered. One speaker, Peter Brimelow, the founder of Vdare. com, an   website, asked why, if Hispanics had the National Council of La Raza and Jews had the   League, whites were reluctant to organize for their rights. Some speakers made an effort to distance themselves from more notorious white power organizations like the Ku Klux Klan. But as the night wore on and most reporters had gone home, the language changed. Mr. Spencer’s   speech began with a polemic against the “mainstream media,” before he briefly paused. “Perhaps we should refer to them in the original German?” he said. The audience immediately screamed back, “Lügenpresse,” reviving a   word that means “lying press. ” Mr. Spencer suggested that the news media had been critical of Mr. Trump throughout the campaign in order to protect Jewish interests. He mused about the political commentators who gave Mr. Trump little chance of winning. “One wonders if these people are people at all, or instead soulless golem,” he said, referring to a Jewish fable about the golem, a clay giant that a rabbi brings to life to protect the Jews. Mr. Trump’s election, Mr. Spencer said, was “the victory of will,” a phrase that echoed the title of the most famous   propaganda film. But Mr. Spencer then mentioned, with a smile, Theodor Herzl, the Zionist leader who advocated a Jewish homeland in Israel, quoting his famous pronouncement, “If we will it, it is no dream. ” The United States today, Mr. Spencer said, had been turned into “a sick, corrupted society. ” But it was not supposed to be that way. “America was, until this last generation, a white country designed for ourselves and our posterity,” Mr. Spencer thundered. “It is our creation, it is our inheritance, and it belongs to us. ” But the white race, he added, is “a race that travels forever on an upward path. ” “To be white is to be a creator, an explorer, a conqueror,” he said. More members of the audience were on their feet as Mr. Spencer described the choice facing white people as to “conquer or die. ” Of other races, Mr. Spencer said: “We don’t exploit other groups, we don’t gain anything from their presence. They need us, and not the other way around. ” The ties between the   movement and the Trump team are difficult to define, even by members of the  . Mr. Bannon was the chief executive of Breitbart, an online news organization that has fed the lie that Mr. Obama is a   Muslim. As recently as last year, Breitbart published an   article urging that “every tree, every rooftop, every picket fence, every telegraph pole in the South should be festooned with the Confederate battle flag. ” Mr. Bannon told  Mother Jones this year that Breitbart was now “the platform for the  . ” But in an interview last week with The Wall Street Journal, Mr. Bannon said that the   was only “a tiny part” of the viewpoint represented on Breitbart. “Our definition of the   is younger people who are   very nationalist, terribly ” he told The Journal, adding that the   had “some racial and   overtones. ” When asked about Mr. Bannon, the conference’s speakers said that they might have shaken his hand on occasion, but that they did not know him well. Mr. Brimelow said that he had met “Mr. Bannon once, earlier this summer, before he ascended to Olympus. ” He said he had told Mr. Bannon that he was doing great work at Breitbart. “He agreed,” Mr. Brimelow recalled to the audience. As for Mr. Trump, Mr. Brimelow said he had met him about 30 years ago at a “conservative affinity meeting” in Manhattan. But that was it. “Trump and Steve Bannon are not   people,” Mr. Brimelow said, adding that they had opportunistically seized on two issues that the   cares most about  —   stopping immigration and fighting political correctness  —   and used them to mobilize white voters. Mr. Spencer said that while he did not think the   should be considered   “I do think we have a psychic connection, or you can say a deeper connection, with Donald Trump in a way that we simply do not have with most Republicans. ” White identity, he said, is at the core of both the   movement and the Trump movement, even if most voters for Mr. Trump “aren’t willing to articulate it as such. ” At various points, he and other speakers outlined where they differed from Mr. Trump. They see him as too beholden to Israel. They do not see any reason to start a trade war with China, and they are not necessarily opposed to the Iran nuclear deal. For them, immigration is the most potent mobilizing issue, less for economic reasons than because of the prospect that white Americans will someday represent less than half of the population of the country. For the   the most exciting thing about Mr. Trump was that he built a campaign around the issues that mattered most to them, and that white people had voted for him in numbers that left the political establishments of both parties stunned. Now, Mr. Spencer said, it is up to the   to formulate the ideas and policies to guide the new administration. “I think we can be the ones out in front, thinking about those things he hasn’t quite grasped yet, who are putting forward policies,” Mr. Spencer said, that “have a realistic chance of being implemented. ”'"}, "time": 1742562697.4309597}