{"duration": 0.09396982192993164, "input_args": {"text": "'Dissidents participating in what Venezuela’s opposition dubbed the “mother of all protests” Wednesday faced gang attacks, tear gas, and other repressive tactics by state police and civilian militias alike. [Dictator Nicolás Maduro announced a plan Monday to arm as many as one million chavistas seeking to join   gangs on Tuesday in anticipation of the protest.  Addressing a socialist rally on Monday, Maduro announced he would begin expanding the ranks of the National Bolivarian Militia, a creation of late dictator Hugo Chávez meant to arm radical socialists in a nation where legally owning firearms outside of such groups is banned. According to the Fox News report on the rally, Maduro said he was seeking to quadruple the militia’s size from its current 100, 000 membership in the short term. The Spanish newspaper El País reported that Maduro was seeking to build a   militia as soon as possible but ultimately sought a   army of socialists to intimidate the opposition into silence. “We will advance towards the organization and training of one million organized militiamen, trained and armed to defend peace, sovereignty, and the independence of the nation,” Maduro reportedly said. To calm the military, which the opposition has been actively courting into participating in the resistance, Maduro has also announced something he is calling the “Zamora Plan,” which   Presse (AFP) describes as “a military, police and civilian operation aimed at combatting a supposed coup attempt” organized by America. Maduro has repeatedly accused the United States generally, and former Vice President Joe Biden specifically, of organizing a   coup against him. He has never produced proof of such a conspiracy. Maduro has faced growing protests since the   Supreme Court attempted to impose itself as the nation’s legislative body last month, nullifying the power of the   National Assembly. After a wave of protests, the Supreme Court backed down on the ruling, but the government nonetheless prevented legislators from entering the assembly for some days. Following this move, the government also banned Henrique Capriles Radonski  —   the governor of Miranda state and opposition presidential candidate in the past two elections  —   from holding public office for 15 years, with little explanation. Capriles is among the leaders organizing Wednesday’s “Mother of All Protests,” meant to bring together the   opposition throughout the country to demand Maduro step down. According to the AFP, the opposition plans “to march from 26 rally points toward central Caracas, a   bastion and the seat of government. ”   “We’re scared but we’ve got to do this,” one protester,    Carmen Medina, told Reuters. “We’re marching for the freedom of our country. ” Speaking to the outlet, Capriles added that he sees the Maduro regime as being “terminal” and protests pivotal to holding “free and fair democratic elections. ” The protest appears to have taken its first victim, a student identified as Carlos José Moreno, either 17 or 19 years old. Moreno was shot in the head in the San Bernardino neighborhood of Caracas, and reports indicate he was not participating in the protest. Witnesses say he was shot in the head by colectivos, unofficial roving gangs who attack protesters on behalf of Maduro. Warning: Graphic Images, #URGENTE: Momento en que se llevan al borde de la muerte a joven de 19 años herido de bala en Plaza La Estrella en San Bernardino #Caracas pic. twitter.   —   Yusnaby Pérez (@Yusnaby) April 19, 2017,  VIDEO FUERTE, Ejecutado Carlos José Moreno de 19 años, recibió un disparo en la cabeza en San Bernardino pic. twitter.   —   Venezolano en pie (@venezolanoenpie) April 19, 2017,  #URGENTE: Herido de bala manifestante en la plaza La Estrella en San Bernardino #19AVzlaContraLaDictadura #Caracas pic. twitter.   —   Yusnaby Pérez (@Yusnaby) April 19, 2017,  La mancha de nuestra bandera. .fue muerto un manifestante opositor en plaza la estrella de san bernardino.. pic. twitter.   —   TODOS ala CALLE (@JaimeOlarte13) April 19, 2017,  In addition to colectivo attacks, police used tear gas and rubber bullets on protesters. Capriles himself posted video of a tear gas attack on himself on Twitter. Continúa la fuerte represión  en la autopista https:  .   —   Henrique Capriles R. (@hcapriles) April 19, 2017,  Among the prominent dissidents protesting was also Lilian Tintori, wife of political prisoner Leopoldo López, who sported a gas mask to protect from tear gas attacks. “We want freedom for all political prisoners, and the people should decide their destiny with a vote. We want to vote,” Tintori said in a statement. “We want elections now. Presidential, gubernatorial, and mayoral elections. ” Tenemos 45 minutos resistiendo. Nos reprimen con bombas la guardia nacional. Seguimos, no nos cansamos, Vamos Venezuela! pic. twitter.   —   Lilian Tintori (@liliantintori) April 19, 2017,    Lilian Tintori acompaña la movilización desde la avenida Paéz en El Paraíso, #19AxVIVOplay https:  .  pic. twitter.   —   VIVOplay (@vivoplaynet) April 19, 2017, '"}, "time": 1742563461.0191417}