{"duration": 0.06243753433227539, "input_args": {"text": "'Home / News / Madonna Says She’ll Give A Blowjob To Anyone That Votes For Hillary Clinton (VIDEO) Madonna Says She’ll Give A Blowjob To Anyone That Votes For Hillary Clinton (VIDEO) Heisenberg 1 min ago News Comments Off on Madonna Says She’ll Give A Blowjob To Anyone That Votes For Hillary Clinton (VIDEO) Pop star Madonna got raunchy while introducing comedian Amy Schumer at a performance in New York City Tuesday night, promising the crowd sexual favors in exchange for their support of Democratic presidential candidate Hillary Clinton. \\n\\n“If you vote for Hillary Clinton, I will give you a blowjob. OK?” the 58-year-old Rebel Heart singer told an audience at New York’s Madison Square Garden Tuesday night. “I’m really good. I’m not a douche, and I’m not a tool. I take my time, I have a lot of eye contact, and I do swallow.” \\nThe comments came as Madonna warmed up the crowd with a very brief standup set ahead of the Trainwreck star’s performance at the Garden Tuesday night, according to the New York Daily News . \\nSchumer took the stage afterward for her first stand-up gig since hundreds of supporters of Republican candidate Donald Trump stood up and walked out of her performance in Tampa, Florida earlier this week after the comedian called him an “orange monster.” As Breitbart previously reported, Shumer was widely booed during the performance at Tampa’s Amalie Arena, where she instructed security to remove hecklers. \\nDuring her performance Tuesday night, Schumer read aloud a letter she composed in response to the Trump fans who walked out on her show in Tampa. \\n“Dearest Tampa, I’m sorry you didn’t want me, a comedian who talks about what she believes in, to mention the biggest thing going on in our country right now,” Schumer said, adding: “How could I think it was OK to spend five minutes having a peaceful conversation with someone with different views? After the show, I want you to know that I will go straight to a rehab facility.” \\nThe comedian added that she looks forward to “putting this all behind us” in November, when “ Hillary Clinton is our motherf*cking president.” \\nMadonna has previously used sex appeal to drum up support for the Democratic presidential candidate; in September, the singer joined fellow pop star Katy Perry in stripping off her clothes to encourage Clinton voters to head to the polls in November. '"}, "time": 1742564247.6182375}