{"duration": 0.07868576049804688, "input_args": {"text": "'AMMAN, Jordan  —   The last surviving animals in the Montazah   Zoo in the   Iraqi city of Mosul  —   Lula, a bear, and Simba, a lion  —   reached safety at a wildlife shelter in Amman, the Jordanian capital, on Monday night. Their home at the zoo was severely damaged as battles for control of the city, Iraq’s second largest, have raged for months between Iraqi forces and Islamic State militants. A   people are thought to be unable to escape the city. The Islamic State has used civilians as human shields, and American airstrikes, supporting Iraqi counterterrorism forces, have leveled parts of Mosul. A strike in one neighborhood last month was thought to have killed as many as 200 civilians. About 40 animals had died at the zoo in recent months. Some starved and some were killed by bombs, according to Four Paws International, an animal welfare organization based in Vienna that carried out the rescue. Workers said that the animals’ cages were filthy and that Simba and Lula urgently needed veterinary care. Amir Khalil, a veterinarian with Four Paws who led the rescue mission, called it an “authentic odyssey. ” The animals, he said, will now have proper food and medical care, “without living in constant danger of a nearby war zone and noise of bomb blasts in the background. ” Mr. Khalil visited the Mosul zoo in February to check on the animals and organize regular feedings for them. His group’s previous attempt to rescue the two animals failed when workers carrying them were stopped at a checkpoint. The aid workers were asked to leave Mosul. Lula and Simba were sent back to the zoo. “We never got to know the exact details why we were not allowed to pass, but, of course, transporting large wild animals in an area with such a complex political situation is not easy,” Mr. Khalil said Wednesday in a telephone interview. Mr. Khalil said Islamic State militants had been at the zoo and had painted over a sign with the animals’ faces. He said he had heard criticism about his attention to the animals at a time when so many people were suffering. “I like this kind of criticism,” he said, “because in my opinion humanity cannot be divided. ” He said Simba and Lula were a symbol of that humanity. “War rages on but all those fighting cannot ignore animals, put them in a cage, starve them to death, deprive them of water,” he said. Simba and Lula’s new home will be the New Hope Center, the biggest wildlife shelter in the Middle East.'"}, "time": 1742564523.7676594}