{"duration": 0.05839991569519043, "input_args": {"text": "'WASHINGTON  —   Senate Republicans on Thursday engineered a dramatic change in how the chamber confirms Supreme Court nominations, bypassing a Democratic blockade of Judge Neil M. Gorsuch in a move that will most likely reshape both the Senate and the court. After Democrats held together Thursday morning and filibustered President Trump’s nominee, Republicans voted to lower the threshold for advancing Supreme Court nominations from 60 votes to a simple majority. In deploying this   nuclear option, lawmakers are fundamentally altering the way the Senate handles one of its most significant duties, further limiting the minority’s power in a chamber that was designed to be a slower and more deliberative body than the House. The move, once unthinkable among senators, is a testament to the creeping partisan rancor in recent years, after decades of at least relative bipartisanship on Supreme Court matters. Both parties have warned of sweeping effects on the court itself, predicting the elevation of more ideologically extreme judges now that only a majority is required for confirmation. Senate Democrats in 2013 first changed the rules of the Senate to block Republican filibusters of presidential nominees to lower courts and to government positions. But they left the filibuster for Supreme Court nominees untouched, an acknowledgment of the court’s exalted status. On Thursday, that last pillar was swept away on a   vote, with all 52 Republicans choosing to overrule Senate precedent and all 48 Democrats and   independents pushing to keep it. For weeks, the demise of the Supreme Court filibuster had seemed preordained  —   like a moldering stadium with a demolition date  —   even as members lamented the inevitability as a low moment for the Senate. In recent days, faint rumblings of a deal to avert the clash had faded almost entirely. Democrats placed the blame squarely on Senator Mitch McConnell of Kentucky, the majority leader, and his Republican colleagues, who last year refused to even consider Judge Merrick B. Garland, President Barack Obama’s nominee for the seat of Justice Antonin Scalia, who died nearly 14 months ago. “When history weighs what happened, the responsibility for changing the rules will fall on the Republicans’ and Leader McConnell’s shoulders,” said Senator Chuck Schumer of New York, the Democratic leader, who had called for the withdrawal of the nomination if Judge Gorsuch could not earn 60 votes. “They have had other choices,” he added. “They have chosen this one. ” Lawmakers first convened late Thursday morning to decide whether to advance the nomination. Republicans needed 60 votes  —   at least eight Democrats and independents joining the   majority  —   to end debate on the nomination and proceed to a final vote. Only a handful of Democrats defected, leaving Republicans to choose between allowing the president’s nominee to fail or bulldozing   Senate practice. The final confirmation vote is set for Friday. Republicans argued that changing the rules to push through the nomination was their only option, accusing Democrats of razing Senate norms with the   successful partisan filibuster of a Supreme Court nominee. Allowing this obstruction to stand, Republicans said, would have caused more damage than overriding Senate precedent to turn back the filibuster. “This is the latest escalation in the left’s   judicial war, the most audacious yet,” Mr. McConnell said, after describing Democratic opposition in the past to Judge Robert H. Bork and Justice Clarence Thomas. “And it cannot and it will not stand. There cannot be two sets of standards: one for the nominees of the Democratic president and another for the nominees of Republican presidents. ” But Democrats had shown no signs of forsaking their filibuster plans all week. Their stance has pleased their most progressive voters, who have preached resistance to Mr. Trump at every opportunity. Critics of Judge Gorsuch said they had identified ample reasons to oppose him, chafing at the suggestion that Democrats are merely seeking payback for Judge Garland. They cited concerns over Judge Gorsuch’s record on workers’ rights and wondered whether he could be reliably independent from Mr. Trump and conservative groups like the Federalist Society, which pushed his nomination. But at times on Thursday, it was difficult to escape the conclusion that Judge Garland loomed largest in the minds of Democrats. After Mr. McConnell suggested from the Senate floor that Republicans had given due deference in the past to Supreme Court nominees under Democratic presidents, Senator Richard J. Durbin, Democrat of Illinois, could not suppress a rebuttal. “There must have been a hacking into his computer,” he said of Mr. McConnell, “because he can’t print the name Merrick Garland to include in the speech. ” Mr. Durbin later said that both Mr. McConnell and Judge Gorsuch would “enter the history books with asterisks by their names. ” And in a performative flourish of parliamentary inquiry, Mr. Schumer seized the floor to ask if any rules or precedents prohibited the Senate from “considering and voting on a nominee to the Supreme Court in the fourth year of the president’s term”  —   the   justification for denying Judge Garland even a hearing. “The chair is not aware of any such prohibition in its rules or precedents,” replied Senator Deb Fischer, Republican of Nebraska, who was presiding in the chamber at the time. For Mr. McConnell, who could be seen doling out   among lawmakers and aides after the votes, Thursday’s proceedings amounted to a gamble rewarded. Last year, Democrats had hoped to make Republicans pay at the ballot box for their treatment of Judge Garland. Instead, they will watch on Friday as a conservative jurist is confirmed for a lifetime appointment, with no power to filibuster nominees for future vacancies. Judge Gorsuch will be taking the seat of one of the court’s most reliably conservative justices. A   replacement for Justices Ruth Bader Ginsburg, 84, Anthony M. Kennedy, 80, or Stephen Breyer, 78, would herald a significant ideological shift for the high court. “They had a right to do what they did,” Senator Orrin G. Hatch of Utah, the body’s   Republican, said of the Democrats’ filibuster. “I just thought it was stupid. ” Other lawmakers sounded graver notes on Thursday, even as members of both parties dismissed any suggestion that a majority party might one day pursue more drastic remedies, like removing the filibuster on legislation. Senator Benjamin L. Cardin, Democrat of Maryland, said he was now serving an institution in “suffering,” with no clear direction as the parties lurched toward a deeper mutual resentment. “Where we go from here, it’s hard to tell,” he said. “Will there be further erosions or not?” He was asked if this might prove a turning point, a moment for doubling back. “We’re pretty early in this Congress,” he said. “So there’s plenty more time for more harm to be done. ” Despair was bipartisan. Senator Susan Collins, Republican of Maine, said she had strained over the last several days to broker an agreement to head off the filibuster and nuclear option. By all accounts, the senators hoping for such a compromise did not come particularly close. “There is such a profound lack of trust between the two parties,” said Ms. Collins, the rare Republican last year who supported holding a hearing and a vote on Judge Garland. “It’s hard to know whether the polarization in the Senate reflects the country or whether the polarization and divisiveness in the Senate affects the country. ” She paused for a beat, a few feet from Mr. McConnell’s office. “Well, it clearly affects the country,” she said. “But which causes the other is at times hard to discern. ”'"}, "time": 1742628539.183732}