{"duration": 0.041257381439208984, "input_args": {"text": "'The Fall of the Saudis, the Battle after ISIS ‹ › Ian Greenhalgh is a photographer and historian with a particular interest in military history and the real causes of conflicts. His studies in history and background in the media industry have given him a keen insight into the use of mass media as a creator of conflict in the modern world. His favored areas of study include state sponsored terrorism, media manufactured reality and the role of intelligence services in manipulation of populations and the perception of events. Iraqi Army Discovers US-Made Missiles in ISIS’s Military Base in Mosul By Ian Greenhalgh on November 2, 2016 Iraqi Army Discovers US-Made Missiles in ISIS’s Military Base in Mosul Iraqi Army Discovers US-Made Missiles in ISIS’s Military Base in Mosul \\nIraqi army and popular forces have discovered a number of US-made missiles from a military position of the ISIS (ISIL, IS, Daesh) in the Southern part of Mosul, informed local sources disclosed after the first group of pro-government troops opened their way into Southern Mosul on Monday. \\n“Several US-made missiles were found in al-Shoura region to the South of Mosul,” a local source said on Monday. \\nThe Iraqi army and popular forces had found US-made missiles in Anbar province several times before. \\nProvincial officials confirmed that the US-made weapons were sent by the US-led anti-ISIL coalition airplane for the ISIL terrorists in Anbar province. \\nMeantime, Iraqi security officials announced that the ISIL has sent US-made military equipment to Tal Afar region in the last two days to stand strong against Iraqi popular forces’ impending attack to capture the region. \\n“The ISIL terrorists have sent US-made TOW anti-tank missiles to Tal Afar and it is quite evident that they are preparing for a long-term war,” the Arabic-language media quoted an Iraqi security official as saying on Monday. \\nIn late August 2015, a senior Iraqi intelligence official revealed that the US helicopters drop weapons and other aids for the ISIL terrorists in the Western province of al-Anbar. \\n“The fighters present at the forefront of fighting against the ISIL always see US helicopters flying over the ISIL-controlled areas and dropping weapons and urgent aids for them,” the official who called for anonymity told FNA. Yet, he said the helicopters could have also been sent from Turkey or Israel. \\nHe added that in addition to dropping aids, the helicopters transfer the ISIL ringleaders and wounded members from the battleground to some hospitals in Syria or other countries which support the terrorist group. \\nThe official cautioned that such assistance further prolongs the conflicts in Anbar, adding that when the Iraqi army and popular forces purge the terrorists from Anbar province, the US helicopters will transfer the ISIL ringleaders to other regions to prevent the Iraqi forces’ access to ISIL secrets. \\nAlso in March 2015, a group of Iraqi popular forces known as Al-Hashad Al-Shabi shot down the US Army helicopter that was carrying weapons for the ISIL in the Western parts of Al-Baghdadi region in Al-Anbar province. \\nMeantime in February 2015, a senior lawmaker disclosed that Iraq’s army had shot down two British planes as they were carrying weapons for the ISIL terrorists in Al-Anbar province. \\n“The Iraqi Parliament’s National Security and Defense Committee has access to the photos of both planes that are British and have crashed while they were carrying weapons for the ISIL,” al-Zameli said. Related Posts:'"}, "time": 1742628455.7236776}