{"duration": 0.09542465209960938, "input_args": {"text": "'George Michael, the English songwriter and pop star who died at 53 on Sunday, was a reliably outstanding live performer, though after a world tour promoting his album “Faith” in 1988 and 1989, he turned away from the road. He never gave his 1990 album “Listen Without Prejudice Vol. 1” a proper tour, instead performing a set of cover songs in 1991 before he took a lengthy break from the road. He returned to the stage in 2006, and reached the United States two years later with a show that demonstrated he had no intention of becoming an oldies act, as The New York Times’s chief pop, critic Jon Pareles, wrote at the time. Here are five performances from 1985 to 2008 that showcase Mr. Michael’s range as a live artist: [ Why George Michael mattered | Read the obituary ] “Don’t Let the Sun Go Down on Me,” George Michael and Andrew Ridgeley with Elton John at Live Aid, 1985 In 1991, a live version of George Michael and Elton John’s duet, written by Mr. John and Bernie Taupin, reached No. 1 in the United States and Britain. But the duo had performed it live for the first time six years earlier during Mr. John’s set at Live Aid, where he introduced Mr. Michael as someone he admired “very much for his musical talent, more than anything else. ” In his trademark sunglasses and leather jacket, Mr. Michael commanded the stage  —   so much so that at the 4:30 mark, Mr. John starts grinning and pointing at Mr. Michael with approval and pride. “Somebody to Love,” George Michael and Queen at Wembley Stadium, 1992 An array of artists appeared alongside Queen to honor the band’s frontman at the Freddie Mercury Tribute Concert for AIDS Awareness, including Axl Rose, Liza Minnelli, David Bowie and Seal. But Mr. Michael’s performances at the event were particularly inspired  —   in 1993, he released an EP of live tracks from the show, including “Somebody to Love,” the 1976 Queen song with a swooping vocal line that beautifully displayed Mr. Michael’s silky range. “Freedom! ’90” at the MTV Europe Awards, 1994 George Michael performed twice at the MTV Europe Awards in 1994. He opened the show with this exuberant rendition of “Freedom! ’90,” and then returned to debut the far more somber “Jesus to a Child,” a tribute to his partner, Anselmo Feleppa, who had died of an   illness. The first performance put the spotlight on Mr. Michael’s energetic showmanship. The arrangement accentuated the song’s soulfulness, with a chorus of backup singers approximating an ecstatic choir, especially as Mr. Michael moved into the song’s bridge around the   mark. “Everything She Wants” on “MTV Unplugged,” 1996 Mr. Michael was always as comfortable stripping his songs down to their bare elements as he was gliding across a stage shaking his hips (an acoustic guitar was perhaps the most memorable weapon in his arsenal, thanks to “Faith”). In his “MTV Unplugged” performance, he gave this Wham! hit a remake with eight powerhouse backup singers. “Careless Whisper” at Earl’s Court, 2008 Mr. Michael returned to live performance in 2006 for his first extensive run of live shows in 15 years. The tour, which stretched into 2008, was billed as a sort of 25th anniversary concert, and it featured songs from across his career, including “Too Funky,” “Father Figure” and “Kissing a Fool. ” Each leg of the tour, however, included “Careless Whisper,” one of Mr. Michael’s biggest hits. The only crime here is that the crowd shouts the majority of the     bridge: At the 2:36 mark, Mr. Michael generously lets the audience take the lead with “you know you want to!”'"}, "time": 1742564275.8309498}