{"duration": 0.07877063751220703, "input_args": {"text": "'MOSCOW  —   Russian lawmakers on Wednesday moved to decriminalize some forms of domestic battery for   offenders who do not do serious physical harm to their victims. Members of the State Duma passed the controversial amendment to the Russian criminal code in its second reading, which essentially assures it will go to President Vladimir V. Putin for his signature. The amendment treats a first conviction for domestic battery as an administrative offense, carrying a penalty of a $500 fine or 15 days in jail. If Mr. Putin signs the measure into law, only injuries like concussions or broken bones, or repeated offenses committed in a family setting, would lead to criminal charges. Defenders of the measure say it will protect parents’ rights to discipline their children and generally reduce the state’s role in domestic life. “In the traditional Russian family culture, relations between ‘fathers and sons’ are built upon the authority of parents’ power, mutual love and personal indispensability as the basis for children’s upbringing,” said Yelena B. Mizulina, one of the initiators of the new legislation and author of a law that banned “gay propaganda” aimed at minors. Opponents called it a step back to medieval times and a license for violent behavior by domestic tyrants. “It is clear that lawmakers recognized violence as a norm of family life,” said Svetlana G. Aivazova, a Russian specialist in gender studies. “This shows that Duma deputies are not simply conservative or traditional, it shows that they are archaic. ” Ms. Aivazova and other experts say that Russia has a serious problem with domestic violence. Citing data provided by Russia’s Interior Ministry, Ms. Aivazova told Mr. Putin in 2015 that “40 percent of all grave violent crimes are committed in families. ” In 2013, she said, more than 9, 000 women died in criminal assaults and more than 11, 000 were badly injured. In 2014, she said, “more than 25 percent of all murders were committed in families. ” In the United States, by comparison, 11, 766 women were killed by a husband or boyfriend in the years 2001 to 2012, an average of about 1, 000 a year in a country with about twice the population of Russia. Ms. Aivazova asked Mr. Putin to support a special law on the prevention of domestic violence that had already been passed in 143 countries, including Russia’s   neighbors Kazakhstan and Kyrgyzstan. Mr. Putin thanked her, but the law remained in the State Duma, and Ms. Aivazova said she was not optimistic about its prospects. In the past, Mr. Putin has expressed concern about domestic violence, even in the absence of serious injury. “I think we should not slap children and justify it based on some old traditions,” he told journalists at his last news conference in December. “There is a short distance from slaps to beating. ” The new legislation was pushed by conservative members of the Russian parliament and the Russian Orthodox Church, who were incensed last summer when lawmakers criminalized domestic violence, acting upon a recommendation by the Supreme Court. The Russian Orthodox Church, which has steadily increased its influence in social policy in recent years, said in a statement last year that physical punishment was a Russian tradition and thus should be protected as “an essential right given to parents by God. ” “There is absolutely no doubt that children should be defended against true criminal activities,” the church said. “But you cannot equate such criminal assaults with rational and moderate use of physical punishment by loving parents. ” Vyacheslav Volodin, speaker of the State Duma, said the new legislation was a sign of the state’s determination to “make conditions for strong families to emerge. ”'"}, "time": 1742628298.3598325}