{"duration": 0.154099702835083, "input_args": {"text": "'Donnerstag, 3. November 2016 Polizei fasst Mann, der seit Jahrzehnten Deckel von Gläsern zu fest zuschraubt Eisenach (Archiv) - Eines der größten kriminalistischen Rätsel der Nachkriegszeit ist nach jahrzehntelangen Ermittlungen offenbar gelöst: Beamte des Bundeskriminalamts haben heute in Eisenach einen 65-jährigen Mann festgenommen, der im Verdacht steht, im ganzen Bundesgebiet seit 1976 millionenfach Deckel von mit Lebensmitteln gefüllten Gläsern so fest zugeschraubt zu haben, dass sie von nichtsahnenden Käufern kaum noch geöffnet werden konnten. Das Vorgehen des mutmaßlichen Täters Oskar G., den die Boulevardpresse das \"Deckelphantom\" nennt, war dabei stets gleich: Im Schutz der Dunkelheit schlich er sich in Lagerhallen, Fabriken und Supermärkte, wo er bis in die Morgenstunden die Deckel möglichst vieler Gläser fest zudrehte – Gläser, die normalerweise von jedem Menschen leicht hätten geöffnet werden können. In seiner Hochphase kam er so regelmäßig auf mehr als 15.000 Deckel in einer Nacht. Sie haben ihn! So spektakulär wie Oskar G.s Verbrechen – zeitweise war fast jedes fünfte in Deutschland verkaufte Glas von ihm manipuliert – war auch seine Festnahme: Vierzehn Polizeibeamte waren nötig, um ihn in Handschellen zu legen. \"Es ist unglaublich, wieviel Kraft er in seinen dünnen Armen hat\", so BKA-Sprecher Jochen Schäfer. \"Er kann zupacken wie eine Schraubzwinge und hat mehreren Beamten die Schulter ausgekugelt.\" Als heiße Spur zum mutmaßlichen Täter hatte sich ein einzelner Fingerabdruck erwiesen, der bereits 2013 an einem Marmeladeglas in einer Supermarktfiliale im ostfriesischen Wittmund gefunden worden war. Offenbar hatte Oskar G. den Deckel so fest zugeschraubt, dass dabei sein Handschuh unbemerkt geplatzt war – ein fataler Fehler. \"Ohne diesen Glücksfund hätten wir diesem Monster wohl nie das Handwerk legen können\", so Schäfer. Doch was geht in dem Kopf des Mannes vor? Bislang ist völlig ungeklärt, was G. derart radikalisiert haben könnte, dass er beschloss, Millionen Menschen zu schaden. Glaubt man den Profilern, dann steckt dahinter Sadismus in seiner reinsten Form. Oft der letzte Ausweg der Opfer von G. Dazu passen auch erste Hinweise, dass G.s kriminelle Aktivitäten weit umfangreicher waren als bisher angenommen. So vermuten die Ermittler inzwischen, der 65-Jährige könnte bei seinen Einbruchserien auch Milchverpackungen so manipuliert haben, dass ihr Inhalt beim Gießen ruckartig aus der Öffnung schwappt. Auch könnte er gestrichelte Linien auf Plastikverpackungen an Stellen angebracht haben, die sich gar nicht aufschneiden lassen. Die Ermittlungen hierzu dauern aber noch an. Es könnte also noch eine Weile dauern, bis der Frührentner G. endlich vor ein Gericht gestellt wird. Höchstwahrscheinlich muss ihm dabei ein Pflichtverteidiger zugewiesen werden, da sich bislang jeder freie Anwalt weigert, den Mann zu vertreten, der so großes Leid über so viele Menschen gebracht hat. Experten rechnen damit, dass die Staatsanwaltschaft lebenslange Haft mit anschließender Sicherheitsverwahrung in einer Zelle ohne Schraubverschluss fordern wird. mo, dan, ssi; Fotos rechts: Shutterstock; Hinweis: Erstmals erschienen am 4.11.15 Artikel teilen:'"}, "time": 1742562606.1091392}