{"duration": 0.044567108154296875, "input_args": {"text": "'The conservative radio host Glenn Beck called the Women’s March in Washington an “AstroTurf” rally funded by the liberal billionaire George Soros. He complained that the news media refused to acknowledge this fact. But there’s one news organization he praised as an exception: The New York Times. As evidence, he pointed to a piece by Asra Q. Nomani, a   liberal feminist and Trump voter, who claimed to document the extensive financial ties Soros had to march partners. The conservative website Breitbart News tied the piece to The Times in a prominent headline. And the   site The Daily Stormer wrote about the piece under a headline that referred to Soros as an “International Jew. ” Suddenly, The Times was a   crowd pleaser. Only it wasn’t The Times that ran this article. It was published on a site affiliated with The Times  —   but completely distinct from the paper  —   called Women in the World. The site is part of an events organization founded by Tina Brown (of The Daily Beast and The New Yorker fame). The Times is a business investor in Women in the World and provides the website’s digital platform, but the two have separate editorial operations. None of that was apparent to many readers who wrote in, confused about whether the story was the work of The Times. Here’s one from Susan Kruglinski of New York: It’s easy to be confused. I was. At the top left corner of the website, for example, there is the familiar “T” logo of The New York Times, and the URL has “nytimes” in it. Click the stylized “T” and you’ll be taken to The Times’s website. If you scroll to the very bottom of the Women in the World home page, squint to find the “About Us” link, and click, you’ll be taken to a page that, in the fourth paragraph, explains the relationship between The Times and Women in the World. For the most part, the site publishes news and features about women that don’t seem particularly controversial. This one, which was labeled Opinion, was more ideologically charged and made The Times the perfect foil for conservative news sites. Adam Bryant, who oversees the newsroom’s role in conferences, was sympathetic to the idea that something more might need to be done to make evident the degree to which the two organizations are separate. “As part of the The New York Times’s business relationship with Women in the World, we currently provide the digital platform for them, but we have separate editorial operations,” he said. “We strive to avoid any confusion on the part of our readers, so we are going to look again to see if there is more we can do to explain our relationship to Women in the World in their articles. ” Glad to hear it. Updated 12:12 p. m. January 27, to clarify Soros’s connection to the march.'"}, "time": 1742562285.1173022}