{"duration": 0.08679485321044922, "input_args": {"text": "'WASHINGTON  —   The White House press secretary, Sean Spicer, set off an intense backlash on Tuesday when he suggested that President Bashar   of Syria was guilty of acts worse than Hitler and asserted that Hitler had not used chemical weapons, ignoring the use of gas chambers at concentration camps during the Holocaust. Mr. Spicer later apologized. During his daily briefing for reporters, Mr. Spicer was defending President Trump’s decision to order a missile strike on Syria by trying to lend gravity to the actions of Mr. Assad. American officials accuse the Syrian president of using sarin gas, a lethal chemical weapon, in an attack on a   area of Idlib Province last week that killed dozens, many of them children. But in misconstruing the facts of the Holocaust  —   Nazi Germany’s brutally efficient, carefully orchestrated extermination of six million Jews and others  —   Mr. Spicer instead drew a torrent of criticism and added to the perception that the Trump White House lacks sensitivity and has a tenuous grasp of history. “We didn’t use chemical weapons in World War II,” Mr. Spicer said. “You know, you had someone as despicable as Hitler who didn’t even sink to using chemical weapons. ” He continued, “So you have to, if you are Russia, ask yourself: Is this a country and a regime that you want to align yourself with?” The White House charged Tuesday that Russia had sought to cover up the Syrian government’s role in the chemical attack. Asked to clarify his remarks, Mr. Spicer then acknowledged that Hitler had used chemical agents, but maintained that there was a difference. “I think when you come to sarin gas, he was not using the gas on his own people the same way that Assad is doing,” Mr. Spicer said, incorrectly, before mentioning “Holocaust centers,” an apparent reference to Nazi death camps. 160, 000 to 180, 000 Jews killed by the Nazis were from Germany, according to the United States Holocaust Memorial Museum. Mr. Spicer’s explanation drew gasps from reporters in the briefing room. The remarks almost immediately elicited outrage on social media and correctives from scholars of the Holocaust. “Historically, it’s just wrong,” said Deborah Lipstadt, a leading historian of the Holocaust and a professor at Emory University in Atlanta. Mr. Spicer “should not be making comparisons,” Dr. Lipstadt said. “It’s, at the best, not thought out, and at the worst, shows a latent  . ” Shortly after his briefing, Mr. Spicer again tried to clarify his comments, saying in a statement that he was not “trying to lessen the horrendous nature of the Holocaust. ” “I was trying to draw a distinction of the tactic of using airplanes to drop chemical weapons on population centers,” he said. “Any attack on innocent people is reprehensible and inexcusable. ” But the clarification did not quiet calls from some corners, including from Representative Nancy Pelosi of California, the Democratic leader, for Mr. Trump to fire Mr. Spicer. By Tuesday evening, Mr. Spicer was on CNN, offering a contrite apology. “I was trying to draw a comparison for which there shouldn’t have been one,” he said. The Trump administration has a history of missteps on the Holocaust. Days after Mr. Trump took office, a White House statement marking International Holocaust Remembrance Day was sharply criticized  for failing to directly mention Jews or  . Nor was Tuesday the only time Mr. Spicer has shown a hazy understanding of world events or appeared not to understand the implications of his words. On Monday, he said that the president would retaliate against Syria not only if it used chemical weapons, but also barrel bombs. “If you gas a baby, if you put a barrel bomb into innocent people, I think you will see a response from this president,” Mr. Spicer said. Barrel bombs are the Assad government’s preferred tool of mass killing Syrian forces dropped more than 12, 000 of them in 2016, according to the Syrian Network for Human Rights. Mr. Spicer’s comments, if taken literally, would signal a much broader American intervention in Syria’s civil war. Mr. Spicer also said twice on Tuesday that Iran was a “failed state,” lumping it in with North Korea and Syria. Iran, though an adversary of the United States with a history of repression, is a robust, functioning state.'"}, "time": 1742563340.910997}