{"duration": 0.07257318496704102, "input_args": {"text": "'Getty - Andrew Burton \\nSince the 2014 NYPD officer-involved death of her father, Eric Garner, Erica Garner has been a prominent figure in the Black Lives Matter movement and a loud voice against police violence. \\nHer energy has been channeled in a different direction over the past week, however, since she was named in a number of the Clinton staff emails that were included in the most recent WikiLeaks dumps. \\nIn the emails, several staffers noted that they had an “ Erica Garner issue ” and seemed to be insinuating that she might retaliate or speak out against them if they didn\\'t include her father\\'s name when they talked about Tamir Rice, Michael Brown , and others associated with police violence. Image Credit: WikiLeaks \\nClinton aide Maya Harris appeared to clear things up within the email thread by noting, “Eric Garner not included because he was not killed by gun violence.” (Garner died in police custody after being placed in a “choke hold.”) Image Credit: WikiLeaks \\nBut if the Clinton campaign thought it had “an Erica Garner problem” before the emails were leaked, their problems multiplied when she caught wind of the things they had said: What are they talking about here? https://t.co/tgQH2VxuHZ — officialERICA GARNER (@es_snipes) October 27, 2016 What really pisses me off is that the Clinton camp won\\'t just admit these emails belong to them... Fucking liars. — officialERICA GARNER (@es_snipes) October 27, 2016 These people will co opt anything to push their agenda. Police violence is not the same as gun violence. — officialERICA GARNER (@es_snipes) October 27, 2016 I\\'m vey interested to know exactly what @CoreyCiorciari meant when he said \" I know we have an Erica Garner problem\" in the #PodestaEmails19 — officialERICA GARNER (@es_snipes) October 27, 2016 Wouldnt yall like to know why the #Hillary campaign thought that I my objecting to them exploiting my dads death was a \"problem\" @mtaibbi https://t.co/i5cahlS6VZ — officialERICA GARNER (@es_snipes) October 27, 2016 I\\'m troubled by the revelation that you and this campaign actually discussed \"using\" Eric Garner ... Why would you want to \"use\" my dad? — officialERICA GARNER (@es_snipes) October 27, 2016 \\nShe thanked aide Maya Harris for setting everyone straight: I\\'m glad you had Maya on your team to explain why you wont be USING my dad in you fucking gun violence piece... Black woman saved your ass — officialERICA GARNER (@es_snipes) October 27, 2016 \\nThen she blew the lid off the Clinton agenda: https://t.co/jzfUl0FbXF In this #PodestaEmails leak @CoreyCiorciari n @NickMerrill plot to use police violence victims to push gun control — officialERICA GARNER (@es_snipes) October 27, 2016 \\nAnd blasted Podesta personally for his position regarding her father\\'s death: Personelle equals policy @johnpodesta said that Eric Garner\\'s killing was justified . And this is who we want to hold our nose and vote for? https://t.co/5nWnjxA7Nq — officialERICA GARNER (@es_snipes) October 27, 2016 \\nGarner has been active in the continuing investigation into the NYPD officers who were involved in her father\\'s death. \\nAlthough she has not endorsed a presidential candidate since Vermont Senator Bernie Sanders left the race, she has retweeted tweets by the Green Party\\'s Jill Stein, which were critical of the Clinton campaign. '"}, "time": 1742561964.6522603}