{"duration": 0.08824300765991211, "input_args": {"text": "'The parents of Kathryn Steinle have received the   to sue the federal government over Kathryn’s July 2o15 death she was killed by an illegal alien holding a gun issued to a federal agent. [U. S. Magistrate Joseph Spero said Steinle’s parents can sue but stressed that the suit may be dismissed if there is no evidence that the illegal alien —  Juan Francisco   —  stole the gun from a federal agent.  The gun in question came from the car of a federal agent —  a car from which the gun was stolen. On August 28, 2015, Breitbart News previously reported that the . 40 caliber round that killed Steinle was fired from a Sig Sauer handgun that had been stolen from a Bureau of Land Management agent. However, it appears the case will turn on whether   stole the gun himself. On July 7, 2015,   told   he shot Steinle, but he said it was an accident. He said he found the gun “lying on the ground wrapped in a ” and that it “went off by accident when he picked it up. ” But the San Francisco Chronicle reports that Spero said the Steinle family “can sue the federal government for negligence because a ranger allegedly left the gun used in the shooting in his unlocked car. ” He added, “Leaving a gun loaded makes (its) capability for harm readily accessible in the same way as leaving the key in the ignition of a vehicle. ” Spero dismissed Steinle’s parent’s suit against the City of San Francisco, even as he gave the   for the suit against the federal government. He “rejected [her parent’s] claims that the city was legally responsible for releasing   without contacting the federal government and that federal immigration officials, who had known the city was holding him, had a duty to pick him up and deport him. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562399.6808364}