{"duration": 0.043633222579956055, "input_args": {"text": "'License DMCA Part I -- Liars For those who might wonder why foreign policy makers repeatedly make bad choices, some insight might be drawn from the following analysis. The action here plays out in the United States, but the lessons are probably universal. Back in the early spring of 2003, George W. Bush initiated the invasion of Iraq. His public reason for doing so was the belief that the country\\'s dictator, Saddam Hussein, was on the verge of developing nuclear weapons. The real reason went beyond that charge and included a long-range plan for \"regime change\" in the Middle East. For our purposes we will concentrate on the belief that Iraq was about to become a hostile nuclear power. Why did President Bush and his close associates accept this scenario so readily? The short answer is Bush wanted, indeed needed, to believe it as a rationale for invading Iraq. At first he had tried to connect Saddam Hussein to the 11 September 2001 attacks on the U.S. Though he never gave up on that stratagem, the lack of evidence made it difficult to rally an American people, already fixated on Afghanistan, to support a war against Baghdad. However, the nuclear weapons gambit proved more fruitful, not because there was any hard evidence for the charge, but because supposedly reliable witnesses, in the persons of exiled anti-Saddam Iraqis, kept telling Bush and his advisers that the nuclear story was true. What we had was a U.S. leadership cadre whose worldview literally demanded a mortally dangerous Iraq, and informants who, in order to precipitate the overthrow of Saddam, were willing to tell the tale of pending atomic weapons. The strong desire to believe the tale of a nuclear Iraq lowered the threshold for proof. Likewise, the repeated assertions by assumed dependable Iraqi sources underpinned a nationwide U.S. campaign generating both fear and war-fever. - Advertisement - So the U.S. and its allies insisted that the United Nations send in weapons inspectors to scour Iraq for evidence of a nuclear weapons program. That the inspectors could find no convincing evidence only frustrated the Bush administration and soon forced its hand. On 19 March 2003 Bush launched the invasion of Iraq. The expectation was that, once in occupation of the country, they would surely find those nukes. They did not. Their Iraqi informants had systematically lied to them. Part II -- Social and Behavioral Sciences to the Rescue? The various U.S. intelligence agencies were thoroughly shaken by this affair, and today, 13 years later, their directors and managers are still trying to sort it out -- specifically, how to tell when they are getting \"true\" intelligence and when they are being lied to. Or, as one intelligence worker has put it, we need \"help to protect us against armies of snake oil salesmen.\" To that end the CIA et al., are in the market for academic assistance. A \"partnership\" is being forged between the Office of the Director of National Intelligence (ODNI), which serves as the coordinating center for the 16 independent U.S. intelligence agencies, and the National Academies of Sciences, Engineering and Medicine. The result of this collaboration will be a \"permanent Intelligence Community Studies Board\" to coordinate programs in \"social and behavioral science research [that] might strengthen national security.\" Despite this effort, it is almost certain that the \"social and behavioral sciences\" cannot give the spy agencies what they want -- a way of detecting lies that is better than their present standard procedures of polygraph tests and interrogations. But even if they could, it might well make no difference, because the real problem is not to be found with the liars. It is to be found with the believers. - Advertisement - Part III -- Believers It is simply not true, as the ODNI leaders seem to assert, that U.S. intelligence agency personnel cannot tell, more often than not, that they are being lied to. This is the case because there are thousands of middle-echelon intelligence workers, desk officers, and specialists who know something closely approaching the truth -- that is, they know pretty well what is going on in places like Afghanistan, Iraq, Syria, Libya, Israel, Palestine and elsewhere. Therefore, if someone feeds them \"snake oil\" they usually know it. However, having an accurate grasp of things is often to no avail because their superiors -- those who got their appointments by accepting a pre-structured worldview -- have different criterion for what is \"true\" than do the analysts. \\nListen to Charles Gaukel, of the National Intelligence Council -- yet another organization that acts as a meeting ground for the 16 intelligence agencies. Referring to the the search for a way to avoid getting taken in by lies, Mr. Gaukel has declared, \"We\\'re looking for truth. But we\\'re particularly looking for truth that works.\" Now what might that mean? I can certainly tell you what it means historically. It means that for the power brokers, \"truth\" must match up, fit with, their worldview -- their political and ideological precepts. If it does not fit, it does not \"work.\" So the intelligence specialists who send their usually accurate assessments up the line to the policy makers often hit a roadblock caused by group-think, ideological blinkers, and a \"we know better\" attitude.'"}, "time": 1742628603.8898225}