{"duration": 0.01570415496826172, "input_args": {"text": "'The Washington Post dealt a blow to a liberal pipe dream Sunday when the outlet’s editorial board highlighted the problems with   health care   —   arguing that it would be “astonishingly” expensive unless doctors are paid less and Americans are prepared to “accept different standards of access and comfort. ”[The piece, called “  health care would have an astonishingly high price tag” comes days after California’s Senate approved a   system for the state earlier this week, without having specified how it will pay for the estimated $400 billion price tag.    health care systems, such as those seen in Europe and Canada, have always been popular with the liberal wing of American politics, with top liberal Sens. Bernie Sanders ( ) and Elizabeth Warren ( ) calling for such systems in America. President Barack Obama also publicly supported   when he was a senator. The Post editorial is certainly sympathetic to those aspirations, arguing that such models are simpler for patients and employers. However, it says “the government’s price tag would be astonishing. ” When Sen. Bernie Sanders ( .) proposed a “Medicare for all” health plan in his presidential campaign, the nonpartisan Urban Institute figured that it would raise government spending by $32 trillion over 10 years, requiring a tax increase so huge that even the democratic socialist Mr. Sanders did not propose anything close to it. Countering the argument of   advocates that   systems tend to be more   than the American system, the Post says the reason for that is political, blaming Republicans for framing ObamaCare’s Medicare cuts as attacks on the program instead of reform. The Post argues that a   system would face the same political barriers and that consequently, the only way to make such a plan affordable would be to get medical employees to be paid less, and to get Americans to accept lower quality of care: A     system would face all of these political barriers to   reform and more. To realize the   dream of coverage for all and big savings, medical industry players, including doctors, would likely have to get paid less and patients would have to accept different standards of access and comfort. There is little evidence most Americans are willing to accept such tradeoffs. The Post reiterates that “the goal must be universal coverage and cost restraint” but that liberals should be directing their energy to goals other than a complete government takeover of America’s healthcare system. There are many options short of a disruptive takeover: the government can change how care is delivered, determine which treatments should be covered, control quality at hospitals, drive down drug costs and discourage     plans even while making the Obamacare system better at filling coverage gaps. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742628560.2078714}