{"duration": 0.04777717590332031, "input_args": {"text": "'Hillary Clinton’s campaign chairman, John Podesta, may have violated federal law when he failed to fully disclose details surrounding his membership on the executive board of Joule Unlimited and the “75, 000 common shares” he received. The energy company accepted millions from a Vladimir   Russian government fund. [Podesta joined the executive board of Joule Unlimited Technologies  —   a firm partly financed by Putin’s Russia  —   in June 2011 and received 100, 000 shares of stock options, according to an email uncovered by WikiLeaks. Podesta’s membership on the board of directors of Joule Unlimited was first revealed in research from Breitbart News Senior    and Government Accountability Institute (GAI) President Peter Schweizer.  Podesta never disclosed his position on Joule Unlimited’s board of directors and failed to include the stock payout in his federal financial disclosures, as required by law, before he became President Obama’s senior adviser in January 2014  —   a possible violation for federal law, according to the Daily Caller News Foundation’s Investigative Group (TheDCNF). “Well Podesta should certainly have been more upfront in filling this out. Clearly, it should have been fully disclosed,” Craig Holman, a lobbyist Public Citizen told TheDCNF. “That’s the point of the personal financial disclosure forms, especially for anyone entering the White House. ” “If the transfer of stock took place, it had to be disclosed,” added former U. S. Attorney Joseph DiGenova in an interview. “If he didn’t, clearly it’s a violation. ” Indeed, Podesta had his Joule shares of stock options transferred to his daughter, Megan Rouse. “Full transfer request, with Megan’s signature attached,” Podesta’s assistant Eryn Sepp wrote to him on December 31, 2013  —   just weeks before Podesta joined the Obama administration. A January 3, 2014, letter revealed that Podesta designated his daughter’s Dublin, California, residence as the address for Leonidio Holdings LLC, the   holding company that Podesta used to transfer his shares in   Joule Global Holdings. Rouse is listed as “managing member” of Leonidio Holdings LLC, according to financial documents. TheDCNF reports that Podesta was required by law to disclose the aforementioned financial information. His failure to do so may have been illegal: The Schedule B section of the federal government’s form 278 which  —   requires financial disclosures for government officials  —   required Podesta to “report any purchase, sale or exchange by you, your spouse, or dependent children   …     of any property, stocks, bonds, commodity futures and other securities when the amount of the transaction exceeded $1, 000. ” Podesta’s form 278 Schedule B is blank regarding his receipt of any stock from any company. “I think in this case where you’re talking about foreign interests and foreign involvement, the collateral interest with these disclosure forms is put in the forefront of full disclosure of any foreign interest that you may have,” said Ron Hosko, a former FBI assistant director. “It’s a troubled question if you deliberately omit this information on the form,” Hosko said, adding that Russian funding could have easily “become a counterintelligence concern for America. ” Last week, Rep. Louie Gohmert called for a federal probe into Podesta’s Russian ties. The new revelations come amid a partisan push to link President Donald Trump and his aides to Russian   and collusion during the presidential campaign. Read The Daily Caller News Foundation’s Investigative Group’s report here. Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742563667.3995097}