{"duration": 0.08925819396972656, "input_args": {"text": "'Good morning. (Want to get California Today by email? Sign up.) Something stinks in Huntington Beach. Going back decades, residents along the coastline between Long Beach and Newport Beach have reported a powerful stench that wafts into the region every so often and lingers for an hour or longer. Depending on who is asked, it happens as frequently as multiple times a month or a handful of times a year. But it is unmistakable, residents say  —   bad enough to make heads throb and stomachs queasy. (Officials said there have been no known serious illnesses linked to the odor.) “It’s more than a smell,” said Ellery A. Deaton, a City Council member in Seal Beach. “It’s noxious. When it happens I need to run around and close my windows. ” The odor is commonly described as “” but its origin remains a stubborn mystery. Over the years, City Council, fire department and air quality officials have tried unsuccessfully to get to the bottom of it. As a result, a number of theories have flourished. Gina   a schools official who lives in Huntington Beach, said she believes it’s natural gas. That’s despite assurances from the Southern California Gas Company, which has investigated complaints and ruled out the possibility of a leak. Ms.   talked about the area’s layout of gas lines, the trajectory of the smell’s spread and her sense in the odor of a hint of mercaptan  —   a natural gas additive. ”The smell that I smell,” she said, “is the natural gas smell. ” Other residents wonder about offshore oil platforms, or perhaps the shipping vessels arriving into the nearby ports of Long Beach and Los Angeles. “My theory, which is based mainly on the process of elimination, is that it is oil tankers off the coast releasing pressure,” Ms. Deaton said. Arley M. Baker, a spokesman for the Port of Los Angeles, was skeptical of that idea. The ships abide by fairly strict clean air rules. What’s more, Mr. Baker said, “I can’t think of a function on a ship that would discharge a foul smell. ” Sam Atwood, a spokesman for the South Coast Air Quality Management District, said the agency had investigated complaints multiple times, but has been unable to establish a cause. “Odors can be very difficult to track down,” he said. For the moment, the mystery seems bound to linger. Capt. Chris Coates of the Costa Mesa Fire Department said emergency dispatch has been getting calls about the smell for more than a decade. He is as perplexed as anyone, he said. “That’s the mystique to the whole thing,” he said. “Nobody knows. ” • The Department of Justice opened a civil rights inquiry into the Orange County district attorney’s office. [The New York Times] • A House ethics panel is investigating possible violations by Representative Duncan D. Hunter, a Republican whose district includes most of San Diego County. [San Diego  ] • A man was fatally shot by a Bakersfield police officer who thought he had a gun. He was actually carrying a crucifix. [The New York Times] • An Orange County jury found a convicted sex offender guilty of kidnapping and killing four women. [Orange County Register] • In a step to lower greenhouse gas emissions, California passed regulations for energy use in computers. [The New York Times] • A tale of two droughts in California: Wetter in the north, still bone dry in the south. [Los Angeles Times] • How Google used artificial intelligence to transform Google Translate  —   and how machine learning is poised to reinvent computing. [The New York Times] • San Francisco supports immigrants  —   “just not into our neighborhoods. ” [Opinion | San Francisco Chronicle] • The city of Pacifica said it would demolish an apartment complex perched on a rapidly eroding oceanside cliff. [San Francisco Chronicle] • A Los   art collective has gathered thousands of copies of “Jerry Maguire” on VHS for an exhibit next month. [The New York Times] • Girl at the White Horse, the name of a bar opening this month in East Hollywood, has a series of cozy and intimate nooks in which to hang out. [The New York Times] The National Park Service said Thursday that a female mountain lion had been killed trying to cross Highway 118 in Los Angeles. The    mountain lion known as   left behind three offspring. Without their mother, they were unlikely to have the hunting skills to survive, wildlife officials said. “It’s your worst nightmare in that kind of scenario,” said Tanya Diamond, a wildlife ecologist.   was the 13th known mountain lion to be killed in and around the Santa Monica Mountains since 2002, when the park service began studying animals there. Untold others have been hit across the state. Ecologists say roadkill accidents are made more likely as the animal’s habitat is increasingly squeezed by urban sprawl. From February 2015 to February 2016, roughly 6, 000 vehicle accidents in California involved wildlife, according to one study. The collisions have added urgency to efforts in California to create   wildlife corridors across highways that allow mountain lions, deer, foxes and other animals to cross safely between habitats in search of sustenance and mating opportunities. Caltrans has been working with wildlife advocates to advance a number of projects. One of most ambitious involves a proposed wildlife bridge in Los Angeles County that would allow animals to cross the formidable 101 freeway between the Simi Hills and the Santa Monica Mountains. At an estimated cost of more than $30 million, the Liberty Canyon wildlife corridor would be the nation’s largest such crossing, advocates say. In Northern California, another project involves digging two tunnels beneath Highway 17 in the Santa Cruz Mountains, where researchers say hundreds of animals have been hit in the last eight years. Ms. Diamond, whose group Pathways for Wildlife has provided research on the Highway 17 project, said state officials were increasingly getting behind such efforts. “It’s a great time because I think now a lot of these ideas are coming to fruition,” she said. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742562194.5846488}