{"duration": 0.05211687088012695, "input_args": {"text": "'Pieczenik: ‘There is a coup in the White House and we are going to stop it’ Full-scale counter coup launched November 1; the tyrants have been warned By Shepard Ambellas - November 2, 2016 ( INTELLIHUB ) —“The Clintons have been involved in corrupting our White House, our judiciary, our CIA, our Federal Bureau of Investigation, our Attorney General Loretta Lynch and our Diector of the FBI James Comey for some time now,” Steve Pieczenik said in his latest video released Tuesday \\nPieczenik said that a coup had been formed in the White House through “political cronyism” and that “the Intelligence community and others formally involved have gotten together” and “initiated a counter coup through Julian Assange and Wikileaks.” \\n“We have your number,” Pieczenik said, talking about the corrupt Administration. \\n“We are going to stop you from making Hillary Clinton the President of the United States,” Pieczenik told the Establishment in a firm tone. \\n“[…] we will convict and indict the President of the United States, Loretta Lynch and many other who are involved in the cover-up of the massive corruption that occurred under the Clinton Foundation.” \\n“This is probably the first time in the history of any country where a coup was initiated through the Internet and a counter-coup was initiated through the Internet.” \\n‘This is bigger than me,’ Pieczenik said before pointing out that good people in “over 15 agencies” are working together to stop this criminal syndicate. \\n‘We have everything we need to undermine the Clintons’ \\n“We do not have weapons, we do not have the intent to kill anybody and we do not intend to harm anybody.” \\nPieczenik pointed out how the American public, along with good veterans and people in Intelligence agencies, will put a stop to the Clintons from once again “assuming power.” \\n‘History is occurring in front of us.’ \\nShepard Ambellas is an opinion journalist, filmmaker , radio talk show host and the founder and editor-in-chief of Intellihub News & Politics. Established in 2013, Intellihub.com is ranked in the upper 1% traffic tier on the World Wide Web. Read more from Shep’s World . Get the Podcast . Follow Shep on Facebook and Twitter .'"}, "time": 1742564402.8179903}