{"duration": 0.031101465225219727, "input_args": {"text": "'Tom Cahill | November 17, 2016 \\nIn a stunning move, President Obama has announced he won’t allow any oil and gas leases on land deemed sacred by the Blackfeet Tribe. \\nAfter the announcement, Devon Energy, which was hoping to drill on 130,000 acres in Montana — some of which housed Glacier National Park and Blackfeet land — will have all of its oil and gas leases cancelled on the disputed land. The Bureau of Land Management had previously granted 15 leases to Devon Energy in the northwestern part of the Big Sky State. \\n“We are proud to have worked alongside the Blackfeet Nation, U.S. Forest Service and Devon Energy to achieve this important milestone, rolling back decades-old leases and reinforcing the importance of developing resources in the right ways and the right places,” said Department of the Interior Secretary Sally Jewell in a public statement . \\nNational Parks Conservation Association official Michael Jamison told the Washington Post that the cancellation of the leases is an important milestone for the preservation of various protected species like wolf, bear, and elk. \\n“There aren’t many places like this left in the lower 48,” Jamison said. \\nThe move is particularly significant in the context of the ongoing protests at the construction site of the Dakota Access Pipeline, where hundreds of indigenous tribes have gathered with the Standing Rock Sioux to prevent the pipeline from being built. Protesters say the pipeline, which would run underneath the Missouri River, would endanger a crucial drinking water supply for millions of people in several states. \\nFor its part, Devon will receive a little over $200,000 for the cancellation of the leases, which were issued in the 1980s with no drilling occurring since the leases were granted. \\n\\nTom Cahill is a writer for US Uncut based in the Pacific Northwest. He specializes in coverage of political, economic, and environmental news. You can contact him via email at [email protected] '"}, "time": 1742563242.8772616}