{"duration": 0.09123420715332031, "input_args": {"text": "'The University of Minnesota football team on Saturday rescinded its threatened boycott of a bowl game, a protest that had been intended to persuade the administration to lift the suspensions of 10 players entangled in a sexual assault inquiry. Team leaders continued to say that the 10 players, whose suspensions remain in effect, were being punished without the benefit of due process. Minnesota will meet Washington State in the Holiday Bowl on Dec. 27 in San Diego, avoiding what would have been the first time a   college football team had missed a game because of a player protest in at least decades. Team leaders gathered Saturday morning at a hastily arranged news conference in a team meeting room in the Bierman Field Athletic Building on campus to announce the decision, which came after a lengthy meeting on Friday night of team leaders with the university’s president, Eric W. Kaler, and Athletic Director Mark Coyle. Wide receiver Drew Wolitarsky, a senior, read a statement from the team, saying, “After many hours of discussion within our team, and after speaking with President Kaler, it became clear that our original request of having the 10 suspensions overturned was not going to happen. ” The statement continued, “We as a team will use our status as public figures to bring more exposure to the issue of sexual harassment and violence against women. ” The statement added that “sexual harassment and violence against women have no place on this campus, on our team, in society. ” The statement also said that the players had secured a promise that the suspended players would eventually be given a “fair hearing  —   which includes a diverse review panel. ” Though the university’s Office of Equal Opportunity and Affirmative Action concluded last week that the 10 players had violated the university’s code of conduct  —   with four committing sexual assault according to the university’s rules, which require affirmative consent  —   sanctions have yet to be determined. Kaler said those hearings would most likely be in January and could not be scheduled before the bowl game because of final exams. He had clarified in a statement Friday night that the suspensions, which were announced Tuesday, were an athletics department decision, separate from whatever consequences might stem from the university’s finding. Kaler had seemed to put the ball in the players’ court Friday night when he pledged in that statement not to “change our values or our code of conduct for the sake of a bowl game. ” On Saturday, Kaler said that his subsequent meeting with team leaders “was a very frank and candid conversation, and I’m glad it led to this resolution. ” The team’s threatened boycott highlighted the significant voice that ostensibly amateur athletes in   sports in prominent conferences (Minnesota is a member of the Big Ten) have, by virtue of their popularity and impact on the athletics department’s bottom line. The episode also touched on a debate embroiling campuses nationwide over how universities must balance their legal obligation to investigate sexual assault with their need to be fair to all students, including those accused of sexual assault. It also displayed the quandary in which administrations find themselves given federal privacy laws. The players’ statement acknowledged as much, saying: “We also understand that they have requirements that they need to follow about sharing information. Yet at the same time, we observed how our teammates’ names and pictures were shared with the world, and reputations ruined. ” After a woman accused several men of sexual assault in September, a criminal investigation led to no prosecutions and a restraining order was dropped as part of a settlement, while four players served   suspensions. The accused have insisted that there was only consensual sex. But the   investigation, whose conclusions were obtained by a Minneapolis television station, used the “preponderance of the evidence” standard of proof rather than the criminal justice system’s higher standard of “beyond a reasonable doubt. ” Coach Tracy Claeys, who led the Golden Gophers to an   record in his first full season in the job, had backed the players’ protest on Twitter. He and several assistants reportedly sat in the back of the room while Wolitarsky read the statement. The investigation report, which relied on interviews, video and other documentation, contained graphic details about what happened the night of the episode. It also stated that a Gophers football recruit had been there he was underage, according to court records. Kaler said Saturday that “the football team action was in support of their teammates. ” “It was not in support of sexual violence,” he said. “The players are clear about their involvement in preventing sexual violence. Their values are in support of the victims of sexual violence. ”'"}, "time": 1742563944.0553718}