{"duration": 0.04839015007019043, "input_args": {"text": "'Trump: Electing Clinton will cause a constitutional crisis November 01, 2016 Donald Trump appears at a campaign rally in Warren, Michigan. REUTERS/Carlo Allegri \\nDonald Trump told a crowd in Michigan Monday that if Hillary Clinton is elected the FBI investigation overshadowing her presidency would create a constitutional crisis. Trump: \"The investigation will last for years. The trial will probably start. Nothing will get done. I can tell you, your jobs will continue to leave Michigan. Nothing’s going to get done.” Clinton: Confident that the FBI will not find anything problematic in the emails and will reach the same conclusion they did earlier this year. Hillary from Ohio: \"It wasn\\'t even a close call.” Clinton on Trump being a threat: \"I am running against someone who says he doesn\\'t understand why we can\\'t use nuclear weapons.” From Cincinnati: “I wonder if he even knows that a single nuclear warhead can kill millions of people.” Trump from Warren: \"I want to tell you, she is a terrible example for my son and the children of this country.” “Hillary is the one who broke the law over and over and over again.” \\n(GRAND RAPIDS, MICH./KENT, OHIO) Republican presidential candidate Donald Trump called Democratic rival Hillary Clinton a threat to the country on Monday, saying that if she is elected a probe into her emails could shadow her entire term in office. \\n\"The investigation will last for years. The trial will probably start,\" Trump told a rally in Grand Rapids, Michigan. \"Nothing will get done. I can tell you, your jobs will continue to leave Michigan. Nothing’s going to get done.” \\nThe Federal Bureau of Investigation on Friday said it was investigating newly discovered emails that might relate to Clinton\\'s use of a private email server when she was secretary of state. \\nClinton on Monday again said she was confident that the FBI would not find anything problematic in her emails and would reach the same conclusion they did earlier this year. \\n\"It wasn\\'t even a close call,\" she said at a rally in Cincinnati, Ohio, of the FBI investigation.'"}, "time": 1742562520.4099717}