{"duration": 0.06388235092163086, "input_args": {"text": "'This Is What Gold Does In A Currency Crisis, Brexit Edition   \\nby John Rubino \\nIn June the UK shocked the world – or at least the world’s elites – by voting to pull out of the European Union. Economists predicted disaster, EU leaders threatened pain for British exporters and tourists, and the media settled in to watch the UK shrivel and die. \\nFour months later, the appropriate response is a yawn rather than a scream. UK economy set to shrug off Brexit in latest GDP figures…For now \\n(CNBC) – The first indications of how the U.K. economy is performing in the aftermath of the Brexit vote will be known this Thursday, with the release of quarterly gross domestic product (GDP) figures.Analysts told CNBC they forecast a 0.4 percent growth in the third quarter of this year – an “upside surprise” following the decision last June to leave the European Union. Prior to the vote, many market observers were pointing to economic contractions if voters opted to leave the EU. \\nThe pound, however, did fall hard in foreign exchange markets… \\n…which is actually great news for British exporters, who are winning round one of the post-Brexit currency war by selling suddenly-much-cheaper stuff to the rest of the world. \\nThe only losers? Britons who held their savings in local currency and saw the value of their bank accounts fall dramatically. But their solution was actually pretty simple: convert their pounds to gold and watch it soar. \\nBritons who did this are up about 25%, which is a pretty good year’s work for any money manager, amateur or professional. \\nAs the “but in the long run Brexit will still be a disaster” drumbeat gets louder and negotiations with the EU drag on, gold should remain a simple, low-stress way for anyone with pounds to sail through the process unscathed. \\nThe broader lesson? As the world descends into debt-driven chaos in coming years, the above charts will be replicated in most national currencies, giving all of us chance to learn from the UK’s example.'"}, "time": 1742561795.894616}