{"duration": 0.0854182243347168, "input_args": {"text": "'The remnants of what had been Hurricane Hermine swept up and along the Eastern Seaboard on Saturday, disrupting the holiday weekend in much of the coastal South while preparing to bedevil the Northeast well into the week. The storm, which made its landfall early Friday near St. Marks, Fla. as a Category 1 hurricane, led to hundreds of thousands of power failures and flooded roadways. In Florida, dealt its first direct strike by a hurricane in nearly 11 years, the Tallahassee area was particularly hard hit, and officials said it could be almost a week before electricity was fully restored. “We still have a lot of work to do following the storm,” Gov. Rick Scott of Florida said at a news conference on Saturday in Tallahassee, the state capital. “We’ll continue to spend the coming days assessing the damage and responding to the needs of our Florida families. ” Mr. Scott said there was “significant damage” in the state, including “a lot of downed power lines. ” Residents and officials described destroyed businesses, boats set adrift, crumbled sea walls and battered homes. The National Hurricane Center said the storm, whose winds reached as high as 80 miles per hour after it spent days swirling through the Gulf of Mexico, remained powerful on Saturday, even after it crossed the Florida Panhandle, Georgia and the Carolinas. The storm became a   cyclone on Saturday morning, but forecasters warned that it still “could be near hurricane intensity” for part of the week. And so the consequences of the storm’s path stretched from Florida, which reported the first fatality attributed to it, to New York, where the city said beaches would be closed Sunday, to Cape Cod, Mass. which was under a tropical storm watch. The hurricane center said Saturday evening that the storm would “meander slowly offshore of the   coast for the next couple of days” before churning past New Jersey and New York. Officials said storm surges would be “accompanied by large and dangerous waves,” and they warned of the possibility of “  inundation” from Virginia to Connecticut. Gov. Chris Christie of New Jersey declared emergencies for Atlantic, Cape May and Ocean Counties, and Gov. Andrew M. Cuomo of New York said the state’s emergency operations center would be activated on Sunday. On Saturday, the National Guard was on alert in Virginia, where floodwaters prompted road closings in the Hampton Roads region, and visitors to North Carolina’s Outer Banks, where strong rip currents were reported, were advised to adjust their travel schedules. “I’m relieved that everyone took this storm seriously, paid attention to the weather forecast and heeded the warnings of state and local officials,” said Gov. Pat McCrory of North Carolina, whose state shut down major bridges in the Outer Banks because of winds associated with the storm. Officials said that the death of one person in a traffic accident in eastern North Carolina was probably connected to the storm. Although people in many communities said the storm would soon become only a minor memory, parts of Florida were entering what could be a protracted recovery, and there were some concerns that the absence of   could prove dangerous. In Leon County, which includes Tallahassee, more than half of homes were without electricity on Saturday, and the American Red Cross opened a   comfort shelter, a place “for residents to cool off, hydrate and receive information from area nonprofit agencies. ” The authorities planned to distribute bottled water throughout the county, where high temperatures were predicted to be in the upper 80s or lower 90s for the next several days. During his appearance on Saturday at Florida’s emergency operations center, Mr. Scott made a dispiriting roll call of counties and the extent of their power failures. In Wakulla County, just south of Tallahassee, about 72 percent of customers were without electricity. “This is the No. 1 issue people are telling me about,” Mr. Scott said before leaving for another afternoon of damage assessments.'"}, "time": 1742561936.1079414}