{"duration": 0.15779972076416016, "input_args": {"text": "'Written by Patricia Liles. Contact her at \\nSCORPIO NEW MOON \\nSun and Moon in Scorpio ~ 8º \\nSunday, Oct. 30, 11:38 AM Mountain Daylight Time \\n(October 30, 2016, 5:38 PM Greenwich Mean Time) \\nA powerful turning of the seasons in the Northern Hemisphere as the Sun begins to favor the southern latitudes. We feel the power of completion as the cycle of harvest comes to an abundant end, and we celebrate Samhain – the sacred midpoint between fall and winter. The howling voice of the winds begins to blow away the leaves, and we take seriously the lessons of letting go of all that is old and come to completion. \\nScorpio, the fixed, power sign for water, plunges us into the cycle of death, regeneration and rebirth. We, along with the trees, animals, plants, begin to draw our sap inward to sustain us through the challenges of winter. Scorpio helps us align with the Dark, to commune with the hidden mysteries within us – the unformed, the unspoken. As the days darken, we rejoice in the cackle of getting our inner witch on and playing in the ever more accessible realms of the invisible worlds. Scorpio is a reminder that our galaxy is predominately dark matter, that there is more mystery than reality by far and that we haven’t a clue of how to explain, measure or own it. \\nThe Scorpio archetype is The Healer, The Shaman/Curandera, The Alchemist. The water element of Scorpio gives a feeling nature of great depth and strong passionate emotion and intensity. Coming after Libra, the sign of the partner, this emotional sign brings sexuality, desire and magnetism to the zodiac. Scorpio rules the reproduction and elimination organs of the body. The tantric energy that Scorpio can embody so fully teaches how to hold our power and bring it through the lower chakras and into the heart and beyond mastering the art of being fully present, surrendered and aware. Scorpio’s symbols of the eagle who sees from high above the fray and the mythical Phoenix that rises from its own ashes are clues to Scorpio’s strengths ~ the ability to see the psychological motivations at play and the ability to re-create, rebirth, and rejuvenate from their own symbolic deaths. Scorpio’s magnificence can be seen in crisis where their power held in reserve is suddenly available to care for those in need. \\nScorpio has dominion over the eighth house that rules other people’s money, shared resources, debt, taxes, inheritance, and money gained through your passion. Contemplate your debts – energetic and monetary. Are you creating power energy leaks with debt? Are you handling other people’s resources with integrity? \\nWe find the Sun and Moon in Scorpio aligned with Mercury in the New Moon chart. Mercury, the Messenger, rules how we think, communicate, network ideas, perceive patterns, and how we share all the info we gather. Mercury is considered neutral and androgynous energy. Mercury in Scorpio is willing to go deep and bring the uncomfortable and unseen to the table; it also gives us the power to speak what has gone unspoken or speak our truth with power and conviction. \\nThe Sun/Moon/Mercury are trined to Neptune in Pisces, so we have a wide-open channel to lift our perceptions and communications to an open and accepting frequency with others. When we release our secrets, burdens, and grudges, our spirits can soar and our hearts open, and it gives Spirit more room to work through our lives. Neptune/Mercury magnified by the Sun and Moon increases our intuition, imagination, psychic and musical abilities. Neptune is also conjoined to the South Node, so the work of opening, surrendering, and transcending is trying to confer the gift of forgiving what has gone before and to teach the practice of living in just this moment with great trust and without fear and worry. The gift of the water elementals-Scorpio, Pisces-are ours for the asking. Neptune goes direct on Nov 19 and is extremely powerful and concentrated as it’s virtually at standstill now. \\nPluto is the modern ruler of Scorpio and Mars is the traditional ruler. They are close in the sky now. Pluto in Capricorn is slowly (2008-2024) eliminating and transforming the shadow aspects of the patriarchy, authority, of government, corporations, financial institutions. It hasn’t been pretty. Mars, on the other hand (also in Capricorn), is squaring (crisis) the radical duo of Eris and Uranus. Yikes! Pluto/Mars is fully empowering the righteous rage of the feminine warrior, Eris, to bring the long festering wounds/suppressed voice of the feminine forward whether in the form of the indigenous, the enslaved, the disrespected, or the disenfranchised. Something that is apparent in the healing work I do is how the wounding through invalidation or abuse of the second chakra, a seat of the emotions, sexuality and desire nature (Scorpio), cause the chakra to be defended and shut down and consequently render the third chakra of personal will/power impotent. That loss of energy also manifests as the loss of the voice in the fifth chakra, because it has no support from the lower chakras and results in the inability to speak one’s truth or to be heard, to express oneself fully. Taurus, the opposite sign of Scorpio rules the throat/voice. They are linked. We see the dynamic played out collectively at this time, too, with the exposure of so called ‘locker room’ talk and the impassioned speech by Michelle Obama embodying the righteous feminine warrior declaring this archaic rhetoric/behavior no longer acceptable. As the emotional body of the feminine is opened, healing results and balance can be restored to the miraculously self-healing and evolving beings that we are. \\nAs we cross this powerful threshold leading to the still point of winter (or the radiance of summer), take time to sit in the dark with candlelight and listen for the messages, signs and insights from the other worlds during this weekend of Halloween, Samhain/Hallowmas. Throw everything into the fire that no longer serves you. Honor your ancestors and their dreams. Use your power for healing work, and begin to vision what you want to grow when the light begins to increase again in the New Year after Winter Solstice. \\nAll Times are in Mountain Standard Time (MST) \\n11/06 Daylight Savings Time Ends USA \\n11/14 Taurus Full Moon 22º 6:52 AM MST \\n11/21 Sun enters Sagittarius 2:22 PM MST \\n11/29 Sagittarius New Moon 8º 5:19 AM MST \\nWritten by Patricia Liles. Contact her at \\n© All rights reserved. www.thepowerpath.com \\nYou may make copies of this writing and distribute it in any media you wish so long as you do not charge for it or alter it in any way. You must credit the author and include this entire copyright notice. While the text may be shared, no audio files including lectures, music and/or sound meditations may be posted on any site for any reason without written permission from the Power Path. Share: Rate:'"}, "time": 1742562314.7435355}