{"duration": 0.05010080337524414, "input_args": {"text": "'On Thursday, Republican Senators Ted Cruz ( ) and Lindsey Graham ( ) introduced legislation that would defund the United Nations over the Security Council’s passage of UN Resolution 2334, which calls Israeli construction in the West Bank and eastern Jerusalem “illegal. ”[The “Safeguard Israel Act” states that the U. S. government will be prohibited from giving any money to the UN, or any of its affiliates, until President Barack Obama confirms the UN resolution has been repealed and can certify that he has done so. America provides the UN with 22 percent of its budget, contributing $8 billion to the largely   organization annually.  “United Nations Security Council Resolution 2334 falsely claims that Israel’s sovereignty over the eastern part of Jerusalem and Jewish communities in the West Bank are illegal under international law, and that the Old City of Jerusalem, along with the Temple Mount, the holiest site for the Jewish people, and the Western Wall are ‘occupied Palestinian territory,’” the Safeguard Israel Act states. The  December 23   resolution 2334 passed nearly unanimously despite the Obama administration’s decision to break with tradition and abstain from voting instead of vetoing it. Because the United States is a permanent member of the UN Security Council, an American veto would have automatically stopped the resolution and prevented it from passing. “President Obama betrayed decades of robust bipartisan American support for Israel at the United Nations by permitting the passage of a biased resolution that condemns our close friend and ally,” Sen. Cruz said on MSNBC’s “Morning Joe” Thursday morning. “The Security Council’s resolution is only the latest example of the UN’s long history of obsessive hostility towards Israel. ” Sen. Graham said, “I begged the UN months before, don’t put me in this box. I think most Americans believe the United Nations has become more   more  . ” He added, “I’m a big internationalist, but we’re gonna stop the money until we get this fixed. ” The Safeguard Israel Act also notes that during his final address to the UNSC on December 16, outgoing UN   Ban   admitted UN bias against Israel when he stated, “Decades of political maneuverings have created a disproportionate volume of resolutions, reports, and conferences criticizing Israel. ” The legislation adds, the “United Nations passes more resolutions condemning Israel than any other country in the world. ” Last week, the House of Representatives passed a resolution on a   vote objecting to the Security Council vote. Despite strong bipartisan support for the measure, at least 75 Democrats and four Republicans voted against it many of the opposing Democrats accused Republicans of introducing HR 11 to attack Obama unfairly in the last two weeks of his presidency. Rep. Jan Schakowsky ( ) Rep. David Price ( ) and Rep. Keith Ellison ( ) were among Democrats to vote against HR 11. Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz,  '"}, "time": 1742561706.6406152}