{"duration": 0.031812191009521484, "input_args": {"text": "'What to do when the October surprise aimed at your opponent flops and your polls are bad, so bad, really bad? \\nHow about more propaganda! \\nThe losing Trump campaign’s latest Hail Mary is to try to fool voters with a last ditch media propaganda push by recruiting volunteers to blitz talk radio with “talking points” and “monitor” discussions and callers. \\nShared by Talk Show host and Editor-in-chief of Right Wisconsin.com Charlie Sykes: Welp. Trump campaign planning \"talk radio blitz.\" Recruiting volunteers to call shows with talking points. https://t.co/eWR5qLKRjR \\n— Real Charlie Sykes (@SykesCharlie) October 31, 2016 \\nFrom the Trump campaign’s call to action: \\nTrump Talk Radio Blitz 2016 Help get Donald Trump elected! Please sign up below to volunteer to call into talk radio over the final days of this Presidential campaign and tell Wisconsin’s voters why you support Donald Trump. We are looking for volunteers to sign up as a Trump Talk Radio Blitz Call Captain and/or a Trump Talk Radio Blitz Caller. \\nThank you for your willingness to help elect Donald Trump and Mike Pence this very important election year! \\nWhat will these call captains do? Oh, “monitor” other the show and discussions, give talking points — you know, propaganda: \\nI am willing to help! (check all the apply) I am willing to serve as a Trump Talk Radio Blitz Call Captain, taking responsibility to monitor and recruit other callers for one or more talk radio programs between now and election day \\nI am willing to be a Trump Talk Radio Blitz Caller and select one or more 15 minute segments for local talk radio shows to call into and promote Donald Trump’s campaign \\nCall “Captains” will be in charge of entire shows to make sure the Trump message gets out and “monitor” discussions lest anyone bring any facts to the air: \\nCall Captains will sign up to be responsible for an entire talk radio program or programs between now and the election to 1) help recruit callers to call in and promote Donald Trump’s campaign throughout the program for that day, 2) remind Trump Talk Radio Blitz Callers who have sign up of their commitment to call into the show, 3) help ensure your Trump Talk Radio Blitz Callers are prepared to discuss the show’s topics, 4) monitor the show and the discussions, and 5) report your successes back to the campaign. \\nPaid for by the Trump campaign: \\nI mean, it’s working so well for the Trump spokespeople, especially those propaganda artists embedded on a certain cable network. Why not organize non-professionals to give the same talking points and disseminate them in a way that appears “organic”. LOL, I kid. If you’ve run into these people in a comment section or forums you know they have the campaign message down so exactly as to be a screaming siren of talking points. \\nSo when you hear screaming tinfoil about fake polls and accusations that Hillary Clinton committed treason even though she was actually cleared, you needn’t worry that your entire country has gone insane. \\nThis is the last gasp of a sinking campaign trying to fool the voters with media propaganda dished out by “volunteers”.'"}, "time": 1742628483.0222108}