{"duration": 0.10784912109375, "input_args": {"text": "'3 549 11 0 Estamos presenciando el funeral del \\'mainstream\\' occidental. El ataque rusófobo ha asumido un carácter tan delirante que ha provocado un efecto contrario. En lugar de odio, curiosidad. En lugar de desprecio, admiración. Al menos así lo ve el escritor y periodista italiano Giulietto Chiesa en su artículo de opinión para Sputnik. \\nEl intento de los medios y apoderados occidentales de demonizar la figura de Vladímir Putin solo aumenta la popularidad internacional del líder ruso y lo convierte en el termómetro de una derrota, un \\'auto de fe\\' del periodismo occidental. \\nChiesa pone de relieve que los centros destinados al control de la opinión pública occidental muestran signos de gran desconcierto. \"El ejército invisible de cientos de miles de propagandistas ya no parece ser capaz de producir y reproducir suficientes toxinas para envenenar al público europeo. Mientras que el mensaje que brinda el \\'enemigo\\' declarado parece ser cada vez más sugestivo\". © Sputnik/ Vladímir Trefilov V Международная научная конференция \"Зиновьевские чтения\" \\nPor ejemplo, para un número creciente de personas es cada vez más claro que Rusia ha sido el factor decisivo en la derrota del autodenominado Estado Islámico en Irak y Siria. Es así que Rusia ha ayudado a Europa en la lucha contra el terrorismo internacional. Es así que Putin resulta ser un amigo y no un enemigo. © Sputnik/ Evgeny Odinokov \"Los medios occidentales hacen de Rusia un espantajo\" \\nLa idea de los asesinos \\'comisionados\\' por Putin permanece fija en la memoria de muchos lectores/espectadores, pero para muchos otros —los que realmente indagan en el tema y cuyo número sigue creciendo— esto se convierte en poco más que un invento de los medios de comunicación, que no se sostiene por prueba consistente alguna y que, evidentemente, no se corresponde con la realidad. Las historias de una inminente invasión rusa en el Báltico y Polonia están bastante expandidas entre las poblaciones locales, pero resultan ridículas para millones de europeos. \"Las sanciones contra Rusia no han encontrado apoyo en Europa y muchos son los que no se explican por qué los líderes europeos han decidido ir en contra de sus propios intereses económicos\". \\nLea más: Si Europa y Rusia fueran aliados… \\nEn resumen, los hechos desmienten las conjeturas. Ahora solo les queda aumentar la dosis propagandística, como la del obsesionado Joe Biden, el vicepresidente de Estados Unidos, quien en la televisión llegó incluso a acusar a Rusia de poder y querer \"alterar sustancialmente\" el resultado de las elecciones en Estados Unidos. Pero se trata de un gol en su propia puerta, mostrando a EEUU como víctima de una agresión tecnológica de Rusia. La credibilidad de esa acusación es igual a cero (más que nada porque todo el mundo sabe que provienen del país que ha inventado las \\'revoluciones de color\\' en una docena de países). © Sputnik/ Alexey Druzhinin \"Nuevo orden de Rusia y China sustituirá la hegemonía de EEUU\" \\nLas redes sociales son todas estadounidenses y trabajaban sin descanso por su causa, pero ahora nos traen mensajes contradictorios. Existe RT, que acumula alrededor de sí a todos los que aún no tienen el celebro lavado. Se ha roto así la línea de monopolio informativo y comunicativo. Y aquí es cuando se traza la nueva línea: \\'detener la propaganda\\' del Kremlin, dado que nuestra propaganda no funciona como debe. Así, lo primero es reforzar el dogma según el cual todo lo proveniente \"de aquella parte\" es propaganda. \\nEl segundo punto del plan: evitar que el canal del enemigo funcione, erigiendo barreras técnicas, políticas, administrativas, judiciales, policiales; detener a los periodistas enemigos (o matarlos, como en Ucrania); cerrar cuentas bancarias de RT en Gran Bretaña ; oscurecer las redes de radio y televisión en las que salen al aire las herejías del Kremlin. \\n\"Somos testigos de la implementación de la censura en Occidente, que tanto se jactaba de su libertad y su pluralismo. Los papeles se han invertido. La confrontación de ideas, las más duras, difíciles, pero útiles para verificar las diferencias, vienen siendo sustituidas por la prohibición. En Occidente entra en juego el \\'Ministerio de la Verdad\\' de George Orwell, y el que no forme parte de nosotros debe ser detenido, prevenido, eliminado, ensombrecido\". \\nLea más: ¿Libertad de expresión? Proyecto europeo propone amordazar a medios alternativos \\n\"Precisamente aquí y ahora, estamos siendo testigos de un funeral. El funeral del principio que alguna vez hizo fuerte a Occidente y que ahora no está siendo implementado en la práctica\", concluye Chiesa. \\nLas opiniones expresadas en este artículo son de exclusiva responsabilidad del autor y no coinciden necesariamente con las de Sputnik. ...'"}, "time": 1742564463.8688974}