{"duration": 0.03959465026855469, "input_args": {"text": "'Nuclear War Alert: US Prepares For North Korea Missile Launch \\nBy Comment North Korea may soon launch nuclear attacks on the U.S., based on a recent evidence seen via satellite. Along with the U.S., the defense forces of South Korea and Japan are on high alert following a recent finding through satellite imagery which exposed potential preparations being carried out at a North Korean facility for a new missile launch. North Korea going rogue with nuclear weapons and ballistic missile programs could soon turn into an international crisis that might come even earlier than expected, said USA Today in a report. North Korea’s advances in nuclear weapons and missile technology make defense planners “nervous and alarmed,” as said by Narushige Michishita, director of the security and international studies program at the National Graduate Institute for Policy Studies in Tokyo. Pyongyang carried out two nuclear weapon tests earlier this year, including dozens of missile tests, which failed to adhere to U.N. sanctions. Now, while not all missile tests were successful, the country mate significant improvements in the development of nuclear weapons as well as the tech which can help them attach the nukes to long-range missiles. Also Read: North Korea Declares War 2016- Kim Jong Un Ordered Preemptive Nuclear Strikes Against America The latest missile launch preparations have been reported to be active at North Korea’s Sohae launch facility. As reported by USA today, North Korea has roughly 20 functional nuclear weapons, and plans to build an arsenal of around 50-100 nukes within the next five years. Pyongyang also boasts of a whopping 200 to 320 medium-range Nodong ballistic missiles that are capable of reaching major cities in Japan, along with key U.S. military bases there. The long-range missiles can reach the U.S. bases in Guam and even Alaska. Meanwhile in North Korea, Pyongyang authorities have ordered citizens to donate tin foils as a support to the military for the purpose of camouflaging military facilities. Shielding the military bases with tin foils “will reflect light”, making it impossible for satellite cameras to take pictures, Pyongyang authorities told citizens. “Those households unable to donate tin foil are being asked to make cash donations,” as reported by a UPI source. Locals, however, have criticized the latest measures are pointless, citing the plight of North Korean soldiers suffering from malnutrition and other problems. If you want more World News , subscribe to our daily newsletter or follow us on Twitter and Facebook . Continue Reading'"}, "time": 1742564216.8659322}