{"duration": 0.05320596694946289, "input_args": {"text": "'\\nby Adan Salazar, INFOWARS \\nDemocrat presidential candidate Hillary Clinton was dubbed a “high priest” and a “goddess of the occult” in a letter recently sent from Romanian hacker Guccifer to Fox News. \\nThe letter is receiving renewed scrutiny following revelations Friday that Clinton campaign chairman John Podesta attends bizarre occult rituals involving a mixture of breast milk, blood and semen in what is being termed the most disturbing email exposed by Wikileaks. \\nBack in September, Fox News posted images of the letter it received from Guccifer, whose real name is Marcel Lazăr, postmarked September 16, 2016, in which he claimed the goal of the “Guccifer project” failed because he was unable to “fully expose the Illuminati / the council and their crimes.” \\nHere’s a transcript of his letter: \\n“The Romenian authorities query that I have to be sent back home “right away”, is a silly, hasty move, by the way. \\nI will not leave this beautiful country without saying that the “Guccifer Project” was a failed project. My will / intention was to fully expose the Illuminati / the Council, and their crimes, but I failed! \\n“Hillary Rodham Diane Clinton is one of the high priests, a goddess of this ocult, satanic, shadow group. One must see their evil and profoundly corrupt nature to understand what I am talking about. \\n“Though I know I invested a great deal of time & effort trying to expose the crimes of the Rockefellers, the Bush klan, the Clinton, and many others, maybe my skills (or lack of skills?) were NOT matching my faith. \\n“So, I apologize in front of the unknown soldiers who struggle to take this fight against these monsters to a glorious end. Many of ’em are risking their lives, while doing this behind the computer screens, from inside or outside the system.” \\nOn Friday Wikileaks dropped a shocking email showing Clinton campaign chair John Podesta and his brother being invited to a “spirit cooking” dinner hosted by performance artist Marina Abramovic, where a mixture of semen, menstrual blood and breast milk are bizarrely used as mediums to create a “painting.” \\nIn an email dated June 28, 2015, Abramovic wrote, “I am so looking forward to the Spirit Cooking dinner at my place. Do you think you will be able to let me know if your brother is joining? All my love, Marina.” \\nLazăr was sentenced to seven years in federal prison in May after he pled guilty to hacking the computer systems of high level government operatives, including Clinton ally Sidney Blumenthal and former Secretary of State Colin Powell. \\nLazăr also claimed it was easy to hack Hillary Clinton’s private email server during her tenure as secretary of state. '"}, "time": 1742563319.5080366}