{"duration": 2.2714502811431885, "input_args": {"text": "'I’m running on about an hour and a half of sleep and my nails are damn near chewed to the bone. This because, as a diehard Cubs fan, I was up until nearly 1:00 AM working to come to grips with what I had just witnessed. Once I finally went to bed I found myself tossing and turning so at 3:30 I said screw it… I’m heading to the office.\\nMy beloved Cubbies had just won the World Series, defeating the Cleveland Indians in what is likely to go down as one of the most EPIC game 7 battles in the history of professional baseball. The Cubs haven’t won a World Series since 1908, making this Championship something we Cubs fans could only dream about until it actually happened last night.\\nAs prediction hub FiveThirtyEight put it just a few days ago… the chances were slim. How slim? Slimmer than the odds of Trump winning next Tuesday.\\n\\nAn impossible scenario just become very possible. And fortunately for America, another seemingly impossible scenario is now suddenly started to look very possible.\\nA Hillary Clinton indictment is now likely .\\nThis coming via FBI sources telling Fox News host Bret Baier that the FBI is moving towards what is “likely an indictment.”\\nBaier’s report includes the following key points .\\n1. The Clinton Foundation investigation is far more expansive than anybody has reported so far and has been going on for more than a year.\\n2. The laptops of Clinton aides Cherryl Mills and Heather Samuelson have not been destroyed, and agents are currently combing through them. The investigation has interviewed several people twice, and plans to interview some for a third time.\\n3. Agents have found emails believed to have originated on Hillary Clinton’s secret server on Anthony Weiner’s laptop. They say the emails are not duplicates and could potentially be classified in nature.\\n4. Sources within the FBI have told him that an indictment is “likely” in the case of pay-for-play at the Clinton Foundation, “barring some obstruction in some way” from the Justice Department.\\n5. FBI sources say with 99% accuracy that Hillary Clinton’s server has been hacked by at least five foreign intelligence agencies, and that information had been taken from it.\\nThat’s a pretty strong case for indictment. Of course, the corrupted DOJ can still do everything in its power to block justice, but it now appears the FBI is throwing DOJ demands out the window.\\nGonna be an interesting few days ahead, folks. For those of us who are Cubs fans and news junkies sleep is not on the agenda.\\n'"}, "time": 1742563071.5225708}