{"duration": 0.0321195125579834, "input_args": {"text": "'We all know a new era dawns in Washington in approximately 12 days, but why should Hollywood wait? Kicking off the E! red carpet show at the 74th Annual Golden Globes on Sunday night, Ryan Seacrest served notice to all that as far as awards season goes, change starts now. “‘Who are you wearing?’ That’s so done,” he said, not long before admitting he was, as it happened, wearing a   tuxedo from his Ryan Seacrest Distinction collection. Conflict of interest issues aside, it was a provocative statement, even in a time when practically every day brings a new provocative statement over the Twitter superhighway. Could it be true? Would 2017 usher in a time when actresses (and actors) did not have to   their clothes as part of the price of entry? Dream on. The   complex is alive and well and serving its prime purpose: marketing a moment of fantasy and escape. Kerry Washington did her job by not only introducing her     dress as by Dolce  Gabbana but by announcing that it was their special couture line and had never appeared on a red carpet before. Never, in other words, been seen by the general public’s eyes. Sprinkle a little of that    diamond dust on all of us. She wasn’t the only one who could. Ruth Negga also modeled   gold: this time sequins, this time with a futuristic   cool, this time by Nicolas Ghesquière for Louis Vuitton. (It never hurts to send a subliminal message by modeling yourself after a statuette, perhaps the reason it was something of a trend.) When Lily Collins appeared in full   pink beaded Zuhair Murad, her oversize bun like a nest just made for some twittering Disney canaries to land in, it was clear as far as fashion went we were in, well, La La Land. There were trains, on Winona Ryder’s strapless black Viktor  Rolf ball gown and Claire Foy’s Titania dress. Pink was a dominant color, as seen on Felicity Jones, doing a kind of sexy Jane Eyre impersonation in trompe l’oeil Gucci, and Carrie Underwood, in a    top so was yellow (Natalie Portman’s maternity Prada, ’  and very Jackie) and yet more gold on Naomie Harris in an Armani column and Sarah Paulson in Marc Jacobs. Mandy Moore had a   chiffon cape attached to the back of her plunging Naeem Khan gown, the better to do some superhero billowing with a twirl. And if Nicole Kidman’s Alexander McQueen        slip dress was a bit of a medieval shipwreck, and Drew Barrymore’s Monique Lhuillier suggested she was about to transform into a superglamorous sea gull, Emma Stone’s     Valentino covered in stars hinted she could twinkle like a constellation all on her own. And so it went. Sarah Jessica Parker swept by in a   white Vera Wang   dress (not really, presumably). Ye olde Hollywood brigade was best represented by Brie Larson in full Veronica Lake waves and red strapless Rodarte gown with a beaded, corseted top Blake Lively in molded black velvet Versace with gold chain mail   trim and a host of liquid sequined columns on Viola Davis (  yellow, Michael Kors) Amy Adams (strapless, wine black, Tom Ford) and Kristen Bell (    black Jenny Packham). But then Evan Rachel Wood showed up in a   custom Altuzarra tuxedo, referencing both David Bowie and Marlene Dietrich, because “I wanted to make sure young women and girls understood they didn’t always have to wear dresses it’s not a requirement. ” Not that she was trying to “protest dresses,” she said. Ditto, presumably, Octavia Spencer, powerful in another custom tux, and also talking about inspiring the next generation of girls. By the time Pharrell Williams appeared in a white Chanel jacket from the “2012  ” women’s collection, the gender gauntlet was thrown. It made all the froth and familiar fantasia seem   and close to irrelevant. Sure there were few really silly looks (Janelle Monáe’s   Armani and Olivia Culpo’s folkloric      Zuhair Murad among them) but there weren’t a lot of memorable ones, either. Thandie Newton, in Monse, wore one of them.    strict and   the white dress was unadorned  —   except for a hint of   flames licking their way up from hem to calf. Just in case anyone forgot the somewhat incendiary nature of this particular time.'"}, "time": 1742628524.7684128}