{"duration": 0.10296964645385742, "input_args": {"text": "'STORRS, Conn.  —   One year ago, on the night after Super Bowl Sunday, Geno Auriemma sat alongside three stalwart seniors and momentarily imagined a coaching life without them. “I start to blink because I look out there and start to think that these three are not going to be there next year,” Auriemma, coach of the Connecticut women’s basketball powerhouse, said after a solid road victory over   and   South Carolina. He also appeared to be blinking away a tear or two at the thought of losing those three players: Breanna Stewart, Moriah Jefferson and Morgan Tuck. That moment of emotional reflection for Auriemma, who is better known for biting sarcasm, came after a 60th consecutive victory, to which the Huskies predictably added 15 more on the way to their fourth straight (and 11th overall) national championship. Not many, including Auriemma, would have bet the mortgage on the streaks  —   both in games and titles  —   lasting much longer. But on Monday night, in a   and expectant Gampel Pavilion, the Huskies made it an even 100 straight victories, swarming that same South Carolina team,   to cross the   threshold. The Huskies did it behind their   forwards, Gabby Williams and Napheesa Collier. Williams scored 26 points and grabbed 14 rebounds while Collier added 18 and 9. “Continuing what they’ve done for so many years,” said Williams, referring to past iconic Huskies, several of whom, Stewart included, watched from the stands. It starts to sound ridiculous, but the Huskies,   this season, have not lost since November 2014 (in overtime at Stanford). If not for that loss, they’d be working on a streak of 148 straight. Even Auriemma sounded at a loss to explain this. He settled on “it was meant to be” after weeks of insisting that he and his players never talked about No. 100. Against the   and No. 6 Gamecocks, the subject was unavoidable. And after 12 successive blowouts in an American Athletic Conference in which the Huskies have gone   since its formation, the prospect of stiffer competition was preferable. With an eye on bigger game, the N. C. A. A. tournament, Auriemma said: “The   streak isn’t all theirs. They carried the streak across the finish line. But if they win the national championship, it’s all theirs. ” It’s not as if the act of breaking records is new to his program. A previous record   winning streak (surpassing the U. C. L. A. men’s record established from 1971 to 1974) was bested by the current run last month. There is no doubt that a potential fifth straight national title, and 12th over all, are numbers more appealing to Auriemma. But triple digits in consecutive wins represents another symbolic groundbreaking and powerful statement in the continued and collective excellence of a women’s sports team. Only once had Auriemma’s program come this close to 100  —   a   winning streak that stood at 99 when an upstart St. John’s team won at Gampel in February 2012, before Connecticut’s departure from what was then a highly competitive Big East Conference. “Senior night, packed house at Gampel, as always,” Kim Barnes Arico  —   then the St. John’s coach, now in her fifth season at Michigan, where she has built a     team  —   said in a telephone interview. With St. John’s trailing by 2 points in the final seconds, Barnes Arico decided during a timeout to try for the win rather than overtime in such a challenging environment. Shenneika Smith  —   “she hadn’t made a 3 in weeks”  —   sank the winning shot. On the bus ride home, Barnes Arico’s cellphone rang. “It’s Geno, calling to congratulate me after what had to be a crushing loss,” Barnes Arico said. Auriemma had been supportive of her efforts to elevate the St. John’s program, which is why, she said, “I can’t help but applaud what he’s doing there, going for 100 straight, just incredible. ” That said, she was “holding off” on reaching out, or rooting for either side on Monday, given her ties to South Carolina Coach Dawn Staley. Barnes Arico has coached   and   U. S. A. Basketball teams with Staley, a   Olympian and, like Auriemma, a Naismith Memorial Basketball Hall of Fame member. “Either way, such a great story,” Barnes Arico said. Staley’s team  —   as have most ranked teams  —   presented Connecticut with its usual handicap of a size disadvantage, with their    star, A’ja Wilson, and the    center Alaina Coates. But the Huskies countered with Williams, only   and Collier,    —   both quick jumpers who play bigger than they are. After Wilson helped keep the Gamecocks within   at the half, the Huskies limited her to 5   points. They took control late in the third quarter and were never threatened in the fourth. “You can’t let your guard down  —   UConn is going to make you pay every time,” Staley said. In surmounting every obstacle on a schedule   with   opponents, Auriemma rapidly developed a cohesive Core Four to replace the Big Three of Stewart, Jefferson and Tuck, who were the top three picks in last year’s W. N. B. A. draft. “We have no preseason   but we have four really good players, and every time we need something, one of them comes up with something,” Auriemma said, referring to the juniors Williams and Kia Nurse, and the sophomores Katie Lou Samuelson and Collier. If this wasn’t supposed to be a season of extended dominance, the question entering Monday night had evolved. Would the Huskies ever lose? “It’s not if,” Auriemma said, “it’s just when. ” But if not Monday night, or sometime this season, just when? Next season, Connecticut is planning to suit up Azura Stevens, a    transfer from Duke who many believe would have been UConn’s best player this season. The Huskies will add Megan Walker, rated by some as the nation’s No. 1 high school recruit. They will return six of their seven rotation players, the exception being Saniya Chong, who shares the   position with the freshman Crystal Dangerfield. With no formidable opponent left on the conference schedule, and victories over many of the   teams already recorded, an inquiring mind wants to wonder whether the Huskies might in a couple of years be on the doorstep of 200.'"}, "time": 1742561764.477956}