{"duration": 0.16827607154846191, "input_args": {"text": "'| November 14, 2015 at 10:33 am | Reply \\n“STEREOTYPES EXIST FOR A REASON” \\nAND EVERYONE DOES IT, SO DON’T ACT LIKE YOU’RE EXEMPT FROM A HEALTHY WAY OF EXAMINING AND PROTECTING YOUR ENVIRONMENT. \\nI noticed this subject coming up more than once in the news feed on FB today, that I thought I’d address it, instead of acting like it’s the “Big Elephant In The Room”…The “Elephant” is that ONLY WHITES are to blame for stereotyping and racism, and that BLACKS are the only ones who receive racism, that is so far from the truth, as can be found in any google search on how whites are treated by blacks. Studies have found they are MORE racist than whites and I know why, mainly due to the “Chip That Is ON Their Shoulder”…discussed later. \\nRacism and stereotyping exist not only because of the obvious, like ones experiences and their encounters with certain individual types, but also what one has been taught, (right or wrong) or better yet, both experience and what they have taught matches, so how can one NOT come to a solid conclusion? At this point their views are pretty much sealed. Kind of like getting “SAVED” it isn’t enough to know in your head something is true about JESUS and His word, but once the heart agrees, then it’s pretty much sealed. Why are BLACKS (sorry not into being politically correct, no one is calling me an “EUROPEAN AMERICAN”…and REAL Africans hate the comparison…lol, google it) the ONLY ones who CRY RACISM at every turn, at every perceived injustice, at every corrective criticism, at every comment made, at not taking accountability for their actions, etc?….The main reason is…. \\nTHE VICTIM MENTALITY: Want to read a great book on the subject, Ken Hamblin’s “Pick A Better Country” and “Plain Talk And Common Sense”…I have them both and I use to listen to him when he was on the air and he is right ,and he is as “black” as they get, (color wise) and he is from Harlem. So I trust his and Bill Cosby’s (although, he has tarnished his name now) take on the “VICTIM MENTALITY”. All one has to do is look around them and see it is true. \\nAs you can see, my focus will be on RACISM against “People Of Color” not against whites, because that is the consensus going around and what I have experienced and others I know have experienced. And before anyone tries to call me a RACIST, I am not! I judge people individually, till you prove the stereotype right, then that only makes me MORE cautious of the next person who comes along. And so far in my 51 yrs of EXPERIENCE, I have learned that “STEREOTYPES EXIST FOR A REASON”. But, like everyone else who has their flaws, such as any white insecure jealous woman, or any man trying to get into my pants, or anyone who exhibits “Unsafe” or “Unhealthy” attributes, I will still give another person, no matter what their race is, the “benefit of the doubt”, although I will say, some more than others. I’m not stupid, or ignorant, it’s called being WISE. It is one thing to respect others and be cordial, it is another to just let anyone into your life, or do business with them. Trust is earned not freely given. . Going back to the “VICTIM MENTALITY”, this is what is HOLDING THE BLACK COMMUNITY DOWN and is why stereotypes and racism exist. Saying it doesn’t, or trying to TWIST or SPIN into existence something that just isn’t true, will not FLY with most who have even half a brain. Common Sense and ones Experience will always trump “POLITICAL CORRECTNESS”. The media doesn’t want you to know the truth as they OMIT or SPIN things, but they can only do so much, because of all the REALITY SHOWS. (uncensored behavior and mentality) and NEWS PIECES that portray a better reality. Sad thing is too many just won’t say anything, they just talk in private about the subject among those liked minded out of FEAR! But truth is truth, so here goes. \\nDoes anyone else find it interesting that throughout history, many different races, if not all have been slaves, ( http://en.wikipedia.org/wiki/History_of_slavery ) yet ONLY BLACKS are left with a “VICTIM MENTALITY?”…don’t get me wrong, what was done to them and any slave at the time or in the past and even now (Are we focused on the 200,000 sex trafficked in Sacramento alone???…of course not!!!) was wrong. I would have to say that the MISTREATMENT and abuse of another is wrong, but slavery was a way of life even going back to the biblical times. When you think about it, we are ALL SLAVES to something. Slavery and bondage are a way of life even when it comes to ourselves. Some are in BONDAGE to their desires and indulgent behaviors, to their insecurities, to their relationships, to their job, to their boss, to their parents, to their children etc. The only “FREE SLAVE”…is one who is a bond servant to Christ and who has follow His Lordship in their life. OK, no rabbit trails, I’ll leave it at that. \\nPoint is SLAVERY is not as dirty of a word as many would like to think….Like many things in our lives, it isn’t what happens to us that matters, but what we DO with it….sad to say, most, but not all blacks throughout history have chosen to take the NEGATIVE REACTION for their “lot in life”…The “Blame Game” is so unbecoming… and senseless. I don’t care who you are, if one cannot take ACCOUNTABILITY individually for their own actions, in spite of their surroundings and circumstances, then one will naturally FALL PREY to the negativity that comes with that choice. One of my 5 Factors, is 1) ONES OWN SIN. (starts here) John Mcwhorter and Ken Hamblin adequately and articulately explains all the ends and outs of a VICTIM MENTALITY among the black community, way better than I can. All I know is, no other race that has been slaves throughout history has played the “RACE CARD” nor have they proclaimed themselves as “VICTIMS”…none. If anything they OVERCAME and CONTRIBUTED! They banded together (did not destroy each other, black on black crime is extremely high, 90%) and supported each other, financially and in many other ways, to say “WE ARE A PROUD PEOPLE, WE CAN DO THIS” \\nMore food for thought. I have often wondered, have any of those who feel such an outrage against how the blacks were treated while enslaved (all nationalities throughout history endured the same, blacks are no different) ever thought about what I am about to say? Like I said, we all have choices to go POSITIVE or NEGATIVE in any given situation and to me I would think the black community would be able to “move on”….be THANKFUL for being brought to AMERICA for their future generations after slavery. Look what they were SAVED FROM. (For one America gave them CHRISTIANITY/SALVATION!) \\nWho possesses more slaves today than any other group…AFRICA! http://en.wikipedia.org/wiki/Slavery_in_Africa so why is it OK, that blacks can enslave blacks, but no other group can? Why is it that blacks can call themselves degrading names, yet no one else can? Why can they kill whites and not be called racist, but if a black is killed by a white automatically they are racist? Why the double standards?…Do they really want to go back to…. \\nGENOCIDE, SLAVERY, RAPE an epidemic of AIDS etc. And black women, do you really want to be dominated by a man and treated as property and have your cliterious cut off as a child (without any anesthetic) and live the life of an average African woman….. very hard work, no pleasure, no value, life of servant hood (slavery) always in fear? \\nSeriously, what are these”Victim Mentality Type” people fighting for? Do they want to go back to Africa? Of course not, they claim they want to be treated EQUALLY…Well, that sounds fair to me, THEN ACT LIKE IT! \\nSTOP fitting the “stereotype”, be the one who says, I don’t care what others think of me, if being an “Uncle Tom” or a “Sell Out” is what it takes to be “Equal” then so be it. I will not play victim, I will “Take The Bull By The Horn” be accountable for my behavior and do what it takes legally, ethically, morally and responsibly to “FIT IN!” and if more and more people did that then stereotypes would change. \\nI could write more on the subject, but feel this is a good place to stop.'"}, "time": 1742561727.3107831}