{"duration": 0.0160372257232666, "input_args": {"text": "'Mittwoch, 2. November 2016 Peinlich: Terrorist vergisst Koffer mit Sprengstoff am Bahnhof Köln (dpo) - Es sollte sein erster Auftrag für eine ausländische Organisation sein – und er wäre beinahe in die Hose gegangen: IS-Terrorist Samir K. (21) hat seinen Sprengstoffkoffer im Kölner Hauptbahnhof vergessen. Nur der Aufmerksamkeit eines Bundespolizisten ist es zu verdanken, dass der schusselige Fanatiker das Gepäckstück letztlich wiederbekam. \"Uff! Das ist ja gerade nochmal gutgegangen\", stöhnt Samir K. erleichtert und legt eine Hand auf den so wichtigen Koffer. \"Hoffentlich erfährt nie einer meiner Mitjihadisten davon, sonst werde ich zum Gespött meiner ganzen Schläferzelle.\" Der Vorfall ereignete sich bereits gestern Abend: Der 21-jährige Islamist kam gerade mit dem Zug aus Berlin, als er im Ausstiegstrubel versehentlich seinen prall mit Sprengstoff gefüllten Koffer mitten auf dem Bahnsteig stehen ließ und sich in Richtung Ausgang begab. Kurzzeitig herrenlos: Gepäckstück Ein Bundespolizist sah das Missgeschick glücklicherweise via Überwachungskamera auf seinem Monitor und schritt kurzentschlossen ein. Er lief zum Gleis, schnappte sich den Koffer und brachte ihn dem verdutzten Terroristen zurück. \"Der Mann - ich schätze, er ist Elektriker, weil aus seinem Koffer Kabel hingen - war ganz überschwänglich und bedankte sich mehrmals bei mir\", berichtet der Polizeibeamte Martin Ferber. \"Ich selbst würde auch erstmal schlucken, wenn plötzlich der Koffer mit allen meinen Arbeitsmaterialien weg wäre.\" Dank dem beherzten Einschreiten des Bundespolizisten kann die bereits weit fortgeschrittene Anschlagsplanung von Samir K. und seinen Kollegen jetzt weitergehen: \"Wir müssen den Sprengstoff nur noch in ein unverdächtiges Behältnis füllen, einen geeigneten Ort mit vielen Menschen finden, wo dieses nicht weiter auffällt und dann kann es auch schon losgehen.\" pfg , ssi, dan; Foto oben: Shutterstock/ EduardHert , CC BY-SA 3.0 , Foto unten: Shutterstock Artikel teilen:'"}, "time": 1742628601.6076176}