{"duration": 0.15135574340820312, "input_args": {"text": "'RIO DE JANEIRO  —   The playing of the United States’ national anthem at Olympic medal ceremonies is bringing tears to the eyes of American athletes here. Elsewhere, the song is having a very different effect. “It is driving me crazy,” said Jason DeBord, a    living in Ann Arbor, Mich. “I hit the mute button, or I make dinner, or I just sit there and brace myself. ” DeBord has nothing against displays of patriotism, nor is he simply eager to return to the action. What irritates him is the version of “The   Banner” being used at the Olympics. Put bluntly, it has been butchered. O. K. that might overstate the problem. Maybe it would be more accurate to say the song has been altered in ways that rob it of its oomph, its power and its optimistic essence. Specifically, DeBord said, this “Banner” segues several times to minor chords, which in the Western canon are considered melancholic, in places where major chords, which are heartier and more upbeat, are the norm. The effect, DeBord said, is a rendering of the anthem that is darker and sadder. “It has a totally different emotional feel,” he said. “It is supposed to have an ascending chord structure. Instead, it sort of has a descending chord structure. ” In short, this is a defeatist “  Banner,” and it is broadcast, around the globe, at a moment of ecstatic, international triumph. DeBord, who spent 16 years on Broadway as a conductor and pianist, is on the faculty at the University of Michigan’s department of musical theater. He is the first to admit that few people are likely to notice, let alone be bothered by, the elements of the song that annoy him. But when he posted his feelings on his Facebook page, he quickly found that he had company. Lots of perturbed company. “Glad it’s not just me,” one commenter wrote. Another person posted: “Sounds like a music school project gone awry. Just awful. ” “I’m not on Twitter,” someone else added, “but there must be a way to tell ‘them’! !!” Asked for the particulars of his beef with this “Banner,” DeBord offered to head to the piano in his home and provide a live tutorial, over the phone. He quickly plowed through the beginning of the song  —   “O say, can you see, by the dawn’s early light”  —   but stopped when he got to “What so proudly we hailed. ” At “proudly,” he noted, the Olympic version of the anthem goes to one of those sad, dark minor chords where majors have long been the norm. He played the standard version and then the Olympic version  —   standard, Olympic, over and over. Once he pointed out the difference, it was obvious. The Olympic version was conciliatory, maybe even retreating. The standard version was   and on the offense. “It happens again on ‘rockets’ red glare,’” he said, hands on the piano, “and then again on ‘land of the free. ’” There is no official or definitive version of “The   Banner,” and that is no accident. The 1931 bill signed into law by President Herbert Hoover that adopted the song as the nation’s anthem is a model of terseness. It is mum about both lyrics and arrangement, which, said Mark Clague, an associate professor of musicology at the University of Michigan, is one reason the anthem has continued to evolve over the years. “When Francis Scott Key wrote it, he’d just seen a decisive victory in Baltimore in the War of 1812, which was like a second war of independence,” he said in an interview. “He writes the song in celebration, and it’s played for years with a celebratory feel,   and light. Only later does it become the song we know, slower and more majestic. ” Clague, who is working on a book about “The   Banner,” did indeed notice the new Olympic take on the song. What struck him most was the way it handled the climactic “land of the free,” which is typically wrung for maximum emotion. “Here it goes to a minor chord,” he said, “so rather than having that firm, confident expression of the word ‘free,’ you get an unstable, questioning chord. Where you should be feeling victory, you have a question mark. ” Clague sounds less bothered by this take on the anthem. Maybe it is because he knows thousands of versions have been created over the years and he regards the tune as a variety of clay that everyone is free to mold. He also surmises that the arranger was adapting the song for the moment. “When we play the anthem in the U. S. it’s often all about creating a sense of unity in the country,” he said. “The Olympics is a very different context. We’re really celebrating brotherhood, international cooperation, rather than martial qualities that anthems are often called upon to express. Three flags are being raised, not one. So I think that what has happened here is they’ve softened the song,   the militant aspect and emphasizing the song’s lyrical side, to bring out the    idea. ” The United States Olympic Committee said it was not responsible for submitting the anthem to Olympic organizers. The group that is running the Rio Games said it would look into the origin of the United States anthem being played here. This version may not be making its Olympic debut. According to DeBord and Clague, the version heard here in Rio was also used at the 2014 Winter Games in Sochi, Russia, and the 2012 Summer Games in London. Those were in the key of C major and were 70 seconds long. During a medal ceremony, Shazam, the song identification app, tagged the track as “The London Philharmonic Orchestra  Philip Sheppard. ” If this rendition originated in London, where did London get it? As it happens, a 2012 YouTube video shows the ambitious effort undertaken in the   to the London Games to record new arrangements of more than 200 national anthems. That project was led by Sheppard, a British composer, cellist and professor at the Royal Academy of Music whose website states that he has scored more than 30 films and worked with David Bowie, Jeff Buckley, the Weeknd and many other recording artists. In the video, he is seen conducting the London Philharmonic Orchestra at Abbey Road, the studio made famous by the Beatles. Sheppard could not be reached Wednesday. “The anthems serve a particular purpose at the Olympics,” he tells an   interviewer in the video. “That is namely to get the flag up the pole during the gold medal ceremonies. ” He is making the practical point that the songs cannot go on and on. So one of his biggest challenges, he said, was ensuring that each anthem lasted 60 to 90 seconds. This meant dramatic cuts for some anthems  —   like Uruguay’s, which usually lasts for six and a half minutes  —   and looping repetition for others, like Uganda’s, which is only nine bars long. All the countries had to sign off on the new arrangements, Sheppard says. At one moment in the video, he sounds a little nervous about whether Britain will give a  . The video ends, inexplicably, with the full,   rendering of “The   Banner” as the camera shows an American flag. There is no commentary. Is it possible that Sheppard went with minor chords as a way to shave time off the tune? The standard “land of the free,” for instance, when milked properly, takes its time. DeBord doubts it. But for him, the need for edits could never justify such maddening results. “You don’t need to compromise a piece of music,” he said, “to make it work for time. ”'"}, "time": 1742561749.1010938}