{"duration": 0.07816815376281738, "input_args": {"text": "'Eight ways to strengthen our democracy beyond voting The strength of our civic life depends on what we do outside elections. By Chuck Collins   Chuck Collins \\nThroughout this trying election season, we’ve been told how much is at stake with our vote. But the success of any democracy depends on continuing to pay attention long after we cast our ballots. \\nSo let’s pledge to strengthen our democracy with a few resolutions to focus our intentions and keep us moving forward over the next four years. \\n1. Change your media diet . \\nWay too much ink, airtime, and mental real estate has been consumed by the horserace reporting on elections—it’s all about who’s winning and losing. So unplug from the talk shows that interview pollsters and engage in partisan bickering all day. Find the commentators and independent media outlets that strengthen our civic life. \\n2. Turn off corporate media. \\nThis election has been very profitable for big media corporations, but bad for our democracy. As CBS chairman Les Moonves remarked , “Man, who would have expected the ride we’re all having right now? The money’s rolling in and this is fun.” \\nOur differences have been compounded by media reports that amplify the loudest and most partisan utterances. Election coverage this year has encouraged us to view one another as cartoon caricatures, not neighbors. \\n3. Reject the consumer mentality in elections . \\nWe’re encouraged to view national elections like consumers buying a car, but presidential elections can make most of us feel like spectators, not participants. Election Day is a small part of our real democracy—think of voting as a tiny fraction of your civic life. \\n4. Make your voice heard . \\nPledge to communicate with your elected officials all year round, not just when they want your vote. Call, write, email, and attend community forums. When a politician hears from a dozen constituents with the same concern, it matters. \\nA few resolutions must address our polarized political atmosphere. The only way to break through this is by connecting with people we don’t always agree with. \\nFor instance, the liberal California sociologist Arlie Hochschild spent five years interviewing conservative Tea Party activists in Louisiana, making friends and asking deep questions. She urges us all to scale the “empathy wall” and learn each other’s stories. \\nHere’s a few easy ways to get started. \\n5.Try a social media fast. \\nSocial media is amazing, but it mostly serves as an echo chamber to reinforce our existing views. It’s not a substitute for talking to people, asking questions, and learning why people support certain policies. \\n6. Practice the art of civil discourse . \\nFind ways to meet others face-to-face to engage in conversations, not soapbox speeches and debates. Look at the “ Living Room Conversation ” movement that brings people together across political divisions. Their goal is to encourage “authentic, respectful conversations” to “strengthen relationships and advance understanding of the challenges, opportunities, and solutions before us.” \\nFinally, other resolutions should focus on changing our polarizing election system. \\n7. Eliminate the wealth primary . \\nLong before voters cast their ballots in a primary, big money donors have winnowed the field and selected who will stand for election. People all across the political spectrum agree that we need fundamental campaign finance reform to reduce the influence of big money, including the repeal of Citizens United . \\n8. Break the two-party duopoly . \\nA growing number of voters have declared independence from the two major parties. So why do we allow other voices and perspectives to be excluded from presidential debates? Our democracy would benefit if we had real choices outside the two major parties, as they do in most other countries in the world. \\nThe strength of our civic life depends on what we do outside elections. And especially after the deeply toxic experience of 2016, we all need to step up to protect our real democracy from those who profit from division. \\nChuck Collins co-edits Inequality.org at the Institute for Policy Studies and is author of the new book, Born on Third Base: A One Percenter Makes the Case for Tackling Inequality, Bringing Wealth Home, and Committing to the Common Good . Distributed by OtherWords.org.   permalink .'"}, "time": 1742563294.019088}