{"duration": 0.07617425918579102, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / US Air Force Command Apologizes for Flying Close to Russian Jets over Syria Essential Reading Who Really Murdered Holly Wells and Jessica Chapman? By wmw_admin on February 28, 2015 \\nRevelations that a US soldier was the killer would have jeopardised public support for the “War on Terror”. Hence a frame-up was required. A Joe Vialls classic recovered. “Holocaust” declared 7 years before there was a “Holocaust” By wmw_admin on December 13, 2014 \\nThe New York Times was already reporting of Jewish persecution and an ongoing “Holocaust” in May 31, 1936 9/11 Masterminds – Explosive Connections By wmw_admin on October 7, 2011 \\nThis brilliant video investigation reveals more incriminating evidence on those behind 9/11. Includes stunning revelation on Bush cousin Jim Pierce’s role. Highly recomended The Lady, The Queen and what it really means By wmw_admin on December 28, 2009 \\nEvery picture tells a story and with some photos and a few words Paul Powers shows us what was hidden in the background when Queen Elizabeth II met pop sensation Lady Gaga The Life of an American Jew in Racist Marxist Israel Part I By wmw_admin on July 2, 2007 \\nJack Bernstein was a rarity, an American Zionist who ‘returned’ to Israel, not for a holiday but to live and die in Israel building a Jewish nation. What makes him almost one of a kind, however, was his ability to see through the sham of Zionism The Illuminati Chronicles Part II By wmw_admin on November 28, 2007 \\nA Short History of the New World Order Part II By cyberpatriot@hotmail.com Aug. 10, 1973 – David Rockefeller writes an article for the “New York Times” describing his recent visit to Red China: “Whatever the price of the Chinese Revolution, it has obviously succeeded not only in producing more efficient and dedicated administration, but also […] Affidavit of Richard Tomlinson By wmw_admin on February 14, 2008 \\n“I firmly believe that there exist documents held by the British Secret Intelligence Service (MI6) that would yield important new evidence into the cause and circumstances leading to the death of the Princess of Wales.” Reincarnation and the Early Christians By wmw_admin on January 7, 2009 \\nReincarnation was an integral part of early Christianity (as was strict vegetarianism. Ed.). Near Death.com explores what it refers to as the “secret teachings of Jesus” and how all traces of it and Christian Gnosticism were later erased The Essene Gospel of Peace I By wmw_admin on April 26, 2007 \\nBased on texts found in the Vatican library and the Royal Library of the Hapsburg’s and dated to the first century AD, the following is considered by some to be the real words of Christ Holocaust, Hate Speech & Were the Germans so Stupid? – Updated By wmw_admin on March 23, 2011 \\nThe brilliant examination of the ‘Holocaust’ by Anthony Lawson has since been censored on the basis of a false Copyright infrigment. But as Lawson explains, this just another attempt to stiffle freedom of expression\""}, "time": 1742562042.5284257}