{"duration": 0.12449765205383301, "input_args": {"text": "'I was assaulted the other evening when I was strolling along the High Line. Maybe groped is the more physically accurate word, but given the nature of the violation and the feelings of anger and helplessness it kicked off, I can’t help considering it an assault. It happened a little after 7 p. m. on a brutally humid evening, but a promising one. I was walking home from an art opening in my favorite   dress, enjoying the deep summer scent of the gardens, thinking about going to a bar in Brooklyn that promised rowdy opera  —   horned helmets optional, the website says. Really, is there anything you can’t find in New York on a summer night? I see three teenage boys, maybe ages 13 or 14, walking in my direction. Suddenly I feel a hand shoot up my skirt and a kid grabs the outside of my thigh. There’s laughter. Then the kids run off. You know the lightning responses you see in action movies when an attack takes place? I don’t have those. I stand frozen for what seems like a long time as my brain processes what has just happened.  Huh? Was that a hand on my thigh? That hand was under my dress. I turn around to see where the creep has gone and see him and his two buddies half a block away. They aren’t running, they’re looking over the rail, scoping out the crowd. I see no police officers. Obviously I’m going to have to take justice in my own hands. “CREEP!” I yell. The kids sneer. Then I remember what the modern victim is supposed to do: Get a photo. I open the flap of my   bag unzip the phone pouch try to unlock my phone with a sweaty fingerprint  —   and fail, because wet hands mess up the ID punch in my security code swipe through the icons for the camera find it and aim. By which time the kids have, of course, disappeared. You know those assault horror stories that have exploded this summer? Women groped on subways perverts exposing themselves black drivers pulled over and terrorized by the police officers murdered by snipers. What has amazed me about these crimes is the ability of many victims or   to quickly grab their phones and get a photo. Or   the attackers on Facebook. America is a country of   artists, with apps instead of guns. But not me. I am, I realize, one of those helpless townspeople who after years of being terrorized by a gang of sneering bandits, would have to hire a gunman. Clint Eastwood, say, in a remake of “High Plains Drifter”  —   call it “High Line Drifter. ” Clint  —   I am talking the young, chiseled Clint, not the Clint who talks to chairs  —   would have known what to do with that groper. He would have gotten a photo and posted it on Twitter instantly. Then he would have sprinted after the creep and dangled him by his heels over the High Line rail, two stories over 10th Avenue  —   dangled him with one hand,   him on Periscope with the other. Clint would not be oblivious to how I look in my favorite summer dress either. “You know a good place for fried chicken?” Clint would ask me, as the kid begged for mercy. “I like fried chicken. ” Then Clint would drop the creep on 10th Avenue and there would be a public outcry and his   license would be suspended and I would still not have a boyfriend. Where was I? Oh, yeah, my inability to handle a locked and loaded cellphone. Obviously I needed to brush up on my technological skill set, which means rounding up a young person. The ones I rely on are my nieces, Caity and Freyja. They tell me which printer to get and why I should not be on Tinder. (S. T. D. s, and people don’t actually use it to find someone to have dinner with in a strange town.) I consult with Caity. She is horrified when she hears about the High Line incident and immediately gives me some   basics. “When you grab your phone, it’s probably going to be locked, but there’s a camera icon on the lower right,” she says. “You don’t need to unlock it to use the camera. Just swipe up and you’re ready to go. ” I had never noticed a pale gray camera icon on my phone it’s lost in a pale gray corner of my home screen, but when I put on my reading glasses I see it. And since sometimes there is a different screen and the camera icon does not appear, Caity shows me a bar at the bottom of the phone I can swipe upward. That brings up several icons, including the camera still in the lower right.   on Facebook takes longer on my phone. When Caity opens the app, a “Go Live” button appears on the   corner of the screen. Although I have the same phone, I have no such tab. I have to take an extra step going first to my page, then opening the “What’s On Your Mind” tab to find the “Go Live” button. I see on the web that other people are having this problem. Further research is required. But I have the basics. You know the way people practice their aim in the Westerns, shooting bottles off the fence? That’s me, metaphorically, with my phone. I’ve moved it to a more accessible pocket of my bag, and walking through Union Square, I sometimes practice my draw. Bam! Bam! Gotcha, Gandhi statue! I may not be as fast as a    but I can confidently say there’s a new sheriff in town. And if I see another creep in action, this time I will get him.'"}, "time": 1742564317.1020539}