{"duration": 0.1881394386291504, "input_args": {"text": "'Center for Security Policy President Frank Gaffney discussed the Trump administration’s opening   moves with SiriusXM host Alex Marlow on Wednesday’s Breitbart News Daily. [Gaffney began with a story about one of his colleagues delivering copies of the Center for Security Policy’s book CAIR Is Hamas on Capitol Hill and discovering he couldn’t deliver a copy to noted   opponent Sen. Pat Leahy ( ) without a government ID.  LISTEN: “This individual could vote without that ID, of course, but he can’t give Senator Leahy a book about an internal threat to our country from Hamas. It’s just ridiculous,” Gaffney said. He pronounced himself pleased with President Trump’s first week, saluting “the signaling, and the executive orders, and the statements that the President has made thus far, and the statements for that matter that even people like Rex Tillerson and his confirmation hearing made about the nature of the challenges we’re facing internationally and the necessity of rebuilding our military to contend with them. ” Among those necessary measures he included constructing a     missile defense system and eradicating radical Islamic terrorism from the face of the earth, as Trump has promised. “These are very encouraging signs,” Gaffney said. “It’s not so much an aggressive national security policy, Alex, with respect. It’s a   policy that’s rooted in the principle that Ronald Reagan, my old boss, espoused and practiced called ‘Peace Through Strength.’ I think it’s very welcome, and long overdue, frankly. ” He noted that, with the exception of the invasion of Grenada, Reagan didn’t “actually have to use our military power,” but he rebuilt it and “created, as part of a larger strategy, conditions that brought down our principal enemy  —   without firing, as they say, a shot  —   the Soviet Union. ” “I think Donald Trump gets this. If you want to prevent wars, prepare to fight them,” he advised. “There are a lot of people around the world who witnessed Barack Obama take the opposite approach, weaken us, hollow out our military, signal a desire for appeasement at any price. And they became much more dangerous. ”  “The prospect of a conflict with Communist China today, Alex, as you know, is vastly higher than it was a decade ago,” he pointed out. “And that’s partly because the Chinese have been rapidly building the military with which to attack us, and to dominate the South China Sea, and so on. But partly it’s also because they have perceived the opportunity for either getting what they want without conflict, their strategy of strength to obtain their objectives  —   or they think if they do have to have a conflict with us, they’ll prevail in it. ”  “So this is a very dangerous approach. It’s been proven to fail time and time again, whereas I believe peace through strength has been proven to work rather consistently throughout the course of human history,” Gaffney asserted. Marlow asked Gaffney about the significance of President Trump’s plan to move the U. S. embassy for Israel to Jerusalem. Gaffney described the   state of affairs as “bizarre,” noting that Israel is the only country he knows of where the U. S. embassy isn’t located in the national capital. “The signals that Donald Trump has sent, in terms of his commitment to restore the kind of strong partnership and strategic alliance that we have historically had with Israel, is a signal, a statement, of his break with his predecessor,” he said. “It’s important not just because it matters to our security whether Israel is secure, but it’s also important because it restores the sense that it’s also better to be a friend of the United States than an enemy. ” “Obama had that completely backwards, and as a result we had more enemies, and I think fewer friends,” he observed ruefully. Gaffney said moving the U. S. embassy was “important in a number of respects,” beginning with Jerusalem being “the rightful place for us to be represented. ” “Second of all, it sends a signal of our commitment to Israel, and the status of Jerusalem as the undivided eternal capital of the Jewish state,” he continued. “People talk a lot about, well, there will be violence, there will be the Palestinians and holy war and all the rest. I seriously doubt it, because I think the Arabs at this moment more generally, beyond the Palestinians  —   for whom, by the way, they don’t have a whole lot of use  —   have a view that this is a time to cultivate a relationship with Donald Trump, not precipitate conflict with him. I don’t think they’re going to have much truck with the Arab street blowing up. ” “Here’s the larger point: if Donald Trump, having made this commitment to Israel, backs away from it, that will be seen by the very radical Islamic terrorists that he has promised to eradicate from the face of the earth, as evidence that they can in fact extort him to submission. That’s exactly the wrong message to send,” Gaffney warned. “I think it’s time. I think that he can do it quite easily, actually. I believe the first order of business ought to be simply to change out the plaque in front of the consulate in Jerusalem. Call it an ‘embassy.’ It’s a done deal on Day One,” he advised. “I think there may be histrionics, but I think they’re eminently manageable. The symbolism is very important, both to Israel, and I think to potential adversaries. ” Marlow referred to the criticism Trump has taken for his “America first” policy, suggesting critics have willfully misinterpreted it to mean “America only,” and wondered if Trump would have difficulty sticking to such a dramatic change in U. S. policy outlook, or keeping his bold promise to “eradicate radical Islamic terrorism from the face of the earth. ” Gaffney said frankly that it would depend, in part, on “whether he remains committed to the sorts of principles and guiding philosophy that he’s laid out, not just in this particular context or in his inaugural address, but throughout the campaign. ” He pointed to the decisions Trump was scheduled to announce today about “restricting entry into this country against people who do not share our values, and who specifically may be trying to bring in this totalitarian sharia doctrine” as a demonstration of the President’s determination to stand by his campaign promises. “I think if he hews to all of those principles, he’s going to be fine. If he staffs his administration  —   this is the kicker  —   if he staffs his administration, not just at the Cabinet level, with people who hew to that line as well, he will be fine,” Gaffney predicted. “There is a concern, I have to tell you, among some of us that at lower levels, people who don’t seem to share that are being considered, or actually given, appointments, and people who do share those principles are not,” he added.  “So this is very much a work in progress. I believe Donald Trump is very   on this. I think that a number of the people around him  —   our mutual friend Steve Bannon among them, Michael Flynn of course, the National Security adviser, General Mattis at the Defense Department, Rex Tillerson in his statements before the Senate Foreign Relations Committee  —   they seem to get it,” he said.  “We’ve got to make sure that they’ve got people below them who support and will faithfully execute the President’s policy of protecting us against whatever you want to call it: radical Islamic terrorism, sharia supremacism, you pick your term. That’s the mortal threat of our time. And by the way, it is present here in the form of the Muslim Brotherhood. I hope one of the early actions  —   a defining action of this President  —   will be that he designates the Muslim Brotherhood as what it is, a terrorist organization,” said Gaffney. Marlow concluded by asking for Gaffney’s take on the Syria peace talks currently being held in Kazakhstan under the auspices of Russia, Turkey, and Iran, but pointedly excluding the U. S. and its coalition partners from a major role. “Well, we’ve seen this movie before,” Gaffney replied. “I’ll be very surprised if the   has any duration to it at all. I think the truth of the matter is, what’s happening on the ground, Alex, is that the people who have been fighting this civil war to this point, primarily, against the government of Syria  —   the Sunni Arabs  —   are being displaced. They’re being replaced by Shiites from Iraq, in many cases, and elsewhere. ”  “You’re going to see a population transfer that I think ultimately will cause this Syrian conflict to peter out  —   with the government of Assad still in power, the Russians in a stronger position, the Iranians of course in a much stronger position, having created what’s been called a ‘Shiite Crescent’ from their own country all the way to the Mediterranean,” he predicted. “They’re very important, and frankly very dangerous, strategic developments, but I think that’s where this is headed. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the audio of the full interview above.'"}, "time": 1742563119.3967464}