{"duration": 0.07900309562683105, "input_args": {"text": "'Thanks to an aggressive push by streaming services like Netflix and Seeso, there have never been more new hours of comedians telling jokes than right now. Netflix’s deals with Chris Rock and Dave Chappelle (who will post two filmed concerts on Tuesday) have received most of the attention, but what makes this golden age of specials particularly exciting is the amount of new work from young comics on the rise. Here’s a look at some recent noteworthy releases. The first time Jerrod Carmichael appears onscreen performing, he’s not walking onstage, as in most specials, but already there. It’s a tight   of his face. After starting a sentence, he pauses to reconsider, then continues tentatively, gently posing a question in a way that makes you think he doesn’t know the answer: “Are we going to be O. K.?” Staged by a fellow comic, Bo Burnham, who beautifully directed this special in the Masonic Hall in Manhattan, it’s a startlingly intimate opening that anticipates the quietly searching, introspective jokes that follow. The recent presidential election shadows this hour, particularly in its melancholy mood. Mr. Carmichael is a deeply political comic, but his contrarian perspective is clarified as much by the way he probes his psyche as by his examination of the issues. His apathy is a central theme. In a culture in which so many on social media trumpet their moral rightness, Mr. Carmichael, who has an acclaimed NBC sitcom, “The Carmichael Show,” invites the audience, sometimes explicitly, to judge his wrongness. He explains his indifference to global warming or inability to support the troops with conviction. In his   delivery, he presents confessions of embarrassing thoughts, transgressions that are not cheap provocations so much as the activity of a free and fearless mind. Explaining that Jay Z means more to him than the Rev. Dr. Martin Luther King Jr. he says plainly: “I know every Jay Z lyric. I only know, like, four bars of the ‘I Have a Dream’ speech. ” Is Katherine Ryan the new Joan Rivers? The British news media has been saying that about Ms. Ryan, a Canadian comic in her early 30s who became famous in Britain through   and   appearances. She doesn’t shy away from the association. “They say I’m Joan Rivers, but older,” she says in a typical zing of a punch line. Like Ms. Rivers, she does crowd work and racial humor. And she also does raunchy jokes in an   register that evokes Sarah Silverman. In general, Ms. Ryan is more likely to remind you of other performers than lay a claim to her own style. She has charming moments but could use an editor her impressions of Bill Cosby and Mr. Burns from “The Simpsons” are unpersuasive. One reason Rivers was so singular is that, while she desperately wanted laughs, her instinct was to challenge rather than pander to her audience. Here is where Ms. Ryan parts ways with Rivers. When she tells a joke about how out of shape Americans are, she’s giving British fans exactly what they want. Cristela Alonzo, a   comic, walked into a bar down South. “I asked the bartender for an Old Fashioned, so he took away my voting rights,” she says, pivoting to the next joke. “I’m kidding. I’m Latina. I didn’t vote. ” Ms. Alonzo, who had a   ABC sitcom, is a dynamic stage presence, addressing audience members as if they’re old friends while effortlessly projecting to the last row. In between jokes, she flashes a bewildered smile, as if she can’t believe what she just said. In this set, her nostalgic portrait of her late mother is genuinely moving, but her funniest material, about the challenges of being poor, brings to mind the best   of Roseanne Barr. Her finest set piece investigates her childhood fantasy about the band New Kids on the Block, which, she recalls, involved her working as a maid on their tour bus. “Even in my fantasy,” she marveled, “I can’t give Latinos better jobs. ” Midway through his impressively polished debut special, Fahim Anwar  —   one of a growing number of gifted Muslim comics working clubs (Hasan Minhaj and Mo Amer are two others to keep a close eye on)  —   paused to boast with mock swagger that he was now part of the most feared minorities in the United States. An American of Afghan descent, Mr. Anwar conceded that   remain in the competition. “In a dark alley, you might be more afraid of him than me,” he said of black men, “but on public transportation, I feel like I win that one. ” While he has some material about his background, Mr. Anwar does not linger on it. His jokes cover familiar territory (movie clichés, auditioning) but what makes him one of the most exciting young   today, and one with breakout potential, is his outlandish physicality and   showmanship. He starts jokes as a stationary observational comic, but finishes them with cartoonish voices, expressive eyes (he can telegraph a     in darting pupils) and deliriously silly dance moves. The current   he most evokes is Sebastian Maniscalco, another kinetic comic specializing in character work. Mr. Anwar even has an alter ego, an arrogant comic named Lance Cantstopolis, who is a mix of Borat and Tony Clifton. He shows up at the end of the special for a second, but I would not be surprised if this cartoonish character finds his own vehicle before too long. Carmen Lynch has such a mellow, meandering, deadpan delivery that it’s easy to underestimate how many punch lines she packs into a minute. Tall with a lopsided grin, she has a casual,   style that masks a sneakily dark sensibility and precision writing. This approach has allowed her to kill regularly in short sets around New York for years. Her first album is punchy and quick, shifting with alacrity from bits about family to dating. Her attitude is wry   laced with hints of melancholy. “I think money makes you happy,” she said in a typical quick setup. “I cried in a Mercedes once, and it wasn’t that bad. ” It’s only when her jokes don’t get exactly the response she wants that she pulls the emotional heartstrings: “Please laugh at all my jokes,” she said. “I have a heart murmur. ”'"}, "time": 1742561998.448186}