{"duration": 0.14598679542541504, "input_args": {"text": "'Back in June, three days after Donald Trump announced his candidacy, I predicted that the most mischievous pranksters on the internet would rally around him  —   and that they’d represent a significant electoral and cultural force. [I predicted that his campaign would focus on trolling the lazy, entitled Establishment elites the American people hate so much. I predicted this combination of   sass would prove almost impossible for feeble opponents like Jeb Bush to overcome. As always, I was right.  By the way, regular readers of this column will know how much I hate to toot my own horn, but I also predicted Trump would perform well with blacks. Polling shows him at anywhere between 12 and 25 per cent with black voters in a general election   with Clinton. That’s more than double what the GOP normally achieves. Trump’s supporters have treated the campaign as one long trollfest. First Jeb, then Marco and finally Lyin’ Ted all stumbled and fell before the chaotic power of Trump’s troll army. Facing a hilarious combination of   YouTube remixes, and Photoshop mashups, Trump’s opponents were subjected to   ridicule from the cultural powerhouses of the web. The internet made them look stupid. The internet made them look weak. And what begins on    and leaks out into Twitter has a way of colouring media coverage and, ultimately, public perception, even among people who don’t frequent message boards. TV commentators often talk about Trump’s preternatural power to indelibly “brand” his opponents, from “ ” Jeb to “Little” Marco and “lying” Ted. No matter how crude and simplistic the labels, they always seems to stick, dumbfounding   political observers who are used to candidates competing for the “high road. ” The strategy of GOP bigwigs appears to be: “lose badly, but remain virtuous. ” The power of Trump’s branding is partly down to the media’s hunger for drama, and partly thanks to his business acumen  —   but it’s also in large part due to his internet supporters, who have an uncanny ability to create and popularise cultural tropes. Or, as we on the internet have come to know them, memes. Part of this involves taking Trump’s campaign victories, his slogans, and his “brands” and using the power of the web to amplify them. Trump’s repeated humiliations of Jeb Bush were overlaid online with Sad Romance, an    tragic violin tune that was already a web meme. “Little” Marco, of course, like another   but diminutive conservative figure, was repeatedly photoshopped to make him look like a dwarf.  Meanwhile, YouTube sensation “Can’t Stump The Trump” (whose name, naturally, was a nod to an   Trump meme) has attracted more than 5 million views on YouTube just by remixing Trump’s debate performances, adding air horn noises whenever the candidate scores a particularly effective zinger. Trump’s pledge to “build the wall” has also been seized upon by the internet. Countless jokes, GIFs and videos can now be found around the web dedicated solely to the    Great Wall of Trump. This meme has gone so viral, it still gets the biggest cheers at Trump rallies. Establishment types no doubt think this is all silly, schoolyard stuff. And it is. But it’s also effective. And it’s not just effective with the young ‘uns, either. Older generations may not be as   as millennials, but it doesn’t take them long to catch on. One of our staffers’   old parents enjoyed Can’t Stump The Trump so much that they watched five of the videos   . Meme propaganda is funny, memorable, persuasive  —   and it works. Still, the Establishment doesn’t care. They’d rather take the high road and lose than go down in the dirt and win. Well, they’re getting what they wanted! Trump’s internet army did more than just riff on his media performances, of course. The relationship between the candidate and his mischievous internet brigade is deeply symbiotic. As well as reacting to Trump and the campaign, the internet has created and popularised its own memes, sometimes out of thin air. Take the hilarious, infamous comparison of Ted Cruz to the Zodiac Killer. Although it was started by a progressive on Twitter, it was popularised by Trump supporters. Before long, the meme made its way out of obscure internet communities and into the national media. It got so bad that Heidi Cruz actually had to respond to the rumour, telling voters a day before the Indiana primary that “my husband is not the Zodiac Killer!” In another case of a meme reaching the real world, during his victory speech in Indiana, Trump himself referenced the “Trump Train”  —   a meme that had been created and popularised by the internet. For web trolls, having one of their pranks garner national attention is the Holy Grail. They call it “meme magic”  —   when   web memes become so influential they start to affect   events. Trump’s candidacy affords the internet the ability to do so virtually every day. No wonder they love him. Other memes are out there just for the fun of it, but they still help to cement Trump’s reputation as an engine of chaos. There are depictions of Trump as the “God Emperor” of Warhammer: 40, 000 mythology. There are depictions of Trump as Pepe the Frog, one of the  ’s most popular memes. The internet had a minor heart attack when Trump retweeted one such depiction from his Twitter account  —   along with a link to a Can’t Stump The Trump video. ”@codyave:  @drudgereport @BreitbartNews @Writeintrump ”You Can’t Stump the Trump” https:  .  pic. twitter. ”  —   Donald J. Trump (@realDonaldTrump) October 13, 2015,  The mirthful, prankish nature of Trump’s young supporters was revealed again in the closing hours of Ted Cruz’s campaign, when Cruz made the mistake of trying to engage them directly. The university debate champ no doubt expected to have a heated, but ultimately      with Trump’s supporters. But they were playing an entirely different game. He received a stream of memes and ridicule instead. Arguing with   denizens of Twitter and internet forums is almost always a losing proposition, as Cruz would know if there were anyone on his campaign team who understood the culture. . @tedcruz crosses the street to confront @realDonaldTrump backers on the sidewalk https:  .   —   Morning Joe (@Morning_Joe) May 3, 2016,  Elsewhere, a Bernie supporter  —   another constituency which enjoys a particularly young and effective web presence  —   offered Cruz a handshake before rapidly withdrawing it and yelling that the candidate “looks like a fish monster. ” Juvenile? Yes. But the kids know this stuff will go viral. The press laps it up. And voters at home don’t want to associate with candidates who keep showing up as the butt of the joke. WATCH: Protester fakes out Ted Cruz with handshake, tells him he looks like a fish monster: https:  .  https:  .   —   Good Morning America (@GMA) May 3, 2016,  Before he bombed out, Cruz tried to tread into meme territory himself with a cringeworthy video of Simpsons impressions. It might have scored points with young voters, oh, say 15 years ago.  It didn’t work. Cruz, bless him, was so terminally unhip that he fed the Trump meme brigades on a daily basis. While not as   as the disastrous Jeb, he certainly wasn’t Mr. Smooth. From not helping Carly Fiorina up after her fall on a campaign stop in Indiana, to accidentally elbowing his wife in the face twice after his concession speech, there was always something awkward about the oleaginous Cruz. There are some people who are at one with the web, and Cruz wasn’t one of them. I knew little of meme culture before 2014, but after we discovered each other, it wasn’t long before I became a walking, living, breathing meme myself. I don’t know if Donald Trump spends time thinking about 4chan, but he has a character and a style that is perfectly in tune with what the web’s miscreants are looking for. And it’s clear from his Twitter account and speeches that he knows what’s going on and enjoys it. Among the Republican field, Trump was the only candidate who enjoyed a base of support that was truly  . He combined Ron Paul’s strange ability to mobilise the internet’s meme brigades with an unstumpable media profile. Caught between the hammer of Trump’s media machine and the anvil of his online troll army, The Donald’s opponents never stood a chance. Trump understands the internet, and the internet might just propel him into the White House. Meme magic is real. Follow Milo Yiannopoulos (@Nero) on Twitter and Facebook. Android users can download Milo Alert! to be notified about new articles when they are published. Hear him every Friday on The Milo Yiannopoulos Show. Write to Milo at milo@breitbart. com.'"}, "time": 1742562620.504967}