{"duration": 0.1041421890258789, "input_args": {"text": "'An Israeli deputy of the ruling Likud party of Prime Minister Benjamin Netanyahu has endorsed   migration French presidential candidate Marine Le Pen despite Israel’s ban on communicating with the Front National. [Israeli deputy Oren Hazan gave his support and endorsement to Ms. Le Pen on Twitter on Wednesday before the   long debate that evening. Mr. Hazan wrote: “Madame Le Pen, I offer my support for the debate this evening as well as during the second round of the election on Sunday for the construction of the future of France,” The Times of Israel reports.  Madame Le Pen, au débat ce soir j’apporte mon soutien, aussi au second tour  —   pour la construction de l’avenir de la France 🇷@MLP_officiel,  —   אורן חזן (@oren_haz) May 3, 2017,  Hazan has been a Member of the Israeli Knesset since 2015 and has been considered somewhat of a firebrand in Israeli politics. The MK has been a keen supporter of U. S. President Donald Trump during the presidential campaign last year. Despite a negative reaction from many in his own party who have called for him to be excluded from future elections, Hazan has defended his remarks. In an interview with Israeli broadcaster, i24 News Hazan said: “A lot of other members of the House say in private that they support Marine Le Pen but are afraid to [say so publicly]. ” “Marine Le Pen took all the bad,   things her father did and kicked him out of his own party,” Hazan added saying Le Pen had transformed the Front National and manoeuvred it away from its controversial past. “When I put my support in Marine Le Pen I looked at the State of Israel’s interests for safety, security, fighting radical Islam, and fighting terror,” he said. “In a few years if nothing changes France is going to be a radical Islam[ic] country. We want to stop this. I don’t think the left side of the political map can do it. I believe she can do it. ” The Front National made an attempt to reach out to Israeli lawmakers earlier this year when Party Secretary Nicolas Bay made a brief visit to the country. Bay met with several prominent Israelis in an effort to normalise relations between Israel and the Front National. “Israel is the front wall that is fighting against radical Islam and terror all around the world,” Hazan said. “We need more people who don’t speak ‘politically correct’ and see eye to eye [with Israel]. ” In France, the number of   incidents has rapidly risen over the past few years and often Jewish people are targetted by radical Islamists. The situation has become so difficult for French Jews that a record number have left for Israel. Follow Chris Tomlinson on Twitter at @TomlinsonCJ or email at ctomlinson@breitbart. com '"}, "time": 1742563047.6787894}