{"duration": 0.04745125770568848, "input_args": {"text": "'Sen. Rand Paul ( ) told reporters Monday afternoon that former Obama National Security Advisor Susan Rice “ought to testify under oath” after Bloomberg News’s Eli Lake revealed that, during the presidential transition, she deliberately sought to “unmask” President Donald Trump’s associates from intelligence surveillance. [Paul called the reports that Rice made dozens of requests to learn more about the identities of anonymous people thought to be close to the Trump transition team, inadvertently caught on tape during investigations into foreign persons of intelligence interest, “enormous news. ”  “If it is allowed, we shouldn’t be allowing it. I don’t think we should discount how big a deal it is that Susan rice was looking at these,” Paul told the assembled reporters. The Kentucky Senator then cut to the heart of the growing political fight behind what President Trump has called “wiretapping. ” “She needs to be asked, ‘did President Obama ask her to do this?’ I think she ought to testify under oath on this,” Paul opined. Paul also tried to tie Monday’s revelations about Rice to the slew of leaks on the topic around the time of the handover of the White House. “I think she should be asked under oath, did she reveal it to the Washington Post?” he asked. Paul, long a critic of this type of warrentless intelligence wiretapping and its potential to capture the communications of American citizens, was quick to tie the issues together. “I don’t think you should be allowed to listen to Americans’ conversations without a warrant,” Paul said. “They are targeting a foreigner, and because they are targeting a foreigner they are gathering all of this information on Americans. ” “A million Americans are apparently caught up in these incidental conversations,” Paul continued. “Everybody in the Trump Administration transition, they could basically look at those conversations. ”'"}, "time": 1742563562.6178086}