{"duration": 0.03144717216491699, "input_args": {"text": "'The LAPD has officially launched a “Knock, Knock” Burglary Task Force in an effort to stop   targeted burglaries of celebrity homes. [The name “Knock, Knock” is derived from the tactic the gangs use to burglarize the homes. They reportedly form small groups of three or four, one of whom knocks on the front door of the home. If no one answers  —   giving the impression that no one is home  —   the gang member who knocked on the door signals the others and they seek entry through doors and windows around the home.  According to the   Daily News, the home of the Los Angeles Lakers’ Nick Young was targeted on “February 18 or 19,” with thieves taking cash and other valuables worth approximately $500, 000. Former Lakers player Derek Fisher was also targeted, with thieves taking cash, jewelry and other goods worth approximately $300, 000 from his Tarzana home. KTLA reported that the burglary of Young’s home occurred “the same weekend the NBA was hosting its   Game festivities in New Orleans. ” Young was in New Orleans for the event, competing in the contest for   shooting. No one was home when the “knock, knock” burglars struck. The homes of singers Alanis Morisette and Nicki Minaj were also hit. The New York Daily News reports that Minaj’s home was “robbed of approximately $200, 000 worth of items. ” Suspects also destroyed property in Minaj’s home and cut up some of her clothes. The San Fernando Valley Knock Knock Task Force consists of roughly 30 officers divided among “surveillance teams, undercover detectives and patrol cars working to prevent and curb such incidents. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.  '"}, "time": 1742562549.7348735}