{"duration": 0.0354616641998291, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nDonald Trump has long campaigned on the promise of running the country the way he’s run his businesses. On that basis, we essentially already know what it would mean if he entered the Oval Office and applied his personal business acumen to this nation (and the rest of the world). There’s a surprisingly full record to cite. Who can forget, for instance, what happened to his signature gambling resorts in Atlantic City? Who can forget their serial failures in what was still relatively good times in that city, including the repeated trips to bankruptcy court and the way he stiffed local contractors and suppliers, running them out of business? As Russ Buettner and Charles Bagli of the New York Times summed it up : “He put up little of his own money, shifted personal debts to the casinos and collected millions of dollars in salary, bonuses, and other payments. The burden of his failures fell on investors and others who had bet on his business acumen.” \\nIn his pre-political years, he perfected what Kurt Eichenwald of Newsweek dubbed “the art of the bad deal”: “lost contracts, bankruptcies, defaults, deceptions, and indifference to investors.” And from every bad deal for those who supported him, he’s almost always walked away better off. All in all, it’s quite a record (and don’t even mention Trumped Up University ). There is no reason to believe that this pattern of behavior would change in the White House. After all, The Donald’s record shows a remarkable consistency, so it’s possible to imagine with a fair degree of accuracy what you’re going to get. \\nTake election night 2012 when The Donald was still a Mitt Romney supporter. CNN recently reported on his tweets that night and judging by his comment on the Chinese invention of climate change, his complaints about polling violations, his outburst about “sham” elections, and in the wake of Romney’s loss his call for “revolution,” there hasn’t been much truly new under the Trumpian sun in 2016 — not even his last tweet of that night four years ago: “We have to make America great again!” In other words, his record should be considered remarkably predictive. So count on this: from the Oval Office, he’ll walk away a richer man, leaving the rest of us holding the bag, and his supporters, particularly white working class men, in a striking version of hell. \\nThen, of course, there’s the other candidate. You know who — the woman who never saw a bank CEO she couldn’t get a couple of hundred thousand dollars from for giving thoroughly unsurprising speeches. Today, TomDispatch regular Nomi Prins, author of All the Presidents’ Bankers , explores what our world might be like if The Donald goes down in flames and Hillary Clinton enters the White House next January. Consider this, economically speaking, the definition of a hold-onto-your-hats election, no matter who wins. Wall Street in the Saddle Nomi Prins • October 27, 2016 • 3,100 Words (Reprinted from TomDispatch by permission of author or representative)\""}, "time": 1742562699.8196728}