{"duration": 0.0633535385131836, "input_args": {"text": "'On Thursday’s Breitbart News Daily, former U. N. Ambassador John Bolton said he was “delighted” to hear National Security Adviser Mike Flynn’s statement that Iran has been “put on notice” for its ballistic missile launches and other provocations. [“I think it’s the first time in eight years that anybody has really said to Iran what needs to be said,” Bolton told SiriusXM host Alex Marlow.   “I think it demonstrates a couple of things: Number one, that the Obama administration’s nuclear deal, agreed to in the summer of 2015, is in deep trouble. I think that’s what being put officially ‘on notice’ means. Because this latest ballistic missile launch by the Iranians was a violation of the agreement, although the wording is weak and ambiguous, thanks to John Kerry, there’s no doubt this is unacceptable behavior by Iran,” he said. “It also sends the political signal to America’s allies, as well, that any notion that we will simply continue to accept this deal as written is something they need to dismiss,” he continued. “I think it’s the kind of   that helps clarify the situation with friends and adversaries alike. ” “This deal was a strategic mistake when it was made. It’s not gotten any better with age,” Bolton said. “It’s better to be unambiguous when a mistake like this is made. Even though Iran has benefited from the deal  —   the release of sanctions, unfreezing of $150 billion of their assets  —   it’s just an example of how bad the deal was for the United States. Iran gets the goodies up front, and its obligations only came down the road. ”  “But nonetheless, because I think they’re already in violation of the deal, and I think there’s evidence to show that, we need to get on with the business of looking and talking to Prime Minister Netanyahu of Israel when he arrives in a couple of weeks and our friends in the Arab world who see the Iranian nuclear threat as a direct threat to them, not just a threat to us,” he advised. Marlow turned to President Trump’s executive order to temporarily suspend immigration from seven   nations and asked if Bolton thought the rollout of this order has been “ . ” “Well,   is a very diplomatic way to put it,” Bolton told Marlow. “You have a future at the State Department if you want one at some point. ” “Thank you, sir,” Marlow said. “That’s not a compliment, actually,” Bolton said with a laugh. On a more serious note, he said things were left out of the executive order that he thinks should have been included, “for example, making it clear that green card holders were not subject to it. ” “Other exceptions were put in. This one was not,” he noted. “We all know the Trump administration wants to give refugee status to, like Iraqis, former interpreters who helped us out during the Iraq conflict. I think that added to the confusion and the publicity. ” “But honestly, this is going to be controversial even if those steps had been corrected. What I don’t understand is why the White House wasn’t more prepared for the fury of opposition that met it. It’s not like this wasn’t an issue during the campaign. It’s not like it wasn’t highlighted,” he said.  “Look, it’s a bump in the road. I’ve been through transitions coming in and going out through the government. The first couple of months at the White House always have rocky periods. The real consequence here is that they learn from it, and I’m comfortable that they will,” said Bolton. He agreed with Marlow’s suggestion that despite all the hysteria around the supposedly draconian executive order, it did not go far enough in certain ways. “It’s very limited, and I think, in fact, if people read the executive order, they’ll see that with respect to these seven nations that are affected by it, that the same seven nations that, as you said a moment ago, were tagged by the Obama administration to effectively be eliminated from the visa waiver program. So that was a step in the direction Trump took. Trump just went further,” he observed.  “But the key point was that these seven governments, for a variety of reasons, cannot supply the United States with adequate information about people claiming to be citizens of those countries who want visas to come into the United States. Let’s take a couple of examples: Somalia, Yemen, Libya, Syria. These are places where the government has just collapsed. It’s just collapsed. There is no effective government. We have no confidence that the information we’re getting is correct. Other governments like Iran, I wouldn’t trust as far as I could throw them anyway, even though they’re functioning in their territory,” Bolton said.  “The point is to give the secretary of Homeland Security time to figure out whether these problems will be corrected or whether other steps need to be taken. People complain we should have put Saudi Arabia on the list. Actually, we get a lot of information from Saudi Arabia about visa applicants that we can corroborate and check into. Is it perfect? Of course not, but the opponents of the executive order, I think to be fair, cannot have it both ways. It’s too broad, which is what most of them claim and simultaneously claim it’s not broad enough, which really is hypocritical,” he said. On the subject of Iran, Bolton described the threat it poses as “enormous,” amply justifying the Trump administration’s putting them “on notice. ” “This cruise missile story is definitely very troubling because of its implications,” he said, referring to Iran’s recent missile test. “It was reported that the test had failed, but here’s the significant fact: it failed at the reentry stage  —   that is to say, as the warhead part of the missile, the nose cone and what’s under it, was coming back into the atmosphere. ” “What is significant about that? When you launch weather and communications satellites, you don’t care what happens on   as long as the satellite is in orbit. What happens to the rest of the missile, it burns up in the atmosphere. You don’t care,” he explained. “The only reason you care about   vehicles is when you’re delivering nuclear weapons because obviously, you can put the weapon into space, but if you can’t bring it down over the target, you’ve wasted a lot of effort. So the fact that Iran is at the point where it can launch ballistic missiles  —   and we know they’ve got   ballistic missiles now. ” “That they’re testing ICBM kinds of missiles, capable of hitting the United States at a certain point, and they’re testing the   capability, tells you exactly what this missile program is all about. So the argument that ballistic missiles aren’t intended for nuclear weapons is just another Iranian lie. That’s the only purpose of this program,” Bolton said. John Bolton is a senior fellow at the American Enterprise Institute and heads up his own political action committee, BoltonPAC. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742628590.809852}