{"duration": 0.17295360565185547, "input_args": {"text": "' US Public Opinion Speaks to Anti-Militarism, the Electorate Votes for Warmongers By James Petras November 14, Castigating the US electorate as accomplices and facilitators of wars, or, at best, dismissing the voters as ignorant sheep-people (\\x91sheeple\\x92) herded by political elites, describes a partial reality. Public opinion polls, even the polls overwhelmingly slanted toward the center-right, consistently describe a citizenry opposed to militarism and wars, past and present.\\nBoth the Right and Left have failed to grasp the contradiction that defines US political life: Namely, the profound gap between the American public and the Washington elite on questions of war and peace within an electoral process that consistently leads to more militarism.\\nThis is an analysis of the most recent US public opinion polls with regard to outcome of the recent elections. The essay concludes with a discussion of the deep-seated contradictions and proposes several ways in which these contradictions can be resolved.\\nMethod\\nA major survey of public opinion, sponsored by the Charles Koch Institute and the Center for the National Interest, conducted by the Survey Sampling International, interviewed a sample of one thousand respondents.\\nThe Results: War or Peace\\nMore than half of the American public oppose any increase is the US military role overseas while only 25% back military expansion.\\nThe public has expressed its disillusionment over Obama\\x92s foreign policy, especially his new military commitments in the Middle East, which have been heavily promoted by the state of Israel and its US domestic Zionist lobby.\\nThe US public shows a deep historical memory with regard to the past military debacles launched by Presidents Bush and Obama. Over half of the public (51%) believe that the US has become less safe over the past 15 years (2001-2015), while one eighth (13%) feel they are more secure.\\nIn the present period, over half of the public opposes the deployment of ground troops to Syria and Yemen and only 10% favor continued US support for the Kingdom of Saudi Arabia.\\nWith regard to specific US wars, over half believe that Bush\\x92s invasion of Iraq made the US homeland less secure, while only 25% believe it didn\\x92t increase or decrease domestic security. Similar responses were expressed with regard to Afghanistan: 42% believe the Afghan War increased insecurity and about a third (34%) felt it did not affect US security.\\nIn terms of future perspectives, three quarters (75%) of the American public want the next President to focus less on the US military operations abroad or are uncertain about its role. Only 37% are in favor of increased spending for the military.\\nThe mass media and the powerful financial backers of the Democratic Presidential candidate have focused on demonizing Russia and China as \\x91the greatest threats in our time\\x92. In contrast, almost two thirds (63.4%) of Americans believe the greatest threat comes from terrorism both foreign and domestic. Only 18% view Russia and China as major threats to their security.\\nIn regard to the Pentagon, 56% want to reduce or freeze current military spending while only 37% want to increase it.\\nWars and Peace: The Political Elites\\nContrary to the views of a majority of the public, the last four US Presidents, since the 1990\\x92s, have increased the military budget, sending hundreds of thousands of US troops to launch wars in three Middle Eastern countries, while promoting bloody civil wars in three North African and two European countries. Despite public opinion majorities, who believe that the invasions of Afghanistan and Iraq have increased threats to the US security, Obama kept ground troops, air and sea forces and drone operations in those countries. Despite only 10% public approval for his military policies, the Obama regime has sent arms, advisors and Special Forces to support the Saudi dictatorship\\x92s invasion of tiny Yemen.\\nObama and the Democratic presidential candidate Hillary Clinton pushed a policy of encircling Russia and demonizing its President Putin as the greatest threat to the US in contrast to US opinion, which considers the threat of Islamist terrorism as five times more serious.\\nWhile the political elite and the leading Presidential candidates promise to expand the number of US troops abroad and increase military spending, over three quarters of the American public oppose or are uncertain about expanding US militarism.\\nWhile candidate Clinton campaigned for the deployment of the US Air Force jets and missiles to police a \\x91no fly zone\\x92 in Syria, even shooting down Syrian and Russian government planes, the majority of US public opposed it by 51%.\\nIn terms of constitutional law, fully four-fifths (80%) of the US public believes the President must secure Congressional approval for additional military action abroad. Nevertheless, Presidents from both parties, Bush and Obama launched wars without Congressional approval, creating a precedent which the next president is likely to exploit.\\nAnalysis and Perspectives\\nOn all major foreign policy issues related to waging war abroad, the political elite is far more bellicose than the US public; they are far more likely to ignite wars that ultimately threaten domestic security; they are more likely to violate the Constitutional provisions on the declaration of war; and they are committed to increasing military spending even at the risk of defunding vital domestic social programs.\\nThe political elites are more likely to intervene in wars in the Middle East, without domestic support and even in spite of majoritarian popular opposition to war. No doubt the executives of the oligarchical military-industrial complex, the pro-Israel power configuration and the mass media moguls are far more influential than the pro-democracy public.\\nThe future portends a continuation of militarism by the political elites, and increase in domestic security threats and even less public representation.\\nSome Hypothesis on the Contradiction between Popular Opinion and Electoral Outcomes\\nThere is clearly a substantial gap between the majority of Americans and the political elite regarding the role of the military in overseas wars, the undermining of constitutional prerogatives, the demonization of Russia, the deployment of US troops to Syria and deeper US entanglement in Middle East wars for the benefit of Israel.\\nYet it is also a fact that the US electorate continue to vote for the two major political parties which have consistently supported wars, formed military alliances with warring Middle East states, especially Saudi Arabia and Israel and aggressively sanctioned Russia as the main threat to US security.\\nSeveral hypotheses regarding this contradiction should be considered:\\n1. Close to 50% of the eligible voters abstain from voting in Presidential and Congressional elections. This most likely includes many among the majority of Americans who oppose the expansion of the US military role overseas. In fact, the war party \\x91winner\\x92 typically claims victory with less than 25% of the electorate \\x96 and threats this as a mandate to launch more wars.\\n2. The fact that the mass media vehemently supports one or the other of the two war parties probably influences a minority of the electorate who decide to actually participate in the elections. However, critics have exaggerated the mass media\\x92s influence and fail to explain why the majority of the American public disagree with the mass media and oppose the militarist propaganda.\\n3. Many Americans, while opposed to militarism, vote for the \\x91lesser evil\\x92 between the two war parties. They may believe that there are greater and lesser \\x91degrees\\x92 of war mongering and choose the less strident.\\n4. Americans, who consistently oppose militarism, may decide to vote for militarist politicians for reasons besides those of overseas wars. For example, majoritarian Americans may support a militarist politician who has secured funding for local infrastructure programs, or protected farm and dairy subsidies, or who promises jobs programs, lowers public debt or opposes corrupt incumbents.\\n5. Americans, opposed to militarism, may be deceived by the pronouncements of a demagogic presidential candidate from one of the war parties, whose promise of peace will give way to escalating wars.\\n6. Likewise, the emphasis on \\x91identity politics\\x92 can deceive anti-war voters into supporting a proven militarist because of issues related to race, ethnicity, gender, sexual preferences or loyalties to overseas states.\\n7. The war parties work together to block mass media access for anti-militarist parties, especially preventing their participation in national electoral debates viewed by tens of millions of voters. War parties collude to set impossible restrictions against anti-militarist party participation in national level elections, banning citizens with non-violent police records or former convicts who have served their sentences from voting. They reject poor citizens who lack photo identification, limit access to transport to voting sites, limit the number of polling places in poor or minority neighborhoods and deny time-off for workers to vote. Unlike other countries, US elections are held on a work day and many workers are unable to vote.\\nIn other words the electoral process is \\x91rigged\\x92 and imposes \\x91forced voting\\x92 and abstention: Collusion between the two war parties limits voter choice to abstention or casting a ballot for the \\x91lesser evil\\x92 among the militarists.\\nOnly if elections were open and democratic, where anti-militarist parties were allowed equal rights to register, participate and debate in the mass media, and where campaign financing were made equal would the contradictions between the wishes of the anti-militarist majorities and votes cast for pro-war elites be resolved.\\nJames Petras is a Bartle Professor (Emeritus) of Sociology at Binghamton University, New York. http://petras.lahaine.org'"}, "time": 1742564219.0146468}