{"duration": 0.03585362434387207, "input_args": {"text": "\"By Rixon Stewart on September 12, 2006 \\nIs television an entertainment media or instrument of control, a ‘control mechanism’? In ‘Eisenhower’s Death Camps': A U.S. Prison Guard’s Story By wmw_admin on May 4, 2007 \\nIn Andernach about 50,000 prisoners of all ages were held in an open field surrounded by barbed wire. The men I guarded had no shelter and no blankets; many had no coats. They slept in the mud, wet and cold, with inadequate slit trenches for excrement. Holocaust, Hate Speech & Were the Germans so Stupid? – Updated By wmw_admin on March 23, 2011 \\nThe brilliant examination of the ‘Holocaust’ by Anthony Lawson has since been censored on the basis of a false Copyright infrigment. But as Lawson explains, this just another attempt to stiffle freedom of expression Did New York Orchestrate The Asian Tsunami? By wmw_admin on October 17, 2008 \\nWith Afghanistan and Iraq already lost, the Wall Street bankers were all desperately looking for other ways to control our world, when suddenly and very conveniently, the Sumatran Trench exploded. Trick or Treat? Joe Vialls investigates The Anglo-Saxon Mission Part II By wmw_admin on March 1, 2010 \\nFormer City of London insider reveals that the depopulation program would begin with a planned war between Israel and Iran. More importantly, he goes onto to describe how we can derail their plans for global dominance Letter from James Abourezk, former US Senator from South Dakota to Jeff Blankfort on the Israel Lobby By wmw_admin on December 8, 2006 \\nMore than being an insider’s confirmation of the power of the pro-Israel lobby over Congress, the former US Senator’s letter also calls into question Noam Chomsky’s increasingly suspect looking motives The Oklahoma City Bombing: 30 Unanswered Questions By wmw_admin on July 11, 2003 \\nTimothy McVeigh may have been tried and executed, but there are still too many unanswered questions about the Oklahoma City Bombing\""}, "time": 1742563340.0528874}