{"duration": 0.1121363639831543, "input_args": {"text": "'In an effort to give back to his hometown community in Florida, Carol City, the   star Rick Ross decided to fulfill a childhood dream: He bought a Checkers   franchise. Why a Checkers? One reason seemed to rise above them all. “The No. 1 fries in the game,” Mr. Ross says in a   video released in December. The video shows Mr. Ross driving around town in his Ford truck, puffing cigars and relating stories from his childhood in the downtrodden community, which is in the Miami area. At a certain point, Mr. Ross begins talking about the burger joint he frequented as a teenager, across the thoroughfare from the carwash where he worked. There was a McDonald’s that was closer, but Checkers, he says, was more affordable. “I made $30 a day from 8 in the morning to 8 at night,” Mr. Ross says. “I went to Checkers. ” Checkers does not typically pursue celebrity endorsements. But when Mr. Ross applied to purchase the Carol City franchise last summer, he seemed so genuine in his affection for the   chain that Checkers recognized a marketing opportunity as straightforward as a  . Still, it did not want a typical campaign. Scott Wakeman, director of marketing for Checkers   Restaurants Inc. and the company’s ad firm, Fitzgerald  Company in Atlanta, turned to the    digital media upstart Woven Digital. The firm has heavy traction among Mr. Ross’s primary audience  —   young men  —   on the entertainment sites that it owns, like Uproxx, Dime and BroBible. Woven has also specialized in   productions that, on the surface, do not feel like ads. To Mr. Wakeman, it seemed like a perfect way to take advantage of Mr. Ross’s charisma and authenticity. “It just felt like such a unique opportunity,” he said. The video, which is 3 minutes 31 seconds long, was filmed over two days in Carol City in late September, mostly as Mr. Ross drove his truck around. Spliced in is footage of pickup basketball games and bikers popping wheelies. The first mention of Checkers comes about halfway through the video. Checkers invests the bulk of its annual marketing budget, about $20 million, in standard television spots, Mr. Wakeman said. By contrast, the Rick Ross ad has been distributed only on social media channels and Uproxx. But Mr. Wakeman said he believed the unusual authenticity of the video  —   and the compelling way Mr. Ross related his story  —   would resonate with viewers more than anything Checkers had tried in the past. “We don’t think of it as an advertisement,” Mr. Wakeman said, adding of Mr. Ross, “We wanted to create a piece of content that captured his love for the brand. ” Last year, Woven teamed up with MillerCoors on a series of short documentary videos that profiled entrepreneurs with expertise in making items like watches and surfboards, or, in one case, doing calligraphy. The   series, sponsored by Coors Banquet beer and run across Uproxx, was intended to reach an audience that has become adept at avoiding traditional advertising. According to Brad Feinberg, senior director of media and digital marketing for MillerCoors, it was a success, receiving more than 33 million views. “This is content that people want to see they’re intrigued by it, they seek it out,” Mr. Feinberg said. “And putting it in long form is something you can do in the digital space that is very cost prohibitive in other places. ”   storytelling might sound incompatible with the   attention spans of millennials, but it can have its advantages. Young men in particular have demonstrated a willingness to sit through longer pieces of content if it aligns with their values and gives them something of value in return, said Leah Swartz, senior content specialist for FutureCast, a part of the Barkley agency of Kansas City, Mo. that focuses on research into millennials. Her team considers this a rewriting of the old ABCs of sales. Rather than the mantra “always be closing,” brands must now think about how they can “always be helping. ” “You have to think about helping your consumer, what you’re providing, what benefits you’re giving, how you’re making their lives more fulfilled,” Ms. Swartz said. For Checkers, turning a story about a hit rapper’s upbringing into a selling point for hamburgers and chicken wings was a bit of a gamble, Mr. Wakeman said. In the video, there are only a couple of references to Checkers’ products, such as Mr. Ross’s unequivocal praise of the French fries. But Mr. Wakeman said the documentary format allowed Mr. Ross’s true voice to shine through. “Food and value are our two big brand pillars, and I think they come through in the spot, in a cool way,” Mr. Wakeman said. “It wasn’t a script. It was just Rick talking about what he loves” about the place. The video also captures moments of spontaneity. The producers originally intended just to film Mr. Ross outside the Checkers, but on the way there, he sent out a message on Instagram offering free burgers to any fans who wanted to meet him in Carol City. About 200 people showed up, and the cameras rolled as he shook hands and ripped open bags of food. Benjamin Blank, the chief executive of Woven, said the company was not trying to conceal that the video was an advertisement. But he said he thought the content itself was meaningful and captivating enough that   viewers ultimately would not mind being sold to. “There were plenty of things Rick could have gotten involved with from a business standpoint,” Mr. Blank said. “But his reason for getting involved with Checkers was a great story. ”'"}, "time": 1742561690.165073}