{"duration": 0.05008339881896973, "input_args": {"text": "'REYNOSA, Tamaulipas  —   A kindergarten teacher did her best to keep her students calm as cartel gunmen and police officers engaged in a series of firefights in this border city. [At least six individuals were killed on during the most recent bout of violence that spread fear and terror through this city as cartel gunmen continue to fight for control. As Breitbart Texas reported, two rival factions of the Gulf Cartel have been fighting for control of Reynosa, the fighting has led to at least 42 murdered individuals, including a police officer and one innocent bystander.   On Friday morning, rival factions of the Gulf Cartel began clashing throughout the city. One of the fierce clashes took place near a kindergarten school where young children were forced to huddle under their desks in an effort to avoid being struck by a stray bullet.  A video taken inside one of the classrooms revealed the moment when a female teacher tries to calm down her students.  “There’s a situation of risk so we all have to get down,” the unidentified teacher can be heard in the video trying to calm down the students in Spanish. “Everyone remain calm, nothing bad is going to happen. I am here with you all   …     Keep your little heads covered. ” The teacher continues to calm her students while singing children’s songs. Violent cartel clashes continued throughout the city as rival cartel gunmen fought each other while authorities tried to arrest them. Editor’s Note: Breitbart Texas traveled to the Mexican States of Tamaulipas, Coahuila, and Nuevo León to recruit citizen journalists willing to risk their lives and expose the cartels silencing their communities.  The writers would face certain death at the hands of the various cartels that operate in those areas including the Gulf Cartel and Los Zetas if a pseudonym were not used. Breitbart Texas’ Cartel Chronicles are published in both English and in their original Spanish. This article was written by “A. C. Del Angel” from Reynosa, Tamaulipas. '"}, "time": 1742562654.7391558}