{"duration": 0.13294625282287598, "input_args": {"text": "'La Russie, la Chine et l’Arabie saoudite mettent en échec l’hégémonie du dollar par Ariel Noyola Rodríguez Les États-Unis rencontrent de plus en plus d’obstacles sur leur chemin pour maintenir l’hégémonie du dollar comme monnaie de réserve mondiale. Ces derniers mois, des pays émergents ont vendu de nombreux bons du Trésor US, principalement la Russie et la Chine, mais aussi l’Arabie saoudite. En outre, afin de se protéger contre les fluctuations violentes du dollar, les banques centrales de plusieurs pays ont acquis d’énormes volumes d’or pour diversifier leurs réserves de devises. En bref, l’offensive mondiale contre le dollar repart avec la vente massive de la dette états-unienne et, en parallèle, des achats colossaux de métaux précieux.\\nRéseau Voltaire | Mexico (Mexique) | 5 novembre 2016 Español italiano La suprématie de Washington sur le système financier mondial a subi un terrible coup en août dernier : la Russie, la Chine et l’Arabie saoudite ont vendu des bons du Trésor des États-Unis pour la somme de 37,9 milliards de dollars, selon la dernière mise à jour des données officielles publiée il y a quelques jours [ 1 ]. Dans une perspective globale, les investissements mondiaux dans la dette publique des États-Unis ont chuté à leur niveau le plus bas depuis juillet 2012. De toute évidence, le rôle du dollar comme monnaie de réserve mondiale est de nouveau remis en question.\\nEn 2010, l’amiral Michael Mullen, ancien président du Comité des chefs d’état-major US a averti que la dette était la principale menace contre la sécurité nationale de son pays [ 2 ]. À mon avis, ce n’est pas tant le niveau élevé de la dette publique — maintenant au-dessus 19 000 milliards de dollars [ 3 ]— qui est une pierre dans la chaussure de l’économie états-unienne, mais bien plutôt qu’il est essentiel pour Washington, d’assurer un énorme flux quotidien de ressources, provenant de l’étranger, pour couvrir ses déficits jumeaux, commercial et budgétaire. Pour le département du Trésor, il s’agit d’une question de vie ou de mort de pouvoir vendre des titres de créance dans le monde entier, et ainsi financer les dépenses des États-Unis.\\nRappelez-vous que, après la faillite de Lehman Brothers en septembre 2008, la Banque populaire de Chine (PBOC, selon son sigle en anglais) a été fortement incitée, par Ben Bernanke, alors président du Système de la Réserve fédérale (FED), de ne pas vendre ses titres de la dette US. Dans un premier temps, les Chinois ont décidé de soutenir le dollar. Mais, dans un second temps, la PBOC s’est abstenue d’acheter plus de bons du Trésor des États-Unis et a, en même temps, lancé un plan visant à diversifier ses réserves en devises.\\nPékin a massivement acheté de l’or au cours des dernières années, et la Banque centrale de Russie a fait de même. Au cours du deuxième trimestre de 2016, les réserves d’or de la Banque de Chine ont atteint 1 823 tonnes contre 1 762 tonnes enregistrées au dernier trimestre de 2015. La Fédération de Russie, pour sa part, a augmenté ses réserves d’or d’environ 290 tonnes entre décembre 2014 et juin 2016, elle a clôturé le deuxième trimestre de cette année, avec un total cumulé de 1 500 tonnes.\\nFace aux brutales secousses du dollar, il est crucial d’acheter des actifs plus sûrs, comme l’or. En période de grande instabilité financière, il s’agit d’un refuge sûr. Donc, la stratégie de Moscou et de Pékin consistant à vendre des bons du Trésor US, pour ensuite acheter de l’or, a été suivie par de nombreux pays. Selon les estimations du Fonds monétaire international (FMI), les réserves d’or des banques centrales du monde entier ont déjà atteint leur plus haut niveau des quinze dernières années après l’inventaire, au début d’octobre, d’un volume total de près de 33 000 tonnes [ 4 ].\\nL’évolution des relations internationales joue également son rôle dans l’élaboration d’un nouvel ordre financier mondial. Suite à l’imposition de sanctions économiques contre le Kremlin, à partir de 2014, la relation avec la Chine a pris une grande importance pour les Russes. Depuis lors, les deux puissances ont approfondi leurs liens dans tous les domaines, de l’économie, des finances, et de la coopération militaire. En plus de garantir la fourniture de gaz à la Chine pour les trois prochaines décennies, le président Vladimir Poutine a construit avec son homologue Xi Jinping une alliance financière puissante qui cherche à mettre fin une fois pour toutes à la domination de la devise états-unienne.\\nActuellement, les hydrocarbures que Moscou vend à Pékin sont payés en yuans, pas en dollars. Ainsi, la « monnaie du peuple » ( renminbi en chinois) est en train d’émerger progressivement dans le marché mondial des hydrocarbures à travers le commerce entre la Russie et la Chine, les deux pays qui, à mon avis, sont à la tête de la construction d’un système monétaire multipolaire.\\nLa grande nouvelle est que la course à la dé-dollarisation de l’économie mondiale a été rejointe par l’Arabie saoudite, un pays qui depuis des décennies était resté un allié fidèle de la politique étrangère de Washington. Étonnamment, au cours des douze derniers mois Riyad s’est débarrassé de plus de 19 milliards de dollars de bons du Trésor des États-Unis, devenant ainsi, avec la Chine, l’un des principaux vendeurs de la dette US [ 5 ]. Pour aggraver les choses, la fureur du royaume saoudien contre la Maison Blanche a augmente d’intensité.\\nIl se trouve en effet qu’à la fin de septembre dernier, le Congrès est passé outre le veto du président Barack Obama à une loi qui empêchait les États-uniens d’attaquer l’Arabie saoudite en justice pour son implication présumée dans les attentats du 11 septembre 2001 [ 6 ]. Simultanément, l’Organisation des pays exportateurs de pétrole (OPEP) a conclu un accord historique avec la Russie pour réduire le niveau de la production de pétrole et favoriser ainsi une augmentation des prix [ 7 ].\\nIl est frappant de constater que, à l’époque, Pékin a ouvert des négociations directes avec l’Arabie saoudite pour commercer directement entre les deux monnaies, le yuan et le riyal, sans passer par le dollar, ceci à travers le système chinois d’échange de devises étrangères (CFETS, pour son sigle en anglais) [ 8 ]. Par conséquent, il est fort probable que, tôt ou tard, la compagnie pétrolière Saudi Aramco acceptera les paiements en yuans au lieu des dollars. Si cela se réalise, la Maison des Saoud jouera à fond le pari du petroyuan [ 9 ]. Le monde est en train de changer sous nos yeux.\\nAriel Noyola Rodríguez Traduction\\nJJ\\nsite : Le Saker Francophone\\nSource\\nRussia Today (Russie)'"}, "time": 1742562227.747066}