{"duration": 0.73329758644104, "input_args": {"text": "\"Derrick Broze November 13, 2015 \\n( ANTIMEDIA ) The annual military budget has been approved by U.S. lawmakers and is expected to be signed by President Obama, but what are we not being told? \\nOn Tuesday the U.S. Senate approved the latest version of the National Defense Authorization Act for 2016. Voting 91 to 3 last week, the Senate approved the revised bill, which includes $607 billion in defense spending as well as $5 billion in cuts. The bill then passed the U.S. House of Representatives. \\nObama vetoed the previous version of the bill because it would have limited the transfer of detainees from the military prison at Guantanamo Bay, Cuba to the United States. However, the new version of the bill retained provisions which will likely prevent Obama from keeping his promise to close Guantanamo. \\nWhite House spokesman Josh Earnest said he expects the president to sign the bill, stating , “That certainly does not reflect a change in our position, or the intensity of our position, about the need to close the prison at Guantanamo Bay.” \\nObama also battled Republicans, not over limiting the military budget and focusing on domestic programs, but over whether they were raising defense spending limits high enough. When you look closer at Obama’s actions, you see he is actually voting in line with the rest of the war hawks. He is not demanding military budget cuts, nor that the United States begin winding down the global American empire. In fact, President Obama is simply asking for yet more money to continue to launch wars of aggression based on lies and fear. \\nMany of you may remember that President Obama had no problem signing the NDAA 2012, which legalized the indefinite detention of American citizens suspected of ties to terrorism. It should be noted that the indefinite detention provision is still contained in the NDAA, and has been approved by Congress and signed by President Obama every year since it first passed. \\nSo what’s hiding in the latest version? Sign up for the free Anti-Media newsletter the establishment doesn't want you to receive \\nThe current edition of the NDAA will continue to ensure United States involvement in the conflict in eastern Ukraine by offering lethal aid to the Ukrainians fighting Russia in Crimea. Section 1250 of the Senate version , titled UKRAINE SECURITY ASSISTANCE INITIATIVE , and will authorize $300,000,000 to “provide appropriate security assistance and intelligence support, including training, equipment, and logistics support, supplies and services, to military and other security forces of the Government of Ukraine.” \\nThat same section also grants funds for “Lethal assistance such as anti-armor weapon systems, mortars, crew-served weapons and ammunition, grenade launchers and ammunition, and small arms and ammunition.” Some of the weapons types the U.S. is offering to Ukraine include “Counter-artillery radars, including medium-range and long-range counter-artillery radars that can detect and locate long-range artillery, Unmanned aerial tactical surveillance systems and Cyber capabilities.” \\nHowever, Ukraine will not be the only recipient of weapons funded by U.S. taxpayers. The U.S. Congress is happy to continue supporting conflict in Syria by funding so-called “moderate” rebels who are allegedly fighting against Syrian President Bashar al-Assad. All signs indicate the Syrian civil war has become another U.S.-led proxy war against Russia. \\nSection 1225 of the Senate bill, titled MATTERS RELATING TO SUPPORT FOR THE VETTED SYRIAN OPPOSITION , allocates resources for logistical support including “Defensive supportive fire, Intelligence, and Medical support.” \\nWhile the media focused on the battle between the White House and Republicans, it completely failed to mention that all current proposed versions of the 2016 NDAA will continue the proxy war between the United States and Russia — which could potentially accelerate the push towards outright conflict.\""}, "time": 1742562632.1045728}