{"duration": 0.13214874267578125, "input_args": {"text": "'Watch: Aerial Footage Catches Man Stopping at a Drive Thru — While Being Chased By Police Home / Be The Change / Government Corruption / There Has To Be a Cheaper Way To Find The Worst People — 2016 Elections Will Cost Over $6 Billion There Has To Be a Cheaper Way To Find The Worst People — 2016 Elections Will Cost Over $6 Billion Claire Bernish October 30, 2016 2 Comments \\nThis presidential election cycle has been nothing, if not a controversy-laden shit show of the bizarre — and a monumentally pricey one, at that. It’s now estimated the stupefying cost for the duopoly to provide us with two altogether unappealing candidates — possibly the least liked in American electoral history — as well as congressional minions, totals no less than $6.6 billion. \\nAnd that’s a conservative figure. \\nDespite nearly a century of anti-marijuana propaganda inundating schools, ads, and politics, in fact, legalizing cannabis has greater approval from the public than either Hillary Clinton or Donald Trump. Yet, the two candidates, their respective political parties, outside groups, and individual donors will, all told, spend around 86.5 million inflation-adjusted dollars more than on the 2012 presidential election. \\nThere simply must be a cheaper way to find two people no one wants to vote for. \\nHell, Giant Meteor — the satirical no-party candidate whose slogan, “Just end it already,” speaks volumes to weariness — has amassed a sizeable following in recent months, as the public apparently abandons all pretense of hope. \\nTo wit, 70 percent of voters likely to support Hillary Clinton, and a stunning 41 percent of all likely voters, would re-elect President Barack Obama if a third term were legal, Rasmussen reports. \\nSo, if the public harbors only negligible fondness for Clinton and Trump, who deems them worthy of such colossal sums? \\nUnsurprisingly in both cases, it’s the elite — the billionaires and millionaires directly, indirectly, and sometimes shadily channeling their fortunes in hopes their chosen nominee will conform policy favorable to their interests from the helm of the White House. \\nOpenSecrets.org reports : \\n“Candidates and news outlets have decried the outsized influence of a small number of donors throughout the election season. Here’s a startling statistic: The top 100 families have given about 11.9 percent to the total $5.5 billion raised at this point, compared to 5.6 percent in all of 2012. Their names are familiar — Thomas and Kathryn Steyer have given $57.2 million to liberal causes, Sheldon and Miriam Adelson have doled out $47.3 million to GOP-allied forces, and Donald Sussman has so far provided $34.4 million to groups helping Democrats. Expect to see this list shift a bit: Facebook cofounder Dustin Moskovitz pledged an additional $35 million to defeat Donald Trump earlier this month.” \\nPerhaps surprisingly to some, billionaire globalist and avid political influencer, George Soros, ranked only 9th in the list of top donors, contributing ‘just’ $17,689,038. \\nAnd this election cycle hasn’t been devoid of grassroots political donors, either, although their chosen ‘voice of the people’ candidate, Bernie Sanders, has since dropped out and endorsed Hillary Clinton — leaving a legacy of heartbroken, if not embittered, young voters scrambling for options — and an older, wiser generation hardly able to contain its I told you so’s . \\nOpenSecrets continues: \\n“The Obama re-election campaign floored campaign finance experts with his knack for tapping into the small donor pool — an impressive 32 percent of the campaign’s total funds came from people giving $200 or less in 2012. But Bernie Sanders topped that. More than half of his contributions, or 59 percent, came from small donors, totaling $134.6 million, which is about one and half times as much as Clinton and more than twice as much as Trump.” \\nClearly, the so-called ‘little guy’ has nary the clout enjoyed by the privileged, moneyed class — and though that might be widely understood — the reminder dark horse candidates rarely make it to the big race seems more pronounced than ever in recent years. \\nAs an Independent, Sanders’ decision to run on the Democratic ticket against the all-powerful Clinton, as a Democratic Socialist, no less, seemed fated to fail from the start — after all, groundbreaking though his bid was, a populist David vowing to disassemble the corporate, banking Goliath could never reap the billionaire financing to endure. \\n“In a campaign that has broken new ground in lots of ways, there’s at least one thing we can depend on, and that’s record-breaking spending on U.S. elections,” explained Sheila Krumholz, executive director of the Center for Responsive Politics. “While this campaign saw the rise of the small donor and a fall in spending reported by groups that hide their donors, overall, important trends hold true: More money is still coming from a tiny set of elite donors. It’s going to super PACs that are scarcely independent of the campaigns they support. And it’s targeting competitive races where the vote will be closest and the opportunity to have an impact, greatest.” \\nIn effect, the elite doles out its fortunes on elite candidates who will best serve the elite’s interests — but, nah, take it from Hillary: the Russians might rig the election. \\nMoney is proportionate to influence, it could justifiably be argued, and in an election cycle costing upwards of $7 billion, the overwhelming majority of us pull literally zero weight. \\nFinagling the popular vote constitutes little more than a distraction for the political heavyweights, whose insider connections and corporate and industry backers effectively usurped what little import the average American voter maintained when the Supreme Court ruled in their favor with the notorious corporations are people Citizens United decision in 2010. \\nWhatever vociferous contention Clinton and Trump might garner from an unusually alert populace this election season, don’t be fooled — the elite ultimately pull the strings — the vote is merely an illusory construct of a severely limited choice between two candidates of their choosing. Not ours. \\nAll told, just remember the words of Mark Twain: \\n“If voting made any difference they wouldn’t let us do it.” Share'"}, "time": 1742563819.680401}