{"duration": 0.07665085792541504, "input_args": {"text": "'WASHINGTON  —   When the F. B. I. director, James B. Comey, announced the bureau’s findings in its investigation of Hillary Clinton’s personal email server, he revealed something that, while cloaked in opaque technical language, helped to answer a question long at the heart of this controversy: Just how sensitive was the information in those emails? Of the   emails the bureau reviewed, 113 were determined to “contain classified information at the time they were sent or received,” he said. Another 2, 000 or so emails were retroactively “  to make them confidential. ” Those 113 emails, according to the investigation, contain information that was sensitive enough to be automatically considered classified the moment it was sent. This finding seems to suggest that a small number of Mrs. Clinton’s emails did include government secrets. This helps to explain why Mr. Comey, despite recommending no criminal charges against Mrs. Clinton, rebuked her and her team as “extremely careless in their handling of very sensitive, highly classified information. ” At the same time, the far larger share of 2, 000 other emails considered “ ” do not fall into this category  —   and speak to   criticisms that Washington has a problem with overclassifying banal information. These designations shed light on the nature of the information in Mrs. Clinton’s emails and on the debate around them. There is a reason that Mr. Comey dwelled on the 113 emails (a few of which had included classified markings, he said) detailing their provenance  —   110 came from 52 email chains included in the files originally submitted to the F. B. I. three from emails the bureau found by other means  —   and their classification level. First, it seems to contradict Mrs. Clinton’s statements. “I did not send classified material, and I did not receive any material that was marked or designated classified,” she said in August 2015, though Mr. Comey said Tuesday that a few of the emails did bear such markings. Second, Mr. Comey revealed that the information in those emails was sensitive enough to be what is officially known as “born classified,” a technical but highly meaningful distinction. This doesn’t mean that there was a State Department officer standing over Mrs. Clinton’s shoulder classifying emails as they came in or went out. Rather, it means those emails contained information that was obtained through classified channels or generated in ways that make it automatically classified. For example, if Mrs. Clinton took notes on comments that a foreign ambassador made to her in confidence, then this information would probably be “born classified” because of how it was gathered. This practice dates to a 1946 law called the Atomic Energy Act, which established, among other things, that all information pertaining to the development of nuclear weapons would be automatically considered classified. That designation now extends far beyond nuclear issues, but it is still considered an important metric for information that should be treated with secrecy. Mr. Comey, in detailing the classification levels, seemed to drive this home. Eight of the reviewed email chains contained information deemed “top secret,” the highest level of secrecy, the bureau found. Another 37 contained information that was designated “secret,” and the final 10 were “confidential,” the lowest level. This does not necessarily mean that Mrs. Clinton was copying and pasting information from   C. I. A. reports  —   the designation can reflect how information was gathered as much as it does its content. Several of Mrs. Clinton’s classified emails were related to the C. I. A. ’s covert drone program in Pakistan, which has been widely reported in the news media. But the “born classified” designation is meaningful, indicating that the source of the information is so sensitive that the government assumes significant harm if it emerges. Mr. Comey seemed to suggest that handling such information on a personal email server reflected a significant error of judgment. “Even if information is not marked ‘classified’ in an email, participants who know or should know that the subject matter is classified are still obligated to protect it,” he said, warning that the State Department was “lacking in the kind of care for classified information found elsewhere in the government. ” Then there are the other   emails that Mr. Comey described as “” which he said meant that “the information in those had not been classified at the time the emails were sent. ” This is a much murkier category. While it is difficult to judge these emails without reading them, “ ” often has less to do with a document’s contents than it does with Washington’s   habit of overclassification  —   a problem distinct from Mrs. Clinton’s email practices. American classification practices, which are not governed by any one set of rules, have been criticized by virtually everyone who has encountered them, including the people tasked with their management. Classification is determined by “a series of bureaucratic fiefdoms” operating under “a hodgepodge of laws, regulations and directives,” J. William Leonard, then the head of the federal office that oversees classification, said in 2003. The result, critics say, is that government information is routinely classified with little regard for its actual sensitivity. This is driven less by secrecy than by bureaucratic disarray, which is why national security officials have often led efforts at reform. A member of the   Commission, Richard   warned Congress in 2005 that overclassification had to be reduced to prevent another attack. “Information has to flow more freely,” he said. “Much more information needs to be declassified. A great deal of information should never be classified at all. ” While subsequent legislation has tried to address this problem, many of the system’s core contradictions remain. That often comes through in the process of “ . ” For example, a document might begin as unclassified but later pass through an office that handles state secrets. Or a piece of information that is banal on its own might later be referred to in a classified report, making that piece of information also classified. Or a document might be unclassified according to the rules of the agency that created it, but become classified by another agency that uses it. This is why some Clinton allies have argued that her emails may have been deemed classified not because they contained sensitive information but because they had been swept up in routine Washington overclassification. The fact that so many of the reviewed emails were “ ” rather than “born classified” seems to support this argument. Still, those 113 “born classified” emails, even if they are a very small proportion of the total, speak to Mr. Comey’s charge that Mrs. Clinton, in some instances, “should have known that an unclassified system was no place for that conversation. ”'"}, "time": 1742562254.8730478}