{"duration": 0.1299147605895996, "input_args": {"text": "'Leave a reply Notes toward a theory of overlapping universes “If everything is already connected to everything, as we’re told, the universe would be one dead hot dog, long past its expiration date. We should, instead, be considering a universe of separated forces, and when they come in contact, they can produce sparks of surprise, novelty, spontaneous energy, and synchronous possibilities…” (The Magician Awakes, Jon Rappoport) “The 19th French Impressionist painters were all dedicated to revealing light in nature. They made all their subjects bathe in it. But each painter pursued that goal in a different way, as if he were describing a different universe. Perhaps they were also showing the collision of several universes…” (The Magician Awakes) \\nJon Rappoport – Consider a different way of looking at things: The life we are living has an invisible characteristic which is massively important. \\nThis characteristic is the meeting and overlapping of separate universes. \\nWhen this phenomenon occurs, it produces what some people call synchronicity. The important thing is: this synchronicity is spontaneous in the moment and alive and vital and brimming with possibility. If we recognize it, it “fills the cup to the brim” and spills over. It is abundant. \\nSome physicists claim that, in order to make sense out of quantum theory, in order to track its implications, you need to accept multiple universes. \\nIf you wanted to move into even deeper waters, you would consider the proposition that such universes interconnect and overlap. \\nDuring roughly the same period that quantum theory appeared, painters were exploring simultaneous universes. Cubism and Collage (Picasso, Braque), Surrealism (Dali, Max Ernst, Roberto Matta). Writers were moving that direction (Rimbaud, Andre Breton, Apollinaire, Jarry). \\nConceiving of this universe as one space-time continuum would naturally lead to the question, “Why not more than one continuum?” \\nDreams, in their episodic unfolding, shift radically from one scene to another, and the dreamer isn’t jolted out of sleep by the changes. He goes on the ride. He’s absorbed in the action. He’s a kind of explorer, on a search, and if the voyage takes him from one universe to another, so be it. \\nBut in waking time, we want our experience to be serial, to follow the rules. We want our language to bolster the rules. Subject, verb, object. And so we ask, as well, that our problems lead to solutions in a straight line. \\nOccasionally, we might wonder whether there is an entirely different way to effect solutions, particularly when we’re dealing with a stubborn or chronic problem. \\nIn a way, that was my impetus for developing what I call Magic Theater, based on Psychodrama, in which people would improvise roles in dialogue with each other. \\nFor example, when faced with Problem X, the person plays the role of “the person who has already solved X.” And in this role, he speaks with “someone who is struggling with X.” \\nA new situation is invented, where two separate universes, so to speak, collide and overlap. \\nOr a person plays the role of Problem X itself and speaks as that problem, to someone who is playing the role of “an inhabitant of a universe in which Problem X could never exist.” \\nIn a general sense, you simply have two people play the roles of inhabitants of vastly different kinds of universes. They sit and talk to each other. \\nIn approaching the subject of simultaneous overlapping universes, the notion of synchronicity pops up. Thirty years ago, I used to walk around Los Angeles with my camera snapping hundreds of pictures. At the Norton Simon Museum in Pasadena, on a Saturday afternoon, I was standing outside the main building taking pictures of Rodin’s large sculpture, The Burghers of Calais. A heavy-set woman wearing a long coat suddenly stepped into the scene and looked up at one of the Burghers. I caught her in the frame and snapped the shot. Later, when the black-and-white photo was developed, it turned out that her overhanging hair-do was nearly identical to the piled up arrangement of hair on the Burgher she was staring at. Her head was the same wedge shape as the Burgher’s. The similarity and the dissonance (a metal man, a flesh-and-blood woman, from two different epochs) were startling. \\nA few minutes later, inside the Museum, I was focusing my camera on a very large painting of several 18th-century courtesans reclining on a couch in a luxurious chamber hung with rich heavy curtains. This was just the kind of painting I would ordinarily pass without a second glance. Two girls stepped in front of the painting and looked up at it. I snapped several shots. Later, after developing them, I saw that the girls were wearing all sorts of costume bracelets and rings. The contrast between the girls’ and the courtesans’ jewelry, and between the young fresh faces of the girls and the opulent experienced faces of the courtesans, was quite marvelous—and the photo diminished the distance and separateness between the girls and the painting. The universe of the girls and universe of the painting suddenly met and overlapped. \\nAs a wandering photographer in Los Angeles, I experienced many of these spontaneous synchronicities. \\nThis was a different order of reality. I would never have found it, had I not been carrying a camera and taking pictures. It would have been invisible. But there it was, on film. \\nI was prompted to think that the reality of the street is much more than we usually believe it to be. That “more” is actually there, all the time. But we stumble past it. \\nThe “more” is multiple universes. We ignore them, because we’re trained to. \\nSuppose we are actually living in multiple universes all the time, and the gist of it, all the time, is the spontaneity and surprise and novelty that imparts life and vitality to the whole operation. If we could see it. \\nAnd we don’t see it, because every time we experience a glimpse of it, we discount it as “fantasy,” and we stash those moments, as memories, in the place where they seem to belong, THE IMAGINATION. \\nAnd then, by living with imagination, we re-discover simultaneous overlapping universes…. \\nWe expect and insist on a flow of cause and effect in space. That’s the way we conceive of events. A to B to C to D. \\nThis is the story of investigation in this universe. And it works, of course. It works brilliantly. \\nWhat happens in an engine? Trace the flow of energy through the working parts and out into another mechanical framework where the energy gets something done. A to B to C. \\nI’m simply proposing an additional way of looking at events. \\nAs an analogy, take this odd view of magnetism. The piece of iron is already “attract-able.” It has that quality. And the quality involves vibration, motion, a reaching out. And then we have the magnet, which already has the quality called “capable of attracting something.” And the magnet and the piece of iron are separate and simultaneous worlds. And it is this fact that gives strength to the overall attraction. The magnet and the piece of iron could forever exist as separate. They could never meet. They are self-contained worlds. They aren’t inherently connected because of their “attitudes” toward attraction. They are whole and separate. Then, when they come near each other, there is an explosion, an overlapping, which stems from what they already are. \\nAnd in the same way, separate but simultaneous percolating of different processes in the body meet and overlap. Side by side “worlds” operating in their own ways, in the body, create a condition of health. \\nImagine that each “world” in the body exudes energy radiations, its own particular DIFFERENT radiations. The neurotransmitters do. The hormones do. The blood system does. The digestive system does. The immune system does. And so on. And when all these distinct and different energy outputs, as multiple universes, meet and overlap, you get health. \\nWe are tuned to say, “Well, health is expected and understood when everything is working well. We know about health. We’re very familiar with it.” But suppose the situation I described above—separate universes in the body simultaneously existing side by side—IS REALLY A SYNCHRONICITY, in the sense that its nature is surprise. A thing that wasn’t predicted and isn’t blandly familiar at all. Just as people you never expected to be walking on the street at the same moment are showing up on the same street at the same moment, and you never notice that surprise because you’re trained to expect the category called “people walking on the same street”—in that same sense, these worlds of operation in the body are all about surprise and novelty and are really of a fantastic nature—and THAT is somehow why health appears. \\nSpontaneity, over and over and over again. \\nAnd suppose we are actually living in multiple universes all the time, and the gist of it, all the time, is the spontaneity and surprise and novelty of the overlappings. \\nAnd we don’t see it, because every time we experience a glimpse of it, we discount it as “fantasy,” and we stash those moments in the place where they seem to belong, THE IMAGINATION. \\nMany people, these days, want to say “TOGETHER, not SEPARATE.” They have their reasons, which are too tiresome to rehash. I’m suggesting that separate can be brilliant, can imply simultaneity, spontaneity, the juice of life, multiple universes. \\nAfter all, when physicists say “multiple universes,” do you immediately jump in and say, “Well, they’re just one really big universe”? Do you? Or do you admit the fascination of OTHER universes not inextricably bound to the same laws as this one? Other places, other events, other people, different, thrilling. \\nWhen you dream, do you tell yourself all dreams are actually one big glob of dreaming, or do you jump in and explore the unique landscape in front of you in the dream you’re in? And isn’t it exciting when one dream collides with the next one, and you make the jump—from one universe to another? \\nSo…what makes the life we know interesting and intriguing and thrilling and worth living is actually: the collision of multiple universes that naturally deliver spontaneity, surprise, novelty, and synchronicities that give us the chance of discovering new paths and roads and futures. \\nAnd along those roads, we can invent greater futures than we had previously imagined… \\nJon Rappoport is t h e author of three explosive collections, THE MATRIX REVEALED , EXIT FROM THE MATRIX , and POWER OUTSIDE THE MATRIX , Jon was a candidate for a US Congressional seat in the 29 th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free emails at NoMoreFakeNews.com or OutsideTheRealityMachine . SF Source Jon Rappoport  '"}, "time": 1742628298.619959}