{"duration": 0.03728771209716797, "input_args": {"text": "'Pinterest \\nDemocrat presidential nominee Hillary Clinton’s glass house of sexual impropriety and hypocrisy just got a new addition. Clinton is set to fundraise with rapper Jay-Z, whose lyrics put GOP nominee Donald Trump’s 11-year-old comments to shame. \\nClinton, who brands herself as some sort of champion of women’s issues, will fund-raise with Jay-Z, whose popular song titled “Big Pimpin” includes the following lyrics: You know I – thug em, f— em, love em, leave em Cause I don’t f—in need em Take em out the hood, keep em lookin good But I don’t f—in feed em First time they fuss I’m breezin. \\nTaking desperate women “out the hood,” taking the money they make from selling their bodies and further abusing them is really championing women’s issues, eh? \\nLet’s see, Trump made some lewd comments about what consenting adult women would hypothetically allow him to do because of his star status and he’s a monster, but Jay-Z talks about profiting off of the misery of desperate women and treating them like garbage and hey, he’s with her! \\nWestern Journalism reported : \\nWriting on TruthFeed , Amy Moreno noted that Clinton has a stable of rap artists supporting her whose language is beyond offensive. \\n“Even while Hillary and her supporters are feigning outrage, she ran a contest on her website promoting a ‘meet-and-greet’ with rap artist Pusha T, who says vulgar things about women in his songs,” she wrote. \\nIn Got ‘Em Covered , Pusha T sings: All of you lil’ n—as quote all of the wrong figures Poke all of the wrong b—s And follow the wrong n—as.” \\n“Yet, besides all that anti-woman vulgarity, Hillary had a contest on her website to meet this animal,” wrote Moreno. \\nWestern Journalism also reported that earlier this month, Trump supporter Betsy McCaughey called out Clinton’s hypocrisy. McCaughey responded to the video of Trump’s comments by noting how Clinton accepts support from rappers who denigrate women for a living. \\n“Hillary Clinton expresses that she finds the language … horrific, but in fact she likes language like this, quote, ‘I came to slay, b—-. When he F me good, I take his a– to Red Lobster,’ McCaughey said and added, “That happens to be a line from Beyoncé.” \\n“Her [Clinton’s] favorite performer whom she says she idolizes and would like to imitate,” she continued. “So you know what I’m saying to you? There’s a lot of hypocrisy.” \\nClinton doesn’t care about women, children , minorities, or anyone else that she uses and abuses to gain votes. Clinton cares about money and power — that’s it.'"}, "time": 1742562313.9987428}