{"duration": 0.07345008850097656, "input_args": {"text": "'NTEB Ads Privacy Policy MAGA-MANIA: Ford Motor Company Calls Donald Trump To Say They Won’t Be Moving To Mexico “Just got a call from my friend Bill Ford, Chairman of Ford, who advised me that he will be keeping the Lincoln plant in Kentucky -- no Mexico,” Trump wrote in a Twitter post. by Geoffrey Grider November 18, 2016 President-elect Donald Trump suggested on Twitter that he convinced Ford Motor Co. to keep production of a Lincoln sport utility vehicle in the U.S. instead of moving it to Mexico. And the automaker doesn’t dispute that. \\nEDITOR’S NOTE: Donald Trump made a handful of super hardcore campaign promises which resulted in being the deciding factor why so many Americans voted for him. One of those promises was that he would seek to impose a 35% tariff on Ford Motors if they moved to Mexico. Mere days after Trump’s massive victory, Ford chairman Bill Ford personally called president-elect Trump to congratulate him on his win, and to say that Ford will not be moving. Say it with me one time –“ Make America Great Again! “ \\n“Just got a call from my friend Bill Ford, Chairman of Ford, who advised me that he will be keeping the Lincoln plant in Kentucky — no Mexico,” Trump wrote in a Twitter post. Just got a call from my friend Bill Ford, Chairman of Ford, who advised me that he will be keeping the Lincoln plant in Kentucky – no Mexico \\n— Donald J. Trump (@realDonaldTrump) November 18, 2016 \\nFord builds the Lincoln MKC small SUV at its Louisville Assembly Plant in Kentucky alongside the Ford Escape SUV. Ford had never said it was considering shifting MKC production south of the border. But the company confirmed Friday that it had been “likely” to move the work to Mexico in 2019 when its current contract with the United Auto Workers union expires. TRUMP FLASHBACK: Ford moving division to Mexico is a disgrace: \\nThis is what started the ball rolling for Trump back in the beginnings of his campaign. “We had planned to move the Lincoln MKC out of Louisville Assembly Plant,” probably to the Cuautitlan factory in Mexico, Christin Baker, a Ford spokeswoman, said in an e-mail. \\nTrump has criticized Ford for planning to move all its North American small-car production to Mexico, where wages are 80 percent lower than in the U.S. Ford also builds the Lincoln MKZ sedan at a factory in Hermosillo, Mexico. During the campaign, Trump threatened to slap Ford’s Mexican-built cars with a 35 percent tariff . He also said he would terminate the North American Free Trade Agreement, which lets goods flow between Mexico, the U.S. and Canada without tariffs. Ford Says It’s Keeping Lincoln Production in Kentucky After Donald Trump Tweets \\nFord, which has expressed a willingness to work with Trump since he was elected, confirmed late Thursday it told the future president the Lincoln SUV will stay in Kentucky. \\n“We are encouraged that President-elect Trump and the new Congress will pursue policies that will improve U.S. competitiveness and make it possible to keep production of this vehicle here in the U.S.,” the automaker said in an e-mailed statement. \\nBill Ford met with Trump during the campaign in an unsuccessful attempt to get the candidate to stop targeting the automaker, which says it has created nearly 28,000 jobs in the U.S. during the past five years. In his first answer of the first debate with Democratic candidate Hillary Clinton, Trump attacked the automaker for plans to move production of the Focus small car and C-Max hybrid from a plant in Michigan to Mexico. \\n“We are everything that he should be celebrating about this country,” Bill Ford told reporters in September. “We pulled ourselves up by our bootstraps, we paid back our borrowings, we are healthy again, we’ve been adding jobs in the U.S. and we are the largest manufacturer of cars and trucks in the U.S.” source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742563977.2107453}