{"duration": 0.016089439392089844, "input_args": {"text": "'NTEB Ads Privacy Policy As Her Electoral College Numbers Begin To Fall, Crooked HIllary Calls Off Election Night Fireworks The campaign called the Coast Guard last week to tell them the event was off, three days after the New York Post reported it was planning the bash - although the cancellation was secret until Monday. It emerged as fresh projections of the electoral college showed she has lost the iron grip pollsters believed she had on the 270 college votes needed for victory. by Geoffrey Grider November 7, 2016 Hillary Clinton’s campaign has called off its planned election night fireworks display, it emerged Monday, the day before America goes to the polls. Staffers were going to put on a two-minute show over the Hudson River after the results come in on Tuesday, but the proposal has been canned, TMZ reported on Monday. The campaign called the Coast Guard last week to tell them the event was off, three days after the New York Post reported it was planning the bash – although the cancellation was secret until Monday. It emerged as fresh projections of the electoral college showed she has lost the iron grip pollsters believed she had on the 270 college votes needed for victory. CNN has moved Ohio, Utah and one district of Maine from toss-up to leaning Republican, and New Hampshire from leaning Democratic to toss-up. That changes the math significantly for Clinton, putting her projected total at 268 and Trump’s at 204 – with the rest of the votes to be fought over. 10 Things You Didn’t Know About Hillary Clinton: Until now she had been above 270. Fox News has changed its projection too, making Utah and North Carolina toss-ups, rather than leaning towards Clinton, while Arizona and Iowa move to leaning Republican. And a series of other measures pointed to a far tighter race than some pundits had predicted. In Florida, early voting figures obtained by the Drudge Report suggested Trump was doing better than Mitt Romney, and Hillary Clinton was under-performing Barack Obama in 2012. Similarly, Drudge reported that North Carolina had seen Trump exceed early voting expectations. The figures showed Trump behind be 305,000 when Romney was behind by 447,000 – a deficit which he still won the state from. The cancellation of the fireworks emerged three days after FBI director James Comey told Congress his agency was investigating a trove of emails found on the laptop of Anthony Weiner, husband of Clinton aide Huma Abedin. The cancellation was made Thursday – before Comey wrote again to Congress to say that the FBI had not found anything to justify changing its verdict of no charges to the Democrat about her use of a private email server while she was secretary of state. Still, Clinton’s campaign suffered collateral damage in the nine days which elapsed between the letters. source \\nGeoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742628567.7707212}