{"duration": 0.11810135841369629, "input_args": {"text": "'BUFFALO  —   Fans grumbled loudly last March when the N. C. A. A. men’s basketball tournament’s selection committee declined to include Monmouth in the field, and Commissioner Bernadette McGlade of the Atlantic 10 denounced St. Bonaventure’s snub, declaring herself “shocked” and saying, “It’s a tremendous disservice. ” This year, though, officials from midmajor programs and conferences  —   those outside the five autonomous leagues that dominate the top level of college football, plus the Big East  —   mustered little beyond shrugs for a field even more lacking in teams from their cohort, which supply the vast majority of Division I’s 351 members. They seem to have made peace, or at least a truce, with an indisputable reality: The midmajor team selected for an   berth is an endangered species. “The system is not designed to be totally fair,” Doug Elgin, the Missouri Valley Conference commissioner, said. “That’s the way of Division I basketball. It’s always been that way. ” Elgin once sat on the selection committee, and he currently serves on the men’s basketball oversight committee. “It’s not a complaint,” he added. “It is simply a statement about the current system. ” Elgin expressed respect for the “process and integrity” of the selection committee. That Illinois State, a member of his conference, did not receive a berth was “disappointing” but “understandable,” he said. “I’m not whining,” he said. “I’m just saying. ” The principle of equal access still exists: The tournament’s   field consists of the champions of the 32 Division I conferences  —   meaning all 351 teams begin the season with a chance  —   and the 36 “best” remaining teams. But for the event that most prominently symbolizes the N. C. A. A.’s     ethos  —   and that provides the vast majority of the association’s revenue  —   the trend line is striking. Midmajor teams received seven of those 36   bids in 2011, the year the tournament expanded to 68 teams. The next few years that number was 11, 11 and 10, before dropping back to seven again. Last year, there were six, this year four, and of the best four teams that did not make the cut, only one was a midmajor. “There seems to be a bias somewhat inherent in the structure,” Richard Ensor, the commissioner of the Metro Atlantic Athletic Conference, said. It has become obvious that playing, and beating, other good teams is by far the most effective way to land in the committee’s good graces. The rating percentage index, or R. P. I. which situates teams’ winning percentages in the context of their schedules’ strengths, remains the committee’s primary mechanism for sorting teams. Since teams play the majority of their games   those in power conferences have more opportunities to notch quality wins. Cutting a swath through one’s midmajor league, by contrast, can prove insufficient by itself. Illinois State was   in M. V. C. play this season, but when it lost the conference tournament final to Wichita State, and didn’t have other quality wins to overcome that, it was out. The powerful influence of   quality wins can be seen most clearly in certain seeding choices. Wichita State was   and highly rated by advanced metrics that the N. C. A. A. has sought to embrace. Yet it beat just one tournament team  —   No. 16 South Dakota State  —   and wound up slotted on the No. 10 line, indicating that had it not won its tournament, it might not have qualified at all. Meanwhile, Gonzaga, another midmajor, was awarded a No. 1 seed not only for going   but for beating two eventual   champions and several other   squads. “You have to have something that gives you the opportunity to do some of those comparisons,” Mark Hollis, this year’s selection committee chairman, said. Hollis, of Michigan State, added, presumably in reference to scheduling and defeating tough nonconference competition, that “programs that have done it have been recognized and have been rewarded in the tournament process over the years. ” It is natural that the power conferences would receive a disproportionate share of   bids, since it is natural that they would produce more good teams tested against better competition. Wake Forest and Belmont, for example, have about the same enrollment, but only one receives tens of millions of dollars in annual conference payouts and plays North Carolina and Duke every year. Still, Cinderella’s carriage is probably not a permanent pumpkin. It has been less than a decade since a prominent midmajor, Butler, as a member of the Horizon League, made consecutive appearances in the national title game, and only four years since Wichita State mounted its own Final Four run. Some midmajors have become   whether via realignment (Butler joined the Big East) or sui generis achievement (Gonzaga). But those are the lucky few. Observers now describe a vicious cycle in which fewer   bids for leagues and teams lead to fewer resources and less exposure, leading to declines in recruiting and performance, leading to fewer   bids. The resources that come with tournament berths are not only abstract. In addition to standard   payouts, leagues receive “units” of roughly $250, 000 for each appearance a member makes in the tournament (one unit for a berth, a second if it wins its first game, and so on). Units from one appearance continue to pay for six years. There are also less immediately tangible benefits. For instance, Bloomberg found increases in donations to small colleges that pull off big upsets. “Getting selected has some significant impact on institutions, and even more on the smaller ones, like St. Bonaventure,” said the athletic director there, Tim Kenney. “You get financial benefit from the units. You get an increase in donations  —   having been part of schools that have won before, you definitely get an uptick  —   and you’re able to tell your story more. ” “It helps in recruiting,” Commissioner Amy Huchthausen of the America East Conference said. “All those downstream effects that can be generated from getting just two teams in are really helpful. ” Those few programs that have, against the odds, developed consistently competitive teams in midmajor conferences have their own challenges. Scheduling quality opponents frequently requires playing in their arenas, in a sport in which the home team wins   of the time, and playing excellent basketball in November and December, in a sport in which   teams can cohere over months, go on a run in February and March against their   league rivals and still scramble into the bracket. And since playing hungry, ascendant midmajors carries the substantial risk of a loss, few good teams see an upside in agreeing to the games. “The better you get, the more difficult it is to get   teams on your schedule,” Elgin said. “It’s a    game. ” Illinois State Coach Dan Muller devised a quintessentially 2017 mousetrap on Monday, tweeting at the power conferences that he wished to schedule games. Mississippi’s athletic director took the bait, tweeting back, “We’d love to match up. ” On Tuesday, Illinois State’s athletic director, Larry Lyons, said he hoped to find a mutually agreeable date. Reflecting on the larger problem, though, Lyons joined his compatriots in stolid resignation. “I wish I had a better answer for how to fix this,” he said, “but I don’t. ”'"}, "time": 1742561907.1271183}