{"duration": 0.08341145515441895, "input_args": {"text": "\"Health experts share the top home remedies for fighting a cold \\nTuesday, November 01, 2016 by: Amy Goodrich Tags: cold symptoms , natural remedies , immune booster (NaturalNews) Stay well during the colder months with these simple, time-tested home remedies to prevent a common cold, help shorten the duration and get you feeling better in no time. A common cold is caused by a virus, so there is no point in taking antibiotics which only kill bacteria. While there is a host of over-the-counter remedies available to soothe the symptoms of a common cold, nature offers far better and safer solutions.We all know the prevention drill. Load up on immune boosting foods rich in vitamin C , exercise regularly and wash your hands often. But what else is there you can do to avoid a runny nose, sore throat or a cough? Seven Health editors reveal their sickness-preventing secrets. Gargle salt water If you feel the first signs of a scratchy throat, Jeannie Kim, executive deputy editor, recommends a salt-water gargle. She is convinced that it has stopped countless of her colds. To soothe a sore throat and kill the sick-making germs, combine half a teaspoon salt with one cup of water and gargle. Repeat several times a day until scratchiness disappears. Create some heat According to Clare McHugh, editor-in-chief, a hot bath or shower is the thing you need. She explains that viruses that cause a common cold don't like the heat and are discouraged to multiply if you keep your body warm. And why not add immune boosting and cold fighting essential oils to your bathtub to enhance the healing effect?Furthermore, you could try the good old hot water bottle to help loosen phlegm and deep congestions in the chest. Swallow raw garlic If you don't mind to sweat it out and have a garlic breath, Lisa Lombardi, executive editor, recommends eating or swallowing raw garlic. While the next day her symptoms usually get worse, she feels better in 3 days.If you cannot stomach garlic's taste and spiciness, then you might want to go with the traditional garlic cure which consists of garlic, lemon, and honey. Crush one clove of garlic and add it to a cup of warm water with one teaspoon of honey and the juice of one lemon. Give it a good stir and repeat this remedy two to three times a day for the duration of your symptoms. Take Echinacea Michael Gollust, the research editor, swears by echinacea lozenges. He says that while they don't stop a cold in its tracks, they definitely reduce the severity of the symptoms. The BBC, however, reports on a comprehensive review that scanned the literature and included only the very best studies, showing that people who use echinacea may also have 10 to 20 percent less chance to catch a common cold. Stay hydrated Most Health experts agree that hydration is essential for a speedy recovery. Anthea Levi, the editorial assistant, adds that if you are struggling with blocked sinuses, adding lemon juice and cayenne pepper to your glass of water is all you need to breathe freely again. Go to bed early They often say sleep is one the best natural doctors. Tomoko Takeda Canel, the acting beauty director, couldn't agree more. When she gets sick, she cancels all her plans, has a light meal and then prioritizes an early bedtime to get better.Next time you get a cold, keep these tips and tricks in mind, and you won't need over-the-counter drugs that can do more harm than good. Sources:\""}, "time": 1742561825.9809632}