{"duration": 0.04795980453491211, "input_args": {"text": "'President Obama weighed in on the right-wing efforts to revive the Hillary Clinton “email scandal” witch hunt by publicly chastising his own appointed FBI Director, James Comey, for the FBI’s unnecessary decision to inform Congress that they had found new emails that may be “pertinent.” \\nThe President reiterated his determination to not be seen as “meddling” in the case , but rightfully criticized Comey for stirring up undue controversy over pure speculation on emails that were neither sent nor received by then-Secretary of State Hillary Clinton. \\n“Setting aside the particulars of this case, I know that [Hillary Clinton] is somebody who has always looked out for the interests of America and the American people first, and I do think that there is a norm that when there are investigations, we don’t operate on innuendo, we don’t operate on incomplete information, we don’t operate on leaks, we operate based on concrete decisions that are made. \\nWhen this was investigated thoroughly the last time, the conclusion of the FBI, the conclusion of the Justice Department, the conclusion of repeated congressional investigations was that, you know, she had made some mistakes, but that there wasn’t anything there that was, you know, prosecutable.” \\nThe president hit the nail right on the head. This “investigation” is over and done with; for Comey to throw fuel on the fire of right-wing paranoia this close to the election cannot be seen as anything but a partisan effort to derail the campaign of Democratic nominee Hillary Clinton, especially after it became clear that Comey tried to suppress news of the investigation into Republican nominee Donald Trump’s ties to the Russian Federation – a much more serious and potentially seditious allegation. \\nWatch the President speak here: ‘We don’t operate on innuendo’ — President Obama discusses Hillary, emails, and the FBI in an exclusive interview with NowThis pic.twitter.com/0J6tJyEYSh'"}, "time": 1742562988.4755685}