{"duration": 0.06725597381591797, "input_args": {"text": "'A once highly recognized high school girl’s track star from New Britain, Connecticut, has lost her usual first place spot to a boy who “identifies” as a girl on an opposing high school track team, and her loss sparks many questions about fairness and rights. [Kate Hall, a junior at a Stonington High School, has spent several years typically coming in at the top in track competition. Until this year, that is. This year she has routinely lost that top spot because opposing Cromwell High accepted a boy claiming to be a transgender girl onto its track team.  Freshman Andraya Yearwood, 15, a biological male who identifies as a girl, received permission to join the Cromwell High girls track team after competing as a boy in middle school. Not surprisingly, Yearwood has been extremely successful as a male competing against females. Yearwood has thoroughly defeated every female opponent. According to the Hartford Courant, “Andraya’s times in the 100 and the 200 are fast. A year ago, her 11. 99 in the 100 would have won the Class M title and put her second at the State Open, . 01 seconds behind the winning time. And Andraya ran Wednesday in cold conditions, and without starting blocks. She is expected to get faster. ” “It feels really good. I’m really happy to win both titles,” Yearwood recently bragged to the media after winning the Class M contest. “I kind of expected it. I’ve always gotten first, so I expected it to some extent.   …     I’m really proud of it. ” And, all of this has occurred quite despite the fact that Yearwood has taken no steps to transition into a girl. The runner stands taller than opponents, is clearly far more muscular, and even sports a faint,   mustache. Yearwood’s top opponent, Kate Hall, seems sadly resigned to constantly losing to a “girl” who has all the more powerful attributes of a boy. “There’s not much I can do,” Hall said after losing the Class M to Yearwood. “Second doesn’t work for me. Yeah, it does, in a way, for the team. But you come into a state championship meet looking to win a state title. I had an awesome chance. I could have done a lot of things (differently). If I’d run my best, I could have won it. ” “It’s frustrating,” Hall added. “But that’s just the way it is now. ” But, Yearwood’s easy wins against biological girls continue to raise questions in New Britain. Even as most break their necks trying desperately to avoid being seen as criticizing a “transgender athlete,” many are still wondering if it is fair that a powerful, biological boy should be allowed to compete against frailer high school girls. Jeff Jacob of the Hartford Courant raised the questions in a recent column, saying that “on a biologically competitive basis,” Yearwood’s victories are not fair to the competitors. Ultimately, Jacobs felt that the results of the competition have been tainted. “Humanity counts. So does biology,” Jacobs wrote. But, he went on saying, “For me, somebody who has observed sports and written about all kinds of athletes for four decades, the integrity of the state competition for these two races Tuesday was compromised. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742563242.6775753}