{"duration": 0.05923295021057129, "input_args": {"text": "'Home / News / The African voters in the US who want Donald Trump as their president The African voters in the US who want Donald Trump as their president fisher 1 min ago News Comments Off on The African voters in the US who want Donald Trump as their president The African voters in the US who want Donald Trump as their president In less than 48 hours, Americans will go to the polls to elect a new president. But no matter what happens on election day (Nov. 8), Trump will not win the majority of the black vote. Many of them are expected to heed the message of president Obama who has warned that the Republican candidate will undo his administration’s legacy. But Trump ’s message—to make America great again—might still draw an unlikely group of supporters from within the black community: African immigrants. Foreign-born Africans make up a small share of the US immigrant population, but their numbers have been doubling every decade since 1970. African immigrants living in the US grew from 80,000 in 1970 to 1.8 million as of 2013, according to a study from the Pew Research Center. This group of voters say they are supporting Trump because of a blend of ideals that his candidacy represents: as the new flag bearer for conservative, traditional politics; a political outsider who has chipped away at political correctness; a successful businessman who has consistently reinvented himself to achieve the American dream; and a man sure to deliver them from what they see as the disappointing presidency of Barack Obama . Despite Trump ’s anti-immigrant rhetoric, some African immigrants have been dissatisfied with Obama ’s middling Africa policy and think real change from an outsider like themselves could make a positive difference for America their own fortunes. Leading this pack is none other than president Obama ’s Kenyan half-brother, Malik. The 58-year-old naturalized US citizen, has spoken about his own brother’s leadership as “deep disappointment,” and said that Trump was “providing something new and something fresh” to the American people. Some of the African Trump supporters like Malik have also voiced their concerns about the moral relativism that has pervaded US politics, from abortion rights to marriage equality, to the current debate on transgender bathroom use. I tried to co-exist with my brother Barack Obama but he shut me out; In his Ivory Tower. I gave up. — Malik Obama (@ObamaMalik) November 5, 2016 VOTE FOR MR. TRUMP ! Malik already voted. — Malik Obama (@ObamaMalik) November 5, 2016 Reno Omokri, once the controversial new media aide to Nigeria’s former president, Goodluck Jonathan, is now a pastor in the San Francisco Bay area. Speaking to the BBC, Omokri said that he supports Trump because he was going to nominate a Supreme Court judge who might reverse, or deal, with these issues from a conservative standpoint. “Those issues, they might seem small to you,” Omokri said, but they “are very important to someone like me because I am a conservative and that is why I am supporting Donald Trump .” Khadra Abdirahman is a 24-year-old Somali-American who was born in New York after her parents fled the civil war in Somalia. But as a registered Republican and a first-time voter, she intends to cast her ballot for a political candidate who is against the status quo. Establishment party leaders she said, are oblivious to the populism born out of frustration, which is why she would vote for a candidate like Donald Trump or Bernie Sanders, instead of Hillary Clinton or Jeb Bush. Abdirahman, who didn’t support Obama when he ran in 2008 and 2012, thinks the 2016 elections are “a change election” and a “revolutionary election.” She says the “surge of anti-establishment, anti-globalist political revolutions,” the like we have seen with Brexit, should provide the space for candidates like Trump to be elected. “America projects a false image of goodness and truthfulness and it is actually extremely rotten to the core.” Sign up for the Quartz Africa Weekly Brief — the most important and interesting news from across the continent, in your inbox. '"}, "time": 1742628293.0381377}