{"duration": 0.06450557708740234, "input_args": {"text": "'VIDEO: Idiot Destroys Trump’s Hollywood Star, Gets BAD NEWS Seconds Later Posted on October 26, 2016 by Robert Rich in Politics Share This \\nSocial media is buzzing about Donald Trump’s Hollywood star being destroyed in California. However, it seems that the man responsible just came forward by making a video – but his stupid stunt turned around and slapped him big time when he got bad news just a short time later. \\nSince the beginning of his campaign, Trump’s Hollywood star in Los Angeles, California has sustained it’s fair share of vandalism. From people spray painting a Nazi swastika on it to literally taking a crap on it, the most recent stunt was far worse than all the rest. \\nSeemingly trying to destroy the star for good, a man, who has since been identified as James Otis, used a sledgehammer and pickaxe in order to help him vandalize the well-known emblem. All caught on video by shocked onlookers, Otis could be seen hitting the star with a pickaxe resulting two plates breaking free. \\nAs it turns out, those plates depicted both the Hollywood star television emblem and the presidential hopeful’s name. Since that point in time, Otis has come forward in order to claim his fame – but it took mere seconds for him to realize that not everything is exactly going according to his poorly thought out plan when he promptly got some bad news. Donald Trump’s star before (left) and after (right) (Source: TMZ ) \\nAlthough the man states that he’s willing to go to jail for his crimes, he may not have actually known what he was getting himself into. According to The Hollywood Chamber of Commerce, the plaque is (or was) worth a whopping $30,000, meaning that Otis admitted to a felony. \\nFelony vandalism (damaging over $10,000 worth of property) can result in imprisonment for up to three years in state prison and a fine of up to $50,000. Otis stated that he does intend to turn himself in and has already hired a lawyer, but we’ll see just how tough he is when he has to face a judge. \\nThe tough guy wannabe later added that he “wanted to face Trump in court,” but the idiot must have forgotten that he didn’t destroy Trump’s property, but rather, the state of California’s. Making matters worse for himself, Otis states that he intends to sell the plaques taken from the star on election day, claiming he will donate all the money to Trump’s so-called sexual assault victims. \\nUnfortunately for him, the more he talked, the more trouble he got himself into. After all, most people know that selling or buying stolen property is a criminal offense as well. We all know that Hillary Clinton’s voters aren’t the smartest in society, but this guy may just take the cake. Then again, he’ll have plenty of time to think about how dumb he is while he’s pissing his life away behind bars.'"}, "time": 1742561709.917928}