{"duration": 0.031964778900146484, "input_args": {"text": "'Christopher Manion https://www.lewrockwell.com/lrc-blog/threats-real/ \\nBack in the 1980s, I was involved in Senate hearings that exposed some of the corruption in the Mexican government, business elites, police, and the military. \\nWe were only touching the tip of the iceberg, of course, but the State Department vehemently opposed us nonetheless (yes, there were neocons there then as well). \\nThe hearings were ignored in the States, but they raised Hell in Mexico, and that meant that it raised Hell in the coven of apparatchiks at State as well. They did their best to retaliate, and, fortunately, the leader of the pack pleaded years later to federal charges of lying to Congress (“Hey, doesn’t everybody???!!”) on another matter (Sometimes the chickens do come home to roost.). \\nBut the Mexican corruptos were a different breed. Nobody was going to bring them to justice – the ruling PRI (then and now) was seamlessly coordinating and cooperating with the drug gangs, the military killers, and the corrupt elites. \\nSeveral years later, I planned to attend a conference in Mexico City – where I used to live, but had not visited since our hearings. Then, out of nowhere, at a social function, a diplomat from the Embassy of Mexico in Washington approached me and said, “I hear you’re going to Mexico.” (How did she know?) \\n“Go nowhere alone,” she said sternly. “Stay in your hotel after dark. Travel only with the other conferees on the bus (she knew everything about this very non-political conference). And NEVER hail a cab!” \\nSo there I was. I couldn’t go to the Shrine of Our Lady of Guadalupe. I couldn’t go visit old friends in their homes. I couldn’t even go look at the house in Colonia Polanco where Stalin’s secret agent from Barcelona killed Leon Trotsky with a pickaxe. \\nSo I asked this generous woman, who was probably risking her career, why she was telling me this. \\n“They have long memories. They have a kill list. I’ve seen it,” she said. \\nPeriod. \\nThe (im)moral of the story: Death threats are real. So this recent headline caught my attention: \\nDave Schippers, who served as the Chief Investigative Counsel for the House Judiciary Committee’s probe into whether Bill Clinton committed impeachable offenses, is “terrified by Hillary Clinton.” \\nRead it . He wanted to investigate everything, including the corruption, the cattle futures, the murders – not only Vince Foster’s, but all those folks in Arkansas But he was waved off. He read every single document that had been collected on the breadth and depth of the Clinton Corruption Machine, but he was stiffed by unidentified higher-ups. \\nEver since, he’s watched his back. I’m sure that he can’t walk around alone at night, or hail a cab on a busy street, or take his kids to the park. \\nWhy? Because death threats are real. Ignore them and you die.'"}, "time": 1742628553.5153913}