{"duration": 0.0548701286315918, "input_args": {"text": "'Before the Carolina Panthers’ game on Sunday, Kenya Jones and her three young daughters stood at a   booth outside Bank of America Stadium and mulled the options. Should they have the word “Panthers”   in teal and silver on their foreheads? How about the   panther, sparkly fangs and all? Just a few feet from Jones and her girls were police officers in riot gear. A legion of them was surrounding the stadium before the game, less than a week after Keith Lamont Scott was killed in this city  —   yet another unsettling police shooting of a black man in America. The officers wore helmets with clear face masks. Hanging from their belts were thick   to be used as handcuffs. Several carried guns that shoot round rubber bullets. At least one stood with a red canister of pepper spray at the ready, at his feet. “How do I explain this to my girls?” Jones, a waitress whose daughters are 11, 7 and 5, said as she nodded toward the officers. “It’s just sad to see this and what’s happened to our country. It’s sad because this game is supposed to be all about fun. ” Sports are hardly a haven or an escape from reality anymore. Some fans might hate that. Some players might, too. Regardless, at N. F. L. games throughout the country, every Sunday this fall is providing plenty of reminders that the United States is painfully divided. Jones tried to make it a carefree weekend for her and her girls because one of her daughters was celebrating a birthday. But their plans to stay at a hotel in downtown Charlotte on the eve of the game had to change. Jones wanted to stay safe. A protester was shot and killed there last week during riots. Jones, who is from Greensboro, N. C. said she hadn’t told her girls about the shootings. But because of Scott’s death, and what she sees as injustice against blacks in the United States, she told me that she would not stand during the national anthem at Sunday’s game against the Minnesota Vikings. “I just feel like this country isn’t doing anything to protect its people,” she said. “It’s my way of protesting that. ” Some of the Panthers wanted to protest, as one. Tre Boston, a safety, said he had spent days counseling other players to get on board with a plan for the team to show its support for the community  —   every part of the community  —   and that Sunday was the day to do it, as the world would be watching. There was a lot of  . Boston said that Panthers General Manager Dave Gettleman and the coaches were on board, but that the plan came together only on Saturday afternoon, with not enough time to execute it on Sunday. Some players just didn’t feel comfortable speaking out, for various reasons, Boston said, and needed to be coaxed. “This is way bigger than football,” Boston said after the game. “Football’s a sport. I’m thankful for the sport I play, but at the end of the day, you’re talking about a human being’s life being taken. You’re talking about people being victims. ” Boston didn’t rule out the team’s protesting during the national anthem, an idea sparked by Colin Kaepernick, the San Francisco 49ers quarterback who has been kneeling during the anthem to protest police brutality and injustice. In about a month, look what Kaepernick has done using the power of his sports fame. Kaepernick  —   who is only a football player  —   has sparked a national debate. He has motivated other athletes to speak out for their convictions. And now fans, like Jones, are doing so, too. The protest has spread to the W. N. B. A. where players have knelt, en masse, during the anthem, and to college and high school teams. Megan Rapinoe, of the United States soccer team, has also been kneeling  —   and one team owner in the women’s pro league even changed the timing of the anthem to sabotage her political statement. Fans show up with strong opinions on the anthem situation, and even end up booing their own players based on how those players act during the song. “I would be really, really angry if Cam Newton didn’t stand during the national anthem,” Amel Salihovic, a construction manager who is from Bosnia and lives in Charlotte, said before Sunday’s game. Jennifer Hibner, a librarian who was headed into the stadium, said she’s “all about freedom of speech” but said that players who don’t respect the anthem “can go and play football in Canada. ” Last week, Newton talked about the situation in Charlotte, but he was far from forceful in his words. While only a few other players, including Boston, spoke loudly and clearly about what was happening in the city, Newton took the   less courageous route. He said it would be “a  ” situation for him if he publicly took a side. Instead, Newton carefully walked a noncommittal line on Sunday, when the spotlight  —   however unfair it might be  —   shone on him harsher before the game than during it. Some fans expect athletes these days to be moral leaders, and social leaders, but it’s clear that Newton and others players just aren’t comfortable with that. During   Newton wore a black shirt with a Martin Luther King Jr. quotation on it: “Injustice anywhere is a threat to justice everywhere. ” But as two gigantic American flags were unfurled on the field and the first note of the anthem played, Newton was standing at midfield on the sideline, and standing tall. Just feet away, his teammate Marcus Ball raised a fist. After the game, Ball wouldn’t explain it, repeatedly saying only the phrase, “One love,” when asked about his protest. While his fist was in the air, though, some fans were still arriving. Many thanked the police officers who were standing guard some fans even stopped to pose for selfies. A group of maybe 50 protesters gathered across from the stadium, with more than three dozen officers lined up nearby, staring at the protesters in silence.   dogs were weaving through the crowd. A helicopter was hovering above. The group chanted: “Indict, convict, send those killer cops to jail. The whole damn system is guilty as hell!” Back inside the stadium, the game unfolded without incident. Fans cheered Newton and the Panthers, but many left early, anticipating their team’s loss to Minnesota,  . Off they went onto the streets of this city in turmoil, where riot officers  —   and reality  —   waited.'"}, "time": 1742628418.627897}