{"duration": 0.5554606914520264, "input_args": {"text": "\"Home / Badge Abuse / Parents on a Date Were Asleep in Car When Cops Arrived and Killed Them Both Parents on a Date Were Asleep in Car When Cops Arrived and Killed Them Both Matt Agorist February 25, 2016 213 Comments \\nInglewood, CA — On Sunday, police responded to a call of a suspicious vehicle parked on Manchester Boulevard around 3:10 am. When police arrived, they engaged in a 45-minute long standoff before opening fire on the man and woman inside the vehicle, killing them both. \\nIn the news release on Monday, following the shooting, police claimed that the woman in the car had a gun. Scott Collins, a spokesman for the Inglewood Police Department said that the couple refused to obey the officers’ commands to exit the vehicle. The officers then feared for their safety and opened fire on the car — killing the couple. \\nThe woman was pronounced dead shortly after the shooting, and the man succumbed to his injuries after paramedics transported him to a local hospital, according to the LA Times. \\nThe shooting seemed like an open and shut case until the next day. Mayor James Butts, while responding to questions about the shooting, opened up a huge can of worms — both the man and the woman were unconscious. \\nFor at least 45 minutes, police attempted “to rouse” them in an effort “to de-escalate the situation,” said Butts. \\nAfter admitting that the couple was asleep, Butts quickly defended the officers, noting, “Obviously at some point they were conscious because somebody felt threatened.” \\nHowever, that notion has yet to be proven and is particularly unlikely due to the fact that not a single officer received so much as a scratch, nor did the couple have any reason to be violent. \\nBoth of the victims were parents; Kisha Michael, 31, a single mother of three sons, and Marquintan Sandlin, 32, a single father of four daughters. \\nMichael’s twin sister Trisha stated the obvious when she said that it’s possible that Kisha merely passed out on the way home from their night out. \\nFamilies for both described them as devoted parents who made arrangements for care of their children while they took a night off, according to NBC Los Angeles. \\n“The police ain’t telling us nothing,” said Trisha Michael after being met with tight lips from the department. \\n“He was a loving father,” said Sandlin’s sister Leandra Faulkner. “All he cared about was his girls, getting them right.” \\nOf course, as is standard procedure for all those killed by police, their arrest records were released to shame them. Michael was on probation for a misdemeanor last year, and 7 years ago, Sandlin was charged with unlawful possession of a firearm in Los Angeles. \\nAccording to his relatives, Sandlin had a ‘rough life’ but had turned it around and was working as a successful truck driver. \\nSadly, these children will now grow up knowing that their parents were taken from them by cops, scared of a sleeping couple. Share Google + Concerned Citizen \\nPerhaps the mother had the gun on her lap for protection while they slept. At least they didn’t drive drunk. These parents did not deserve to die! Mary Hagerty \\nDid she really have a gun, or did the cops just say that to excuse the murders of two sleeping people? Lying about weapons is a known police tactic to get out of trouble. Sometimes they go as far as to plant a weapon. Conscious \\nLet’s say they had a gun. How did the police see it if they were asleep. Hmmm that makes it irrelevant John and Linda Robel \\nWHO GIVES A FUCK ABOUT “DRIVING DRUNK”? IT IS DETERMINED BY AN ARBITRARY NUMBER THAT IS EXTORTED BY THE UNITED STATES CONGRESS..WE ENCOURAGE PEOPLE EVERYDAY TO ANNUL THIS POLICE STATIST HORSESHIT. A FELONY CAN BE EXPUNGED BUT NOT A FUCKING MISDOMEANOR DUI. GET A GRIP. THIS NOTHING BUT A GOVERNMENT RACKET AND PROFFITEERING OF THE DUI INDUSTRY. Kevin Burnett \\nSounds like more #blackliesmatter twits. Alan Lammle \\nSounds more like #Bluethugliesmatter twits. Duryea L. Williams \\nSmh……ignorance is contagious Talisha Harris \\nNo where in the article talks about that movement. From the article it sounds like innocent people, who were not armed, and who were sleep were killed. Did I miss something? Anon ymous \\nThey may or may not have had a gun. But, having a gun is no reason for the police to shoot & kill someone. Nikkia Bailey \\nMaybe they were too drunk to drive Anon ymous \\nBlack lives matter also! What part of that is so hard to understand? Kburnett isanidiot \\nStop being an ignorant fuckwad racist troll, Kevin Turdnett. Philip Williams Ryan Robbins \\nMarie Laveaux – I’m not disagreeing with you, I just always like to see some real info before I jump to conclusions. Not just a headline. I have no idea what happened and will not put blame on either side unless I see some hard evidence. Julie Asperger \\nOn Los Angeles local news report they said the vehicle was stopped in the middle of Manchester Blvd not parked on the side of the road. (Both are illegal) seemed strange the way it was presented to us. This makes it even weirder. I passed by and seen there is a large memorial for them. To bad there is no video to see what really happened. \\nCops don’t like being filmed. \\nFor obvious reasons. Julie Asperger \\nYea I was harassed by some a few years back on Hollywood Blvd and intimidated into deleting video of them using excessive force on cooperating men. I even showed them my press ID and tried to be allowed to keep the video they said fuck the press. Kimberly Reichard Emerson \\nThe intelligent of us know we’re not. I can’t even comprehend what’s wrong with the people here that still believe we’re in “the land of the free and home of the brave”. It’s frightening to say the least. Shawn Soto \\nThis is so fucked up..Wtf is wrong with people. Why can’t any one just act right? All you fuckers carrying so much hate on race..it’s ridiculous. I’m sick of it!! An alot if peeps, an I mean alot. Are following an feeding this shit through media an all!! I hve mad love for all race in the world. Am does any one even hve a pure blood line now a days? I think not!! So don’t be fooled by just the way your skin looks!! \\nWe all belong to the human race. There’s no other race than that. Thom Prentice \\nnice infotisments Colin Parker \\nI never understood why their prior arrest recods are released, It’s not admissible in any court for a current charge so why are the police allowed to use it? Alan Lammle \\nTo help soften the public in their attempt to make them look like they did nothing wrong in shooting 2 people in cold blood… Gary Harryman \\nShouldn’t the records of every cop at that scene also be released? Tray Pressley \\nTo label them as “criminals” so they can justify the murder. MarkyMark NdaHouse \\nTo demonize the dead… jamesawyatt \\nAS LONG AS BUREAUCRATS ARE ALLOWED TO HIRE WITH LITTLE OR NO SUPERVISION THOSE WHO SEEK TO BE EMPLOYED AS COPS, MANY OF WHOM HAVE A HISTORY OF BEING BULLIES GOING BACK THROUGH THEIR CHILDHOOD AND WHO SEEK THIS MEANS OF FURTHERING THEIR BULLYING LUST NOW ARMED WITH IMPRESSIVE UNIFORM, SHINY NEW BADGE AND DEADLY WEAPONS AND WITH THE PRESUMPTIONS THAT THEY NOW HAVE A LICENSE TO BEAT, CRIPPLE AND SHOOT WHEN EVER AND WHOM EVER THEY PLEASE, ATROCITIES ARE EXPECTED TO BE THE NORM AND WILL BE EXPECTED TO GROW AT AN EXPONENTIAL RATE. IT IS FOREVER HOPED THAT ONE OR MORE LAW FIRMS WILL COME INTO BEING THAT WILL RELENTLESSLY UNDERTAKE THE FILING OF SUITS AND NOT ONLY AGAINS THE INVOLVED JURISDICTION AND THE INDIVIDUAL ROGUE COP OR COPS BUT THOSE WHO WERE INVOLVED IN THE HIRING OF THE COP OR COPS; THE IMPRESSION ALWAYS BEING THAT THESE WHO ARE RESPONSIBLE FOR THE HIRING AND THUS ARE AS GUILTY AS THE INVOLVED ROGUE COP(S) & THEY HAVE TO BE FACED WITH THE HARSH REALITY BY HAVING LEVIED AGAINST EACH AND EVERY OFFENDER HUGH AWARDS/FINES; NOT JUST ON THE JURISDICTION, I.E. THE CITY, COUNTY, STATE OR FEDS . . . BUT ALSO AGAINST EACH OF THE INDIVIDUAL INVOLVED IN THEIR BEING HIRSD . . . AS WELL AS THE ROGUE COP OR COPS THEMSELVES AS INDIVIDUALS; THE AWARDS TO BE PAID BY THE INDIVIDUALS’ BY THEIR PRORATED AWARD SHARE PAYMENT OUT OF THEIR OWN POCKETS AND ONLY A PRORATED SHARE BY THE JURISDICTION AS WHAT THE JURISDICTION PAYS WILL INVARIABLY COME OUT OF THE POCKETS OF THAT JURISDICTION’S TAX PAYERS. STIFF PENALTIES IN THE FORM OF HUGE FINANCIAL JUDGEMENT AWARDS SHOULD GO A LONG, LONG WAY IN FOSTERING AN AWARENESS BY THESE WHO HAVE ESCAPED ACCOUNTABILITY FOR SO, SO LONG OF THE POTENTIALLY VERY EXPENSIVE FOLLY OF THIS THEIR IRRESPONSIBLE ACTIONS WHICH RESULTS IN SO MUCH SUFFERING AND MANY TIME CRIPPLING INJURY AND/OR DEATH. Mary Hagerty \\nI agree, but please don’t use all CAPS to write. It’s way harder to read. Roberto Carlos Moscoso \\nSadly the government insists that they want to take guns away from civilians, for only police officers have training and are responsible enough to handle guns. Yet, I’ve seen more mass shootings and innocent people dying in the hands of cops than in the hands of “irresponsible citizens”. Crazy ah? Tracy Walling Otis \\nIs that true Marco Emilio Giovanni Maltese? That’s truly horrifying if so. If you have a source of those statistics, I would appreciate the link for it. I know it’s bad. I’m not denying that. But I am even more disgusted if it is that bad. :'( \\nI’ve read that cops killed more than 1000 people in the USA in the last 3 years. But I’m sorry I don’t have the link, you can search and you will find it easily. I think USA people should be more scared of cops than of terrorists. Alain Vosselman \\nI’m stunned.. i can no longer believe this. This is going to be talked about in the future (if we still have one) just as we talk now about Stalin’s regime… or Sadam Hussein’s…. or Pol Pot. From now on even if we discover new life 100 triljon lightyears away traveling by mega-super-freak-aliesh tech vehicles.. we’ll still be the most amazing embiciles of the universe. Aaron Beedle \\nThe fact that there are enough of these stories coming from america for several to be posted everyday proves how messed up the place is. I would not want to be a black person living in america today. I wouldn’t live there at all. Nothing will happen to the officers. They should be sentenced for murder, and receive a full sentence. Police officers over there intruding on people’s property and killing pets, killing people just walking down the street or washing their car. I’d i was an american the only reason i’d want to own a gun was to defend my self against police officers. Ryan Robbins \\nYou shouldn’t believe everything you are reading online. It’s bad right now, but it’s not nearly as bad as many are making it out to be. All of these innocent victims are not nearly as innocent as they are initially made out to be. When the truth finally comes out on most of these stories, it’s on page 6 and nobody takes the time to post it because it does not fuel there agenda to spread hate and prejudice. Aaron Beedle \\nit is true everyone has agendas… im sure there are a lot of people in general dying in america.. but i know from life that the people with the power are usually the assholes. I would say that at least 80% of all male human beings struggle to handle power reasonably. females would be close too. When it is appointed rather than earned, such as when someone is called a police officer and given a weapon that can kill people with ease, people tend to not handle it well. I heard a while ago that some parts of the world do not use equipment they would not fire at themselves. And they are made to. It teaches people restraint. Christopher Rawson \\nThe police across America are being demonized by a sickness in the system that wants to put us against one another. That human is a human ,none of us our without fault or live life without ever feeling in over our head….possibly there is another way Tim Walker \\nI suppose if “everyone” voted for that one independent/libertarian candidate, then maybe we would have a fighting chance. Sadly that will never happen. The vast majority of people have been brainwashed by the two main parties. With the division they have created they can easily put in any candidate they choose, how can anyone prove that it wasn’t predetermined? \\nI just watched a news video of this story. The mayor said the couple were passed out when police arrived. “Police spent 45 minutes trying to rouse them and de-escalate the situation”. How is there a situation to de-escalate if they are passed out? 山崎 コロッケ \\nRyan said nowhere in his comment that they deserved what happened. All he said was that another source had different information. If another source has clashing info, of course one of them is going to be wrong. No need to bash him. Vanessa White \\nSome groups must be trying to start to a race conflict and some are just happy with Anarchy. I would never call them for anything. They don’t seem to know who or when to shoot. Or maybe they are all amped up on steroids all the time. pitiful. I will keep the children in prayer. Blue Thugs \\nAll cops are cowards, never seen one that wasn’t a coward and bully. One of the cops got tired of waiting and said “gun” that was all the excuse they needed to open fire. What if that was a white couple with a gun in the car,nearly everyone has a gun on person or in the car these days. What if they have a permit or concealed carry permit. Do you fucking think the cops would have fired 62 rounds into that car and killed the white couple, well do you?. If one of the thug cops did holler gun, no one can ever say anything to contradict them. Cops know if only one side is left alive, no one can say otherwise. Better to be judged by 12 than carried by 6. That is every cops motto, as they know they are above the laws for mere mortal humans. Linda Brown \\nChickenshit Bullies This B.S. Has to stop. I belive all you say as I have been targeted in Canada. First Nations People,drunk & drive teens and pot smokers are all targets where I live. Every skin color fair game on last two. For sure these Peace Officers should be heald accountable face an open hearing ( open to public ) ” a fair trial ” and then deal with courts decision. I’m not sure if this happened to my friends it would not end in graveyard. These murders must face charges and hopefully Murder One. USN Veteran \\nBT, I respect your opinion however do not fully agree with you. I do know a few LEO’s. Good stock. Adult Scout Leaders. And there was an Officer from my childhood past, whom mentored me. However, I can not defend other LEO’s actions. I firmly believe that an armed society is a polite society. \\nARIZONA STATE CONSTITUTIONAL PROVISION — Article 2, Section 26. \\n“The right of the individual citizen to bear arms in defense of himself or the State shall not be impaired, but nothing in this section shall be construed as authorizing individuals or corporations to organize, maintain, or employ an armed body of men.” \\nArizona respects the right of all U.S. citizens to carry a concealed handgun with or without a permit, or to carry openly while in this state. An Arizona resident permit can be obtained for the purposes of carrying concealed while in other states that offer recognition or reciprocity. \\nCastle Doctrine Enacted Right to Carry Confidentiality Provisions Enacted Right to Carry in Restaurants Legal Right to Carry Laws No Permit Required Right To Carry Reciprocity and Recognition Outright Recognition Right to Keep & Bear Arms State Constitutional Provisions With Provisions \\nAs such, Arizona has fewer crimes per capita committed with a firearm as does California. How does extrapolate these facts? Perhaps as Arizonians have come to accept firearms as a know factor in their daily lives, whereas Californians do not. Perhaps California’s draconian laws encroach upon human mental health? Whereby inhibiting residents of the State of California to live in fear rather than confidence? \\nI for one shall leave this contemptuous State, seeking solitude of which only a truly free society can bring. I shall make Arizona my final resting place. (I expect in this forum environment, there may be egregious comments to the “final resting place”). ? \\nI respect all of my fellow American Citizens and their Constitutional RIGHT to express their opinions, as protected by the United States Constitutional First Amendment. \\nUSN Veteran Margie Campbell-Threadgill \\nMaybe I missed something in the article, but does it state that the cops fired 62 rounds in the car? If so, I missed it. Fed1718 XXX \\nDepartment of justice has statistics on police killings and being white doesn’t make you immune, in fact MORE whites were killed by police than blacks in the last 20 years. Doesn’t excuse this horrible murder of an innocent couple but please don’t fall prey to deluded thinking that being white makes a difference. Look for yourself. \\nHow is anyone white or black ever supposed to trust a police officer these days? Blue Thugs \\nFuck you dude. My dad is a good cop and i judge his actions too. You are biased. I’m not and leave ppl alone, they never bother with flat tires so fuck off. Chris Cochran \\nEvery single one of these cops needs to be charged with Murder, and the police need to pay to make those kids end up having a good life since they will never have their parents to give them one Gary Harryman \\nYes every cop at that scene is guilty of the same crime. Since they acted as a gang, they should stand trial as a gang and all be charged with the same crime – murder. Terri Spanjer \\nI wish people would stop and think for a minute about how the government is ALLOWING police to murder citizens and that over the last 2 years these incidents are occurring a hundred times a year. It’s all part of the Big Plan to remove ALL YOUR RIGHTS and TERRIFY YOU. … PS : Yes, 9/11 was an inside job. Think. \\nAmerican cops have been given free rein to do whatever they want — The government ENCOURAGES police brutality. Lucas Vegen \\nI dont understand, maybe im to young, maybe the UK is completely different. \\nBlack lives are being slaughtered even in their sleep and we sit and watch idol. \\nI learned at a young age. The Country will only change when its forced to, black people need to stand up, we are not shooting practice and we will raid stores, court rooms and banks in the 100’s or 1000’s if Money and Property is all they care about. \\nMore may die, but we all die eventually and will die sooner if we watch idol. This is the world you want to live and raise your kids in? Really!? \\nThis is not hate talk, but Black lives matter marches and speeches should be the calm before the storm… If they continue to kill us and our Children in our sleep. I dont think talking should be our last effort. How many more will die \\nIt won’t. They’re killing everyone now. Desiree M. Mondesir \\nINSANE. I KNOW all cops are not like this but the ones who are…God help them. Or rather, God help the people they senselessly murder and their remaining loved ones. How on earth does a sleeping couple threaten you, causing you to “fear for [your] life”?!?! B Alan Eisen \\nI fell asleep in my truck on a very cold night in front of my house. A police officer wanted to arrest me for sleeping in it, but the night was so cold, he got numb hands and left. Ross Thompson Laurie Choate \\nthis of course will be swept under the rug as quickly as possible.. they messed up bad on this one.. i would love to see the dash cams vids. but im sure that too is now gone.. very sad that we can no longer trust any person in uniform. \\nhow does one “de-escalate” a situation where the occupants of the car are asleep? David Lynn Courtney \\nfreaking terrible and shameful roomtempIQ \\nThe entire legal system is skewed, in favor of those who have money. No doubt black folks are unfairly targeted/abused/killed by cops, but us poor white folks get cop abuse as well, but us poor whites don’t seem to be killed by cops as often as black folks. \\nThat being said, I recently moved to a very rural county and the Sherriff’s Deputies here are stand-up good guys. They are not cowards or bullies. That is one reason I moved here. B Alan Eisen \\nI wouldn’t compare rural life with inner city life at all. Rural people respect each other. They help each other. The police are neighbors. You can explain inner city hell to yourself. Ян Кариси \\nIn 2015 the police in USA murdered 303 Black people and 578 White people. Total killed of all was 1140. \\nSo far in 2016 the police in USA murdered 33 black people and 81 White people. Total killed so far as of February 27 is 166. \\nBut, more whites than blacks you say..??? Simple, Only Black Lives Matter to the main stream media. Their mission is to promote an agenda to put us common folk against one another. Also, imagine if us whites acted like blacks when we have one of our own killed by police? When are whites going to loot and riot? Thomas Headen III \\nYou Riot when your sports teams lose, or win, for that matter. Percentages sir, say that black men are 21 times more likely to be killed by police than white men. I think if the percentage were reversed, you would be alarmed as well. God bless. Michael McMaster \\nTo put it in perspective, if police were shooting people in a colourblind fashion then you’d expect that for every 100 people shot, 12-13 of them would be black, and 68 would be white. Or to put it another way: Left handed people are about 10% of the population. If it turned out that year after year they were 30% of the people killed by police, it would be fair to ask why they were being singled out disproportionally. Anna Black \\nWhites Loot and Riot during sports. The real question is where is the All lives matter when this happens? Daniel robins one yahoo.com \\nWoops, they did it again. Todd Schacherl \\nSo now sleeping while black is a capital offense? “If only they had cooperated while sleeping, they wouldn’t have been shot.” Is that what we are to believe? Deloren Tucker \\nwtf… John and Linda Robel \\nThe Blue Code of Silence is well established and routinely used. Tim Egan wrote “Breaking Blue” a book that documents the historical corruption of these “Big Brave Heroes”. Orwell was right, ” BIG BROTHER IS WATCHING” and THE PIGS ARE RUNNING THE FARM”. Line these POS up for the FIRNG SQUAD and make their families watch.. John and Linda Robel \\nKEEP VOTING FOR DEMOCRATS ALL YOU STUPID SONS OF BITCHES AND KALIFORNIACATORS. I’M SURE GOV MOONBEAM FEELS YOUR PAIN. \\n“must have broke the law”“blue lives matter” -every cop apologist dickhead on the internet \\nWhat’s wrong with the cops, they couldn’t wake them up it’s a shame Nancy Keys \\nThey had me confused when they said the woman’s twin sister name Kisha??? Blue Thugs \\nEveryone in America needs to watch the documentry/movie called ” Peace Officers”. I bet a thousand to a cop’s doughnut there was no gun even in the car. If so it was planted after killing them probably. Stayce \\nWow, I didn’t know things were this bad . It just seems that being black is so wrong anymore. Why do these things keep happening? I just ask that all cops and law enforcement be mindful of what they are doing and double check their situation before over reacting. Now kids are without parents, this is ridiculous. Bless the babies and their parents. Lincoln Kirby \\nHuh I always thought the conscious scared the police more, i.e. Us. Oh wait they can’t tell who’s conscious and who isn’t. Why was I born with less rights than my parents, and my younger family member born with less freedoms than I was born with? The fuck happened. Did we stop thinking. Δανιήλ Ντάνιελ \\nFUCK THESE KIND OF MOTHER FUCKING PIECE OF SHIT POLICE WHO ARE JUST BULLYS WITH A BADGE AND A GUN HOPE THEY ALL DIE HORRIBLE PAINFULL DEATHS PIECES OF SHIT!!!! BROKE A WHOLE FUCKING FAMILY FOR WHAT? PUSSY BITCH ASS TRIGGER HAPPY PUSSY ASS PIGS SMFH! Deloren Tucker \\nWhen r we going to start fighting back Deloren Tucker \\npolice are only human like us Anthony Georgeson \\nThis has to stop, this is insane 7 orphans. Unarmed people killed by those who are supposed to serve and protect, crazed gunmen killing indiscriminately. This isn’t the wild west, this is a war zone. I know guns can be a tool as much as a wepon. A knife, a stick , a rock, a fist, can be a deadly wepon. How do we fix this start making every stich of clothing out of Kevlar. Replace fluoride with Prozac. Can we learn anything from places that don’t have a problem like Iceland. It has to stop. The Officers involved should have been interviewed by civilians before the went to Police Academy, maybe they weren’t good with serve and protect. \\nShow me the video! DKSMan \\nWTF this article is full of major inaccuracies. They weren’t parked on the side of the road. They were in the middle of a major street right in front of an intersection. They didn’t pull over and go to sleep. All you have to do is loom at the crime scene photos and see this article is full of false information. They had a gun on them as well. Catherine Durnford-Wang \\nSo? For that they deserve to be shot? And they had a gun? So what, again? Aren’t guns allowed under the second amendment? Zatanique \\nHow does a sleeping couple put anybody into a state of fear for their lives? I smell a cover up of monumental proportions by the cops involved. I can’t believe that they could possibly find a plausible reason to justify opening fire on these two people. Not only do I want to see a Special Grand Jury called to deal with these cops, police department and city. I want to see a wrongful death suit brought against them, the police department and the city. Because of these cops 7 children are without their parents. No amount of money is going to make that better or make up for what they did. \\nOn what planet could you possibly justify what happened? SMH for real \\nI cannot even grasp this! If they were not conscious why didn’t they try to make sure they were not suffering from Co2 poisoning. Oh no lets just shoot them and make up any story we like. Huh???? David Sbraga \\nIf you only had the courage to say that to someone face, and not while 6th were hiding behind a Kevlar and screen. I’d pray for you, but I don’t believe in prayer, and I don’t believe it would do you any good. Mark Nasia \\nparents on a date, were asleep in their car? does this headline make sense, I mean, two people shot while sleeping in their car makes more sense, that date would have happened before they decided to sleep, where are the editors these days \\nJevez Robinson Paul Myers \\nSurely the same laws should be used and Policemen and the hiring officials as is used against gangs and organised crime. Lets face it the police force is the biggest organisation of organised criminals in the world!!! \\nBlacks, Latinos, Asians, and Progressives must compete and vie for every civil service job. Once on, rise in rank and change The system. Genevieve Friday King \\nTwo exhausted parents falling asleep in a car in and of itself, not news. Hell, I’ve been at work and college and found parents zonked out from exhaustion from parenting…..but to be executed like this???? uh, were the cops afraid the parents would wake up and ground them for a week? or a stern talking to? Johndca Marible \\nThese cops need to stop it. So we’re suppose to believe that this woman and this man with 7 children between them are in a car that late at night just waiting to threaten cops with a gun. We’re REALLY suppose to believe that story? I don’t understand how cops can be so afraid when they have a license to carry a gun, training on top of that, a partner, and access to call for backup. I just don’t get it. If you’re that afraid of a Black person on sight, then you don’t need to be a police officer. You need to seek help. Last time I checked, it was Black people getting killed by the police and not the other way around. Yeah, the cops have a handful of tragedies but it cannot compare to the numbers when you talk about deaths of Blacks by police. Not by a longshot. I’m getting really tired of this and the whole USA needs to revamp its law enforcement system. You can give guns to cops who are suppose to protect and serve but where is the protection for the rest of us? Jeff Putterman\""}, "time": 1742561644.747637}