{"duration": 0.04480099678039551, "input_args": {"text": "'In a 2014 speech at his old high school in Rhode Island, Sean Spicer laid out his personal guidelines for success. Rule No. 4: Take responsibility when you mess up, and you will be rewarded. “I make mistakes everyone does,” Mr. Spicer, now the White House press secretary, told his audience. “How you handle those mistakes is what makes the difference in life. ” This week, Mr. Spicer is trying to take his own advice. One day after he delivered a stunner of a gaffe from the White House lectern  —   favorably comparing Hitler to President Bashar   of Syria, then clumsily referring to Nazi death camps as “Holocaust centers”  —   Mr. Spicer gave an abject apology on Wednesday, saying, “It really is painful to myself to know that I did something like that. ” “I made a mistake there’s no other way to say it,” Mr. Spicer said, his face taut, during a scheduled interview in Washington. “I got into a topic that I shouldn’t have, and I screwed up. ” Facing a national outcry that included calls for his resignation, Mr. Spicer offered no excuses, describing his remarks as “inexcusable and reprehensible” and acknowledging that the timing  —   during Passover and the Christian Holy Week  —   “compounds that kind of mistake. ” “On both a personal and professional level, yesterday was not a very good day in my history,” he told the MSNBC anchor Greta Van Susteren. His appearance, at a forum sponsored by the Newseum, was broadcast live by CNN and MSNBC, just one sign of the intense interest in the press secretary’s remarks. Mr. Spicer, whose tenure as President Trump’s chief spokesman has made him a television sensation and   punch line, calls himself his own worst critic. And while he said “it’s an honor” to serve as press secretary, he also marveled to Ms. Van Susteren about the level of scrutiny that the role entails. “No matter what you do, what you wear, it gets amplified to a degree that you couldn’t imagine,” Mr. Spicer said. (The fit of his suit and placement of his lapel pin are just two of the sartorial scandals he has faced so far.) When Ms. Van Susteren moved on to other topics, some of Mr. Spicer’s usual feistiness resurfaced. He complained about the Washington news media’s focus on palace intrigue over policy, and he repeated his laments about journalists’ reliance on anonymous sources. Responding to reporting based on unidentified sources, he said, was like “shooting at a ghost. ” Ms. Van Susteren responded by pointing out that the president often made assertions without providing evidence or the source of his information. Mr. Spicer also criticized the White House Correspondents’ Association dinner, which the Trump administration is boycotting this year. “I don’t think that just sitting there and watching a bunch of celebrities walk by is somehow an indication of how much you care about or respect the press or the First Amendment,” he said. But asked by Ms. Van Susteren if he enjoyed his job, Mr. Spicer responded, “I love it. ” “I truly do believe it’s an honor to have this job,” he added. “It is a privilege. And if you don’t believe it, then you shouldn’t be here. ”'"}, "time": 1742563280.1333675}