{"duration": 0.03165388107299805, "input_args": {"text": "\"Getty - Cindy Ord/Allergan \\nReality star Khloe Kardashian is just one signature away from being officially divorced from ex-basketball player Lamar Odom. \\nAs Us Weekly reports , the almost single Kardashian is now spending a lot of time with another professional basketball player, Cleveland Cavalier power forward Tristan Thompson. Khloe Kardashian traveled to Cleveland to support Tristan Thompson as he received his NBA championship ring. https://t.co/pHHPY6bk29 pic.twitter.com/2hG4Ysapfi — EntertainmentTonight (@etnow) October 26, 2016 \\nIn fact, the 32-year-old denim designer was seen cheering on her new boyfriend during the Cavaliers game against the New York Knicks on October 25th. \\nThat same game, Thompson and the rest of his team received their championship rings for winning the NBA final last year. \\nKardashian was sure to document the occasion on social media, posting a picture of the enormous, 14-karat gold championship ring encrusted with 216 diamonds. The picture posted to her Instagram not only featured Thompson's ring, but also a few of her own diamond rings as well: ❤️ A photo posted by Khloé (@khloekardashian) on Oct 25, 2016 at 8:54pm PDT \\nThe photo — simply captioned with a red heart — is causing a lot of people to wonder if Khloe learned anything from her sister's traumatic experience in Paris just three weeks ago. \\nWhile attending Paris Fashion Week, Kim was tied up, gagged, and held at gunpoint while five masked men ransacked her apartment, stealing $10 million worth of her jewelry. Kanye was performing at a concert in New York as it went down. \\nWhile in Paris, Kim posted a picture of her $4 million engagement ring from husband Kanye, which is rumored to be among the stolen jewelry. A photo posted by Kim Kardashian West (@kimkardashian) on Sep 29, 2016 at 12:40pm PDT \\nBefore the robbery, the Kardashian clan had been warned by police about the dangers of social media. Even fashion designer Karl Lagerfeld, who is no stranger to flaunting his wealth, told reporters that Kim needed to tone down her display of wealth on social media. \\nFollowing the incident with sister Kim, Khloe's picture on social media has followers asking: \\n“That's how she gets robbed.” \\n“Didn't you learn from what happened to your sister? Shouldn't flash your fancy jewelry on social media.” \\n“Good luck showing all that bling. How's Kim holding up?” \\n“#ThenGetsRobbed” \\n“Your sister was robbed and you are still posting bling? Have you learned nothing?” \\n“I love you, but didn't you learn anything from your sister's robbery? Why flash every jewel you have?” \\nSince the robbery, Kim has kept a very low profile , spending more time with her kids and her family and less time working and making appearances. Kim Kardashian has ‘cancelled everything,’ KUWTK filming is placed ‘on hold indefinitely’ https://t.co/GusRncKLBb pic.twitter.com/OVsfmnRh7L — Daily Mail Celebrity (@DailyMailCeleb) October 6, 2016 \\nKhloe's photo also sparked engagement rumors, but a source close to the Kardashian family says that the couple isn't heading down the aisle... yet. \\nAfter Kim's incident, it might be best for the Kardashians to keep photos of their expensive jewelry few and far between. \""}, "time": 1742628465.028401}