{"duration": 0.2165660858154297, "input_args": {"text": "'Bill White November 10, 2016 Here, On The Other Side \\nI don’t know about you, but I feel like I’ve just stepped out of H. G. Wells’ famous time machine and I’m standing on the other side of a great gulf in time. \\nAfter over a year of grueling, divisive political campaigning, Donald Trump has finally won the election to become the 45th president of these United States. \\nIf anything, this election has divided this country even more than the last eight years of Obama’s presidency. \\nDemocrats and Republicans have always been opposites, but since the makeup of these two parties has split along liberal/conservative lines, their opposition to one another has become even more obvious. No longer is it just that they support opposite sides of the same issue, now they don’t even see it as the same issue. \\nWhat I mean by this is well illustrated by the recent controversy over transgender bathroom rights . \\nTo liberals, the issue is fair treatment for what is clearly a minority group. They apparently can’t even see that giving that fair treatment puts women and girls at risk. But to the conservatives, the issue is all about protecting those girls and women. If the transgenders feel slighted by that, sorry, but safety has to come before their feelings. \\nSo now we have a new president elect, who somehow has to unite this divided nation and govern for all. That will be a monumental task, even without Obama having spent the last eight years trying to create division along whatever lines he could. \\nThe question is, is Trump up to the challenge? For that matter, is anyone capable of uniting us once again? \\nThe White House? \\nOf course, I have to say that winning the election doesn’t guarantee much of anything, right now. While Trump is the president elect, Obama is still in office. With all the election fraud that’s been going on this election, I have to wonder if the Democrats have some plan to keep him out of office, even if they have to break the law to do so. \\nGeorge Soros, the Democrat sugar daddy and puppet master all but said that they do. In a televised interview, he said that Trump would win the popular election, but that Hillary would ultimately occupy the White House. How can that be? What did he mean by that remark? \\nUntil inauguration day in January, things are still at risk. The Democrats could try to raise legal issues, saying that the count was inaccurate, as they did in the 2000 presidential elections. This seems to have become standard policy for the Dems, who seem to think that there’s no way that they could lose an election. After all, they’re the “elect.” \\nThere’s also the possibility of something happening with the Electoral College vote on December 19th, or for that matter, when they deliver their votes to the Senate President, Joe Biden on December 28th. \\nThere could even be problems when Congress meets to do their official count of the votes on January 6th. With all the election fraud that’s come to light in the primaries and general election, the possibility of fraud in the Electoral College can’t be ignored. \\nThen there’s Obama himself. Someone wrote an article about how Obama will stay in office, “impeaching” the citizens of the United States for not voting in Hillary Clinton. While I’m fairly sure that the article in question was a gag piece, it has made its way around social media a couple of times. \\nBut there is something that Obama could do, and I’ve written about it before. That is, he could declare martial law, suspending the Constitution. All he would need is a good enough excuse to pass scrutiny. \\nThat excuse could come from widespread violence or social unrest; and he’s got the means to make that happen. The police in Los Angeles and other major cities are preparing for mass riots (which liberals call “demonstrations”) in the wake of the election. \\nISIS has also called for violence, specifically on election day. While I haven’t heard any reports of terrorist incidents happening, that’s not to say that they still can’t. They have already shown their ability to infiltrate the United States and their capability to operate here. The big question is how many people there are here who claim an affiliation with ISIS and how well they can organize themselves to sweep the country with violence. \\nShould either of these groups rise up and fulfill their promises, we could see a bloodbath in the streets. That would be all the excuse that Obama would need, in order to declare martial law and keep Trump out of office. \\nWhether he could get away with that, or whether he would be forcibly removed from the White House in such an event is yet to be seen. At that point, it would be up to the military and the Secret Service to remember their vows and decide to take action. \\nThe President Elect \\nBut let’s assume for a moment that none of this happens and the transition of governmental power goes through smoothly, as it has so many times before. What then can we expect? \\nThe first big question that’s in everyone’s mind is whether Trump will live up to his campaign promises or not. The mainstream media has been calling him a liar for months now, even if that required them lying to do so. They’ve painted him with the same brush used on any politician, that of bending the truth to meet their needs and telling the people what they want to hear, just so that they can garner votes. \\nThe real question is whether Trump is just another politician or if he’s who he claims to be; and the kicker is that nobody truly knows. Since the mainstream media has done everything they can to paint him in a negative light, the picture of Trump that we’ve seen is a clouded one, at best. \\nBut Trump has been a public figure for more than just his campaign. For years, he’s been one of America’s most-recognized citizens. While that has not always been good, it has given us some insight into who the man is, what he believes and how he operates. \\nThroughout the campaign, there have been people coming forth who have known Trump through the years. Some were employees who praised him as a boss. Others were ordinary citizens who talked about kind deeds that he did for them. But other than the attempts to paint him as a sexual abuser right before the elections, few have come forth to say anything negative about their dealings with the Trump. \\nConsidering how much of a public figure he has been, I would think that if he was anything like what the mainstream media has tried to paint him to be, we would have all seen it by now. \\nThe one truly worrying thing about Trump is that for most of his life he’s been a Democrat. He’s supported the Democrat Party and Democrat candidates; he’s even reportedly friends with the Clintons. So it’s a bit hard to accept that he is now a staunch conservative, committed to conservative ideals. \\nYet, he’s making all the right noises and all the right moves to show himself as a conservative. The list of Supreme Court Justice candidates that he’s put together is impressively conservative. He also came forth with the most conservative platform that the Republican Party has seen in 20 years. \\nThen there’s his “contract” with the American People. The actions he’s promised to undertake in his first 100 days in office are clearly conservative, hitting on all the high points of his campaign and many of the silent majority’s biggest concerns. \\nThe Transition \\nOver the next several weeks, we will be able to see Trump in action as a leader. His first big job is to select his cabinet, something that is traditionally announced by Thanksgiving. This should be interesting. One of the ways that Trump has been successful in business is in his selection of managers. He has always sought out the most qualified and competent, giving them the authority and responsibility to do whatever was necessary. \\nThis even came through in his hit television show, “The Apprentice.” At its core, that show was about picking the best possible person to run a business. The various tests and challenges the candidates faced were all about testing their ability to effectively run a business. Who cares about theory; Trump wanted people who could think outside the box and get things done. \\nSo we can expect the same out of his cabinet selections. No, I’m not saying that he’s going to run it like a game show. What I’m saying is that he’s going to look for competence. For people who can think outside the box, and for people who can get things done. \\nThe country is in need of such people. We are a country in crisis, and it’s going to take some new ideas and some out of box thinking to straighten it out. We can’t expect Trump to do it all himself, he’s going to have to select the right people and let them do their jobs. So the people he selects in the next few weeks are critical to the effectiveness of his presidency. \\nFrom the few positions that have been announced so far, it looks like Trump is going to be putting together a dream team. Trey Goudy has been mentioned for Attorney General, Ben Carson as the Surgeon General and Newt Gingrich as a possibility for the Secretary of State. \\nWhile none of these is definite yet, they show the caliber of people who Trump is looking at. He wants the best, not just some political figure who’s looking to get their ticket punched. \\nWhile I’m sure that some top spots will go to political figures, especially those who have hopped aboard Trump’s bandwagon, he’s looking more to the business sector, than he is to the normal pool of politicians only. This fits with the whole tone of his campaign, which has been about the American people taking our government back from the political class. \\nThe Election \\nIf anything, this election has shown how sick and tired the average American is with what has become the political ruling class. The Founding Fathers never envisioned such a group for our country and did everything in their power to prevent it. Yet, even with the constraints of the Constitution to guide us, we have drifted that way more and more for over a century. \\nThe American people are a fiercely independent people, and this election has shown that we haven’t lost that independence. This isn’t a partisan move, but one that has been clearly shown in both major political parties. \\nMillions of Democrats abandoned the party’s chosen candidate and followed Bernie Sanders, who came close to winning, even with all the voter fraud that was used to defeat him. On the Republican side, the electorate has abandoned a wide-ranging field of establishment candidates, in favor of Trump, a political outsider. \\nBut the truly amazing thing was that both Democrats and Republicans voted for Trump, many abandoning their lifelong party affiliation to do so. \\nThis is a clear mandate to Washington that We the People are tired of business as normal. We are tired of a political ruling class. We are tired of our elected leaders treating us like nothing more than peasants. We are tired of being lied to, and we are tired of being mistreated by those who are supposed to serve us. \\nThis election has been a breakwater; leaving behind the old system and its corruption, in favor of a new order. \\nOne that returns back to the values this country was founded upon and back to running the country according to the Constitution. Not an adulterated version of the Constitution; not a modified version; not even a version that’s been twisted and tortured by the various laws passed through the years; but the Constitution itself. \\nIt’s up to Trump to ensure that he follows through on his promises and doesn’t let things go back to the old way. But it’s up to you and I as well. We have our part in this presidency; that of keeping an eye on our President Elect and making sure that he does what he said he’d do. If not, we need to get rid of him. \\nHopefully, Washington will get the message, and the political class will stop acting like our masters and start acting like public servants once again. If that doesn’t happen, then the breakwater has been nothing more than a symbol; and a worthless symbol at that. \\nIf change is going to happen in Washington, it can’t just happen in the White House, it has to happen in both houses of Congress as well. But it needs to go farther than that; it needs to permeate every department of the federal government as well. \\nWe the People have spoken. We’ve used our voice in the voting booth, selecting an outsider to take control of our government and give it back to the people. But we can’t stop now. \\nThat message needs to keep going forth, to make sure that the politicians and bureaucrats hear it, and that they fear us and the power we wield over them. Until they do, it is we who fear them. \\n  Bill White for Survivopedia. \\nRefrences:'"}, "time": 1742628330.6541066}