{"duration": 0.12675952911376953, "input_args": {"text": "'Imported gang violence continues to afflict Virginia: authorities charged illegal alien suspects with murder and all ten suspects for gang participation and abduction on Thursday for the “brutal” slaying of    Damaris Reyes Rivas. [Police arrested ten in connection with Rivas’ death: four adults and six teenagers. FOX5 reports “Jose Ivan Castillo Rivas, 18, Springfield, Wilmer A. Sanchez Serrano, 21, Cindy Blanco Hernandez, 18, and Aldair J. Miranda Carcamo, 18” are adults. Another    Venus Iraheta, who has lived in the U. S. for the past ten years —  making her a “DREAMer” eligible for amnesty under an Obama executive order —  is also in police custody. Police did not identify the other five juveniles. All ten face charges of abduction and gang participation. Rivas and Serrano are charged with murder.  Rivas died horribly on or close to January 8 of   trauma in a “savage, brutal killing,” Fairfax County Police Chief Edwin Roessler said. Police reportedly found video evidence of Rivas’ death and declined to name the gang connected to the teenager’s murder. According to Maria Reyes, Rivas’ mother, her daughter had gotten involved with the El Salvadoran gang Mara Salvatrucha or   recently. She told FOX 5 she is receiving violent threats from gang members “blaming her for the arrests” and is afraid for her own life. U. S. Immigration and Customs Enforcement placed detainers on the four adults charged with murder and has asked Fairfax County to alert them before they are released from custody.   of the total population of El Salvador lives in the U. S. “El Salvador is the top country of birth for immigrants to Virginia,” the Associated Press reported in 2014. Nearly a quarter, or 23 percent, of Northern Virginia residents are foreigners, and 68 percent of the state’s   population lives there, researchers found in 2014. In 1970, only one in 100 residents in Virginia was   —  but now, it is one in nine. Roughly 247, 000 illegal aliens live in Virginia, according to one estimate, meaning the state ranks in the top ten states with the largest populations of illegals. Among those are nearly 40, 000 illegals from El Salvador. Another estimate pegged the total number of illegals at 275, 000 in 2012, or 3. 5 percent of the state’s population. Similarly, immigration led to a boom in the Latino or Hispanic population in Old Dominion since the 1990s: “The Latino share of Virginia’s population grew from 2. 6 percent in 1990 to 4. 7 percent in 2000 to 8. 6 percent (or 707, 962 people) in 2013,” according to the American Immigration Council. Without immigration from El Salvador, there would be no   in America and fewer machete murders and dismembered bodies buried in idyllic parks. Since the 1990s,   has operated in the Washington, D. C. area with thousands of members. Obama administration policies encouraged hundreds of thousands of Central American illegal aliens to surge into the U. S. and the administration helped them along by shipping them unannounced to unsuspecting American communities.   leaders stationed in El Salvador had told the U. S.  gangs to rebuild, and the large influx of young illegal aliens made the task easier. The Obama administration shipped illegal alien minors with clear   ties to   strongholds. One Department of Homeland Security official noted an “uptick” in   gang violence in the past two years, according to FOX5: “He said   and    in high schools work to recruit younger kids to help them carry out crimes because they are aware charges are less serious for juveniles. ” El Salvadoran nationals involved in gang violence at home bring their connections and plans for expansion to the United States. Chairman of the Northern Virginia Regional Gang Task Force Douglas W. Keen pointed to “increased recruitment of unaccompanied minors” illegally arriving in the U. S. “When we debrief some of the arrestees they are telling us they were recruited at a young age and encouraged to commit crimes of assaults and larcenies. Then they move to narcotics and more violent crimes,” Keen told the Washington Post. Director of the task force Jay Lanham also told FOX5 that gangs “are recruiting people as young as children in elementary school and they lure them through social media and parties where they offer them drugs, alcohol, and sex. ” Taxpayers, of course, foot the bill for the illegal aliens’ schooling, social services, trials, incarceration, and the specialized task forces required to keep their explosive violence under control.'"}, "time": 1742564613.3819914}