{"duration": 0.21323227882385254, "input_args": {"text": "'  Is Hillary Clinton’s Entourage Involved In A Satanic Pedophile Ring? Is Hillary Clinton’s Entourage Involved In A Satanic Pedophile Ring? Jean-Batave Poqueliche \\nJean-Batave is a martial artist from the viking stronghold of Normandy, France. He travels the world looking for new fighting techniques and new beautiful women. Eastern Europe taught him everything he knows and is his second home. His column runs every Thursday. November 8, 2016 News \\nThe latest batch of the Podesta emails shared by Wikileaks add a darker dimension (if it was even possible) to the sordid culture of corruption, lies and depravity that surrounds Hillary Clinton, explaining why the FBI has been calling her for quite some time now, the “Antichrist personified” . \\nIt is a possibility that Hellary’s clique attends and organizes Satanic rituals, involving mock-up scenes of cannibalism and sexual abuse involving children. \\nOne of the emails directed at Tony Podesta (John Podesta’s brother) contains the following sentence: \\n\\n“I am so looking forward to the Spirit Cooking dinner at my place. \\nDo you think you will be able to let me know if your brother is joining?” \\nThis really does not sounds like much until you discover the author of this invitation. She, who walks in the footsteps of the Beast \\nThis is the woman who sent the email, Marina Abramovic. Dressed in red and holding the skinned head of a dead goat, a clear reference to the occult character Baphomet \\nThere is proof that the Clinton Foundation directly transferred Abramovic ten thousand dollars in at least one instance for her “services.” Abramovic carving a pentagram in the flesh of her stomach with a blade to show her artistic side \\nA self-proclaimed artist, Abramovic hails from Serbia and regularly organizes “performances” and events using what she calls “Spirit Cooking”. \\nThis “spirit cooking” includes mixing semen, breast milk, urine or fresh blood before consuming it or splattering it over various things such as life-sized representations of young children, like shown below: \\nThis performance included spelling with the body fluids, the following stanza: \\nWith a sharp \\nknife cut deeply into the \\nmiddle finger of your \\nleft hand \\neat the pain. \\nOther examples of her “art” (nowadays any revolting expression of bad taste if sporting the correct pair of problem glasses) include public dinners, where politicians, Hollywood stars, singers and decision makers gather to eat cakes that depict a naked human corpse or feast on the fake (I hope by all that is sacred) blood contained in a coffin where swims another human body. Celebrities that use demonic symbols in their persona such as Lady Gaga rush to participate to Abramovic’s events Another heavy user of the occult symbols, Jay-Z, is a big fan of Marina \\nThese codes are all directly copied from rituals such as black masses or Sabat night reunions and popularized by figures such as Aleister Crowley from whom Abramovic draws direct inspiration. \\nIt is part of this growing phenomenon where the elites and celebrities close to power get caught, intentionally or not, showing symbols celebrating the ancient Babylonian rites or the worship of the Devil. On November the 4th, Clinton chose Jay-Z in a last bid to draw crowds to her empty rallies. Coincidence? Innocent children involved in that mess \\nThere is hard evidence that Bill Clinton traveled at least 26 times (sometimes without his bodyguards, it is all in the pilot logs) to billionaire and convicted pedophile Jeffrey Epstein’s Island on board his plane, dubbed the “Lolita Express,” as it is in this plane that the guests could allegedly have sex with minors. \\nWith this in mind, it is disturbing to notice that other Podesta emails refer to children as being the “entertainment” at pool parties almost entirely attended by middle-aged men involved in politics. Other emails involve strange references to food such as “pizza”, “cheese”, $65,000 worth of “hot dogs” for a party that attendees “dream of” and “recipes” that many sources suggest are code words for orgies involving minors and extremely young children. You can read more about it here . The Whole Clinton Bag of Crooks reeks of unnatural sexual behaviour and reproachable acts and we will certainly know much more in the days to come, as Hillary Clinton is still under FBI investigation as we speak. This follows the scandal surrounding Huma Abedin (Clinton’s right hand and confidant) and her estranged husband, sex offender and champion one-handed texter, Anthony Weiner. It will take some time before they go through Weiner’s 650,000 emails and decide of a course of action regarding these dark revelations and other atrocities of the Clinton crime family. La plus belle ruse du diable est de vous persuader qu’il n’existe pas Drawing by Ben Garrison \\nThese heavy accusations of Satanism remind us of the sexual blackmail practices said to take place among the popular hip-hop and Hollywood communities, as Roosh described in his related article , or other rumours linked to suspicious reunions involving the secret ceremonies of the elite such as the ones of the Bohemian Grove or the Rothschilds’ parties of the 70s. \\nIf those recent speculations turn out to be true, it could have the effect of a bomb and mean a revolution. \\nObserve the symbols of cannibalism, eerily similar in the three following pictures. Those are respectively: a scene of the Rothschild’s “surrealistic bal,” a painting hanging in John Podesta’s office and one of Abramovic’s dinners: \\nI will let you be the own judge of the conclusions inspired by those images. My father is a very Cartesian fellow and a saying of his comes to mind: \\nJust like Saint Thomas, \\nI only believe in what I see. \\nAnd what I see unsettles me.'"}, "time": 1742563566.5084503}