{"duration": 0.024681806564331055, "input_args": {"text": "'\\nWith deer hunting season upon us, Arby\\'s has decided to get in on the action. \\nIn select locations across six states, the fast food chain will sell the “Venison Sandwich” for three day stints at each restaurant from Oct. 31 to Nov. 28. \\nChief marketing officer Rob Lynch, who calls venison “incredibly delicious,” explains in an official press release that Arby\\'s is not afraid to take “risks” when it comes to trying new things. Arby’s is celebrating hunting season with a venison sandwich https://t.co/j3fIKvRhTK pic.twitter.com/fKvTCgg4sm — Fortune (@FortuneMagazine) October 26, 2016 \\nHe states: \\n\"We’re a brand that’s not afraid to take risks, and while the venison sandwich is probably the biggest stretch for us yet, it’s incredibly delicious and we can’t wait to get it in the hands of our guests. You won’t leave a hunt empty-handed after stopping by Arby’s.” \\nThe 100% venison sandwiches will be made with “premium cut top and bottom round steaks from the hind quarter of the deer.” Wisconsin, Minnesota, Michigan, Pennsylvania, Tennessee and Georgia are the states that will be serving them up. \\nSo what exactly will this Venison Sandwich taste like? \\nArby\\'s describes it like this: \\n“The Venison Sandwich at Arby’s features a thick-cut venison steak and crispy onions topped with a juniper berry sauce on a toasted specialty roll. The venison is marinated in garlic, salt and pepper and then cooked for three hours to juicy, tender perfection. The juniper berry sauce is a Cabernet steak sauce infused with juniper berries, giving the already unique sandwich another signature twist.” \\nAccording to Arby\\'s, the 17 locations that you can get the sandwich are as follows: \\nAvailable Oct. 31-Nov. 3: \\n2044 Rosa L. Parks Blvd. , Nashville, Tenn. \\nAvailable Nov. 4-6: \\n3821 Tower Ave., Superior, Wis. \\n1690 Park Place Blvd., St. Louis Park, Minn. \\n704 Highway 33 South, Cloquet, Minn. \\n348 Lincoln Ave. SE, St. Cloud, Minn. \\n3275 First St. S, St. Cloud, Minn. \\n4415 Roswell Rd. NE, Atlanta, \\nAvailable Nov. 12-14: \\n4229 W Vienna Rd., Clio, Mich. \\n4040 17 Mile Rd. NE, Cedar Springs, Mich. \\n1215 M 89, Plainwell, Mich. \\n8685 Birch Run Rd., Birch Run, Mich. \\nAvailable Nov. 25-27: \\n5205 Library Road, Bethel Park, Penn.4260 Ohio River Blvd., Bellevue, Penn. \\n16 Towne Center Drive, Leechburg, Penn. \\n2539 W State St., New Castle, Penn. \\n2648 Ellwood Rd., New Castle, Penn. \\n3224 Wilmington Rd., New Castle, Penn. '"}, "time": 1742562366.0948067}