{"duration": 0.029116153717041016, "input_args": {"text": "'CNN, the news organization branded as “fake news” by   Donald Trump, recently posted a job listing for a full time reporter focusing on fake news. [The Hill reports that a job listing was posted to Turner Media’s website seeking a “Senior Writer” for CNN media. The reads, “CNNMoney is expanding its Media team. We’re going to be examining the wave of ‘fake news’ stories and the people behind them, but more than that we’re going to be looking at truth  —   what happened to it, why so many of us no longer believe it, and where those people are going to get their information instead. ”  The ad states that applicants must have at least six years of writing experience and aim for a high level of accuracy within their reporting, and they should, “get angry every time they see any inaccuracy in any story, whether large or small. ” CNN is also apparently looking for someone tech savvy, as ideal applicants should “live on the Internet, and be intimately aware of its darkest corners. ” Applicants will apparently be focusing on: “Investigating fake news, hoaxes and untruths of all kinds” “Debunking myths” and “Confronting the ‘real’ media. ”  Applicant’s should also be “the kind of person who can’t pass by a single rabbit hole without being desperate to jump in to see where it leads,” and they must have “Intimate knowledge of and fascination with the parts of the Internet from which dubious news stories bubble up. ” Despite the level of detail given relating to the expectations CNN will be placing on applicants, no salary is listed on the Turner Media website. Successful applicants will be working under CNN media team leader, Brian Stelter, a senior CNN media correspondent and the host of “Reliable Sources. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742563418.024744}