{"duration": 0.06432867050170898, "input_args": {"text": "'We Are Change \\nA Virginia principal has outraged humorless parents after he and his secretary dressed up like Donald Trump and Hillary Clinton — with the former First Lady in an orange prison jumpsuit.\\nThe well-executed costumes were worn by Robert E. Lee High School’s Principal Mark Rowicki — who dressed as Trump, and the school’s secretary Stephanie Corbett — who dressed as Clinton. A photo of the duo was posted to the school’s website in a playful album of costumes worn by students and staff.\\nPrincipal Mark Rowicki and secretary Stephanie Corbet\\nPolitical figures have long been fodder for satirical Halloween costumes, and Clinton masks with the orange jumpsuits were an extremely popular choice this year — as the holiday falls just before the election. On the other side of the political aisle, many people dressed as cats with “don’t grab my p*ssy” signs, “bad hombres,” or “nasty women.”\\nAfter the photos were posted, a parent reportedly complained about the “politically charged costumes” on Facebook, leading to the photos being removed from the website.\\n“I don’t care who you are or are not voting for. You are professionals, who work with children. Some more impressionable then others. The fact that any school official would think it’s okay to dress like this leaves me appalled and floored,” Emberly Lynn Martin, who has two daughters, wrote on a Facebook post, WTVR reports. “What message are you sending to any of them when their high school principal dresses up like a man who wants to deport them, says things like “she’s a nasty woman”, or “grab em by the p—–?”\\nJudging by the last portion of her comment, it isn’t the fact that the school administration dressed up in politically relevant costumes, but rather the fact that they appear to support a candidate that she doesn’t.\\nOutrage over Halloween was once associated with the religious right — but these days, complaints about the holiday from liberals are as predictable as trick or treaters. Nearly every costume can be deemed offensive by someone, and colleges have even offered counseling for students upset over what peers are wearing for this year’s celebrations.\\nThough its arguable about whether or not it was necessary, Principal Rowicki has apologized to anyone he may have offended.\\n“It is a longstanding tradition of Staunton City Schools—and of many school divisions across the United States—to allow students and staff to engage in festive activities and dress in costume for Halloween,” Dr. Linda Reviea, Superintendent of Staunton City Schools said in a statement on the school’s website . “That said, the particular costumes worn by two employees at R.E. Lee High School were in poor judgment, given the current political climate and the extraordinarily strong sentiments for the 2016 presidential candidates. I became aware of the situation on Tuesday night and instructed our staff to remove the images in question from Lee High School’s website today (Nov. 2). We are handling the situation as a personnel matter and addressing the issue with relevant staff.”\\nIt is unclear if Rowicki or Corbett were disciplined over the harmless costumes.\\nThe post School Principal Dresses Up as Trump For Halloween, Triggers Parents appeared first on We Are Change .\\n'"}, "time": 1742562294.2052996}