{"duration": 0.11972808837890625, "input_args": {"text": "'You may have heard the theory that Silicon Valley has been instrumental in the rise of Donald J. Trump. The idea goes like this: Unlike many of his political rivals, Mr. Trump seems to understand that social media has become the nervous system of the American news business. On Twitter, where he regularly regales his millions of followers with   bursts of id, Mr. Trump’s posts are mainlined and amplified by the rest of the media with one or two tweets, he can dominate cable TV, the web, newspapers and talk radio for an entire day. The pattern was on display again this week, when Mr. Trump blasted The New York Times over a critical story about his treatment of women. This theory is not exactly bunk. It’s true that Mr. Trump’s Twitter feed, with its staccato cadences and unending exclamation marks, can be irresistible even to his critics. He is among a handful of politicians who use Twitter as real people do  —   casually, bitingly and free of the jargon that clogs up most other pols’ tweets. Mr. Trump has also cultivated a Twitter fan base that can be domineering in its attempts to harangue and silence critics, another force multiplier in the    war for media dominance. But don’t bet that Mr. Trump’s mastery over social media will help him in November. He has used Twitter as a tool to foment culturewide rage  —   it’s his big, inescapable bullhorn. Yet winning a presidential campaign involves more than simply whipping up unfocused outrage. It also requires more discrete, personalized messaging targeted to specific sets of voters and potential volunteers, a goal for which Twitter is spectacularly ill suited. The point of a modern American presidential campaign is to inspire and turn out as many of your voters as possible while avoiding inspiring similar passion for your opponent. In 2008 and 2012, Barack Obama’s campaign pioneered some of the most effective ways to use social media and   organizing to win political campaigns. The Obama operation turned unfocused online passion into a          operation whose effectiveness surprised longtime political observers. Mr. Trump has eschewed many of the Obama team’s     efforts. In contrast, Hillary Clinton’s campaign has doubled down on the   approach. Veterans of the Obama campaign say this could be Mr. Trump’s costliest mistake in the election. If the Internet has been Mr. Trump’s secret weapon so far, it may soon turn into his Achilles’ heel. “The biggest mistake he can make is thinking that the general is going to be like the primary,” said David Plouffe, who managed Mr. Obama’s first presidential campaign and is now an executive at Uber. Mr. Trump will need to attract voters who previously voted for Mr. Obama and those who don’t usually vote at all. Compared to voters in the Republican primary, these general election voters hold more moderate views, and may be less plugged in to  —   and perhaps even repulsed by  —   the   hurricane of news that Mr. Trump has so far succeeded in creating. Yet Twitter, by its very nature, won’t let Mr. Trump pivot to some gentler version of himself. With its character limit and an interface that’s inscrutable to nonusers, Twitter tends to penalize nuance and moderation, while rewarding hot takes and bombast. Just about every discussion on the platform turns into a preening flame war, and just about any attempt to dive into substance is mocked by the platform’s cool kids. In other words, Twitter is like a partisan primary election. From Mr. Trump’s slogan to many of his policy ideas  —   build a wall, ban Muslims  —   his message has been perfectly tailored to the medium. But now, if he tries to expand his message beyond   issues for the right, Mr. Trump may feel caged in by a platform that takes a dim view of  . We’re already seeing signs of this dynamic playing out. Consider  Mr. Trump’s Twitter post to celebrate Cinco de Mayo  —   a picture of himself eating a taco bowl made at Trump Tower with a caption proclaiming, “I love Hispanics!” That tweet ricocheted across the media  —   it’s his   post in months  —   but not for the reasons Mr. Trump might have intended. Rather than being greeted as an honest attempt to reach out to a voting group that overwhelmingly dislikes him, the taco bowl post was widely mocked as an obvious,   pander. The failure makes sense: If there’s a chance that Mr. Trump’s views about Latinos are indeed more inclusive than we’ve been led to believe, Twitter is the worst place for him to explain the complexities of his ideas. Twitter doesn’t allow for complexity to express a move toward inclusiveness on Twitter, “I love [insert demographic group]!” may be the best you can do. This gets to the larger problem with Mr. Trump’s reliance on social media. Twitter is effectively a mass medium in an election that may be decided by a far more personalized approach. “For example, Hillary Clinton’s campaign will know every voter in Hamilton County, Ohio, who is certain to vote for her, and every voter who might vote for her but hasn’t decided yet,” Mr. Plouffe said. The campaign has collected and analyzed reams of data about those voters from public records, online interactions and   events. It can turn all that data into   action. “We found out that the more you know about who voters actually are, the better you can figure out the right person to talk to them to persuade them to go to the polls,” Mr. Plouffe said. Mr. Obama won the 2012 election by 4 percentage points nationally. Mr. Plouffe estimated that without the       effort, the race would have ended in an effective tie, and Mr. Obama would have lost a few huge states, including Florida. Mr. Trump’s campaign did not respond to a request to discuss how the candidate will use the Internet in his general election campaign. But in a recent interview with The Associated Press, Mr. Trump dismissed the Obama   approach. “I’ve always felt it was overrated,” Mr. Trump told The A. P. “Obama got the votes much more so than his   machine. And I think the same is true with me. ” He said he would stick to the strategy that has worked for him so far, including holding more of his trademark crowded rallies. Buzz Jacobs, a Republican political consultant who worked on John McCain’s campaign in 2008 and on Marco Rubio’s run this year, said Mr. Trump would benefit from the Republican Party’s     effort. But he was puzzled by Mr. Trump’s comments on the Obama field operation. “If it’s true that the campaign is going to disregard data wholesale, that would be alarming, and would leave them way behind the Clinton campaign, then we’ll lose,” Mr. Jacobs said. Sasha Issenberg, a journalist who chronicled the rise of   electioneering in his book “The Victory Lab: The Secret Science of Winning Campaigns,” argued Mr. Trump’s approach could easily backfire. The key danger in Mr. Trump’s style of campaigning, Mr. Issenberg said, was the risk of inflaming his opponents as he pushes his own message. “Trump is very much a creature of mass media, and his use of Twitter fits that paradigm,” Mr. Issenberg said. “He’s put together as large an audience as possible. He doesn’t distinguish whether these are people who vote or don’t vote, whether they’re in the U. S. whether they’re over 18, and whether they support him or Hillary Clinton. His goal seems to be to produce content there that lands in front of as large an audience as possible. ” But throwing out content haphazardly is the last thing a campaign should do. “It’s immensely counterproductive for him to put out a     message in front of a Hillary Clinton supporter,” Mr. Issenberg said. Yet every day from now until Election Day, there’s a chance that Mr. Trump will do just that. Last week, he got into a flame war with Elizabeth Warren, the Massachusetts senator and lefty heroine, who was clearly trying to bait him into a fight that would energize the Democratic base. A more sober candidate might have resisted. But not a denizen of Twitter, where restraint is tantamount to defeat. Better than anyone else, Mr. Trump knows that on Twitter, you’ve got to always amp it up  —   even if it means turning everyone off.'"}, "time": 1742563887.0651171}