{"duration": 0.049913644790649414, "input_args": {"text": "'161402 SHARES \\nWhile the U.S. Department of Justice temporarily halted construction of a section of the Dakota Access Pipeline, two other pipelines are moving forward. \\nIn May, the Obama administration granted the permits for both the Trans-Pecos and Comanche Trail pipelines, and while construction has not yet begun on the pipelines, implementation plans for the building of the pipelines is well underway. \\nEarlier this week, DeSmogBlog investigative reporter Steve Horn highlighted the approval and pending construction of both pipelines, as well as their significant impact on local water supplies and indigenous territory. As Horn wrote, the Trans-Pecos pipeline will carry natural gas extracted from the Permian Basin in West Texas, and transport it across international borders to Mexico. \\nAccording to the Texas Tribune, the 42-inch-wide Trans-Pecos Pipeline will carry 1.6 billion cubic feet of gas every day under the Rio Grande River. Should a leak or spill occur, the effects could be felt in both Texas and Mexico. The Comanche Trail pipeline, which is also 42-inches, will carry gas from the Waha Hub in the Northern part of Pecos County, Texas, to San Elizario, Texas, where it will then be carried across the United States/Mexico border . \\n“[The] Trans-Pecos and Comanche go through the Big Bend area, a rural area containing mountains, desert, and ranch land. Most importantly, they link to a massive set of pipelines in Mexico that are in the process of being built and it’s a bit difficult to say what the impacts of land/spills would be there,” Horn told US Uncut. “What sorts of environmental/ecological reviews are being done in Mexico? What are the potential risks of spills there and would we even hear about them if they took place?” \\nHowever, Horn says the “elephant in the room” on assessing environmental impact is the fracking being done to take natural gas out of Texas’ Permian Basin. \\n“With temperature records being broken left and right, that’s what the conversation should really center around,” Horn said. \\nAccording to the latest status report filed with the Federal Energy Regulatory Commission (FERC) earlier this month by pipeline builder Energy Transfer Partners (the company also building the Dakota Access Pipeline), construction has not yet begun. However, because the pipeline has already been granted approval by both the United States and Mexican governments, Horn says the only recourse left for activists is civil disobedience. \\n“Dakota Access, and everything that preceded the now-ongoing civil disobedience and largest convening of Native American tribes in modern history, shows the regulatory system is designed as a corporate rubber-stamp process,” Horn said. “The courts are happy to ratify rulings based on laws written by and for Corporate America.” \\nHorn credited the Native American tribes chaining their bodies to pipeline construction equipment in North Dakota with the Obama administration’s recent call to temporarily halt Dakota Access Pipeline construction near the Missouri River. \\n“[Civil disobedience] might be the only option left given how much the deck is stacked in favor powerful big business interests in the US regulatory and legislative system.” \\n\\nTom Cahill is a writer for US Uncut based in the Pacific Northwest. He specializes in coverage of political, economic, and environmental news. You can contact him via email at [email protected]'"}, "time": 1742628370.2080414}