{"duration": 0.12360334396362305, "input_args": {"text": "'Your News Wire \\nSouth Koreans are rising up in their millions and demanding the overthrow of their government after a series of leaks proved president Park Geun-hye is a puppet controlled by a covert shadow government. \\nIn a furor eerily similar to that surrounding Hillary Clinton’s use of an email server and charity slush fund, critics are charging that Park has irresponsibly managed classified information and benefited from corrupt practices using non-profits as a front. \\nThe South Korean and U.S. comparisons stop there however. Rather than apathetically accepting the situation – like in America – South Koreans have risen up and the media has rounded on their leader. Citizens have taken to the streets en masse and the country’s media have called for the president to step down immediately – or face impeachment. \\nThe essence of the scandal is this: It has emerged that Park, famously aloof even to top officials and aides, has been taking instructions from a group known as the “eight fairies” including Choi Soon-sil, a shadowy billionaire with ties to George Soros and Angela Merkel. Choi has existed around the edges of South Korean power circles for decades, but has never held an official position. Posters of the president being controlled by puppet strings are cropping up all over South Korea as country-wide protests continue to rage. Recommended (4 months ago) France: Protestors Rise Up In Their Millions Against Ruling Class \\nThe Washington Post reports that “Calls for her resignation — and even impeachment — are resonating from across the political spectrum, and her approval ratings have dropped to a record low of 17 percent, according to two polls released Friday. \\nOn Friday, Park directed all of her top advisers to resign en masse, with her spokesman saying a reshuffle would take place, the Yonhap news agency reported. Kim Jae-won, senior presidential secretary for political affairs, told a parliamentary session that Park’s chief of staff had already stepped down. \\nIt’s not clear, however, whether it will be enough. \\n“Park Geun-hye’s leadership is on the brink of collapse,” said Yoo Chang-sun, a left-leaning political analyst. Shin Yool, a right-leaning professor at Myongji University, called it the “biggest crisis” since South Korea was founded 70 years ago. “The president has lost her ability to function as leader.” \\nChoi is the daughter of the late Choi Tae-min, who was a kind of shaman-fortune teller described in a 2007 cable from the U.S. Embassy in Seoul as “a charismatic pastor.” Locally, he’s seen as a “Korean Rasputin” who once held sway over Park after her mother was assassinated in 1974. \\n“Rumors are rife that the late pastor had complete control over Park’s body and soul during her formative years and that his children accumulated enormous wealth as a result,” read the cable, released by WikiLeaks. \\nPark has strongly denied any improper relationship. \\nBut South Korean media have uncovered evidence that, they claim, shows that Choi Soon-sil wielded undue influence over the president. \\nJTBC, a television network, said it had found a tablet computer that contained files of speeches the president had yet to give, among other documents. The younger Choi is said to have edited the landmark speech that Park gave in Germany in 2014, laying out her vision for unification with the North. The Hankyoreh newspaper wrote that actual presidential aides “were just mice to Choi’s cat.” \\nShe is also rumored to have created a secret group called “the eight fairies” to advise the president behind the scenes. \\nTV Chosun, the channel belonging to the Chosun Ilbo newspaper, aired a clip showing Choi overseeing the making of an outfit for Park, “raising doubt whether Park made any decision at all without Choi,” the paper said. \\nSouth Korean media have been full of Photoshopped graphics to illustrate the relationship, including one showing Park as a puppet and Choi Soon-sil pulling her strings. \\nMeanwhile, investigators are looking into allegations that Choi siphoned off money from two recently established foundations that collected about $70 million from the Federation of Korean Industries, the big business lobby with members including Samsung and Hyundai. Prosecutors raided Choi’s home in Seoul this week looking for evidence. \\nAt the same time, there are allegations that the daughter of Choi Soon-sil was given special treatment when she applied for Ewha Womans University, one of South Korea’s top colleges. \\nLocal media have reported that her daughter’s grades were not good enough, so the rules were changed to give credit to applicants who had won equestrian awards, as she had. The already-embattled president of Ewha resigned this week. \\nIronically, this all comes less than a month after Park’s administration instituted a wide-ranging new law aimed at cracking down on corruption and influence peddling. \\nChoi is in Germany with her daughter and is refusing to return to South Korea to answer questions, saying she is having heart problems and cannot fly. But in an interview with the Segye Ilbo, she denied creating the Eight Fairies group, owning the tablet or knowingly receiving classified information. “Because I was not a government official, I had no idea that this was confidential,” she told the paper. \\nPark apologized Tuesday for the scandal, saying she had always acted “with a pure heart.” Then she canceled a planned meeting related to North Korea on Friday so she could consider ways to “resolve the nation’s anxiety and stably run the government,” according to a spokesman. \\nShe did, however, attend a ceremony in the southern city of Busan, where university students shouted “Park Geun-hye should step down!” and “Choi Soon-sil must be arrested!” Share:'"}, "time": 1742562064.683716}