{"duration": 0.09511494636535645, "input_args": {"text": "'Paul Greengrass couldn’t have been clearer. He was done with Jason Bourne. And that meant his loyal star, Matt Damon, wouldn’t be returning as the covert operative for the C. I. A. who unraveled agency conspiracies while he recovered his memory. As late as 2013, Mr. Greengrass, the director of “The Bourne Supremacy” and “The Bourne Ultimatum,” insisted he had no desire to return to the Universal Pictures franchise inspired by the Robert Ludlum novels. “I certainly didn’t expect to ever come back and make another one,” Mr. Greengrass said in an interview last month. Yet on July 29, Jason Bourne will return to theaters after a   sabbatical, played by Mr. Damon in a movie directed by Mr. Greengrass. The road to yes involved a fragmented political landscape, an insistent fan base and gently prodding studio executives. But the simply titled “Jason Bourne” emerges in a moviegoing environment very different from the one the superspy found himself in in 2007. For franchise films, 2016 has been an annus horribilis. “The Huntsman: Winter’s War,” “Neighbors 2: Sorority Rising,” “The Divergent Series: Allegiant” and “Alice Through the Looking Glass,” just to name a few, landed with a thud at the box office. The results were even worse for sequels with significant time lags since the previous film, like “Zoolander 2” and “My Big Fat Greek Wedding 2. ” The creative team and studio behind “Jason Bourne” hope their film performs more like this year’s few outliers, “Captain America: Civil War” and “Finding Dory. ” But they all recognize that the calculus behind successful sequels is tricky. “It’s this weird thing where you can’t give them exactly the same thing, or they’ll be resentful,” Mr. Damon said. “But you have to give them enough of something they recognize that they feel like they’re getting what they paid for. ” Given the Bourne franchise’s rocky beginnings, its ultimate success came as a bit of a shock  —   even to its star. “The first movie looked like a turkey within the business,” Mr. Damon said of “The Bourne Identity. ” That film was delayed and over budget. But something odd happened in the summer of 2002. The movie’s mix of visceral, kinetic action and contemporary political concerns felt fresh to audiences. Jason Bourne was a new kind of action hero. He didn’t punctuate his pummeling of foes with   quips. And he wasn’t kitted out with the latest technological marvels or a   Aston Martin he made do with found objects or whatever car he could steal. Though “The Bourne Identity” performed only decently on its opening weekend  —   “ ” nearly tripled its   take  —   word of mouth buoyed the movie, and it ended up making more than $120 million domestically. The studio quickly set out to make more. Mr. Greengrass, coming off “Bloody Sunday,” his dramatization of a massacre by British troops of Irish protesters in 1972, was recruited for the 2004 “Bourne Supremacy. ” Critical acclaim joined   success for “Supremacy” and, in 2007, “The Bourne Ultimatum,” which won Oscars for film editing, sound mixing and sound editing. But Mr. Greengrass was burned out on Bourne. The films were not only grueling to make, but the original trilogy also felt of a piece, one unfolding story when watched in succession. At the end of “Ultimatum,” Jason Bourne remembered everything about his past as a highly trained government assassin and swam off in the East River, having dispatched the corrupt agency officials who had tried to have him killed. A new film would require a new motivating set of circumstances. The studio gave Mr. Greengrass time, and he gave it a shot. But when it became clear that he couldn’t find an idea that excited him, Universal Pictures  —   facing a contractual deadline with the Robert Ludlum estate to produce another film  —   went to Plan B. Not keen on recasting the role, the studio then released an offering from the screenwriter of the first three films, Tony Gilroy, who conjured up another black ops agent, Aaron Cross (played by Jeremy Renner) for “The Bourne Legacy. ” But Donna Langley, the chairwoman of Universal Pictures, never gave up hope. After all, franchise sequels are the lifeblood of today’s movie business. “We were always playing the long game with the Bourne franchise,” said Ms. Langley, respecting the pair’s decision but believing that a compelling idea might take hold. “Even though Matt and Paul had been very definitive about not wanting to come back, we weren’t really willing to submit to that,” she added with a laugh. In late 2013, Ms. Langley invited Mr. Damon to lunch with her new boss, Jeff Shell, a longtime television executive whom Comcast had just put in charge of Universal’s filmed entertainment business. The   had but one purpose: to gently nudge a Bourne movie starring Matt Damon back on track. Mr. Damon was amenable to at least considering a return. Year after year of people coming up to him on the street, in the coffee shop, at the airport, urging him to make another Bourne film, had had its intended effect. And stumbling upon the production offices of “Legacy” while he was in Vancouver filming “Elysium” a few years earlier may have contributed as well. “I thought I was completely at peace with the three movies, and I was so happy with how good they were and what the whole franchise had done for my career and my life,” Mr. Damon said. “But when I saw their production offices, it hurt me in a way that surprised me. ” Not long after his meal with the Universal executives, Mr. Damon dined with Mr. Greengrass in Los Angeles. “At a certain point, I said to Paul, ‘People really want to see this movie, and that’s not something to turn our noses up at,’” Mr. Damon said. “Having made movies that didn’t find an audience, I didn’t want to thumb our nose at this opportunity. ” That resonated with Mr. Greengrass. The ideas began whirring with his longtime creative partner Christopher Rouse, who had edited “Supremacy” and “Ultimatum. ” And a few weeks later, on a long drive back to his London home, Mr. Greengrass realized: This could actually be fun. Mr. Greengrass, a former journalist, tends to situate his films in recent,   events, whether in Iraq after the 2003 American invasion (“The Green Zone”) or on a cargo ship hijacked by Somali pirates (“Captain Phillips”). And the economic and political aftershocks of the 2008 financial crash that he and Mr. Rouse had been exploring for other projects  —   institutions desperately trying to hold onto power amid a wave of angry populist movements  —   could find fertile ground in a new “Bourne” entry. One of the early action set pieces in “Jason Bourne” unspools during an austerity riot in Athens. “At heart, Bourne is a patriot who’s been betrayed by the institutions he believed in,” Mr. Rouse said. “Those are very identifiable feelings for people today. ” Social media had barely begun when “The Bourne Ultimatum” was released: Facebook was three years old, Twitter just one. Now, it’s a dominant feature of our lives, and Mr. Greengrass wanted to incorporate the     debate the rise of these companies has exacerbated. “The classic Bourne universe is one where you look at the C. I. A. with great skepticism,” Mr. Greengrass said. “But I wanted to cast that skeptical eye, Bourne’s skeptical eye, a bit broader. Because the truth is there are other barons in the world now. ” The need for a different world to confront Jason Bourne may be addressed. But a significant slice of the younger moviegoing public may have no clue about the character. And in a summer where more sequels have been rejected than embraced, the audience may view another Bourne movie as just the latest cynical studio project. Mr. Greengrass had that concern in mind when he mapped out Jason Bourne’s first appearance in the film, engaging in a     fight on the   border. “It’s important because it tells you that Bourne is potent, and a physical force to be reckoned with still,” Mr. Greengrass said. (Mr. Damon said he had to get in the best shape of his career, which, he added ruefully, was harder to do at 45 than at 29.) “But more importantly, it’s proof of our intent, that this is real for us. ” Every movie franchise comes with its own set of audience expectations, and the filmmakers sought to both provide what Mr. Greengrass calls “the new and the true. ” Younger characters are introduced. The      fight scenes are there but amped up. And Mr. Damon’s Bourne once again finds himself in a possibly deadly car chase, but this time there’s a SWAT truck involved. Asked if the   absence from theaters worries him or the fans beseeching him for an encore were outliers, Mr. Damon began to laugh. “It’s too late now  —   scared money never wins, and I would never have wanted to make the movie worrying about stuff like that,” he said. “We still approached it the same way we approached them all: We made the very best movie we could. ” Ms. Langley at Universal doesn’t betray any doubts about the new movie’s prospects. There are no current plans for a sequel to “The Bourne Legacy” with Mr. Renner, nor are there designs (as had once been considered) to spin off other characters in other clandestine government operations, she said. “Look, here’s what I think the goal is: to keep Matt Damon and Paul Greengrass doing Bourne movies till they can’t do them anymore,” she said. Lassoing the two men again will require more of Ms. Langley’s   skills. Mr. Damon said that the franchise would need to go off in another direction and that Mr. Greengrass must be involved. Asked if he’d return for another Bourne film, Mr. Greengrass began cackling. “Last time I made the mistake of saying never again, which proved not to be true,” he said. “So I’m not going to say that. ” While he’s been noodling with a new adaptation of “1984,” Mr. Greengrass has not committed to his next project. But he insisted that another Bourne movie would definitely not be it. “I hope the franchise lives on, because I’ve got immense affection for it,” Mr. Greengrass said, but whether he’ll be part of it is an open question. “I’m not even going to think about it for some years. ”'"}, "time": 1742628493.373221}