{"duration": 1.8052864074707031, "input_args": {"text": "'  Edmondo Burr in Middle East , News , World // 0 Comments For the first time ever China and U.S. ally Saudi Arabia have held joint military drills. \\nIn an effort to expand security ties and combat international terrorism, China and Saudi Arabia have held their first joint military drills, Chinese state media reported Thursday. \\nAnti Media reports: \\n“ Special forces from China and Saudi Arabia have held their first joint anti-terrorism drills, state media reported on Thursday, ” Reuters writes , in what amounts to “ China’s latest effort to expand security ties with countries in the Middle East and its Muslim neighbors. ” \\nWhile this may be the first time special forces from the two countries have worked together to fight terrorism, it isn’t the first time such elite troops have coordinated. In fact, it isn’t even the first time this month. \\nFrom an October 14 report by Arab News : \\n“ Saudi and Chinese armed forces began the ‘Exploration 2016’ joint military exercise on Wednesday. \\n“Special Forces of the Royal Saudi Land Forces and their counterparts in the Red Army were involved in the war games in the Chinese city of Chengdu. ” \\nIn a speech given during the drill’s launching ceremony, Lieutenant Colonel Walid Ettalhi “ stressed that the two countries’ relationship is based on ties of brotherhood, friendship and the great history, ” according to Arab News . \\n“ The exercises aim to exchange experiences between the two sides in specialized areas. This comes within the framework of military cooperation between the two countries, and is an extension of the strong relationship between the Kingdom and the People’s Republic of China, ” the Lt. Col. said. \\nOctober’s joint military drills come after China and Saudi Arabia inked 17 cooperative agreements at the tail end of August. According to China’s Xinhua news agency, deals covered a wide range of areas, including “ politics, energy, finance, investment, housing, water resources, quality inspection, science, technology and culture. ” \\nThe news of China buddying up with Saudi Arabia in such ways may be jarring to some, as it doesn’t conform to the mainstream narrative of Saudi Arabia as an unwavering U.S. outpost in the Middle East — one that could never work with the likes of China, the principle ally of the big bad Russians. \\nBut then, neither does the idea that the Russians would be willing to work with U.S. ally Saudi Arabia. And yet, it appears this is precisely what’s about to happen. \\nOn Sunday, it was reported that Saudi Arabia is now ready to cooperate with Russia in an effort to stabilize global oil prices. Russia, it seems, is receptive to the idea, with its energy minister viewing the invitation as a “ clear indication of a sincere desire to continue cooperation and coordination with the oil producing and exporting countries for more stability in the market. ” \\nEarlier this week, Anti-Media put forth the idea that the Russian fleet now steaming toward the Mediterranean Sea may have designs far beyond the fighting in Syria. It may, in fact, be Russian President Vladimir Putin’s first military step toward securing the long-desired Turkish Stream pipeline. \\nThat report was followed up by an article on Underground Reporter that explored the notion further. Citing recent deals with India, Pakistan, and Vietnam — not to mention those with formerly staunch U.S. allies such as Turkey, Egypt and the Philippines — that piece concluded that Putin, in coordination with China, may be making a play for the coastline of the entire northern Indian Ocean. \\nWhether or not this is true, certain things are becoming clear. Most apparent, though, is that the mainstream narratives are breaking down. If this weren’t the case, Saudi Arabia wouldn’t be extending an olive branch to Russia — and Chinese special forces wouldn’t now training with those of the Saudis in an atmosphere of “ brotherhood, friendship and the great history. ”'"}, "time": 1742563256.3942378}