{"duration": 0.09090375900268555, "input_args": {"text": "'Cop Fired After Shooting Own 11-year-old Daughter at a Halloween Party Home / BREAKING NEWS / Breaking: Podesta Told Mills ‘Dump All Those Emails’ on Day News of Clinton’s Private Email Server Broke Breaking: Podesta Told Mills ‘Dump All Those Emails’ on Day News of Clinton’s Private Email Server Broke Jay Syrmopoulos November 1, 2016 1 Comment \\nWashington, D.C. – In what could prove to be the proverbial nail in the coffin of Hillary Clinton’s presidential ambitions, an email released by WikiLeaks this morning – the 25th batch of emails from Clinton campaign chair John Podesta – reveals potential criminal intent to violate a court order for subpoenaed documents. \\nJohn Podesta sent the message only hours after the New York Times reported that Clinton might have violated federal records requirements by using the server, according to the latest batch of Podesta emails released by WikiLeaks. \\nThe email in question , sent by Podesta on March 2, 2015, reveals the Clinton campaign chair directing Cheryl Mills, Hillary’s attorney and Chief of Staff, to destroy emails that had already been subpoenaed. \\nThe email exchange between Podesta and Mills came suspiciously on the same day that news broke regarding Clinton’s use of a private email server. \\nAfter news of Clinton’s private email server became public, Podesta wrote to Mills: “Not to sound like Lanny, but we are going to have to dump all those emails so better to do so sooner than later,” Podesta told Mills. Mills responded: “Think you just got your new nick name.” \\nIt doesn’t take a rocket scientist to figure out exactly what Podesta meant by “dump” the emails, when taking into account the fact that this was transpiring just as news of the private server was breaking. What this email does is provide insight into the coverup process — and exposes a willful intent to break the law. Additionally, it reveals exactly how swiftly the Clinton camp moved to obscure the truth from both investigators and the public alike. \\nAccording to a report by the New York Post : \\nIn December 2014, Hillary Clinton — now the Democratic presidential nominee — turned over about 55,000 pages of work-related email to the State Department, but that fact wasn’t revealed until the Times reported on her use of the private server. \\nOn March 10, 2015 — a week after the Podesta-Mills exchange — Clinton addressed the email scandal, and announced she had deleted about 30,000 personal emails. \\nThe email’s reference to “Lanny” is likely in reference to lawyer Lanny Davis, who served as special counsel to then-President Bill Clinton, as well as spokesperson for the President and the White House on matters regarding campaign-finance investigations and other legal issues. \\nInterestingly, Zero Hedge reports that a search for Lanny Davis reveals a suspicious exchange between Clinton campaign manager Robby Mook and Podesta from March 8, 2015, just days after the above mentioned exchange in which Mook tells Podesta: \\n“We gotta zap Lanny out of our universe. Can’t believe he committed her to a private review of her hard drive on TV.” \\nHillary’s team was apparently upset that Bill Clinton’s special counsel was engaging in a transparent course of action, and moved to “zap Lanny out of our universe.” \\nWhile it isn’t clearly spelled out exactly which emails Podesta is referring to in his email, the fact that he wrote “better do so sooner than later,” on the day news broke publicly regarding Clinton’s email server, strongly indicates that the actions were a responsive measure meant to obscure any investigation into the matter. \\nClinton’s entire narrative regarding her private email server has seemingly unraveled, and her methodical plan to strategically impede the State Department/FBI investigation, by deleting the evidence, is now on full display for the public to see. \\nHopefully WikiLeaks’ next upcoming Podesta email dumps can provide even further context to this already damning email. Of course, Hillary’s spin doctors are hard at work thinking up a new narrative to work around this latest revelation regarding the willful attempt by Clinton’s team to usurp a federal investigation. \\nMainstream media is trying to censor this information, so please share this story to overcome corporate censorship and to expose the truth! Share Google + T. Mohr \\nThank God! The whole lot of them will go down together. Liers the lot of them, proven today.  '"}, "time": 1742563947.3075826}