{"duration": 0.05684065818786621, "input_args": {"text": "'THE ENTIRE CLINTON FAMILY COULD GO TO JAIL: HUGE SECRET REVEALED ABOUT THE CLINTON FOUNDATION \\n“Basically what IRS just revealed is that Clinton Foundation is one huge Ponzi Scheme!!! \\nThis is insane! Practically not just Hillary, but whole Clinton family is going to jail! \\nJust 5.7 percent of the Clinton Foundation’s massive 2014 budget actually went to charitable grants, according to the tax-exempt organization’s IRS filings. The rest went to salaries and employee benefits, fundraising and “other expenses.” The Clinton Foundation spent a hair under $91.3 million in 2014, the organization’s IRS filings show. But less than $5.2 million of that went to charitable grants. \\nThat number pales in comparison to the $34.8 million the foundation spent on salaries, compensation and employee benefits. Another $50.4 million was marked as “other expenses,” while the remaining almost $851K was marked as “professional fundraising expenses.” \\nDespite taking in an additional $30 million in 2014, the Clinton Foundation spent 40 percent less on charitable grants in 2014 than in 2013. Even as it slashed charitable spending, the foundation increased the amount spent on salaries, employee benefits and compensation by $5 million in 2014. The foundation also spent $5 million more “other expenses” in 2014. \\nSean Davis at The Federalist notes, “the bulk of the charitable work lauded by the Clinton Foundation’s boosters — the distribution of drugs to impoverished people in developing countries — is no longer even performed by the Clinton Foundation. Those activities were spun off in 2010 and are now managed by the Clinton Health Access Initiative, a completely separate non-profit organization.” (RELATED: Clinton Foundation Deceived IRS On Tax Exemption From The Start) \\nAs first reported by The Daily Caller, the IRS launched an investigation into the Clinton Foundation this past July after 64 House Republicans called the foundation a “lawless ‘pay-to-play’ enterprise that has been operating under a cloak of philanthropy for years and should be investigated” in a letter to the IRS, FBI and Federal Trade Commission (FTC). \\nThese Clintons are nastier than El Chapo Guzman family members! \\nBut El Chapo never portrait himself as some huge persona, Clintons are with a mask of Mother Theresa but with heart and soul of a Russian mobster! \\nIf you agree, please share and comment below. \\n'"}, "time": 1742562682.0176318}