{"duration": 0.21102070808410645, "input_args": {"text": "'Posted on November 2, 2016 by WashingtonsBlog \\nBy Robert Parry, the investigative reporter who many of the Iran-Contra stories for The Associated Press and Newsweek in the 1980s. Originally published at Parry’s Consortium News (republished with permission). \\nIf Ukraine becomes a flashpoint for World War III with Russia, the American people might rue the day that their government pressed for the 2014 overthrow of Ukraine’s allegedly corrupt (though elected) president in favor of a coup regime led by Ukrainian lawmakers who now report amassing, on average, more than $1 million each, much of it as cash. \\nThe New York Times, which served as virtually a press agent for the coup in February 2014, took note of this apparent corruption among the U.S.-favored post-coup officials, albeit deep inside a story that itself was deep inside the newspaper (page A8). The lead angle was a bemused observation that Ukraine’s officialdom lacked faith in the country’s own banks (thus explaining why so much cash). Ukraine’s anti-Russian President Petro Poroshenko speaking to the Atlantic Council in 2014. (Photo credit: Atlantic Council) \\nYet, Ukraine is a country beset by widespread poverty, made worse by the post-coup neoliberal “reforms” slashing pensions, making old people work longer and reducing heating subsidies for common citizens. The average Ukrainian salary is only $214 a month. \\nSo, an inquiring mind might wonder how – in the face of all that hardship – the post-coup officials did so well for themselves, but Times’ correspondent Andrew E. Kramer treads lightly on the possibility that these officials were at least as corrupt, if not more so, than the elected government that the U.S. helped overthrow. Elected President Viktor Yanukovych had been excoriated for a lavish lifestyle because he had a sauna in his residence. \\nKramer’s article on Wednesday tried to explain the bundles of cash as a sign that “many of the lawmakers and officials responsible for inspiring public trust in Ukraine’s economic and banking institutions have little faith that their own wealth would be safe in the country’s banks, according to recently mandated financial disclosures. … \\n“Prime Minister Volodymyr Groysman, for example, declared over one million dollars in savings in cash — $870,000 and 460,000 euros — apparently shunning Ukraine’s ever-wobbly banking system. The top official in charge of the country’s banks, Valeriya Gontareva, who is responsible for stabilizing the national currency, the hryvnia, maintains most of her money in American dollars — $1.8 million. \\n“A tally of the declarations filed by most of Parliament’s 450 members compiled by one analyst, Andriy Gerus, found that the lawmakers collectively held $482 million in ‘monetary assets,’ of which $36 million was kept as cold, hard cash. … \\n“Some politicians seem to have approached the declaration as a sort of amnesty, revealing everything they have earned from decades of crooked dealings, in an effort to come clean. … One minister reported a wine collection with bottles worth thousands of dollars each. Another official declared ownership of a church. Yet another claimed a ticket to outer space with Virgin Galactic. … \\n“Another theory making the rounds in Kiev — where people generally acknowledge the inventive, venal genius of their politicians — suggests that the public servants are padding their declarations,” so they can hide future bribes within their reported cash holdings and thus offer plausible excuses for luxury cars and expensive jewelry. \\nAccessing More Money \\nIronically, passage of the law requiring the disclosures of what appears to be widespread corruption among Kiev’s officials unlocked millions of euros in new aid money from the European Union that then flowed to the same apparently corrupt officials. Ousted Ukrainian President Viktor Yanukovych. \\nHowever, because the Ukraine “regime change” in 2014 was partly orchestrated by U.S. and E.U. officials around the propaganda theme that elected President Yanukovych was corrupt – he had that sauna, after all – the continued corruption in the post-coup regime has been a rarely acknowledged, inconvenient truth. Indeed, some business people operating in Ukraine have complained that the corruption has grown worse since Yanukovych was overthrown. \\nYet, only occasionally has that reality been allowed to peek through in the mainstream U.S. media, which prefers to deny that any “coup” occurred, to blame Russia for all of Ukraine’s problems, and to praise the post-coup “reforms” which targeted pensions, heating subsidies and other social programs for average citizens. \\nOne of the rare deviations from the happy talk appeared in The Wall Street Journal on Jan. 1, 2016, observing that “most Ukrainians say the revolution’s promise to replace rule by thieves with the rule of law has fallen short and the government acknowledges that there is still much to be done.” \\nActually, the numbers suggested something even worse. More and more Ukrainians rated corruption as a major problem facing the nation, including a majority of 53 percent in September 2015, up from 28 percent in September 2014, according to polls by International Foundation for Electoral Systems. \\nSo, as the hard lives of most Ukrainians got harder, the elites continued to skim off whatever cream was left, including access to billions of dollars in the West’s foreign assistance that has kept the economy afloat. \\nThere was, for instance, the case of Finance Minister Natalie Jaresko, who was regarded by many pundits as the face of Ukraine’s reform before departing last April after losing out in a power struggle. \\nYet, Jaresko was hardly a paragon of reform. Prior to getting instant Ukrainian citizenship and becoming Finance Minister in December 2014, she was a former U.S. diplomat who had been entrusted to run a $150 million U.S.-taxpayer-funded program to help jump-start an investment economy in Ukraine and Moldova. \\nJaresko’s compensation was capped at $150,000 a year, a salary that many Americans – let alone Ukrainians – would envy, but it was not enough for her. So, she engaged in a variety of maneuvers to evade the cap and enrich herself by claiming millions of dollars in bonuses and fees. \\nUltimately, Jaresko was collecting more than $2 million a year after she shifted management of the Western NIS Enterprise Fund (WNISEF) to her own private company, Horizon Capital, and arranged to get lucrative bonuses when selling off investments, even as the overall WNISEF fund was losing money, according to official records. Ukraine’s former Finance Minister Natalie Jaresko. \\nFor instance, Jaresko collected $1.77 million in bonuses in 2013, according to a WNISEF filing with the Internal Revenue Service. In her financial disclosure forms with the Ukrainian government, she reported earning $2.66 million in 2013 and $2.05 million in 2014, thus amassing a sizeable personal fortune while investing U.S. taxpayers’ money supposedly to benefit the Ukrainian people. \\nIt didn’t matter that WNISEF continued to hemorrhage money, shrinking from its original $150 million to $89.8 million in the 2013 tax year, according to the IRS filing. WNISEF reported that the bonuses to Jaresko and other corporate officers were based on “successful” exits from some investments even if the overall fund was losing money. \\nThough Jaresko’s enrichment schemes were documented by IRS and other official filings, the mainstream U.S. media turned a blind eye to this history, all the better to pretend that Ukraine’s “reform” process was in good hands. [See Consortiumnews.com’s “ How Ukraine’s Finance Minister Got Rich .”] \\nBiden’s Appeal \\nWorried about the continued corruption, Vice President Joe Biden, who took a personal interest in Ukraine, lectured Ukraine’s parliament on the need to end cronyism. \\nBut Biden had his own Ukraine cronyism problem because three months after the U.S.-backed overthrow of the Yanukovych government Ukraine’s largest private gas firm, Burisma Holdings, appointed his son, Hunter Biden, to its board of directors. Vice President Joe Biden. \\nBurisma a shadowy Cyprus-based company also lined up well-connected lobbyists, some with ties to Secretary of State John Kerry, including Kerry’s former Senate chief of staff David Leiter, according to lobbying disclosures. \\nAs Time magazine reported , “Leiter’s involvement in the firm rounds out a power-packed team of politically-connected Americans that also includes a second new board member, Devon Archer, a Democratic bundler and former adviser to John Kerry’s 2004 presidential campaign. Both Archer and Hunter Biden have worked as business partners with Kerry’s son-in-law, Christopher Heinz, the founding partner of Rosemont Capital, a private-equity company.” \\nAccording to investigative journalism inside Ukraine, the ownership of Burisma has been traced to Privat Bank, controlled by the thuggish billionaire oligarch Ihor Kolomoysky, who was appointed by the U.S.-backed “reform” regime to be governor of Dnipropetrovsk Oblast, a south-central province of Ukraine (though Kolomoisky was eventually ousted from that post in a power struggle over control of UkrTransNafta, Ukraine’s state-owned oil pipeline operator). \\nIn a speech to Ukraine’s parliament in December 2015 , Biden hailed the sacrifice of the 100 or so protesters who died during the Maidan putsch in February 2014, which ousted Yanukovych, referring to the dead by their laudatory name “The Heavenly Hundred.” \\nBut Biden made no heavenly references to the estimated 10,000 people, mostly ethnic Russians, who have been slaughtered in the U.S.-encouraged “Anti-Terror Operation” waged by the coup regime against eastern Ukrainians who resisted Yanukovych’s violent ouster. Nor did Biden take note that some of the Heavenly Hundred were street fighters for neo-Nazi and other far-right nationalist organizations. \\nBut after making his sugary references to The Heavenly Hundred, Biden delivered his bitter medicine, an appeal for the parliament to continue implementing International Monetary Fund “reforms,” including demands that old people work longer into their old age. \\nBiden said, “For Ukraine to continue to make progress and to keep the support of the international community you have to do more, as well. The big part of moving forward with your IMF program — it requires difficult reforms. And they are difficult. \\n“Let me say parenthetically here, all the experts from our State Department and all the think tanks, and they come and tell you, that you know what you should do is you should deal with pensions. You should deal with — as if it’s easy to do. Hell, we’re having trouble in America dealing with it. We’re having trouble. To vote to raise the pension age is to write your political obituary in many places. \\n“Don’t misunderstand that those of us who serve in other democratic institutions don’t understand how hard the conditions are, how difficult it is to cast some of the votes to meet the obligations committed to under the IMF. It requires sacrifices that might not be politically expedient or popular. But they’re critical to putting Ukraine on the path to a future that is economically secure. And I urge you to stay the course as hard as it is. Ukraine needs a budget that’s consistent with your IMF commitments.” \\nHowever, as tough as it might have been for Ukraine’s parliament to slash pensions, reduce heating subsidies and force the elderly to work longer, that political sacrifice did not appear to extend to the officials making financial sacrifices themselves.'"}, "time": 1742561810.3024132}