{"duration": 0.08766293525695801, "input_args": {"text": "'The funeral for Elie Wiesel was a gathering of his family and close friends, held on Sunday at a synagogue on the Upper East Side of Manhattan. But outside on East 62nd Street stood people, some in tears, who had never met the man who survived the Holocaust to become a clarion voice for those victims who did not. “He was someone who protected us he interceded against our worst instincts,” Sarah Bardin, 44, a preschool teacher who had come to pay her respects, said as she cried. She knew Mr. Wiesel, who died on Saturday at 87, only through his prolific writing. His works, including the memoir “Night,” gave voice to the Jews murdered during World War II and demanded they never be forgotten. Without him, Ms. Bardin said, the world felt like a more vulnerable place. Inside the Orthodox Fifth Avenue Synagogue, about 100 people attended a ceremony that not only reflected Mr. Wiesel as a man of extraordinary scholarship and influence who won a Nobel Peace Prize for his life’s work, but also remembered him as a friend, a mentor, a husband, a father, a grandfather. In a wheelchair, his widow, Marion, listened as Mr. Wiesel was eulogized by his son Elisha, a partner at Goldman Sachs. He spoke of what it was like growing up with a man of such stature but who still had time for unconditional love. A young grandson, Elijah, spoke of sharing simple moments with a man who was a moral titan to many. Elijah recalled the fun of making English muffins together, smothered in blueberry jam. Mr. Wiesel was liberated from the Buchenwald camp as a    with the numbers   tattooed on his arm. At his funeral he was remembered for a legacy little known by those outside his immediate circle: He loved to laugh, Ted Koppel, the television news anchor said in a eulogy. He spoke of how funny Mr. Wiesel was, and of their   friendship that was spent finding ways to make each other laugh. “It made clear his love of the Jewish people extended to all mankind,” Menachem Rosensaft, a friend of over 50 years, said of the service. Mr. Rosensaft, a professor of law at Columbia and Cornell, said he had been a teaching assistant for Mr. Wiesel when he taught at City College in New York beginning in the 1970s. In attendance was Sheila Johnson Robbins, a member of the board of the Elie Wiesel Foundation for Humanity, the organization he started to promote understanding among ethnic groups in conflict. “He gave us the sense of responsibility, to follow in his footsteps, and continue his mission  —   to never forget,” she said after the service. “And everyone is thinking of him as a thinker, a writer,” she added. “He was also a man  —   he loved chocolate!” Around noon, the coffin with Mr. Wiesel’s body was wheeled from the synagogue surrounded by a dozen mourners, a simple pine box that is customary in Jewish funerals, a blue velvet cloth draped over it. Later that day, in keeping with the Jewish tradition of burying a person with expediency, he was interred at Sharon Gardens cemetery, in the Westchester County town of Valhalla. “He was not just a leader for the Jewish people, but for mankind,” Ronald Lauder, the businessman and philanthropist, said after the service. “I would not be who I am without him. What he taught me is that we have to stand up to indifference. He would say, ‘The opposite of love is not hate, it is indifference. ’” At the burial in Valhalla on Sunday afternoon, family members and friends shoveled dirt onto the coffin, as is Jewish tradition. Among those at the burial was Rabbi Shmuley Boteach, who began a friendship with Mr. Wiesel over 25 years ago when he invited Mr. Wiesel to speak at Oxford University, where Rabbi Boteach was in residence. “What went through my mind the entire time was that the six million of the Holocaust were never granted the dignity of a burial their ashes were merely scattered,” Rabbi Boteach said. “Here we were with the privilege of burying the Holocaust’s greatest witness. ”'"}, "time": 1742563092.3537807}