{"duration": 0.07387757301330566, "input_args": {"text": "'Breitbart News Senior Editor MILO likened Planned Parenthood to eugenics during his talk at Cal Poly State University on Tuesday, citing the amount of black babies aborted every year.[  “Progressives like to insinuate that there is something sinister about Big Oil and Big Tobacco. They might even be right! But Planned Parenthood, Big Abortion, is worse,” proclaimed MILO. “We were all shocked when undercover tapes came out showing they are in the business of selling baby parts to the medical industry. Can you imagine, and I don’t think this is a stretch, the senior leaders of Planned Parenthood sitting in a conference room discussing the best timing for an abortion, to maximize their profits from the dead baby’s body? It’s horrifying, and it’s what feminists want more of. ” “Planned Parenthood can attribute a good portion of their boffo   business to their president since 2006, Cecile Richards,” he continued. “Richards is well on her way to personally matching Hitler’s body count. We’ve done the grim maths so you don’t have to. ” “Using a conservative estimate of 300, 000 abortions a year  —   or 300 kiloscrapes, using the technical metric measure  —   Cecile Richards has presided over three million abortions, or three megascrapes in her ten years as president of the organisation,” MILO stated. “This has earned her ‘half Holocaust’ status. Full Holocaust seems eminently reachable given Planned Parenthood’s growing hegemony in the abortion industry. ” MILO continued to add that these statistics were just since “Richards took charge,” and didn’t include abortions performed prior to 2006. “Planned Parenthood has since 1970 performed 7 million abortions, comfortably surpassing Hitler according to its own annual reports,” added MILO. “You have to admire the chutzpah, if you’ll forgive my terminology: Planned Parenthood has amassed a Third   death count completely legally and while pocketing half a billion dollars a year to do so. But under Richards the numbers have skyrocketed such that in just the last ten years, at least 3 million young lives were ended. ” “If Cecile stays in her post another decade, she will reach ‘full Hitler,’ by matching the six million deaths of the Holocaust. In fact it’ll probably be sooner than that, given the acceleration in procedures during her reign,” he continued. “The road ahead may be rocky. Besides the undercover videos still being released, some media sources are starting to cover the revolting practices of these sociopathic monsters. Nice normal people, whatever their views on abortion, have no stomach for these unashamed   activities. And perhaps President Trump will defund them. ” “If you need to hear more about Margaret Sanger, here’s something she once said. She was inarguably racist,” MILO explained. “She spoke glowingly about a presentation to a group of KKK women in New Jersey, and they loved her messaging about the black race. Messaging like this, in a letter to Dr. Clarence Gamble:” We do not want word to get out that we want to exterminate the Negro population and the minister is the man who can straighten out the idea if it ever occurs to any of their more rebellious members. “Margaret Sanger’s goal was to diminish the black race, and one can argue she was at least partially successful. Stats about abortion by race are not always easy to find, but nonetheless paint a compelling picture about the race reality of abortion,” proclaimed MILO. “In 2012, there were more black children aborted in New York City than born alive. More than 31, 000 compared to just under 25, 000 live births. Blacks accounted for 42% of the abortions in the city, with Hispanic women accounting for another 31%. That’s 73% of all abortions in the city killing black and Hispanic youth. ” “Other national data from the Center for   Reform asserts that black women are 3 times more likely to have an abortion than white women,” he concluded. “So isn’t it fascinating that intersectional   feminists fighting for abortion and so often    with Black Lives Matter? To any BLM members tucked away in the audience, I can conclusively say that feminists are one group that do not believe black lives matter at all. ” Written from prepared remarks.'"}, "time": 1742562696.9587512}