{"duration": 0.03397107124328613, "input_args": {"text": "'This post was originally published on this site \\nsott.net/news \\nA black, female Bowling Green State University student allegedly fabricated a hate crime story about white, male President-Elect Donald Trump supporters attacking her on campus and is now being charged for faking a police report. \\nThe day after Trump’s presidential victory, Eleesha Long told Bowling Green police that she had been attacked by three men wearing Trump gear who “began to throw rocks” at her , according to ABC13. \\nLong took to her Facebook page to share the story, describing in detail what each Trump supporter was wearing and giving a description of as to where the alleged hate crime had occurred, but never actually called the police. \\nLong’s Facebook post went viral and her father notified law enforcement after he said he was not able to get in touch with her . Local detectives took Long into police headquarters and asked her to share details of the described hate crime. \\nLong reportedly began telling police multiple stories about the incident, to include changing the location of the alleged incident. \\n“Several times the complainant changed her story about what happened, where it happened, and when it happened,” Lt. Dan Mancuso told ABC13. \\nAfterward, the police got a warrant for Long’s Facebook and Verizon cell phone history, proving that she was not where she claimed she was at the time of the alleged attack . \\n“Based on that information, it proved that she was not in the location that of when she said it occurred,” Lt. Mancuso said. \\nPolice investigators said Long’s cell phone history included discriminatory remarks towards Trump supporters that she had sent to her boyfriend and mother. \\nIn one text message, Long said about Trump supporters “should take an IQ test to vote,” while a couple other messages said “I hope they all get AIDS” and “I haven’t met a decent Trump supporter yet.” \\nLong is now being charged for falsifying a police report and obstructing official business, which she will have to appear in court for. Related '"}, "time": 1742562833.9430487}