{"duration": 0.08081603050231934, "input_args": {"text": "\"We Are Change \\nOn Tuesday evening, Megyn Kelly used the term “sexual predator” while referring to Donald Trump, but would not use the same words to describe Bill Clinton, during a heated exchange with Newt Gingrich.\\nNow, two of the former president’s victims are slamming the Fox News star over her hypocrisy. \\nDuring the exchange, the former speaker accused Kelly of being biased against Trump, and “fascinated with sex.” He argued that the media is focusing too much attention on allegations against the Republican candidate and not enough time on the Wikileaks’ release of Clinton’s secret paid speeches to Goldman Sachs. \\n“Let me point out something to you, the three major networks spent 23 minutes attacking Donald Trump that night and 57 seconds on Hillary Clinton’s secret speeches. You don’t think this is a scale of bias worthy of Pravda and Izvestia?” Gingrich asked. \\n“If Trump is a sexual predator, that is –” Kelly began to interrupt. \\n“He’s not a sexual predator,” Gingrich exclaimed. “You can’t say that, you could not defend that statement. I am sick and tired of people like you using language that is inflammatory that’s not true!” \\nKelly then interrupted again, demanding that Gingrich has no idea if it is true or not, and that she is not taking a position on the issue either way — despite the fact that she clearly has. \\n“When you used those words you took a position,” Gingrich asserted. \\nAfter Kelly reiterated the allegations against Trump, and the fact that he denies it. She demanded that the news needs to cover the allegations, whether they are true or not. \\n“You are fascinated with sex, and you don’t care about public policy,” Gingrich asserted, as Trump supporters nationwide jumped off their couches to give him a standing ovation. \\nKelly laughed his statement off, and declared that she is “not fascinated by sex,” but is “fascinated by the protection of women, and understanding what we are getting in the oval office.” \\n“Do you want to comment on whether the Clinton ticket has a relationship to a sexual predator,” Gingrich replied calmly. He then repeatedly asked her to use the words, “Bill Clinton sexual predator,” which Kelly refused to do — asserting that he is not on the ticket. \\nI was 35 years old when Bill Clinton, Ark. Attorney General raped me and Hillary tried to silence me. I am now 73….it never goes away.\\n— Juanita Broaddrick (@atensnut) January 6, 2016 \\n\\nAfter the show aired, Juanita Broaddrick, who has asserted and vividly described being raped by the candidate’s husband, tweeted out that Kelly is “ugly as hell on the inside.” \\nBeauty is only skin deep. Megyn Kelly is ugly as hell on the inside.\\n— Juanita Broaddrick (@atensnut) October 26, 2016 \\n\\nBroaddrick also accused Kelly of being biased, after someone tweeted out a reminder that both Kelly and Shep Smith have donated $70,000 each to Clinton’s campaign. \\nYeah she's fair and balanced. Change your slogan FOX https://t.co/BnSNRcFdPr \\n— Juanita Broaddrick (@atensnut) October 26, 2016 \\n\\nPaula Jones , the former Arkansas state employee who sued President Bill Clinton for sexual harassment, and received a $850,000 settlement, also had harsh words for Kelly. \\n“Lets get this straight…Megyn Kelly isn’t for all women…she hates Trump, so she’s only for those so called victims! NEVER for me!” Jones tweeted. \\nLets get this straight…Megyn Kelly isn't for all women…she hates Trump, so she's only for those so called victims! NEVER for me!\\n— PJGirlie (@ThePaulaJones) October 26, 2016 \\n\\nCheck out Broaddrick’s heartbreaking interview with Breitbart News here:\\nThe post Bill Clinton’s Victims Strike Back at Megyn Kelly appeared first on We Are Change .\\n\""}, "time": 1742564354.6789277}