{"duration": 0.04945492744445801, "input_args": {"text": "'It never ceases to amaze me how, blinded by their narcissism, Hollyweirdos and other pop culture “celebrities” are rank hypocrites, utterly devoid of introspection. \\nThe latest exemplar: Pop singer Mariah Carey. \\nCarey, 46, is the best-selling female singer of all time, with an estimate net worth of $500 million from her preternatural ability to screech like a dolphin in heat (apologies to dolphins). \\nBorn in New York state, Carey is biracial — her father is of African descent, her mother is of Irish descent — which makes Mariah Carey a racial “minority” in the U.S. \\nBeginning at the 0:58 mark in the video below, Carey says she agrees with protests over the lack of women and minorities in “entertainment” because: \\n“I don’t think women get a fair deal in anything . . . . [In the music business] it’s obvious that we’ve had to, you know, women and minorities have had to fight for, you know, trying to get equal opportunities for, for ages . . . . There’s not enough diversity . . . . I’m just an entertainer but, um, you know, I’m a fan of Hillary [Clinton] . . . of course I’m a fan of Hillary. Of course I would love to see a woman president.” \\nCarey is very much in the news these days because Australian playboy billionaire James Packer recently broke off their engagement. Rumors have it that one of the reasons for the breakup was her “insane spending sprees”. \\nAccording to an account in New York Post ‘s “ Page Six ” on Oct. 27, 2016, the following are examples of Carey’s “over-the-top . . . frenzied spending that may have doomed her engagement to Packer”: Sources say Carey “regularly drops $10,000 to get her hair and makeup perfect — even if it’s all going to last just a single day.” Power 105’s The Breakfast Club radio host Charlamagne Tha God, aka Lenard McKelvey, who knows the singer, told The Post : “Mariah is the last of the divas — she’s got a very old-school approach to stardom. It’s champagne-in-the-morning type stuff. She [once] shared some with the Breakfast Club staff at 10 o’clock in the morning, but she did not pour her own champagne — someone else poured it for her.” In 2014, Carey — who once called overhead lighting “abusive” — showed up to a filmed radio interview on The Breakfast Club over an hour late, with her own lighting crew in tow. McKelvey told The Post : “I remember thinking to myself, damn, what kind of disposable income she has where she has her own lighting director? That was the first and only time that that has ever happened on the radio show.” Carey reportedly drops at least $45,000 a year on spa treatments for her dogs — Jack Russells named Cha Cha and Jill E. Beans — even flying them first class to LA in January, which cost over $2,000 per dog. A close friend of Packer told Woman’s Day last month that Carey “spends $100,000 a month ordering exotic flowers from around the world to where she happens to be.” Carey has her own yacht, the Capri, which costs a cool $340,000 per week plus expenses to maintain, according to “Entertainment Tonight” . She would use a ferry to reach Packer’s boat, the Arctic P, which is the seventh-largest privately owned vessel in the world. Carey’s closet is “the stuff of legends, packed with more stilettos than the Barneys shoe department.” She has a room just to store her shoes. In a recent Instagram showing off part of her vast footwear collection, she calls the room “always my favorite room in the house”. \\nBut Mariah Carey tells us that women can’t get a fair deal in anything and, in the music business, women and minorities have to fight for equal opportunities. \\nIf you buy this delusional woman’s music or go to her concerts, you’re contributing to Mariah “Marie Antoinette” Carey’s obscene spending that pollutes the environment and squanders the world’s resources. \\n~Eowyn'"}, "time": 1742564431.9438322}