{"duration": 0.06256246566772461, "input_args": {"text": "'WASHINGTON  —   U. S. and Australian troops advising Iraqi forces got caught up in a chemical weapons attack by the Islamic State (ISIS) in western Mosul during the weekend, a U. S. general confirmed Wednesday. [The chemical agent did not affect U. S. forces and is still undergoing testing, said Maj. Gen. Joseph Martin, the commander of U. S. and coalition ground forces in Iraq.  “Daesh has used chemicals in the vicinity of Mosul. The chemicals have had no impact on the Iraqi Security Forces. They had no impact on our forces,” Martin said, using a derogatory Arabic acronym for ISIS. A U. S. defense official said U. S. forces donned protective gear. Australian troops were not exposed to the substance, according to an article by the Australian Broadcasting Corporation (ABC). Australian medics provided some Iraqi forces first aid after the attack. A U. S. defense official said those Iraqi forces have returned to duty. It is not the first time ISIS has used chemical weapons in Iraq. The U. S.  military coalition confirmed in 2015 the first instances of the terrorist group using sulfur mustard and mustard gas. An assessment by IHS Conflict Monitor found in November 2015 that ISIS has used chemicals, including chlorine and sulfur mustard agents, at least 52 times in Iraq and Syria since 2014. Martin said the chemicals ISIS has used in the past are all “ ” because of the group’s lack of production capability. He said the chemicals were believed to have been delivered by indirect fire, meaning via rocket or some projectile containing the chemical agent. Martin said U. S. forces have the appropriate equipment and training to protect themselves from chemical weapons. The attack also raised the question of how closely U. S. forces are operating with Iraqi forces. Officials have said U. S. troops are not on the front lines fighting ISIS. However, Martin indicated they are close together and share the same risks. Martin said U. S. forces are with Iraqi security forces at “various command and control locations throughout Iraq. ” “Being forward with those command and control facilities, they share the same risks the Iraqis do,” he said. He added that U. S. forces are “forward with the Iraqis each and every day. ” A defense official of unknown nationality told ABC that Australian and U. S. advisers were with Iraqi forces at the time of the attack. Martin characterized ISIS as getting increasingly desperate, as Iraqi forces  —   backed by the U. S.  military coalition  —   are succeeding in pushing the terrorist group out of their main stronghold in Iraq. Martin said ISIS members were turning on civilians, killing hundreds each week. “As I see it, the longer this fight goes on in west Mosul, the civilians will suffer at the hands of a brutal enemy. This is why ISIS must be defeated quickly,” he said. He said ISIS was using civilians as human shields and fighting from protected sites. “ISIS uses the tactic of taking civilians hostage for protection while they’re fighting from protected sites. ISIS has been indiscriminate in their use of [  improvised explosive devices] and building IEDs to kill, maim and injure innocent civilians as part of their ongoing campaign of terror,” he said. Martin said ISIS’s “leadership has fled and their days are numbered. ” Meanwhile, he said, Iraqi forces were getting better. “They continue to improve their capability and demonstrate a level of professionalism that makes me proud to serve with them. It’s only a matter of time before they liberate the rest of Mosul and defeat ISIS in Iraq,” he said.'"}, "time": 1742561629.7229452}