{"duration": 1.6899888515472412, "input_args": {"text": "'Dr. Zuhdi Jasser, founder and president of the American Islamic Forum for Democracy, strongly disputed accusations that President Trump’s immigration order contains a “religious test” or “bans Muslims. ”[“I don’t know where they’re getting that from,” he said. “I don’t think they read the same executive order. ”  “I served on the U. S. Commission on Religious Freedom for four years,” he pointed out. “We have an ambassador of religious freedom that goes around the world, trying to advance American values and protecting minorities. And it is extremely American, if not our first freedom, obviously, to protect religious freedom. That includes the persecution of minorities. ” “The executive order from President Trump said nothing specifically about any specific religion. It said we will protect those persecuted in the name of religion, for their religion. So that would include Christians, Yazidis, and even Sunni Muslims like myself who are part of the majority in Syria  —   or Egypt, or Saudi Arabia, or wherever  —   but yet have dissident opinions that are persecuted,” he pointed out. Jasser said it truly would be wrong to favor one religion over the other, “but it is very American to favor those who are persecuted over those who are the oppressors. ”  “And there’s nothing more American than vetting refugees, and beginning to vet them against those who believe in theocracy,” he added. “We don’t want people coming into this country that believe in the Islamic states. We want those who believe in freedom and liberty. I think it’s appropriate to pause and begin the process of vetting ideology, which hasn’t happened so far. We’re sort of welcoming in anyone, including jihadists. It’s just amazing how the identity Left loves to use us Muslims as a foil of identity politics. They’re really not addressing what was written in that order. ” Jasser said Trump’s order was, if anything, too narrow. “I think there should have been more countries: Saudi Arabia, Pakistan, Qatar. The havens of the founding fathers of ISIS, I think, should have been included. But that would not make it more ‘ .’ There is nothing more   than helping dissident Muslims, helping those persecuted under theocracy, under the sharia state, if you will. ” He noted that the seven countries affected by Trump’s executive order are “the same seven countries that Obama listed as hot spots. ” “I will say, there should be some fair criticism about the messaging from the White House on this,” he added. “I understand why they rushed it: because they didn’t want people to get a head start, the radicals to get a head start. But still, probably the implementation could have been done better at the front lines, in airports, etc. But that’s a different criticism from having what I believe are   rallies across the country to try to undercut the stability of our country. ” Jasser said it was time to begin shifting “the axis of the conversation” about Islam and religious freedom. “The conversation for the last eight years, or even into the Bush administration, has been about ‘countering violent extremism,’ which is a tactic,” he said. “We need to start shifting to saying, ‘Well, what are we for?’ We’re against extremism. I think we should change it so that we’re against violent Islamism, so that we make it clear  —   because when you make it clear and identify the enemy as theocratic Islamists, then Americans can start to say, ‘Okay, so the   are our friends and allies, and the Islamists are our enemies.’ That makes it actually more   rather than creating this sort of generic phobia of, ‘Well, any Muslim could be a terrorist. ’” “That’s number one. Number two, we need to talk about what we’re for,” he continued. “We will advance those who want freedom and liberty, who believe in secular democracy. Our Muslim reform movement has a   declaration that is a declaration of principles, that says we’re against the Caliphate. We believe in the universal declaration of human rights. These are things that I’d like to see the President, as he has this   stay, start to engage. ” “He talks about a commission on radical Islamism. I hope he starts putting that into play because the pause is just going to be a pause, with nothing gained, if we don’t start to educate Americans about what we’re for, and what the sides are,” he warned. “The old allies in the Middle East  —   Saudi Arabia, etc.  —   they might be with us in this    program, but they’re both the firefighters and the arsonists. We need to make clear that our principles in America, our religious freedom, are not embodied in those countries that are the cauldrons of radical Islam,” he said. Jasser invited listeners to consult the resources at the American Islamic Forum for Democracy website and the larger umbrella Muslim Reform Movement that stretches across Europe and Canada.  “Unfortunately, the identity Left, and the Islamists who are what I call ‘’ have been dominating the conversation, and they’re just apoplectic right now because they’ve lost control,” he said. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563935.0655828}