{"duration": 0.04600405693054199, "input_args": {"text": "'With the election over and done with, America is turning its attention to the transition from President Obama to President Trump. In barely two months, the Donald will take office, ejecting the Democrats’ coterie of corrupt courtiers and beginning his mission to right America’s wrongs . But President Trump can’t do it alone: he needs good, talented people to work under him and carry out the hard work of making America great again.\\nThat’s where you come in.\\nThe Trump administration is now soliciting people to apply for jobs for when the man himself takes office in January. We are officially calling on all ready and able Return Of Kings readers to submit their applications and take up any job offers. Here’s why you should consider a job in President Trump’s administration (beyond obvious reasons such as money and prestige)…\\n1. It’ll help keep President Trump accountable \\nWhile the media is lying about Trump reneging on his campaign promises, it’s still a good idea to give the man more reasons to keep his word. By staffing his administration with committed nationalists, we’ll make it easier for President Trump to fulfill his political program, as well as make it more difficult for him to go back on his promises. Remember, it was rank-and-file FBI agents who forced James Comey to reopen the investigation into Hillary Clinton ; a leader needs loyal men in order to carry out his agenda.\\n2. You’ll be able to make history \\nGiven the momentous task of rebuilding America after eight years of Obama’s perfidy and failure, you almost have a civic duty to help President Trump in his mission. Expecting America to become great again all on its own is delusional; we need to do our part to restore this nation’s glory. By working with the Trump administration, you’ll have a direct role in reshaping America for years—possibly decades—to come.\\n3. You’ll help trigger the left \\nDespite their massive losses in the election—beyond Hillary Clinton’s defeat, the Democrats now control only a handful of state governments and failed to dent the GOP’s Congressional majority—the leftist mainstream media is trying to order Trump around and persuade him to staff his administration with the same flacks who filled Bush’s and Obama’s. Right now, they’re freaking out over Breitbart executive chairman Stephen Bannon being appointed as Trump’s chief strategist .\\nBy joining the Trump administration, you’ll have a hand in helping trigger the left into conniption fits and spasms of impotence. Nothing horrifies them more than losing access to the levers of power, which they’ve controlled for decades. Watching leftists squirm and cry is one of the biggest fringe benefits of Trump’s victory, and we need to keep the triggering up for years to come.\\nIf you think you have the job skills, Return Of Kings highly recommends you apply for a job in Trump’s administration . President Trump may have started the fire, but it’s our job to help the fire rise.\\nRead More: Did The Anti-Donald Trump Riot In Chicago Help Trump Cruise To Victory On Tuesday? \\n'"}, "time": 1742561719.9878688}