{"duration": 0.13097167015075684, "input_args": {"text": "'Donald Trump on “The Apprentice”: The false values of reality TV have been carried over into the current presidential race. (NBC) \\nThere is no shortage of signs of impending environmental catastrophe, including the melting of the polar ice caps and the rise of atmospheric carbon to above 400 parts per million . The planet’s sixth mass extinction is underway. It is not taking place because of planetary forces. Homo sapiens is orchestrating it. We are at the same time bankrupting ourselves by waging endless and unwinnable wars. We have allowed our elites to push more than half the U.S. population into poverty and, often, profound despair through deindustrialization. We do nothing to halt the waves of nihilistic violence by enraged citizens who carry out periodic mass shootings in schools, malls, movie theaters and other public places. The political and financial elites flaunt their greed and corruption. Donald Trump appears to pay no federal income taxes. Bill and Hillary Clinton use their foundation as a tool for legalized bribery. Our largest corporations have orchestrated a legal tax boycott. The judicial system is a subsidiary of the corporate state. Militarized police carry out public executions of unarmed people of color. Our infrastructure, including our schools, roads and bridges, along with our deindustrialized cities, are in ruins. Decay and rot—physical and moral—are pervasive. \\nWe are blinded to our depressing reality by the avalanche of images disseminated by mass media. Political, intellectual and cultural discourse has been replaced with spectacle. Emotionalism and sensationalism are prized over truth. Highly paid pundits who parrot back the official narrative, corporate advertisers, inane talk shows, violent or sexually explicit entertainment and gossip-fueled news have contaminated cultural life. Reality television, as contrived as every other form of mass entertainment, has produced what might be called a reality presidential candidate. \\nMass culture, because it speaks to us in easily digestible clichés and stereotypes, reinforces ignorance, bigotry and racism. It promotes our individual and collective self-glorification. It sanctifies nonexistent national virtues. It takes from us the intellectual and linguistic tools to separate illusion from truth. It is all show business all the time. \\nAdvertisement Square, Site wide \\nThere are hundreds of millions of Americans who know that something is terribly wrong. A light has gone out. They see it in their own suffering and hopelessness and the suffering and hopelessness of their neighbors. But they lack, because of the contamination of our political, cultural and intellectual discourse, the words and ideas to make sense of what is happening around them. They are bereft of a vision. Austerity, globalization, unfettered capitalism, an expansion of the extraction of fossil fuels and endless war are not the price to be paid for progress and the advance of civilization. They are part of the savage and deadly exploitation by corporate capitalism and imperialism. They serve a neoliberal ideology . The elites dare not speak this truth. It is toxic. They peddle the seductive illusions that saturate the airwaves. We are left to strike out at shadows. We are enticed to succumb to the racism, allure of white supremacy and bigotry that always accompanies a culture in dissolution. \\nWe cannot, for this reason, discount the possibility that Donald Trump will be elected president. The election outcome will be decided by whatever emotion Americans feel when they cast their ballots. \\nCelebrity narratives, manufactured pseudo-drama, sex scandals, natural disasters, insults and invective, mass shootings and war flash before us in a constant jumble of images on ubiquitous screens. The assault of images obliterates reality. A former congressman who sends a picture of himself in underwear to a woman is a national news story. Sober examinations of our economic, foreign, judicial and environmental policies are dismissed as too complicated and boring. It does not produce engaging images. The electronic media’s sole goal is to attract viewers and advertising dollars. It has conditioned us to demand an endless vaudeville act. \\nWe are infected because of this mass indoctrination by what Daniel Boorstin in “ The Image : A Guide to Pseudo-Events in America” calls “social narcissism.” The bottomless narcissism of Trump and Bill and Hillary Clinton cater to this social narcissism. They reflect back to us our desperate longing for, as well as celebration of, entertainment, celebrity, wealth, power and self-aggrandizement. It is not only advertising and public relations, as Boorstin points out, that carries out the incessant manufacturing of illusions that feed social narcissism. Journalists, book publishers, politicians, athletes, entertainers, positive psychologists, self-help gurus, the Christian Right and talk show hosts all feed the mania for illusion. They all chant the insane mantra that reality is never an impediment to what we desire. We can have anything we want if we work hard, get an education, believe in ourselves, grasp that we are exceptional and believe the impossible is always possible. It is magical thinking. And magical thinking is the only real commodity the elites have left offer to us. Make American Great Again. Or America already is great. Take your pick of idiotic clichés. \\n“We tyrannize and frustrate ourselves by expecting more than the world can give us or than we can make of the world,” Boorstin writes. “We demand that everyone who talks to us, or writes for us, or takes pictures for us, or makes merchandise for us, should live in our world of extravagant expectations. We expect this even of the peoples of foreign countries. We have become so accustomed to our illusions that we mistake them for reality. We demand them. And we demand that there be always more of them, bigger and better and more vivid.” \\nThe incessant search for instant gratification and the most appealing image, including the image of ourselves we manufacture for others on social media, has robbed us of the ability to examine ourselves and our society. It has extinguished the truth. The terminal decline of the American empire, the utter incompetence of our elites to manage everything from the ecosystem to the economy and foreign policy, the climate crisis, along with the widespread poverty and despair that defines over half of America, do not fit with the illusion. So these realities are blotted from public consciousness. The poor are rendered invisible. The climate crisis is ignored. The foreign policy debacles will be fixed with more bombs. A culture that can no longer discern or confront reality is unable to reform itself and dies. Only the Soviet and fascist dictatorships, along with the medieval Catholic Church, controlled thought as effectively.'"}, "time": 1742562439.1309268}