{"duration": 0.08237147331237793, "input_args": {"text": "'Military forces in Turkey attempted a coup on Friday, plunging the country into a long night of violence and intrigue. Hundreds of people were killed, and the embattled president’s location was unknown for hours. He later emerged, and by Saturday morning, the coup appeared to be unraveling. • President Recep Tayyip Erdogan returned to Istanbul early Saturday. Speaking at Istanbul Ataturk Airport, he blamed “a minority within the armed forces” for the coup attempt and said those responsible would “pay a heavy price for their treason to Turkey. ” He suggested that the plotters had tried to assassinate him on Friday with a bombing in the Turkish Mediterranean resort town of Marmaris. • Prime Minister Binali Yildirim said 265 people had been killed and 1, 440 had been wounded. Seventeen police officers were killed in a helicopter attack on the outskirts of Ankara, and 12 people were killed after a bomb was detonated at Parliament. • Thousands of    soldiers and officers linked to the coup were arrested on Saturday. “All of these guys will go to prison for life,” said Ilnur Cevik, an aide to Mr. Erdogan. • The White House said there were no indications that Americans were killed or injured in the violence. President Obama reiterated the United States’s “unwavering support for the democratically elected, civilian government of Turkey,” according to a statement. • Mr. Erdogan called on the U. S. to arrest or extradite Fethullah Gulen, a Muslim cleric living in exile in Pennsylvania, whom Mr. Erdogan accused of plotting against him. Mr. Gulen denied any role in the coup attempt, saying in a statement that he condemned it “in the strongest terms. ” Secretary of State John Kerry said the U. S. would listen to any inquiries. • It was not clear to what extent the coup forces had managed to gain control of important state facilities and institutions. • It was not clear who was behind the coup attempt, how much of the Turkish military supported it or why it had been mounted now. • It was not clear how the coup would affect   strike missions against the Islamic State from the Incirlik air base. The Pentagon  said on Saturday that Turkish authorities had at least temporarily halted flights. • Turkish Armed Forces The country’s military is a trusted institution, seen as the guardian of the secularist principles on which modern Turkey was founded. It has intervened in national politics a number of times, including three previous coups since 1960, and it maneuvered to oust an Islamist prime minister in 1997. The military has historically opposed interventions abroad, but it is not known how senior officers, many of them appointed by Mr. Erdogan, feel about his recent interventions in Syria. • President Recep Tayyip Erdogan An Islamist and populist who has been the dominant figure in the country for more than a decade, Mr. Erdogan came to power promising to overhaul the economy and give the country’s rural, more religious majority a bigger voice in the capital. More recently, he has grown increasingly autocratic and alienated many Turks as he cracked down on protests, took control of the news media and renewed war with Kurdish militants in the country’s southeast. • Fethullah Gulen Mr. Gulen is a former imam and onetime ally of Mr. Erdogan who now lives in   exile in the United States, with an extensive following in Turkey. He has promoted a more liberal stream of Islam, and his ideas are popular with the country’s police and intelligence establishments, though not necessarily the military. Mr. Erdogan accused Mr. Gulen and his supporters, whom he has called terrorists, of being responsible for the coup he has repeatedly accused Mr. Gulen of plotting against him in the past. The Gulen movement denied involvement in the coup attempt and denounced any military intervention in Turkey’s domestic affairs. • Republican People’s Party The leftist main opposition party is considered not as   as the governing Justice and Development Party. It has been trying to find a way to break Mr. Erdogan’s political grip, but it would not be likely to benefit from a coup in the past, the military has tended to sideline leaders of all political parties when it took power. • NATO and the United States Turkey has been an American ally and a NATO member since 1952. Though the Obama administration has criticized Mr. Erdogan’s crackdown on civil society in Turkey, the United States sees him as a stabilizing and mainly   leader in a volatile region. The   coalition fighting the Islamic State militants in Syria and Iraq makes heavy use of Incirlik Air Base in Turkey.'"}, "time": 1742562091.159762}