{"duration": 0.10774087905883789, "input_args": {"text": "'Wed, 26 Oct 2016 15:33 UTC © Jonathan Ernest/Reuters Donald Trump called for a \"new deal for black America\" in a Wednesday afternoon address as he works to bridge the gap he faces with the crucial voting bloc less than two weeks from Election Day. Speaking in Charlotte, N.C., the GOP presidential nominee criticized years of Democratic rule for leaving black America behind and outlined his plan to help. My \"deal is grounded in three promises: safe communities, great education and high-paying jobs,\" Trump said, speaking off what appeared to be scripted remarks \"Whether you vote for me or not, I will be your greatest champion. We live in a very divided country, and I will be your greatest champion.\" Trump called on voters to repudiate Democratic nominee Hillary Clinton and her party in favor of change. \"American politics is caught in a time loop. We keep electing the same people over and over and over,\" he said. \"Every day, I\\'m out on the trail proposing fresh solutions and new thinking. And every day, the same people, getting rich off our broken system, say we can\\'t change and we can\\'t try anything new, because it\\'s not good for them.\" The subdued beginning of his speech stood in sharp contrast to the fiery tack Trump usually takes at his campaign rallies, which are meant to inject his brand of politics directly into the veins of his supporters. \"I have a message for all the doubters in Washington: America\\'s future belongs to the dreamers, not the cynics and not the critics,\" he said. \"African-American citizens have sacrificed so much for our nation. They fought and died in every war since the Revolution and from the pews and the picket lines, they\\'ve lifted up the conscience of our country in the long march for civil rights. Yet too many African-Americans have been left behind.\" Trump called for incentives to move companies into blighted neighborhoods to bolster employment, help African-Americans get better access to credit and push cities to declare \"blighted communities\" disaster areas to help rebuild infrastructure. He also said he\\'d support increasing the number of police officers in such areas, connecting a lack of officers to a rise in murder rate in major cities. But while Trump\\'s call focused on removing \"gang members and criminal cartels,\" he blamed Clinton for promoting a \"war on police.\" He did not mention the accusations of police brutality by minorities who feel that they are disproportionately targeted. It\\'s not the first time Trump has made a direct appeal to black voters — overtures first appeared in scripted speeches in the late summer. He\\'s struggled to gain traction with minority voters in general in polls: He won just 20 percent of the nonwhite vote in a recent CNN/ORC poll, 25 percent of nonwhite voters in Quinnipiac University\\'s recent poll and 17 percent in the recent Fox News poll. Black voters were an important voting block for then-Sen. Barack Obama (D-Ill.) when he upset Sen. John McCain (R-Ariz.) in North Carolina in the 2008 presidential election.'"}, "time": 1742562117.9570963}