{"duration": 0.04234957695007324, "input_args": {"text": "'Hillary’s Secret Is Out With What Camera Caught Her Doing Before Rally Posted on November 1, 2016 by Amanda Shea in Politics Share This Screenshots of Hillary Clinton in alarming cell phone footage \\nThere’s a reason Hillary Clinton doesn’t let certain people have cell phones around her, but no matter how much she tries, she can’t control everyone. New Jersey Senator Cory Booker doesn’t care about her recording “rule” as he caught her in the act with his cell phone camera. Now that the alarming video is out, so is her nasty secret. \\nIt’s safe to say that Hillary is dealing with a lot of stress as the campaign she thought she had sufficiently rigged in her favor slips out of her grasp, now that she’s under FBI investigation. It’s becoming harder for her to hide who she really is, despite having done a pretty good job of it up until this campaign, but now we know how she deals with her many challenges after what Booker recorded her doing right before a campaign rally. \\nThe Democratic candidate was in New Jersey on June 1 for one of her few campaign stops at the time and seemed to have some “help” with getting through the challenges of her day. After getting out of her black van, she walked right up to the Senator who she could probably see was recording, acting as if she had not a care in the world as she sang and awkwardly danced for the camera looking rather drunk, despite it being the early afternoon. With Secretary Clinton in Newark. pic.twitter.com/w9Z7Gc482i \\n— Cory Booker (@CoryBooker) June 1, 2016 \\nAs Hannity.com described the strange footage, “the video captured and shared by New Jersey Senator Cory Booker ahead of a June 1st rally in Newark, New Jersey shows an unusually jovial Clinton singing and dancing shortly before appearing with rock musician Jon Bon Jovi.” While it’s not the first time she’s been suspected of day drinking to the point of intoxication before it’s even 5 p.m., it’s just added proof that she can’t seem to cope with her campaign or much of life in general, without alcohol. \\nWhen you live as dishonestly as Hillary has, the only way to avoid the guilt of her decisions is probably to stay a little — or a lot — tipsy throughout the day. That’s unacceptable behavior for anyone, but especially someone who is trying to be the leader of the free world. America doesn’t need a drunk president.'"}, "time": 1742563248.217067}