{"duration": 0.10290789604187012, "input_args": {"text": "'VENICE  —   It was after midnight on the Grand Canal here, and Plácido Domingo was standing on a floating stage slowly motoring toward the Accademia Bridge, singing the opening lines of a duet from “Don Giovanni. ” A soprano’s voice answered from a second float heading to meet his, on which the actress Monica Bellucci, made up like Maria Callas in a teal gown and glittering diamonds,   seductively. The stages came together, and so did the voices. With this operatically    spectacle last week  —   which drew squeals and flurries of smartphone photos as people passed on a vaporetto, or water bus  —   Mr. Domingo became the latest classical star to shoot a cameo for “Mozart in the Jungle,” the Amazon comedy about a fictional New York orchestra. The series has managed to attract several galas’ worth of classical headliners  —   past episodes have featured the pianist Lang Lang playing   with the violinist Joshua Bell, the pianist Emanuel Ax shuffling his feet through an interactive dance video game, and the conductor Gustavo Dudamel. The show’s ability to draw so many   is both a testament to its growing success, and a reflection of the fact that there are now far fewer opportunities for classical artists to appear on television, which is still an important medium for reaching, and appealing to, new audiences. “I became a lot more famous,” Mr. Domingo recalled as he waited in a nearby palazzo for the   shoot to begin, “when I sang a duet with Miss Piggy. ” Over the years, Mr. Domingo, 75, has reached broader audiences with appearances like that one, singing with Miss Piggy on a “Night of 100 Stars” program in 1982, as well as in cameos on popular shows, including “The Simpsons” and “The Cosby Show,” and with his own television specials. But such opportunities have become rarer for musicians in recent years, drying up just as a rapidly changing media environment  —   which is disrupting how politicians communicate, how people consume entertainment and news and how advertisers sell products  —   is posing particular challenges for the classical field. For devoted fans, a strong case can be made that it is the best of times: Streaming services allow people at home to watch concerts by the Berlin Philharmonic and performances from the Salzburg Festival, the Vienna State Opera, the Metropolitan Opera and more. But it is harder than ever for classical stars to appear on   TV, leading to concerns that the field, always something of a niche when it comes to mass media, is becoming a more distant one at a time when music education is also on the wane. It was not always thus. In 1956, Elvis Presley was not the only superstar to make his debut on “The Ed Sullivan Show”  —   Callas did as well, with a lengthy excerpt from Puccini’s “Tosca. ” NBC used to commission and televise new operas, including Gian Carlo Menotti’s “Amahl and the Night Visitors. ” The soprano Beverly Sills was not just a guest on “The Tonight Show Starring Johnny Carson” but also a guest host. The   Marilyn Horne appeared on the “The Odd Couple. ” David Gockley, the veteran American impresario, said that those television appearances drove a wider interest in the art form  —   and sold tickets. “Our audience knew a lot of these names because they were on television,” he recalled. “We don’t see the mainstream media paying much attention to opera these days, and it makes a difference. ” Peter Gelb, the Met’s general manager, said that dwindling television opportunities had forced the company to reach audiences in new ways  —   both by starting its Live in HD cinema simulcasts and through social media. Last season, he said, the Met’s videos were viewed about 7. 5 million times on Facebook and YouTube. “We have to create our own communications systems,” he said in a telephone interview. There are exceptions. “Sesame Street” still features classical musicians from time to time the quiz show “Jeopardy!” has had dancers and musicians present clues and Stephen Colbert has invited ballet dancers and classical artists on both “The Colbert Report” and “The Late Show. ” But those kinds of appearances are fewer and farther between. So “Mozart in the Jungle,” which some musicians and critics initially rolled their eyes at, has taken on an importance to classical music that grew after the show won two Golden Globes this year. The show, of course, has Mozart in its title, and is loosely based on the 2005 memoir of the same name by Blair Tindall, an oboist who set out to explore, in the words of her subtitle, “Sex, Drugs and Classical Music. ” So a good portion of the viewers who stream it may already be music fans. But with a cast that includes stars like Gael García Bernal, Bernadette Peters, Malcolm McDowell, Lola Kirke and, in a small role, Jason Schwartzman, the series also draws viewers who may not (yet) have subscriptions to their local orchestras. Paul Weitz, who was directing the episode with Mr. Domingo and is an executive producer of the show with Roman Coppola and Mr. Schwartzman, said that the possibility of reaching those viewers was especially enticing to the musicians who have appeared. “Obviously, it’s a huge issue, and it’s something that is dealt with in the show a lot, about whether classical music is going to be passed on to a new generation,” Mr. Weitz said between shots in his director’s chair. “And all these artists, the reasons that they’re doing this show is because they feel like it’s good for that aspect of the art  —   that it can bring the music to different people. And anecdotally, I think that’s actually the case. ” Mr. Domingo, who moved to Mexico as a child and maintains strong ties there, said that he was drawn partly by the chance to appear with Mr. García Bernal, a Mexican actor whose career he has followed since the film “Y Tu Mamá También” more than a decade ago, and partly because he was intrigued by a new series that shines a light on the field. So Mr. Domingo, who remains one of the hardest workers in opera, recorded his vocals for the duet, “Là ci darem la mano,” this month at a midnight session at the Teatro alla Scala in Milan, right after finishing a performance there in the title role of Verdi’s “Simon Boccanegra. ” (The soprano part, which Ms. Bellucci, who is playing a fiery diva known as La Fiamma,   to, was recorded in San Francisco by the rising star Ana María Martínez.) And last week he flew here for a   shoot, the day after singing in Verdi’s “I Due Foscari” at Teatro Real in Madrid, where he sang the role of the Doge of Venice. “When I finished,” he said, “I said, ‘Tomorrow I’ll go to my city to see how my people are behaving. ’” The coming “Mozart” season will also shine a spotlight on contemporary music, with a cameo by Nico Muhly, the young American composer whose opera “Two Boys” was staged at the Met in 2013. He wrote a piece for the show  —   an aria from an imaginary opera based on the story of Amy Fisher, who at the age of 17 became known as the Long Island Lolita after shooting and severely wounding the wife of her lover. Mr. Weitz said that the aria struck the tone he strove for in the show  —   mixing ridiculous and comic elements with sublime moments, through music. “Nico’s fake Amy Fisher opera actually achieves that,” he said. “It’s completely preposterous and silly and at the same time  —   and this was very important, it’s what I was hoping for  —   it’s actually moving. ”'"}, "time": 1742628391.2364929}