{"duration": 0.04523754119873047, "input_args": {"text": "'President Obama canceled a meeting with President Rodrigo Duterte of the Philippines scheduled for Tuesday in Laos, after the Philippine president directed an expletive at Mr. Obama on Monday. On Tuesday, Mr. Duterte released a statement saying he regretted that his curse “came across as a personal attack on the U. S. president. ” He blamed his words on “certain press questions that elicited concern and distress. ” Mr. Duterte had warned Mr. Obama not to ask him about extrajudicial killings related to his crackdown on drug dealers, a campaign pledge that helped sweep him to victory in the country’s presidential election in May. “I am a president of a sovereign state, and we have long ceased to be a colony,” Mr. Duterte told reporters before he left his country for Laos, where he and Mr. Obama will attend the meeting of the Association of Southeast Asian Nations. “I do not have any master except the Filipino people, nobody but nobody,” he said in remarks published by The Associated Press. Apparently addressing Mr. Obama, he added: “You must be respectful. Do not just throw questions. ” Then, using a curse in Tagalog that can be translated as “son of a bitch,” he added, “I will swear at you in that forum. ” Mr. Obama, who was in China for a Group of 20 meeting, departed on Monday for Laos, becoming the first American president to visit the nation. He is also scheduled to take part in the East Asia Summit and speak at a forum with young people. Mr. Obama had planned to meet Mr. Duterte in Laos, but the White House said early Tuesday that the meeting had been canceled. “Clearly, he’s a colorful guy,” Mr. Obama said Monday. “I always want to make sure if I’m having a meeting that it’s productive. ” Mr. Duterte acknowledged Tuesday that the meeting had been canceled and seemed to take a softer tone: “We look forward to ironing out differences arising out of national priorities and perceptions, and working in mutually responsible ways for both countries. ” Last month, the Philippines’ top police official, Chief Ronald dela Rosa, told a Senate hearing that killings by the police and vigilantes in the country’s war on drugs had soared to nearly 1, 800 in the seven weeks since Mr. Duterte, a former mayor of Davao, was sworn into office. Mr. Duterte’s public image has been characterized by bouts of coarse language. He has lashed out at his critics, threatening to withdraw from the United Nations after human rights experts called for a halt to the killings. He joked about the rape of an Australian missionary during the presidential campaign, and he cursed Pope Francis and his entourage for causing huge traffic jams in Manila during the pope’s visit to the Philippines in 2015.'"}, "time": 1742561669.784028}