{"duration": 0.07320952415466309, "input_args": {"text": "'By wmw_admin on April 16, 2011 Zion’s Big Lie \\n“ The First Holocaust ” by Don Heddesheimer is a critical work documenting the continuous Jewish attempts at floating out Holocaust propaganda before, during and after World War One , often invoking the magical “6,000,000” figure and using the term “Holocaust”. Of course, these clever propagandists have since accomplished their goal of establishing the outrageous myth of the Jewish Holocaust™ in the public consciousness following the end of WW2. In large part due to fictional Hollywood movies like “Shindler’s List” from that lying venomous worm, Steven Spielberg. Read The First Holocaust online here . \\nWhy the number “Six Million”? \\nAs documented in the book The First Holocaust , the Zionists have continuously and hysterically attempted to claim that six million Jews were dead, dying or in grave danger in Europe and Russia since the late 1800’s. Any time there was turmoil in Europe, albeit turmoil often instigated by Jews in the first place, prominent Zionist figures and Jewish-controlled media organizations world wide continuously whipped up a frenzy with phony sob stories to get people to feel sorry for Europe’s Jews and donate money to Jewish charities. It turns out that this mythical six million figure, long since discredited even by mainstream Holohoax historians, comes from a Jewish-Talmudic religious myth that says “ye shall return minus six million” or “you shall return to the land of Israel with six million less”, and of course WW2 birthed the modern state of Israel which was established in 1948. Israeli Jews often excuse their systematic genocide of Palestinians and theft of Palestinian lands by bringing up the so-called Holocaust™ of WW2, which any serious researcher and critical thinker knows by now is a fraud of collosal proportions. The Zionists have so much influence that they turned a delusional Jewish religious prophecy into “historical fact”. \\nFrom History & Scriptural Origins of the Six Million Number ; \\n[Quote 1] Jewish prophecies in the Torah require that 6 million Jews must “vanish” before the state of Israel can be formed. “You shall return minus 6 million.” That’s why Tom Segev, an Israeli historian, declared that the “6 million” is an attempt to transform the Holocaust story into state religion. Those six million, according to prophecy, had to disappear in “burning ovens”, which the judicial version of the Holocaust now authenticates. As a matter of fact, Robert B. Goldmann writes: “. . . without the Holocaust, there would be no Jewish State.” A simple consequence: Given six million Jews gassed at Auschwitz who ended up in the “burning ovens” (the Greek word holocaust means burned offerings), therefore, the prophecies have now been “fulfilled” and Israel can become a “legitimate state”. –Unknown [ Quote 2] Regarding the ‘six million’ number you should know the following: In the Hebrew text of the Torah prophesies, one can read “you shall return”. In the text the letter “V” or “VAU” is absent, as Hebrew does not have any numbers; the letter V stands for the number 6. Ben Weintraub, a religious scientist, learned from rabbis that the meaning of the missing letter means the number is ‘6 million’. The prophesy then reads: You will return, but with 6 million less. See Ben Weintraub: “The Holocaust Dogma of Judaism”, Cosmo Publishing, Washington 1995, page 3. The missing 6 million must be so before the Jews can return to the Promised Land. Jahweh sees this as a cleaning of the souls of the sinful people. The Jews must, on the return to the Promised Land, be clean — the cleaning shall be done in burning stokes. –A Correspondent \\nA few examples for your consideration; \\n1900- Jewish leader lets slip the Zionist Holohoax scheme \\nJUNE 11, 1900 – NEW YORK TIMES – page 7 – Rabbi Wise’s Address“There are 6,000,000 living, bleeding, suffering arguments in favor of Zionism.” 1906- \\n1911- \\nMax Nordau , co-founder of the World Zionist Organization together with Theodore Herzl, warns of the “annihilation of six million people” at the Zionist congress in Basle, Switzerland. This was 22 years before Hitler came to power and 3 years before WW1 started. \\n1919- \\nShortly after WW1 Jews claim Holocaust of “six million Jews”. It doesn’t fly too far, nobody buys it. Click to read full article. \\n1921- White Russian patriots gain ground on the Jewish Bolshevik usurpers of their nation. In a vein attempt to disguise their heavy involvement in murderous Bolshevism, Jews reel out the “six million” myth once again. \\n\\n1938- \\nThis is only a small portion of tracts available that point to there being far more to the “Holocaust” than is apparent. These along with many other examples can be found at Zion’s Big Lie: The “Six Million” Myth'"}, "time": 1742562458.3733892}