{"duration": 0.0390627384185791, "input_args": {"text": "'Over the past few months, relations between the United States and the Russian Federation have sunk to their lowest levels since the Cold War with bitter insults and threats being thrown around on both sides of the divide. However, the election of Donald Trump as the President of the United States seems to have brought some change to this dangerous situation.\\n\\n\\nTrump and Putin vow to fight Islamic State together \\n\\nThe president -elect and the Russian President Vladimir Putin have confirmed that they have had a healthy and productive conversation regarding relations between the countries and their shared purpose in tackling global terrorism. The telephone call was instigated by Putin who wanted to express his congratulations to Trump after he took the top job in American politics. During the conversation, Putin is reported to have said that he is ready to pick up a dialogue with officials from the United States “by mutual respect, non-intervention into each other’s internal affairs”.\\n\\nThe two men agreed during their brief telephone call that they would lay the groundwork to bring in a new era of Russia-American cooperation. According to a source, Putin and Trump have agreed to “work to channel bilateral relationships into constructive cooperation, to combine efforts to tackle international terrorism and extremism, and to continue contact by telephone and to work towards meeting in person” . \\n\\n\\nTrump’s office continued with this optimism and placatory stance saying: \"President-elect Trump noted to President Putin that he is very much looking forward to having a strong and enduring relationship with Russia and the people of Russia.\"\\n\\nIn a follow-up statement, a Kremlin spokesperson said that the United States and Russia were planning to work together in both trade and economics as well as the threat posed by international terrorist organizations such as Islamic State. The fight against Islamic State may prove to be of essential importance in the coming months as top Islamic State commanders have already expressed their intention to exploit Donald Trump’s outspoken opinions on ordinary Muslims. Islamic commander Abu Omar Khorasani has said that Trump’s words have played directly into the hands of the terrorist organization. He said; \"This guy is a complete maniac. His utter hate towards Muslims will make our job much easier because we can recruit thousands.\" \\nDisclose TV SOURCE '"}, "time": 1742561701.6870809}