{"duration": 0.03338217735290527, "input_args": {"text": "'Twitter has introduced an account limiting penalty for users that violate the platform’s terms of service. [Users across Twitter are reporting that their accounts are being “limited” as a punishment for the violation of Twitter’s rules. One user posted a screenshot of the notice they received: “Creating a safe environment for people to freely express themselves is critical to the Twitter community, so if behavior that may violate the Twitter rules is detected, certain account features become limited. ”  The notice further explains that due to actions on the user’s account, anyone that wasn’t following their account would be unable to see their tweets for the next 12 hours. Twitter is now your digital daddy. According to @faggotfriday, it’s put him on the naughty step for 12 hours. pic. twitter.   —   Harmful Opinions (@HarmfulOpinions) February 15, 2017,  Another Twitter user also claimed that his account was limited by Twitter for language he used on the platform: &gtautomatically get limited cause I said retard, I’m just considering leaving Twitter, fuck them pic. twitter.   —   🇺🇸 Drybones ム🗽Ὀ (@Drybones5) February 14, 2017,  This new feature seems to be part of Twitter’s recent attempts to curb “abuse” on the platform. The changes include extra measures to stop suspended users from creating new accounts, “safer search results,” and the collapsing of “potentially abusive or   Tweets. ” Twitter was forced to reverse one of their most recent features that removed notifications that alerted users when they were added to Twitter lists. “Being added to a list and knowing what list you were added to was literally the last useful thing about Twitter,” one user explained. Twitter’s stock crashed following the release of the company’s fourth quarter earnings report, and analysts have made grave predictions for the future of the social media company. Of course, Breitbart Senior Editor MILO predicted this last year. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742564526.612815}