{"duration": 0.07987189292907715, "input_args": {"text": "\"Think the world is your oyster? Think again! From top secret HQ's to secretive underground train networks – we run through the Top 10 places you won't be entering anytime soon for love nor money. 10. Bohemian Grove Like something out of a cult thriller film, Bohemian Grove is a 2,700 acre rural location somewhere in Monte Rio, California. The land is owned by private San-Fran based arts club known – surprisingly – as the Bohemian Club. Every summer, the club host a two-week, three weekend camp in the woods for the most powerful men in the world. It all looks a bit weird. 9. Vatican Secret Archive This isn't just any old library, this is a Vatican library! Only a sacred few have access to the vaults – but feat not, if you need to read one of the books (which by the way are owned by the Pope) you can receive the manuscript via email – how very modern! 8. Lascaux Caves – France Found in South West France, Lascaux is complex of caves that are world-renowned for its Palaeolithic cave paintings that are estimated to be over 17,500 years old. Although these caves were once open to the public, they have since been closed to preserve the original artwork. 7. Pine Gap – Australia Known as Australia's equivalent of Area 51. Located in central Australia, and run the by the government and the CIA, it's the only place in the land down under designated as a no fly zone and is used as a monitoring station. What they're monitoring, we don't know. But according to recent news, Pine Gap operate a number of drone strike programmes. 6. Moscow Metro-2 Metro-2 is a secret underground tube system which runs parallel with the public metro system in Moscow. The system was built during the reign of Stalin and was code-named, D-6 by the Russian intelligence organisation – the KGB. When quizzed on this secret underground system, the Federal Security Service of the Russian Federation (FSB) would not confirm or deny its existence. It's rumoured that the underground system dwarfs the public Metro with 4 lines that run between 50-200m deep allowing the Kremlin to connect directly with FSB HQ, the government airport and an underground town at Ramenki. 5. Room 39 North Korea Based in North Korea, Room 39, also known as Bureau 39 is a secretive organisation thats sole purpose is to find ways to obtain foreign currency for Kim Jong-un. Established in 1970, the organisation has been described as the kingpin of North Korea's so-called, ‘court economy’. Although very little has been published on Room 39, it's believed that the organisation has over 20 bank accounts in Switzerland and China and are used solely for the purpose of money laundering and other illegal transactions. It has also been reported that the organisation is involved in drug smuggling and illicit weapon sales. What is known, is that the secretive group have over 130 trading companies under its jurisdiction which are controlled by Kim Jong-un. If you ever fancy popping over to North Korean and attempting to enter the organisations HQ, you need to head towards the Workers Party building in Pyongyang. 4. Mezghorye, Russia This place has been reported as Russia's secret nuclear missile site. There are two battalions permanently stationed here to ward off visitors. The base contains automatic ballistic missiles which can be remotely activated in the event of a nuclear strike which is detected by seismic, light and pressure sensors. 3. Disney Club 33 Exclusive Club Located at Disneyland, Florida, this fairly unobtrusive looking front door is actually the entrance to a highly exclusive members only club. How do I get in? I hear you cry. Well firstly, you need to locate it. Without giving too much away, head to New Orleans Square and look for the Blue Bayou. Getting in won't be as easy – the club is not open to the public. However, members, which include Presidents of the United States, business leaders and actors – can bring friends and associates along, so you better start networking! 2. Area 51 Probably the worst kept secret, Area 51 is the alias for a military base that is located in Nevada – around 80 miles north-west of downtown Las Vegas. In the centre of the base is a large military airfield. According to insiders, the base's main purpose is research and development of experimental aircrafts and weaponry. What's bizarre is that the U.S Government doesn't acknowledge it's existence – adding fuel to conspiracy theories that the base is used for analysis of UFO's and aliens or is that what they want you to think? 1. Google Data Center Home of big brother. this is as heavily guarded as Area 51, Google's first data center is a high security location with trillions of records of OUR DATA. Related:\""}, "time": 1742561640.3273437}