{"duration": 0.08387422561645508, "input_args": {"text": "'CNN reported that sea records, in the Arctic and Antarctic, were at an all-time low in early October 2016, since scientist began to keep track. Research Scientist Walt Meier said it seems as though the human race is witnessing the Arctic and Antarctic Seas at record low levels for the first time on record, which is the argument for climate change.\\nMeier works for the Cryospheric Sciences Laboratory, at NASA’s Goddard Space Flight Center. He has also traced sea ice data since 1979.\\nRecord low sea ice data is not new to the Arctic . However, this is a shocking turn of events for the Antarctic. Although the sea ice in the Arctic has been melting over the past decade, the sea ice in the Southern Hemisphere has been increasing.\\nThe extent of the Antarctic Sea ice reached a record high each year from 2012 to 2014. Climate change critics indicated that the ice accumulation in the South Pole is evidence that climate change is not occurring. However, the scientific community has claimed that the process is caused by flows and differences in the hemisphere.\\nAdditionally, Meir said that it is too early to know if the recent and rapid decline in the Antarctic Sea is going to occur regularly, such as the rapid decline in the Arctic. He concluded that the decrease in the sea ice of the Southern Hemisphere defies the argument against climate change because the ice in Antarctica is rising.\\nHowever, Skeptical Science stated that the climate has changed before and is always changing. In the past, the world experienced ice ages and warmer periods. In the previous warmer times, alligators were found in Spitzbergen.\\nIn the last 700,0000 years, ice ages have occurred in a hundred-thousand-year cycle. There has been a warmer climate than the present one, regardless of greenhouse gasses being lower than they are now. In recent history, there have been medieval warm periods and then a little ice age, which is the argument against climate change.\\nGreenhouse gasses were involved in most of the climate changes throughout world history. When they were reduced, the Earth became colder. However, when they were increased, the global climate grew warmer. When the greenhouse gasses rose rapidly, the global warming that resulted became highly disruptive. The drastically warmer climate also caused mass extinctions.\\nIn certain times, the increase in greenhouse gasses caused life to flourish, such as the Cretaceous and Eocene Periods. The gasses were in balance with the carbon in the oceans and with the weathering of the rocks. Ocean chemistry, atmospheric gasses, and life had millions of years to adjust to those levels.\\nHowever, there were several moments, in the history of the planet, where the climate jumped abruptly. Just as the climate is rapidly changing today. The extreme change was caused by rapid greenhouse gas emissions.\\nSkeptical Science stated that the climate was changing before humans lived. Scientists also claimed that the cause was from increased carbon emissions, such as those experienced today. They concluded that the emissions are destructive to life on Earth.\\nClimate Neutral Now is a global community of organizations that is committed to improving the climate by the second half of the 21st century. By the end of 2015, the world joined together to sign the Paris Agreement. Climate Neutral reported that this was a global climate change agreement that placed the foundation for a low carbon future.\\nHowever, in order to make the environment livable for the future, individuals, companies, and governments must be able to work together to gain climate neutrality. The Paris Agreement is a result of the argument for climate change.\\nOpinion News by John A. Federico\\nEdited by Jeanette Smith\\nSources:\\nCNN: Amid higher global temperatures, sea ice at record lows at poles\\nSkeptical Science: What does past climate change tell us about global warming?\\nClimate Neutral: Go Climate Neutral Now\\nFeatured Image Courtesy of Berkeley Lab’s Flickr Page – Creative Commons License    Antarctic Sea , Arctic Sea , Climate Change , ice , spot'"}, "time": 1742563264.264409}