{"duration": 0.02568507194519043, "input_args": {"text": "'A Maryland school official was fired from her job after she corrected a student’s spelling over Twitter. [Frederick County Public Schools has fired employee Katie Nash after she stirred up attention on how she ran the district’s Twitter feed last week, the Frederick News Post reported.  On Jan. 5, a student tweeted to the FCPS Twitter account @FCPSMaryland and said, “close school tammarow PLEASE. ” Several hours later, Frederick County Public Schools Social Media Manager Katie Nash replied, “but then how would you learn how to spell ‘tomorrow?’ :)” The response drew lots of attention and backlash over social media as thousands of people liked and retweeted the post. She eventually became the subject of a hashtag, #KatiefromFCPS, and later #freekatie when WHAG reported that her Twitter was taken away from her. Nash said she understands why she was fired and said she doesn’t want to be a “distraction” to the school system, but thought her employer would have provided some suggestions on how to improve her job. “As a new employee, I think I sort of would have expected that there would have been some counseling or some suggestions on how to improve,” she said. Nash had decided to take a more playful tone on the school’s Twitter account, citing student feedback. “We had received feedback from some students in a focus group that our tweeting was a bit flat, they were looking for some more engagement,” Nash said. “They were looking for us to tweet back at them and I really took that to heart because I know that I am a little bit older and maybe not as hip as some of the students are, so I took that to heart and I took that feedback in. ” The student later said that he didn’t take the tweet personally, WGHP reported. Michael Doerrer, the Director of Communications, Community Engagement and Marketing with FCPS, said the school gave a personal apology to the student, WHAG reported.'"}, "time": 1742561870.7348983}