{"duration": 0.042540550231933594, "input_args": {"text": "'  BOMBSHELL: Crooked Hillary Sent Classified Info To Chelsea Under Fake Name ‘Diane Reynolds’ But perhaps the most significant part of the email is that Clinton forwarded classified information to her daughter, who is and was a private citizen with no government role and no apparent security clearances. It is unclear when or why Clinton deleted the email.   Crooked Hillary Clinton deleted a 2009 email in which she forwarded classified information to her daughter, Chelsea. \\nEDITOR’S NOTE: The State Department today released recovered emails from Crooked Hillary’s illegal private email server, and guess what? It contained classified and confidential information. Who did she send it to? She sent it to her daughter, who was no clearance or authorization of any kind to view or receive such communications. Now do you see why Crooked Hillary deleted those 33,000 emails so no one could see them (she thought)? And oh, by the way, Chelsea used the fake name of Diane Reynolds to receive the illegally -sent emails. Think they knew they were breaking the law? Yep. \\nThe email was released on Friday by the State Department. It is one of thousands of emails recovered by the FBI from Clinton’s private email server. \\nThe Dec. 20, 2009 email chain , entitled “Update,” started with a message from Michael Froman, who served as a deputy assistant to President Obama and deputy national security adviser for international economic affairs. \\nThe email, which is redacted because it contains information classified as “Confidential,” was sent to Jake Sullivan, Clinton’s foreign policy adviser at the State Department, and several Obama aides. Sullivan sent it to Hillary Clinton who then forwarded it to Chelsea, who emailed under the pseudonym “Diane Reynolds.” \\nAll of the text in the body portion of the classified emails is redacted because it contains foreign government information. \\nThe State Department labeled the email a “near duplicate,” indicating that it was mostly similar to other emails that the agency has released from the trove of emails that Clinton turned over in Dec. 2014. Clinton did not delete other responses she made to others on the email thread. \\n“Wow — you can’t make this up — sorry to have missed all of that! Let me know if you learn anything else,” she wrote to Sullivan. The State Department released that portion of the email conversation in February. CHELSEA CLINTON USED THE PSEUDONYM OF ‘DIANE REYNOLDS’ TO RECEIVE ILLEGAL EMAILS \\nBut perhaps the most significant part of the email is that Clinton forwarded classified information to her daughter, who is and was a private citizen with no government role and no apparent security clearances. \\nIt is unclear when or why Clinton deleted the email. She gave the State Department around 30,000 emails she claimed were related to her State Department work. She deleted a similar number claiming they were personal and dealt with yoga routines, food recipes and Chelsea’s wedding. \\nFBI director James Comey said in July that investigators recovered several thousand work-related emails from Clinton’s server. The batch of emails released Friday are from that recovered trove. source \\n '"}, "time": 1742562157.0454404}