{"duration": 0.0724332332611084, "input_args": {"text": "'Tesla and SpaceX CEO Elon Musk suffered huge   after he lit up the blogosphere by tweeting that former ExxonMobil CEO Rex Tillerson “has the potential to be an excellent Sec of State. ”[@TheEconomist This may sound surprising coming from me, but I agree with The Economist. Rex Tillerson has the potential to be an excellent Sec of State.  —   Elon Musk (@elonmusk) January 24, 2017,   Musk responded to the January 24 tweet by The Economist that Tillerson, as U. S. Secretary of State would have the “integrity to talk sense to his boss,” by supportively commenting, “This may sound surprising coming from me, but I agree with The Economist. Rex Tillerson has the potential to be an excellent Sec of State. ” The blogosphere exploded as the left’s social justice warriors lashed out at Musk with viciously colorful language that Musk was a fraud and a sellout to Trump and to Russian President Vladimir Putin. Rumors also flew that Musk was angling for a new carbon tax in exchange for his support of Trump. The viral tech blog Gizmodo, in describing Musk as a “tycoon using his influence to innovate towards a   future powered by clean energy and complete with human cities on Mars” ran an article about how shocking was that a disruptive tech entrepreneur like Musk could support a   fossil fuel leader like Tillerson, who once described the concept of fully electric vehicles as a daunting pipe dream. Musk is one of the few Silicon Valley tech CEOs who normally avoids commenting on most political issues. That may be due to his masterful ability to amass of $13. 2 billion net worth, despite almost never actually making a profit in the companies that he operates. Arguably, Musk’s comparative business advantage over other CEOs has been his unrivaled ability to convince federal, state and local Democrat and Republican elected officials to provide a dizzying array of almost $5 billion in taxpayer subsidies so that Musk can pursue his adventures in space travel, solar panels and electric cars. Musk is fully aware that Tillerson is no neophyte rube in the technological and political controversies swirling around Climate Change. The Rockefeller Family Fund, formerly the dominant ExxonMobil shareholder, announced last year it would divest from fossil fuels and claimed that Exxon was misleading investors about the risks of climate change. Shortly thereafter, the Securities and Exchange Commission ruled that ExxonMobil was required to allow shareholders to vote on a climate change resolution. Silicon Valley, also referred to as the Valley of the Democrats, seemed stunned that Musk would respond positively to Tillerson. But Musk told to Bloomberg Tech’s Dana Hull that “Rex is an exceptionally competent executive, understands geopolitics and knows how to win for his team. His team is now the USA. ” Musk added that was a good reason to give Tillerson the “benefit of the doubt unless his actions prove otherwise. ” Musk, who once said Trump was “not the right guy” to be president of the United States, quickly triangulated after Trump’s election triumph to having himself named to the new president’s business advisory team. He was also one of the 13 tech executives  —   along with Apple CEO Tim Cook, Facebook COO Sheryl Sandberg and Alphabet CEO Larry Page  —   to attend Trump’s   forum at Trump Tower in  . With the Rasmussen Reports daily Presidential Tracking Poll for January 26 showing that President Trump has caught former President Obama at a 59% approval rating with likely U. S. voters, other Silicon Valley CEOs may find it in their business interest to join Musk in flouting the Silicon Valley political orthodoxy.'"}, "time": 1742563839.2557278}