{"duration": 0.04009270668029785, "input_args": {"text": "'Abby Martin Exposes What Hillary Clinton Really Represents ‹ › Since 2011, VNN has operated as part of the Veterans Today Network ; a group that operates over 50 plus media, information and service online sites for U.S. Military Veterans. Clinton Campaign Memo: “Let’s Troll Reddit” By VNN on October 25, 2016 If Donald Trump Wins The Election, It Will Be The Biggest Miracle In U.S. Political History \\nInvestmentWatch \\nA confidential memo from a Democratic Super PAC details a Clinton campaign strategy of trolling sites such as Reddit in order to cause “digital disruption”. \\nAccording to a Correct The Record memo, Clinton campaigners are being urged to disrupt and dominate the World Wide Web in order to stifle growing pro-Trump sentiment prevalent on sites such as Reddit . \\nThe memo reads: \\nWe are entering the final phase of the election and this is an all-hands-on-deck full-spectrum push for digital disruption and dominance. We are facing a decentralized leaderless emergent structure that can only be countered by our numbers with discipline and tactics. As such, these will be the scripts for Week 0 (through Week 3 to the vote) \\nREDDIT \\nSmart, but paranoid \\nReddit is an important clearinghouse for Trump-momentum and intellectual capital. We must maintain dominance on promotion/demotion of stories and isolation of Trump-positive threads. \\nWe are working to compromise moderators to improve our ability but will “operationalize” them in the final week of the campaign to try to make the board “go dark.” \\nReddit is more intellectually rigorous than the chans and has fewer low-social-capital (loser) members (including many far-right non-American posters). We should be careful not to trigger moderator red-lines. Proscribed disruption vectors. \\nIf Donald Trump Wins The Election, It Will Be The Biggest Miracle In U.S. Political History Read More'"}, "time": 1742561747.1128612}