{"duration": 0.01605701446533203, "input_args": {"text": "'Joint Drills Between China, Saudis To ‘Fight Terrorism’ 10/31/2016 \\nSPUTNIK NEWS \\nChina is improving its Special Forces combat capability to protect national interests abroad. Sputnik spoke with Russian experts about the first antiterrorist drills of the Special Forces of China and Saudi Arabia. \\nThe joint drills demonstrating combat skills and tactics took place for two weeks on the ground, in the vicinity of the Chinese city of Chungqing. \\nThe drills came to an end on Thursday and according to reports, 25 members of the Special Forces from each side took part in the exercises. Among the observers were Afghan military experts, who drew attention to the training that was focused on hostage rescue and improvement of overall combat training. \\nSaudi Arabia is the first country in the Arab East with whom China has held bilateral military exercises. \\nExpert from the Diplomatic Academy of China, Gao Fei, believes that it is natural for China and Saudi Arabia to have a partnership in this sphere. \\n“Saudi Arabia is a major regional power and the largest oil-producing country. It competes with Russia for the title of the world’s leading oil producer. In regard to oil reserves, it also holds the first place in the world,” Fei said. \\nHe further said that the country plays an important role in economics, politics and security in the whole region. In short, Saudi Arabia is an influential regional power. \\nAccording to Fei, “Last month, China surpassed the US as world’s largest importer of oil. Cooperation between China and Saudi Arabia as an importer and supplier of oil shows mutual benefit and common interests.” \\nIn addition, China is already a major player in the international arena; its diplomacy has its own specifics. It not only gives meaning to its own interests, but also in international affairs takes the role of the responsible power. \\nThe expert further said that in the long term “cooperation between China and Saudi Arabia will contribute to solving existing global problems, form a new world order, help search for consensus on specific issues and contribute to expansion joint interest.” \\nThe choice of Saudi Arabia as China’s partner to conduct anti-terrorist exercises is not surprising, according to an expert at the Russian Institute for Strategic Studies, Ajdar Kuratov. \\nKuratov said that Saudi Arabia is the main economic partner of China in the Middle East, a region where growth of China’s presence is particularly noticeable. \\nChina’s leadership is likely quite concerned with terrorism against the country and its citizens. Cases such as hostage taking on airplanes and other public places and attacks on public buildings are a big concern for the country.'"}, "time": 1742628529.218394}