{"duration": 1.6929662227630615, "input_args": {"text": "'LONDON  —   Who knew that déjà vu could smell this fresh all over again? On paper, the happy new musical “Groundhog Day,” which opened on Tuesday night at the Old Vic Theater here, seemed like one of those shows that elicit instant groans of “been there, done that” among jaded theatergoers. For starters, “Groundhog Day” is based on a film about someone (a jaded someone, just like you, groaners of little faith) becoming caught in time and being forced to relive the same day over and over and over again. Which feels like dangerous ground for a musical that is the latest in a long,   sporadically successful line of musicals based on popular movies that hardly seemed to require song sheets to fulfill their inner nature. In other words, would audiences for “Groundhog Day” feel they were reliving their traumatic memories of recent    clunkers like “Rocky,” based on Sylvester Stallone’s 1976 flick about an underdog boxer, or “Ghost,” a reworking of the 1990 flick about an underdog dead man? More scary portents: “Groundhog Day” stars Andy Karl (who played the title role in the musical “Rocky”) and is directed by Matthew Warchus (who did the same, er, honors, on “Ghost”). Yet much in the manner of its improbable romantic “Twilight Zone”  style plot, “Groundhog Day” seems guaranteed to have the skeptics waving (and using) white handkerchiefs long before its final curtain, while transforming Mr. Karl into the     musical star he has long deserved to be. Featuring a creative team that includes the book writer Danny Rubin (who wrote the “Groundhog Day” screenplay with Harold Ramis) and the songwriter Tim Minchin (the fabulous “Matilda the Musical”) this bright whirligig of a show is a shrewd juggler of contradictions. It is cool (as in hip) and warm (as in cuddly) it is spiky and sentimental. And it transforms its perceived weaknesses into strengths in ways that should disarm even veteran  . You know that whole    element of the plot, wherein everything is repeated ad infinitum? Isn’t that what often drives you crazy about musicals, having to listen to the same damn melodies and watch the same dance steps over and over? Well, Mr. Warchus and company know all about those fears and make cunningly sadistic use of them. As we watch our hero, the professionally snarky weather reporter Phil Connors (Mr. Karl) having to   the same events, the claustrophobia is heightened by his being surrounded by a chorus forever moving and musicalizing in the same monotonously, relentlessly peppy styles. “Aargh!” you think. “Somebody please get me out of this musical, stat!” Except only a part of you feels that way, because Mr. Karl is doing the suffering for you, in a manner that makes you both root for his deliverance and hope he’s stuck forever in purgatory (partly because he deserves to be, but partly because he’s so entertaining in limbo). About Phil’s special quandary: It’s the same as it was in the 1993 movie, one of the most unlikely     to become a popular hit, which was directed by Mr. Ramis and starred Bill Murray as Phil. As in the film, Phil, a   weatherman, is sent on assignment to Punxsutawney, Pa. on Feb. 2 to witness the annual appearance of the town’s resident   groundhog. Phil feels nothing but contempt for the ritual, the town and everyone who celebrates it. He is to Groundhog Day what Scrooge is to Christmas but with a greater appetite for partying. Anyway, after a   of reliving and rearranging that single day, and behaving as badly (and as hilariously) as eternity allows, Phil starts to wax philosophical and stop and smell the snowflakes and  —   could it be?  —   even be ready to take a chance on love with one Rita Hansen (Carlyss Peer in the part created by Andie MacDowell) the   producer he initially dismissed as boring. “Aargh!” you think. “Somebody please get me out of this Hallmark card!” But for the most part, this production manages to balance the sweet and the sour to charming,   effect, starting with Rob Howell’s slightly askew   Americana set and costumes. As he demonstrated in his score (with Dennis Kelly) for “Matilda,” Mr. Minchin is an inspired mixmaster of darkness and brightness. Even this show’s early numbers, extolling the homespun virtues of   life with harmonic “aahs” and folksy bluegrass chords, have a depressive undertow. And when Mr. Minchin feels like signaling angst, he brings on the electric guitars and vocals for Mr. Karl that bring to mind Michael Stipe losing his religion. Mr. Karl imbues Phil with all shades of sarcasm and kindness and what falls in between with equal conviction. If in “Rocky,” he seemed to be channeling Sylvester Stallone (and what choice did he have?) here he is by no means merely imitating Mr. Murray, which would have been a disaster. Instead, he’s translating the essence of Mr. Murray’s lazy dryness into the   energy of musicals. He makes that transition so joyously and persuasively I did wonder what the show might be like without Mr. Karl. His supporting cast is all more than adequate, and they all sound convincingly American. But they lack the sort of vibrant individuality that Mr. Karl could use to make sparks with. This includes the attractive, willfully bland Ms. Peer as the   producer, who essentially functions as straight woman to Mr. Karl’s antic joker. Her character, Rita, has been given some emotionally expansive solos (and duets) that hint at a quirkier soul within, and I kept thinking about what a more idiosyncratic actress could have done with the part. (Remember what Annaleigh Ashford made of the patient factory girl in “Kinky Boots”?) More could be made, too, of the solos of other Punxsutawney citizens, who express their own fears of   treadmill lives. As it is, their numbers seem to float in at random (though I loved Phil’s   trio with two moronic barflies). Peter Darling’s choreography still feels oddly unfinished, and the big   sequence in the second act could definitely use sharpening and clarification. But even given those caveats, I grinned pretty much all the way through “Groundhog Day,” unexpectedly happy to be stuck with Phil in Punxsutawney (and please never make me spell that again).'"}, "time": 1742563937.7321243}