{"duration": 0.08660364151000977, "input_args": {"text": "'Montag, 7. November 2016 Chaos bei Jochen Schweizer: Beschenkte Person will tatsächlich Erlebnisgutschein einlösen München (dpo) - Helle Aufregung in der Firmenzentrale der Jochen Schweizer GmbH: Dort hat heute erstmals in der Firmengeschichte ein Kunde versucht einen Geschenkgutschein tatsächlich einzulösen. Noch sind die anwesenden Mitarbeiter ratlos, wie sie mit der kuriosen Anfrage umgehen sollen. Mehrere stehen unter Schock. \"Was sollen wir nur tun? Was machen wir denn jetzt?\", fragt Kundenmanagerin Erika Schwenninger (38) verzweifelt. \"Hat schon jemand den Chef erreichen können?\" Sie wirkt sichtlich angeschlagen von der bizarren Situation, in der sie sich als Angestellte bei Jochen Schweizer noch nie befunden hat. Seit über 12 Jahren vertreibt das Unternehmen hauptsächlich über das Internet Geschenkgutscheine für \"Events\" und \"Erlebnisse\". Die Gutscheine sind ein beliebtes Präsent zu Geburtstagen oder anderen Gelegenheiten und kommen insbesondere dann zum Einsatz, wenn die Schenkenden keine Ideen für ein richtiges Geschenk haben. Die \"Erlebnisse\" sind dabei so abschreckend gewählt (\"Tandem-Bungee\", \"Dampflok selber fahren bei Lutherstadt Eisleben\"), dass normalerweise niemand ernsthaft erwägt, die Gutscheine einzulösen. Er stürzt mit seiner Gier ein Unternehmen in die Kriese: Thorsten Koschwitz Auch im Fall von Thorsten Koschwitz sei daher nicht mit Komplikationen zu rechnen gewesen. Der Hannoveraner hatte den Gutschein für \"Auto-Crashen mit dem Monster-Truck im Wert von 349,90 Euro\" im September zu seinem 32. Geburtstag bekommen. Dass er nun darauf besteht, tatsächlich mit einem riesigen Truck Autos zerstören zu dürfen, stellt die Firma vor schier unlösbare Probleme. \"Was glaubt der Mann denn, wo wir nun so einen Truck hernehmen sollen? Ganz zu schweigen von den zu zerstörenden Autos\", führt Erika Schwenninger aus. \"Und das Ganze für maximal 349,90 Euro! Und was ist, wenn noch mehr Menschen auf die Idee kommen, ihre Gutscheine einzulösen? Dann können wir den Laden dicht machen!\" Schwenninger bricht in Tränen aus, die Sorge um den Verlust ihres Arbeitsplatzes ist groß. Das kann doch niemand ernsthaft wollen. Denn: Jochen Schweizer lebt - ebenso wie andere ähnliche Gutschein-Portale - davon, ein Gefühl zu verschenken, Nervenkitzel auf Papier. Die Beschenkten soll beim Blick auf den Titel des Geschenks Gänsehaut überkommen, der darauf eingetragene Euro-Betrag soll zeigen, wie viel der Beschenkte seinen Freunden wert ist. Die Einnahmen durch die Gutscheinverkäufe refinanzieren das Personal des Unternehmens, den Firmensitz, die aufwändige Internetpräsenz und die teure Werbung. Für die Umsetzung echter Events ist in der Kalkulation kein Platz. Darum hat nun Jochen Schweizer persönlich Thorsten Koschwitz ein Gespräch angeboten. Der Firmengründer will den jungen Mann um Verständnis bitten und zu einem kostengünstigeren Erlebnis wie \"Igel-Crashen mit dem Golf II\" oder \"Nüsse-Crashen mit dem Nussknacker\" überreden. Um weitere Missverständnisse wie im Falle von Thorsten Koschwitz auszuschließen, sollen Jochen-Schweizer-Gutscheine zudem künftig immer folgende Fußnote beinhalten: \"Gutschein ist nur zum Schenken bestimmt und kann nicht eingelöst werden.\" adg, dan, ssi; Foto unten: Jot Powers , CC BY-SA 2.0 Artikel teilen:'"}, "time": 1742561968.4738145}