{"duration": 0.06688928604125977, "input_args": {"text": "'Defying a new Swedish law that prohibits full face coverings at public events, such as political rallies and sports matches, keen football (soccer) fans donned Islamic garments at the game instead. [Members of the   AIK Ultras, the dedicated fans of Stockholm’s Allmänna Idrottsklubben (AIK) team, also unfurled a giant banner at the match in Sweden Sunday thanking the law for a religious provision loophole.  Swedish law specifically bans people in “a public place attending a public meeting under the Public Order Act” if there is a disturbance of the peace, or “immediate danger of such a breach”  —   making full face coverings generally illegal at football games. Those breaking the law can be fined or imprisoned for up to six months. Yet understanding of particular religious minorities in Sweden means the second paragraph of the face covering law created an exception: “The ban does not apply to covering the face for religious reasons. ” La Suède ayant interdit le port de masques et cagoules dans les stades, les ultras portent désormais des niqabs  …    . dont le port est légal. pic. twitter.   —   PassionFootball Club (@PassionFootClub) April 4, 2017,  Making the most of the new law intended to curb antisocial behaviour at football games, large numbers of AIK Ultra members were seen at the game wearing niqabs  —   the full face covering cloth which forms part of the Islamic hijab. The colossal banner held by fans in the stands made reference to the Swedish politician who introduced the ban, Anders Ygeman. It read: “AIK’s ultras are well meaning, we’re now wearing masks for religious reasons. Freedom for ultras is the goal, thanks Ygeman for the loophole. ” Speaking to bestselling Swedish newspaper Aftonbladet’s Sportbladet section, Minister of Home Affairs Ygeman said he found the episode “pretty funny” and said the fans clearly had a sense of humour  —   but said if fans continued to use the religious exception the courts may decide the legal loophole doesn’t apply on a    basis if they found   men up before them. The minister confirmed that police would not require football fans turning up to matches in niqabs to prove their religion on the spot.  While the Swedish mask ban was introduced to deal with particular problems, including violence at matches, this is not the first time European football fans have invoked Islam to make political points. Breitbart London reported in 2015 when Polish football fans unfurled a giant   ‘stand and defend Christianity’ banner at a premier league match. Running to thousands of square feet, the banner depicted an armed crusader standing over Europe repelling migrant boats carrying terrorists.  '"}, "time": 1742564149.8521388}