{"duration": 0.09231114387512207, "input_args": {"text": "'Email \\nHillary Clinton may not be completely in the clear on her use of a private, unsecured e-mail server used to send and receive classified information during her time as secretary of state. FBI Director James Comey announced on Friday — in a letter to high-ranking members of Congress — that the FBI is reopening the investigation on the basis of new information. \\nThe letter was addressed to Senator Richard Burr (R-N.C.), chairman, Select Committee on Intelligence; Senator Charles “Chuck” Grassley (R-Iowa), chairman, Committee on the Judiciary; Senator Richard Shelby (R-Ala.), chairman, Committee on Appropriations and Subcommittee on Commerce, Justice, Science, and related Agencies; Senator Ron Johnson (R-Wis.), chairman, Committee on Homeland Security and Governmental Affairs; Representative Devin Nunes (R-Calif.), chairman, Permanent Select Committee on Intelligence; Representative Robert “Bob” Goodlatte (R-Va.), chairman, Committee on the Judiciary; Representative John Culberson (R-Texas), chairman, Committee on Appropriations and Subcommittee on Commerce, Justice, Science, and related Agencies; and Representative Jayson Chaffetz (R-Utah), chairman, Committee on Oversight and Government Reform. \\nComey — who declined to recommend an indictment against Clinton after the conclusion of the previous investigation in July — wrote to the chairmen of these committees to say that “in connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation” of Clinton. Due to this new information, Comey wrote that he believes “it is important to update your Committees about our efforts in light of my previous testimony” regarding the investigation into whether Clinton knowingly broke the law. \\nComey did not say what the “unrelated case” is or how it is connected to Clinton’s e-mails. He did say that he had been briefed about the newly discovered e-mails on Thursday and wrote, “I agree that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.” CNN’s Evan Perez reported that law enforcement sources say the new e-mails are not from to WikiLeaks and are not about the Clinton Foundation. \\nIn response to the letter, Representative Bob Goodlatte released a statement which said: The FBI’s decision to reopen its investigation into Secretary Clinton reinforces what the House Judiciary Committee has been saying for months: the more we learn about Secretary Clinton’s use of a private email server, the clearer it becomes that she and her associates committed wrongdoing and jeopardized national security. Now that the FBI has reopened the matter, it must conduct the investigation with impartiality and thoroughness. The American people deserve no less and no one should be above the law. \\nJason Chaffetz tweeted about the letter, saying, “FBI Dir just informed me, \"The FBI has learned of the existence of emails that appear to be pertinent to the investigation.\" Case reopened.” \\nThe Clinton campaign claimed not to have had any previous knowledge of this most recent development. A Clinton aide reportedly told CNN, “We’re learning about this just like you all are.” That sounds strangely similar to President Obama’s claim that he learned about Clinton’s private e-mail server from news reports — a claim the White House later had to walk back. \\nCaught off guard, Clinton’s running mate, Tim Kaine, was asked about the reopened investigation while campaigning in Tallahassee, Florida. The only response he offered to reporters was, “Got to read a little more, got to read a little more.” \\nDonald Trump — who told Clinton in the second presidential debate that if he is elected, he will have her investigated and that the conclusion is “you’d be in jail.” — seized the opportunity to make a statement before giving a prepared speech in Manchester, New Hampshire. He told the audience, “They are reopening the case into her criminal and illegal conduct that threatens the security of the United States,” adding, “We must not let her take her criminal scheme into the Oval Office.” \\nComey was careful in his letter to say that “the FBI cannot yet assess whether or not this material may be significant,” adding that “I cannot predict how long it will take us to complete this additional work.” This new phase of the investigation may — in keeping with a Clinton family tradition — continue past the election, and — if Clinton is elected — result in impeachment proceedings against her. \\nPhoto of Hillary Clinton: AP Images Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562394.6422932}