{"duration": 0.09208059310913086, "input_args": {"text": "'\\nWhen I was reading the news this morning, I discovered a quote that was so very ironic, I wanted to think that it was satire.\\nBut it wasn’t.\\nThe Clinton campaign had the audacity to say that the FBI has double standards.\\n“It is impossible to view this as anything less than a blatant double standard,” Clinton campaign manager Robby Mook said. He also called on Mr Comey to “immediately explain this incongruence and apply the same standard to Donald Trump’s associates as he has applied to Hillary Clinton’s.” ( source )\\nBWHAHAHA.\\nLOL.\\nROTFL.\\nExcuse me, I can’t stop laughing…a nervous, manic kind of laughter that also makes one of my eyes twitch.\\nWhy?\\nThis is coming from the spokesperson of a woman who is trying to pull in young voters and calling them “F*&$ing dumb” behind their backs. This is coming from the spokesperson of a woman who is trying to connect with the American people at the same time as saying she has no clue about real life due to her background. This is coming from the spokesperson of a woman who preaches honesty and integrity and practices neither, saying in a paid speech that sometimes you have to lie. I have never heard a more ridiculous, two-faced audacious comment in my whole life. And considering I write about politics, I’ve heard a lot over the years.\\nSpeaking of double standards, did you hear the latest about the re-opened email investigation? \\nThe incestuous connection between the Clinton campaign and the Department of Justice continues. The person in charge of the new investigation is none other than Peter Kadzik. Kadzik has a long history with both the Clinton family and campaign manager John Podesta.\\nAnd by long, I mean…\\nKadzik represented John Podesta after he perjured himself during the Monica Lewinsky case Kadzik lobbied for Marc Rich, a fugitive that was pardoned by then-President Bill Clinton Kadzik led the effort to nominate Loretta Lynch as Attorney General Kadzik had a celebratory dinner with Podesta the day after the Benghazi hearings Kadzik denied a request from Republicans to appoint special counsel in the last Clinton email investigation Kadzik and Podesta appear from Wikileaks to be the best of friends, celebrating birthdays and other occasions together Those are some of the links between Kadzik and Clintonland – check out this very thorough report on Zero Hedge for all of the details.\\nCan you imagine the hue and cry if Donald Trump’s nearest and dearest ran the investigation about his alleged links with Russia? How is this possibly okay?\\nOpen letter to Peter Kadzik \\nAfter stumbling across Kadzik’s email address in an online group (by the way, it’s pkadzik@gmail.com – don’t they every learn about email security?) I sent this very polite email suggesting that he recuse himself from the investigation.\\nDear Mr. Kadzik:\\nWhen I learned that you were to be the person in charge of the investigation into Huma Abedin and her emails, I was curious to learn about your connections. With just a teeny tiny bit of Googling, I was aghast to discover that you have a close friendship with John Podesta, Hillary Clinton’s campaign manager.I was further discomfited by the fact that you have direct connections with the Obamas and the Clintons themselves.\\nWhile I’m sure you take your job very seriously, it seems to me a direct conflict of interest for you to handle this investigation. I strongly urge you to do the right thing and recuse yourself from overseeing this investigation. If you find the emails without merit, there was always be a cloud over your findings due to your close connections with the Clintons, President Obama, and Mrs. Clinton’s campaign.\\nPlease hand this over to independent investigators who can do this job without the appearance of bias.\\nSincerely,\\nDaisy Luther\\nSurprisingly, I’ve had no response to my courteous request. He’s probably out there busily finding a non-biased replacement. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Daisy Luther of DaisyLuther.com . '"}, "time": 1742561908.358984}