{"duration": 0.06371068954467773, "input_args": {"text": "'The International Olympic Committee has tried to discourage   by the news media and others during the Rio Games  —   good luck with that  —   but this hasn’t stopped the people of the internet from spotting a good meme when they see one. Behold, #PhelpsFace. Phelps, the most successful and possibly the most scrutinized Olympian in history, was caught making a grimly determined face that only the internet could love as he prepped Monday for his semifinal in the   butterfly. What was Phelps thinking while wrapped in his   gear? Perhaps he was trying to telegraph a message to his rivals: “Don’t mess with my medal count, or I will destroy you. ” Such a telepathic challenge might have been meant especially for Chad le Clos of South Africa, who was dancing and jiggling just a few feet away like one of those deflated noodle men often found dancing in front of used car dealerships. In an interview with NBC after his heat, Phelps claimed he had been thinking about “nothing” as le Clos wriggled and shadowboxed in front of him. But the two swimmers have an interesting    history. At the 2012 Games in London, le Clos handed Phelps his first international defeat in a decade, in the   butterfly. Le Clos later said that watching Phelps collect a record eight gold medals in Beijing in 2008 had been a major source of inspiration as he developed his own program. “He was the reason I swam the butterfly,” le Clos told The New York Times recently. “It’s not a joke. ” Only hours old, images of Phelps’s face seemed to have the potential to go down in the history of ridiculous sports memes. (Somewhere, Michael Jordan is sighing with relief.) Fans even imagined what Phelps was listening to on his headphones: Could it be Eminem, Papa Roach or Alanis Morissette? Though the Games are only a few days in, followers of the United States swim team have been spoiled by a group of athletes who seem at home expressing themselves for the cameras. First, there was the car pool karaoke episode. Then Lilly King directed a   finger wag at one of her competitors, Yulia Efimova of Russia, who had failed a test for meldonium. King then made her most definitive statement in the pool, beating Efimova in the   breaststroke and setting an Olympic record. For his part, Phelps told NBC that he had been “trying to not really even look at” le Clos’s gyrating. “He does his thing, I do mine,” Phelps said. The rivals were facing each other Tuesday in the finals of the   butterfly. Expect   material.'"}, "time": 1742562409.7151625}