{"duration": 0.6857426166534424, "input_args": {"text": "'Florida Republican Sen. Marco Rubio announced Monday he will vote to confirm former Exxon CEO Rex Tillerson as Secretary of State, providing Tillerson with a critical vote to get him through the Senate Foreign Relations Committee. [“I believe the president is entitled to significant deference when it comes to his choices for the cabinet,” Rubio wrote in a Facebook post. “I also believe given the uncertainty surrounding the future direction of our foreign policy that a higher degree of scrutiny is justified in evaluating whoever is nominated to serve as secretary of state. ”  Rubio said he remained “concerned” about the U. S. defending democracy and human rights, adding he worried that under Trump, the U. S. “will pursue a foreign policy that too often sets aside our values and our historic alliances in pursuit of flawed geopolitical deals. ” “But in making my decision on his nomination, I must balance these concerns with his extensive experience and success in international commerce, and my belief that the president is entitled to significant deference when it comes to his choices for the cabinet,” he said. “Given the uncertainty that exists both at home and abroad about the direction of our foreign policy, it would be against our national interests to have this confirmation unnecessarily delayed or embroiled in controversy,” Rubio continued. He plans to give Tillerson the critical swing vote to confirm him in committee and will vote for him in the full Senate. “However, upcoming appointments to critical posts in the Department of State are not entitled to and will not receive from me the same level of deference I have given this nomination,” he warned. Rubio had grilled Tillerson about doing business with Russia as CEO of Exxon Mobile and whether or not Vladmir Putin is a “war criminal” during a long and contentious hearing in committee. With Rubio’s vote, Tillerson will likely reach at least 52 votes in the Senate to be confirmed as Donald Trump’s Secretary of State.'"}, "time": 1742563810.542683}