{"duration": 0.10583615303039551, "input_args": {"text": "\"VIDEOS Alert on Russian border over alleged “Cyber Attacks” and “Propaganda” NATO is placing 300,000 troops on high alert near Russia's border who will be ready for deployment within two months By Whitney Webb - November 9, 2016 While the attention of the US public is decidedly focused upon the outcome of today’s presidential election, US-controlled NATO has announced an unprecedented escalating of its aggressive encirclement of Russia with military assets and troops. Secretary General of NATO, Jens Stoltenberg said in a statement that 300,000 troops have now been placed in a state of “high alert” in order to deter Russia who, according to NATO, has been “much more active in many different ways.” This new activity includes “Russia using propaganda in Europe among NATO allies,” which Stoltenberg says is “exactly the reason why NATO is responding […] with the biggest reinforcement of our collective defense since the end of the Cold War.” Adam Thomson, an outgoing representative to NATO, has estimated that the new 300,000 troops would be capable of deploying within 180 days, adding that speeding up the speed of deployment is of great importance. Though “propaganda” was cited as the main reason for the latest NATO build-up against Russia, the measures also come on the heels of Russia’s alleged involvement in “cyber attacks” on the US, despite no concrete evidence, as well as the nuclear war drills it has held domestically. In addition, NATO accused Moscow of deliberately provoking NATO by sending hundreds of paratroopers to a Serbian airbase, just 150 miles from where NATO forces were involved in disaster relief exercises in Montenegro. In response, Igor Sutyagin, an expert at the Royal United Services Institute for Defense and Security Studies told the UK’s Sunday Express that if “Russia wants to show that it can intimidate NATO, NATO saying to Russia, “If you show up, we’ll be there as well.” Frankly, all of these latest accusations coming from NATO are completely absurd. For one thing, the accusation that Russia was involved in “cyber attacks” or recent hacks is admittedly based on speculation by various US intelligence officials as no concrete evidence has been found to date implicating the Russians. In addition, the statement that said US Intelligence was “confident” Russia was responsible due to such speculation was authored by James Clapper, the Director of National Intelligence who lied to Congress under oath regarding NSA surveillance. If Clapper lied to the Congress once, what’s to stop him from lying to the American people? Furthermore, NATO are the clear aggressors here as they have been carrying out an unprecedented build-up on Russia’s border since 2014, placing numerous troops and military hardware in close proximity to Russia as well as carrying out massive military drills. This, along with this newly announced escalation and the rise of neo-McCarthyism in the West, has convinced many, including Russians, that NATO and the West are preparing for a full-scale war against Russia. However, most ridiculous of all is that this latest NATO announcement of troop deployment was spurred by the use of so-called Russian “propaganda,” a clear attack on news outlets related to Russia such as RT and Sputnik. RT has already been feeling the heat as their UK branch had its bank accounts closed without warning. Though Russia’s supposed use of “propaganda” prompts a military response from NATO, the US and the West have suffered no consequence for its own obvious use of propaganda against Russia and its allies, including this TIME magazine cover . Propaganda was once illegal within the US, but the passage of the 2012 NDAA changed all that, meaning that the West is also definitely using propaganda. Where’s the outrage? The fact that NATO’s narrative is so blatantly one-sided should be enough proof to us all that there’s more to the story than NATO is letting on.\""}, "time": 1742562804.3136692}