{"duration": 0.0728609561920166, "input_args": {"text": "'Ten commandments to parents from man who walked into gas chamber 01.11.2016   Janusz Korczak was an outstanding Polish pedagogue, writer, doctor and social activist who refused to save his own life three times. The first time it happened when Janusz decided not to emigrate to Palestine before the occupation of Poland not to leave the \"The House of Orphans\" to the mercy of fate prior to terrible events.He refused to save his life again when he refused to escape from the Warsaw Ghetto. It happened for the third time when Janusz Korczak and all tenants of the \"House of Orphans\" embarked on a train on the way to the concentration camp. When in the train, an SS officer approached Janusz Korczak and asked him: \"Did you write \"King Matt\"?\" I read this book as a child. This is a good book. You can be free.\" \"What about the children?\" Korczak asked the officer. \"The children will go, but you can leave the train,\" the officer said. \"You\\'re wrong. I can not. Not all people are bastards,\" Korczak replied. A few days later, in Treblinka concentration camp, Korczak and his children entered a gas chamber.On the way to death, Korczak was holding two of the youngest children, telling them a fairy tale story. Naturally, the little kids did not even suspect what was going to happen to them. In principle, one does not have to know more about the man whose name was Janusz Korczak. However, one does need to read the list of ten commandments that the amazing man recommended to parents for the education of children:1. Do not expect your child to be what you are or what you want him to be. Help him become what he is, rather than what you are. 2. Do not expect the child to repay you for all that you have done for him. You gave him life, so how can he repay you? He will give life to another and so on and so forth, and this is an irreversible law of gratitude.3. Do not vent your grievances on the child, not to eat the bitter bread in old age. You reap what you sow. 4. Do not look down at your child\\'s problems. Life is challenging to all, and it can be even more challenging to children, as children have no life experience.5. Do not humiliate your child!6. Do not forget that most important encounters that a person has in their life is encounters with children. Pay more attention to children - we never know whom we meet in a child.7. Do not torment yourself, if you can not do something for your child, just remember: you have not done enough for a child, if you have not done everything possible. 8. The child is not a tyrant, who takes over your whole life. The child is not just your flesh and blood. The child is a Holy Grail that Life gave you to keep and light up the creative fire. The child is the liberated love of his mother and father, who will grow not just \"our\" or \"their\" child - they will grow a soul that was given to them to care for. 9. Be able to love someone else\\'s child. Never do to someone else\\'s child the things that you would never like to be done to yours. 10. Love your child no matter what kind of people they might be - untalented, unsuccessful, or already adult. Rejoice when interacting with your child, because your child is a celebration that you still have. Newsinfo'"}, "time": 1742561964.3415358}