{"duration": 0.03179502487182617, "input_args": {"text": "'You are here: Home / political cartoon / How WH Staff Is Preparing For A Possible Hillary Presidency [Cartoon] How WH Staff Is Preparing For A Possible Hillary Presidency [Cartoon] October 26, 2016 \\nRobert Gehl asks if you remember back in 2001, when the Clinton’s backed a U-Haul truck to the rear-end of the White House and took off with a bunch of publicly owned furniture and other treasures? \\nYeah… that was pretty embarrassing. Probably something you wouldn’t want to repeat. \\nBut then again, you’re not Hillary Clinton. \\nAccording to another recently unclassified FBI interview, Clinton and her staff were seen removing furniture and lamps from the State Department offices early in 2009 as soon as she took office as secretary. Hillary was Secretary of State from 2009 to 2013. \\nThe agent – who is now an investigator with the Department of Homeland Security – said he had no idea whether or not the items were ever returned to the taxpayers. \\nBack in 2001, after The Washington Post broke the story, the Clintons said they would reimburse the taxpayers $86,000 for the items they stole that were actually government property, LifeZette reports . \\nThey also returned another $28,000 worth of furniture a few days later. \\nIn addition to stealing all that furniture back in 2001, you’ll recall they even removed the “W”s from all the keyboards in a juvenile and childish stunt to upset the incoming administration of George “W.” Bush. \\nTheft of taxpayer items from the State Department were not the only revelations in the FBI interview, The Washington Examiner is reporting . \\nIn its notes, the FBI writes: “Prior to Clinton’s tenure, being an agent on the Secretary of State’s protective detail was seen as an honor and a privilege reserved for senior agents. However, by the end of Clinton’s tenure it was staffed largely with new agents because it was difficult to find senior agents willing to work for her.”'"}, "time": 1742628577.8777244}