{"duration": 0.11877775192260742, "input_args": {"text": "'It first spread on social media, rippling through immigrant communities like the opposite of fear and rumor: a call to boycott. In the New York region and around the country, many cooks, carpenters, plumbers and grocery store owners decided to answer it and not work on Thursday as part of a national “day without immigrants” in protest of the Trump administration’s policies toward them. The protest called for immigrants, whether naturalized citizens or undocumented, to stay home from work or school, close their businesses and abstain from shopping. People planned for it in restaurant staff meetings, on construction sites and on commuter buses, but the movement spread mostly on Facebook and via WhatsApp, the messaging service. No national group organized the action. “It’s like the Arab Spring,” said Manuel Castro, the executive director of NICE, short for New Immigrant Community Empowerment, which works primarily with Hispanic immigrant day laborers in Jackson Heights, Queens. “Our members were coming to us, asking what the plan was. Frankly, it kind of came out of nowhere. ” But what began as a   movement quickly reached the highest levels of federal government. In Washington, the Pentagon warned its employees that a number of its food concessions, including Sbarro’s, Starbucks and Taco Bell, were closed because immigrant employees had stayed home and that they could expect longer lines at restaurants that were open. Restaurants, from San Francisco to Phoenix to Washington, D. C. were some of the most visible spots affected, with   chefs closing some of their eateries for the day in support. Rick Bayless, the Chicago chef and owner of the Frontera Grill, closed several of his restaurants and said he would give a portion of the revenue from the ones that remained open to an immigrant and refugee rights group. “What really makes our country great is the diversity we experience here,” Mr. Bayless said in an interview. “I can’t say enough about the lack of respect and the   and   that I’m sensing around us these days. ” Some people felt that the support of immigrants who are undocumented was wrongheaded. “Of course, nobody wants to do without immigrants  —   they are what made America,” Sarah Crysl Akhtar, 67, a writer in Lebanon, N. H. said in a telephone interview. “But there is a difference between legal immigrants and illegal aliens. ” The latter, she said, “bring down the quality of life for everyone. ” Some schools and   centers across the country experienced a drop in attendance. At KIPP Austin Comunidad, a   charter school in Austin, Tex. one teacher posted on Twitter that only seven of her 26 students came to school on Thursday. “Some of our school buses were coming to school with two and four children on them,” said Sarah Gonzales, a   bilingual teacher at the school. “Nothing like this has ever happened before. ” By the end of the day, the KIPP Austin Public Schools network executive director, Steven Epstein, said only 60 percent of students attended its 10 schools with 5, 000 students. Usually the attendance rate is 98 percent or above. At Siler City Elementary School in rural North Carolina, where 65 percent of the school population is Hispanic, 263 of the 662 students were absent on Thursday. Just 18 were absent on Wednesday, said John McCann, a spokesman for the county school district. Still, cities did not grind to a halt, and for most people, the action registered as an inconvenience  —   a longer wait for lunch, a favorite restaurant closed, a bus driver who wasn’t there. In the Hasidic neighborhood of Borough Park, Brooklyn, some customers noticed the absence of the usual Latino immigrant employees at their local stores. “I thought, ‘Oy, my coffee will not be as good as any day,’ but I felt, ‘Good for them, they are standing up for their rights,” said Rabbi Joel Labin, 34, a writer and activist who shopped at Center Fresh market. “We grew up with these stories. I hear from my grandparents the issue of immigration from Europe. I feel like it’s kind of my story, too. ” Mexican workers participated in large numbers in New York. In Sunset Park, Brooklyn, most bakeries and taquerias were closed, and a public library was crowded with parents and children they kept home from school. But the action was not limited to Hispanic immigrants: On several blocks in Midwood, Brooklyn, virtually all stores were shuttered on Thursday as part of a protest planned by Pakistani shop owners. There, an auto repair shop on Coney Island Avenue posted a handmade sign on its   metal shutter: “We Are Immigrants. ” The driver of a discount shuttle bus outside the Port Authority Bus Terminal, Sam Ahmad, originally from Egypt, said on Wednesday night that he was not going to work on Thursday and many members of his mosque in New Jersey would not, either. Asked why, Mr. Ahmad, 57, said, “Because that crazy guy,” he said, referring to President Trump. “Because I’m Muslim and I got a lot of family here. They can get separated, and it’s not right. Our children are born here and grow up here. ” In downtown Newark, a   gathering outside the stately Essex County Hall of Records started with only a couple dozen protesters and turned into a spirited event when students from nearby Science Park High School charged in with signs, banners and chants. “We are loud, we are clear, immigrants are welcome here,” they said, drawing honks from cheering passing motorists. Gina Alvarado, one of the students, said the plan to ditch school for the rally had spread spontaneously Thursday morning via social media, texts and   . In Manhattan, the flower district, mostly concentrated on West 28th Street, was as quiet as the wholesale jewelry and garment district around it. At one point, two construction workers from a nearby site took a coffee and cigarette break. “Half the job didn’t come in,” said Joe Burns, 32. “About 10 people, Spanish guys,” he added. “We’ve got to labor for ourselves today. ” It did seem that in New York, at least, pockets of the nonunion construction industry were shut down. A    carpenter from Cuenca, Ecuador, who gave only his first name, Santiago, said in Spanish that at his construction site in Astoria, Queens, a supervisor asked on Wednesday whether workers were coming the next day. They were not, the workers told him. About 500 people from several companies were employed at the site, Santiago said, including carpenters, electricians and plumbers. The Davis Museum at Wellesley College took an innovative approach to the protest. It removed or cloaked 120 works of art that had either been created by an immigrant or donated by an immigrant  —   about 20 percent of the museum’s display. With entire galleries shrouded in black felt and placards replacing paintings, the director of the museum, Lisa Fischman said, “I’ve been calling it an intervention, because it takes what we have and reframes it. ” The protest seemed to get less traction in downtown Boston, with a few restaurants and stores closing. Still, a number of places posted supportive messages on social media, such as one from Eataly Boston, the Italian marketplace, which showed a picture of pasta, olive oil, wine, coffee beans and other goods with the headline: “We were all imported. ”'"}, "time": 1742563140.619048}