{"duration": 0.02871417999267578, "input_args": {"text": "'Email \\nThe Obama regime’s gingerly kid gloves treatment of white Christian terrorists is a policy that foresaw the acquittal of the Bundy gang. \\nThe gang was able to conduct an armed occupation of the Oregon Wildlife Refuge in full view of the nation because they won their 2014 armed confrontation with the feds at the Bundy ranch in Nevada. Armed federal marshals retreated from the battlefield and no one was arrested until this year when Bundy pere, immune in Nevada, made an unwise visit to Portland. \\nCharging the terrorists with the narrow and whimpy crime of conspiring to keep refuge workers away from their jobs was difficult to prove because their own boss ordered them to stay away and none tried to go to work. \\nA federal government determined to fight terrorism could have escorted employees through the terrorist lines with as much firepower as deemed necessary if that was the crime they intended to prevent. But, as in Nevada, law enforcement did not even order the terrorists to drop their guns (Oregon offers an “open carry” invitation) or threaten them with arrest. \\nInstead, Obama’s DOJ policy was to wait them out, perhaps because white lives really matter. That meant the prosecution could not present evidentiary proof of actual weapon threats and intimidation by the terrorists and dictated their weak charge. The armed terrorist at the off refuge roadblock had to charge an entire platoon of law enforcement officers after his vehicle tried to run them down before they shot and killed him. \\nThe acquittal of the armed occupiers is a consequence of our political culture. As transmitted by the media ( The Oregonian avoided calling it what it was and used neutral labels like “standoff”) that culture has decided that white Christians can’t be terrorists– a designation reserved for blacks and Muslims. So a jury that reflected a statewide and not a Portland constituency evidently kicked out its lone dissenter and then quickly acquitted can be assumed to have acquired this cultural norm. \\nAnd we in Oregon suffer from a frightened governor Brown whose response to the verdict was, “The occupation of the Malheur Reserve did not reflect the Oregon way of respectfully working together to resolve differences” \\nIsn’t that special?'"}, "time": 1742562879.1943505}