{"duration": 0.03932952880859375, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. President Obama delivered a nostalgic but hopeful farewell address to the nation from a convention center in Chicago. He warned the nation not to shrink from the challenges of economic inequality, racial strife, political isolation and voter apathy. “If something needs fixing, lace up your shoes and do some organizing,” Mr. Obama, a   political organizer, told the cheering crowd. “If you’re disappointed by your elected officials, grab a clipboard, get some signatures, and run for office yourself. Show up. Dive in. Persevere. ” Here’s the full video and text. _____ 2. Senator Jeff Sessions of Alabama,   Donald J. Trump’s pick for attorney general, received a surprisingly gentle welcome at the start of his Senate confirmation hearing. He appeared to assuage Democrats by saying that that waterboarding is “absolutely” illegal and that he did not support barring Muslims from the United States, and even the most liberal senators declined to vigorously confront him on allegations of racism from three decades ago. The whirlwind week of hearings continued with retired Gen. John F. Kelly, the Homeland Security nominee. Here’s the full schedule for the week. And late in the day came this news: The chiefs of America’s intelligence agencies last week gave Mr. Trump and Mr. Obama a summary of unsubstantiated reports that Russia had collected compromising and salacious personal information about Mr. Trump. The agencies are investigating, said two officials with knowledge of the matter. _____ 3. Dylann S. Roof, the white supremacist who expressed no remorse for killing nine people at a historically black church in Charleston, S. C. was sentenced to death. The jury returned its unanimous verdict after about three hours of deliberations in the penalty phase of the trial. Mr. Roof showed no emotion as the verdict was read. _____ 4. The Obama administration is making a   push for police overhauls in two of the nation’s most violent cities, where officers have been accused of routinely mistreating  . The results of the Justice Department’s sweeping investigation into police practices in Chicago are expected before Inauguration Day. Baltimore, above, is close to a deal that would require the police to make changes under court supervision. _____ 5. Fox News secretly settled sexual harassment accusations against Bill O’Reilly, the network’s top host, last summer. Juliet Huddy, a longtime   personality, said Mr. O’Reilly had tried to ruin her career after she rebuffed his advances. The settlement was described in a draft of a letter from Ms. Huddy’s lawyers to Fox News that was mailed anonymously to The Times and verified. _____ 6. Volkswagen is on the verge of admitting to criminal violations and paying $4. 3 billion to resolve a federal investigation into its cheating on emissions tests. The company will probably plead guilty to charges of customs fraud and violating the Clean Air Act, two people with knowledge of the discussions said. _____ 7. Protests broke out in Iran at the funeral of Ayatollah Akbar Hashemi Rafsanjani, a key figure in the country’s 1979 revolution who had come to be seen as the last establishment voice friendly to the opposition. Officials said 2. 5 million mourners attended. The live broadcast on state television tried to avoid protesters’ chants for a former presidential candidate under house arrest against Russia, Iran’s ally in the Syrian conflict and for the release of political prisoners. _____ 8. Clare Hollingworth, a British journalist who became the undisputed doyenne of war correspondents, died in Hong Kong at 105. She was on the   border in August 1939, just a week into her first job for a British newspaper, when she reported what was probably the greatest scoop of modern times: the start of World War II. She roamed the conflict zones of the world equipped with little more than a toothbrush, a typewriter and, if need be, a revolver. _____ 9. “They started coming in like the tide. ” That was an official at a refugee camp in Bangladesh, where Rohingya Muslims from Myanmar have fled by the thousands to escape a brutal counterinsurgency campaign. They say soldiers burned their villages, shot at random and systematically raped women and girls. _____ 10. Finally, a wealthy activist who bought a $2. 2 million West Village home a decade ago is giving it to the original Manhattanites: the Lenape Native American nation.   Goldwater Bourgeois, the son of the sculptor Louise Bourgeois, said he had always been troubled by the    legend that the Lenape sold Manhattan (the name is their word for “the land of many hills”) to Dutch settlers for the equivalent of $24 worth of goods. “Manhattan is a capitalist rock this is a quiet protest against that,” he said. “I’m giving it back to whom the land was stolen from, and that’s really a joyful event. ” _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742628588.2149534}