{"duration": 0.10473322868347168, "input_args": {"text": "'Home › HEALTH › WARNING: USDA ALLOWING OVER 20 SYNTHETIC SUBSTANCES IN ORGANIC FOODS WARNING: USDA ALLOWING OVER 20 SYNTHETIC SUBSTANCES IN ORGANIC FOODS 0 SHARES \\n[10/26/16] VICKI BATTS – Just one month ago, a California judge refused to dismiss a lawsuit that seeks to challenge the USDA on their recent, unlawful changes to how synthetic substances are evaluated in the production of organic goods. \\nWhile the charges are simply “alleged” for now, more than a dozen organizations came forward to press the issue. They discovered that at least 20 substances that would have been banned under the previous evaluation method had been allowed to slide through and into our organic foods . \\nUnsurprisingly, the federal agency requested that the case be dismissed because they believe that these organizations do not have the legal standing to press such a lawsuit. Our founding fathers probably rolled in their graves when the USDA suggested that any of the citizens of the country for which it serves did not have the “legal standing” to challenge them in court, but particularly those who may be be harmed by its doings. \\nFortunately, U.S. District Judge Haywood Gilliam Jr. of San Francisco disagreed with the USDA’s sentiments, and is allowing the litigation to move forward. Capital Press reports, “Gilliam ruled that it’s plausible the plaintiffs will be harmed by the USDA’s policy change, which they say has allowed more than 20 synthetic substances to continue being used in organic agriculture.” \\nThe organizations came together to voice their concerns (and press charges) last year, arguing that the agency’s changes to their procedures for handling synthetic substances in organics have effectively made it much more difficult to remove a synthetic ingredient from the list of approved substances. In other words, these new regulations are making it harder to keep organic food clean. \\nThe organizations’ concerns are primarily focused on the USDA’s decision in 2013 to change the five-year “sunset process” for synthetics that are approved for organic farming. In the past, synthetic substances were banned from the list, unless two-thirds of the 15-member National Organic Standards Board (NOSB) agreed that they should be permitted to remain on the list. \\nThe USDA has taken this policy and flipped it on its head; in order to eliminate a synthetic chemical from the list, now the NOSB must obtain a vote of at least two-thirds. So instead of voting for a chemical to remain on the list, the NOSB now has to vote to remove them. This means that even a majority of nine people will not be able to effectively remove unwanted substances from organic foods. \\nWill Fantle, co-founder of the Cornucopia Institute, a nonprofit organic industry watchdog site, commented, “This gets at the heart of decision-making at the National Organic Standards Board.” Fantle also noted that now, instead of allowing these products to “sunset,” or simply fade out of use, the USDA’s new policy will force these ingredients into the “land of the midnight sun.” \\nThe plaintiffs state that the USDA’s newly-minted process harms consumers who pay a premium for organic produce and products, because there is an expectation that these goods are produced with a minimal amount of synthetics. This deception also harms farmers, because it undermines the “organic” label. These are products that are supposed to be produced with integrity in mind. \\nThe first lawsuit presented by the group was dismissed because it lacked specificity. Not to be deterred, the plaintiffs identified 20 different substances that would have been banned under the previous NOSB policy. In their lawsuit, they also state that “ the USDA promulgated the regulation without providing the public the opportunity for notice and comment and acted in an arbitrary and capricious manner[.]” \\nHopefully, the lawsuit will be successful and the USDA will be forced to revoke their terrible new policy. If Americans continue to band together and fight against such deceitful practices, we may eventually be able to clean up our food (and our country). Post navigation'"}, "time": 1742562997.5060446}