{"duration": 0.10461544990539551, "input_args": {"text": "'The crowd outside the sleek Dream Downtown Hotel in Chelsea is large on Saturday nights, young men and women waiting to get into hot spots like the hotel’s   “a glittering room,” a reviewer wrote, “of celebrities, beautiful women and cresting   bills. ” It was there, shortly after midnight on a recent Sunday, that a relic of old New York arrived. His name, according to the police, was Andrew Jones, 57, and he had turned up in many of New York City’s neighborhoods to perform his trade over the past 35 years. He carried his usual tools: three playing cards and a cardboard box. By the time a police officer saw him at 1:15 a. m. he had drawn an audience: “At least nine people crowded around the cardboard box,” the officer wrote in a criminal complaint, “causing at least 20 people to have to walk off the sidewalk and onto the street to get past. ” Later, after Mr. Jones was arrested, his   lawyer, who was half his age, said she had never come across the particular crime he was accused of. But the officer knew right away what was happening on the sidewalk that night. “‘  monte,’” she wrote. There was a time in New York when   monte dealers, like their distant and forlorn cousins, squeegee men, were a familiar sight on the streets, an annoyance to residents and a powerful lure to tourists and newcomers. The promise of easy money and the best dealers’ witty patter had suckers reaching into wallets for cash they would never see again. The dealers became an endangered species with the steep drops in crime that began in the 1990s. Like lush workers, those denizens of the subways, they have not been passing down their skills to a new generation. But they are not yet extinct, as the arrest of Mr. Jones indicates. “It’s the same guys,” said Sgt. Gerard Caffrey of the Police Department’s grand larceny division. “It’s probably a crew of maybe 50 guys that do this. ” The earliest mentions of   monte in The New York Times date to the 1850s in articles about farmers losing fortunes to “an unfair game. ” Few heeded those words, and the game flourished. In 1992, city officials and local merchants, exasperated, led a   campaign to teach people how the fraud worked in hopes of cutting off demand, handing out fliers in Times Square. “You can’t win, you won’t win, you will never win,” the commissioner of the Department of Business Services said at a news conference. “So don’t play the game. ” This was around the time the magician Penn Jillette, half of Penn  Teller, walked through Times Square every day on his way to perform. He remembered first learning about the swindle in books. “It was like reading about buggy whips and   socials,” he said in an interview last week. “I thought it was something from Melville’s time. ” So he was surprised at what he saw in New York. “I would walk by four games from my apartment to the theater. ” His romantic notions about the game disappeared. “They are just thugs and this is one step from mugging,” he said. The dealers usually work in teams that include lookouts and shills, or plants posing as players who win. Sergeant Caffrey witnessed that sort of team before making an arrest near Herald Square in March. “The dealer always has milk crates and a cardboard box. That’s his little table,” the sergeant said. The dealer has three cards, one of which, often a queen, is the winning card, and he places them facedown on the table and rearranges them. When he is done, the player bets on which one is the queen. In the March arrest, women were with the dealer, “acting like they’re playing the game, jumping up and down, all excited,” Sergeant Caffrey said. “Different ethnicities. It wouldn’t be obvious they’re together. ” When a stranger seeing an easy buck  —   “You think you’re smarter,” Mr. Jillette said  —   approaches to play, he is often allowed to win a hand or two, betting a little and getting twice as much in return. The stakes rise quickly  —   “five dollars to 50, right away,” the sergeant said  —   with the dealer then subtly changing the order in which he throws down the three cards. What the player believes to be the queen is not, and the bet is lost. “It doesn’t take much practice,” Mr. Jillette said. “About an hour. ” Mr. Jones has been at it much, much longer than that, the police said. He has a long criminal history that includes charges of robbery and larceny. Mostly, though, he has been arrested on charges of running   monte games  —   at least 17 times since Nov. 28, 1981, in Times Square, his first arrest, the police said. He pleaded guilty to the crime committed outside the hotel in Chelsea, was sentenced to time served and was released. The location of his most recent appearance was strategic, with a   crowd of waiting clubgoers. “People that would have 20s in their pockets, ready to go,” Mr. Jillette said. “People not at their most frugal, not at their most clear thinking. ” People too young to know what those fliers warned in 1992: You can’t win.'"}, "time": 1742563200.5055375}