{"duration": 0.07938885688781738, "input_args": {"text": "'After all the allegations of rampant voter fraud and claims that millions had voted illegally, the people who supervised the general election last month in states around the nation have been adding up how many credible reports of fraud they actually received. The overwhelming consensus: next to none. In an election in which more than 137. 7 million Americans cast ballots, election and law enforcement officials in 26 states and the District of Columbia  —       and    —   said that so far they knew of no credible allegations of fraudulent voting. Officials in another eight states said they knew of only one allegation. A few states reported somewhat larger numbers of fraud claims that were under review. Tennessee counted 40 credible allegations out of some 4. 3 million primary and general election votes. In Georgia, where more than 4. 1 million ballots were cast, officials said they had opened 25 inquiries into “suspicious voting or   activity. ” But inquiries to all 50 states (every one but Kansas responded) found no states that reported indications of widespread fraud. And while additional allegations could surface as states wind up postelection reviews, their conclusions are unlikely to change significantly. The findings unambiguously debunk repeated statements by   Donald J. Trump that millions of illegal voters backed his Democratic opponent, Hillary Clinton. They also refute warnings by Republican governors in Maine and North Carolina that election results could not be trusted. And they underscore what researchers and scholars have said for years: Fraud by voters casting ballots illegally is a minuscule problem, but a potent political weapon. “The old notion that somehow there are all these impostors out there, people not eligible to vote that are voting  —   it’s a lie,” said Thomas E. Mann, a resident scholar at the Institute of Governmental Studies at the University of California, Berkeley. “But it’s what’s being used in the states now to impose increased qualifications and restrictions on voting. ” In a year that unfolded amid wild fraud claims, the reports from election officials were strikingly humdrum. “Nothing at all, really,” said Jim Tenuto, the assistant executive director of the Illinois State Board of Elections. “We only had one,” said Laura Strimple, Nebraska’s assistant secretary of state. “It hasn’t been confirmed. ” “We haven’t received any complaints to our office or any word of suspicious activity, and we would definitely hear it,” said Matt Roberts, the spokesman for Arizona’s secretary of state. Some state officials qualified their estimates, saying they had not yet reviewed all questionable ballots, or that voter fraud was a local matter that was usually  —   but not always  —   reported to them. Ohio officials declined to offer totals, saying they were still assessing complaints Pennsylvania and Mississippi officials said they did not track fraud cases. Many Republicans insist significant problems persist, and that much fraud goes undetected. The conservative Heritage Foundation has published online what it calls an incomplete list of voter fraud and other   violations dating to 1982, roughly 450 cases involving both voters and public officials. Properly written, laws requiring voters to display IDs “could increase the fairness of the election process for everyone, regardless of party,” Hans von Spakovsky, the manager of the foundation’s Election Law Reform Initiative, said.   advocates note that the current system caught those violations  —   and that the numbers, less than one per state per year  —   constitute a tiny sliver of the millions of votes cast in any election cycle. No one doubts that election fraud has occurred and needs to be monitored. Election outcomes have been changed by officials who altered vote tallies, and in theory hackers could pick winners by playing havoc with voter rolls, voting machines or electronic reporting networks. But voter fraud, in which someone deliberately casts an invalid ballot or a ballot under someone else’s name, is exceedingly rare. Its prevalence is at the heart of the debate on restrictions like voter ID. Critics say that cracking down on abuses that barely exist can cost hundreds of thousands of people or more  —   often the poor and minorities  —   their ability to vote. For example, a federal court in 2014 found that in Wisconsin an estimated 300, 000 voters who had already registered did not have any of the required IDs. Federal courts have altered or nullified the strictest   laws, saying they suppress turnout among minorities, who are most likely to lack a required ID. This year has set new benchmarks for accusations about tainted elections. In Maine, Gov. Paul LePage, a Republican, this month certified state elections, in which Mrs. Clinton won, but refused to call the vote count accurate. (Maine’s secretary of state says no voter fraud was detected.) In North Carolina, Gov. Pat McCrory, also a Republican, charged that   fraud in more than half the state’s 100 counties contributed to his   defeat by the state attorney general, Roy Cooper. Mr. McCrory conceded on Dec. 6. But for three weeks before that, he and others repeatedly accused Democrats of concocting illegal absentee ballots and relying on votes by criminals, the dead and   voters. The accusations proved largely spurious. Of more than 4. 7 million ballots cast, election officials uncovered 25 apparently invalid votes by felons whether they knew they were ineligible to vote is unclear. State and county election boards, all led by Republican majorities, threw out most of the remaining challenges.   dead voters actually had died after casting early votes   voters turned out to be people with similar or identical names. Mr. Trump falsely asserted on Twitter that he would have won the popular vote  —   Mrs. Clinton received some 2. 8 million more votes  —   “if you deduct the millions of people who voted illegally. ” But even Republican leaders who once disavowed Mr. Trump’s fraud remarks have fallen silent. In October, the House speaker, Paul D. Ryan, countered Mr. Trump’s   claims by noting through a spokeswoman that he was “fully confident” of an honest vote. Asked this month about Mr. Trump’s claim that Mrs. Clinton won the popular vote with illegal ballots, Mr. Ryan demurred. “I don’t know. I’m not really focused on these things,” he told CBS News’s “60 Minutes. ” Reince Priebus, the Republican National Committee chairman and Mr. Trump’s chief of staff, went further. “I don’t know that it’s not true,” he said on CBS’s “Face the Nation. ” “It’s possible. ” Bogus fraud claims are not new. “You call up and say there are busloads of people being dropped off in multiple parishes, and we have to check it out, even though we hear it every election,” said Meg Casper, the spokeswoman for Louisiana’s secretary of state. “We call up the precinct office and they say, ‘No, we haven’t seen anything like that. ’” Still, almost every election has some irregularities, including last month’s. In Walterboro, S. C. records showed that a woman cast an absentee ballot, but voted again on Election Day. “She indicated that she was concerned her absentee ballot wouldn’t count,” said Chris Whitmire, a spokesman for the State Election Commission. In North Dakota, said the deputy secretary of state, Jim Silrum, “one of our county auditors was called the day after the election by a voter who said: ‘Hey, my name is   . I’m from Minnesota but I voted in the election and to do that I filled out an affidavit. Can you make me a Minnesotan again? ’” In New Hampshire, said Brian W. Buonamano, an assistant attorney general, officials are examining four to six unconfirmed complaints  —   “voting more than once, lying on your affidavit, things like that. ” In Kentucky, a voter hotline recorded 18 complaints of “general election fraud” upon investigation, none were deemed credible. In Idaho, a single voter was found to have cast another ballot in Oregon. In Delaware, “one voter voted absentee ballot in Suffolk County and then went to Kent County, changed his address, and voted again,” said Secretary of State Elaine Manlove. “First time that’s ever been reported to me. ” Colorado, where most residents vote by mail, has sequestered 20, 000 ballots for review  —   some lacking signatures or the ID that   voters are required to mail in, most with signatures that don’t match those on file. But “we’re not saying there are 20, 000 cases of fraud,” said Lynn Bartels, a spokeswoman for Secretary of State Wayne W. Williams. Indeed, she said, a ballot cast by Mr. Williams’s daughter was once rejected because of a mismatched signature. Voting experts say the vast bulk of mismatches arise from handwriting changes or signatures poorly entered on touchpads. As for noncitizens casting invalid ballots, Mr. Trump was right: It did happen. Not millions of times, but at least once. Tennessee is still investigating one allegation of noncitizen voting. And in Oregon, an American citizen registered her noncitizen husband to vote, which he did  —   until he discovered it was illegal. The man reported his mistake to county election officials, the secretary of state’s office said. He asked that his ballot not be counted.'"}, "time": 1742628442.2627153}