{"duration": 0.029937028884887695, "input_args": {"text": "'The founder of the Republican Hindu Coalition, Shalabh Kumar, spoke with me on Sunday evening’s Breitbart News radio show on Sirius XM Patriot 125 about his new book Ab Ki Baar Trump Sarkar! in which details how he, alongside various Trump campaign operatives, helped flip “one million plus” Democratic votes in favour of President Trump in 2016. [Kumar, a wealthy and successful   businessman based in Chicago, took the opportunity to dispel media and   myths about former Breitbart News Executive Chairman and now Chief White House Strategist Stephen K. Bannon.  Speaking to Breitbart News, he said: “[He is a] totally different creature [to his portrayal in the media],” said Kumar. “When I first met him, this narrative was there. And the first time I met him at the end of July last year, he welcomed me, he showed me his great innovative mind, he recognised the potential of the   vote, and he was participant every which way. “He was so nice, he was just unbelievably nice  …     [he’s] just an absolutely great guy,” added Kumar. The book, written by political operative James Kahrs details Mr. Kumar’s journey from setting up the Republican Hindu Coalition, having himself become convinced of the party and its conservative values through personal conversations with President Ronald Reagan. Mr. Kumar says he threw his weight behind Mr. Trump after meeting him on several occasions during the Presidential campaign, hosting dozens of town hall events, putting himself forth as a Trump surrogate on television channels around the world, and indeed producing a video aimed at Hindu Americans which he says had 1. 2 billion impressions around the world, including amongst the 4. 2 million Hindu Americans living in the United States. “In the past, they’ve only voted 16 per cent for Republicans  …     84 per cent have voted for Democrats  …     They should all be voting  …     90 per cent should be voting for Republican conservatives, but they needed to be touched”. In the book, Kahrs writes: People who know Bannon know that he is a gregarious and courtly man, despite all the scary stories written about him or even his portrayal on NBC’s Saturday Night Live as the grim reaper. True to himself, Bannon was the first to greet Kumar when he arrived. “He is not the   racist animal that is depicted in the media at all,” Kumar thought to himself. “In fact, he was so kind and hospitable. He took me around to the offices and introduced me to the members of the staff. He really made me feel like I was a welcome member of the team. ” The book recalls stories of how Kumar met with candidate Donald Trump, even at one point getting the now President to utter the Hindi words “Ab Ki Baar Trump Sarkar!” for a campaign video. LISTEN: '"}, "time": 1742562252.2010849}