{"duration": 0.047675132751464844, "input_args": {"text": "'0 comments \\nWith just 10 days to go before the most important election of our lifetime, Donald Trump and his fellow Republicans are soaring in the polls. The Friday announcement that the FBI would be re-opening its investigation into Hillary Clinton’s personal email server has not helped matters for Democrats, either. \\nBut none of this will matter if they are able to manipulate the vote. According to MRC Blog , that’s why the left is going to drastic measures to drum up Democratic voters, expanding voting rights to include non-citizens in major cities nationwide. \\nThe latest notable city to do so is San Francisco, whose Election Day ballot will include a measure allowing the parents or legal guardians of any student in the city’s public schools to vote in school board elections. Under this measure, people with green cards, visas, or no documentation at all would be allowed to vote. \\nSan Francisco Assemblyman David Chiu, who believes illegal aliens should be allowed to vote to bypass the “broken immigration system in this country,” made the following statement: \\n“One out of three kids in the San Francisco unified school system has a parent who is an immigrant, who is disenfranchised and doesn’t have a voice. We’ve had legal immigrants who’ve had children go through the entire K-12 system without having a say.” \\nChiu is the son of Taiwanese immigrants. \\nIt is no secret that the vast majority of illegal aliens vote Democrat, because that is the party which is incessantly trying to buy their loyalty with an endless stream of handouts and promises of blanket amnesty. If it weren’t so, we wouldn’t see all of these liberals pushing so hard to give illegals voting rights; they simply do so because it works in their favor, not because it is actually good for anyone. \\nMajor cities from sea to shining sea are following San Francisco’s lead, which is just one more very important reason to vote for Donald Trump on Nov. 8. We need to turn this country around and FAST!'"}, "time": 1742562970.5118895}