{"duration": 0.04994606971740723, "input_args": {"text": "'0 comments \\nPerhaps no country has been more welcoming of Muslims refugees to their own detriment than Sweden. \\nNot only has the country accepted far more of these migrants than they can feasibly handle, but the nation has also bent over backwards to make them comfortable. Things have gotten so out of hand that Christmas lights have now been banned so as not to offend these devout Muslims. \\nThe Swedish Transport Administration (Trafikverket) will not allow municipalities to erect Christmas street lights on light poles that the authority manages this year, which means that many towns will have no lights at all for the holiday. \\nWhat a sad time for the native Christians in Sweden. \\nTo add insult to injury, Speisa called the decision “a victory for those who want to tone down the reminder of the country’s Christian traditions.” \\nShockingly, even though the onslaught of Islamic culture has wreaked havoc on Sweden’s people and infrastructure, they want to “tone down” the Christian influence. How backwards is that?! \\nAuthorities appear to be trying to sweep the decision under the rug by claiming it is a matter of “safety.” \\n“Poles are not designed for the weight of Christmas lights, and we have to remove anything that should not be there,” said Eilin Isaksson, national coordinator at the Swedish Transport Administration. \\nI’m not sure they’re going to be fooling anyone with this “safety” line. If they were really so worried about that, they wouldn’t be allowing millions of migrants to roam around raping their women and children. \\nMRC Blog expressed the same sentiment: \\nThis argument that lights are too heavy and pose a safety risk is complete [sic] bogus, of course. Authorities in Sweden actually expect people to believe that lights normally held up by tree branches are now too weighty to be supported by metal poles. In reality, these lights have simply been banned to avoid offending Muslim “refugees.” \\nYou can be sure that if Hillary Clinton is elected, we have a future similar to Sweden’s to look forward to. She has privately expressed her desire for completely open borders and she kowtows to Muslims the same way President Obama does. \\nSHARE this report if you think it is utterly absurd that Sweden has banned Christmas lights to appease Muslim refugees!'"}, "time": 1742628368.6581326}