{"duration": 0.12186574935913086, "input_args": {"text": "'NTEB Ads Privacy Policy Iran Sending Elite IRGC Warfighters Into Europe And United States In Preparation For Battle Iranian military and government officials have continued to advocate violence against the U.S. and its allies, despite the nuclear deal and several secret side agreements that gave Iran $1.7 billion in cash. by Geoffrey Grider November 2, 2016 The Iranian Revolutionary Guards Corps, the country’s elite military force, is sending assets to infiltrate the United States and Europe at the direction of Iran’s Supreme Leader Ali Khamenei, according to recent Farsi-language comments from an Iranian military leader. \\nEDITOR’S NOTE: This is just a small bit of what our next president will have to deal with. Do you want a president who needs to take naps all the time , or do you want a Commander in Chief who is awake, alert and highly energized to get the job done? It’s a no-brainer, people, go out and vote to #MakeAmericaSafeAgain. \\nThe IRGC “will be in the U.S. and Europe very soon,” according to the Iranian military commander, who said that these forces would operate with the goal of bolstering Iran’s hardline regime and thwarting potential plots against the Islamic Republic. \\n“The whole world should know that the IRGC will be in the U.S. and Europe very soon,” Salar Abnoush, deputy coordinator of Iran’s Khatam-al-Anbia Garrison, an IRGC command front, was quoted as saying in an Iranian state-controlled publication closely tied to the IRGC. Iran’s secret army, the IRGC: \\nThe military leader’s comments come as Iran is spending great amounts of money to upgrade its military hardware and bolster its presence throughout the Middle East and beyond. Iran intends to spend billions to purchase U.S.-made planes that are likely to be converted for use in its air force. \\nCongressional leaders and others suspect that Iran has used a large portion of the cash windfall it received as a result of last summer’s nuclear agreement to upgrade its fighting capabilities war machine. \\n“The IRGC is [the] strong guardian of the Islamic Republic,” Abnoush was quoted as saying. “The Fedayeen of Velayat [fighting force] are under the order of Iran’s Supreme leader. Defending and protecting the Velayat [the Supreme Leader] has no border and limit.” Iranian military and government officials have continued to advocate violence against the U.S. and its allies, despite the nuclear deal and several secret side agreements that gave Iran $1.7 billion in cash. \\nIran accuses the U.S. of violating its end of the agreement by not helping the Islamic Republic gain further access to international banks and other markets. Iran’s frustration over this has led to further accusations about a U.S. plot to foster unrest in the country. Iran IRGC UAV & UCAV operation units in Persian Gulf: \\n“Our enemies have several projects to destroy our Islamic revolution, and have waged three wars against us to execute their plans against our Islamic Republic,” Abnoush said. “The IRGC has defeated enemies in several fronts. The enemy surrendered and accepted to negotiate with us.” \\n“And now all of our problems are being solved and our country is becoming stronger in all fronts. Some believe the holy defense ended,” the military leader added. “They are wrong; the holy defense continues, and today, it is more complicated than before.” \\nCongressional sources and experts involved in tracking Iran’s increased aggression in the region and elsewhere told the Washington Free Beacon that these most recent comments are troubling given Iran’s very public efforts to assassinate political enemies and others across the globe. \\n“If we look at Iran’s previous terror attacks and assassination campaign around the world, such a statement is alarming,” Saeed Ghasseminejad, an Iran expert at the Foundation for Defense of Democracies, told the Free Beacon . “The Islamic Republic has killed hundreds of Iranians and non-Iranians around the world in a coordinated campaign of terror. Iran may decide to restart the project now that many western companies are going to Iran and Iran feels its action in Europe may not be punished strongly.” \\nAnother source who advises congressional leaders on Iran sanctions issues told the Free Beacon that the Obama administration is blocking Congress from taking action to stop this type of infiltration by Iranian forces. \\n“Iran is ideologically, politically, and militarily committed to exporting the Islamic revolution through terrorism, which is why even the Obama administration says they’re the world’s foremost state sponsor of terrorism,” the source said. “Congress wants to act, but Obama officials keep saying that new laws are unnecessary because the U.S. has enough tools to block Iranian terror expansion. Instead of using those tools, though, they’re sending Iran billions of dollars in cash while Iran plants terror cells in Europe and here at home.” source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742561683.0199618}