{"duration": 0.11592435836791992, "input_args": {"text": "'DALLAS  —   From a young age, Brent Thompson pushed the bounds of life so hard that he almost always found a way to get hurt. There was that time as a youngster when he nearly broke his neck playing in a hammock. Or when he wrecked his brother’s Mustang after begging him for the keys. Or the time he broke his arm during motorcycle training for the Police Department. It was his fearlessness and desire to serve his country that led Mr. Thompson to join the Marines and, after returning from deployments in Afghanistan and Iraq, to become a police officer, his longtime pastor, Rick Lamb, said Wednesday. So it came as no surprise to people close to Mr. Thompson, 43, that when gunfire started ringing out during a protest here last Thursday, he was one of the officers running toward the shooting. This time, however, Mr. Thompson suffered the ultimate injury. He and four other officers were killed when a black Army veteran upset over killings by the police across the country opened fire, targeting white officers, the authorities said. The grim process of moving forward from one of America’s deadliest mass shootings of police officers began on Wednesday when Mr. Thompson, who worked for the Dallas Area Rapid Transit Police, and Sr. Cpl. Lorne Ahrens of the Dallas Police Department were given their final   during funerals that were by turns emotional and quippy. A private service was held Wednesday for another Dallas officer, Sgt. Michael J. Smith, and a public memorial is planned on Thursday. Services for the fourth victim, Officer Michael Krol, will be Friday, and the funeral for the fifth victim, Officer Patrick Zamarripa, will be Saturday. Even as mourners, including hundreds of officers who came here from across the country, took tentative steps forward, they acknowledged the cathartic backdrop against which Wednesday’s services took place: in a country rived by a debate over race and policing, upended by vast protests and nationwide soul searching. “Though I’m heartbroken and hurt, I’m going to put on my badge and my uniform and return to the street along with all of my brothers and sisters in blue,” Mr. Thompson’s wife, Emily, who is also a police officer, said with a shaky but steely voice. “To the coward that tried to break me and my brothers and sisters, know your hate made us stronger. ” The couple had married about two weeks before the shooting. Only about 12 hours before Mr. Thompson was shot, his wife had filed their marriage license with government authorities, Mr. Lamb said. About 8:15 that night, the couple spoke on the phone. “My shift’s over in 45 minutes, and then I’ll be home,” Mr. Thompson told his wife, according to Mr. Lamb. “He told her he loved her, and that’s the last time that he ever spoke to her. ” Mr. Thompson leaves behind six children from a previous marriage. He was a music enthusiast who occasionally played guitar and would send his children songs with his cellphone to see if they could recognize the tune. The funeral reflected the nuances of the conversation on race and policing that has enveloped the country. The service was held in the Potter’s House, the West Dallas megachurch where T. D. Jakes is the pastor. A noticeably diverse cast of officers filled the seats. Among them was Emily Thompson’s patrol partner, a black man, who stood next to her as she read her words of remembrance about her husband. As Brenda Lee, who is black and works for the Transit Police, sang “I Can Only Imagine,” her voice resonated with a gospel flair. Several people stood, some raising their arms in worship, when she hit the long notes. And among the final speakers was the chief of the Transit Police, James D. Spiller, who is black. It was a diverse showing in remembrance of a white man from a small town 55 miles south of Dallas. “Brent respected and loved all people, regardless of what color they were, where they came from,” Mr. Lamb said. But the reality was that Wednesday’s services were taking place beneath a cloud of national racial tension, and about 30 miles away from Mr. Thompson’s funeral, F. B. I. agents in camouflage and tactical gear were providing security outside Mr. Ahrens’s service in Plano. Friends and colleagues of Mr. Ahrens, 48, recalled his seemingly quixotic journey from his native Los Angeles to Dallas. He drove here with nothing but his dog and a few possessions stuffed into his Toyota. He slept on the floor of his apartment early in his police training because he had no bed. When a woman named Katrina first approached him, he was too shy to speak. She later became his wife, and they went on to have two children. “Your dad was doing what he was supposed to do,” the Rev. Rick Owen, senior pastor of Mr. Ahrens’s church, Pathway Church in Burleson, Tex. told the fallen officer’s    daughter and    son during the service. The Dallas mayor and police chief sat in attendance as Mr. Ahrens was remembered as a lover of guns and heavy metal music who did not know his own strength. He once bent a police car door on accident during training. “When you were on the radio screaming for help, you could count on Lorne to be the first to be there,” Sr. Cpl. Debbie Taylor said. The funerals drew officers from places as   as South Carolina and Indiana. “At times like this, we feel like we stand alone,” said Rick Keys, a lieutenant with the North Charleston, S. C. Police Department, who drove 15 hours with three of his colleagues to attend Mr. Thompson’s funeral. “It means a lot to the families to see the officers come from so far. ” Robert Parker, the assistant chief of police in Watauga, a city about 30 miles west of Dallas, said he hoped that this could be an opportunity for police departments and the communities they serve to come together. “We have a long way to go before we get where we need to be,” he said after Mr. Thompson’s funeral. “One of the things that I’ve talked to my wife about, and many others, is everybody on all sides of this, whether it’s Black Lives Matter, Blue Lives Matter, All Lives Matter, everyone needs to sit back and gain all the truth and the facts of each case before they pass judgment. If we do that and then we have an open dialogue and sit down and look at each other’s points of view, maybe we can go through this without further violence. ” After Mr. Thompson’s funeral, hundreds of officers lined up outside, saluting his coffin as an honor guard fired off a gun salute. The department then did what is known as a last call. A radio dispatcher, over a loudspeaker, called for Mr. Thompson, by his name and badge number, three times. When he did not answer, she said a final goodbye. “We will miss you, Brent,” she said. “You will never be forgotten. ”'"}, "time": 1742561742.467663}