{"duration": 0.01140737533569336, "input_args": {"text": "'NBC is reportedly “freaking out” because the network’s   talent Megyn Kelly has already been a “ratings disaster. ”  “They didn’t pay her $15 million for this. They are now worried that her numbers will be bad when she joins the 9 am hour of Today,” a source reportedly told Radar Online. “If Kelly tanks at 9 am she will also bring down Kathie Lee Gifford and Hoda Kotb at 10 am. ” The debut of Kelly’s Sunday Night With Megyn Kelly, with its   Vladimir Putin interview, could not even beat out a rerun of 60 Minutes. Her second show got clobbered as well. As Radar Online noted, Kelly’s interview with Erin Andrews “was destroyed by 60 Minutes, which scored 7. 66 million total viewers. Kelly got a paltry 4. 35 million people to tune in to her program. ” Already in desperation mode, NBC is reportedly “scrambling” to land big “gets” like Kathy Griffin or Adrianna Grande because, according to the source, the network seems to have already determined that “people are not tuning in to watch Megyn without huge guests. ” After reportedly being rejected multiple times, Kelly finally found a producer for her daily   morning show just last Friday. Veteran producer Jackie Levin agreed to produce the show, which is set to debut in September. NBC News reportedly had trouble locking down an executive producer for Kelly’s daily   show for months. According to one television insider, though “NBC and Megyn Kelly would like you to believe” her show did not have an executive producer because “there are just so many great people lining up for the job,” it was “quite the opposite. ” According to the insider’s source, Kelly and NBC had “approached some big names and they have all said no. ” Kelly reportedly wanted Bill Geddie, Barbara Walters’ longtime producer, to run her morning show. But he reportedly turned her down in addition to other top names because “no one wants to take the gig and most of the blame if Kelly flops at NBC. ” NBC News Chairman Andrew Lack has reportedly been busy lowering expectations for Kelly to the network’s affiliates. When news of NBC’s hiring of Kelly broke, one executive reportedly said that “the degree of difficulty” would be “extremely high” for Kelly and if she does not succeed, “she could end up fading into obscurity,” especially since her trial run at Fox News for a   show was panned and got terrible ratings.'"}, "time": 1742628443.5813916}