{"duration": 0.015652894973754883, "input_args": {"text": "'Sky Arts released the first trailer for its   television series Urban Myths on Wednesday  —   and the clip is making the rounds online with lightning speed due to its containing the first images of actor Joseph Fiennes as late pop superstar Michael Jackson. [Urban Myths: A Brand New Collection of Comedies consists of eight episodes featuring some of the most legendary tall tales about celebrities. In the Michael Jackson episode, Jackson, Elizabeth Taylor (Stockard Channing) and Marlon Brando (Brian Cox) take a   road trip after the September 11 terrorist attacks.  Other episodes reportedly tackle     stories about Cary Grant, Bob Dylan, Muhammad Ali, Alice Cooper, Samuel Beckett, the Sex Pistols and even a young Adolf Hitler. Fiennes’ casting as Jackson drew intense criticism when it was announced last year. The actor later defended the role in an interview with the Associated Press, though he said he was as “shocked” as anyone to have been casted in the part. “I deal in imagination, so I don’t think imagination should have rules stamped on them,” he told the AP. “If it promotes stereotyping, then it’s wrong. I made a distinction that the Jackson project doesn’t do that. ” The release of the trailer has done nothing to quell the criticism, judging from the reaction on social media Wednesday. I hope it loses every single dime of its budget. Every single dime. #UrbanMyths https:  .   —   Keith Powell (@KeithPowell) January 11, 2017,  They have Joseph Fiennes playing Michael Jackson. Maybe Tom Hanks will play Berry Gordy in the next Motown movie.  —   Jemele Hill (@jemelehill) January 10, 2017,  I. CAN’T. UNSEE. THIS. https:  .   —   janewells (@janewells) January 11, 2017,  I woke up feeling like it’s going to be a beautiful day and then I remembered this is someone’s idea of Michael Jackson: pic. twitter.   —   Soledad O’Brien (@soledadobrien) January 11, 2017,  IDGAF how pale Michael Jackson became. He was B L A C K and he said HIMSELF he didn’t want a Caucasian to play him in ANY film. Disrespect,  —   Stoney Σavage🏾🌙 (@Stoney_Blu) January 11, 2017,  Okay? But why does Joseph Fiennes as MJ look like the scarecrow you’d find at the edge of a pumpkin patch!?  pic. twitter.   —   Rosalina Watson † (@AboutRosalina) January 11, 2017,  Urban Myths is due to premiere January 19. Watch the trailer above.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628461.8674524}