{"duration": 0.1134800910949707, "input_args": {"text": "'November 6, 2016 210 The attempted assassination of Donald Trump at a rally in Nevada has some eerie similarities to the assassination of Robert Kennedy in 1968. Share on Facebook \\n1968 was a grim year in American history. The Tet Offensive in Vietnam made many people who were never part of the anti-war movement, question why America had entered a deadly war of attrition. In April of that same year, civil rights leader Martin Luther King Jr. was shot dead. \\nInto this fray stepped Robert Kennedy, a man whose intelligence, charm, charisma and modern policies came close to putting ice over the fire that was late 1960s America. He consciously stood as an anti-war Democratic in a primary which pitted him against the party’s pro-war establishment led by Hubert Humphrey, Lyndon Johnson’s vice president. Although the lesser known Eugene McCarthy also stood as an anti-war candidate, it was Kennedy whose personal fame and personal draw, turned heads and inspired voters more than any other. \\nBut it was not to be. In an America drowning in blood both at home and in the jungles of Vietnam, Robert Kennedy was the victim of an assassination. In the summer of 1968, Kennedy had just won the crucial California primary and was addressing his supporters at the Ambassador Hotel in Los Angeles. Just after he walked away from the podium, he was shot dead by the Palestinian gunman Sirhan Sirhan. \\nThe images of Robert Kennedy slouched dead on the floor become an iconic reminder that the 1960s for all of its counter-cultural optimism, was politically speaking, a very dark time for America. \\nHours ago, Donald Trump, a man who like Kennedy, challenged the pro-war establishment of his party and of Washington itself, was seemingly the victim of an attempted assassination plot. Although certain facts have yet to be revealed, what we do know is that a man making threatening gestures who is said to have had a gun was tackled by Trump’s supporters. Seconds later, security hurried Trump off state and arrested the would-be assassin. \\nIn spite of poor reporting from the ground, there are actually more facts at hand than there are mysteries. \\nDonald Trump has been vilified and dehumanized by the western mainstream media. His supporters are described as pigs, as the great unwashed, as the talentless, heartless and the stupid. He himself is described as much worse. Hillary Clinton called Trump supporters ‘deplorable’. In a country more ill at ease with itself than at any time since the Vietnam era, these words are very dangerous indeed. \\nMany sociologists postulate that the reason large sectors of the German population remained aloof and indifferent to the crimes of the fascist regime of the 1930s and 1940s, was because the victims of Hitlerism were purposefully constructed to be less than human by the state. Therefore a dead Russian, dead German Jew or dead Pole was somehow less of an issue than the death of a Hitler loving Teutonic man. \\nThe techniques applied to dehumanising Trump and his supporters are eerily similar. That is why, should any physical harm come to Donald Trump, the mainstream media have blood on their hands as much as any would be assassin. \\nTwo other things became clear. Donald Trump’s supporters warned him to leave for his own safety, they restrained the criminal, putting themselves in danger. It is fair to say, many of the brave men and women at the rally in Nevada were willing to give their lives for the man they support. This demonstrates that Trump’s supporters are not the savages that the mainstream media class them as. They are decent people who are angry at the path their country has taken and they feel a loyalty and fraternal bond with a man who speaks to them rather than at them, above them or around them. \\nHillary Clinton and her supporters in the media have put Donald Trump’s life in danger and the look on Trump’s face as he was hurried away by security, showed me a man who loves life, a man who deplores violence and a man who would not want to leave his family behind. I was tragically reminded of the scenes of Gaddafi’s assassination when he begged his executioners, ‘what have I done to you’. \\nThis is not a man who wants war, this is a man who wants to live in a world of peace, with all its joys, its profundities, its frivolities and its rough edges. \\nI am reminded of the words spoken by Marc Antony at the end of Shakespeare’s Julius Caesar: \\n“This was the noblest Roman of them all: All the conspirators save only he did that they did in envy of great Caesar; He only, in a general honest thought And common good to all, made one of them. His life was gentle, and the elements So mix’d in him that Nature might stand up And say to all the world ‘This was a man!” \\nOne could say the same of Trump. \\nUpdate : The authorities have still not said whether the man in question had a gun or not, but the fact he has been released demonstrates either incompetence in terms of the investigation or that he was a hooligan rather than a would be murderer. Photos of the man emerged and as initial witnesses reported, he clearly looked deranged. \\nThe media has turned this election into a potentially deeply violent affair. All ready they are making the hooligan look like the victim rather than the assailant. This may well not end after the 8th of November. '"}, "time": 1742561760.4525464}