{"duration": 0.04304647445678711, "input_args": {"text": "'Actress Alyssa Milano says the task of “removing” President Donald Trump from office is up to the women of the United States. [“Trump has proven that he really can’t take the heat in the White House kitchen. But, he won’t get out of it, either. His ego won’t let him. Removing him will be up to us,” the Who’s the Boss actress wrote in an essay published in Marie Claire.   Milano says the “crushing,   blow” of Trump’s election spurred women to begin “organizing the resistance. ” The actress writes: “Most of us thought —  no, assumed —  that when we woke up on November 9, 2016, we’d be looking into the poised and confident face of the first female president. We stepped up! The powerful Hillary Clinton, a lifelong civil servant, politician, wife, mother, and former First Lady seemed to embody all the glorious elements of a modern leader. Instead, we arose to the sinister smirk of her opponent, the ‘dark horse.’ All we heard were our hearts drop over the deafening mic drop. ” The    actress later describes Trump as “an egomaniac with no political experience, questionable business ethics, and a crude moral compass” who “has been charged with running our big, beautiful, diverse, country. ” Milano’s essay came on International Women’s Day, which saw   #DayWithoutAWoman protests around the world and in the U. S. organized by leftist Women’s March activists. The actress says Trump’s election forced women to begin “fighting back with marches, rallies and town hall meetings. ” “So, with powerful hearts and pussies, we began the fight,” she writes. “We grabbed back. We realized the power of our collective voices and awakened a sleeping, feminist giant. She’s smart. She’s beautiful. She’s strong. She’s pissed. ” “Feminine power is boundless. Women can change the world. We already have  …    and we’re not giving up now. The march goes on. ” Milano was an early supporter of Senator Bernie Sanders’ presidential bid. She’s spent much of her time on social media slamming Trump’s policies.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742561793.1347396}