{"duration": 0.08208417892456055, "input_args": {"text": "'We Are Change \\nNorth Dakota had nearly 300 oil pipeline spills in less than two years, none of which were reported to the public.\\nFrom January 2012 – September 2013, these pipeline spills were just a part of approximately 750 “oil field incidents” that took place in the state without the public’s knowledge, according to a report by The Associated Press . It’s estimated that around 4,328 barrels worth of oil were spilled in this period. \\nIn an another case, a break in a Tesoro Corp. pipeline resulted in approximately 20,600 barrels of oil spreading over an area the size of seven football fields. Officials claimed that no wildlife or water sources were harmed by the spill, which apparently led them to conclude that the public did not need to be notified.\\nThe only incident in which the public was notified was an instance in which an oil truck was involved in a collision in 2012.\\nWhile many of these spills were relatively small and arguably had little environmental impact, landowners expressed outrage that they were kept out of the loop. North Dakota Department of Mineral Resources director Lynn Helms said that they didn’t want the public to become “overwhelmed by little incidents.”\\nHowever, landowners like wheat farmer Louis Kuster said it is “absolutely important for us to know” if spills of any kind occur, particularly given his livelihood’s reliance on the health of his land. Even a single barrel of spilled oil has the potential to ruin water sources and acres upon acres of valuable cropland.\\n“Right now, you don’t know if there is a spill unless you find it yourself,” Kuster said.\\nWhile the release of AP’s report ultimately led to more regulations obliging the public release of reported oil spills, including an online database of spills accessible to the public , this history of secrecy provides a troubling context for the Sioux Tribe’s distrust of the DAPL pipeline construction.\\nThe Sioux Tribe says that the pipeline “threatens the Tribe’s environmental and economic well-being, and would damage and destroy sites of great historic, religious, and cultural significance to the Tribe.”\\nIn a tense standoff with heavily armed police forces, dozens of protesters – referring to themselves as peaceful water protectors – were arrested today for demonstrating against the construction of the pipeline on what police say is private property.\\nNathan Wellman is a Los Angeles-based journalist, author, and playwright. Follow him on Twitter: @LightningWOW \\nH/t http://usuncut.com/news/north-dakota-292-oil-spills-2-years-officials-disclosed-1-public/ \\nThe existence of an officially listed endangered species, a small butterfly called the Poweshiek Skipperling ( Oarisma poweshiek ) , with federally designated Critical Habitat areas in North Dakota’s McKenzie County, has been flagged by activists as possibly relevant to challenging the pipeline permit. ( More species info ).\\nThe endangered Poweshiek Skipperling (Oarisma poweshiek). Photo via US Fish and Wildlife Service, by Gerald Selby \\nNine other endangered species present in McKenzie County are referenced in the US Army Corps of Engineers documents , but not the Poweshiek Skipperling.\\nAccording to the US Fish and Wildlife Service, two ‘units’ of Critical Habitat lie near the Missouri River in McKenzie County. Along the entire pipeline route, residents fear erosion and runoff problems (including many Iowa farmers), but there is no mitigation mentioned in official documents for the butterfly’s sensitive, federally protected areas in McKenzie County.\\nBesides bulldozing areas near protected species’ enclaves, private capital has brought with it private agents of violence to impose its will. Controversial private security forces involved with violently forcing aside pipeline opponents include 10 Code LLC , based in nearby Bismarck, ND. The shocking attack dogs unleashed on Indigenous water protectors including a child and pregnant woman\\nRELATED BREAKING: The NEW Election FEC Violation That Should End Clinton’s Campaign . Russia Trolls The U.S., Offers A “Helping Hand” In Overseeing Elections Follow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post North Dakota had 292 oil spills in 2 years officially disclosed 1 to the public appeared first on We Are Change .\\n'"}, "time": 1742563262.7859507}