{"duration": 0.16352510452270508, "input_args": {"text": "'  Shocking Proof That The Mainstream Media Gives You More ‘Fake News’ Than Any Satire Site Ever Will Our lead-off fake news story is a classic. Filmed during the first Gulf War, it shows CNN \"journalists\" Charles Jaco and his crew pretending to be giving a \"breaking news\" update on the fighting. The only problem is that the outtakes clearly show they are not on the front lines but in a poorly decorated television studio. CNN presented this as real-life, happening now news. Completely fake.   23, 2016 In short , the current news that there should be a campaign against ‘fake news’ is of itself a fake news story. \\nThe progressive Left , spearheaded by the liberal media and Barack Obama, want you to be outraged over the current level of ‘fake news’ that is disseminating across the globe. What they mean when they say this is that they want satire sites, like The Onion , to be shut down. They attempt to make the laughable claim that satire sites “ changed the course of the presidential election .” But in point of fact, people are no more fooled by these sites than they are by ‘fake news’ broadcasting like SNL’s Weekend Update and The Daily Show . Sites like these fill the gap that magazines like MAD and National Lampoon did years ago. And while a random sampling of low information Americans may be fooled by these satire sites, the vast majority of intelligent, everyday people are not. \\nIn short , the current news that there should be a campaign against ‘fake news’ is of itself a fake news story. But this is how they distract you, much like the streetcorner magician who has you looking off in one direction while he gins up his trick in the other. \\nSo let’s take a look at a few times where the media and our government has deceived us with ‘fake news’ masquerading as an actual story. CNN Classic ‘Fake News’ Broadcast Pretending To Be On The Front Lines But Was Actually In TV Studio: \\nOur lead-off fake news story is a classic. Filmed during the first Gulf War, it shows CNN “journalists” Charles Jaco and his crew pretending to be giving a “breaking news” update on the fighting. The only problem is that the outtakes clearly show they are not on the front lines but in a poorly decorated television studio. CNN presented this as real-life, happening now news. Completely fake. The assassination of JFK and the ‘fake news’ of the Warren Report commission: \\nIn 2016, there is so much information online regarding the Kennedy killing that no one seriously believes that Lee Harvey Oswald shot him or ever fired a shot at all. But J. Edgar Hoover insisted that Oswald take the fall , and the ‘fake news’ Warren Commission was hatched to advance that narrative 36 Times Obama Said You Could Keep Your Health Care Plan ‘Fake News’ Scam: \\nOne of the greatest ‘fake news’ scams of the modern era is hoaxer-in-chief Obama saying that “ if you like your plan, you can keep your plan “. Not only did this turn out not to be true – but – Obama was fully aware he was lying each and every time he said it. Not only that, every single media outlet in America repeated the lie, knowing it was a lie. George Bush selling the ‘fake news’ lie that Saddam Hussein had ‘weapons of mass destruction’: \\nHoo-boy, this was quite the ‘fake news’ whopper. Exactly what you would expect from the Bush Crime Family . Who helped Bush to sell this ‘fake news’ to the American public? Our old frenemies at the main stream media. How many US soldiers died as a result of this ‘fake news’ story? Right around 5,000 men and women were sacrificed for this. How our government and media use crisis actors to drive a narrative at staged horrific events: \\nOf all the ‘fake news’ stories out there , this is one of the toughest to talk about. No, we are not saying that people didn’t actually die at places like Sandy Hook and other places, because they did. But that does not mean that the event that killed them was not a staged event involving paid crisis actors. So for this one we are going you a couple of videos to consider. FBI’s own statistics reveal that no one died in the Sandy Hook shooting: \\nBefore you go and accuse us of being “insensitive” to tragedy, take a look and see the official number of deaths in Newtown, CT, in 2012. Why are the “27 victims” of the Sandy Hook shooting not on the FBI list? Hmm…looks like the FBI agrees with us. CLICK TO VIEW THE OFFICIAL FBI WEBSITE FOR HOMICIDE STATS IN CONNECTICUT IN 2012 \\nBy now, you can clearly see who the real perpetrators of ‘fake news’ actually are. Its brought to you by our own government, and by the crooked and corrupt pretend news media who spend 24 hours per day broadcasting stories that are various degrees of falsehood. \\nAnd what they are so upset about this year is that because of WikiLeaks , they were unable to use their ‘fake news’ to elect Hillary Clinton as president. The American people rejected their nonsense and journalistic lies, and they were left swinging in the breeze. \\nAs Kramer said so many years ago “ the only true news is the alternative media “. SHARE THIS ARTICLE  '"}, "time": 1742563862.735175}