{"duration": 0.06474995613098145, "input_args": {"text": "'Germany Urged to Pause on Syrian Escalation November 10, 2016 \\nFormer CIA analyst Ray McGovern presented the following statement to members of Germany’s Bundestag on Thursday, advising them against the proposed deepening of Germany’s military involvement in the Syrian conflict. \\nBy Ray McGovern \\nIn view of the surprising election victory of Donald Trump, today’s vote in the Bundestag has assumed even greater importance. There are very passionate warmongers in the United States. Thank goodness, President Obama is not one of them. I believe that Donald Trump, like Obama, would like to find a way to end the armed chaos in Syria. \\nI believe it is quite possible that both – Obama and Trump – would prefer that the German government avoid taking steps that would encourage the “hawks” in Washington. The widening of the Syrian war into a NATO war would be such a step. Former CIA analyst Ray McGovern \\nIn my opinion, a peaceful solution to the disaster in Syria is not possible without cooperation with the Russians. This cooperation would be more likely with a President Trump than it would have been with a President Hillary Clinton. Let’s take the time for a DENKPAUSE – time to think this through. (I myself voted for Dr. Jill Stein. She was the presidential candidate of the U.S. Green Party, a small electoral party committed to peace and protecting the environment.) \\nYesterday, I was part of a group that, in our parlance, belongs to the “one percent” (the elite). In this group was a former U.S. ambassador to NATO. The former ambassador was asked whether it would not be better to talk with the Russians, and to negotiate. He answered the question in a very condescending way: “You are obviously a Trump supporter. But Hillary Clinton will surely win.” The ambassador added that in this case it would be nonsense and unrealistic to expect early negotiations with the Russians. \\nNow I admit, “Donald Trump is no Jack Kennedy.” BUT, to make a long story short: I believe that next year with Trump could make possible a more sensible Ostpolitik – policy toward countries to the East of Germany. There could be a relaxation of tension, instead of the escalation that causes more and more of it. \\nI believe we should consider the Russians as partners and NOT as enemies. And to quote Winston Churchill, “It’s better to be jaw-jaw than to-war;” it’s better to talk to each other than to go to war. \\nMost important, we should take seriously the opportunity for genuine detente. We must now take a DENKPAUSE. The Bundestag should also do some serious rethinking. Let us think of something new – beyond images of the enemy and military solutions. \\nFor, as we all know so well, DIE GEDANKEN SIND FREI . \\nDie Gedanken sind frei, wer kann sie erraten, sie fliegen vorbei wie nächtliche Schatten. Kein Mensch kann sie wissen, kein Jäger erschießen mit Pulver und Blei: Die Gedanken sind frei! Thoughts are free, who can guess them? They fly by, like nocturnal shadows. No one can know them, no hunter can shoot them with powder and lead: Thoughts are free! \\nIch denke was ich will und was mich beglücket, doch alles in der Still’, und wie es sich schicket. Mein Wunsch und Begehren kann niemand verwehren, es bleibet dabei: Die Gedanken sind frei! \\nI think what I want, and what delights me, But always in the quiet, and how it is suitable. My wish and desire, no one can deny me, and so it will always be: Thoughts are free! \\nUnd sperrt man mich ein im finsteren Kerker, das alles sind rein vergebliche Werke. Denn meine Gedanken zerreißen die Schranken und Mauern entzwei: Die Gedanken sind frei! \\nAnd if I am thrown into the darkest dungeon, all such actions are futile, because my thoughts tear all gates and walls apart: Thoughts are free!'"}, "time": 1742562703.2138896}