{"duration": 0.07543063163757324, "input_args": {"text": "'Hillary Is DONE After Blunt Cowboy Makes Shocking Announcement On Live TV Posted on October 27, 2016 by Amanda Shea in Politics Share This Fox News Host (left), Texas Agriculture Commissioner Sid Miller (right) \\nLies and cover-ups don’t sit well with Texas Agriculture Commissioner Sid Miller who took advantage of his live interviewÂ to make a shocking announcement. After exposing Hillary Clinton and leaving the reporter speechless, it’s safe to say that it’s over for the lying Democratic candidate. \\nMiller went on Fox News on Wednesday to discuss what he was witness to in his state that Hillary definitely didn’t want to get out. With election day just around the corner, when a crucial decision falls into the hands of Americans who will determine the course to the country for the next four years, the proudÂ cowboy didn’t hold back. He delivered a stunning statement thatÂ not only put Hillary in her place, it shut her down completely. \\nThis election has been unlike any other in history and apparently so has the early voter turnout, namely in the Lone Star State. It’s not even voting day yet, but patriotic Texans have already turned out in record-breaking droves to be sure to get their ballot in early, with an overwhelming number voting for Donald Trump. The attendance at his rallies seems to have translated to the polls, but Miller also revealed something else in his statement that needs to be known. \\n“We have a record number of people registered to vote in Texas. Weâ\\x80\\x99re having record turnouts, the first day, the second day of voting. And itâ\\x80\\x99s not Bernie Sanders supporters coming out to support Hillary. Itâ\\x80\\x99s not Barack Obama supporters coming out to support Hillary,” he first announced before makingÂ the next stunning statement. “ Itâ\\x80\\x99s a new surge of Trump voters, many who have never registered to vote. Many who have not voted in eight or ten elections so theyâ\\x80\\x99re not reported in the polls â\\x80Ś” YUGE RECORD BREAKING VOTES in TEXAS!!! & Its Not Bernie Fans or Obama Voters for Hillary Clinton!! ALLL Donald Trump Folksđ\\x9f\\x98\\x83 #wednesdaywisdom pic.twitter.com/Sn79fMhwXG \\n— DEPLORABLE TRUMPCAT (@Darren32895836) October 26, 2016 \\nTrump has awoken the American spirit in all of us, including those with no previous interest in politics or voting who now feel called to action by his energy and the need for that in our leadership.Â Hillary has tried her hardest to convince the public that the race is over before it’s even ended by claiming the win and painting Trump as inept. She’s employed tactics of oversampling Democrats to skew the poll results and “prove” her point, but the reality is revealedÂ in the record we’re seeing set already in Texas â\\x80\\x94 which is likely just the start. \\nThe only emotion Hillary has stirred in the majority of citizens is divisiveness and hate, while her counterpart has done something she is not and will never be capable of. Single-handedly, Trump brought back what Americans have been desperate for over the last eight years of lame duck leadership from Barack Obama. We want someone who proves that he loves his country, is ready to enact real change that everyone can see and not just be lied to about, a man who keeps his promises, loves the God that our country was built on, and will do whatever it takes to honor our rights and defeat our enemies.'"}, "time": 1742563740.276196}