{"duration": 0.04786324501037598, "input_args": {"text": "'This post was originally published on this site \\nsott.net/news \\n© Bashir Khan Safi / Agence France Presse An Afghan man carries the dead body of a child following a NATO coalition airstrike on the outskirts of Kunduz on November 3, 2016. \\nScores of civilians, including children, have reportedly been killed in US airstrikes supporting a ground operation in Kunduz, Afghanistan, officials and media report. NATO forces in Afghanistan said the airstrikes were “to defend friendly forces under fire.” \\nEarlier on Thursday, United States Forces Afghanistan released a statement, saying that two US servicemen had died “as a result of wounds sustained during operations” in Kunduz. \\n“The service members came under fire during a train, advise and assist mission with our Afghan partners to clear a Taliban position and disrupt the group’s operations in Kunduz district,” the statement said. \\nResolute Support, a NATO-led training mission in Afghanistan, tweeted that the airstrikes in Kunduz had been carried out to defend “friendly forces under fire.” \\nBrigadier General Charles Cleveland, a spokesman for the United States military in Afghanistan, said that he couldn’t say whether the civilian deaths near Kunduz and the attack on US soldiers were related, but noted that the deceased American servicemen had been as advisers to an Afghan military operation. \\n“We have no evidence at this point of any civilian casualties, but we take all allegations very seriously,” he said, as cited by the New York Times . “Although this was an Afghan operation advised by US forces, US aircraft were used to defend all of the friendly forces.” \\nAfghan officials told Reuters that there had been heavy fighting between Taliban fighters and the US military about five kilometers from the city center. The US then reportedly called in airstrikes that resulted in numerous casualties. \\nLocal activists shared photos of what they say are dead bodies of the airstrike victims with RT. RT cannot independently verify the authenticity of the images. \\nGeneral Qasim Jangalbagh from the Kunduz police said the air raid had resulted in the deaths of about 26 people, AP reported. \\nKunduz’s provincial spokesman, Mahmood Danish, told AFP that the airstrikes had killed 30 civilians, including women and children. \\n“Afghan forces and coalition troops conducted a joint operation against the Taliban insurgents. In the bombardment 30 Afghan civilians were martyred and 25 others were wounded,” he said. \\nPolice spokesman Mahmoodullah Akbari gave similar toll to AFP, saying that infants as young as three months old were among the dead. \\nLocal activists shared photos of what they say are dead bodies of the airstrike victims with RT. RT cannot independently verify the authenticity of the images. \\n“They were asleep when their house came under attack by coalition troops,” Akbari said. \\nSafiullah Amiri, a member of the Kunduz Provincial Council, said at least 30 civilians had been killed in a series of airstrikes on the village, the NYT reported. The paper also cited Islamuddin Timoori, a representative of the protesters from Kunduz, who said that the bombing had been carried out by the US, killing 27 people and wounding 70. \\nAccording to Pajhwok, “the airstrikes and ground offensive” were conducted by “Afghan and foreign forces” in the Pul Achin and Poz Kandahari areas on the outskirts of Kunduz. \\nPajhwok reported that the airstrikes had prompted the citizens of Kunduz to take to the streets in protest. The protesters reportedly were carrying the bodies of people killed in the attack, including those of the children. Photos of the corpses of the alleged victims have been circulating on social media. \\n“I was working on the farm when suddenly the bombardment started in our area. When I came to my house seven members of my family, including women and children, were killed,” Kunduz resident Taza Gul told Pajhwok Afghan News. \\nBilal Sarwary, a local journalist citing sources in the Afghan government, reported that at least 31 civilians had been killed during an Afghan-NATO special forces operation on Thursday night. \\nCiting Afghan government sources, he tweeted that “Afghan and US Special forces were surrounded and were taking heavy fire when the airstrike was called.” Related '"}, "time": 1742628600.3553815}