{"duration": 0.017425537109375, "input_args": {"text": "'Over 100 people gathered in front of the Hall of Justice in Downtown Los Angeles on Wednesday evening to protest L. A. County Sheriff Jim McDonnell’s opposition to State Senate Bill 54, which would declare all of California a “sanctuary state. ”[According to the Los Angeles Daily News, protesters held up signs that read, “One struggle, united” and “We demand immigrant rights. ”  David Abud, with the National Day Laborer Organizing Network, reportedly spoke over a loudspeaker against SB 54. He said McDonnell’s “argument is that if we don’t pass this, ICE is going to   our community with deportation. That is a ridiculous argument. ” Last month, 161 illegal aliens were arrested throughout Southern California by federal immigration authorities. (Some raids are reportedly ongoing.) The raids took place over the course of several days and resulted in the arrests of 680 illegal aliens across multiple states. That, in turn, upset many of the state’s Democratic lawmakers. SB 54 was introduced by California State Senate President Pro Tem Kevin de León (  Angeles) in December. In February, Breitbart News reported that de Léon said that “‘half his family’ was in the country illegally, using false documents, and eligible for deportation under President Trump’s new executive order against ‘sanctuary’ jurisdictions. ” According to the Daily News, McDonnell wrote to De León earlier this month: “SB 54 would not allow the safe transfer of custody rather it would force immigration enforcement agents into our communities in order to search out and find the person they seek. While doing this, they will most surely cast a wide net over our communities, apprehending and detaining those not originally the target of the enforcement actions. ” Breitbart News reported that on Tuesday, newly   L. A. Mayor Eric Garcetti released a new set of protections for illegal aliens that cement the city’s status as a sanctuary city, and defy the Trump administration’s efforts to ensure compliance with federal law. SB 54 is likewise cast as a direct rejection of President Trump’s recent executive crder, “Enhancing Public Safety in the Interior of the United States. ” The January 25 Executive Order states: “Sanctuary jurisdictions across the United States willfully violate Federal law in an attempt to shield aliens from removal from the United States. These jurisdictions have caused immeasurable harm to the American people and to the very fabric of our Republic. ”'"}, "time": 1742628379.754227}