{"duration": 0.03743290901184082, "input_args": {"text": "'Senate Republicans are weighing options to either push for state waivers to Obamacare regulations or   Americans for health insurance to bring down premiums. [Senator Ron Johnson ( ) told reporters, “There’s no reason that premiums on the individual market should double and triple in a state like mine. There was no reason for that other than Obamacare. We need to diagnose that, then figure out what policies we can agree on to bring those premiums down. ”  Republican Senators aim to lower premiums, although the Senate health working group remains divided on how to reduce health costs. Some floated the idea of giving states waivers to Obamacare’s essential health benefits, in a similar fashion to the House’s American Health Care Act (AHCA) while others want to   Americans without health insurance into catastrophic health insurance plans. Johnson told reporters that regulations “absolutely” need to be addressed. When asked whether he would protect   conditions, he said, “I’m guaranteeing nothing other than my effort to try and bring those premiums down. ” Senate Health Committee Chairman Lamar Alexander supports giving states more authority to regulate insurance. He said, “We would like to move more decisions out of Washington, back to the states, about regulating insurance. ” Senator Bob Corker ( ) echoed Sen. Alexander’s statement, saying, “I have to believe that when you mandate ten essential health benefits in a rigid way that it affects the cost of premiums. ” Corker added that any reform must also include protections for   conditions. Sen. Bill Cassidy ( ) leads another camp that wants to   Americans without health insurance into a basic, catastrophic health care plan, paid for by an individual’s federal tax credit. Cassidy’s camp argues that this would force more healthy people into the Obamacare exchanges to balance out the costs of sick and older Americans. The Louisiana senator explained, “Your best way to lower premiums is to expand the risk pool   …       would allow expansion of the risk pools. ” A senior GOP aide said that   is “absolutely” the solution to lowering premiums. The aide said that Senator John Cornyn ( ) spoke about   at the Senate health working group and it was “well received. ” Another senior GOP aide alleged that   is “is one of many ideas being examined for their utility and impact   …     There’s no leading options yet lots for members to explore and implications to assess before any decisions will be made. ”   Americans in catastrophic health insurance has been floated by conservatives before. Sen. Bill Cassidy and Rep. Pete Sessions ( ) sponsored a bill that would enable   in health care. The American Enterprise Institute released a white paper that advocates   for health care plans to ensure universal health insurance for all Americans. Senate staffers think that   Americans would serve as a better incentive than an individual mandate, or the 30 percent insurance premium for those who forgo health insurance in the American Health Care Act. One senior GOP aide said that “IHeat’s not viewed as a harmful mandate, because there’s no consequence. ”'"}, "time": 1742561958.2227232}