{"duration": 0.01981830596923828, "input_args": {"text": "'On Thursday’s broadcast of the Fox News Channel’s “Your World,” Senator Rand Paul ( ) argued the revised American Health Care Act is “the first time that Republicans have affirmatively put their stamp of approval on a program where federal money, taxpayer money, is paid to insurance companies. ” He later characterized subsidizing insurance companies as “deplorable. ”  Rand said the House Freedom Caucus “made the bill a lot less bad. ” He added, “But what I’m still concerned with is, this’ll the first time that Republicans have affirmatively put their stamp of approval on a program where federal money, taxpayer money, is paid to insurance companies.   …     And it boggles my mind how that became a Republican idea. ” Rand further stated, “It’s going to take a little bit of work to get me to a yes vote, but I do have an open mind. I mean, there’s not been a louder voice up here for repealing Obamacare. I really want to repeal it. I just don’t want to replace with   or another federal program. The programs they put in place will be there forever. So the refundable tax credit, which is a subsidy by another name, will be there forever. And this  —   these buying  —   these   pools they want to create, Republicans used to hate the idea. They hated the idea when they were called risk corridors, and there were giving money to insurance companies. They were bailouts, when it was a Democrat idea. Now that it’s a Republican idea, they keep sweetening it up. ” He later argued that the bill offers people who won’t get subsidies anymore “Santa  . ” Rand also said, “I want everybody in the individual market to be protected against   conditions, by getting into the group market, and let market forces work. It can work, but the current bill acknowledges that it doesn’t work, and then we just subsidize the insurance companies, which I think is deplorable. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742628451.7807279}