{"duration": 0.16012167930603027, "input_args": {"text": "'DOUGLASVILLE, Ga.  —   “Caliente!” the director Lee Daniels howled toward Naomi Campbell, across the waiting room of a decommissioned county jail. “Wonderful, Naomi, wonderful  —   I love it!” After another take, Mr. Daniels crooned, “Cruella de Vil, Cruella de Vil,” gleefully comparing the   ’s haughty, villainous performance to the infamous “101 Dalmatians” character. As both boss and head cheerleader, he was in his element. Mr. Daniels, though not officially directing that day in   was overseeing the filming of his new Fox series, “Star,” about a girl group clawing its way through Atlanta’s booming music universe. Ms. Campbell’s scene, a showdown between two disparate matriarchs over the fate of a young woman caught between worlds  —   after an episode of police brutality  —   had him charged up. “It’s all fabulous,” Mr. Daniels said. “The physical altercation”  —   between Ms. Campbell’s character and one played by Queen Latifah  —   “is even better than I thought it was going to be. You see two different classes of black women, and yet the rich one pushes the poor one. So much privilege!” It’s exactly that blend of     social consciousness and histrionic soap opera that has driven Mr. Daniels’s triumphs in film (“Precious,” “The Butler”) and television, where he scored big for Fox with the Shakespearean   melodrama “Empire,” beginning in 2015. But while “Empire,” now in its third season, relies on bombast and opulence, with a plot twist every few scenes  —   “Dynasty” and “Dallas” by way of peak Puff Daddy and Bad Boy Records  —   “Star” finds its creator returning to his earlier, grimier palette, including foster homes and addiction, for a slightly more earthbound tale. Still, the new show, part of Mr. Daniels’s  “Empire” production deal with Fox, will be expected to deliver in prime time the way its predecessor did. Its premiere in December, following the “Empire” midseason finale, drew strong   viewership  —   especially considering its leading trio of unknown actresses  —   but starting with its second episode on Wednesday, Jan. 4, “Star” will be going it alone. (Adding pressure, “Empire,” once a ratings juggernaut, has seen its impact wane recently, hitting viewership lows, though it remains the network’s   cornerstone.) “I’m doomed,” Mr. Daniels, uncensored and casual in luxurious black sweats, said playfully a few weeks before his set visit, during an interview at his Midtown Manhattan apartment. “Hollywood builds you up to take you down  —   I’ve learned that from many friends. ” Yet instead of returning victoriously to movies, particularly a   Richard Pryor biopic, Mr. Daniels was persuaded to double down on another network show about the music business, despite the mixed results of recent programming  —   “Vinyl,” “Atlanta,” “The Get Down”  —   set in the record industry. “My boyfriend said, ‘On TV, more people will appreciate your work, even if it’s not as potent, than on any film you ever do,’” Mr. Daniels recalled. He seemed unconcerned about competition. “Which one’s ‘The Get Down’?” Mr. Daniels asked. “Do they sing in ‘Atlanta’?” “Star,” which addresses Black Lives Matter and transgender issues in the first episode, also comes at a loaded moment politically. Mr. Daniels assumed, as he was sketching the   first season, that Hillary Clinton would win the presidency. He imagined the show’s diverse girl group  —   one poor and white, one rich and black, one of mixed race  —   as an imperfect yet inspiring portrait of racial unity and healing. “I was going to hit you with stings of ‘this is what’s going on in the streets,’” Mr. Daniels said. Now, instead of ratcheting up the politics under the coming administration of President Donald J. Trump, “It’s really going to be more of a place of escape. ” He cited 1960s sitcoms like “Bewitched” and “I Dream of Jeannie” as mass entertainment necessary in uncertain times. Even if he hopes to avoid positioning “Star” as a protest show, though, it still has progressive, confrontational themes at its core  —   albeit expressed through Mr. Daniels’s idiosyncratic lens. In casting Star, the title character, amid a period of racial tumult stemming from police shootings, Mr. Daniels said, “I wanted to show a white girl that had some swag” as “part of the healing process. ” He added: “I wanted white people to feel cool. I wanted them to not be made fun of. We are one. ” He found his girl in Jude Demorest, a     performer from Detroit, with a pile of   ringlets and earrings the size of her face. The character, as written, “had all but her Social Security number,” Mr. Daniels said. Ms. Demorest agreed: “It was the first role where I never had to fake an accent or not wear my hoops to the audition or straighten my hair. ” (The show nods at racial dynamics in the industry, with one character joking, “a white girl who can sing RB  —   even the mediocre ones go platinum. ”) On the other hand, Mr. Daniels said he created Derek, the show’s young Black Lives Matter activist played by Quincy Brown, as a message to his son, who had recently left what Mr. Daniels called his Upper West Side “bubble” and began experiencing   racism. “Star,” despite its modern   milieu, with original songs by a team including the longtime producer Rodney Jerkins that recall Rihanna and Fergie, is filled with other personal flourishes for Mr. Daniels, who said the show’s essence was inspired by his time trying to break into Hollywood: “What happens when you’re young and naïve, and you’ll do anything to get to where you want to go?” Queen Latifah, who plays Carlotta, a beautician and den mother to the singers, said: “So many parts of this take me back. I’ve come full circle after starting as a hungry   wanting to get a deal and change the economic circumstances of my family. ” She also recalled seeing striving’s ugly side  —   “how hungry people can be, selling their soul to have that success. ” The idea of using desperate, wily young women to tell a version of that story grew out of Mr. Daniels’s childhood love of “Dreamgirls,” which he said taught him that “we’re from the ’hood and we can still be fabulous. ” Other influences included “Valley of the Dolls” and “Paris Is Burning,” both of which Mr. Daniels had considered remaking Ms. Demorest also said that he told her to watch “Sweet Charity” and “Female Trouble” during the audition process. As for making them a modern pop trio  —   Ryan Destiny plays Alexandra, who has determined to make it in music without the help of her internationally famous   father (Lenny Kravitz) and Brittany O’Grady plays Simone, Star’s shy, damaged half sister  —   Mr. Daniels said he liked that there wasn’t a notable girl group at the moment, though he later learned of the existence of Fifth Harmony. (Ms. Demorest, coincidentally, was a writer on that group’s biggest hit, “Work From Home. ”) “They only last for a few years  —   because they implode,” Mr. Daniels said, with delight, of girl groups. “That’s just the nature of the beast. ” (In fact, Fifth Harmony would lose a member to a solo career not long after “Star” had its premiere.) Careful attention to group chemistry led Mr. Daniels and Fox to audition Ms. Demorest, Ms. Destiny and Ms. O’Grady about a dozen times, mostly as a unit, before choosing them for the roles. Despite Mr. Daniels’s   approach at every opportunity  —   he will direct the “Star” season finale in addition to its first two episodes  —   learning to relinquish some authority has been a sometimes rocky process in his shift to TV. “It’s not like a movie where you can control it from A to Z,” he said. “There’s a director who has an interpretation of your interpretation, and you haven’t personally written all of the episodes. ” He created “Star” with Tom Donaghy (“The Mentalist”) not his “Empire”   Danny Strong, who also wrote “The Butler. ” “I don’t think Danny would understand this world,” Mr. Daniels said. “This would not have been the right partnership for us, because of the specifics  —   it’s an underbelly. ” Early episodes touch on sexual abuse, human trafficking and an assault of a transgender woman outside a strip club. Gary Newman, the chairman and chief executive of Fox Television Group, credited Mr. Daniels’s work for the authenticity of “Star. ” “It’s hard, but we want to be a   network,” he said. “We want all people to feel they’re welcome. ” Mr. Daniels’s broad demographic appeal is also “good business,” Mr. Newman said. “Prior to ‘Empire,’ I think there was an underserved audience. ” At the same time, despite his role in diversifying TV, Mr. Daniels can be sent into a fit of frustration at a mention of last year’s #OscarsSoWhite controversy over representation at the Academy Awards. (He was nominated for best director for “Precious” in 2010.) “Go out and do the work,” he fumed over oatmeal at his apartment. “Oscars so white! So what? Do your work. Let your legacy speak and stop complaining, man. Are we really in this for the awards? “If I had thought that way  —   that the world was against me  —   I wouldn’t be here now,” he added. “These whiny people that think we’re owed something are incomprehensible and reprehensible to me. I don’t expect acknowledgment or acceptance from white America. I’m going to be me. ”'"}, "time": 1742564458.8129716}