{"duration": 0.4628756046295166, "input_args": {"text": "'The Season 7 “Real Housewives of New Jersey” reunion show took place in October in a theater in Westbury, N. Y. An elaborate    thing had been constructed on a stage that would soon seat the five Housewives, complete with a   rug and zebra chairs, everything sparkling, everything  . The set was erected so specifically and thoroughly that it included a kitchen in the back, unusable but complete, that you could see only a fraction of, and a fireplace that the cameras would never pick up. “That’s not a real fireplace?” I asked a production assistant, who answered, “It’s not not real. ” The five contracted Housewives arrived on Long Island the night before for this   reckoning of the season’s tensions, equal parts State of the State panel discussion and   of every lunchtime confrontation that occurred at my   high school. The Housewives were shuttled in black S. U. V.s under the cover of darkness to a hotel more than two hours from where they live, in order to “throw off the scent to the press,” a publicist told me, though “scent” is a strange word choice here because anyone with a nose could have    the place from the sheer concentration of applied Shalimar. But there was good reason for the secrecy. Leaks from these reunion shows have been rampant, and after a previous one, Andy Cohen, the   mediator and the franchise creator (or as he says, “the person who gets credit for creating the franchise” when, really, a lot of other people were involved) realized that the leaks might be coming from the hair and makeup teams, who watch the live feed from a holding room. He told the producers to cut the audio to those dressing rooms. Since then, the integrity of his reunion show  —   if, again, “integrity” is the right word to describe the absolute ravaging of women by their former, current and future friends, accusing one another of everything from having had more than their admitted amount of plastic surgery to being an actual F. B. I. snitch  —   has been intact. The only leaks would be coming from Cohen, and they’d come when he decided they would come. Cohen prepared himself in a sunny, makeshift dressing room on the first floor, standing shirtless as he tried to choose a tie for the    —   yes, that’s    —   taping. His voice was a hoarse whisper, stubbornly projected through sheer will from deep behind his sternum. He had just come from disseminating his Andyness throughout the country on a speaking tour with his friend Anderson Cooper, in which both men told stories from their personal lives and drank Fresquilas on stage. There were a few    appearances for his coming book tour for “Superficial: More Adventures From the Andy Cohen Diaries. ” He had been talking for hours on his weekly radio shows (plural) as well as negotiating and announcing his new book imprint, Andy Cohen Books. He had been hosting his nightly live talk show on Bravo, “Watch What Happens Live With Andy Cohen. ” And of course, he continued to   the “Real Housewives” franchise, watching cuts of each episode for all seven cities, giving notes, hiring, firing, reconsidering and fielding    text messages from the stars of those shows, sometimes replying purely with emoji. I told him that the Housewives, who were waiting for the taping to begin, seemed nervous. “A lot of them view me as kind of their daddy in some weird, sick way, and their boss, and their friend, and their boyfriend, and their enemy  —   and so there’s a lot of different psychological layers happening in a situation like this,” he replied. “Some of them are volatile women. So it’s all real. It’s all real. ” Below the street, in their dressing rooms, the Housewives breathed through the tension. They had lived their reality on camera and watched the results. They had heard their Housewife colleagues talk about their behavior in   interviews. And they had built within themselves a caldron of anger, resentment and oh, yeah? s to what they had seen. So as not to dilute their fury, so as not to lose one moment of heat for the cameras, the publicists brought them to me separately through secured hallways, like Hannibal Lecter on his gurney. Teresa Giudice, who wore a satin evening gown and body shimmer (it was 8 a. m.) told me she used to be nervous about confronting certain cast members at these reunions, but now, since serving a prison term for fraud in 2015, which she continually refers to as “the time I went away,” she’s fine she’s ready for her day in court or whatever this is for her. She used to resent Cohen, because she thought he was hardest on her, but now she takes a more nuanced view. “I think he’s an amazing guy,” she said. “If he was straight, I definitely would date him. ” Jacqueline Laurita, who was Teresa’s best friend but has now replaced Melissa Gorga as Teresa’s sworn enemy for life, admitted that she was expecting a blood bath. “Yeah, it feels like you’re walking to the electric chair” is how she put it. She knew she would be held accountable for crimes that included calling Teresa a “criminal” and accusing Teresa’s allies of being her “soldiers. ” Jacqueline knew she just had to endure it. She has stopped trying to game Cohen at these things. “He greets you with a smile, and he has a way about him, and he makes you feel comfortable talking about things, and he can pull the best and the worst out of you with a smile on his face. ” She agreed that the best way to think of Cohen is the way you think of Jesus. You pray to him for blessings  —   to get more airtime, to get a rival off the show  —   but like Jesus himself, he answers prayers only sometimes. In his sunny dressing room up above, I asked Cohen how he’d feel if, like the Housewives, he were about to be confronted by everyone he’d interacted with this year. “I’m not on a reality show about my life” was his answer. It annoys him, this implication that what he’s doing is somehow cruel to the women who have signed up for it. But don’t you feel bad for them? I wanted to know. He shook his head, the way he would every time I didn’t get it. These women, who were once housewives, real housewives, are now businesswomen. Teresa Giudice is a   New York Times   author. Melissa Gorga has a successful clothing store. Jacqueline Laurita now has a platform to talk about her son’s autism and for her husband to sell a   brand called the Little Kernel. “I’m in a business relationship with these women,” he said. “They know what they’re doing. ” He put on his shirt and picked the striped tie. Walking out, he was intercepted by Kathleen French, a senior vice president at Bravo, who said that things had become a little too crazy the night before at the end of the “Real Housewives of Orange County” trip to Ireland. “Don’t tell me any more,” he said. “Let me just see it. ” He took his place in the fake living room and sat down. “Very casual,” he said as the women   out in their restrictive formal wear,   a deep mustard and hair spritzed to within an inch of   laws. “This is their Super Bowl,” he told me when I asked why they were in   tie before 8 a. m. Over the next few hours, as they said things like “Oh, really, bitch?” and “I was friends with Teresa when she was chasing a prostitution whore out of a country club” and “Do I look like an ape?” and “I’m turning you off” and “You’re a dumb bitch,” Cohen’s placid cool sometimes gave way to frustration. “Stay on your couches!” he beseeched them. “Don’t push Daddy!” He put a finger gun to his head as Teresa accused Jacqueline of selling a story to a tabloid. He won’t like that I began this article with the “Housewives. ” Cohen has hosted a nightly talk show now for more than seven years that features scintillating conversation with celebrities and (O. K. yes) clips of Bravo shows, but his guests are legitimate stars, like Meryl Streep and Oprah Winfrey and (O. K. yes) Real Housewives. “Watch What Happens Live” is doing well, with nearly 800, 000 viewers a night. The set just expanded to accommodate twice its   audience. But you can’t talk about Cohen without talking about the     empire that he helped create in 2006  —   a juggernaut of unscripted television, with all but one of the locales (it’s Dallas) averaging two or three million viewers per   episode. “Real Housewives” is watched sincerely, it is watched as camp. It is   it is   it is   it is pored over by at least one very funny podcast (“Bitch Sesh”) it is debated by feminists, it is singled out for a particular kind of cultural degradation that has seeped into our national conversation and it is fairly said to have been a factor in our recent elevation of a   host to the highest office of this country, a man who apparently spent Thanksgiving asking his guests,   style, whom he should pick for secretary of state. Cohen was at a Jewish Federation speaking gig in Washington recently when a man raised his hand and asked if he felt responsible for the level of discourse that the American republic had descended to in the last few months. It was two weeks before the election, and the question was fair. Over the 10 million episodes of “Real Housewives” I watched this fall, I heard people say to one another, “I just wanna friggin rip his balls off” and “Put away your penis . .. and maybe someone would treat you like a woman. ” I saw a woman flip a table when she was angry, a woman who threw her fake leg when she was angry (more on this later). I saw women demand respect, respect, respect, saying, “You don’t respect me” and “That is not respect” and “That’s disrespectful,” respect in the way that people who conduct themselves respectfully and respectably seldom feel the need to demand out loud. Over in the presidential debates, meanwhile, Hillary Clinton was called a “nasty woman,” and Donald Trump’s Twitter feed seemed as if it had been ghostwritten by Kelly Dodd, the Real Housewife of Orange County responsible for such Twitter pronouncements as: “Got my phone hacked with the fraud Dept. Going to get a private investigator and I’m going to sue  press charges!! Good luck Thunderdome. ” But Cohen told that man in Washington this: “First of all, the ‘Housewives’ are entertainment. Second of all, in the ‘Housewives universe,’ you get punished for behaving badly. There are consequences to it. ” The consequences to Donald Trump’s behavior, by contrast, seemed to be more people loving him. Had he seen the polls? I asked. He had made a similar speech to me, and I was skeptical. Trump’s not going to win, I told him. Cohen pursed his lips and raised his eyebrows and tilted his head back and forth in consideration. “You never know. ” I didn’t listen to him. No one did, not even when he conducted two televised and dubiously scientific polls of the people who tuned into “Watch What Happens Live” and turned up numbers based on about 60, 000 votes that said, actually, yes, Trump was going to win. He’s used to that. “There’s a lot of times when I will say something about politics, and people will immediately discount me, and I think it’s the easiest way to discount my show too. It’s just like, Oh, that’s the ‘Housewives’ guy, who cares?” Cohen explained a few weeks after the reunion. We were at Cafe Cluny in the West Village for lunch in the 3 p. m. hour, which is the approximate time lunch happens for someone who goes to bed at about 2 a. m. each night, often following a   massage. He ordered a salad and then stared down the three pieces of dark chocolate that came with the check. “I think I’m   about it, but on the other hand, if that’s what I am, I’m also good with it because it’s a wonderful thing to be. ” His voice didn’t get less hoarse over the months I spent with him. “You know what I mean?” He opened his mouth to say something else, only to remember that control in an interview resides with the person who can stop talking. “Look, I was a thinking person before the Housewives ever came. ” He took a piece of the chocolate. “I’ve been a TV producer for a long time  —   not that that’s Mensa, but I’ve had a career, and I made my own way. So I just think, If I ever say something that someone doesn’t want to hear, it’s a very easy thing to then say, Oh, well, coming from the ‘Housewives’ guy, oh, really, Mr. ‘Real Housewives’?” He is lately, at 48, consumed with trying to gauge exactly where he stands in the national esteem. When I first met him, in his downtown office, a few minutes before he went on the air, he asked me why I wanted to do an article on him. “I’m just not that introspective,” he said. I took this to mean he possessed the natural discomfort that a producer might have with someone else telling his story. But soon I realized it was more about positioning: Do we think of him as the “Housewives” guy  —   or as a former Bravo head of development who has a thriving production company? Or a guy with his own channel on Sirius XM Radio that features shows with Sandra Bernhard and Dan Rather? Or the author of three   books, or the host of a nightly talk show, the first one in late night with a working bar, no matter what James Corden says? He is no longer what he started out as on the talk show, the kind of person who could ask the question we wanted answered (like: Jacqueline, why would you sit on that woman’s lap after she threatened to “rage on your ass”? ). Now he’s one of the famous people. And so he is these days often trying to figure out a metric by which he can ascertain where he falls in the fame food chain. In “Superficial,” there’s a diary entry in which he talks about getting a   invitation from his good friend Sarah Jessica Parker to be her date for the Met Gala  —   so that’s data. But he goes to Ralph Lauren to get a tux for the event and the one he likes is being held for Bobby Cannavale, and he spends a little time trying to process that he doesn’t have more pull than Bobby Cannavale. Another tux he likes is being held for Johnny Depp, which is O. K. with him, because of course Johnny Depp. “It didn’t piss me off,” he insisted when I asked about the incident and his calculations surrounding it. “No. I was like, oh, O. K. oh, good, here’s a ranking, and now I know where I stand. They’re telling me where I stand. I’m finding out how this works. ” He paused for a second. “I’m just psyched that I’m getting a tux. ” O. K. maybe it did sting a little when Vanity Fair had an article devoted to the hosts of late night, and Cohen seemed to be the only one excluded from it. Trevor Noah hadn’t even made his debut yet! But again, this is just data. “Everything’s good,” he insisted. “I have my health. I have my show. I have my life. You know what I mean?” But also, “I think my show is a late show, you know?” Don’t read any of this as defeated or bitter. If there’s one thing about Cohen, it’s that his respect for the democratic rhythms of popular culture and popularity in general is total. He wants to watch the rise and fall of things, even himself, without trying to manipulate the process. He wants it all to play out. The people will decide, and watching what the people decide and how they decide is far more important than the decision itself. From a young age, there was something about Andy Cohen that his mother couldn’t quite put her finger on. They would watch “All My Children” together during the    era ( ) which she wondered if maybe other sons weren’t doing with their mothers. He had a Diana Ross poster on his wall. What was it, though? What was it? Then one day, she was watching him “prance” (her word) across the stage in his high school’s performance of “Carousel,” and a notion crept in and took hold. She got home that night and looked under his bed, where she found a healthy stash of gay porn. Now she was sure something was going on, but what? She spoke with a psychologist she knew who understood gay issues because he had a gay relative, and that psychologist told her that maybe she should stop looking under his bed. Andy was about to leave for college, for Boston University, and the psychologist said, “B. U. is a good place for him to go for that, he’ll meet a lot of other gay people,” and now his mother really began to suspect something was up. A few years later, Cohen wrote a   letter to a friend that he left on his parents’ kitchen table, and his mother read it and sat him down and asked him if he was sure. And he told her he was. A mother always knows. He knew he wanted to be onscreen even in high school, but he didn’t want to play characters. He wanted to be famous for being himself, but at the time, that idea didn’t truly exist yet outside the news and shows like Oprah and “Donahue. ” “I liked the idea of being myself in front of the camera. So, just me being me. I used to think if I could work on a morning show then I could be me. ” He got a job as an intern at CBS News, then as a producer there, but he started to burn out after 10 years. After a   run at the   Barry Diller cable network Trio, he landed at Bravo, where he helped develop breakout successes like “Top Chef” and “The Millionaire Matchmaker. ” Lauren Zalaznick, at the time president of Bravo, recalls someone coming in with hundreds of hours of documentary tape from a gated community in Orange County, Calif. which the producers needed to work. In that footage, Cohen saw something. “I don’t want to pretend like it was like lightning in a bottle at the beginning,” he said. “I was like: ‘This is a soap opera. This is a soap opera. ’’u2009” It was also something else. “This is real life. ”’ Right before the first season aired in 2006, he had a minor crisis over the opening credits. The “Housewives” shows usually begin with an introduction of each Housewife, posing in Grade A evening wear and announcing her tagline, which is part defensive apologia, part mission statement, part brand definition. But at the beginning, when they were editing the first season of Orange County, they went with sound bites from the show, like “I don’t wanna get old” and “  percent of the women around here have had breast implants” and “Are the police involved?” When Cohen saw the first cut, he ran to the office of Shari Levine, Bravo’s vice president of production, and told her she had to call the production company. The Housewives were going to think the producers were sabotaging them. But Levine told him the Housewives had already seen it  —   and they loved it. Cohen learned that day that people stand behind their behavior, and that trying to protect them from themselves is a fundamental act of disrespect: “These women, but maybe all women. I mean maybe all men, too I think all people want to be heard and understood. ” He learned too that people don’t need you to fight their battles, that they are entitled to them, even if you think they’re ridiculous. He learned that an audience will respond to however eccentric or stubborn or mean or dumb or kind a person is if that person is being authentic. “The things that you think might embarrass them they actually feel like, Well, I was standing up for myself,” he said. I eventually watched the episode of “Real Housewives of Orange County” that Kathleen French had warned Cohen about. It was part of a   arc in which the women go to Ireland so that one of them, Meghan, can track down her ancestors. (This is manifested as her actually tapping people on the shoulder in the street and asking if they are related to her.) Now, “Orange County,” which is the screechiest “Housewives” franchise, had experienced so far a year of immense healing, with the Housewives working on forgiveness. That went right out the window on this trip. Kelly, whom I mentioned earlier, is someone prone to saying things like: “What comes before Part B?  !” She also does the old    “What’s on your shirt?” and when you look down, she flicks you in the nose. Well, it was one such flick, which she administered to Vicki, that plunged the whole trip into darkness. Kelly wanted to know why Heather was so uptight about it, since Jews are supposed to have a good sense of humor. Heather called Kelly racist, and Kelly, of course, said: “I’m not being racist. I’m Mexican. ” Eventually, Tamra got involved, and Kelly said, “No wonder why her daughter isn’t talking to her,” which prompted Tamra to lunge for Kelly and curse and hit her, and they were all kicked out of the department store they were in. Something Cohen knows, a belief that began to take root in him back when he was watching “All My Children” with his mother, was that people who interacted would always create something interesting. That’s why he doesn’t understand why anyone would think that “Real Housewives” wasn’t real in some way. Or that it was too crass. Had people been on a subway recently? Had they read an online comments section? If anyone was under the impression that we were still in a Jane Austen novel in terms of national discourse and manners, it wasn’t Cohen’s fault that they were in for a rude awakening. It’s all real. It wouldn’t be compelling to watch if it weren’t. Teresa Giudice was having a real breakdown when she flipped that table in New Jersey. But in New York, when Aviva Drescher got angry and threw her prosthetic leg at Le Cirque, of all places, in a   effort to make her onscreen presence more interesting, well, that was the last we saw of Aviva. “It is very real to them,” he said. “And by the way, when it’s not, they’re off the show. ” A few months after the women from Orange County returned from Ireland and watched the episodes through holes between their fingers, they pulled themselves together for the reunion. They put on clothing appropriate for Christmas dinner at the White House if it were Cinderella’s   gathered on two separate couches with Andy in the middle, folded their hands in their laps and apologized to one another. A few days after the election, Cohen began book promotion for “Superficial. ” He started with a few local appearances, including one at the 92nd Street Y, where he was interviewed onstage by Sarah Jessica Parker. He had spent election night at her house, actually, and as soon as it became clear who the winner was, Cohen left the room to eat. A few days later, his optimism had mostly returned. Anderson Cooper told me when we met in St. Louis, “I think Oprah said to Andy, ‘You carry the light.’ When I heard that, I was like, That’s really true. ” Onstage at the Y, he had already come around enough to say that he thinks that at heart, Donald Trump is a Democrat. The liberal, largely Jewish crowd, who had been reading about the terrifying increase of hate crimes since the election and had begun to feel as if the world were closing in faster than they’d expected, responded with silence. We met at Cafe Cluny again a week later, and I asked him if he had noticed the silence. He said he didn’t get it. He wanted to know why everyone he knew was so surprised about all of this. I’d been watching the show, hadn’t I? I’d seen Tamra from “Orange County” call Alexis “Jesus Jugs,” hadn’t I? How was that different from calling Hillary Clinton “Crooked Hillary”? I’d watched in the primaries as Trump defended the size of his penis, right? “Wouldn’t that be the province of the Housewives if they were men?” He was right. Trump was not not like one of Cohen’s Housewives. He knew he had to be entertaining to stay on the show. He was willing to say anything to get his contract extended. Throughout his campaign, he pulled out the “I know something, but I’m not going to say it now” trick, most recently employed by Bethenny Frankel about dirt she has but won’t reveal about both Dorinda and Jules at the last “New York” reunion. At the debates, the candidates fought for time to speak and demanded that they be allowed the time they were promised, which is what happens at the reunions. When Cohen saw that, he told me, he thought, Lester Holt, I feel your pain. Anderson Cooper was a moderator of a debate in St. Louis that ended with the candidates saying something nice about each other, which is exactly how Cohen ends some “Real Housewives” reunions. It was one thing when people were copying his format for a talk show and pretending it was theirs, but now life is copying his format, and he’s still not quite getting credit for it  —   just blame. But isn’t that always the way for Cohen? He’s confronted from the audience, he’s confronted by that guy in Washington, and still he’s not getting the credit for what his gift actually is, which isn’t knowing how to deviously propel national discourse into the gutter but instead delivering to viewers what they want before they know they want it. And still, they mess up the name of his show, calling it “Watch What Happens Now. ” They accuse him of ruining America, when he carries the light. Even Oprah said it. Andy Cohen didn’t invent our society. To think that is to have missed the entire point of him. He simply predicted it. He saw it coming before we did, and he taped it. He has a lack of judgment about the way the world works, and therefore doesn’t have the willful ignorance that the rest of us do  —   yes, we’d seen Tamra call Alexis “Jesus Jugs,” and we insisted it was a tacky anomaly. But it wasn’t. It was the way the world works now. Andy Cohen isn’t how our culture got this way. He is simply a walking seismograph of it. Back at Cafe Cluny, I took one of the pieces of chocolate that came with the check he left the other two alone. I asked him what was going to happen next. He shrugged and opened his mouth to say something, pausing for what felt like a minute. Then he told me that it was all going to be O. K. and I decided to believe him.'"}, "time": 1742562268.9182107}