{"duration": 0.3412129878997803, "input_args": {"text": "'Home / #Solutions / 7 Simple Steps from a Cop on How to Fight Every Speeding Ticket and Win 7 Simple Steps from a Cop on How to Fight Every Speeding Ticket and Win Do you want to discover the secrets on how to beat your speeding ticket in court? 25% of all Speeding Tickets Are Issued in Error! \\nIt is estimated that in 2014 that there were over 41,000,000 speeding tickets issued in the USA and that over 25% of these were issued in error. \\nThe most common errors include shadowing, RFI inference, cosine angle error, mechanical interference and devices that are out of calibration. \\nBut out of these 41,000,000 speeding tickets only 5% challenged their citation in court. \\nAnd out of this 5% less than .05% beat their ticket or have it dismissed. \\nWhy? Because they were not prepared! \\nThe radar gun or lidar gun the police officer used to issue you your speeding ticket is a scientific instrument and because of this the officer must be certified and by law, must follow certain requirements. \\nSo if you’re planning on fighting your ticket in court, we put together this guide to help disqualify the officer’s testimony and his/her equipment, so you have a better chance of winning your case. Prepare Yourself Before You Ever Get Stopped \\nBefore, during, and right after the stop are the most critical times to prepare your defense if you plan on fighting your speeding ticket. \\nBecause of this, it’s CRITICAL that you remember EVERYTHING that is happening around you and document it: What was the traffic flow like What signs are on the roadway The condition of the roadway Other witnesses What is the weather like \\nAs you’re doing this, look for a safe place to pull over for you and the police officer. \\nIf you’re on the highway in busy traffic, put your flashers on, pull over to the right and consider exiting at the first exit. The Approach \\nOnce you’re pulled over and stopped STAY IN YOUR CAR! \\nMany police officer shootings occur as the officer is approaching a violator. Because of this, his/her stress levels are high, and he/she is watching everything you and the occupants of the car are doing. \\nDO NOT: Reach into the glove box Reach under your seat \\nDO Keep your hands in plain sight \\nYour only job at this point is to reduce the officer’s stress level as much as possible. The California Stop \\nOne strategy to reduce the officer’s stress level is called the California Stop. \\nAs the officer is exiting his car, roll down the driver’s side window. \\nIf it is at night, turn on your interior lights \\nThen place your hands on the top of your steering wheel palms up, facing your face. \\nDoing this, the officer can immediately see that you’re not an immediate threat, and his stress level is reduced. License, Registration, Insurance Card, any Weapons? \\nNow that the officer is standing next to your car one of the first things he is going to ask you is for your license, registration, insurance card and if you have any weapons in your possession. \\nIf you do have any weapons, tell him where they are and follow his/her instructions and hopefully you’re properly licensed to possess them. Do You Know Why I Stopped You? \\nRemember, everything you say or do will be documented by the officer so don’t admit anything, especially that you were not paying attention. \\nJust say “no officer, can you explain to me why you stopped me?” Obey the Officer’s Requests \\nAfter the officer obtains the required documentation he may ask you to step out of your car or to remain in your car, just follow his commands. \\nCan I See Your Radar/Laser Gun? \\nIf the officer says that he used a radar or laser gun, seem curious and ask the officer if you can see it and if he would be willing to explain to you how it works. \\nIf the officer does allow you to see it, take a mental picture of the device, getting the manufacturer’s name and model number. \\nIf he refuses to show you the gun, then just ask him if he could explain to you how it works. The Citation \\nAs some point, the officer is going to either have you sign the citation or just hand you a copy. \\nWhile he is still with you, review the citation to see if he documented the type of device he used to measure your speed. \\nIf he didn’t ask him/her to put on the citation the type of device he/she used. Documentation \\nRemember everything you do or say is being documented and possibly even being recorded by the officer. \\nIt’s your job to do the same! After the Stop \\nAfter the stop, find a safe place to pull over and write down EVERYTHING that happened. Then return to the area and snap photos of the area with a camera or your smartphone. Get Ready for Your Case \\nNext it’s your job to get ready for your trial. Step #1 – Know What the Officer Shot You With \\nTo properly prepare your case, you first need to know what type of device the officer used to clock your speed. Police radar guns transmit microwave radio signals, and it this type of enforcement that accounts for most speeding citations. \\nPolice lidar guns transmit a narrow beam of light in the near inferred light spectrum and they account for 20% of all traffic citations. \\nOther ways an officer can clock your speed are using a timing device such as a stopwatch or VASCAR, or following behind you clocking your speed using their speedometer. \\nBecause of this, you need to know EXACTLY what the officer used to measure your speed. \\nMany jurisdictions will note on the citation what type of device was used and even the device’s serial number. \\nIf this is not documented on your citation, then you may need to follow-up with a friendly telephone call to the agency or officer that issued you the citation and inquire. Step #2 – Start by Downloading These Free NHTSA Guides \\nThe National Highway Traffic Safety Administration is responsible for developing training programs responsive to the Uniform National Standards established by the Highway Safety Act of 1996. \\nBecause of this, the NHTSA has published guidelines both police agencies and officers MUST follow when operating radar or laser. \\nAs we will be referencing several portions of each of these guides in this article to help you build your case, we would recommend “ googling ” these titles and download these free PDFs now: \\nSpeed-Measuring Device Performance Specification: Across-the-Road Radar Module \\nLidar Speed Measuring Device Performance Specifications \\nPolice Radar Instructor Training Course \\nBasic Training Program in Radar Speed Measurement Step #3 – Have an Understanding of Case Law Case Law Regarding the Use of Police Radar \\nIf you were cited by an officer who used a police radar gun, your next step is to have a understanding of these most significant case laws pertaining to the use of radar in speed enforcement. \\nState of Florida v. Aquilera (1979) \\nThis infamous case is known widely as the Miami Radar Trial. After a local television reporter showed a house clocked at 28 mph and a palm tree clocked at 86 mph, the story broke nationwide and radar was quickly shown to be less than accurate. In this case the Dade County Court sustained a motion to suppress the results of radar units in 80 speeding ticket cases. \\nThe court’s opinion stated that the reliability of radar speed measuring devices as used in their present modes and particularly in some cases, has not been established beyond and to the exclusion of every reasonable doubt, nor has it met the test of reasonable scientific certainty. United States v. Fields (1982) \\nDistrict Court in Ohio ruled that it was not possible to establish from the radar results whether the defendant was traveling at 43 mph or whether the Speedgun 8 radar unit was measuring the rotation of the ventilation fan at the sewage pumping station next to the officer’s car. \\nThe court also found that the officer was not qualified to operate the radar unit since he did not know the requirements for correct operation of the unit. In addition, the officer did not calibrate it before use, on that occasion. \\nCommonwealth of Kentucky v. Honeycutt (1966) \\nThis case is a very common prosecution weapon against the 24 hours of classroom and 16 hours of field training requirement. In this case the court ruled that an officer should not be required to know the scientific principles of radar. \\nThe court also ruled that the officer only needs to know how to properly set up, test and read the radar unit. As such, a few hours of instruction should be enough to qualify an officer to operate the radar unit. \\nState of Connecticut v. Tomanelli (1966) \\nIn the case, which is the same year as the Honeycutt case, the Supreme Court of Connecticut ruled that “outside influences may affect the accuracy of the recording by a police radar set sufficient to raise a doubt as to the reliability of the speed recorded.” \\nThe court also stated that tuning forks must be proved to be accurate to be accepted as valid tests of a radar unit. In order to establish the accuracy of the radar unit the operator must testify to the following: That he made tuning fork tests before and after the defendant’s speed was recorded. That the tests were made by activating 40, 60 and 80 mph tuning forks and by observing that the unit responded correctly in each case. \\nState of Minnesota v. Gerdes (1971) \\nThe Supreme Court of Minnesota ruled that where the only means of testing the accuracy of a radar unit is an internal mechanism within the unit, and there is no other evidence of the motorist’s speed other than the radar reading, the conviction cannot be sustained. \\nThe court also established the following conditions for proving the accuracy of the radar unit: The officer must have adequate training and experience in the operation of the radar unit. The officer must testify as to how the unit was set up and the conditions the unit was operated under. it must be proven that the unit was operated with a minimum possibility of distortion from external interference. The unit has to be tested with an external source, such as a tuning fork or an actual test run with another vehicle with an accurately calibrated speedometer. \\nPeople of New York v. Perlman (1977) \\nThe Suffolk County District Court ruled that the radar device was not proved to be accurate since no external test had been performed before or after the arrest. This case is significant since it established the criteria of testing before and after a citation is issued. \\nState of Wisconsin v. Hanson (1978) \\nIn this landmark case, the Supreme Court of Wisconsin set minimum conditions for the use of radar as evidence. Sufficient evidence to support a speeding conviction with moving radar will require testimony by a competent operating officer that: He had adequate training and experience in radar operation The radar unit was in proper working condition at the time of the arrest The radar unit was used in an area where there was a minimum possibility of distortion The input speed of the officer’s car was verified; the car’s speedometer was expertly tested within a reasonable period after the citation was issued All testing was done without the radar unit’s own internal calibration device being used \\nState of Florida v. Allweiss (1980) \\nThe Pinellas County Court ruled that the testing methods for radar equipment are legally insufficient. “The use of such a tuning fork furnished by the manufacturer in this court’s opinion is tantamount to allowing the machine to test itself. \\nA tuning fork furnished by the manufacturer is merely an extension and part of the total speed measuring apparatus. Case Law Regarding the Use of Police Lidar \\nIf an officer used a police lidar gun to cite you, then your next step is to have a basic understanding of these most significant case laws that pertain to the use of lidar in speed enforcement. \\nAdmissibility of Motor Vehicle Speed Readings 714 A.2d 381, 391-92 (New Jersey Superior Court 1998) \\nThe Superior Court of New Jersey ordered that admissibility to lidar is subject to the following rules: Expert testimony is not required. Officers must be properly trained in the use of lidar and that training must be documented. The lidar must be tested according to procedures recommended by the manufacturer. The court further ordered that the lidar be tested against a known speed. Speed reading obtained by lidar are not affected by temperature, the degree of ambient light, or light to moderate rain. Readings shall not be accepted during heavy rainfall or while snow is falling. Speed reading made at distances up to 1,000 feet are admissible. Readings obtained in excess of 1,000 feet shall be admitted only with supporting evidence and expert testimony \\nState of Hawaii v Abiye Assay \\nOnce an officer has completed a course of instruction and certified to operate lidar – training is not done. Officers must understand (memorize) 11.2 Principles of Operation. \\nFor example, during the known-distance test officers must testify that the lidar uses proven time-distance formulas (pulse principle) and the speed of light (universal constant) to determine the known distance. Since the lidar utilizes one microprocessor to calculate time-of-flight and thus confirms the correct pulse repetition frequency, the lidar can accurately determine speed. \\nThen officers must obtain, read, and understand the manufacturer’s operator’s manual (10.7 Certification) for the particular lidar used and follow the manufacturer-recommended procedures for testing. Officers must further test the lidar as outlined in 11.16 Testing the LIDAR: \\nKnown Speed Test. All lidars must include a Technician Certification (10.7 & 11.16) every 3 years in accordance with manufacture’s specifications and NHTSA standards. (Note: New lidars come with a Technician Certification from the factory.) \\nOfficers must successfully complete Visual Speed Estimations, Enclosure 13.2 and be prepared to present this information in a court of law. During operation officers must understand and follow a proper tracking history (11.4 Lidar Tracking History) and be prepared to testify as to visual observations and speed estimates prior to clocking with lidar. \\nOfficers must understand all lidar effects (11.5Lidar Effects), including proper operation to avoid any of these effects. Officer must be currently certified (10.7 Certification) to operate radar/lidar. Finally, the officer must prepare all court cases as outlined in this manual. (10.8 Court Testimony, 10.9 Traffic Evidence Kit) Step #4 – Get the Manufacture’s Manuals \\nNext you will want to obtain the manuals from the manufacturer for the speed measurement device used by the officer. \\nSometimes a simple search on Google can locate these. \\nIf not, you then may have to contact the manufacturer to purchase a copy and/or subpoena the manual through the courts from the police agency. \\nTake special note what the manufacturer’s recommendations are as far as: Installation'"}, "time": 1742563710.9691322}