{"duration": 0.11225128173828125, "input_args": {"text": "'BEIJING  —   A day after the forced removal of a passenger from a United Airlines flight provoked a social media furor in the United States, a similar outcry followed in China, after   news outlets here described the man as being of Chinese descent. Long before the man’s name was widely known, another passenger on the flight on Sunday said that he had complained of being singled out because he was Chinese. The passenger, Dr. David Dao, was later identified publicly by his lawyers. By Wednesday morning, the hashtag “United forcibly removes passenger from plane” was the most popular topic on Weibo, China’s equivalent of Twitter, garnering more than 550 million views and more than 240, 000 comments. Many Chinese social media users accused United of racism, while others called for a boycott. The outrage was furious and sustained over the passenger’s being dragged from his seat by security officers after refusing to be bumped from an overbooked flight from Chicago to Louisville, Ky. The episode was prominently displayed across the Chinese news media on Tuesday. CCTV, the state broadcaster, showed photographs of the passenger’s bloodied face above the word “Savage!” People’s Daily, the ruling Communist Party’s flagship newspaper, scolded United for initially failing to condemn the man’s treatment. United has said that the passenger and three others were selected to be removed from the flight after no one accepted the offer of a voucher to leave voluntarily. The other three passengers left without incident, the airline said. United’s chief executive, Oscar Munoz, apologized Monday for “having to   these customers,” called the episode “upsetting” and said the airline was conducting a review. On Tuesday Mr. Munoz went a step further. In a statement he offered his “deepest apologies,” adding, “No one should ever be mistreated this way. ” Mr. Munoz continued, “I want you to know that we take full responsibility and we will work to make it right. ” The controversy threatened to hurt United’s revenue in China, where the airline began flying in 1986 and has steadily built a loyal customer base. As of last May, United had 96 departures a week to cities in mainland China and Hong Kong. Wang Guanxiong, 40, an angel investor in the technology industry in Beijing who travels frequently to Silicon Valley, said he would never fly on United again. “Why did they choose an Asian out of so many passengers?” he said in a telephone interview. “Obviously Asians are the minorities. ” People’s Daily said it was “gravely disappointing” that the airline had “mentioned nothing of the violence against the Asian passenger. ” The Chinese news media often highlights episodes of violence and racism directed at people of Chinese descent overseas as evidence of what it considers the hypocrisy of Western democracies on human rights issues. Some of the online discussions took on political overtones, with commentators saying the incident exposed deeper problems in American society. “Where are the human rights the democratic countries have been advocating?” a Weibo user wrote. Others said the episode showed that people of Chinese descent in the United States faced rampant discrimination. “In the United States, Asians are often discriminated against,” one Weibo user wrote. “If it were a Muslim or black person, they wouldn’t have acted this way. ” Zhang Zishi, a student from the coastal province of Shandong who lives in Britain, started a petition on the website of the White House calling for a federal investigation into the case, using the hashtag #ChineseLivesMatters. By Tuesday evening the petition had exceeded its goal of attaining 100, 000 signatures. “I’ve learned from the media that there is a lot of racism in the United States,” Mr. Zhang, 18, said in a telephone interview. “I feel that Chinese people are treated unfairly. ” Joe Wong, a popular   comedian, was among those urging a boycott of United Airlines. “Many Chinese who have faced discrimination are unwilling to speak out because of their pride,” Mr. Wong wrote on Weibo. “Because of this attitude, neither mainstream Western media nor the public pays much attention to discrimination against Asians. ”'"}, "time": 1742562152.8055873}