{"duration": 0.07888507843017578, "input_args": {"text": "'Turkish Government Arrests Opposition Parliament Members in Further Descent Into Dictatorship Posted on Nov 4, 2016 \\nBy Juan Cole / Informed Comment \\nThe Turkish government has detained 11 members of parliament from the leftist, feminist and pro-Kurdish Peoples’ Democratic Party (HDP), including the party’s co-chairs. This step is intended to give Erdogan the majority in parliament he needs to make himself president for life, and to give Turkey (currently a parliamentary government) an imperial presidency on the Egyptian model. The pretext was that these MPs declined to testify in a witch-hunt inquiry. I.e., this is precisely McCarthyism. \\nSince the failed July 15 coup, the Turkish government of President Tayyip Erdogan has fired 110,000 people–10,000 of them just last weekend– from the police, judiciary and other government offices. He has had 12,000 professors fired. Some 15 private universities have been summarily shut down on the grounds that they have some Gulen link. If all of them were involved in the coup, that action might be understandable. But manifestly, all were not. It is true that the rightwing religious Gulen cult has seeded covert agents throughout the Turkish government and business sector. But surely there are hundreds of them, not 110,000. Among the authoritarian steps he has taken is the lifting of parliamentary immunity, setting the stage or his current coup d’etat. \\nErdogan has also closed down 45 newspapers , 16 television channels and all told, 130 media organizations. Some were accused of having Gulen tendencies. Others are pro-Kurdish. Still others are secular. Many are just sometimes critical of Erdogan, which apparently is no longer going to be allowed. \\nIn modern democratic law, you can’t fire or arrest someone for thought crimes. The arrestees need to have actually done something wrong. Erdogan is trying to criminalize entire groups, and suspiciously enough the only group left that is not taboo is followers of Erdogan–i.e. right of center, at least somewhat religious Sunni Muslim Turks, who make up about 40 percent of the population. Secularists are likely at least 25%, Kurds are 20% and Alevi Shiites are 20 percent (many Alevis are also secularists, and some religious Kurds vote for Erdogan, so you can’t just add these groups up–they overlap). So Erdogan is engineering a dictatorship on behalf of a minority. \\nErdogan moreover isn’t understanding when the rest of the world won’t arrest people for thought crimes. He had demanded that PKK members and Gulenists be extradited from Germany, but the government of Chancellor Angela Merkel declined. Erdogan then went on a rant accusing Germany of giving material aid to terrorism. I mean, this behavior is unhinged. \\nAdvertisement Square, Site wide \\nErdogan now has three big domestic political struggles going on: 1) against the old secular Kemalist movement, now a shadow of its former self with only a quarter of the seats in parliament; 2) against all the major Kurdish political groupings; and 3) against the rival “Gulen” Muslim fundamentalist movement. \\nSaturday’s arrests targeted the moderate pro-Kurdish HDP, which has stood for feminism, gay rights, and a multi-cultural Turkey with a place for both Kurds and Turks (hence it is the Democratic Peoples’ Party, with peoples in the plural). \\nIn June of 2015, the HDP won 13% of seats in parliament and left the ruling AKP or Justice and Development Party, Erdogan’s party, with only about 40 percent. This development threw a spanner in the works as far as Erdogan’s aspirations to become a powerful president for life went. He needed an absolute majority for his party in parliament. Whether he deliberately engineered a renewal of the war with the Kurdistan Workers Party (PKK), a group that in the past has been radical and separatist but that had said it was moderating, is a matter of dispute. What is clear is that the polarization resulting from new hostilities hurt the HDP. Erdogan’s party refused to make a coalition with any of the other three major parties, causing snap elections. On Nov. 1, 2015, the AKP got a little over 50% of seats in parliament and the HDP shrank to only 10%. That outcome allowed Erdogan’s AKP to form a government without a coalition partner, but did not allow it to amend the constitution by fiat. \\nIf the HDP members of parliament are permanently removed, perhaps even jailed, then Erdogan may argue that he has a majority of the remaining MPs and can move forward with his coronation as dictator in chief. \\nUnfortunately for Turkey, Erdogan’s erratic behavior is likely to tank the economy. The tourism sector has collapsed. Foreign Direct Investment depends on confidence, which is slipping away. \\nEvery new assault that Erdogan launches on democracy in Turkey has brought queries as to whether Turkish democracy is now definitively dead. The answer each time is yes. TAGS:'"}, "time": 1742562291.0822053}