{"duration": 0.07601642608642578, "input_args": {"text": "'By Kshama Sawant / counterpunch.org \\nIn the ten days since the election, several thousand people have phoned and emailed my Seattle City Council office in their fury over my call to shut down Donald Trump’s agenda with massive peaceful protests on Inauguration Day. \\nMany messages were from middle- and working-class people who had voted for Trump because they hated corporate Democrats and Hillary Clinton, and mistakenly believed that Trump was going to stand up for the ordinary Americans. Many were also racist and misogynist, saying things like, “You don’t belong here with the bull***t you spew from your c***su**er,” or “Drop dead and go back to turbanville.” \\nCall after call, while having zero tolerance for bigotry and threats, my staff patiently explained to the more reasonable Trump supporters that we agree working people have been sold out by corporate politicians. That we completely oppose the bipartisan, big business policies of “free trade” deals like the TPP and NAFTA, corporate tax handouts, and the close ties of both parties to Wall Street. Callers were surprised to learn that while I fiercely oppose Trump, I did not back Hillary Clinton (I campaigned for Bernie Sanders, and later Jill Stein). Many were simply not reachable, as they spewed hate on all those protesting their president-elect. They will have to experience Donald Trump’s policies in office to see him for what he is: a con man and representative of the billionaire class who sold the lie that he will bring back the American Dream. \\nMy first grim thoughts as I saw some of the horrifying emails was that I will be far from the only person targeted after the dangerous rise of Donald Trump. Bigots are feeling emboldened. Already a surge in bullying and hate crimes has taken place, and the KKK felt confident to hold a rally in North Carolina to celebrate Trump’s victory. \\nDisconcerting in a different way have been the hit pieces in local publications like The Seattle Times and The Stranger attacking me and other Stein supporters, and trying to shift blame for the outcome of the presidential election. The Stranger article even went so far as to say that since I didn’t support Clinton, I should not continue to call protests against Trump: that this would be “poor form.” \\nBut as everyone from prominent Clinton surrogate Robert Reich to the New York Times have more or less acknowledged, in failing to defeat the most unpopular major party candidate in modern American history, the Democrats have no one to blame but themselves. The NY Times editorial board questioned the disastrous strategy of attempting a “Clinton restoration at a moment when the nation was impatient to escape the status quo,” while Reich called for a “new Democratic Party,” and said the election served as a “repudiation of the American power structure, including the old Democratic Party.” \\nAt every stage of the Democratic Primary, the DNC and party leadership fiercely opposed Bernie Sanders and backed Clinton to the hilt. In the general election, Clinton could have reached out to young and working class Sanders supporters instead of arrogantly assuming she didn’t need them. By choosing to tell the millions of people who have been sold out and disenfranchised by neoliberal policies over several decades that America is “already great,” Clinton received several millions fewer votes than Obama in 2012, including fewer votes from women. \\nNow, having assisted Trump’s ascension to the White House, Clinton and this same Democratic Party leadership tell us we should “give him a chance.” But make no mistake, Trump’s success is not “our success,” in spite of Obama’s comments to that effect. And while we would be happy to be surprised by any progressive measures from a Trump administration, we simply have no time to waste in building an organized opposition against the damage he has already vowed to do, including his promise to deport three million immigrants. \\nWe must bring together millions of progressive workers and young people to build a wall of mass resistance against Trump, and to defend immigrants, women, Muslims, LGBTQ people and all others targeted by his presidency. \\nHundreds of thousands of people have already poured into the streets since November 8th. On the night of the election result, my organization, Socialist Alternative began to organize protests around the country for the next day. More than 50,000 answered that call: in Seattle, New York, Boston, Philadelphia, and Oakland. Many more protests have followed, as well as dozens of student walkouts, including 5,000 Seattle students on Monday alone. \\nOur movement will need to be independent of both major political parties. The Democratic Party cannot be relied on to stop Trump, anymore now than during the election. And to truly defeat the right, we will need to build our own mass party – a party of, by and for the 99% – completely free of corporate cash and corporate influence. \\nWe have a historic responsibility to fight back against this administration. On January 20th and 21st, activists will be organizing protests and student walkouts across the country. Hundreds of thousands will gather for the Women’s March on Washington DC and to “Occupy Inauguration,” to send a message to the new president that there is no space whatsoever for his bigoted agenda in America. \\nI hope you will join us. \\nKshama Sawant is Seattle City Council Woman and member of Socialist Alternative . 3.8 ·'"}, "time": 1742562654.157432}