{"duration": 0.10660576820373535, "input_args": {"text": "'Filmmaker Spike Lee unleashed a flurry of personal insults at President Donald Trump and revealed why Hillary Clinton was wrong to think she was “entitled” to the presidency in an interview this week. [In a brief conversation with Hollywood Reporter at the Cannes Film Festival, the Do The Right Thing director didn’t mince words about the   : “He’s not my president. I call him Agent Orange. ”  “There was some clip I saw yesterday of him dancing with the Saudis that was just ludicrous,” Lee said about Trump recent foreign trip to Saudi Arabia. “Not only is he not a good president, he can’t dance either,” Lee said while laughing. “He could be impeached on his rhythm. He’s the clown with the nuclear codes. ” Lee endorsed Vermont Senator Bernie Sanders for president in a radio ad last February and blasted the Democrat party’s “rigged” primary system. When asked if he ever came around to supporting Clinton, Lee unloaded on the former frontrunner. “Have you read the book Shattered? Great book,” Lee said of the new Clinton campaign   Shattered: Inside Hillary Clinton’s Doomed Campaign, which offers a blistering    look at how Hillary Clinton lost the election.  “Hillary comes with entitlement. They thought they were entitled to this and despite what you might think, you gotta work,” Lee explained. “If you’re chilling at Martha’s Vineyard, and think ‘It’s a done deal.’ But it wasn’t. There’s one thing you can learn from sports. To quote Yogi Bear: “It ain’t over ’til it’s over. ” They thought it was theirs. Shit don’t work like that. ” The   director also said he wouldn’t support actor and former professional wrestler Dwayne Johnson as a presidential candidate without first knowing his politics. Johnson’s name has been floated as a possible Democratic contender to take on Trump in 2020. “No. Well, I’d need to know how he stood on issues. ” Lee said, adding that Johnson’s presidential ambitions, real or not, comes off as unauthentic, given Trump’s jump from reality TV host to 45th president. “The thing is, everyone thinks they can be president. Like, “Look, that guy did it. ” Lee is attending the Cannes Film Festival in France this week. The filmmaker moderated a QA with singer Elton John on Monday.   Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742564522.7376125}