{"duration": 0.061499595642089844, "input_args": {"text": "'PARIS (AFP)  —   France’s governing Socialist party was in tatters Thursday after former prime minister Manuel Valls spurned the party’s official presidential candidate and backed independent centrist Emmanuel Macron. [Valls’ endorsement of Macron seals the rift between what the former premier has described as “two irreconcilable lefts”  —   one still wedded to the class struggle, represented by presidential nominee Benoit Hamon, and another reformist camp led by Valls.  Successive Socialist leaders managed to hold the party together but under President Francois Hollande the tacit   pact between the two factions broke down, leaving the party in disarray. Le Parisien newspaper said Valls’ repudiation of Hamon  —   a leftist rebel who quit the government in 2014 over its   policies  —   was the “nail in the coffin” of the party. The party of Francois Mitterrand that had acted as a broad church of the left since the 1970s “died yesterday, without panache, corroded by ideological and personal rivalries,” the paper wrote. Valls’ nod comes less than a month before the first round of the election on April 23, with polls showing Macron and   leader Marine Le Pen running   . Hamon is trailing in fifth place, behind conservative candidate Francois Fillon and   radical   Melenchon. The Socialist candidate had always been expected to struggle after five years of lacklustre rule under the unpopular Hollande. Valls said his decision to back Macron, who quit the Socialist government last year to form his own movement, En Marche (On the Move)  —   styled as neither of the left nor right  —   was “not a matter of the heart but of reason”. “I think you should not take any risks for the Republic” Valls said, saying he did the “responsible” thing in opting for the candidate tipped to easily beat Le Pen in May’s election  . But for many on the left the endorsement smacked of treachery after Valls pledged to back the winner of the Socialist primary in January, in which he was the  . A furious Hamon on Wednesday urged voters to reject those who “stabbed (me) in the back”. A Socialist activist in Marseille lodged a criminal complaint against Valls for “breach of trust” saying his disavowal of Hamon was “the straw that broke the camel’s back. ” “He (Valls) lost” in the primary,” Sylvie   told AFP, calling on Valls to quit the party. “It was up to him to bridge the gap” with Hamon.  —   Bedfellows no more  —   For Henry Rey, a political scientist at Sciences Po university in Paris, there are not two but three lefts in France: a liberal camp represented by Valls and Macron, a   camp led by Hamon and a radical camp led by Melenchon  —   who is now the leading presidential contender on the left. On Wednesday, a bullish Melenchon rebuffed a desperate appeal by Hamon for the two to join forces. “It’s clear that trying to make the various lefts cohabit no longer works, as demonstrated by the disastrous end to Hollande’s presidency,” Rey said. “The lines are being redrawn, which is a precondition for the recomposition of the left,” he said. The lines are also shifting on the right, with Macron and the nationalist Le Pen draining support from the   Fillon. “It feels as if all the old political forces are dying before our very eyes,” political analyst Pascal Perrineau said. Thibaut Rioufreyt, a researcher at Sciences Po university in Lyon, warned however against writing the obituary for the Socialist Party (PS). “The PS has become a federation of local politicians,” he wrote in La Croix newspaper. “It will still exist but its positioning will change. ”'"}, "time": 1742628324.274252}