{"duration": 0.032231807708740234, "input_args": {"text": "'OC Register – by Scott Schwebke \\nSANTA ANA – The city will pay a Santa Ana marijuana dispensary $100,000 to settle a federal lawsuit in connection with a controversial raid last year where police officers were caught on hidden video eating snacks and making disparaging remarks about a handicapped woman. \\nAs part of the settlement agreement finalized earlier this month, the city of Santa Ana will also dismiss misdemeanor charges against a dozen people accused of unlawfully operating Sky High Holistic at the time of the May 26, 2015 raid . \\nThe settlement proceeds will be divided among Marla and David James, who are volunteers at Sky High, and Dr. Bradley Idelshon, a physician whose nearby office was left without power and water during the raid and is not affiliated with the dispensary, its attorney Matthew Pappas said. \\n“The settlement of civil rights claims and dismissal of criminal actions shows Santa Ana is taking responsibility for improper actions it took, including the raid of Sky High Holistic, in support of its lottery-based marijuana regulation ordinance, Pappas said Tuesday in an email. \\nSanta Ana Deputy City Manager Robert Cortez declined Tuesday to discuss the settlement, saying the municipality doesn’t comment on legal matters. \\nThe lawsuit alleges that following voter approval of Santa Ana ballot Measure BB in November 2014, enabling a lottery to select 20 entrepreneurs to operate marijuana dispensaries, city and police officials formulated a plan to close dispensaries operating without a permit. \\nSky High, located on West 17th Street, wasn’t selected for a permit in the lottery. The dispensary was then raided as part of the enforcement program carried out by Santa Ana police, according to the lawsuit. \\nHidden video of the raid released by Pappas shows Santa Ana officers forcing Sky High customers to the floor, profanely referencing James in her wheelchair and munching on snacks. \\nThe bust,which went viral, led to the suspension of three police officers, who are no longer employed by the Santa Ana Police Department . \\nPolice have not said why the trio aren’t with the department. They have been charged with misdemeanor petty theft and scheduled to be back in court next month. \\nThe lawsuit alleges police caused extensive damage and took thousands of dollars in cash along with marijuana products during the Sky High raid. \\nPappas said he is continuing to pursue petitions in Orange County Superior Court for return of money and items seized in the raid and a lawsuit that seeks other unspecified monetary damages. \\nContact the writer: 714-796-7767 [email protected] Twitter: @thechalkoutline'"}, "time": 1742562264.883391}