{"duration": 0.015928030014038086, "input_args": {"text": "'Encuentran más de 600 objetos de la base secreta nazi descubierta en el Ártico ruso Publicado: 26 oct 2016 16:56 GMT | Última actualización: 26 oct 2016 20:51 GMT \\nLa estación meteorológica Schatzgraber, que proporcionaba información para una base de submarinos del Tercer Reich, no fue descubierta hasta agosto de este año. El archipiélago de la Tierra de Francisco José Vera Kostamo Sputnik Síguenos en Facebook \\nMás de 600 objetos han sido retirados de la estación meteorológica Schatzgraber, una instalación secreta de la Alemania nazi que fue recientemente descubierta en el Ártico ruso. \\n\"La colección está siendo catalogada en estos momentos. Más de 600 objetos han sido recogidos en el territorio de la estación\", dijo Irina Skálina, vicedirectora del Parque Nacional Ártico Ruso, en declaraciones a la agencia TASS . \\nEntre los objetos encontrados destacan minas, granadas M-24, proyectiles, cajas con municiones, envases de combustible y conservas alimentarias. \\nLa base está situada en la isla Tierra de Alexandra, en el archipiélago de Tierra de Francisco José, y fue descubierta por una expedición rusa en agosto de este año. \\nSegún los archivos aparecidos, la estación llevaba el nombre de Schatzgraber, que en castellano significa \\'buscador de tesoros\\'. \\nSin embargo, lo que los alemanes buscaban entre los hielos del Ártico no eran tesoros, sino información exacta sobre las condiciones climáticas en este área cercana a la base de submarinos alemana más septentrional. \\nEsta base era de gran importancia para la Armada del III Reich, ya que la zona era utilizada por los buques británicos y soviéticos para suministrar los equipos bélicos y alimentos que los aliados mandaban a la URSS. '"}, "time": 1742628459.24197}