{"duration": 0.1134946346282959, "input_args": {"text": "'Business Insider sought to assure its readers Saturday that the American “Deep State,” seeking to undermine the Trump administration, is a “dark conspiracy” theory pushed by sites like Breitbart News. [The article included a thinly veiled attack on Breitbart News as one of the “popular yet dubious websites,” pushing the “conspiracy theory” of entrenched opposition to President Donald Trump’s   agenda.  Breitbart News has reported vigorously on demonstrated and suspected resistance and disloyalty from the intelligence community in the career services of the federal agencies and among those outside the government itself, especially the mainstream media. In response,   publications including the New York Times, Politico, The New Yorker, and the Washington Post have all published a slew of pieces dismissive of the idea into which Business Insider’s latest attempt neatly fits. In its effort to question the validity of the concept of an American Deep State, Business Insider enlisted former intelligence community officials and a scholar from a beltway think tank. The first order of business is to whittle down the definition of a deep state to very specific incarnation seen almost exclusively in the third world. A deep state, Aykan Erdemir of the Foundation for Defense of Democracies, a beltway foreign policy think tank that came to prominence with the interventionist posture of the George W. Bush administration, assures us, is just the kind of   apparatus seen in Egypt and Turkey that allows those countries’ security services to unseat democratically elected leaders. The deep state is about “dramatic results like assassinations, mass killings, pogroms, bombings  —   it’s not about tension between the executive and the bureaucracy, it’s not about a failure to work together,” Erdemir told Business Insider. Breitbart News has never published material suggesting any civil servants, intelligence officials, or media professionals are engaged in a program of “assassinations, mass killings, pogroms, [or] bombings” in America. The narrowing of the term deep state to refer only to those activities belies Breitbart News’s usage. Breitbart News has consistently used the term to refer to the existence of much broader elements within and outside the federal government colluding to prevent President Trump from implementing his agenda. The term “deep state” has been used to refer to deliberate leaks designed to undermine the president, but also to the willing collusion of elements of the mainstream media, the latent distrust and suspected opposition of elements of the intelligence services, but also the willing resistance of certain career civil servants in the agencies charged with carrying President Trump’s directions to fruition. Whatever the definition, use of the term in the United States is causing those it targets some consternation. Business Insider cites remarks by   director Michael Hayden for the proposition, “Experts and former government officials have warned against using the term deep state to refer to rifts between the US president and the intelligence community. ” Glenn Carle, an   officer, goes so far as to warn the president and his supporters from antagonizing his fellow members of the intelligence community, pointing out that upsetting them could create “a gold mine of opportunity for foreign intelligence services” as these officials get back at Trump was his opposition to them by leaking information. “The deep state does not exist in fact but it exists in the minds of Trump supporters. That’s just as much a threat to society,” Carle explains to Business Insider. Much of the Business Insider article’s treatment of the American Deep State is focused on the most visible effect it has had in the opening months of the Trump administration, namely the slew of leaks damaging that administration that have issued forth from the bowels of the federal government. Business Insider acknowledges the Wall Street Journal report that the intelligence community has withheld classified information from President Trump, and the intelligence officials interviewed admit the leaks could have from inside the same community, although they cast doubt on the idea. Carle, however, has little trouble explaining why intelligence officials might engage in leaking or other acts of subversion. Of the president, he says, “He’s undermined the very values upon which this society was built. So, what do you do if you’re an intelligence official? If you serve the state, you betray it. ” Carle goes even further, appearing to justify the motives of intelligence officials taking a stand against Trump. “When leaks come from the intelligence community, it’s not to undermine the president or to protect the deep state. It’s to protect democracy  —   it stems from a sense of profound patriotism,” he said. This is by no means the first time such positive sentiments about the supposedly   American Deep State have been made by those who dismiss Breitbart’s coverage of the issue. In the aftermath of   National Security Adviser Michael Flynn’s resignation in the aftermath of several leaks, apparently from the intelligence community, Bill Kristol openly gloated that he “preferred the deep state to the Trump state. ” In reference to the same leaks, Evan Osnos of The New Yorker gushed that the “principled public servants who got the story out are hidden heroes. ” As the Trump administration acts contrary to the wishes of entrenched globalist interests, it continually runs up against steadfast opposition from elements in and outside the government.   officials, beltway pundits and the media appear increasingly eager to deny the existence of coordination in a “deep state,” despite their willingness to celebrate its successes.'"}, "time": 1742563314.686542}