{"duration": 0.050657033920288086, "input_args": {"text": "'On Meet The Press, Clinton campaign manager Robbie Mook said that early voting is so strong for Democrats in Nevada that Hillary Clinton could build an insurmountable lead this week. \\nVideo: \\nChuck Todd asked Mook if he believed the email story could cost Clinton the election. \\nHe answered: \\nI don’t think so. Look, as I said, we have over 50,000 volunteers out there. We’re seeing record early voting numbers in North Carolina, Florida. Look, I would wager in Nevada turnout is so strong among Democrats there Hillary could build an insurmountable lead in the coming days in Nevada. We’re feeling really good about this record turnout. Over 200 million people in our country now registered to vote. Fifty million of those are young people. We’re just nose to the grindstone, and we’re going to finish this out. But people should not take anything for granted, and we’re going to have to work hard to earn this.” \\nHillary Clinton could put Nevada out of reach for Trump this week, but whether or not that happens is up to the voters. If Democrats continue to vote in overwhelming numbers in swing states, the email story won’t matter. If Democrats don’t show up, that is Trump’s only chance of winning. \\nThe early voting numbers that Hillary Clinton is running up in Florida, North Carolina, and Nevada are no accident. Clinton and the Democratic Party have invested heavily in an extensive get out the vote operation in early voting states. \\nDemocrats already had a strategic advantage in early voting before the 2016 election, but Donal Trump’s refusal to invest in a substantial get out the vote operation has widened the gap between the two parties in this area. \\nThe final week before the election could be just as vital to Democrats in swing states as election day. If Hillary Clinton piles up big margins in early voting, it could leave minimal drama for election night. \\nThe Democratic early voting plan is working to perfection, now as Mook said, all that is left is for Democrats to put their heads down, work hard, and close the deal. \\nEarly Voting Is So Strong For Democrats That Clinton Could Lock Up Nevada this Week added by Jason Easley on Sun, Oct 30th, 2016'"}, "time": 1742562952.1458447}