{"duration": 0.050197601318359375, "input_args": {"text": "\"Lara Trump Implies FBI Letter Politically Motivated –‘My Father-In-Law Forced Their Hand’ (AUDIO) By Carrie MacDonald on October 29, 2016 Subscribe \\nThe latest “revelation” from the FBI just gets more and more curious by the hour. Now we have audio of Lara Trump, wife of Eric Trump and daughter-in-law of Republican presidential nominee Donald Trump, saying she believes her father-in-law was behind the latest letter from FBI Director James Comey. Lara Trump: ‘My Father-In-Law Forced Their Hand’ \\nIn an interview on WABC Radio with Rita Cosby, Lara Trump came right out and said, proudly, that she believes Donald Trump was one of the people behind this whole thing: “I think my father-in-law forced their hand in this. You know, he has been the one since the beginning saying that she shouldn’t be able to run for president, and I commend him on that.” \\nAnyone who has been paying attention over the past 12 hours or so knows that this “scandal” died before it even had a chance to really breathe. The conservative media has, of course, attempted to spin this into something real, given the fact that their candidate’s chances of winning are less than 10 percent. But the emails are not from Clinton nor are they from Clinton’s server. Not only that, but Comey’s motivations behind sending the letter seem more and more likely to be politically motivated. Former DOJ Official: ‘You Don’t Do This’ \\nComey’s actions are unprecedented for an FBI Director. In a piece discussing that very fact, Jane Mayer wrote for The New Yorker : “… His latest action is stirring an extraordinary level of concern among legal authorities, who see it as potentially affecting the outcome of the Presidential and congressional elections. ‘You don’t do this,’ one former senior Justice Department official exclaimed. ‘It’s aberrational. It violates decades of practice.’ The reason, according to the former official, who asked not to be identified because of ongoing cases involving the department, ‘is because it impugns the integrity and reputation of the candidate, even though there’s no finding by a court, or in this instance even an indictment.'” There was also the tweetstorm from former DOJ spokesperson Matthew Miller, in which he eviscerated Comey’s actions. He also wrote a more cohesive piece for the Washington Post , in which he said : “With each step, Comey moved further away from department guidelines and precedents, culminating in Friday’s letter to Congress. This letter not only violated Justice rules on commenting on ongoing investigations but also flew in the face of years of precedent about how to handle sensitive cases as Election Day nears.” All of this makes one wonder – what is Comey’s motivation here? Comey, a Republican appointed by President Obama, is breaking rules of tradition left and right. And Trump’s own daughter-in-law is on record saying that she believes the Republican nominee “forced their hand.” No matter the motivation, the “scandal” is dead in the water, no matter how much the Republicans and the Trump campaign wish it were truly the “October surprise” they’ve been waiting for … rather than another woman coming forward and accusing their nominee of sexual assault. That number stands at 12 and counting. The Clinton campaign, to their credit, is calling for complete transparency from the FBI in the matter. Listen to Lara Trump gleefully say she believes The Donald is behind this: \\nFeatured Image via screenshot from YouTube video About Carrie MacDonald \\nCarrie is a progressive mom and wife living in the upper Midwest. Connect\""}, "time": 1742561994.386486}