{"duration": 0.03163957595825195, "input_args": {"text": "'A former professor at Georgetown University was harassed online after penning an   for The Washington Post in which she discussed being a Muslim immigrant and a Donald Trump supporter. [Asra Q. Nomani, a former reporter for The Wall Street Journal and professor at Georgetown University, has received online harassment after penning an   for The Washington Post about supporting Donald Trump.  This is my confession  —   and explanation: I  —   a    a Muslim, an immigrant woman “of color”  —   am one of those silent voters for Donald Trump. And I’m not a “bigot,” “racist,” “chauvinist” or “white supremacist,” as Trump voters are being called, nor part of some “whitelash. ” Georgetown Professor Christine Fair took to social media to condemn Nomani’s   suggesting that Nomani was helping to “normalize Nazis in DC. ” “Why? Like many women, I have PTSD from sex assault. YOU publicly voted for a sex assailant,” Fair exclaimed. As a result of Fair’s behavior, Nomani made public a formal complaint she filed with Georgetown in which she requested that “Fair receive training regarding how to engage in civil discourse in a way that is respectful and productive. ” In addition, Nomani asked Fair for “a public apology. ” “What don’t you understand, you clueless dolt?” Fair wrote, saying Nomani “helped bring this hell 2 [sic] our country. His hate is on your   shoulders. Was it worth it? Don’t forget 2 [sic] register. ” “I have been opposed to the decision by President Obama and the Democratic Party to tap dance around the ‘Islam’ in Islamic State,” Nomani added, much to the ire of her former Georgetown colleague, who exclaimed that she has “written [Nomani] off as a human being. ” After Fair attempted to claim that Nomani was an atheist rather than a Muslim, Nomani suggested that it’s not uncommon that someone tries to suggest she isn’t a true Muslim. She told the online conservative campus watchdog site Campus Reform that   who stray from the progressive orthodoxy “hear all sorts of charges of not being Muslim from the extremists within our community. ” “They always want to out us and throw us out of the religion and declare us apostates so we have no credibility and so there is a target on our back. So for Christine Fair, a white liberal   atheist to call me out as an atheist is not only dangerous but offensive,” Nomani said, adding that she does not think that “anyone should be in the position of educating others and be so abusive. ”'"}, "time": 1742563645.9922378}