{"duration": 0.035446882247924805, "input_args": {"text": "'By: The Voice of Reason | Has everyone forgotten the reality of what wins Presidential Races? It’s the Electoral College, not Polls! With less than two weeks until election day, and reports already circling that the military is drilling for “Authoritarian Rule of Law” (Martial Law) , to deal with the potential masses who refuse to accept the election’s outcome, why is everyone talking about the polls, and not what really matters? Thanks to a DNC insider, we learned back in August that we should ignore the mainstream media polls, because even back then Clinton was reportedly being pounded. More recently, this past Friday, we learned that the Chairman of Hillary’s presidential campaign, John Podesta, who previously served as Chief of Staff to President Bill Clinton, and later as Counselor to President Barack Obama, issued a playbook to pollsters for exactly how to manipulate the polling numbers that produced false results favoring Hillary Clinton, results the media has been all too eager to report for months now. So, when we already know the polls are total B.S., what kills me is when I see reports like the one mentioned in the second video below, where Gary Franchi of The Next News Network reviews a recent article from Truthfeed which suggests that while publicly the Clinton Campaign is acting dismissive of Trump ’s chances, in private the campaign and their mainstream media henchmen are in full panic mode. Gary Franchi reports that early voting results, as well as national polling data in recent days, suggest that something remarkable might be going on regarding the 2016 presidential race… Reports like the ones below by Truthfeed, Gary Franchi of The Next News Network , and by Alex Jones (where he declares Trump the winner of the 2016 election), are dangerous, particularly when they are citing the same polls we already know are bogus. There needs to be more discussion on the harsh reality of what it’s going to take for Trump to win this election, and that is to say there needs to be more discussion about the Electoral Map. It’s confusing to some, so they avoid it, but it’s also reality, so they better pay attention to it! One of many reasons this country runs the risk of tearing itself to shreds after the winner of the 2016 is declared, is because it’s not at all unforeseeable, that Donald Trump could win the popular vote by millions, but yet still legitimately lose the election. We do not live in a Democracy. We live in a constitutional republic, and our election laws, and the role of the electoral college are clear. Whether I agree with the current system or not is irrelevant. What IS relevant, is that for Trump to win the presidency under our current system of government, he’s going to need an act of Divine Intervention. In the video below, I explain in detail why the chances of a Trump win are so remote, and how Americans better start to brace themselves for what they plan to do when Hillary is announced the next President of the United States. I expect a great deal of violence regardless of who wins the election, so it’s important people understand the reality ahead of time. In the video below, The Next News Network reviews a recent article in Truthfeed suggesting that while publicly they are acting dismissive of Trump ’s chances, in private the Clinton Campaign and their mainstream media henchmen are in panic mode. Gary Franchi reports that early voting results, as well as national polling data in recent days suggest something remarkable might be going on regarding the 2016 presidential race… As I explained very clearly above, people should be much more cautious about getting too optimistic when it comes to Trump ‘s chances of winning. Remember, even if Trump does win, there is still the matter of the far left promising to cause so much chaos, Martial Law HAS to be declared, forcing Obama to stay in office.'"}, "time": 1742628438.7642834}