{"duration": 0.15527796745300293, "input_args": {"text": "'Secret Service Knew About, Managed Clinton Private Server November 03, 2016 Secret Service Knew About, Managed Clinton Private Server \\nFederal law enforcement officials not only knew about, but may also have played a role in managing former Secretary of State Hillary Clinton’s private server located in her New York mansion in as early as 2011, new documents show. A Secret Service agent told the FBI that the Clintons also enlisted Secret Service resources to do work for the Clinton Foundation. A spokesman for the foundation denied using government resources They suggested that a Secret Service agent who recounted investigating a hack on the foundation’s server must have confused it with Clinton’s home-brew server. \\nIf the foundation spokesman’s assertion is correct, it suggests information may have been stolen when the home-brew server was attacked, which Clinton has denied. \\nAs the FBI summarized the testimony of a Secret Service agent whose name was redacted, the agent “was assigned to the protective detail of William Clinton from [redacted] to [redacted]. Because of [his] information technology (IT) skills, he was asked to do network assessments and troubleshoot IT issues at the Clinton Foundation… [he] assisted the Clinton Foundation in a case related to theft of information on the Clinton Foundation information systems.” \\nThe testimony was included among documents from the FBI’s email investigation that were made public Wednesday by the law enforcement agency. \\nIn addition to protecting high-level officials, the Secret Service has a secondary mission that allows it to investigate cyber-crimes, as The Weekly Standard, which first reported the testimony, noted. \\nBut the Secret Service’s cyber-crimes division hadn’t decided to take the case, the former president had used the taxpayer-funded guard to do other tasks, including “troubleshooting IT issues,” which doesn’t indicate cyber-crimes. The agent was not a cyber-crimes specialist, but rather someone who happened to have some IT skills. \\nHe conducted “open source research relating to the security of email servers,” likely a euphemism for reading online forums and tutorials. \\nThe agent’s testimony said the assistance started for the foundation, then was expanded to include another server located in the Clintons’ home. The agent “was contacted by Justin Cooper in January 2011 to assist with the security of an email server at the Clinton residence in Chappaqua, New York.” Cooper is an aide to Douglas Band, Clinton’s long-time personal assistant and business associate. \\nThe agent “contacted Bryan Pagliano to recommend adding outbound IP filtering to the server.” Pagliano, a Clinton campaign staffer turned State Department aide, has since pleaded the Fifth Amendment, refusing to answer questions from congressional investigators. \\nThe Clinton Foundation told the Weekly Standard that “it appears the agent is conflating the Clinton Foundation with the president’s personal office,” suggesting that the foundation was never hacked and that both instances must have referred to Bill Clinton’s personal office email. \\nClinton’s email and the former president’s personal office both ran off the same email server, Clinton has said, adding \\n“The use of that server, which started with my husband, certainly proved to be effective and secure.” \\nThe FBI summary of the agent’s testimony said the agent “was aware of no other information pertaining to the email server located in Chappaqua.” \\nSecret Service sources interviewed by the Weekly Standard said the agency “absolutely” worked on the “theft of information” case for the Clinton Foundation and that records show it. \\nIf an intrusion did not occur on the foundation’s server and the agent was confusing the home and foundation servers, then it suggests that Clinton’s private server had a “theft of information” situation. \\nClinton has combated criticism of the private server by saying it was safe because the Secret Service guarded the property —“It was on property guarded by the Secret Service, and there were no security breaches.” The testimony, however, weakens that argument, as the testimony indicates that the Secret Service was providing traditional physical security, and one guard happened to have some IT familiarity. \\nFederal security had already been informed of the server’s existence at least as early as November 2010. That month, IT aide Pagliano reported to the Secret Service 10 unsuccessful hack attempts on the server that Clinton used to conduct State Department business. \\nThe hackers had used the login “Huma,” the first name of Clinton’s closest personal aide at the Department of State, according to emails obtained under a lawsuit brought by Judicial Watch. \\nThe “theft of information” situation does not seem to refer to that failed attempt, since the Secret Service was contacted about it in November 2010, but the testimony refers to being contacted about the personal server in January 2011. \\nPresident Barack Obama said in March 2015 he only learned of the server from the news media, even though as State Department aides frantically worried about after the denial, Clinton and Obama had emailed using the private address. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742628396.1372082}