{"duration": 0.1012716293334961, "input_args": {"text": "'November 12, 2016 - Fort Russ -  Viktor Pirozhenko, Izvestiya - translated by J. Arnoldski -  \\n\\n\\nOn her Facebook page, Verkhovna Rada deputy Nadezhda Savchenko urged future US President Donald Trump to maintain and strengthen sanctions against Russia. In fact, she foreshadowed similar, official calls of the sort from Kiev to the new US administration.  \\nSuch calls will necessarily follow insofar as the entire foreign policy of the Kiev regime is based on simple-minded and destructive assumptions: lobbying the West for extending anti-Russian sanctions and begging for aid and loans.  \\nHowever, likely changes in US foreign policy under Trump, including in relations with the Kiev regime, as well as internal political processes in Ukraine itself could seriously change both the relationship between Kiev and Washington and the balance of political forces within the Kiev regime.  \\nOverall, the situation in Ukraine is developing in the direction of early parliamentary elections with the possibility of nominating the now former head of the Odessa regional administration, Mikhail Saakashvili, for president in 2019. \\nThe US itself long ago formulated the clear demand for a new, distinctly pro-American oriented political force that could replace the Maidan politicians of the first wave. Washington, in the face of the departing Obama Administration, has finally refused to trust Poroshenko, Yatsenyuk, Avakov, and their entourage. \\nDonald Trump, on the basis of his foreign policy ideas, will most likely significantly reduce the US’ active participation in ideologically-driven foreign policy actions like the Obama Administration’s policy in Ukraine.  \\nDuring his election campaign, Trump promised to transition US foreign policy to \"breaking even\" and threatened to stimulate America’s European allies to take greater responsibility for Ukraine upon themselves.  \\nIn this situation, the number of those in Ukraine who want to show that replacing the corrupt government of Poroshenko and the People’s Front with a new pro-American government will allow the West to economize on aid to Ukraine is increasing. Trump’s foreign policy positions paradoxically give Saakashvili and the pro-American groups oriented towards him in Kiev an additional argument for the new administration and a powerful lever of pressure on Poroshenko and his entourage. We will soon see how Trump will react to these arguments. \\nIn addition to Saakashvili and his Volna (\"Wave\") party, the “Leshchenko-Nayem group” is trying to become the new pro-Western bet in Ukraine. This group makes up the core of the Democratic Alliance party and a large mass of the pro-Western oriented public opinion leaders and influential officials in Kiev and in the regions. \\nWashington’s unwillingness to destabilize the overall socio-political situation in Ukraine to such an extent that it would spin out of the US’ control is, like before, hindering the Americans from removing Poroshenko from the post of president. Poroshenko remains, but in such a situation, the role and importance of those pro-American oriented political forces who will start keeping a close eye on the corrupt team of the head of the Kiev regime will only grow. \\nWashington’s claims against Kiev, duplicated by the American column in Ukraine, concern the lack of professionalism in the state administration, the indulgence of corruption, the use of grey financial schemes in the economy, robbing the budget, the misuse of foreign loans, etc.  \\nAt the present moment, the anti-Poroshenko and pro-American forces in Ukrainian politics remain fragmented, but they now understand the necessity of unifying.  \\nThe problem is that the “young reformers” that the Obama Administrated hedged its bets in Ukraine on, just like the third pro-American forces (besides the Poroshenko Bloc and People’s Front) have turned out to be at loggerheads with the future US president, Trump.  \\nDeputies Sergey Leshchenko and Mustafa Nayem are favorites of Joe Biden and Victoria Nuland who openly played along with Hillary Clinton’s election campaign. Leshchenko personally initiated the \"off-the-books\" scandal with the Party of Regions which forced Paul Manafort, the head of Trump’s election headquarters, to leave his post. The only chance for them now is to escape to Saakashvili’s patronage, who will be the only one in the Kiev regime that didn’t play in any anti-Trump campaign. \\nSaakashvilli and his party, just like the Democratic Alliance, Yulia Tymoshenko’s Fatherland party, and the Opposition Bloc, are interested in early parliamentary elections and are likely to promote them. Saakashvili’s resignation, urgent party building, and the convulsive social and political activity of Poroshenko’s opponents show that no one in the opposition wants to wait until 2019. And so, a congress of the Democratic Alliance party is being prepared which will finally determine a program and elect a leadership. Someone is also trying to organize Volna.  \\nWhether the Trump Administration will give a green light to early parliamentary elections is unknown. However, Poroshenko’s competitors are obviously counting on their activism to influence the Trump Administration’s position and put the need to support such choices in front of it.  \\n\\nIn one way or another, some of Poroshenko’s competitors have perceived the change of government in the US not only as a challenge, but as a window of opportunity for themselves. Taking into account this factor, the development of events in Ukraine increases the likelihood of a change in the balance of political forces and early parliamentary elections.  \\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742562307.6918266}