{"duration": 0.059995412826538086, "input_args": {"text": "\"Share on Facebook \\nA California woman with Lupus who was wearing a bandana over her head was targeted with a hateful note and her car windows were smashed. \\nEvery day for the past 49 days, Nicki Pancholy, 41, of Milpitas, has been hiking up Mission Peak in the name of peace, she explained to NBC Bay Area . Due to the acidic election cycle, Pancholy said she wanted to walk up the 2,500-foot-high mountain to send up prayers for health and collective harmony. “Every step is a soft whisper to God,” she said. \\nAfter she descended from the Peak, she found a note on the hood of her car. “Hijab wearing b—– this is our nation now get the f— out,” the note read. \\nBecause she suffers from Lupus, Pancholy wears a headscarf to protect her from the sun. \\n“When I saw it, I was in shock,” she said of the message. “That someone would feel so much hate to do this. I realize that this is the climate after this election. But I didn’t realize someone would be so ignorant and in so much pain to cause so much harm.” \\nPancholy, who is totally not of the Muslim faith, said she forgives the perpetrators and prays for them. \\nWatch: \\nEast Bay Regional Park Police are investigating the incident as a hate crime and auto burglary. In addition to the note and smashed car windows, her purse and checkbook were stolen. \\nWatch courtesy of NBC: \\nPancholoy was born in San Jose, California. Her ethnicity is Rajastani Indian and she said her religion is ‘love.’ Trumpsters can’t even bigot correctly. \\nSince the election, attacks on women, Muslims, blacks and Latinos have been reported across the country. Children are even attacking other children. This comes at a time when the president-elect’s advisers are pushing for a Muslim registry. One prominent Trump surrogate is even suggesting Japanese-style internment camps. \\nAnd Trump supporters want us to give the president-elect a chance. I don’t think so. \\nImage via screen capture Written by Conover Kennard Conover makes tea partiers cry as a hobby. She was Commander of Jade Helm15 during the failed takeover of the South. She's also one of the biggest arseholes on Twitter. At night, she can be found drinking Conservative tears while pulling off the wings of flies just because she can. She is the founder of a Marxist, Commie, Maoist, Socialist site and has contributed to several other sites, blah blah blah. She is an awful person but she doesn't like to brag about that. SEARCH THE SITE \""}, "time": 1742563975.3020546}