{"duration": 0.03552079200744629, "input_args": {"text": "'The New York Times reports Breitbart Senior Editor MILO and Bill Maher agreed on many issues while appearing on HBO’s Real Time With Bill Maher. [Describing MILO’s appearance on the show, the New York Times writes,  “Despite a brief   of controversy that preceded it, a conversation between Milo Yiannopoulos, the incendiary   author and lecturer, and Bill Maher, the comedian and host of HBO’s ‘Real Time,’ on that program Friday night was a largely docile, chummy affair. There was little conflict or   as both men chided the political left for avoiding or drowning out Mr. Yiannopoulos’s views rather than engaging with them. ”  “Introducing Mr. Yiannopoulos, 32, an openly gay editor at Breitbart News, Mr. Maher said: ‘I think you’re colossally wrong on a number of things. But if I banned everyone from my show who I thought was colossally wrong, I would be talking to myself,’” the NYT noted. Quoting MILO, the NYT states: “’All I care about is free speech and free expression,’ Mr. Yiannopoulos explained. ‘I want people to be able to be, do and say anything. These days, you’re right, that’s a conservative issue. ’” The NYT mentioned MILO’s observations of the political left’s inability to understand comedy anymore: “In the interview on Friday night, Mr. Yiannopolous criticized female comedians like Amy Schumer and Sarah Silverman, and he described the Democrats as ‘the party of Lena Dunham,’ the creator and star of ‘Girls.’ (Mr. Maher replied: ‘Let’s not pick on fellow HBO stars. There are so many other people. ’)” Ending the article by discussing MILO’s comments on “Overtime,” Maher’s internet streamed   program, the NYT stated, “Trying to defuse the tension [between the panelists] Mr. Maher wryly suggested to Mr. Yiannopoulos that he shouldn’t be so quick to spar with his fellow panelists. ‘This is the beginning of your career,’ Mr. Maher said. ‘People are only just starting to hate you. ’” Read the full article here.'"}, "time": 1742562103.9642482}