{"duration": 0.17489123344421387, "input_args": {"text": "'\\nby Nick Bernabe\\nA small Standing Rock Sioux site in North Dakota called the Sacred Stone Camp has been propelled into the national news narrative following their stand against the Dakota Access Pipeline. Due in part to independent media coverage of the ongoing standoff, the Sacred Stone camp has grown into a formidable opposition against the $3.8 billion, 1,200-mile long pipeline.\\nDue to misinformation coming from law-enforcement, political favoritism toward the pipeline builders, and the media’s blatant reluctance to report on the pipeline, it’s hard to tell truth from fiction. Anti-Media , along with our partners in the independent media and our embedded journalist at the opposition encampment, have been covering the unfolding standoff continuously. Here are five things you need to know.\\n1. Who is opposing the pipeline — and why \\nThe Standing Rock Sioux tribe is leading the opposition to the Dakota Access Pipeline. They have been joined by the largest tribal coalition in over 100 years in their stand against the pipeline. The coalition is also comprised of activists, allies, and environmentalists, collectively known as “water protectors,” at the Sacred Stone Camp, an encampment close to the location where the pipeline is planned to cross the Missouri River in North Dakota. According to the Sacred Stone camp website , they are opposing the pipeline because “[t]he Dakota Access threatens everything from farming and drinking water to entire ecosystems, wildlife and food sources surrounding the Missouri.” \\nThe Standing Rock Sioux also say the pipeline is violating treaty land , Sioux territory that was established many years ago by the federal government. “We will not allow Dakota Access to trespass on our treaty territory and destroy our medicines and our culture.” \\nThe opposition to the pipeline spreads across several states and is not opposed solely by Native Americans. Farmers, ranchers, and landowners are also opposed to the pipeline. Many of them have had their land taken from them against their will and given to the pipeline via eminent domain.\\n2. The U.S. government and the pipeline corporation are continuing a long tradition of disrespecting Native Americans \\nThe United States has a very bad reputation for treating Native Americans, the original inhabitants of this land, as less than human. In many instances in the past, the land where Native Americans lived was deemed to be of higher value than the Natives’ lives.\\nSuch has been the case in North Dakota — not only now, but in the past as well. According to The Atlantic :\\n“The land beneath the pipeline was accorded to Sioux peoples by the Treaty of Fort Laramie in 1868. Eleven years later, the U.S. government incited and won the Great Sioux War, and ‘renegotiated’ a new treaty with the Sioux under threat of starvation. In that document, the tribe ceded much of the Laramie land, including the Black Hills of South Dakota, where many whites believed there to be gold.”\\nAfter the federal government relegated the Sioux people to the “Great Sioux Reservation” in 1851 , the treaty was re-written and “renegotiated” by force whenever resources were discovered or when the U.S. government wanted land. Essentially, the Sioux people were victims of U.S.-sanctioned murder, and their land was stolen because gold was discovered on it.\\nFast forward to 2016 and the Sioux people are once again making a stand on land that was once — and still is , according to the tribe — theirs. How is the government reacting to this stand? By brutally arresting the Native American water protectors for trespassing . If that is not a miscarriage of justice, I don’t know what is.\\nFurther, Energy Transfer Partners, the company pulling the strings behind the DAPL, has deep pockets, and its lobbyists have cozied up to federal, state, and local governments with jurisdiction over the pipeline route. This could explain why the company began its construction of the pipeline on Army Corps of Engineers land without even securing an easement , which is required by law. Dakota Access LLC, a subsidiary of Energy Transfer Partners, has also used the strong-arm of government to force farmers and landowners to hand over their land to the pipeline against their will.\\n3. Violent acts are being carried out in North Dakota, but not by the water protectors \\n\\nViolence is breaking out at the Dakota Access Protest site, but the protesters have nothing to do with it. Pipeline police, bolstered by the North Dakota National Guard and sheriffs imported from around the country, have turned the standoff into a war zone. Water protectors are regularly pepper sprayed, tear gassed, and violently arrested. Over the weekend, 127 people were detained in the biggest mass arrest to date.\\nMilitarized police at the Dakota Access Pipeline site are decked out in riot gear, armed with military grade weapons, use armored cars or MRAPs with snipers on top of them, and have regularly used LRADs, a type of mass crowd dispersal weapon that uses a high pitched noise to hurt people’s ears — sometimes permanently .\\nEarly reports of protesters being armed and violent have proven to be instances of misinformation spread by law enforcement apparently seeking to demonize the opposition. No credible reports of violence by the protesters have been confirmed or prosecuted. Nearly all arrests stem from trespassing charges or crimes of journalism.\\nWhen protesters initially began using civil disobedience to physically shut down the Dakota Access Pipeline site, they were confronted violently by security guards from British mercenary firm G4S. The mercs sicced dogs and used pepper spray on the protesters in an assault that went viral and helped catalyze even more support for the water protectors.\\n4. Independent media is under attack at the Dakota Access Pipeline — and the corporate media is ignoring it \\nIndependent media’s broadcasts over the Internet are basically the only reason people around the country and the world now know about the struggle at Standing Rock. Unfortunately, journalists are not immune to the police crackdowns in North Dakota. Dozens of journalists have now been arrested, and an arrest warrant was issued for high-profile journalist Amy Goodman. One independent media outlet, Unicorn Riot , saw four of their journalists arrested in one day in North Dakota. One filmmaker is facing up to 45 years in prison for filming acts of civil disobedience against the pipeline.\\nAnti-Media ’s journalist on the ground, Derrick Broze, was tased by law enforcement while covering the protests on Thursday as this article was being written.\\nMeanwhile, the national corporate media ignored the battle against the Dakota Access Pipeline as long as they could. For months, despite the DAPL emergence into the national narrative, ABC and NBC refused to air any coverage about it. A woman was arrested for protesting the pipeline on her own farm after Dakota Access LLC gained access to it against her will via eminent domain — yet there was still no corporate media coverage on the incident.\\n5. How you can help the opposition \\n\\nNow that you see what water protectors are up against in North Dakota, here’s what you can do to help.\\nGet yourself to the Sacred Stone Camp. The water protectors need reinforcements as people are regularly arrested. The bigger the stand, the more likely the pipeline’s construction will be halted. Here’s how to get there . Send supplies or donations. Water protectors need your help with supplies and funding. Go to this link to send supplies. Go to this link to donate to the cause. Support independent journalists that risk arrest to bring you the news from the front lines. Follow Sacred Stone Camp on Facebook. Share this article. For 10 more ways to get involved, click here . Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Anti-Media of theantimedia.org . \\nThe “Anti” in our name does not mean we are against the media, we are simply against the current mainstream paradigm. The current media, influenced by the industrial complex, is a top-down authoritarian system of distribution—the opposite of what Anti-Media aims to be. At Anti-Media, we want to offer a new paradigm—a bottom-up approach for real and diverse reporting. We seek to establish a space where the people are the journalists and a venue where independent journalism moves forward on a larger and more truthful scale. '"}, "time": 1742561700.1652083}