{"duration": 0.02382636070251465, "input_args": {"text": "\"More Police move to disperse students protesting outside the parliament in Cape Town, South Africa, October 26, 2016. (Photo by Reuters) \\nClashes have erupted outside South Africa's parliament as police struggled to disperse students protesting against financial hardships and the deteriorating economic situation in the country. \\nThe protest on Wednesday outside the national assembly building in Cape Town saw a direct confrontation between the police and about 2,000 students. \\nThe protesting students were mainly angry at the increased tuition fees in the universities. They also voiced anger at South Africa’s grim economic prospects. \\nOther cities across the country have seen similar protests over the past weeks, some of them violent. Officials in Cape Town, Johannesburg and elsewhere have even ordered the temporary closure of the universities to calm down the situation. An injured student is helped by classmates during a protest outside the parliament in Cape Town, South Africa, October 26, 2016. (Photo by Reuters) \\nThe clashes on Wednesday came as Finance Minister Pravin Gordhan delivered a speech in the parliament to warn about South Africa’s weakening economy, although he vowed that the government would do anything to help students in the country cope with financial problems. \\n“We will do everything that is possible to regain normality on our campuses. We want the violence to stop,” Gordhan said, adding, “Many students face financial hardships that undermine their ability to succeed academically.” \\nGordhan said South Africa’s 2016 growth forecast stood at 0.5 percent. He also stated that an extra 17 billion rand ($1.2 billion) would be earmarked for funding university students. \\nHe warned that a growing sense of political uncertainty in South Africa could seriously harm the country’s financial position in the world. \\n“Much more disturbing, and more difficult, is the rise in our own communities of anger and discontent, spilling over into violence and destructive protests,” Gordhan said, adding, “It is not just that our economic outlook is distressed, and there is the possibility of downgrades in credit ratings.” \\nGordhan’s promise of spending cuts and fighting corruption has triggered a new political stand-off in South Africa. He has been ordered to appear in court on November 2 to face charges of fraud in what many see as a direct clash between him and people loyal to President Jacob Zuma. The minister enjoys a good deal of public support over his record in office. \\nSome senior members of Zuma’s African National Congress (ANC) have dismissed charges against Gordhan as politically motivated, calling on Zuma and the ANC’s senior figures to resign to save the party from the current political turmoil. Loading ...\""}, "time": 1742628526.14108}