{"duration": 0.0790548324584961, "input_args": {"text": "'Comments \\nFederal Judge John Michael Vazquez set a court appearance for this Thursday for the Democratic National Committee’s emergency legal action to fight Republican minority suppression efforts. \\nThe DNC filed suit over a generation-old consent decree last week seeking an injunction and extension of the order by eight years, which prevents illegal Republican voter suppression “ballot security” measures. \\nThat lawsuit is looking ever more likely to succeed, resulting in an order barring Republicans across the country from targeting minority voters. The RNC’s response pointedly omitted any defense of the Michigan and Pennsylvania RNC members accused of unlawful ballot security programs, who are the two key players in this courtroom drama that also involves VP candidate Mike Pence and Trump campaign manager Kellyanne Conway. \\nThe federal judge ordered both Michigan GOP Chairwoman Ronna Romney McDonald – Mitt Romney’s niece – and Pennsylvania GOP Chairman Rob Gleason to submit sworn statements along with documentation of their ballot security programs by 5pm today. \\nLast night, Republican lawyers tossed the two high-ranking RNC members under the bus by failing entirely to defend their actions, sworn accounts of which are due at 5pm today. The Democrat’s strongest claims are against the two national RNC members who spoke to the media about ballot security programs. \\nThe Washington Post wrote about the Pennsylvania GOP’s plans to flood urban Philadelphia with suburban poll watchers from other counties and a legal effort to remove state law restrictions on out of county ballot watchers, while t he Michigan State GOP Chairwoman was quoted in The Detroit Free Press as saying she was directing measures in Michigan to launch a “massive anti-fraud” effort. \\nUnder the 1982 agreement between the parties as it’s been modified through the years, any “ballot security program” must be submitted to the court and DNC for “preclearance” ten days before being implemented. It seems highly unlikely that the DNC was notified of any of the four major activities the court demanded to be explained. \\nThe Republican National Committee also has until 5pm today to deliver statements about minority voter suppression made in public, video recorded comments by VP nominee Mike Pence and media reports about the Trump campaign manager Kellyanne Conway’s statements after the third and final debate. Additionally, the national Republican party has got to deliver to the court any and all agreements between the RNC and the Trump campaign that involve electioneering or polling places to the court as well. \\nThe Democratic lawyers even submitted fresh evidence to the court that the RNC is involved nationally in poll security operations, which a former federal prosecutor obtained via text message during the normal course of poll watching activities. The RNC denies activity in any and all poll watching venues in their legal filings. \\nThe Republican National Committee is clearly frustrated by its lengthy tenure under the key voter protection legal agreement, and you can tell from the legal filing that it wants out. However, the Republican party of Trump isn’t playing by the rules, like it’s standard bearer doesn’t play by the rules, and now they’re likely going to be punished. \\nTonight, the music stops and the Republicans will finally have to answer for their dirty campaign tactics, or face the wrath of a federal judge. \\nHere’s the judge’s complete order:'"}, "time": 1742564136.2501123}