{"duration": 0.0637674331665039, "input_args": {"text": "'VIDEOS Italy’s earthquakes leave 15,000 homeless, ‘soul of the country’ damaged Given the strength of Sunday’s new quake, experts said it was remarkable that it had not resulted in any more fatalities By Extinction Protocol - November 2, 2016 \\nItalian authorities said on Monday they were taking care of more than 15,000 people left homeless by the country’s most powerful earthquake in nearly 40 years. Although Sunday’s 6.6 -magnitude tremor did not result in any deaths, the third powerful quake in just over two months has left thousands of homes in ruins or structurally unsafe and emptied a string of villages and small towns across the country’s mountainous central regions. The majority of residents of the devastated villages and towns have taken refuge with friends and family as they anxiously await a green light to return to their homes. \\nBut the national civil protection agency said on Monday it was providing assistance to 15,000 people affected by Sunday’s quake, which was so powerful it caused cracks in buildings in Rome, some 120 kilometers (75 miles) away from the epicenter near the Umbrian town of Norcia. Some 4,000 people from the worst-hit area around Norcia have been sent to hotels on the Adriatic coast with another 500 taken by bus to the inland Lake Trasimeno. More than 10,000 are being put up in converted sports halls and other temporary facilities, including tents, across Umbria and the neighboring Marche region, the protection agency said. \\nA further 1,100 people are still in Adriatic coast hotels as a result of the August 24th Amatrice earthquake, which left nearly 300 dead. Given the strength of Sunday’s new quake, experts said it was remarkable that it had not resulted in any more fatalities. With many roads blocked by landslips or huge boulders dislodged by the quake, civil protection chief Fabrizio Curcio and reconstruction supremo Vasco Errani were surveying the damage by helicopter. Prime Minister Matteo Renzi has vowed that every damaged house will be rebuilt and that communities he described as part of “the soul of the country” would not be abandoned. But after the trauma of three major quakes in such quick succession, the future of the already sparsely populated affected areas looks bleak. “At the moment I don’t see any possible future,’ evacuated Norcia resident Antonella Ridolfi told AFP. “Everything here will have to be rebuilt. There is nothing really solid left in the center. We have always bounced back after other earthquakes but we’ve never had to deal with one as strong as this.” – The Local'"}, "time": 1742562142.2184174}