{"duration": 0.05769491195678711, "input_args": {"text": "\"  A Defeated Obama Condescendingly Mocks Winner Trump, Says ‘He Can’t Keep Campaign Promises’ Obama scolded his Republican successor for believing he can deliver on his campaign promises. 'I think that he successfully mobilized a big chunk of the country to vote for him,' Obama told reporters.   Barack Obama delivered a series of patronizing backhanded compliments to President-Elect Donald Trump on Monday during a lengthy White House press conference conducted before his final trip abroad as America’s leader. While he praised Trump for pulling off ‘one of the biggest political upsets in history,’ Obama scolded his Republican successor for believing he can deliver on his campaign promises . ‘I think that he successfully mobilized a big chunk of the country to vote for him,’ Obama told reporters. But ‘regardless of what experience or assumptions he brought to the office, this office has a way of waking you up.’‘And those aspects of his positions or predispositions that don’t match up with reality, he will find shaken up pretty quick. Because reality has a way of asserting itself.’ Trump campaigned on an no-holds-barred agenda of dismantling much of Obama’s agenda including immigration reforms put in place without congressional input, a widely criticized Iranian nuclear deal and an Obamacare system whose pilings have grown shaky. But the president suggested the billionaire’s poetic rallies can never jive with Washington’s messier prose. ‘I think it’ll be important for him to have the room, to staff up, to figure out what his priorities are, to be able to distinguish between what he was campaigning on and what is practical – what he can actually achieve,’ Obama cautioned. ‘You know, there are certain things that made for good good soundbites, but don’t always translate into good policy. And that’s something that he and his team will wrestle with in the same way every president wrestles with.’ Ultimately, Obama hinted , he believes Trump is more a realist than a principled conservative – despite connecting with a previously disengaged voting base on the strength of broad promises.  \""}, "time": 1742564481.7167819}