{"duration": 0.18619060516357422, "input_args": {"text": "'Werden sich die Vereinigten Staaten reformieren oder zerreißen? von Thierry Meyssan Das Beobachten des US-Präsidentschaftswahlkampfes führt Thierry Meyssan zur Analyse des Wiederauflebens des alten und schweren zivilisatorischen Konfliktes. Hillary Clinton hat gerade erklärt, dass die Wahl sich nicht um Programme dreht, sondern um die Frage: \"Wer sind die Amerikaner? Die republikanischen Führer entziehen ihrem Kandidaten, Donald Trump, nicht wegen politischen Themen ihre Unterstützung, sondern wegen seinem persönlichen Verhalten. Unserem Autor zufolge waren die Amerikaner bisher aus unterschiedlichen Gegenden kommende Einwanderer, die akzeptierten, sich der Ideologie einer bestimmten Gemeinschaft unterzuordnen. Das ist dieses Modell, das jetzt allmählich zerfällt, mit der Gefahr das Land selbst zunichte zu machen.\\nVoltaire Netzwerk | Damaskus (Syrien) | 26. Oktober 2016 français Español italiano русский English Português ελληνικά Türkçe عربي 73% der millenaristischen Wähler (d.h. jene die an das baldige Ende der Welt glauben) weisen den republikanischen Kandidaten Trump zurück. 68% von ihnen halten die demokratische Kandidatin für fähiger, um die Mittelklasse zu verteidigen; 64% halten sie für besser in aussenpolitischen Fragen; 61% in ökonomischen Fragen. Während des Jahres der amerikanischen Wahl-Kampagne, die wir mitgemacht haben, hat sich die Rhetorik tiefgreifend verändert und zwischen den beiden Lagern ist eine unerwartete Spaltung aufgetaucht. Wenn anfangs die Kandidaten über wirkliche politische Themen sprachen (z. B. die Verteilung des Reichtums oder die nationale Sicherheit), geht es jetzt hauptsächlich um Sex und Geld.\\nEs ist diese Rede und nicht die politischen Fragen, die die republikanische Partei gesprengt hat - deren Hauptführer ihrem Kandidaten die Unterstützung entzogen - und die das politische Schachbrett neugestaltet hat, indem sie eine sehr alte zivilisatorische Kluft wieder auftauchen ließen. Auf der einen Seite will Frau Clinton politisch korrekt erscheinen, während auf der anderen Seite der \"Donald\" die Heuchelei der ehemaligen \"First Lady\" in Stücke reißt.\\nAuf der einen Seite fördert Hillary Clinton die Gleichberechtigung von Mann und Frau, obwohl sie nie gezögert hatte, Frauen, die wissen ließen mit ihrem Ehemann Sex gehabt zu haben, anzugreifen und zu beschmutzen; obwohl sie nicht für ihre persönlichen Qualitäten Kandidatin ist, sondern als Ehefrau des ehemaligen Präsidenten, und Donald Trump der Frauenfeindlichkeit beschuldigt, weil er aus seiner Vorliebe für Frauen keinen Hehl macht. Auf der anderen Seite prangert Donald Trump die Privatisierung des Staates an, die Erpresserbande von ausländischen Persönlichkeiten durch die Clinton-Stiftung, um einen Termin im Außenministerium zu bekommen; die Schaffung von ObamaCare, die nicht im Interesse der Bürger, sondern nur der Krankenversicherung ist; und er geht selbst so weit, um die Aufrichtigkeit des Wahlsystems in Frage zu stellen.\\nIch weiß sehr wohl, dass die Ausdrucksweise von Donald Trump in der Tat Rassismus fördert, aber ich denke nicht, dass dies das Herzstück der Wahldebatte ist, trotz der von den Pro-Clinton Medien gemachten Hype.\\nEs ist nicht gleichgültig, dass während der Lewinsky-Affäre, Präsident Bill Clinton sich bei der Nation entschuldigt und Pastoren versammelt hat, um für seine Rettung zu beten. Während Donald Trump, für ähnliches Verhalten mit einer Audio-Aufnahme in Frage gestellt, sich nur bei den verletzten Personen entschuldigte, ohne Mitglieder des Klerus miteinzubeziehen.\\nDie aktuelle Spaltung greift die Revolte der Werte der Katholiken, Orthodoxen und Lutheraner gegen die Calvinisten wieder auf, die in den Vereinigten Staaten vor allem durch die Presbyterianer, Baptisten und Methodisten vertreten sind.\\nWenn die beiden Kandidaten auch in puritanischer Tradition (Clinton als Methodistin und Trump als Presbyterianer) erzogen wurden, kehrte Frau Clinton erst nach dem Tod ihres Vaters zur Religion zurück und beteiligt sich heute an der Gebetsgruppe des Stabschefs der Streitkräfte, the family, während Herr Trump eine mehr innerliche Spiritualität ausübt und selten in den Tempel geht.\\nNatürlich ist niemand in seinem Muster eingesperrt, in dem er aufgewachsen ist. Aber wenn wir ohne zu denken handeln, reproduzieren wir es ohne dessen bewusst zu sein. Die Frage des religiösen Umfeldes kann also für jedermann wichtig sein.\\nUm zu verstehen, worum es geht, muss man ins England des 17. Jahrhunderts zurückgehen. Oliver Cromwell stürzte König Charles I. mit einem militärischen Staatsstreich. Er behauptete, eine Republik zu etablieren, die Seele des Landes zu reinigen und ließ den ehemaligen Souveränen enthaupten. Er schuf ein sektiererisches Regime, inspiriert von den Ideen von Calvin, massakrierte massenweise die irischen Papisten und verhängte einen puritanischen Lebensstil. Er entwarf auch den Zionismus: Er rief die Juden nach England zurück und war das erste Staatsoberhaupt der Welt, das die Schaffung eines jüdischen Staates in Palästina befürwortete. Diese blutige Episode ist als der \"erste britische Bürgerkrieg\" bekannt.\\nNach der Restauration der Monarchie flohen Cromwells Puritaner aus England. Sie ließen sich in den Niederlanden nieder, von wo manche von ihnen auf der Mayflower nach Amerika (die \"Pilger\") fuhren, während andere die Gemeinschaft der Afrikaneer im südlichen Afrika gründeten. Während des Unabhängigkeitskrieges der Vereinigten Staaten im 18. Jahrhundert erlebte man wieder die Konfrontation der Calvinisten gegen die britische Monarchie, die man in den derzeitigen britischen Geschichtsbüchern als \"zweiten Bürgerkrieg\" bezeichnet.\\nIm 19. Jahrhundert fand der Sezessionskrieg statt zwischen den Staaten des Südens (hauptsächlich von katholischen Siedlern bewohnt) und den des Norden (eher von protestantischen Siedlern bewohnt). Die Geschichte der Gewinner stellt diese Auseinandersetzung als einen Kampf für die Freiheit von der Sklaverei dar, was reine Propaganda ist (die südlichen Staaten schafften die Sklaverei während des Krieges ab, als sie ein Bündnis mit der britischen Monarchie schlossen). In der Tat war die Konfrontation jene der Puritaner mit dem englischen Thron, Grund, dass einige Historiker hier über den \"Dritten britischen Bürgerkrieg“ sprechen.\\nWährend des zwanzigsten Jahrhunderts schien dieser innere Kampf der britischen Zivilisation überholt, außer dem Wiederaufleben der Puritaner im Vereinigten Königreich mit den \"nicht-konformen Christen\" von Premierminister David Lloyd George. Letztere teilten Irland und versprachen eine \"jüdische nationale Heimstätte\" in Palästina zu schaffen.\\nWie auch immer, einer der Berater von Richard Nixon, Kevin Phillips, hat diesen Bürgerkriegen eine voluminöse Arbeit gewidmet und festgestellt, dass keines der Probleme gelöst war und hat eine vierte Runde angekündigt [ 1 ].\\nDie Anhänger der reformierten calvinistischen Kirchen, seit 40 Jahren mit überwältigender Mehrheit Wähler für die Republikaner, unterstützen von nun an die Demokraten.\\nIch habe keinen Zweifel, dass Frau Clinton der nächste Präsident der Vereinigten Staaten werden wird, oder, dass wenn Herr Trump gewählt wurde, er schnell beseitigt werden würde. Aber in wenigen Monaten gab es eine breite Wahl-Umverteilung auf einem Hintergrund des demografischen irreversiblen Wandels. Die Puritaner Kirchen bedeuten insgesamt nur mehr ein Viertel der Bevölkerung und fallen in das demokratische Lager. Ihr Modell erscheint als ein historischer Unfall. Es verschwand in Südafrika und wird nicht viel länger überleben, weder in den USA noch in Israel.\\nJenseits der Präsidentschaftswahl muss sich die US-Gesellschaft schnell entwickeln oder wird sich wieder zerreißen. In einem Land, wo die Jugend massiv den Einfluss der puritanischen Prediger ablehnt, ist es nicht möglich, das Thema der Gleichstellung aufzuschieben. Die Puritaner erwägen eine Gesellschaft, wo alle Menschen gleich sind, aber nicht gleichwertig. Lord Cromwell wollte eine Republik für die Engländer, aber erst, nachdem er die irischen Papisten niedergemacht hatte. Es sind derzeit in den Vereinigten Staaten alle Bürger vor dem Gesetz gleich, aber im Namen der gleichen Texte verurteilen die Gerichte systematisch Schwarze, während sie für Weiße, die entsprechende Straftaten begangen haben, mildernde Umstände finden. Und in der Mehrzahl der Staaten genügt eine strafrechtliche Verurteilung, ja selbst ein Geschwindigkeitsüberschreitung, um das Wahlrecht zu verlieren. Infolgedessen sind schwarz und weiß gleich, aber in einigen Bundesstaaten hat die Mehrheit der schwarzen Männer ihr Wahlrecht verloren. Das Paradigma von diesem Gedanken in der Außenpolitik, ist die \"zwei-Staaten-Lösung\" in Palästina: gleich, aber vor allem nicht gleichwertig.\\nDas ist das puritanische Denken, das die Verwaltungen des Pastors Carter, von Reagan, von Bush (Senior und Junior sind zwei direkte Nachfahren der Pilgerväter), von Clinton und Obama dazu führte, den Wahhabismus zu unterstützen, im Widerspruch mit den Idealen ihres Landes und heute selbst Daesch zu unterstützen.\\nEinst gründeten die Pilgerväter Gemeinschaften in Plymouth und Boston, die im kollektiven amerikanischen Gedächtnis idealisiert wurden. Die Historiker sind sich jedoch einig, sie sagten, das \"neue Israel\" zu bilden und wählten das \"Gesetz von Moses\". Sie setzten kein Kreuz in ihre Tempel, sondern die Tafeln des Gesetzes. Obwohl Christen, legen sie mehr Wert auf die jüdischen Schriften als auf die Evangelien. Sie zwangen ihre Frauen, ihren Kopf zu verschleiern und führten wieder körperliche Züchtigung ein.\\nThierry Meyssan Übersetzung\\nHorst Frohlich'"}, "time": 1742563259.7402132}