{"duration": 0.11662554740905762, "input_args": {"text": "'5 Reasons Why Belief in Authority is the Most Dangerous Superstition Belief in authority is dangerous, and doubly so when the majority is under its spell. \\n“Question authority, including the authority that told you to question authority.” — Sixth grade girl \\nLet’s get something straight, here at the outset. There’s nothing wrong with authority itself. It’s the belief part that messes everything up. Anyone can claim authority. But such authority only matters if others believe in it. \\nI can claim that I’m an authority on unicorns, but I better have the credentials to prove it. And it would also help if unicorns existed. But the point is this: If enough people “believe” that I’m an authority on unicorns, and they “believe” that I have dissected a unicorn and revealed the magical quality of its insides that causes it to shit rainbows, then I’ll not only have violated truth, I’ll have violated the minds of others and taken advantage of their ignorance. But, and here’s the rub, it’s their fault for not questioning my so-called authority. As Albert Einstein said (himself an authority in the field of physics), “Unthinking respect for authority is the greatest enemy of truth.” So if we’re correct to question Einstein’s revolutionary theories, then we’re exponentially correct to question my unicorn theories. \\nRespecting a prestigious authority, or taking into consideration important knowledge gleaned by someone who is an authority in a particular domain of knowledge is fine. It’s even okay that sometimes we allow people to violate our minds. We allow artists to do it all the time. No, it’s when we “believe” in authority, when we blindly follow a perceived authority, that things go wrong. \\nBelief implies non-questioning. But let’s sail right past semantics and art and get down to brass tacks. Belief in authority is dangerous. And it’s doubly dangerous when the majority of people are under its spell. Here are five reasons why. 1.) It Can Cause Otherwise Good People to do Evil Things \\n“It’s easier to fool people than to convince them that they have been fooled.” \\nMARK TWAIN \\nSo back to my authority on unicorns. Did you know that unicorns also created the universe? Yup! Not only do they shit rainbows, they also puke universes. The last unicorn died for our sins in a forest of fiery crosses. And the only commandment that survived the test of time is this: “Anyone who questions the fact that unicorns created the universe are godless heathens and deserve to die and spend eternity in the fiery pits of a Tennessee summer afternoon.” \\nNow enter unquestioning idiots with hooked-on-authority soup for brains. They “believe” the Last Commandment of the Unicorns. They believe it so much that they refuse to question it, lest other believers think they are not true believers. Lest they get ostracized by the status quo. Lest they look “crazy” in the eyes of their fellow believers. Now just replace The Last Commandment of the Unicorns with the Bible or the Koran or the Constitution of the United States, or state-driven police enforcement , or the belief that “nothing can be said to be certain, except death and taxes.” \\nThe problem is that people will fight, and kill, and murder, and commit both genocide and ecocide, for what they believe in. But they might not have fought so violently and thoughtlessly had they simply taken into consideration ALL those claims of authority and moved on smartly with their lives. The best way to maintain a healthy skepticism, and not devolve into an ignorant, sycophantic, violent mess, is to take things into consideration and question them rather than believe in them. 2.) It Leads to the Idea That We Need to Give a Group of People Permission to Control Us \\n“The multitudes have a tendency to accept whoever is master. Their very mass weighs them down with apathy. A mob easily adds up to obedience. You have to stir them up, push them, treat the men rough using the very advantage of their deliverance, hurt their eyes with the truth, throw light at them in terrible handfuls.” \\nVICTOR HUGO \\nBy the way, the Church of the Last Unicorn is in charge of everything. It is the power behind all nation states. It pulls the strings of presidents. It whispers dark secret nothings into the ears of queens. It tugs the coattails of emperors. Its poison-soft invisible rainbow-powers saturate all things. You might as well just give into it. You might as well just let them pull your strings through the indirect authority of strategically placed men. It’s just the way things are, after all. \\nOr, you could question it all. You could question the almighty Unicorns. You could question the kings and queens and emperors and presidents and judges and lawyers and cops. You could question all authority, especially the so called authority of the state . It’s so easy even a sixth grader understands it (see opening quote). \\nThe alternative is devolving into a statist. A statist is a person who believes that a group of people have the right to force, coerce, enslave, rob, and murder others. Statism is a mental disorder brought on by years of indoctrination. The problem is that the majority of the world’s population has been conditioned and brainwashed into believing in the almighty power of the state. The problem is that the majority of people are too afraid to question the state, lest they become ostracized by the statist-junky status quo. The problem is that most people don’t even know that they don’t know that there is an alternativ e. 3.) Power Given to Authority Tends to Corrupt \\n“I have as much authority as the Pope. I just don’t have as many people who believe it.” \\nGEORGE CARLIN \\nHere’s a little secret: The Pope has unicorn powers. Then again, so does Colin Kaepernick . Keep in mind, the unicorn power is a righteous power. It’s a loving power that had, and has, the greatest of intentions. It created the universe, after all. And if you don’t believe it, then feel free to rot in Hades, Illinois, located directly across the Mississippi River from St. Louis (according to Uncyclopedia: the content-free encyclopedia ). \\nBut I digress, the problem with power isn’t its intent. The problem with power is that it tends to corrupt the one wielding it. And when it comes to absolute power –well, we all know where that leads. So since we all know that power tends to corrupt, and since we all want power anyway, it behooves us all to be circumspect both with it and against it. \\nSo it stands to reason not to give power to authority by believing it, but to use the power of authority instead by undermining it. And the best way to use the power of authority is to use it against the authority by questioning that authority. It’s a social leveling mechanism par excellence, similar to the Native American concept of counting coup. As Elie Weisel said, “Every question possesses a power that does not lie within the answer.” We just need to use that power more effectively, especially against ourselves. Unicorns forbid! 4.) It Leads to An Ignorant and Apathetic Citizenry \\n“The totally convinced and the totally stupid have too much in common for the resemblance to be accidental.” \\nROBERT ANTON WILSON \\nIn the Unicorns we trust! Their powers are ubiquitous. Their symbols of control are hidden in all the world’s national flags, waiving influentially over the weakened masses. Their horns are the invisible bone funnels in everyone’s pie, siphoning power like it was blood pudding. Oh, I forgot to mention, blood pudding is a unicorn’s favorite dish. Obey, or go without! \\nWhen it comes down to it, obedience to authority is a disease of laziness and indifference. It hinders the progressive evolution of our species by undermining anything that might challenge the current system for the better. Forget “for the worst.” Fighting for the better at risk of the worst is far superior to shirking the better in fear of the worst. Similarly, worst case scenarios should not be avoided at the expense of healthy progress. Healthy progress should be embraced at the risk of worst case scenarios. Otherwise we don’t get anywhere but where we are. Which is great if “where we are” is perfect. But since perfection is not possible, we must be willing to risk upsetting the all-too-precious apple cart (or blood pudding cart, in this case) in order to progress. \\nIf, as Jose Ortega y Gasset said, “Man, whether he likes it or not, is a being forced by his nature to seek some higher authority. If he succeeds in finding it of himself then he is a superior man; if not, he is a mass-man and must receive it from his superiors,” then it is incumbent upon us to have the courage to shirk our inner mass-man in order to discover self-authority through self-questioning. As long as we are responsible with our own power, and as long as we don’t allow anyone to hold too much power over us, then we might just be able to get out of our own way as a species. \\nBecause, as it stands now, we are definitely in our own way. Especially since following authority in today’s world means giving into debt-slavery , kowtowing to an expropriating state, and being unwitting accomplices to genocides past and ecocides future. As the authors of The Fuck-it Point surmised,“Obedience to authority is not a valid excuse; not when doing what we’re “supposed to do” means letting this civilization-machine continue to kill life on earth just to make commodities out of living beings and life easy only for some.” Share:'"}, "time": 1742628317.608605}