{"duration": 0.12804937362670898, "input_args": {"text": "'When she heard that Nintendo was planning to reproduce its iconic Nintendo Entertainment System video game console for the holiday season, Emily Bradbury put a note on her calendar and set an alarm on her phone. She was not interested in buying it for her children. She wanted it for her husband. “He’s 40 years old and grew up with a Nintendo,” Ms. Bradbury said. “It’s a nostalgia thing. ” Since its release on Nov. 11, the NES Classic Edition, a smaller version of the original console introduced to North America in 1985, has become one of the hottest gift items of the year. It has struck a chord especially among older millennials and younger members of Generation X, who may have found in it a video game system to share with their children  —   if they don’t just keep it for themselves. It retails for $60, with one original controller, and comes preloaded with 30 classic games, including Super Mario Bros. Donkey Kong, The Legend of Zelda and Tecmo Bowl. But this trip down memory lane has not been without headaches. Nintendo has been sluggish in responding to the demand, resulting in huge markups on the secondary market, including on sites like eBay, where the consoles were being resold for as much as $390. Those higher prices are sure to stand out even more on Monday, when many other brands and retailers cut prices for Cyber Monday, the online version of Black Friday. On the release date, most retailers, including Amazon and GameStop, sold out almost immediately. (  had sold out over the summer.) Walmart kept a very limited supply in stock that it trickled out in online flash sales over the last two weeks. The consoles sold out within two minutes each time. Heeding her calendar warnings and alarms, Ms. Bradbury tried to order the NES online through Amazon and Walmart but could not act quickly enough. She even enlisted friends to visit nearby Target and Best Buy stores in Wichita, Kan. the closest big city to her home. But they, too, returned  . “I thought it would be a bunch of us   people going after it, but it won’t be much of a big deal,” said Ms. Bradbury, the member services director for the Kansas Press Association, a trade organization for Kansas newspapers. “I was shocked. ” But Michael Pachter, a Wedbush Securities analyst, said he was not surprised by the intense demand or the low supply, which he considered an intentional move by Nintendo to garner attention, knowing that it could restock before the holiday shopping season was over. “The Classic is sold out for three reasons: It’s nostalgic, it’s cheap and Nintendo clearly didn’t ship enough of them,” Mr. Pachter said in an email, adding: “There is plenty of time to stock the channel. They may miss Black Friday, but they won’t miss Xmas. ” In a statement, Nintendo said that it was “working hard to keep up with consumer demand. ” “There will be a steady flow of additional systems through the holiday shopping season and into the new year,” the statement read. The company declined to comment further. David Cole, the chief executive of DFC Intelligence, a market research firm, said there was a lot riding on Nintendo’s ability to satisfy demand in the next few weeks. The company is introducing a new product, Nintendo Switch, in 2017, which it hopes will make up for its lagging sales of the Wii U and its late entry into mobile gaming. Pokémon Go, which was released over the summer and is partially owned by Nintendo, was the company’s first major effort in mobile gaming, and it was a sensation. Mr. Cole said buyers were pursuing the NES Classic Edition mostly for nostalgia, but he thought the console could potentially make older customers interested in future Nintendo products. “They had really lost their brand identity the past two years,” Mr. Cole said. “This was the kind of thing that was perfect for bringing that back. ” But such a plan will work, Mr. Cole added, only if Nintendo manages to restock before the holidays are over. “If they don’t, they really miss out on an opportunity,” he said. “That demand might not carry over into 2017. ” Jim Silver, editor of TTPM, a toy review website, says that nostalgic items have been big this year, and that retailers are recognizing that many of the children who grew up in the 1980s are starting families of their own. He noted that Stretch Armstrong figurines, and Strawberry Shortcake and Teddy Ruxpin dolls have all begun making comebacks. The NES is no different. “This is not    saying, ‘I need to have Zelda,’” Mr. Silver said. “This is adults saying, ‘These were my favorite games. I get to play them again. ’” But shopping for a hot holiday item, even online, is hardly simple today. And those who have managed to acquire the new NES at the retail price seem to have benefited from extensive planning, research and luck  —   even strategizing since July, when Nintendo announced its plans to release the NES. Michael Salazar, from Sacramento, Calif. managed to place a request to   a console on July 22 through Amazon’s British website. When it arrived last week, shipped directly from Edinburgh, Mr. Salazar was elated. He then used a secondary site, which tracks inventory at Target stores, to monitor whether any consoles had arrived locally. When he saw that a nearby Target had received three, he rushed there at 7:30 a. m. on a Sunday to buy one as a present for his   . Now, he is looking for a third to give as a gift. “I’m 38 that’s my childhood,” Mr. Salazar said. “Nintendo was always a very important piece of my life. ” Amanda Schluer, of Rocklin, Calif. had the foresight in July to set an alert on Amazon for one minute before the release date. Then she watched the seconds tick down. “I’ve sat and waited for Garth Brooks tickets the same way,” Ms. Schluer said. “Just wait until the second they go on sale and push the button. ” By acting quickly, Ms. Schluer, 38, managed to buy a console. She and her husband even took their NES to Los Angeles to play with family over Thanksgiving. “We have a Wii, and my kids never play it,” said Ms. Schluer of her two daughters, ages 6 and 10. “That’s the good thing about the old retro games,” Ms. Schluer added. “They are fun, they’re   and it’s something we can all play together. ”'"}, "time": 1742563084.6193607}