{"duration": 0.08292603492736816, "input_args": {"text": "'By wmw_admin on October 29, 2016 Pat Buchanan — The Unz Review Oct 28, 2016 \\nShould Donald Trump surge from behind to win, he would likely bring in with him both houses of Congress. \\nMuch of his agenda — tax cuts, deregulation, border security, deportation of criminals here illegally, repeal of Obamacare, appointing justices like Scalia, unleashing the energy industry — could be readily enacted. \\nOn new trade treaties with China and Mexico, Trump might need economic nationalists in Bernie Sanders’ party to stand with him, as free-trade Republicans stood by their K-Street contributors. \\nStill, compatible agendas and GOP self-interest could transcend personal animosities and make for a successful four years. \\nBut consider what a Hillary Clinton presidency would be like. \\nShe would enter office as the least-admired president in history, without a vision or a mandate. She would take office with two-thirds of the nation believing she is untruthful and untrustworthy. \\nReports of poor health and lack of stamina may be exaggerated. Yet she moves like a woman her age. Unlike Ronald Reagan, her husband, Bill, and President Obama, she is not a natural political athlete and lacks the personal and rhetorical skills to move people to action. \\nShe makes few mistakes as a debater, but she is often shrill — when she is not boring. Trump is right: Hillary Clinton is tough as a $2 steak. But save for those close to her, she appears not to be a terribly likable person. \\nStill, such attributes, or the lack of them, do not assure a failed presidency. James Polk, no charmer, was a one-term president, but a great one, victorious in the Mexican War, annexing California and the Southwest, negotiating a fair division of the Oregon territory with the British. \\nYet the hostility Clinton would face the day she takes office would almost seem to ensure four years of pure hell. \\nThe reason: her credibility, or rather her transparent lack of it. \\nConsider. Because the tapes revealed he did not tell the full truth about when he learned about Watergate, Richard Nixon was forced to resign. \\nIn the Iran-Contra affair, Reagan faced potential impeachment charges, until ex-security adviser John Poindexter testified that Reagan told the truth when he said he had not known of the secret transfer of funds to the Nicaraguan Contras. \\nBill Clinton was impeached — for lying. \\nWhite House scandals, as Nixon said in Watergate, are almost always rooted in mendacity — not the misdeed, but the cover-up, the lies, the perjury, the obstruction of justice that follow. \\nAnd here Hillary Clinton seems to have an almost insoluble problem. \\nShe has testified for hours to FBI agents investigating why and how her server was set up and whether secret information passed through it. \\nForty times during her FBI interrogation, Clinton said she could not or did not recall. This writer has friends who went to prison for telling a grand jury, “I can’t recall.” \\nAfter studying her testimony and the contents of her emails, FBI Director James Comey virtually accused Clinton of lying. \\nMoreover, thousands of emails were erased from her server, even after she had reportedly been sent a subpoena from Congress to retain them. \\nDuring her first two years as secretary of state, half of her outside visitors were contributors to the Clinton Foundation. \\nYet there was not a single quid pro quo, Clinton tells us. \\nYesterday’s newspapers exploded with reports of how Bill Clinton aide Doug Band raised money for the Clinton Foundation, and then hit up the same corporate contributors to pay huge fees for Bill’s speeches. \\nWhat were the corporations buying if not influence? What were the foreign contributors buying, if not influence with an ex-president, and a secretary of state and possible future president? \\nDid none of the big donors receive any official favors? \\n“There’s a lot of smoke and there’s no fire,” says Hillary Clinton. \\nPerhaps, but there seems to be more smoke every day. \\nIf once or twice in her hours of testimony to the FBI, grand jury or before Congress, Clinton were proven to have lied, her Justice Department would be obligated to name a special prosecutor, as was Nixon’s. \\nAnd, with the election over, the investigative reporters of the adversary press, Pulitzers beckoning, would be cut loose to go after her. \\nThe Republican House is already gearing up for investigations that could last deep into Clinton’s first term. \\nThere is a vast trove of public and sworn testimony from Hillary, about the server, the emails, the erasures, the Clinton Foundation. Now, thanks to WikiLeaks, there are tens of thousands of emails to sift through, and perhaps tens of thousands more to come. \\nWhat are the odds that not one contains information that contradicts her sworn testimony? Cong. Jim Jordan contends that Clinton may already have perjured herself. \\nAnd as the full-court press would begin with her inauguration, Clinton would have to deal with the Syrians, Russians, Taliban, North Koreans and Xi Jinping in the South China Sea — and with Bill Clinton wandering around the White House with nothing to do. \\nThis election is not over. But if Hillary Clinton wins, a truly hellish presidency could await her, and us. Patrick J. Buchanan is the author of the new book “The Greatest Comeback: How Richard Nixon Rose From Defeat to Create the New Majority.”'"}, "time": 1742562220.1568592}