{"duration": 0.023404359817504883, "input_args": {"text": "\"Share on Twitter \\nFor Robin Roberts, losing her mother while she was in the midst of her own fight for her life was an especially hard blow. Roberts's mother had always been there for her through every illness and injury. \\nWhen she needed her mom the most, however, Roberts swears that she could hear her voice, encouraging her not to give up on life. Image Credit: Mireya Acierto/Getty Images \\nAs PopSugar reports, on a recent episode of “ Harry ,” the “Good Morning America” co-host tearfully recounted the days she spent in the hospital after a bone marrow transplant. Famously open about her battles with breast cancer and a rare bone marrow disease, Roberts tells host Harry Connick Jr. that she had reached the point where the fight was too much for her: \\n“There was a time when I sent everybody away, and I was in my room, and I just felt like I'm slipping away. I just couldn't.” \\nOne of the things that had made Roberts feel like giving up was the fact that her mother was no longer there by her side. However, she was soon to find that her mom was closer than she realized. She tells Harry: \\n“I kept hearing this voice, 'Robin! Robin! Robin!' And suddenly, I open my eyes, and it's ... my nurse Jenny. She's looking at me. That was my mother's voice. I am convinced, when I was hearing that, even though it was Jenny, it was my mother's voice I was hearing.” \\nRoberts believes that at her point of “ greatest isolation ,” her mother used Jenny to call her back, to remind her to keep fighting. \\nJenny, Roberts says, was “invaluable” during this time. Acknowledging the bond between Roberts and her nurse, Harry surprised Roberts by reuniting her with nurse Jenny and another nurse who had cared for her. An emotional Roberts was able to thank them for not only everything they had done for her, but for what they have done for countless others: \\n“Thank you for being our lifeline. Thank you for being there— not only for us, but for our caregivers ... for our loved ones.” \""}, "time": 1742564430.7108378}