{"duration": 0.1664717197418213, "input_args": {"text": "\"  Without intention, Mike kind fulfills the proverb that not all who wander are lost. A 1973 graduate of the College of the Holy Cross with a BA in Philosophy, he had successfully dodged the draft during Vietnam, despite his lottery number of 29. Logically, after failing at being a bum for a year after college, he then enlisted in the Army. His theory was to hang out for two years, go to Germany, date blondes, drink lots of beer, improve his wretched German and come home to use the GI Bill for Graduate School. Didn’t quite work out that way; he did go to Germany and stayed five years first tour; married a red-headed American GI who worked in S2; did drink lots of beer and developed some acuity with pidgin Deutsch. Mike re-enlisted and then wandered through a great 23 years as a soldier. A lot of it sucked, of course; but, he avoided ending his adolescence until the end of the 23 years…since then, he’s been in a fight to regain that feeling of camaraderie, purpose and trust. Mike chose to stay a career NCO. There were a couple of dozen reasons, but they’re best summed up by the fact that he really didn’t like officers. He still doesn’t, sheepishly at times admitting that “Some of my best friends are officers. Some of my best friends are gay. Some of my best friends are gay officers. I’m not gay and I’m not an officer – I like it better that way.” He got his initial First Sergeant assignment in his 14th year and basically stayed a First Sergeant until he retired, as a First Sergeant. If he hadn’t retired, the day after the retirement would have been the day he pinned on CSM stripes but, as he says, “Some of my best friends are Sergeant Majors; some of my best friends are hookers. I’m not a Sergeant Major and I’m not a hooker and that works fine for me.” Since retiring, Mike’s worked in Labor Relations, HR and General Management for government, tribes, nonprofits and for profits including Defense Contractors. He’s found that his “not being a hooker” approach hasn’t necessarily worked to his career advantage. He’s picked up a bunch of irrelevant graduate degrees, that basically were there to teach you how to be a Hobbit. Hobbits are small, insignificant fearful types who scurry around getting in the way and accomplishing nothing of any great merit. He believes that the movies would have been infinitely better had the bad guys killed off all the Hobbits in the first part of the first movie, and then spent the rest of it avenging the little twits. Mike really hates Hobbits He’s a Senior Professional in Human Resources and a Six Sigma Black Belt. He plays guitar, reads, broods and drives too fast in fast cars – currently, a Mustang GT – channeling Hunter S. Thompson, patrolling “on the edge of the desert, just outside of Barstow.” An avowed leftist and philosophical Stoic, Mike admits that everything is probably going to hell, but thinks that it’s the duty of people of honor to work to stop it from going there too quick. Since he regards all veterans as his extended family, he expects that they’ll do the same. An oddly religious guy, Mike believes that God is a not very bright, self—entered and hormonal teenage girl obsessed with the Jonas Brothers and whether or not her Daisy Duke jeans make her ass look fat. They do, but he’s not going to be the one to tell her the truth. God can’t handle the truth. While he might write about anything, he’s really interested in business, economics and how to keep people from being screwed by machines, be they corporate, government, or societal. He's also interested in guitars... Dispatches from Wolf Country — Kale and Seal Liver By Mike Farrell on October 29, 2016 The reason why young people don't turn out for elections is because they don't remember how badly things can go. How hard can it be to run a country is a question asked by outsiders; how bad can it be is a question asked by those who don't remember; what's the worst thing that can happen is the one asked by well-insulated di pshits who should watch some footage of the Cultural Revolution in China interspersed with Triumph of the Will and 1984. A Center Right Party for Progressives! Pirate Party Logo With Dragon Head The Pirates promise to introduce direct democracy, subject the workings of government to more scrutiny and place the country’s natural resources under public ownership. The party also seeks tough rules to protect individuals from online intrusion. Jonsdottir, the Pirates’ most prominent voice, is a former ally of WikiLeaks who has called on Iceland to offer citizenship to National Security Agency leaker Edward Snowden.Opponents claim the inexperienced Pirates could scare off investors and destabilise an economy that is now recovering, with low unemployment and high growth. “We’d rather be naive than corrupt,” Jonsdottir said. – The Guardian, Oct 29, 2016 \\nBill Mahar, the commentator comedian, had a bit going during the height of the “If Trump wins, I’m going to Canada!” thing that American progressives and liberals couldn’t all go to Canada because if they did, “Who’s going to eat all this fucking Kale!?” Well, perhaps this offers a solution. If the best thing in the world happens, perhaps we can export it to Iceland… Birgitta Jonsdottir, Iceland’s Pirate Party Leader — Stuff.Co.NZ \\nIceland strikes me more and more as a very cool place. Cold, but cool. Michael Lewis had a great Vanity Fair article “Wall Street on the Tundra” about the 2008 economic crisis worldwide focusing on Iceland. Iceland had no reason to be sucked into that mess but was, like a Long Ship dragged under the ocean by a Krakken powered whirlpool. Fishermen found themselves as real estate magnates and shepards as billionaire speculators, largely in the UK, leveraging debt and selling tranches of fish futures while getting used to driving Bentley’s and Astons around Reykjavik in Trump designer label suits under their seal skins. \\nWhen it all went to hell, and it did, the country convulsed, shook it off, sent the fishermen-shepherd speculators back to sea and sheep while the poets, intellectuals and activists led largely by lesbian politicians,’various poets and saga translators; and World Strong Man champions took over and got things running again only with more transparency, efficiency and effectiveness. What the hell do you expect in a country where everybody is related to Bjork? And, of course, to Eric the Red and Leif Ericsson? In a country where the Parliament’s Official Name Translate from Danish to The Thing? \\nAnyway, they have an election today, and there’s a good possibility that the Pirate Party, founded on-line in the post 2008 period and led by female poet named Brigitta Jonsdottir could end up in a leading role in one or another version of a governing coalition. Of course, before we get too excited, we should remember that despite an average electoral turnout of 80%, young people tend to blow off elections at a very high rate and the Pirate Party is a youth party, so… \\nSelling tranches of fish futures driving Astons around Reykjavik in Trump designer suits under their seal skins. \\nI suspect the reason why young people don’t turn out for elections is because they don’t remember how badly things can go. How hard can it be to run a country is a question asked by outsiders; how bad can it be is a question asked by those who don’t remember; what’s the worst thing that can happen is the one asked by well-insulated dipshits who should watch some footage of the Cultural Revolution in China interspersed with Triumph of the Will and 1984. \\nIt’s possible that for Iceland and Europe as a whole, 2008 is close enough to encourage people to remember; and, since Iceland is limited from the Nationalist and Corporatist hysteria facing the UK and the rest of the EU, they might be able to avoid the Fascist tinge to so much…after all, I think their platform, for a center-right party is to the left of Bernie Sanders. Hope so. Related Posts:\""}, "time": 1742562019.6137314}