{"duration": 1.733658790588379, "input_args": {"text": "'WASHINGTON  —   In an extraordinary denunciation of Donald J. Trump’s temperament and competence, President Obama urged leaders of the Republican Party on Tuesday to withdraw their endorsements of Mr. Trump’s candidacy, flatly calling him “unfit to serve” as the nation’s 45th president. Speaking in the East Room of the White House while Mr. Trump rallied supporters in a nearby Virginia suburb, the president noted the Republican criticism of Mr. Trump for his attacks on the Muslim parents of an American soldier, Capt. Humayun Khan, who died in Iraq. But Mr. Obama said the political recriminations from Republicans “ring hollow” if the party’s leaders continue to support Mr. Trump’s campaign. “The question they have to ask themselves is: If you are repeatedly having to say in very strong terms that what he has said is unacceptable, why are you still endorsing him?” Mr. Obama said. “What does this say about your party that this is your  ?” The president’s condemnation of Mr. Trump, and his direct appeal to Republicans to abandon their candidate, were stunning even in a city where politics has become a brutal and personal affair. Mr. Obama seemed eager to go beyond his past interventions in the race, which have included forceful rejections of Mr. Trump’s statements and policy proposals. The last time a sitting president was as openly critical of the other party’s candidate, said Douglas Brinkley, a presidential historian, was when President Harry S. Truman mocked Dwight D. Eisenhower during the 1952 campaign. And once Eisenhower was elected, Truman said he did not know “any more about politics than a pig knows about Sunday. ” “It’s a reflection of just how radical and dangerous President Obama feels that Trump is,” Mr. Brinkley said. Using the formal backdrop of a joint news conference with Prime Minister Lee Hsien Loong of Singapore, Mr. Obama suggested that Mr. Trump would not abide by “norms and rules and common sense” and questioned whether he would “observe basic decency” should he reach the Oval Office. The president said he would have been disappointed to lose in 2008 or 2012, but added that he had never doubted whether his Republican rivals in those races, John McCain and Mitt Romney, could function as president or had the knowledge to make government work. “That’s not the situation here,” Mr. Obama said. As Mr. Obama condemned Mr. Trump, the Republican candidate  —   apparently unaware of the president’s remarks  —   repeatedly criticized his Democratic opponent, Hillary Clinton, and the president in an hour of remarks. He called Mrs. Clinton a “liar” and a “thief” and said the country would be “finished” if voters chose four more years of a presidency like Mr. Obama’s. Mr. Trump also accused Mrs. Clinton of repeatedly lying over the weekend when she told Chris Wallace on “Fox News Sunday” that James B. Comey, the F. B. I. director, had said her statements about her private emails were truthful. “I mean, she lied,” Mr. Trump said, prompting cries of “Lock her up!” from his supporters. “She, pure and simple, she only knows to lie. She really does. She only knows to lie. But she lied, and it’s a big story. ” Mr. Comey, testifying last month to Congress, said that “we have no basis to conclude she lied to the F. B. I. ” But he also said he could not say whether Mrs. Clinton’s many public statements on the issue were truthful. Mr. Trump, in a written statement meant to respond directly to the president’s remarks, called Mrs. Clinton “unfit to serve in any government office. ” He also accused Mr. Obama and Mrs. Clinton of allowing Americans to be slaughtered in Benghazi, Libya letting veterans die waiting for medical care and releasing immigrants into the United States to kill innocent people. “Our nation has been humiliated abroad and compromised by radical Islam brought onto our shores,” Mr. Trump’s statement said. “We need change now. ” The dueling appearances by the president and the Republican candidate seeking to replace him escalated the heated political rhetoric in a race that had already devolved into a series of personal attacks and character assassinations. Mr. Obama cited Mr. Trump’s reaction to Captain Khan’s parents, Khizr and Ghazala Khan, as a principal reason for his extended remarks. Mr. Trump had criticized the Khans after they honored their son at the Democratic National Convention and urged people to vote for Mrs. Clinton. Mr. Obama lamented what he called an attack on a “Gold Star family that had made such extraordinary sacrifices on behalf of our country. ” He said he did not doubt that Republicans were outraged about the statements Mr. Trump and his supporters had made about the Khan family in the last several days. “But there has to come a point at which you say somebody who makes those kinds of statements doesn’t have the judgment, the temperament, the understanding, to occupy the most powerful position in the world,” Mr. Obama said. The president did not limit his criticism to Mr. Trump’s treatment of the Khan family. Mr. Obama said the Republican nominee had repeatedly demonstrated that he was “woefully unprepared to do this job. ” The president said Mr. Trump had proved he lacked knowledge about Europe, the Middle East and other parts of Asia. “This isn’t a situation where you have an episodic gaffe. This is daily,” Mr. Obama added. “There has to be a point at which you say, ‘This is not somebody I can support for president of the United States, even if he purports to be a member of my party.’ The fact that that has not yet happened makes some of these denunciations ring hollow. ” Mr. Trump, who spoke at a boisterous rally at Briar Woods High School in Ashburn, Va. began his remarks there by saying a veteran had given him a Purple Heart medal earlier in the day. “I always wanted to get the Purple Heart,” said Mr. Trump, who received five deferments from the draft during the Vietnam War. “This was much easier. ” Throughout his speech, Mr. Trump argued his case that Mrs. Clinton was “unfit” for the presidency, accusing her of being dishonest, weak on foreign policy and corrupt. He accused the president of doubling the national debt and said the Iraq war exit was a “disaster. ” “Let Obama go to the golf course,” Mr. Trump said. “But you know what? We’d be better off. ” At one point during the rally, a crying baby interrupted Mr. Trump’s speech. “Don’t worry about that baby. I love babies,” Mr. Trump said at first. “I hear that baby crying, I like it. What a baby, what a beautiful baby. Don’t worry, don’t worry. ” A few beats later, he changed his tune. “Actually, I was only kidding,” Mr. Trump said. “You can get that baby out of here. ” Laughs and a few gasps escaped from the crowd. “Don’t worry, I think she really believed me that I love having a baby crying while I’m speaking,” Mr. Trump added. “That’s O. K. People don’t understand. That’s O. K. ” Even as Mr. Obama discussed trade policy and security issues with the Singaporean prime minister, Mr. Trump criticized world leaders. He said he would ask Chancellor Angela Merkel of Germany “what went wrong” in her country. And he criticized Mrs. Clinton for what he called “terrible relations” with President Vladimir V. Putin of Russia. At the White House, Mr. Lee of Singapore responded to a question about Mr. Trump with diplomacy, and said Singapore would look forward to working with whomever Americans chose as president. “Many pressures build up during the election campaign, and after the elections in a calmer, cooler atmosphere, positions are rethought, strategies are nuanced, and a certain balance is kept in the direction of the ship of state. It does not turn completely upside down,” Mr. Lee said. “The Americans take pride in having a system with checks and balances,” he added. “So, it is not so easy to do things, but it is not so easy to completely mess things up. ”'"}, "time": 1742564572.8597405}