{"duration": 0.04727435111999512, "input_args": {"text": "'PARK CITY, Utah  —   At the close of the Sundance Film Festival, those standing in solidarity with protesters of the Dakota Access Pipeline met in Park City, Utah. [A protest was held this past week and Malia Obama, President Obama’s eldest daughter, was reportedly seen attending the protest against the Dakota Access Pipeline during the Sundance Film Festival, Breitbart News reported.  Dave John, a Tewa Navajo Indian, told Breitbart Texas President Trump has “  the signing of papers” for the pipelines.   John, the treasurer of the group that organized the event, answered an inquiry before the march as to whether he thought the event would be peaceful. He answered by saying that those in Morton County at the Standing Rock Indian Reservation have flash grenades, bean bags, and rubber bullets. The Native American charged there was “good   by the mainstream media in the area and they had lied about what was happening at Standing Rock. The reporting was influenced by the “Sheriff’s Department,” he said. John explained he was there with others gathered “fighting for water mostly,” and they wanted to bring awareness to the issue. Those marching held signs that said “Water is Life,” “Water is Sacred,” “People Over Profits,” “When You Poison Water the Little Babies Die, and “I Stand With Standing Rock. ” The organizers of the event, (P. A. N. D. O. S. an acroynm for Peaceful Advocates for Native Dialogue and Organizing Support) said they were showing support for “the brave water protectors at Standing Rock. ” Carl Moore, a Native American, said they were there to support not only those at Standing Rock, but people in Arizona and “all over. ” He asked folks gathered to pray for those who are protesting in the freezing cold at Standing Rock and are “threatened every day. ” He said it is so “discouraging [for the protesters] when they see those lights out there working. ” Moore was also critical of the media saying, the “media has left them behind,” “forgotten about them. ” He said the word has gotten out by “social media” and “people who care. ” Moore said “We have our country that has been taken over,” but added “we have a renewal. ” The event was promoted on the group’s official Facebook page as “Prayerful Resistance for Standing Rock,” and the event and march was a peaceful, prayerful gathering. Law enforcement officials from Park City were present at the event. “Dee,” a Park City, Utah resident, told Breitbart Texas she was there because she loved beauty and said, “Clean air and clean water used to not be political. ” She continued, “I do not think that there is anything political about oil into waterways, and yes, pipelines break all the time. ” Lana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.'"}, "time": 1742564288.513531}