{"duration": 0.07166242599487305, "input_args": {"text": "'Killer Mike Proves Real Leaders are Truth-Tellers by Saying What Most People Won’t Nov 21, 2016 0 0 \\nPolitics in America has devolved into a contest of personalities, where policy, history, and reality are rejected in favor of style, skin color, gender and celebrity factor. This is unsurprising, though, in a nation that has for generations been weened on television and state indoctrination. We’ve been trained to look to politicians for leadership, but the real heroes and change makers in our world are the fearless truth-tellers who work to free our minds and inspire us to greatness by setting an example with their words and deeds. \\nAs we stare down the barrel of a critically divided society under the thumb of an all-powerful government and police state, righteous voices of non-partisan, no-bullshit truth who apply logic, common sense, and critical-thinking in defense of community and humanity are needed now more than ever. One such example is hip-hop artist, civic leader, social activist, and entrepreneur Michael Render, aka Killer Mike . His articulation of the problems we all face, accompanied with real ideas for meaningful action, make for an excellent reminder of what true leadership can look like. \\nHe’s done a ton of interviews in recent years, and although he mentions being a conservative, even advocating for the 2nd Amendment in response to public shootings, he played a big role in Bernie Sanders’ campaign for the Democratic nomination in an effort to help educate and awaken black voters. Consider the following clips of Killer Mike speaking on a number of today’s critical issues. \\nFirstly, he talks to TMZ about the importance of participating in local elections and in using your vote to hold political parties accountable, while helping to see through the phony logic of voting for the lesser of two evils. \\n“Scaring me with the boogie man is not going to work as effectively as giving my community something that helps.” ~Killer Mike \\nIn his song, ‘ Reagan, ‘ he rails against Obama, along with all the other authoritarian presidents we’ve had, as a member of an organization of war and profit, saying what so many Obama supporters are afraid to acknowledge. \\n“Ronald Reagan was an actor, not at all a factor Just an employee of the country’s real masters Just like the Bushes, Clinton and Obama Just another talking head telling lies on teleprompters If you don’t believe the theory, then argue with this logic Why did Reagan and Obama both go after Qaddafi We invaded sovereign soil, going after oil Taking countries is a hobby paid for by the oil lobby Same as in Iraq, and Afghanistan And Ahmadinejad say they coming for Iran They only love the rich, and how they loathe the poor If I say any more they might be at my door” \\n~Killer Mike, Reagan \\nAs a leader in the black community, he is keenly aware of the affects of racism and police brutality today, but rather than advocating for protests or riots as an expression of justifiable anger, he breaks down how black people can overcome systemic corruption and racism by using the one weapon that is most effective in a capitalist culture: money. \\nFurthermore, on the Bill Maher show on HBO , he goes into relationship between politicians and police, pointing out how politicians themselves use police as pawns. Final Thoughts \\nThe President of the United States of America is the figurehead of an authoritarian and corporatized organization that masquerades as benevolent, but POTUS is a puppet, not a leader. As Americans go at each other’s throats over about the election, it may serve us well to remember that individuals are the true leaders in our community and in our world. \\n“My criteria is probably Libertarian views, where you just let the free market reign, you let people do what they want to, and the government takes care of protecting us from foreign interests and one another.” ~ Killer Mike \\nAbout the Author \\nDylan Charles is a student and teacher of Shaolin Kung Fu, Tai Chi and Qi Gong, a practitioner of Yoga and Taoist arts, and an activist and idealist passionately engaged in the struggle for a more sustainable and just world for future generations. He is the editor of WakingTimes.com , the proprietor of OffgridOutpost.com , a grateful father and a man who seeks to enlighten others with the power of inspiring information and action. He may be contacted at [email protected] . This article ( Killer Mike Proves Real Leaders are Truth-Tellers by Saying What Most People Won’t ) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Dylan Charles and WakingTimes.com . Vote Up'"}, "time": 1742564209.090439}