{"duration": 0.18835902214050293, "input_args": {"text": "'For more than two decades, Susan Graham has made the world her stage, her sumptuous   and magical presence celebrated at the Metropolitan Opera in New York, the Royal Opera House in London and the Théâtre du Châtelet in Paris. But a piece of her heart never quite left the   plains of West Texas  —   not Midland, where she spent her adolescence, or Lubbock, where she attended Texas Tech University. She would send her itinerary to her Friends and Family List, so that if she were singing in Vienna or Sydney or Timbuktu and someone from home happened to be there, they could connect. Clay Brakeley long held a place of honor on that list. They had met at college in 1983 (she was a graduate student in music he was an undergraduate in theater  —   as part of a boisterous social scene that gravitated toward Ms. Graham’s place, known as the Party Hut. “It was a little   rental house near the campus, and we were the repository for lost and wayward souls,” she said. “You never knew who was going to be sleeping on the couch when you woke up. ” Young, brash and prone to roaring around town on a motorcycle, Mr. Brakeley first caught her eye and then her ear as she gave him voice lessons. “He has a great voice and sang Riff in ‘West Side Story,’” she said, snapping her fingers and cooing softly. “‘Boy, boy, crazy boy, get cool boy!’ I taught him that. ” Soon they were an item (“She chased me till I caught her,” is how he likes to put it) in that haphazard way that college couples often are. When in 1985 she moved to New York to attend the Manhattan School of Music, he visited a few times, and their relationship fell back into its carefree rhythms. But eventually distance and careers divided them, and they sought love in closer proximity. “We both understood that we were moving in different circles at that point, but there was always a little something underneath when we would see each other,” Mr. Brakeley said. His own life turned peripatetic when he moved to Los Angeles and began working in lighting and stagecraft for Bonnie Raitt, Neil Diamond, Bon Jovi and the Jacksons (Michael and Janet). And as Ms. Graham’s itineraries kept arriving  —   first as letters, then as emails  —   their paths would occasionally intersect: Lunch in Chicago. A rock concert in San Francisco. Her stellar performance of a signature role, Octavian in Strauss’s “ Rosenkavalier,” at the Met. And two memorable days in Paris in 1996, when she was singing Dorabella in Mozart’s “Così Fan Tutte” at the Palais Garnier for the first time, and he had flown in from touring Ireland with Michael Bolton to see her  —   and to get his   roadie’s hair lopped off at a salon. (She requested that he wait a day so she could gaze at his leonine mane a bit longer.) “I was in a relationship with somebody else, and none of those encounters were anything but just friendly,” she said. “But it was always great to see him and there was always, I think, a little bit of sizzle, a little bit of familiarity and comfort. ” In 2000, Mr. Brakeley was married. Six years later he and his wife had twins  —   a son, Finn, and a daughter, Sydney. Meanwhile, Ms. Graham, her career soaring, thought that marriage and children were not an option. “It wasn’t even a choice,” she said. “My career was my child. My career took all of my energy and all of my nurturing and all of my love, and it was very fulfilling. ” “I had some fantastic relationships, and I do not for a minute regret a single one of them or a single minute of my life,” she said. But the complexities of dating men not comfortable with her increasing fame won out, and she wondered if perhaps she would grow old, with cats, in her “heart home,” Santa Fe, N. M. (She also has an apartment in New York.) In February 2010, Mr. Brakeley, by now separated and working in production for auto shows, discovered that he and Ms. Graham would be in Chicago at the same time. So he called and offered to cook her dinner at the apartment she was staying in while performing with the Lyric Opera. “I knew that his life had sort of been blown apart,” she said, “and he needed a friend. ” She, in turn, invited him to escort her that weekend to the opera’s gala, with instructions to meet her at the stage door. “He showed up with the hair perfectly done, the tuxedo, the long black cashmere coat, the black leather gloves, looking so sharp,” she said. “And I thought, ‘Oh, my God, he’s got it going on. ’” Guiding her with his hand on her back, he instinctively understood whom she wanted to talk to and whom they should avoid. And she had forgotten how well he could move until he twirled her across the floor. The   at which the women reclined on sofas while dangling their pumps from their toes and the men loosened their ties and drank Scotch, reminded them of a champagne ad. But mostly they were intoxicated with each other. “I think that cemented a reconnected time, and it has been that way ever since,” Mr. Brakeley said. “She has always been a bright light and a positive individual, and it’s very easy to fall under that particular spell. ” (“You are scintillating,” he wrote in a note to her afterward.) At four in the morning, he kissed her good night in front of her apartment building, then walked to his hotel across the street. But as the time approached for them to attend a Super Bowl party later that afternoon, Ms. Graham started to worry. “I thought, O. K. this is a big   point  —   because last night was great and do we go forward like we’re dating? Or do we go forward like we’re still just buddies and last night didn’t really have the import that it might have had?” she said. “And I was a little skittish because I thought, you can’t screw it up with somebody who has been your friend for 25 years. You don’t want to rashly go into something that you’re not sure about. But at the same time, how can you be sure at that moment? So we sort of just went forward as if we were pretending we were dating. ” By the end of their stay in Chicago, Mr. Brakeley was mapping out opportunities to meet months in the future. “And I was like, ‘Whoa, hold on, buddy. I’m not sure I’m willing to commit that far out,’” Ms. Graham said. “Because first of all, he was separated for over a year but he wasn’t completely divorced yet, and he had two little kids. And I guess I didn’t know what it would feel like to be   in a bona fide relationship. ” But she also realized that she didn’t want to lose him again, and decided to take the leap. With their mutual passion for music and theater as well as an understanding of the stress that accompanies a major career, they found that their lives blended seamlessly. And on the rare occasion when she acted the diva, he sweetly reminded her that he had worked for Michael Jackson, who was an even bigger star than she was. Two years later, it was Ms. Graham who sought a commitment and Mr. Brakeley who was reluctant to give it. But when it became clear that they were going to be together, with or without marriage, she made peace with their arrangement. “I always wanted to get married sometime, but I never was in the right place at the right time with the right person to do it,” she said. “Once I found him, I thought, this is the right place and the right time and the right person, but he has to want it, too. ” On July 23, 2015, Ms. Graham, who had been touring Australia, met Mr. Brakeley and his twins on Maui. It was her 55th birthday, and at the end of the festivities, he presented her with one last gift: a box holding three diamond bands in white, yellow and rose gold, symbolizing Mr. Brakeley and each of his children. “If you take one of us, you get all three of us,” he told the stunned Ms. Graham as he proposed, with an elated Finn and Sydney, now 10, jumping up and down in the background. “Part of the reason that she is who she is in her career is because of how open and inviting she is,” said Mr. Brakeley, 51. “She has all of these friends in all of these places all over the world. And that is the thing that hasn’t changed since she was in college. Underneath it all she is the same person. She just happens to be the same person with this really famous aspect of herself. And I think it’s wonderful. ” Laughing, Ms. Graham said, “Deep down, I’m just a very, very simple girl who has been thrust into an extraordinary life. ” On Sept. 17, Ms. Graham and Mr. Brakeley were married at Las Campanas Country Club in Santa Fe, the Sangre de Cristo Mountains silhouetted in the distance beneath a harvest moon. Irene Swain, a nondenominational minister, officiated at a ceremony filled with poetry written for the couple by Arnold Adoff and a Native American blessing in honor of the New Mexican landscape (both the bride and groom were born in the state). Ms. Graham’s eyes welled up, she later recalled, as Mr. Brakeley spoke to her generous spirit and beautiful nature, and she compared him to her deceased father, whom she likened to a towering redwood, during their vows. “You are the only man since my father on whom I know I can rely to be for me and take care of me when I need it, and even when I don’t think that I do,” she said. The   Sasha Cooke sang Jake Heggie’s “My True Love Hath My Heart” during the ceremony. The soprano Renée Fleming serenaded the couple with a cover of Etta James’s “At Last” for their first dance. “It took a long time to get here but it happened  —   we got it done,” said Ms. Graham’s mother, Betty Graham Webber. “She waited a long time, but he would be worth waiting for. He’s a great guy. I’m very proud of Suzy. ” The couple honeymooned briefly in Santa Fe before heading to performances in Boston, after which Ms. Graham headed alone to Toledo, Spain. These were their first journeys in a married life that will find them reconnecting as a family in New York or Burbank, Calif. where Mr. Brakeley lives with his twins (who, to the delight of their new stepmother, are members of the Los Angeles Children’s Chorus and appeared in the Los Angeles Opera production of Puccini’s “La Bohème” last spring). Marrying Mr. Brakeley 33 years after their first encounter “was a euphoria beyond anything I’ve ever felt on the stage,” Ms. Graham said after the wedding. “It beats the best curtain call I’ve ever taken. ”'"}, "time": 1742564361.0989165}