{"duration": 0.06305146217346191, "input_args": {"text": "'By Rmuse   10:00 am The voter suppression tactic is right out of the GOP [election rigging] playbook to suppress the Black vote in North Carolina.”   *The following is an opinion column by R Muse* \\nSome Americans are likely aware of the psychological term “projecting” that roughly means a person attributes their own faults and actions onto someone else; as an ‘unconscious’ form of transferring guilt for one’s own actions. As soon as the Republican primaries concluded, Donald Trump projected Republicans’ guilt for election rigging, either through vote obstruction or suppression, onto Democrats and his opponent Hillary Clinton. Republicans have been actively suppressing votes since the election of Barack Obama in 2008, and they have only ramped up their ‘ election rigging’ activities over the past eight years; and yet Trump accuses Democrats of election rigging as frequently as most human beings draw breath. \\nYesterday, the North Carolina conference of the National Association for the Advancement of Colored People (NAACP) filed a lawsuit against North Carolina Republicans and demanded they put an immediate stop to the “ coordinated effort to suppress the Black vote in the state .” What the NAACP rightly said was that the voter suppression tactic was “ right out of the GOP [election rigging] playbook to suppress the Black vote in the state. ” \\nThe election rigging amounts to three counties in North Carolina canceling voter registration of thousands of, mostly African American, Democratic residents a week before the presidential election. The lawsuit charged election officials in Beaufort, Moore, and Cumberland counties of denying primarily African American voters’ eligibility to participate in democracy because their voter registration documents mysteriously were “ bounced back as undeliverable. ” \\nMost of the voters whose eligibility to vote was denied and flagged for purging, such as James Edward Arthur Sr. had moved within the same county and were still legally allowed to cast ballots. Many of the purged voters lived at their “ original registration address ” and were victims of a “ simple postal service error. ” \\nMr. Arthur is an African American who lives in a nursing home and has voted in at least the last 14 elections in the same county he was born and raised in without issue. Arthur testified that he, like thousands of other African American Democratic voters, never received any state or county election documents informing him that his eligibility was denied, or that if he didn’t attend an appeal hearing to maintain his right to vote he would be denied the right to participate in democracy. Mr. Arthur said, \\n“ If I knew my right to vote was in jeopardy, I would do whatever I could to protect it. I want and plan to vote in the upcoming election, but I am concerned that since my registration has been canceled I will not be able to cast a ballot or it will not be counted .” \\nIt is what any sane human being would consider “ election rigging ” simply because the tri-county ploy targeted primarily African Americans who typically vote for Democrats. It is also something North Carolina Republicans have been guilty of for the past six years. \\nAccording to the NAACP lawsuit, North Carolina Republicans are in violation of the National Voter Registration Act which “ bans the systemic removal of voters from the rolls in the final 90 days before an election .” Republican election officials State officials defended their “ election rigging ” and said they were justified in “ purging tens-of-thousands ” of mainly African American Democratic voters’ eligibility, the definition of systemic, on an individual basis. \\nHowever, the NAACP also accused Republicans of conducting a coordinated mailing campaign for the sole purpose of challenging the eligibility of thousands of mainly African American voters’ eligibility who did not receive the mailing. One Republican who ran for a local office last year, Shane Hubers, challenged the registration of voters,\\u200athe majority who are them Democrats, \\u200ain Beaufort County. \\nIn one of the other counties charged in the lawsuit, Cumberland County, one “ individual used returned mail to challenge the registrations of 3,951 mostly Democratic voters .” In Moore County, the secretary of the local Republican Party, N. Carol Wheeldon, challenged approximately 400 mainly African American registered voters; likely because they do not vote for Republicans. \\nThe lead attorney for the NAACP’s lawsuit, Penda Hair, said that although she cannot yet prove there is a concerted Republican “ election rigging ” conspiracy; \\n“ We know that in two of the counties, the people who brought the challenges had connections to the local Republican Party. We also know that the pattern of these challenges is very similar across the counties .” Ms. Hair also noted that, “ in Moore County the return address of a right-wing group called the Voter Integrity Project appeared on the mail that was used to challenge voters. This is a very pernicious treatment of voters ,” she said. It is also a deliberate act of “ election rigging ” by Republicans. \\nThe president of the North Carolina NAACP, Reverend Dr. William Barber said, \\n“ We are seeing the worst attempts of voter suppression here in North Carolina that we’ve seen since the days of Jim Crow. The Tar Heel state is ground zero in the intentional, surgical efforts to suppress the voice of voters. These attempts are a direct affront to our Constitution .” \\nThe NAACP lawsuit is demanding the state reinstate all voters challenged since 2012 using this “election rigging ” process back on the rolls immediately. The organization also demands that the state notifies the voters that they have been reinstated as eligible voters, and allow them to cast regular ballots early or on Election Day. They have already put in a request for an emergency hearing this week to decide the case. \\nIt might be the case that the NAACP’s request for a hearing may be granted; especially in light of these new charges arising just days after a federal court ruled that North Carolina Republicans violated the National Voter Registration Act in yet another manner; failing to add tens of thousands of voters to the rolls who registered at a DMV office over the past few years. \\nLast Thursday U.S. District Court Judge Loretta Biggs ordered North Carolina Republicans to permit those tens-of-thousands of voters to cast provisional ballots. It is highly doubtful that North Carolina Republicans will obey the Federal Judge’s orders because they have been the recipients of several court orders over their “election rigging” actions that have had no effect whatsoever or the Republicans would not continue disenfranchising voters. \\nRepublicans have been on a tear to rig elections since the American people first elected Barack Obama as President, and the conservatives on the Supreme Court are ultimately guilty of conspiring with Republicans to suppress, or obstruct, the voting rights of primarily people of color because they don’t support Republicans. To be perfectly clear, it is irrelevant if it is called voter suppression, obstruction, or disenfranchisement; it is a deliberate attempt to rig elections. And it is only Republicans and the Koch brothers’ outfit the American Legislative Exchange Council (ALEC), who are behind each and every attempt in Republican-controlled states to kill democracy by doing what the Republican Party standard bearer Donald Trump is guilty of projecting; rig elections.'"}, "time": 1742628584.050741}