{"duration": 0.19114351272583008, "input_args": {"text": "'Live in New York long enough and you will lose somewhere you love. Good things die here. It’s what keeps the place alive. But every now and then a big one goes, as it did on Friday morning, when the owner of the Carnegie Deli suddenly announced that the Manhattan sandwich place would be shutting down at the end of the year. The famous Jewish restaurant on Seventh Avenue and 55th Street, down the block from Carnegie Hall, has been putting out cardiologically perilous fare since 1937. When it closes its doors on Dec. 31, the city will lose not only an irreplaceably iconic    pastrami sandwich, but also a small piece of itself. News of the restaurant’s demise emerged at 7 a. m. on Friday when, at a meeting in the dining room, the owner, Marian Harper, told about 25   employees that she could no longer bear the stressful challenges of restaurant life. “The restaurant business is one of the hardest jobs in New York City,” Ms. Harper later said in a formal statement issued by her publicist. “At this stage in my life, the early morning to late night days have taken a toll, along with my sleepless nights and grueling hours. ” The shock waves quickly followed. Eater, the culinary website, reported on the closing with a mournful article with the headline: “Pastrami Bombshell. ” Twitter was full of photographs of deli meat and melancholy posts: “How’s a Jew like me supposed to suffer a heart attack at age 37 in this city anymore? !” And “It’s pastrami on cry. ” The restaurant had seen its share of turmoil in the last few years. In April 2015, it was closed for almost 10 months by Consolidated Edison, which was investigating its misappropriation of natural gas, an impropriety that the utility said had gone on for six years and resulted in a backdated bill of more than $40, 000. One year earlier, Ms. Harper and her husband of 22 years, Sandy Levine, went through a contentious divorce. According to her spokeswoman, Ms. Harper, 65, would not go quietly into retirement, but rather planned to devote herself  —   as awful as it sounds  —   to “licensing the iconic Carnegie Deli brand” by selling a line of wholesale products. Though the flagship restaurant would soon go the way of New York institutions such as Elaine’s and CBGB, satellite Carnegies would remain in operation at Madison Square Garden, the Mirage Hotel  Casino in Las Vegas and the Sands Casino Resort in Bethlehem, Pa. the spokeswoman said. The somewhat catty truth about the Carnegie Deli is that it is one of those New York destinations that actual New Yorkers visit once or twice and then frequently decide they have had enough of. Its 64 seats are usually filled with tourists. This was proved true by a quick poll of the people standing in line outside the restaurant on Friday afternoon. When asked where they were from, they provided a long list of locations that were not New York: Arkansas, Louisiana, Arizona, San Francisco, Miami, Dallas, Switzerland. “We came up on a bus trip from Baltimore, and I read the place was shutting down on my iPhone,” said Ruthann Smith, a    retired high school teacher who was enjoying the pastrami with her husband, Dennis, a former financier. “We were trying to figure out where to go for lunch and I said, ‘We better go to the Carnegie Deli while we still have a chance. ’” With its linoleum floors and animal protein odors, the Carnegie Deli was never fine dining, but the seedy lighting and eclectic checkerboard of celebrity photos (from the quarterback Y. A. Tittle to the Fonz, Henry Winkler) gave the place a homey sort of   charm. “I served Denzel Washington and James Brown and Bill Clinton,” said Desmarine Redwood, who has worked there as a waitress for 26 years. “It gave me peace of mind. I loved working at this place. I’m going to miss it. ” Once the deli closes, devotees of the   sandwich will begin their hunt for other options  —   perhaps like the one at Katz’s on the Lower East Side. That, at least, was a possibility for Otis Allen, a credit manager and one of the few New Yorkers having lunch at the Carnegie on Friday. “I’ll miss the place  —   I’ve been coming here for years,” Mr. Allen said. “I haven’t figured out yet where my next place will be. ”'"}, "time": 1742563123.244664}