{"duration": 0.06709909439086914, "input_args": {"text": "'These Jews have such a hateful god, wow. \\nYahweh just punishing bitches left and right. \\nRT : \\nTwo earthquakes, which struck Italy this week, were â\\x80\\x9cretributionâ\\x80\\x9d for the countryâ\\x80\\x99s support of the UNESCO resolution disregarding the Jewish connection to Jerusalem, Israeli Deputy Minister for Regional Cooperation Ayoob Kara said. \\nâ\\x80\\x9cIâ\\x80\\x99m sure that the earthquake happened because of the UNESCO decision,â\\x80\\x9d Kara, a member of the ruling Likud Party, wrote in a memo, Ynetnews Â website reported. \\nIronically, the Israeli politician was on a state visit to the Vatican when the quakes hit central Italy on Wednesday, killing one and injuring 10 people. \\nEarlier the same day, UNESCO (United Nations Educational, Scientific and Cultural Organization), passed a resolution criticizing Israel for its handling of the holy site in Jerusalem â\\x80\\x93 called Temple Mount by Jews, and Haram al-Sharif by Muslims. \\nThe document was adopted after heated debate over its wording, and particularly the Arabic names used in the document. Italy was among the nations voting in favor of the resolution. \\nIsrael blasted UNESCO and its Arab members for trying to undermine Jewish connections to the holy site. \\nKara arrived in the Vatican in a fruitless effort to avert the resolution, but still managed to have a small chat with the leader of the Catholic Church. \\nAccording to Kara, Pope Francis â\\x80\\x9cstrongly disagreedâ\\x80\\x9d with the resolution. \\nâ\\x80\\x9cHe (the Pope) even said publicly that the holy land is connected to the Nation of Israel,â\\x80\\x9d the deputy minister stressed. \\nYeah, he’s not a good Pope. \\nOur model Pope is Urban II, who just wanted to exterminate all non-Whites in the Holy Land, Jew or Moslem. \\nDo the Jews not know that people are paying attention to these types of statements now? \\nIf so, why do they keep making them? If you ever see a Jew covering his door frame with sheeps blood, it should definitely be a cause for concern. \\nEven if this Jew believes Yahweh did the earthquake as revenge, why would he state it publicly? Italy is not a Jew country and presumably does not believe in the magic powers of the Jewish god. \\nSo what is the point of making this statement, which can only serve to make the Jews and their god appear hostile, violent, hateful and evil?'"}, "time": 1742561957.1506786}