{"duration": 0.13167572021484375, "input_args": {"text": "'As a throng of Chinese reporters crowded in front of him, Jeremy Lin briefly cast his eyes toward the distant skyline of Manhattan, the birthplace of Linsanity. It has been four years since Mr. Lin seemed to inspire New Yorkers and Asians around the world with his mystical, mythical string of performances with the New York Knicks. But now, as a member of the Brooklyn Nets, Mr. Lin says he has a different perspective on his fame and his popularity as the first   N. B. A. player of Taiwanese or Chinese descent. “When it first started, I’m not going to lie, it was cool, and then it became a burden,” he said at the Nets’ practice facility in Sunset Park, Brooklyn. “I didn’t really know what I had gotten myself into. One, two, three, four years later, every year I embrace it more. Every year I’m more appreciative, every year I love it more. ” He is 27 now, and it is no longer enough to be just a leader for the Nets on the court. “Chinese people,   Asians, they always have a special place in my heart,” he said. “Coming back here, I want to be able to try to inspire the next generation, reach out in the community. ” A Harvard graduate and a son of Taiwanese immigrants, Mr. Lin became an empowering figure not only for Asians, but also for underdogs,   Knicks fans and New Yorkers mired in the doldrums in February 2012. The team’s leader, Carmelo Anthony, was injured when Mr. Lin was igniting a turnaround. Enter Mr. Lin, a journeyman who had been cut by two teams. Linsanity, in all its glorious euphoria, erupted. And then, several weeks later, Mr. Lin’s run was over, cut short by a   knee injury, combined with the resignation of his coach, Mike D’Antoni. After the season, the Knicks allowed Mr. Lin to depart to the Houston Rockets via free agency. “As soon as he took off that New York uniform, that magic was gone,” said Andrew Kuo, 38, a New   artist and ardent Lin fan. The   artifacts of that time, like the sandwiches once named for him, grew stale. The puns faded from the lexicon. “The Lin memes are done, it’s O. K. it’s extinct now,” Mr. Kuo said. There is, however, the matter of that “Linsanity No. 17” tattoo on his left forearm. Mr. Kuo laughed and said that it might have been dumb. “But it’s nice to look down and remember it all,” he added. Mr. Lin recalled how he wished he had stopped to enjoy that heady time more while it was swirling around him. As for Linsanity, he may have won the trademark, but he has mixed feelings about it he does not intend to revive it. “Not in a way that I’m offended, but it kind of dehumanizes me to refer to me as a phenomenon,” he said. “I’m going to be here, keep playing my game, and whatever you guys want to call it, it’s up to you guys. ” It was typical humility from a man who at the start of his Knicks career in 2012 was sleeping on his brother’s couch. In what seemed a quaint bookend to that time, Mr. Lin and his trainer, Josh Fan, stayed at an Airbnb rental on Tuesday night, just so they could be near the practice facility in Brooklyn. They turned down the Nets’ offer of a hotel room. Mr. Lin, wearing a new hairstyle featuring tight braids atop his head, was officially introduced on a podium along with five other   acquisitions. Yet it is his celebrity that gives the lowly Nets an instant marketing boost while in what is otherwise a rebuilding mode. Since Lin signed his   $36 million contract in early July, the team’s sales department has been contacting Asian groups all over New York to offer ticket packages. Brett Yormark, the chief executive of Brooklyn Sports and Entertainment, said that in response to Mr. Lin’s presence on the team he had scheduled a trip to China to discuss partnership opportunities with travel and packaged good companies. “Our brand is pretty big there, obviously,” he said. As for closer to home? “Obviously, when you think of Sunset Park, that’s an opportunity to ignite a potential fan base,” he said. “Everything is under discussion. ” Mr. Lin’s presence is sure to create ripples along   fault lines, even though his fame transcends that rivalry, uniting fans from California to Australia and to Taiwan, where he holds summer basketball camps. He recently returned from his annual visit. “He’s got a lot of fans there,” said Timothy J. Hwang, the New York bureau chief for Central News Network of Taiwan, who was among two dozen Chinese journalists covering Mr. Lin’s news conference. (Mr. Lin gave his first interview in Mandarin.) “He attracts a lot of attention, especially for the younger generation,” Mr. Hwang said. “Basketball is the most popular sport in Taiwan. ” By moving back to the city with the largest Chinese population outside of Asia  —   573, 388 residents according to the latest census figures, from 2014  —   Mr. Lin will certainly gain a broader, brighter spotlight. “I think he belongs in New York,” said Jimmy Ching, 51, the proprietor of Pacificana, a sprawling dim sum palace in Sunset Park. Last year, Mr. Ching tuned all of the restaurant’s 10 television screens to Knicks games when Mr. Lin played against them as a member of the Charlotte Hornets. “When he was at the Knicks, it was this momentum and the people and the whole area were rooting for him,” Mr. Ching added. “You see it in the Chinese communities. You see it in Brooklyn Chinese community, you see it in Manhattan Chinese community, you see it in the Flushing community. For that to happen, it was something. We pulled together. ” Mr. Lin’s most ardent supporters see a different player now than the relentless, sometimes reckless, guard who once tried to prove his worth. “The definition of Linsanity may have evolved,” said K. P. Chan, 68, a retired banker who lives in Bayside, Queens. “That was just sheer madness, that was epiphany. All the stars were aligned and all of a sudden, he had this breakout out of nowhere. But he has become a much more   more complete player. ” Last year, Mr. Chan connected with two California fans via an internet forum to produce a YouTube video that questioned whether N. B. A. referees were neglecting to call flagrant fouls committed against Mr. Lin. As the only   in the N. B. A. Mr. Lin represents a new “model minority,” said Peter Kwong, a professor of urban affairs at Hunter College. “On the one hand, he does everything Asians are supposed to do  —   he went to Harvard  —   and on the other hand, he’s doing things Asians are not supposed to do: sports,” said Professor Kwong, who specializes in Chinese immigration. “That is the charm of him. ” But the notion of a lack of athleticism among the Chinese seems to be an outdated stereotype, considering the popularity of basketball in Asia and the deep tradition of Asian basketball leagues across this country. “People really don’t understand how some Asian kids could be good,” said Ryan Chin, 15, a mentor in a youth basketball league. “I just want to thank Jeremy Lin. ”'"}, "time": 1742562188.5465648}