{"duration": 0.04359579086303711, "input_args": {"text": "'An alarming 66 per cent of Germans are afraid they will become the victim of a terrorist attack, with 10 per cent perceiving an “acute threat” to their safety. [The fear is even more widespread among women, the study published by German legal expenses insurance group ROLAND found.  Of the female respondents, 74 per cent said they sometimes feel unsafe in crowded places, and nine per cent felt permanently threatened and scared. The authors state: “A large part of the population doesn’t feel safe anymore when visiting crowded places. The fear of becoming the victim of a terrorist attack with a high number of casualties is considerable. “A total of 45 per cent of respondents feel uneasy when visiting crowded locations like stations, festivals or even in the downtowns. “Three percent of the population feel permanently unsafe when visiting a public place along with many other people. ” The poll, of 1, 458 citizens over    was conducted in October, before the Islamic State truck attack on the Berlin Christmas market in which Tunisia migrant murdered 12 people. The truck rampage was Germany’s worst terror atrocity since the 1980s, but followed 21 months of Islamist suicide bombings, shootings, and axe attacks. The terrorist killers responsible have included numerous “refugees” from Syria, Iraq, Afghanistan, and Algeria, as well as several German citizens of Turkish descent indoctrinated in radical Islam. Around seven of the plots and attacks are thought to have been linked to Islamic State. Germany appears to have become a target of Islamist aggression since the beginning of the migrant crisis in the summer of 2015, with some blaming Chancellor Angela Merkel’s open borders mass migration policy. Several serious plots have been foiled by security forces. In February last year, three Algerians said to have “lived in refugee shelters” were arrested for plotting to attack Berlin. The men had links to Islamic State, and the Berlin prosecutor’s office said they were aware of a “concrete” plan to target the German capital.'"}, "time": 1742562127.0740962}