{"duration": 0.12411165237426758, "input_args": {"text": "'BEIJING  —   Secretary of State Rex W. Tillerson signaled on Friday that the Trump administration was prepared to scrap nearly a decade of United States policy toward North Korea in favor of a more aggressive effort to eliminate the country’s nuclear weapons program. Whether that means   action, which he warned was “on the table,” will depend a great deal on how China responds. North Korea relies on Chinese trade and aid to keep its economy afloat, and China has long been unwilling to withdraw that support. Up to 40 percent of the North’s foreign currency  —   essential for buying goods abroad  —   comes from a network of about 600 Chinese companies, according to a recent study by Sayari Analytics, a Washington financial intelligence firm. Mr. Tillerson went to China on Saturday, a day after saying in Seoul, South Korea, that the United States would not negotiate with North Korea on freezing its nuclear and missile programs. His interactions with his hosts in Beijing, and whether he takes a hard line with China over its support for North Korea, will be closely watched  —   as will be China’s response. A sign of the administration’s stance came on Friday as President Trump criticized both North Korea and the Chinese government. “North Korea is behaving very badly,” he said on Twitter. “They have been ‘playing’ the United States for years. China has done little to help!” The Chinese leadership is likely to bristle at such criticism, but it may be reviewing its options, given the collision course that North Korea and the United States seem to be on. Last month, Beijing showed a new willingness to punish its longtime ally when it suspended imports of North Korean coal, saying it had reached the annual limit allowed under United Nations sanctions. Customs figures later showed that China had in fact imported only about 30 percent of the quota for 2017. Yang Xiyu, a veteran Chinese diplomat involved with North Korea, said Mr. Tillerson may be able to persuade Chinese leaders to do more when he meets with them in Beijing this weekend, particularly against Chinese companies that do business with the North. Mr. Yang cited as a potential model the case that United States officials built last year against a Chinese executive accused of selling North Korea a chemical that can be used in   centrifuges. While Beijing was not happy about the case, it eventually accepted it. “It wasn’t easy, but it was the right way to push the issue to a solution,” he said. When the United States filed criminal charges against the businesswoman, Ma Xiaohong, the owner of the Dandong Hongxiang Industrial Development Company, other Chinese companies conducting similar transactions were apparently left untouched. But Mr. Yang, who was a top negotiator for China during   talks with North Korea from 2003 to 2009, suggested that those companies may now be vulnerable. If the United States continues to present evidence of illegal activities that contravene China’s responsibilities under United Nations sanctions, “there is a great deal of room for cooperation,” he said. He noted that China had published five executive orders, totaling more than 900 pages, listing items banned from export to North Korea. “Such activities violate China’s adherence to those orders,” he said. Mr. Yang added: “The United States should say, ‘Let’s extend our cooperation to implementation of the United Nations resolutions on sanctions.’ They should say, ‘Starting with the Hongxiang case, let’s move forward. ’” In Beijing, Mr. Tillerson met with China’s top foreign policy official, Yang Jiechi, and the foreign minister, Wang Yi, on Saturday. He will see President Xi Jinping on Sunday. “We have committed ourselves to do everything we can to prevent a conflict from breaking out,” Mr Tillerson said at a press conference after meeting Mr. Wang. The secretary said China and the United States “will work together” to see if they could make North Korea take “a course correction and move away from nuclear weapons. ” Mr. Tillerson declined to specify the “number of steps” that would be taken to achieve that goal. Over the past   the Chinese government has been unwilling to cripple the North Korean economy, fearing a refugee crisis or a destabilizing conflict on its border. North Korea imports virtually all of its oil from China, and cutting off the spigot could severely undermine the North Korean economy. Doing so, however, would almost certainly cause chaos in North Korea, something China fears. Round after round of economic sanctions have failed to persuade North Korea’s leaders to abandon their nuclear ambitions. China has long justified its support for North Korea on humanitarian grounds, and rejected accusations that it has been unwilling to get tough on Pyongyang. But with North Korea closing in on its goal of an intercontinental ballistic missile capable of delivering a nuclear payload to the United States, and the Trump administration deploying a missile defense system to South Korea that China considers a threat to its security, the Chinese leadership’s calculus may be shifting. “It is not a foregone conclusion that China’s leaders will shelter North Korea,” Anthony Ruggiero, a former United States Treasury official involved in sanctions enforcement against Pyongyang, told a congressional panel last month. Mr. Ruggiero said the United States would be likeliest to achieve Chinese cooperation from a position of strength. In 2013, he noted, when the Treasury blacklisted North Korea’s primary foreign exchange bank for contributing to the proliferation of nuclear materials, the Bank of China, one of China’s major commercial banks, immediately closed its account with the North Korean outfit. Now, no major Chinese banks deal with North Korea for fear of being penalized by the United States, though smaller ones do, along with front companies operating along the North Korean border with few links to the United States financial system, according to American sanctions experts. “This is a good example of China acting to cut off North Korea’s activities inside China when those actions threaten China’s economic interests,” Mr. Ruggierio said of the Bank of China’s severance of its North Korea connections. A more recent episode that could serve as a model came last week, when the United States Department of Commerce fined ZTE, one of China’s biggest technology companies, $1. 19 billion for breaking sanctions and selling electronics to Iran and North Korea. “This is what the U. S. should be doing, but finding it out ain’t easy,” said Stephan Haggard, a visiting fellow at the Peterson Institute for International Economics, which is based in Washington. “I think that Commerce pretty much had a gun to ZTE’s head. ” Officials in the Trump administration have discussed putting pressure on Chinese banks through “secondary sanctions,” which would make it hard for any bank that did business with the North to also deal in American dollars. That technique worked against Iran, helping to force it to the negotiating table over its own nuclear program. But such measures are likely to have much less impact in North Korea, which is already isolated, than they did in Iran, a major trading nation, sanctions experts said. “North Korea has one of the smallest international trade profiles on earth,” said Joseph M. DeThomas, a former American ambassador who served as a State Department adviser on Iran and North Korea sanctions. “North Korea often has to   the entire financial system to move money. They do things the   way: sending guys on airplanes with suitcases full of money. ” In an opinion article this week in The New York Times, a former United States deputy secretary of state, Antony J. Blinken, said the Obama administration had quietly pressed countries to eject North Korean workers whose remittances help fund the country’s military. He did not say how successful that effort had been. Tens of thousands of such workers are employed in China’s northeastern cities like Dandong and Hunchun, along the North Korean border. But Marcus Noland, of the Peterson Institute for International Economics, said he believed the organized export of labor earned the North Korean government less than has often been reported  —   hundreds of millions of dollars per year, probably less than half a billion, he said. “The next time you hear the claim of $2 billion annual earnings from the organized export of labor, remember not to believe everything you hear,” he said. Far more has been contributed in foreign currency by Chinese companies doing trade across the border, said Jessica Knight, director of analysis at Sayari Analytics. “Customs data indicates more than $8 billion in   trade between China and North Korea since 2013, much of it in commodities like coal and steel,” she said. Whether any sanctions at all will deter the North from its nuclear pursuits is far from clear. The former United States defense secretary William J. Perry, who dealt with the North Korean problem during the Clinton administration, said on Friday in Beijing that he doubted they would. “We have sanctioned them a hundred times, and it didn’t stop developing nuclear weapons,” he said. “They seem to be prepared to suffer economic deprivation for the people so they can achieve the preservation of the regime, which they think that nuclear weapons is going to do for them. ”'"}, "time": 1742562051.5228276}