{"duration": 0.1300973892211914, "input_args": {"text": "'WASHINGTON  —   As congressional Republicans on Friday discussed quickly moving ahead with plans for a southern border wall using money included in this year’s spending bills,   Donald J. Trump insisted that Mexico would ultimately pay for its construction. “We’re going to get reimbursed,” Mr. Trump said during a brief telephone interview. “But I don’t want to wait that long. But you start, and then you get reimbursed. ” The congressional Republicans’ talk led to speculation that Mr. Trump was retreating on his campaign promise to make Mexico pay for the wall. Mr. Trump insisted he is not. Republicans have balked at increases in domestic spending during the Obama administration and are unlikely to enthusiastically rally behind a proposal that could require billions of taxpayer dollars. Building a wall to keep out unauthorized immigrants could also face intense opposition from a bipartisan coalition in Congress that argues that a vast barrier along the border would be ineffective in stopping people who are determined to enter the country illegally and would represent a symbolic affront to the idea that the United States is a welcoming country that embraces immigration. In the interview, Mr. Trump vowed that Mexico would ultimately reimburse the United States. He said that payment would most likely emerge from his efforts to renegotiate the North American Free Trade Agreement with the Mexican government. “It’s going to be part of everything,” Mr. Trump said of the cost of building the wall. “We are going to be making a much better deal. It’s a deal that never should have been signed. ” But he said that the trade negotiations would take time and that he supported the idea of using taxpayer money to begin construction of the border wall “in order to speed up the process. ” The full cost of a wall as described by Mr. Trump could be enormous. Attaching such a charged issue to annual, mandatory government funding measures could instigate a risky political fight. Those who want to block money for the wall by holding up the bills could find themselves accused of shutting down the government. The Government Accountability Office has estimated it could cost $6. 5 million per mile to build a   fence, with an additional $4. 2 million per mile for roads and more fencing, according to congressional officials. Those estimates do not include maintenance of the fence along the nearly   border with Mexico. “The chairman and the committee have no interest in threatening a shutdown,” said Jennifer Hing, a spokeswoman for the House Appropriations Committee, referring to Representative Rodney Frelinghuysen, Republican of New Jersey and the committee’s new chairman. If funding for the border wall is included in spending bills this spring, it would provide money to begin construction on a barrier that was authorized by legislation passed in 2006, but was never completed. Ms. Hing said neither Mr. Trump’s transition team nor Republican leaders had asked for funding to build a wall on the Mexican border. “If and when a proposal is received, we will take a careful look at it,” she said in an email on Friday. At a rally in August in Phoenix, hours after meeting with President Enrique Peña Nieto of Mexico, Mr. Trump vowed that America’s southern neighbor would bear the financial burden of securing the border. “Mexico will pay for the wall, believe me  —   100 percent  —   they don’t know it yet, but they will pay for the wall,” Mr. Trump said. “They’re great people, and great leaders, but they will pay for the wall. ” In a Twitter post on Friday, Mr. Trump mocked news reports about the possible taxpayer funding of the border barrier, suggesting that Mexico would be forced to reimburse the American government for any costs incurred in building the wall. “The dishonest media does not report that any money spent on building the Great Wall (for sake of speed) will be paid back by Mexico later!” he wrote early Friday. Vicente Fox, who was Mexico’s president from 2000 until 2006, responded to Mr. Trump’s Twitter message with a barrage of outraged posts that became an internet talking point on their own. In one of them, he made reference to the intelligence agency reports about Russian meddling in the 2016 election. “Sr Trump, the intelligence report is devastating,” Mr. Fox said. “Losing election by more than 3M votes and in addition this. Are you a legitimate president?” Representative Chris Collins, Republican of New York and one of Mr. Trump’s liaisons on Capitol Hill, said on Friday morning that members of his party in Congress were eager to get moving on construction of a border wall, even if that meant using taxpayer money to finance it. In an appearance on the CNN program “New Day,” Mr. Collins said it should come as no surprise to anyone that the United States government would have to pay for building the wall. “Of course, we have to pay the bills,” he said. “We’re building the wall. ” As a candidate, Mr. Trump’s promise to build a wall to keep out immigrants from Mexico was one of his most powerful speaking points. He often used it at rallies to whip up his supporters and bolster his argument that illegal immigration was damaging the United States. His repeated pledge to make Mexico pay was in part a way to rebut one of the central criticisms of a border wall  —   that its cost could run into the many billions of dollars. Democrats slammed the reports that Mr. Trump would ask Congress to fund the project. “If President Trump asks Congress to approve taxpayer dollars to build a wall, which he has always said would not be paid for by U. S. taxpayers, we will carefully review the request to determine if these taxpayer dollars would be better spent on building hospitals to care for our veterans, roads and bridges to help taxpayers get to work, and for N. I. H. to find cures for cancer,” Senator Patrick J. Leahy of Vermont, the top Democrat on the Appropriations Committee, said in a statement. Representative Nancy Pelosi of California, the Democratic leader, said she thought even Republicans might balk at spending what she said could be $14 billion on a wall. “I think that’s a heavy sell,” she said. “I think that’s a tough sell for them. ”'"}, "time": 1742561916.5324721}