{"duration": 0.10283923149108887, "input_args": {"text": "'In Britain, as in the U. S. when an Islamic terrorist is said to be, “known to law enforcement,” the translation is: “He is being actively ignored by law enforcement. ”[After the latest terrorist attack in Britain  —   at least as of this writing  —   Prime Minister Theresa May bravely announced, “Enough is enough!”  What is the point of these macho proclamations after every terrorist attack? Nothing will be done to stop the next attack. Political correctness prohibits us from doing anything that might stop it. Poland doesn’t admit Muslims: It has no terrorism. Japan doesn’t admit Muslims: It has no terrorism. The United Kingdom and the United States used to have very few Muslims: They used to have almost no terrorism. (One notable exception was chosen as the National Freedom Hero in this year’s Puerto Rican parade in New York!) Notwithstanding the lovely Muslim shopkeeper who wouldn’t hurt a fly, everyone knows that with every tranche of   Muslims we bring in, we’re also getting some number of   killers. Former Prime Minister Tony Blair dumped millions of Third World Muslims on Britain to force “multiculturalism” on the country. Now Britons are living with the result. Since the   attack, every U. S. president has done the same. President Bush admitted Muslim immigrants at a faster pace after   than we had been doing before  . Whatever the   attackers intended to accomplish, I bet they didn’t expect that. Now we can’t get rid of them. Under the rules of political correctness, Western countries are prohibited from even pausing our breakneck importation of Muslims, much less sending the recent arrivals home. In defense of the poor saps responding to every terrorist attack with flowers, candles and hashtags, these are people who have no ability to do anything else. Western leaders are in full possession of the tools to end Islamic terrorism in their own countries, just as their forebears once ended Nazi Stormtroopers. Unable to summon the backbone to defeat the current enemy, the West is stuck constantly reliving that glorious time when they whipped the Nazis. In almost every Western country  —   except the one with an increasingly beleaguered First Amendment  —   it’s against the law to deny the Holocaust. Are we really worried about a resurgence of Nazism? Isn’t Islamic terrorism a little higher on our “immediate problems” list? How about making it illegal to make statements in support of ISIS,   female genital mutilation, Sharia law or any act of terrorism? The country with a First Amendment can’t do that  —   the most that amendment allows us to do is ban conservative speakers from every college campus in the nation. But if our elected representatives really cared about stopping the next terrorist attack, instead of merely “watching” those on the “watch” list, they’d deport them. To this day, we have a whole office at the Department of Justice dedicated to finding and deporting Nazis even without proof they personally committed crimes against Jews. But we can’t manage to deport hearty young Muslims who post love notes to ISIS on their Facebook pages. If the Clinton administration had merely enforced laws on the books against an Afghani immigrant, Mir Seddique Mateen, and excluded him based on his   list of terrorist affiliations, his son Omar wouldn’t have been around to slaughter 49 people at an Orlando nightclub last year. If Secretary of State John Kerry, Homeland Security Secretary Jeh Johnson or anyone else in our vaunted immigration vetting system had done his job, Pakistani Tashfeen Malik never would have been admitted to this country to commit mass murder in San Bernardino a year after she arrived. Before being warmly welcomed by the U. S. Malik’s social media posts were bristling with hatred of America and enthusiasm for jihad. We’re already paying a battery of FBI agents to follow every Muslim refugee around the country. When they find out that one of them lists his hobby as “jihad,” we need them to stop watching and start deporting. Paul Ryan, Mitch McConnell, the rest of the useless GOP  —   and obviously every Democrat  —   have the blood of the next terrorist attack on their hands if they don’t make crystal clear that admiring remarks about Islamic terrorism is a deportable act. But they won’t do it. That’s “not who we are,” as Ryan famously said. True, most Muslims are peaceful. Guess what? Most Nazis were peaceful! We didn’t knock ourselves out to admit as many of them as we could, screening out only the Nazis convicted of mass murder. Before we were even formally involved in World War II, the FBI was all over the German American Bund. No one worried about upsetting our German neighbors. (Perhaps because they knew these were Germans and wouldn’t start bombing things and shooting people.) But today, our official position is: Let’s choose love so as not to scare our Muslim neighbors. Isn’t that precisely what we want to do? Facing an immobile government, two British men  —   by which I mean British men  —   were sentenced to PRISON for putting bacon on a mosque in Bristol last year. One died in prison just after Christmas, an ancient religious holiday recently replaced by Ramadan. If we can’t look askance at Muslims without committing a hate crime, can’t we at least stop admitting ever more “refugees,” some percentage of whom are going to be terrorists and 100 percent of whom will consume massive amounts of government resources? No, that’s “not who we are. ” Until any Western leader is willing to reduce the number of Muslims in our midst, could they spare us the big talk? “We surrender” would at least have the virtue of honesty.'"}, "time": 1742561882.7747378}