{"duration": 0.04974865913391113, "input_args": {"text": "'A recent Quinnipiac poll reveals that only 21 percent of American voters support the Republican healthcare plan, a slight raise from 17 percent in March. [Overall, 56 percent of U. S. voters oppose the American Health Care Act (AHCA). Nearly   of white, Republican college graduates support President Donald Trump’s actions on health care.    percent of voters believe that health insurance costs will increase, 11 percent of voters believe that costs will decrease, and 37 percent of voters believe that health premiums will remain the same. Americans also approve,   percent, of the current Obamacare statute that prevents health insurers from raising health premiums for patients with   conditions. Congressman Tom MacArthur ( ) who was heavily involved in drafting the AHCA, told Breitbart News that the new healthcare law also protects Americans with   conditions. MacArthur explained: The other side has spent too much time speaking to people’s emotions and misstating the facts.   For example, with   conditions the bill could not be more explicit that insurers cannot discriminate, they can’t deny coverage, they can’t deny renewals, they can’t health rate someone who’s sick in the middle of being insured. If you get sick, your health rates don’t skyrocket. What it does say is that if you don’t maintain coverage for more than 63 days, you will pay an extra premium. However, states can request a waiver to look at those people, but they have to create a risk pool to ensure that the neediest amongst are not left behind. It balances to make sure people don’t skip out on buying health insurance when they get sick. That’s not fair to the rest of the American people. Voters believe,   percent, including   percent of Republicans, that it is a “bad idea” to give states the ability to waive certain Obamacare regulations that might reduce the cost of premiums. The question that begins, “Do you think that giving states the ability to decide whether or not to allow health insurance companies to raise insurance rates for Americans with   conditions?” however, might influence the voters’ answers.   percent of Americans believe that it is “very important” or “somewhat important” that all Americans can afford health care. The opposition to the American Health Care Act may surprise voters, although the sample for the poll favors Democrats and independents: Registered Voters Party Identification: The 11 percent gap between Republicans compared to either Democrats or independents might skew the polling data towards those who might want to retain, rather than reform, Obamacare. Tim Malloy, the poll’s assistant director, said in a press release, “Republicans gave up on their first attempt to repeal and replace Obamacare when a March 23 Quinnipiac University poll showed 17 percent of American voters supported their bill. ” “The second attempt wins the support of 21 percent of voters,” Malloy added. “The grim diagnosis from voters: Health care will cost more and deliver less. ” Read the poll results here.'"}, "time": 1742628369.9411244}