{"duration": 0.06554174423217773, "input_args": {"text": "'Home / Badge Abuse / Breaking: Emergency Call to Action at Standing Rock as Police Violently Attack Prayer Ceremony Breaking: Emergency Call to Action at Standing Rock as Police Violently Attack Prayer Ceremony Jay Syrmopoulos November 2, 2016 11 Comments \\nCannon Ball, ND – Law enforcement responded violently to water protectors attempting build a wooden footbridge across a creek linking the main Native encampment and the Dakota Access Pipeline construction area for a prayer ceremony. The police responded with a vicious assault on the peaceful water protectors. Breaking: hundreds of #NoDAPL water protectors attempting to cross foot bridges built over Cannonball river to reach DAPL construction area \\nThe Guardian reports : \\nThe US army corps of engineers has ordered North Dakota police to arrest Native American protesters and destroy a bridge that activists built over a creek at the center of the increasingly tense Dakota Access pipeline demonstrations. \\nThe Morton County sheriff’s office announced on Wednesday that police were in a “standoff with protesters on the banks of the Cantapeta Creek” while activists said they were engaged in a peaceful water ceremony. \\nThe situation raised concerns that there could be more mass arrests and violent clashes with police. \\nThe tense situation erupted into state sponsored violence as law enforcement began spraying water protectors attempting to cross the creek with pepper spray, with reports of a water protector being shot in the back by a non-lethal round. \\nThe situation on the ground is tense and many there feel that this conflict is coming to a head with these latest police actions. \\nThe U.S. Army Corps of Engineers has given the county orders to remove the makeshift bridge and arrest any protesters who cross the Cantapeta Creek for criminal trespass, according to Morton County spokeswoman Donnell Preskey. \\n“Protesters involved in this activity are violating numerous federal and state laws,” Pesky said. \\nAccording to a report by Forum News Service : \\nThe Corps owns a sliver of land on the north side of the creek, Preskey said. Citing free speech rights, the Corps has been allowing hundreds and sometimes thousands of Native Americans and other pipeline protesters to camp on Corps land south of the creek along the nearby Cannonball River since Aug. 10 Variety of officers have been regularly spraying water protectors with pepper spray; more await in boats nearby. pic.twitter.com/y5ep8PczqK \\n— Unicorn Riot (@UR_Ninja) November 2, 2016 \\nThe water protectors were attempting to build a bridge to gain access to a pipeline construction area near Cannonball Ranch. Access to that area was cut off last week, after the militarized police crackdown on the “Treaty Camp” that saw more than 140 water arrested. Barrier of logs and rope has been constructed, placed the water by #NoDAPL water protectors. More officers arriving, lining up on the shore. pic.twitter.com/LY4TbioL6z \\n— Unicorn Riot (@UR_Ninja) November 2, 2016 \\nWe will keep you updated to this intense breaking situation. Please share this story to get the word out about what is happening on the ground at Standing Rock! Share Google + AlPennG \\nTIME WE THE PEOPLE TAKE UP ARMS AND START SHOOTING BACK!! TIME THESE CRIMINAL COPS BE TREATED LIKE WHAT THEY ARE TERRORISTS PERIOD!!!! SORRY BUT THAT SEEMS TO BE THE ONLY THING OUR GOVERNMENT UNDERSTANDS https://uploads.disquscdn.com/images/8f2d1d284997f291ece8ef19beb5ed9363cbd1115c9edc352271f40a95ccc3aa.jpg Ian Purcell \\nGovernment is treason against the Great Spirit of GOD. Razedbywolvs \\nThe Government does regulate the corporations. This is what you wanted. Phil Freeman \\nPower is never conceded willingly. john smith \\nthe last time i heard the drums like that they were used a psychological warfare in ukraine to get people to fight while snipers shot both sides… Phil Freeman'"}, "time": 1742562252.4074173}