{"duration": 0.037305355072021484, "input_args": {"text": "'Islamic State terrorists are plotting “mass casualty” chemical attacks in the UK, the government minister responsible for Britain’s national security has warned. [Ben Wallace, the minister of state for security, said that while no specific chemical plot has been identified, the terror group had the ambition and means to carry out such attacks.  Speaking to The Sunday Times, he said: “The ambition of IS [Islamic State] or Daesh is definitely   attacks. They want to harm as many people as possible and terrorise as many people as possible. “They have no moral objection to using chemical weapons against populations, and if they could, they would in this country. The casualty figures that could be involved would be everybody’s worst fear. “We have certainly seen reports of them using it in Syria and Iraq [and] we have certainly seen aspirations for it in Europe. ” As proof of Islamic State’s chemical attack ambitions, Wallace pointed to the arrest in February of an Islamic State cell in Morocco: “Moroccan authorities dismantled a cell involving chemical weapons. “They recovered toxic chemical and biological substances and a large stock of fertiliser. The substances found could have been used to produce homemade explosives and could have been transformed into a deadly toxin. ” Security sources have told The Sunday Times that Islamic State has used sulphur mustard gas in Syria. Within the group are many former members of Saddam Hussein’s army, including from his weapons programme. With such expertise, British intelligence believes Islamic State is able to produce sulphur mustard gas itself, has access to Iraqi and Libyan storage sites of chemical weapons, and has already experimented with biological weapons. Mr. Wallace also warned that as Islamic State was driven out of its strongholds in the Middle East, returning jihadists would pose a growing threat to Britain. “The big concern is if Mosul collapses and all the other bases of Isis collapse. We know there are a significant number of [Britons] fighting for IS in Syria. They will probably want to come home,” he said. “There will also be those people who wanted to go out there but no longer can get there. Their frustration may boil over. ” About 800 Britons went to fight in Syria and just under half have returned. Around 100 have been killed. In 2015, a  further 150 were prevented from travelling to the war zone.  Wallace said the figure for 2016 would be “very similar. ”'"}, "time": 1742562224.8908794}