{"duration": 0.10841083526611328, "input_args": {"text": "'\\nPosted by Elliot Bougis | Nov 18, 2016 | National Security Trump/Pence 2016: Lawful Good vs. Chaotic Evil \\nI’m a nerd but please bear with me: \\nYesterday I asked some friends online about an economic theory that some of them are interested in and one friend, who does not support this theory, made a joke about “getting the Marxists out of the way first.” A little later a friend who does support the theory replied with irritation that it must be a joke to think Marxists are actually in power in this country. \\nI won’t bore you with the rest of the discussion, but imagine my surprise when I saw an article this morning about–wait for it–powerful Marxists in America! \\nAs Michael Volpe reports at The Daily Caller: \\nA Marxist, a Venezuelan diplomat and an illegal alien headlined a meeting of organizers of the Trump resistance as they announced their plan to shut down Chicago on Saturday and Washington, D.C. on Inauguration Day. Chicago ANSWER was one of the radical leftist groups that helped to organize anti-Trump protests when his campaign tried to hold a rally in March ; that rally was canceled after protesters clashed with attendees. As The DC reported last week , the group is responsible for organizing rallies in Chicago, New York, Washington, D.C., San Francisco and Albuquerque. Since holding those rallies, the group has announced “mass marches” on Inauguration Day in Washington and another one in Chicago on Saturday; the group hopes to “shut the streets down” at both rallies. In other words, if they can’t win an election legally, they’ll try to reverse it with violence and “birddogging” chaos. Before we go any further down this sad road, I want you to keep two things in mind. First, this is what Marxism always does. When it fails one group of people, it oozes away like a red version of The Blob to consume some other poor, unsuspecting populace with its cultural and economic acids. Now that Marxism has left Venezuela devastated and poor, the swarm of Marxist fire ants are trying to do the same here. The Socialist Blob: Coming Soon To A Community Center Near You! Second, like a lot of critics of Trump, these Marxist ants don’t listen to his positive message and policy proposals. Instead, like a swarm of worker ants following their queen, the mainstream media, they fixate on the “racist” or “sexist” or “mean” things Trump reportedly said. As I wrote yesterday, Trump hired Steve Bannon for many reasons, but one reason in particular is because they both care about economic justice, middle-class prosperity, and a strong national labor force. So remember: 1) these ants are making trouble for Trump because they smell fresh meat after leaving rotten meat in other places and 2) they are fighting a presidency that will actually help the people they say they care about. Now back to Volpe’s report: On Nov. 15, the group held a meeting to plot its next move in its ongoing resistance of the Trump in a space normally operated by the Mexican Solidarity Network, a less well-known group in the mold of La Raza. CHICAGO ANSWER organizers, Stephanie and Mika, co-chaired the evening and Mika said he was also an organizer with the Party for Socialist and Liberation, a radical Marxist group and a frequent partner of ANSWER. Mika fired up the crowd. “What do want?” he yelled at the crowd. “Justice,” the crowd roared back. Same as Donald Trump! Law and order! Drain the swamp! “When do we want it,” he screamed again. “Now,” the crowd roared even louder. “People can and must be organized in a deepening resistance,” Stephanie said. “As united as possible, as militant as possible.” She also said she was willing to “work with anyone to resist this administration.” Because these ants have no ideas or skills to contribute to society, they prefer to tear anyone who is trying to help in concrete ways–hence they hate a celebrated DOER like Donald Trump. Jesús Rodríguez-Espinoza is the Counsel General for the Venezuelan consulate in Chicago and while the rest of the speakers accused Trump of the normal litany of grievances — that he’s a racist, homophobe, misogynist and charlatan — Rodriguez said his diplomatic position forbade him from weighing in on Trump. “Before I was the Counsel General in Chicago, I was a regular citizen in Venezuela just like you, in 2002, was moved in my basement because of the attack against Hugo Chavez. Because of that I started getting involved in politics. Rodriguez-Espinoza said he became a supporter of Chavez after that. Just goes to show: never trust a Jesus that isn’t in the Bible. Rodriquez-Espinoza also claimed the current economic and humanitarian crisis in Venezuela is over-blown. “All the humanitarian crisis that you hear in the media most of that is an exaggeration. The only crisis we face is destabilization in Venezuelan oil. I’m not saying everything is perfect; I’m just saying it’s overmagnified because it’s in the interest of the most powerful countries in the world to get rid of the progressive government in Venezuela.” According to a June Guardian story , Venezuela has an economic crisis where Gross Domestic Product is contracting by 8 percent, unemployment was at 17 percent, and the inflation rate was at 482 percent. As always, facts are inconvenient things at times. Plus, if oil is Venezuela’s main (only??) economic problem, then people like Rodriguez-Espinoza should try to work with Trump as a successful business developer, dealmaker, and, as of this Tuesday, the President-elect over the largest oil discovery in America of all time (20 BILLION barrels in the Permian Basin in southwest Texas). But because he is a short-sighted ant, Roqriguez-Espinoza, and all Marxist ants, to be honest, only know how to swarm and scurry and bite so they can feel “progressive.” Far be it from them to take the humble, slow route of working, developing, building, and planning like Trump and most of his supporters do on a daily basis. Share this article to inform and encourage your family and friends! '"}, "time": 1742561687.9336298}