{"duration": 0.0402069091796875, "input_args": {"text": "'Princeton University suspended the season of its men’s swimming and diving team after the discovery of material on its electronic mailing list that was “vulgar and offensive as well as misogynistic and racist,” the university said Thursday. A final decision whether to cancel the season will be made in the next few days, John D. Cramer, a university spokesman, said in an interview. The suspension came after an anonymous complaint made this week alerted officials to “several materials” that were offensive, including in electronic correspondence, the university said in a statement. Mr. Cramer would not discuss specifics of the other materials, including their content or when they were created, but confirmed that the comments were made about members of the women’s swimming and diving team. The suspension was the third of an Ivy League team since the start of November. Last month, Columbia and Harvard each suspended the season of a team after allegations of lewd behavior surfaced. Harvard canceled the rest of the season for its men’s soccer team after officials uncovered what they described as a widespread practice of players rating the school’s female players in sexually explicit terms. The Columbia wrestling team’s season was suspended while officials said they were investigating text messages sent by players that included the frequent use of racist, misogynistic and homophobic terms. At Princeton, the swimming and diving team, which has 38 members, was scheduled to compete on Jan. 7 against Navy and on Feb. 5 against Harvard and Yale. The Ivy League Championships will be Feb.  . “The behavior that we have learned about is simply unacceptable,” Mollie Marcoux Samaan, Princeton’s director of athletics, said in a statement. “It is antithetical to the values of our athletic program and of the university and will not be tolerated. ” The team was notified about the suspension on Thursday afternoon, Mr. Cramer said. “I am deeply disappointed by the behavior of the men’s swim team,” Christopher L. Eisgruber, the university’s president, said in a statement. “I have asked the athletic department to redouble its efforts to ensure that our teams conduct themselves with the character and ethics that we expect from students representing Princeton University in athletic competition. ”'"}, "time": 1742563361.751221}