{"duration": 0.04889845848083496, "input_args": {"text": "\"November 1, 2016 - Fort Russ -  Anastasiya Kazimirko-Kirillova, Tsargrad - translated by J. Arnoldski -  \\n\\n\\nOn October 28th, the Russian Academy of Sciences (RAN) selected its foreign members. This tradition dates back centuries and is of a more symbolic nature. In addition to bearing the honorary title, foreign members can participate in the life of RAN and even vote at the academy’s general meetings, even though they have no decisive vote.  \\nThis year, the ranks of RAN’s foreign members expanded to include seven Nobel laureates, among them the well known diplomat and former US Secretary of State, Henry Kissinger… \\nAs reported by Boris Chetvertyushkin who announced the results of academicians’ voting, the procedure implies that scholars, including Kissinger, are informed of their nomination and give their consent. The Russian Academy of Science’s foreign members are chosen from among the greatest foreign scholars recognized by the scientific community. If it is clear why some were chosen for physics and chemistry, then Kissinger received the offer for his geopolitical studies. \\nThe historical role of Kissinger is still debated to this day, including in the US. He is usually respected for his agreement to end the war in Vietnam and the Cold War detente between the United States and USSR. Interestingly enough, the leader of the North Vietnamese Communists, Le Duc Tho, received the Nobel Prize together with Kissinger for the success of the Paris Agreement, but refused to accept the award.  \\nThen Kissinger overthrew the Khmer Rouge regime in Cambodia which, ironically, he had brought to power insofar as he was the initiator of secret missions in Cambodia which dropped 110,000 tons of bombs on the country and plunged it into bloody chaos and genocide. And the concept of the “honorable peace” which preceded the conclusion of the ceasefire in Vietnam and cost the lives of millions of Vietnamese and tens of thousands of Americans, not to mention wounded, injured and missing, is also one of Kissinger’s achievements. \\nHis other striking “achievement” was the fascist coup in Chile through which Augusto Pinochet came to power and submerged the country in mass purges and arrests. Only one month after the coup, 30,000 people had been killed.  \\nKissinger also achieved rapprochement between the US and China against the USSR, which in the US is to this day considered to be one of his greatest successes. He has been called the modern Machiavelli and the architect of the new world order. \\nKissinger cannot but be admired as a worthy opponent. All the agreements, operations, and projects worked out by him, regardless of their cruelty and consequences, worked out brilliantly. This is why Kissinger’s services have always been used by all the powers in this world worth at least something. For decades, Kissinger has been a trustee of the Rockefeller clan. \\nThe 93-year-old diplomat came to Russia in 2016 to meet with Vladimir Putin and once again participate in the settlement of the new Cold War. Following their meeting, Kissinger wrote an article in which he expressed concern for the fate of the world. In his opinion, US-Russian relations are now worse than they were during his time as Secretary of State. He urged the two superpowers to work together, because this is the only way to maintain the otherwise shaky world balance. \\nKissinger is an old school diplomat symbolizing the peak of the US’ greatness. Today, he is a beneficial icon contrasted to the Obamas and Clintons who build their policies on the eternal dichotomy between imaginary US democracy and the imaginary totalitarianism of the US' opponents. Instead of ideology, Kissinger speaks of pragmatic things, real politik, and even his most ardent opponents' hatred for always contains an ounce of respect. \\n\\nThe gesture of nominating Kissinger for the Russian Academy of Sciences can be perceived as Russia demonstrating its willingness to listen even to its geopolitical opponents. Russia supports a realistic approach and sober consideration of national interests, as opposed to the current American elite.  \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n\""}, "time": 1742562024.3140461}