{"duration": 0.11150288581848145, "input_args": {"text": "'E-post – Hillary Clinton og Den muslimske brorskapen av Thierry Meyssan FBI-etterforskinga av Hillary Clinton sin private e-post er ikkje retta mot ei forsømmingssak gjeldande tryggleiksrutinar, men mot ein konspirasjon der ein prøver å eliminere eitkvart spor av korrespondansen hennar som skulle ha vore arkivert på serverane til den føderale staten. Denne kan innehalde utveksling om illegal finansiering eller korrupsjon, og om samband mellom Clinton-familien, Den muslimske brorskapen og jihadistane.\\nVoltaire Network | Damaskus (Syria) | 3 novembre 2016 ελληνικά English Español français Türkçe русский Deutsch Português italiano عربي Hillary Clinton og stabssjefen hennar, Huma Abedin Reprisen på FBI-etterforskinga av Hillary Clinton sine private e-postar handlar ikkje lenger om tryggleiksspørsmål, men heller om lureri og juksing på eit muleg høgforrædersk plan.\\nTeknisk sett så hadde utanriksministeren, i staden for å bruke ein av dei sikra serverane til den føderale staten, ordna med installasjon av ein privat server i heimen sin, for å kunne bruke internett utan å etterlate seg spor på noka maskin tilhøyrande den føderale staten. Fru Clinton sin private teknikar hadde tømt serveren før FBI kom, så det var umuleg å vite korfor ho hadde sett opp eit slikt nettverk.\\nFørst la FBI merke til at den private serveren ikkje var beskytta med same tryggleikssystem som utanriksdepartementet sin server. Såleis hadde fru Clinton berre gjort seg skuldig i brot på tryggleiken. Deretter konfiskerte FBI datamaskina til tidlegare Kongress-mann Anthony Weiner, eksmannen til Huma Abedin som er stabbsjef for Hillary. FBI fann e-postar frå utanriksministeren på datamaskina hans.\\nAnthony Weiner er ein jødisk politikar med svært nære band til Clinton-familien som hadde ambisjonar om å bli borgarmeister av New York. Han måtte trekke seg etter ein svært puritansk skandale – han hadde sendt erotiske SMS’ar til ei ung kvinne som ikkje var kona hans. Huma Abedin separerte seg offisielt frå han under skandalen, men i røynda gjekk ho ikkje frå han.\\nHuma Abedin er ein US-amerikansk statsborgar som vaks opp i Saudi-Arabia. Far hennar er direktør for eit akademisk tidsskrift – der ho var medredaktør i mange år – som regelmessig trykker kommentarar frå Den muslimske brorskapen. Mor hennar er president for den saudiske foreininga for kvinnelege medlemmer av Brorskapen, og arbeidde saman med kona til den egyptiske presidenten, Mohamed Morsi. Bror hennar Hassan arbeider for sjeik Yusuf al-Qaradawi, det religiøse overhovudet til Brorskapen og andeleg rådgjevar for Al-Jazeera.\\nPå ei offisiell reise til Saudi-Arabia besøker utanriksministeren høgskulen Dar al-Hekma, akkompagnert av Saleha Abedin (mor til stabbsjefen til Hillary), president for organisasjonen for syster-medlemmane til Brorskapen. Huma Abedin er i dag ein sentral figur i Clinton-kampanjen, ved sidan av kampanje-direktøren John Podesta, eks-generalsekretær av Det kvite hus under Bill Clinton. Podesta er også den utnemnde Kongress-lobbyisten for Kongedømet Saudi-Arabia – for den nette sum av $200 000 per månad. Den 12. juni, 2016 publiserte Petra, det offisielle pressebyrået til Jordan, eit intervju med kronprinsen av Arabia, Mohamed Ben Salmane, der han fortalde om kor moderne familien hans er, som hadde finansiert Hillary Clintons presidentkampanje i storleiksordenen 20%, sjølv om ho er kvinne. Dagen etter denne publiseringa kansellerte byrået dette telegrammet og hevda at internettsida hadde blitt hacka.\\nI følge Jordans offisielle pressebyrå Petra, publisert den 12. juni 2016, finansierte den saudiske kongefamilien 20 % av Hillary Clintons presidentkampanje. Fru Abedin er ikkje den einaste medlemmen av Obama-administrasjonen med band til Brorskapen. USAs presidents halvbror, Abon’go Malik Obama, er kasserar for Brorskapen sitt misjonsarbeid i Sudan, og også president for stiftinga Barack H. Obama Foundation. Han tar sine ordrar direkte frå Sudans president Omar el-Béchir. Ein Muslimsk bror er medlem av Det nasjonale tryggingsrådet – den høgaste administrative stillinga i USA. Frå 2009 til 2012 var dette Mehdi K. Alhassani. Vi veit ikkje kven som kom etter han, men Det kvite hus nekta for at en Muslimsk bror var medlem av Rådet inntil bevis kom fram i lyset. Ein Muslimsk bror, Rashad Hussain, er også US-amerikansk ambassadør til Den islamske konferansen [OIC, ein organisasjon med 57 medlemsstatar, stifta i Saudi-Arabia i mai 1971, til fremje av muslimsk solidaritet]. Dei andre Brørne som har blitt identifiserte innehar mindre viktige verv. Men vi må nemne Louay M. Safi, noverande medlem av Syrias nasjonalkoalisjon og tidlegare rådgjevar for Pentagon.\\nPresident Obama og halvbroren Abon’go Malik Obama i Det ovale kontoret. Abon’go Malik er kasserar for misjonsarbeidet til Den muslimske brorskapen i Sudan. I april 2009, to månadar før talen sin i Kairo, tok president Obama i løyndom imot ein delegasjon av Brorskapen på Det ovale kontoret. I løpet av sine første månadar som president hadde han allereie invitert Ingrid Mattson, presidenten for organisasjonen Association of Muslim Brothers and Sisters in the United States [organisasjonen for muslimske brør og systrer i USA].\\nFrå si side hadde Clinton-stiftinga sett inn Gehad el-Haddad som direktør for sitt eige «Klima»-prosjekt – han er ein av verdsleiarane for Brorskapen, og hadde inntil då vore leiar for eit koransk TV-program. Far hans var med på å stifte Brorskapen, då den vart skapt av CIA og MI6 i 1951. Gehad forlot Stiftinga i 2012, då han vart talsmann for kandidat Mohammed Morsi i Kairo, og deretter den offisielle talsmannen for Den muslimske brorskapen globalt.\\nSidan alle dei jihadistiske leiararne i verda har kome frå enten Den muslimske Brorskapen eller Den sufistiske ordenen til Naqshbandî [ei militant grein av islam] – dei to komponentane til Den muslimske verdsligaen, den saudiske anti-arabiske nasjonalist-organisasjonen – skulle vi likt å vite meir om fru Clinton sine relasjonar til Saudi Arabia og Den muslimske brorskapen.\\nNo har det seg faktisk slik at på laget til utfordraren hennes, Donald Trump, finn vi general Michael T. Flynn, som prøvde å motsette seg at Det kvite hus danna Kalifatet, og trakk seg ifrå leiinga av Forsvarets etterretningsbyrå (Defense Intelligence Agency) for å signalisere motstanden sin. Han arbeider jamsides med Frank Gaffney, ein historisk «kaldkrigar», no kvalifisert som «konspirasjonsteoretikar» for å ha dratt til felts mot nærværet av Brorskapen i den føderale staten.\\nDet er underforstått at all støtte til jihadistiske organisasjonar frå FBI sitt synspunkt er kriminelle brotsverk, uansett kva for retningslinjer CIA måtte ha. I 1991 hadde politiet – og senator John Kerry – provosert fram kollapsen til BCCI, ein pakistansk bank (sjølv om den er registrert på Cayman Islands) som CIA brukte til allslags hemmelege operasjonar i fellesskap med Den muslimske brorskapen og også Latino-narkokartell.\\nThierry Meyssan Oversettelse\\nMonica Sortland'"}, "time": 1742562223.9393284}