{"duration": 0.07234525680541992, "input_args": {"text": "'The Service Employees International Union is launching a desperate campaign against Donald Trump’s nominee for labor secretary, Andrew Puzder, who is the chief executive of CKE Restaurants, the parent company of Hardee’s and Carl’s Jr. [The attacks come from the SEIU’s “Fight For 15” campaign, which has protested   companies while trying to unionize the industry’s   and unskilled workers.  In the addition to the protests, the union is filing 33 legal complaints against Carl’s Jr. and Hardee’s franchisees. The Labor Department, as Breitbart News has written, writes the workplace rules and regulations for most Americans. Under President Barack Obama’s administration, the Department of Labor effectively became the Department of Organized Labor. The Obama labor department was openly hostile to advocates of small government. In 2011  U. S. Secretary of Labor Hilda Solis insulted members of the Tea Party, referring to the activists as “teabaggers,” as Breitbart News reported. The SIEU’s The Fight for 15 website has slammed Andy Puzder and President Trump by claiming: Trump wants to put Puzder in charge of enforcing these very laws that he broke as CEO. He opposes the minimum wage. He thinks workers are overprotected. He is against unions. He even said he wants to fire workers and replace them with machines that can’t take vacations or sue their employers when they break the law. In fact, as a   CEO, he regularly broke the laws he’d be responsible for enforcing if he gets the job. Puzder is the wrong choice for labor secretary. He is simply unfit to be put in charge protecting our nation’s workers and we’re calling on Members of the Senate to reject the nomination of Andy Puzder to lead the Department of Labor. Puzder’s spokespeople have hit back, reports  Nation’s Restaurant News: “This is more fake outrage from the unions and special interests which will stop at nothing in order to push their own   agenda,” a Puzder spokesman said in an email. “Fact is, Andy is a job creator and has provided opportunity for advancement for thousands of employees. His record of creating jobs is exactly what this country needs. ” A CKE spokesperson emailed a response Thursday on behalf of the company. “While we do not comment on pending litigation, we’d like to offer a reminder that CKE Restaurants is nearly 95 percent franchised,” the company said. “Each of these 2, 769 franchise stores are run independently and solely responsible for their employees, management and adherence to regulations and labor practices. ” Joe Kefauver, managing partner of the Align Public Strategies   firm, told Nation’s Restaurant News that the union’s actions would “likely make little difference in the outcome,” and added: “I doubt they expect to scuttle Puzder’s confirmation, they are simply using the process to continue driving their message,” Kefauver said in an email to Nation’s Restaurant News. “Republican leadership in the Senate is wholly committed to confirming the president’s nominees, and I think this nomination is no different. Barring something unforeseen, he will likely be confirmed. ” The SIEU will be slashing its budget by 30 percent this year as a result of having to “dramatically  ” its strategy in the wake of Donald Trump’s landslide victory.   news site Raw Story has reported that the workers who were working for the SEIU’s Fight for 15 campaign weren’t making $15 per hour and weren’t unionized. The hearing on Puzzler’s nomination is now scheduled for Tuesday, Feb. 7. Follow Breitbart News investigative reporter and Citizen Journalism School founder Lee Stranahan on Twitter at @Stranahan.'"}, "time": 1742563074.7451174}