{"duration": 0.08185291290283203, "input_args": {"text": "'As President Trump finished his first 24 hours in office by attending an interfaith prayer service at the Washington National Cathedral, German Chancellor Angela Merkel vowed to seek compromises with the new President on trade and military spending issues. [Speaking at a news conference in   Germany, Merkel sought to be a peacemaker after the German Vice Chancellor and leader of the   Social Democrats, Sigmar Gabriel, lashed out against Donald Trump’s election the day before as the result of “a bad radicalization. ”  Gabriel scoffed at the new president’s inaugural speech as nationalist and protectionist. He boasted that although Trump may be a rough ride, “We should neither be submissive nor have fear. ” He threatened that if President Trump wants a trade war, “Europe and Germany need a strategy geared toward Asia and China and we have new opportunities. ” But with $111 billion in exports to the U. S. and only $49 billion of U. S. imports, Chancellor Angela Merkel fully understands that the German economy would risk great damage in a trade war with the America. In trying to chart a conciliatory posture toward Trump, Merkel acknowledged: “He made his convictions clear in his inauguration speech. ” She expressed a new willingness to compromise on trade and NATO military spending by stating: “I say two things with regards to this (speech): first, I believe firmly that it is best for all of us if we work together based on rules, common values and joint action in the international economic system, in the international trade system, and make our contributions to the military alliances. ” The political   follows a   joint   by President Barack Obama and German Chancellor Angela Merkel confronting   Donald Trump that “there will be no return to a   world. ” The two world leaders emphasized, “We have a responsibility to our companies and citizens  —   actually, the entire global community  —   to enhance and deepen our cooperation. ” Germany has long considered a strong alliance with the United States to be a cornerstone of its foreign policy, and it will do everything it can to protect that partnership, according to Stratfor Global Intelligence. From a balance of payments deficit 15 years ago, Germany’s trade surplus with the United States has grown to almost 9 percent of Germany’s Gross Domestic Product. Despite a $62 billion surplus with the U. S. in 2016, America still funds and operates the 174 “base sites” in Germany, according to the Pentagon Budget. President Trump is not the first U. S. president to demand greater defense spending from NATO’s European members, but he is the first openly to label the alliance as obsolete and hint America might refuse to protect members that fail to contribute 2 percent of GDP. In a sign of arrogance just two days before the Trump inaugural, Germany’s defense minister announced that Berlin would increase 2017 military spending by $2. 1 billion to $39 billion in 2017, only 1. 2 percent of its GDP. With Germany enjoying the world’s largest current account surplus at $281 billion, President Trump, under existing U. S. law, can introduce “temporary safeguards” such as tariffs, to protect domestic industries threatened by certain imports. Although Trump cannot designate a country without new congressional legislation, he can   luxury cars and basically shut down German exports of Mercedes and BMW to the U. S. The Trump team has not announced if they will attend the Munich Security Conference from Feb.  . But Germany will try to leverage its current   presidency to secure more face time with U. S. leaders during a conference of foreign affairs ministers in Bonn from Feb.   and a larger summit with President Trump and top heads of state in Hamburg on July  . Chancellor Merkel has promised to visit the United States this spring to meet President Trump for the first time, as preparation for the Hamburg   summit.  '"}, "time": 1742628382.6688142}