{"duration": 0.04764556884765625, "input_args": {"text": "'Tuesday 1 November 2016 by James W School to trial cage fighting \\nAs the Government drops its plans to turn all UK schools into academies, Lonchester High School in Hull pledges to continue offering a curriculum that is relevant to the world beyond the school gates. \\n“This year we are trialling ultimate style cage fighting for our year 7s,” says head teacher Adam Smarts. \\nWith a reputation for his progressive approach, Smarts views the move as a necessary change to outdated school sports with questionable role models. \\n“Cage fighting is current, the kids no longer have posters on their walls of football players or pop stars; nowadays it’s all about mixed martial arts.” \\nAt a recent parents evening, Smarts introduced the idea as part of a suite of new initiatives to better prepare the kids for their lives ahead. \\n“Mr Smarts is right,” says Kevin Chalmers, father of 11-year old Toby who begins Year 7 in the autumn. \\n“It’s a mucked-up world out there and we need to toughen them up…I don’t want my son prancing around outside when he can be locked in an enclosed space fighting for his life…for me it’s a no brainer.” \\nOther parents at the school agree and have wholeheartedly backed Smarts and his team. \\n“Within a week, we’d had 96% of permission slips back and orders for kid-sized fighting gloves. \\n“Of course safety is important, so our cages have been ratified by the Ultimate Fighting Championship and we always ensure that blood spillage is cleaned up thoroughly between bouts.” \\nBullying has been virtually eradicated at the school courtesy of the inaugural teachers versus pupils fight-night. \\n“The usual troublemakers are either traumatised or incapacitated, so the playground is a much friendlier place.” \\nSmarts concedes that his ideas are not to everyone’s tastes but insists the results speak for themselves. \\n“We’ve even saved some money by selling the now redundant sports field for much-needed housing and the occasional death in the arena has helped to keep class sizes manageable.” \\nSmarts hand-picked team are fully invested in the approach and are keen to quash any residual parental scepticism. \\n“Come sports day, if anyone still has questions, we’ll get them in the cage, have a good scrap and I’m sure they’ll soon see the benefit…it’ll certainly make a fun change to the usual egg and spoon race,” says head of tactics and geography, Julian Titlow. \\nSpring term will see Lonchester broadening its extra-curricular options further to include dog fighting and an after school club version of The Hunger Games, with plans to combine the two as an end of year treat for leavers. Get the best NewsThump stories in your mailbox every Friday, for FREE! There are currently '"}, "time": 1742561857.3981452}