{"duration": 0.050048112869262695, "input_args": {"text": "'President Donald Trump has secured the release of an American citizen held in an Egyptian jail for three years, her Egyptian husband, and four fellow charity workers jailed with her. [“We are very happy to have Aya back home, and it’s a great honor to have her in the Oval Office,” Trump said on Friday during the meeting at the White House.  Trump arranged for a government aircraft to transport Aya Hijazi, 30, and her husband, Mohamed Hassanein, back to the United States, with the couple and family arriving late on Thursday. “We’re very grateful that President Trump personally engaged with the issue,” Aya’s brother Basel Hijazi said in a telephone interview while onboard the plane. “Working closely with the Trump administration was very important for my family at this critical time. “It let us be reunited as a family,” Hijazi said. “We’re so grateful. ” Aya Hijazi grew up in Falls Church, Virgina, and is a graduate of George Mason University. Rather than spending money on a lavish wedding, the couple used their money to launch the Belady Foundation to help children who live on the streets in Cairo, human rights advocates wrote in a piece published by The Huffington Post. Instead, the couple was arrested, and months later, they were told they had been charged with sexually assaulting the children in their care. A hearing was delayed seven times during the course of three years. “Hijazi brought the best of her American education and values to Egypt in an attempt to make the world a better place,” Kerry Kennedy, president of Robert F. Kennedy Human Rights (RFKHR) and Wade McMullen, RFKHR attorney, wrote in the Huff Po. “She faced the same political repression many defenders of human rights face,” they wrote. “Her vindication is proof that even small efforts to improve our world can create ripples that shake even the most entrenched authoritarian governments. ” “The couple and their   had been incarcerated since May 1, 2014, on child abuse and trafficking charges that were widely dismissed by human rights workers and U. S. officials as false,” the Associated Press (AP) reported on Wednesday. “Virtually no evidence was ever presented against them, and for nearly three years they were held as hearings were inexplicably postponed and trial dates canceled. ” The Obama administration, members of Congress, and human rights groups had failed to secure Aya’s release, in part because former President Barack Obama had shunned President Abdel Fattah   while Trump established a relationship with him, including issuing the first invitation to the White House. “Senate Foreign Relations Committee Chairman Bob Corker ( ) who said he recently advocated for Hijazi’s release in his own talks with Sisi and was briefed on the latest negotiations, said Trump ‘handled it the way things like this should be handled,’” the AP reported.'"}, "time": 1742563663.5890012}