{"duration": 0.12877178192138672, "input_args": {"text": "'STOCKHOLM  —   With a vigorous national debate underway on whether Sweden should enter a military partnership with NATO, officials in Stockholm suddenly encountered an unsettling problem: a flood of distorted and outright false information on social media, confusing public perceptions of the issue. The claims were alarming: If Sweden, a   member, signed the deal, the alliance would stockpile secret nuclear weapons on Swedish soil NATO could attack Russia from Sweden without government approval NATO soldiers, immune from prosecution, could rape Swedish women without fear of criminal charges. They were all false, but the disinformation had begun spilling into the traditional news media, and as the defense minister, Peter Hultqvist, traveled the country to promote the pact in speeches and town hall meetings, he was repeatedly grilled about the bogus stories. “People were not used to it, and they got scared, asking what can be believed, what should be believed?” said Marinette Nyh Radebo, Mr. Hultqvist’s spokeswoman. As often happens in such cases, Swedish officials were never able to pin down the source of the false reports. But they, numerous analysts and experts in American and European intelligence point to Russia as the prime suspect, noting that preventing NATO expansion is a centerpiece of the foreign policy of President Vladimir V. Putin, who invaded Georgia in 2008 largely to forestall that possibility. In Crimea, eastern Ukraine and now Syria, Mr. Putin has flaunted a modernized and more muscular military. But he lacks the economic strength and overall might to openly confront NATO, the European Union or the United States. Instead, he has invested heavily in a program of “weaponized” information, using a variety of means to sow doubt and division. The goal is to weaken cohesion among member states, stir discord in their domestic politics and blunt opposition to Russia. “Moscow views world affairs as a system of special operations, and very sincerely believes that it itself is an object of Western special operations,” said Gleb Pavlovsky, who helped establish the Kremlin’s information machine before 2008. “I am sure that there are a lot of centers, some linked to the state, that are involved in inventing these kinds of fake stories. ” The planting of false stories is nothing new the Soviet Union devoted considerable resources to that during the ideological battles of the Cold War. Now, though, disinformation is regarded as an important aspect of Russian military doctrine, and it is being directed at political debates in target countries with far greater sophistication and volume than in the past. The flow of misleading and inaccurate stories is so strong that both NATO and the European Union have established special offices to identify and refute disinformation, particularly claims emanating from Russia. The Kremlin’s clandestine methods have surfaced in the United States, too, American officials say, identifying Russian intelligence as the likely source of leaked Democratic National Committee emails that embarrassed Hillary Clinton’s presidential campaign. The Kremlin uses both conventional media  —   Sputnik, a news agency, and RT, a television outlet  —   and covert channels, as in Sweden, that are almost always untraceable. Russia exploits both approaches in a comprehensive assault, Wilhelm Unge, a spokesman for the Swedish Security Service, said this year when presenting the agency’s annual report. “We mean everything from internet trolls to propaganda and misinformation spread by media companies like RT and Sputnik,” he said. The fundamental purpose of dezinformatsiya, or Russian disinformation, experts said, is to undermine the official version of events  —   even the very idea that there is a true version of events  —   and foster a kind of policy paralysis. Disinformation most famously succeeded in early 2014 with the initial obfuscation about deploying Russian forces to seize Crimea. That summer, Russia pumped out a dizzying array of theories about the destruction of Malaysia Airlines Flight 17 over Ukraine, blaming the C. I. A. and, most outlandishly, Ukrainian fighter pilots who had mistaken the airliner for the Russian presidential aircraft. The cloud of stories helped veil the simple truth that poorly trained insurgents had accidentally downed the plane with a missile supplied by Russia. Moscow adamantly denies using disinformation to influence Western public opinion and tends to label accusations of either overt or covert threats as “Russophobia. ” “There is an impression that, like in a good orchestra, many Western countries every day accuse Russia of threatening someone,” Maria Zakharova, the Russian Foreign Ministry spokeswoman, said at a recent ministry briefing. Tracing individual strands of disinformation is difficult, but in Sweden and elsewhere, experts have detected a characteristic pattern that they tie to   disinformation campaigns. “The dynamic is always the same: It originates somewhere in Russia, on Russia state media sites, or different websites or somewhere in that kind of context,” said Anders Lindberg, a Swedish journalist and lawyer. “Then the fake document becomes the source of a news story distributed on   or    websites,” he said. “Those who rely on those sites for news link to the story, and it spreads. Nobody can say where they come from, but they end up as key issues in a security policy decision. ” Although the topics may vary, the goal is the same, Mr. Lindberg and others suggested. “What the Russians are doing is building narratives they are not building facts,” he said. “The underlying narrative is, ‘Don’t trust anyone. ’” The weaponization of information is not some project devised by a Kremlin policy expert but is an integral part of Russian military doctrine  —   what some senior military figures call a “decisive” battlefront. “The role of nonmilitary means of achieving political and strategic goals has grown, and, in many cases, they have exceeded the power of force of weapons in their effectiveness,” Gen. Valery V. Gerasimov, the chief of the general staff of the Russian Armed Forces, wrote in 2013. A prime Kremlin target is Europe, where the rise of the populist right and declining support for the European Union create an ever more receptive audience for Russia’s conservative, nationalistic and authoritarian approach under Mr. Putin. Last year, the European Parliament accused Russia of “financing radical and extremist parties” in its member states, and in 2014 the Kremlin extended an $11. 7 million loan to the National Front, the   party in France. “The Russians are very good at courting everyone who has a grudge with liberal democracy, and that goes from extreme right to extreme left,” said Patrik Oksanen, an editorial writer for the Swedish newspaper group MittMedia. The central idea, he said, is that “liberal democracy is corrupt, inefficient, chaotic and, ultimately, not democratic. ” Another message, largely unstated, is that European governments lack the competence to deal with the crises they face, particularly immigration and terrorism, and that their officials are all American puppets. In Germany, concerns over immigrant violence grew after a      girl said she had been raped by migrants. A report on Russian state television furthered the story. Even after the police debunked the claim, Russia’s foreign minister, Sergey V. Lavrov, continued to chastise Germany. In Britain, analysts said, the Kremlin’s   news outlets heavily favored the campaign for the country to leave the European Union, despite their claims of objectivity. In the Czech Republic, alarming, sensational stories portraying the United States, the European Union and immigrants as villains appear daily across a cluster of about 40   websites. During NATO military exercises in early June, articles on the websites suggested that Washington controlled Europe through the alliance, with Germany as its local sheriff. Echoing the disinformation that appeared in Sweden, the reports said NATO planned to store nuclear weapons in Eastern Europe and would attack Russia from there without seeking approval from local capitals. A poll this summer by European Values, a think tank in Prague, found that 51 percent of Czechs viewed the United States’ role in Europe negatively, that only 32 percent viewed the European Union positively and that at least a quarter believed some elements of the disinformation. “The data show how public opinion is changing thanks to the disinformation on those outlets,” said Jakub Janda, the think tank’s deputy director for public and political affairs. “They try to look like a regular media outlet even if they have a hidden agenda. ” Not all Russian disinformation efforts succeed. Sputnik news websites in various Scandinavian languages failed to attract enough readers and were closed after less than a year. Both RT and Sputnik portray themselves as independent, alternative voices. Sputnik claims that it “tells the untold,” even if its daily report relies heavily on articles abridged from other sources. RT trumpets the slogan “Question More. ” Both depict the West as grim, divided, brutal, decadent, overrun with violent immigrants and unstable. “They want to give a picture of Europe as some sort of continent that is collapsing,” Mr. Hultqvist, the Swedish defense minister, said in an interview. RT often seems obsessed with the United States, portraying life there as hellish. On the day President Obama spoke at the  Democratic National Convention, for example, it emphasized scattered demonstrations rather than the speeches. It defends the Republican presidential nominee, Donald J. Trump, as an underdog maligned by the established news media. Margarita Simonyan, RT’s editor in chief, said the channel was being singled out as a threat because it offered a different narrative from “the     establishment. ” RT, she said, wants to provide “a perspective otherwise missing from the mainstream media echo chamber. ” Moscow’s targeting of the West with disinformation dates to a Cold War program the Soviets called “active measures. ” The effort involved leaking or even writing stories for sympathetic newspapers in India and hoping that they would be picked up in the West, said Professor Mark N. Kramer, a Cold War expert at Harvard. The story that AIDS was a C. I. A. project run amok spread that way, and it poisons the discussion of the disease decades later. At the time, before the Soviet Union’s 1991 collapse, the Kremlin was selling communism as an ideological alternative. Now, experts said, the ideological component has evaporated, but the goal of weakening adversaries remains. In Sweden recently, that has meant a series of bizarre forged letters and news articles about NATO and linked to Russia. One forgery, on Defense Ministry letterhead over Mr. Hultqvist’s signature, encouraged a major Swedish firm to sell artillery to Ukraine, a move that would be illegal in Sweden. Ms. Nyh Radebo, his spokeswoman, put an end to that story in Sweden, but at international conferences, Mr. Hultqvist still faced questions about the nonexistent sales. Russia also made at least one overt attempt to influence the debate. During a seminar in the spring, Vladimir Kozin, a senior adviser to the Russian Institute for Strategic Studies, a think tank linked to the Kremlin and Russian foreign intelligence, argued against any change in Sweden’s neutral status. “Do they really need to lose their neutral status?” he said of the Swedes. “To permit fielding new U. S. military bases on their territory and to send their national troops to take part in dubious regional conflicts?” Whatever the method or message, Russia clearly wants to win any information war, as Dmitry Kiselyev, Russia’s most famous television anchor and the director of the organization that runs Sputnik, made clear recently. Speaking this summer on the 75th anniversary of the Soviet Information Bureau, Mr. Kiselyev said the age of neutral journalism was over. “If we do propaganda, then you do propaganda, too,” he said, directing his message to Western journalists. “Today, it is much more costly to kill one enemy soldier than during World War II, World War I or in the Middle Ages,” he said in an interview on the   Rossiya 24 network. While the business of “persuasion” is more expensive now, too, he said, “if you can persuade a person, you don’t need to kill him. ”'"}, "time": 1742628452.3254154}