{"duration": 0.11139941215515137, "input_args": {"text": "'Organizers of the   Fyre Festival  —   a promised “luxury” music festival in the Bahamas that left guests who paid tens of thousands of dollars scrambling immediately to find flights home  —   have been hit with a $100 million lawsuit alleging the whole enterprise was a “   scam” from the beginning. [Attorney Mark Geragos filed the $100 million proposed   lawsuit in California Sunday on behalf of client and festival attendee Daniel Jung, Billboard reports.  The claim alleges that Fyre organizers  —   namely, the rapper Ja Rule and    entrepreneur Billy McFarland  —   attempted to “fleece attendees for hundreds of millions of dollars by inducing them to fly to a remote island without food, shelter or water —  and without regard to what might happen to them after that. ” Ticket buyers  —   some of whom spent up to a reported $200, 000 on the most luxurious festival accommodations  —   arrived at the Island of Exumas on Thursday to find a festival site in disarray, with unfinished infrastructure and stages, disaster relief tents in place of luxury villas, and “gourmet” bread and cheese sandwiches in a cafeteria organizers had promised would be staffed by a celebrity chef. The festival  —   which had been heavily promoted for months by models and influential social media personalities including Kendall Jenner, Bella Hadid and Hailey Baldwin  —  had been billed as a unique “cultural experience,” with planned performances from   and the rappers Tyga and Desiigner, and opulent ticket packages offering the ability to charter a yacht. The festival’s official video promised the island was once owned by legendary drug kingpin Pablo Escobar.  But guests who made it to the island reported seeing wet, soggy tents, a lack of security and food, and even stray animals roaming the campgrounds. After organizers cancelled the event Friday, attendees struggled to schedule return flights home as the Island of Exumas’ tiny airport was overrun with   travelers. In the lawsuit, Geragos alleges that the festival was “more like The Hunger Games or Lord of the Flies than Coachella,” according to Billboard. The suit alleges fraud, breach of contract and negligent misrepresentation, with Geragos charging that the island was not “private,” as had been advertised, and had never been owned by Escobar. The lawsuit also claims that Rule and McFarland knew the festival would be a catastrophe and warned   promoters not to attend. “They called all the   names and the modeling agencies and told them not to come,” a source told the New York Post‘s Page Six over the weekend. “They were just like, ‘Oh, come next weekend when all the kinks have been worked out.’ This was before the chaos even started. ” Organizers issued a statement to Billboard claiming “full responsibility” for the festival, but promised full refunds and VIP accommodations to next year’s event, which they said would take place at a “United States beach venue. ” “We apologize for any inconvenience the past   has caused and we look forward to making a considerable donation to the Bahamas Red Cross Society as part of our initiatives,” the organizers wrote. “We need to make this right. And once we make this right, then we will put on the dream festival we sought to have since the inception of Fyre. ”   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562381.5116677}