{"duration": 0.10942649841308594, "input_args": {"text": "'Right to Clean Water & The Fight Against Eminent Domain Images come from the great video coverage of TYT, Democracy Now!, and Unicorn Riot By Jamie Poulos / filmsforaction.org \\nThe 3.8 billion dollar Dakota Access Pipeline project that has been the subject of controversy, encapsulates some of the main social problems facing society at this time: A justice system that b enefits corporate interests, often at the expense of true progress. Police increasingly being m ilitarized and civil liberties being eroded to protect the powerful! In addition to these issues, you have the determined continuation of a failed energy policy. Pipeline and oil projects are being given the green light without proper assessment of ecological, cultural, and social costs. The protesters want to protect our water, their land, and the sacred heritage sites of the Native Americans. \\nThe Office of the Director of National Intelligence ( ODNI ), predicts that by 2040 water demand will surpass supply by 40% . This will obviously affect the poorest most. The project has been halted next to the Missouri River and if allowed to continue the drinking water of the area will be threatened. Of course the most disenfranchised groups will suffer the most, mainly the Native Americans. The protesters make up a diverse group , comprising many indigenous peoples, environmentalist, and local farmers.They believe in the justice of their cause, so much so, that they endure extreme encounters from local police force. Dogs, rubber bullets, tear gas, and unfair arrest have been used to intimidate and deter protests. A militarized local police force has not only arrested hundreds of people on false accusations, but have used their position of authority to humiliate those they detain . Daughter of an indigenous leader was targeted, thrown into prison, and forced to sleep naked . Others arrested, were put into dog kennels and numbered . One farmer was arrested on her own land! Technically, according to the Treaty of 1851 , the contested land is actually belonging to the Native Americans. By proclaiming eminent domain the pipeline company has taken over property belonging to other people, including local farmers. Many can not afford to fight the legal battles needed to keep the construction of the pipeline off their own property! When directly asked about the aggressive police force used against peaceful protesters, President Obama placed responsibility on both sides. The aggressive and highly militarized responses of police has been well documented over the past months. This isn’t a two sided story as far as social justice is concerned. However, in the Pay to Play global system of today, there is another side. CEO of Energy Transfer Partners, Kelcy Warren, has donated heavily to politicians, local government, and various oversight boards. Could this be one reason their project is receiving the amount and extent of local protection? The oil and gas industry has spent a total of 88 MILLION dollars lobbying this year alone! Why? Subsidies and favorable legislation. While fact and science are not on the industries’ side, money is. The Huffington Post recently wrote an article placing Standing Rock into the larger framework of what is happening nationwide. Since the Keystone XL controversy, government agencies have been approving project after project without completing the necessary environmental risk analysis. Advocates of the pipeline emphasize the unlikelihood of any leak or spill occurring. Yet, oil spills and pipeline explosions happen often and go under or unreported. Think Progress published an article stating that over 300 oil spills went unreported within a two year period. Tens of t housands of gallons of oil are allowed to spill without it receiving any attention. James Sutton, from The Hill Talk , notes that from May to June 2016 over 20 oil spills in the US alone went unreported . There are many who criticize the current regulation system which places to much trust in companies. Oil companies are responsible for estimating how much oil has spilled and are then fined per gallon. Needless to say, the damage is often much more than they are readily willing to admit. Another argument often used in favor of this project and others like it, is job creation. The only logical step is to create an energy policy that would force investment into renewable energy . In the documentary Before the Flood we are shown a Tesla Gigafactory. Elon Musk claims 100 such mega battery factories could well remove our reliance on fossil fuels. The industry of oil and coal isn’t about creating jobs; it is all about socializing risks and privatizing profits. Not only do certain industries add to the problems of global warming, but they actively deter alternatives . The documentary Who Killed the Electric Car , is a great example of this. By demanding a strict policy forcing a shift to sustainable energy we would be creating far more jobs and slashing the cost of energy. The Green New Deal proposed by Jill Stein is a good starting point for political dialogue. Scientist across disciplines and from all over the World have warned that we are moving closer and closer to a point of no return. We have the technology to reverse this. Do we have the will? We need a major shift in consciousness to begin to solve the pressing issues of our time. This begins with the individual. It need not be a daunting task: One Step'"}, "time": 1742561753.0059016}