{"duration": 0.04970216751098633, "input_args": {"text": "'November 10, 2016 - Fort Russ News -  PolitRussia - translated by J. Arnoldski - \\n\\n\\nCrimean leader Sergey Aksenov welcomed the choice of the American people in the US presidential elections despite what he called “numerous” violations in the electoral process. \\nAksenov stated: “The American people have made their choice. Our president was clear: the Russian Federation is not interfering in or even making any attempts to influence the will of the American people. In my opinion, the elections were held with numerous violations. If this had happened in Crimea or Russia, then the elections would have been assessed differently by American politicians. They would say that everything was wrong and illegitimate. But the Americans did not allow Russian diplomats near polling stations and prevented the formation of an objective view of what was happening at polling stations and overall how the elections were being held in the US.” \\nCommenting on Trump’s pre-election promises in regards to Russia and the Republic of Crimea, Aksenov said: “Before elections, politicians usually make some statements, and then their program can radically change. Time will tell. I am sure that our president will make sufficient efforts so that Crimea will be recognized throughout the world.” \\nThis summer, Trump stated that he would be ready to “look into” the question of recognizing Crimea as Russian territory and lifting the sanctions against Russia if he won the elections. He remarked that Crimeans want to be with Russia and that this should be considered by the international community. These words caused great anxiety in Kiev. \\n\\nThe leader of the Donetsk People’s Republic, Alexander Zakharchenko, was cautious in being optimistic towards Trump’s election as US president. Zakharchenko expressed concern that after Trump moves into the White House, he will become part of the American political system and there is no guarantee that he will be able to resist this system. For the DPR, Trump’s suggested policies could signal a change in attitude towards the Ukrainian crisis. \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742564435.8646462}