{"duration": 0.03192496299743652, "input_args": {"text": "'Republicans continue to clash over Obamacare taxes as Congress plans to draft a repeal package. [Conservatives worry that a tax credit included in the Ryan plan would cost too much and might create an expensive new entitlement program. Congressman Mark Walker ( ) chairman of the Republican Study Committee says, “I want to make sure that we’re not getting to a place where we’re providing this   benefit that enables people. ”  House Freedom Caucus Chairman Mark Meadows ( ) said refundable tax credits could be a “new entitlement program. ” He doubts that House leaders possess the votes necessary to pass refundable tax credits. Other conservatives object to taxing   health insurance plans. Rep. Pete Session ( ) chairman of the House Rules Committee, told reporters that this would amount to “a Republican tax on Cadillac plans. ” Committees will meet in early March to draft Obamacare’s repeal, although House Republicans remain disunified on the details. House Ways and Means Committee Chairman Kevin Brady ( ) assured his fellow Republicans, arguing that a tax credit offers immediate help. Brady said, “It covers more people, because it applies to those who don’t have a tax liability, and it’s advanceable, so it’s available today. ” Some    Republicans want to keep Obamacare’s taxes to provide revenue for Obamacare’s replacement. Brady, as chairman of the House Ways and Means Committee, has significant power to draft Obamacare’ replacement. He argued that Obamacare’s taxes are bad for economic growth. He said, “I’ll just tell you, I don’t want Americans to suffer under the Obamacare taxes. They’re   they drive the prices of healthcare up I just think they’re bad all around. ” Republicans continue to battle over Obamacare’s Medicaid expansion.   states expanded Medicaid, and Congress continues to debate over how to scale back Medicaid expansion. The conservative House Freedom Caucus, along with Senator Rand Paul ( ) unveiled their Obamacare repeal bill that repeals Medicaid expansion entirely. The Ryan plan lowers the federal government’s match rate for Medicaid spending back its traditional level. Congresswoman Marsha Blackburn ( ) told Breitbart News, “There is wide agreement amongst the governors, Republicans and Democrat alike, that they would like us to send Medicaid to the states. ” Blackburn believes that   Medicaid to the states will, “get rid of some of the constraints from the federal government and offer a better product at a more affordable cost and help more people. ” Chairman Brady remarked that tax breaks in Obamacare’s replacement would benefit all Americans, not just the few. He said, “I’m not interested in raising taxes anywhere else, and so I think unlocking and redesigning the current tax break so not just a few Americans can use it, but all Americans can use it, I think that’s where we ought to focus our thought, make sure we design it right and get it right. ”'"}, "time": 1742628559.898866}