{"duration": 0.10212469100952148, "input_args": {"text": "'españa , almirante kuznetsov , ceuta , portaaviones Imagen del portaaviones Almirante Kuznetsov. Fuente:Reuters \\nLa ruta y la misión del portaaviones Almirante Kuznetsov, según el secretario de prensa del presidente de la Federación de Rusia, Dmitri Peskov, se encuentran en un sobre cerrado en el que se lee “Completamente secreto”. \\nSin embargo, según informaba anteriormente el Ministerio de Asuntos Exteriores español, se preveía que el portaaviones llegara al puerto de Ceuta el 28 de octubre . En Madrid señalan que el permiso correspondiente se expidió el pasado mes de septiembre. \\nNo obstante, en cuanto la noticia sobre la inminente llegada de los buques a Ceuta llegó a la prensa, España comenzó a recibir críticas de sus aliados en la OTAN. \\nEl secretario general de la Alianza, Jens Stoltenberg, señaló que en otras condiciones no tendría nada que objetar al abastecimiento de los buques rusos, pero que en la actualidad está extremadamente preocupado porque estos “puedan utilizarse para atacar Alepo”. \\nOtros políticos de Gran Bretaña y EE UU hicieron declaraciones similares. \\nEn España las críticas más duras que ha recibido el gobierno provienen de Esquerra Republicana de Catalunya. Su servicio de prensa ha confirmado a Kommersant que los miembros del Congreso de los Diputados de este partido han exigido al ministro de Asuntos Exteriores en funciones, José Manuel García-Margallo y al ministro de Defensa en funciones, Pedro Morenés, que expliquen por qué razón unos barcos rusos que participan en la operación siria hacen escala en Ceuta. 9 cosas que no sabías sobre el portaaviones “Almirante Kuznetsov” \\nLas autoridades portuarias de las ciudad han expresado su descontento por lo sucedido. Desde el año 2011 por este puerto han pasado, según el El País , más de 60 buques rusos. \\n“Los criterios para permitir la escala en Ceuta son la seguridad del medio ambiente, de la ciudad y de su población”, cita el periódico The Spain Report a fuentes en la administración del puerto. Sin embargo, debido al aluvión de críticas recibidas, el Ministerio de Asuntos Exteriores de España anunció ayer que “iba a celebrar una consulta para estudiar la decisión”. \\nHacia el mediodía de ayer la embajada de Rusia en Madrid comunicó a Exteriores que retiraba la petición de permisos de escala para la escala de los buques y, por lo tanto, quedan canceladas. “Confirmamos que nuestros barcos no entrarán en el puerto de Ceuta porque se ha modificado su ruta”, declaraban desde la embajada. La reacción de Moscú \\nVasili Nioradze, secretario de prensa de la embajada, instaba a no dramatizar la situación en declaraciones a Kommersant. \\n“La negociación sobre este tipo de escalas en los puertos es un procedimiento rutinario –señalaba este-. Nosotros enviamos la solicitud de forma anticipada y para tomar una decisión al respecto se tiene en cuenta el derecho internacional y los requisitos del país. En esta ocasión se ha decidido una cosa, y en otros casos la respuesta será distinta”. \\nÍgor Konashenkov, representante oficial del Ministerio de Defensa explica que el departamento ruso contemplaba la posibilidad “de la escala acordada con el gobierno español de algunos buques o embarcaciones de apoyo de la flotilla rusa”. \\nSin embargo, según el representante del Ministerio de Defensa ruso, no se envió ninguna solicitud oficial. \\nAdemás, comenta: “Los representantes del gobierno español han declarado que debido a la presión de Estados Unidos y de la OTAN el paso de buques rusos por el puerto de Ceuta no es oportuno”. Las autoridades de España no han hecho ninguna declaración similar en público. Madrid ha perdido dinero \\nEl director del Centro de Análisis de Estrategias y Tecnología, Ruslán Pújov, no ve ninguna tragedia en el cambio de ruta del Almirante Kuznetsov. \\n“Nuestros buques pueden repostar sin problemas en Argelia o en Malta. Apuesto por Argelia, ya que Malta es miembro de la UE y se enfrentará a los mismos problemas que España”, informa el experto a Kommersant . \\nSegún Pújov, la llegada del grupo del Almirante Kuznetsov a Siria apenas cambiará la correlación de fuerzas en la región, aunque sí permitirá a Rusia elevar su prestigio internacional. \\n“Los franceses tienen un portaaviones en la región porque no tienen base, pero nosotros sí que tenemos–declara el experto-. La misión del Kuznetsov es más bien una operación de entrenamiento. Los pilotos de los aviones navales necesitan entrenar y Siria les ofrece la posibilidad de hacerlo en condiciones de combate reales”. \\nEl experto del mismo centro Andréi Frolov añade que la expedición del Almirante Kuznetsov también tiene un “componente publicitario”: La India está pensando en comprar cazas navales MiG-29K/KUB para sus futuros portaaviones, y la demostración de sus características en Siria podría ayudarle a decidirse”. Lea más '"}, "time": 1742564479.0821874}