{"duration": 0.11134505271911621, "input_args": {"text": "'After less than a month in exile, the white nationalist leader Richard B. Spencer is back on Twitter. The social network reinstated Mr. Spencer’s personal account on Saturday, less than four weeks after suspending it and others he created for violating rules against making multiple accounts with overlapping uses. “Please select one account for restoration the others will remain suspended,” the company told Mr. Spencer last week, according to an email that was obtained by BuzzFeed. The account was suspended on Nov. 15, and a spokesman for Twitter said in an email that it first contacted Mr. Spencer three days later, on Nov. 18, and again last week. Mr. Spencer, a leader of the     a   fringe movement that embraces white nationalism, racist,   and   positions, celebrated his return on Saturday night by writing “I’m back,” accompanied by a clip of Arnold Schwarzenegger from the “Terminator” movie franchise. Twitter and other social networks have found themselves at the center of a debate over where and how to draw the line between free speech and harassment. While Mr. Spencer’s suspension was due to a violation of the multiple accounts policy, it occurred as Twitter began a broader crackdown on accounts tied to hate speech or threats of violence, according to The Associated Press. Over the summer, in a move that seemed to signal a new approach to abuse, it suspended the account of Milo Yiannopoulos, a writer who had consistently violated its terms of service and led a harassment campaign against the actress Leslie Jones. Mr. Yiannopoulos has not returned to the social network. When Mr. Spencer was suspended, he told The A. P. he had no plans to rejoin Twitter unless he got an apology. The company told BuzzFeed on Sunday night that Twitter’s rules “also prohibit hateful conduct, harassment and violent threats. We will take action on accounts that violate these policies. ” Mr. Spencer’s account, which is verified by Twitter, was suspended last month along with several others that had been associated with promoting hate speech. At the time, Mr. Spencer released a YouTube video in which he accused Twitter of “corporate Stalinism,” and said there had been “execution squads across the  . ” Mr. Spencer posted on Saturday night that his other accounts would soon be reinstated as well. The spokesman for Twitter said that its email to Mr. Spencer contradicted that claim. “The Twitter rules explicitly prohibit creating multiple accounts with overlapping uses. When we temporarily suspend multiple accounts for this violation, the account owner can designate one account for reinstatement,” the spokesman said. At a conference in Washington, D. C. last month, Mr. Spencer quoted Nazi propaganda and railed against Jews. America belonged to white people, he told an audience of 200, most of them young men. And, at one point, several in attendance raised their arms in a Nazi salute. “Hail Trump! Hail our people!” he said, adding “Hail victory!”  —   the English translation of the Nazi “Sieg Heil!” Last week, a   speech he delivered at Texas AM University was interrupted by violent skirmishes, and police officers in riot gear were called in to help control the crowd of protesters outside, according to The Texas Tribune. In his first 24 hours back on Twitter, Mr. Spencer engaged in banter with other users, praised how   Donald J. Trump has handled the transition process, and shared a story about “Gab,” a social network with an    mission that has become a safe haven for the far right.'"}, "time": 1742628586.5794501}