{"duration": 0.04836678504943848, "input_args": {"text": "'Video: Underwater Handgun Takes Fishing to the Next Level of Fun By: Chase Stephens November 23, 2016 \\nFor some people, fishing is a long, boring day of sitting and staring endlessly at a rod and reel that may never get a bite. But what if you could get down with those mocking water-breathers and have high-noon shoot-out with them the way nature intended? \\nWell, that\\'s just what some Florida boys thought when they decided to take their modified Glock 9mm pistol into the Gulf of Mexico to help deal with the infestation of Lionfish. \\nTheSickest provides some more details on the Lionfish overpopulation problem and the boys\\' creative way to address it: \\n\"Lionfish are an invasive species with no natural predators who’s females lay a staggering two million eggs a year. The intersection between ammunition-happy Americans and the determent of an overpopulated species is where the the use of this new sporting phenomenon was birthed. \\nLionsfish were never intended to be in the Gulf of Mexico, and while its speculated that their transplant may be linked to a hurricanes back in the 90’s, because of their rapid reproductive nature the waters have become flooded by their presence. \\nA single Lionsfish consumes 80% reef’s edible baitfish within five weeks of arriving on that reef – incredibly damaging to plant that is the cornerstone of the underwater ecosystem. The issue has gotten to a point where entering the Florida coast at any time can mean running across thousands of Lionsfish, just posted up chilling. \\nThe good news is that the introduction of the gun has the potential of bringing hunters and otherwise uninterested fishers to the gulf for a fun filled time of shooting underwater, an activity that actually looks like a blast.\" \\nThe video below shows just how fun it can be: \\n\\n\\n\"Shooting invasive Lionfish over 100ft underwater with customized Glock 9mm handgun in the Gulf of Mexico,\" the video description states. \"The project started to see if we could shoot a gun underwater and it evolved into much more with the right people involved. Lionfish are an invasive species that need to be eradicated. All weapons modifications done under supervision of Airborne Arms Inc license holder \"07-Manufacturer of Firearms other than Destructive Devices\" with support of Lone Wolf Glock Parts. www.lonewolfdist.com\" \\nExit video of another group of fisherman who\\'ve combined skiing with barbarian weaponry to help deal with Peoria, Illinois\\' Asian carp problem: \\n'"}, "time": 1742562120.5704787}