{"duration": 0.13544654846191406, "input_args": {"text": "'U. N. Ambassador Nikki Haley said on Wednesday that the United States is “considering every option that’s on the table” in response to North Korea’s provocative launch of ballistic missiles at Japan on Monday. [“We’re not ruling anything out,” said Haley at a press conference on North Korea attended by Japanese Ambassador Koro Bessho and South Korean Ambassador Cho  .  ABC News quotes Haley urging all U. N. members to “increase their strengths” to compel “the attention of North Korea as we go forward,” and warned the outlaw state’s actions put the entire “global community” in danger. She dealt with Chinese and Russian criticism of America’s decision to deploy a THAAD missile system to South Korea by asking, “Tell me why we wouldn’t do the THAAD in light of   ballistic missiles? In light of two nuclear tests?” “We are not going to leave South Korea standing there with the threat of North Korea facing them and not help. The reason for THAAD is because of the actions of North Korea,” she declared. Haley seemed tentatively willing to consider China’s offer to broker a deal in which North Korea suspends its nuclear and missile programs in exchange for the U. S. and South Korea canceling regular military exercises that offend Pyongyang. However, she said the United States would need to see “some sort of positive action taken by North Korea before we can ever take them seriously. ” Interestingly, ABC News notes that South Korean Ambassador   strongly rejected the Chinese proposal, insisting that South Korea’s military exercises with the United States are “defensive in nature,” and it was “inappropriate and unacceptable” to link them to North Korea’s banned weapons research. A senior Trump administration official who spoke to the Washington Post was also “underwhelmed” by the Chinese plan. “This isn’t really a new proposal in any way. This is what the Chinese have wanted for a long time,” the official stated, ruling out the possibility of using it as a starting point for negotiations with North Korea. This official also said China’s ostensibly serious sanctions against North Korea, such as banning coal imports, are “inadequate to change the regime’s behavior,” and the Trump administration is looking for “genuine signs the Chinese are willing to get serious about North Korea. ” The U. N. Security Council condemned North Korea’s missile launches on Tuesday, saying that “such activities contribute to the Democratic People’s Republic of Korea’s development of nuclear weapons delivery systems and increase tension in the region and beyond as well as the risk of a regional arms race. ” “The members of the Security Council further regretted that the Democratic People’s Republic of Korea is diverting resources to the pursuit of ballistic missiles while Democratic People’s Republic of Korea citizens have great unmet needs,” the U. N. statement added. More pressure on North Korea is coming from humanitarian groups such as Human Rights Watch, which organized panel discussions in Geneva this week to review Pyongyang’s abuses, in conjunction with a session of the U. N. Human Rights Council. Human Rights Watch wants additional investigators and legal experts for the HRC’s office in Seoul to help “set out a prosecution strategy for alleged crimes against humanity in North Korea. ” United Nations inspectors already have their hands full with North Korea’s provocations. The Wall Street Journal reported on Wednesday that investigators have discovered North Korea “attempted to sell a form of lithium metal, a key material for developing miniaturized nuclear weapons, to unidentified international buyers last year. ” “The U. N. Panel of Expert’s report on North Korea provides further evidence that North Korea will stop at nothing to advance its illicit nuclear and missile programs,” declared Senator Cory Gardner ( ) after reading this report. The Wall Street Journal explains that enriched lithium is a sign that North Korea is making progress on its drive for miniaturized nuclear warheads that can fit on ballistic missiles.'"}, "time": 1742563207.542547}