{"duration": 0.08267569541931152, "input_args": {"text": "'Just Another Day In the Life of the Clinton Crime Family \\n\\nIn the past 24 hours, some very stunning pieces of information have leaked out regarding the Clinton Crime Family. I am shocked about how pervasive the criminality is in what has been only a 24 hour news cycle. Assange’s Lawyers Are Dead \\nThere are two lawyers who represented WikiLeaks founder, Julian Assange, who died and their deaths were in very close proximity, only a mere month apart. \\nAssange attorney, John Jones, suicide was committed by the top lawyer when he jumped in front of a train in West Hamstead, in which the police did not even consider the possibility of foul play. The authorities, courtesy of the Clinton Foundation, found nothing suspicious about the manner of Jones’ death. \\nMichael Ratner made a career out of defending government whistle-blowers and detainees, something that one could argue was right inside of Assange’s wheelhouse. Ratner’s death was shrouded in mystery. It is important to note that Ratner had actually sued three sitting US Presidents and tried to get George W. Bush impeached for lying America into the Iraq war. Certainly, when someone like Ratner who had begun to represent Assange, was a terrible threat to the Clintons and the Clinton Foundation and had to be dealt with. Chief Investigator for Bill Clinton’s Impeachment Trial Lives In Fear of His Life \\nAaron Klein, yes the same Aaron Klein who released emails, before they were purged, which demonstrated that Clinton was sending out, through her personal server the travel plans of Ambassador Stevens prior to his death at Benghazi, recently interview Dave Shippers the Chief Investigator of Bill Clinton’s impeachment trial. Shippers professed that he still lives in fear of his life. \\n“Today, I am still terrified of Hillary. Absolutely I am terrified. Because if she gets into office. In fact, I’ve told my wife, I said, ‘If Hillary gets elected, look for the FBI or somebody to come and pick me up the next day.’ \\n“And I think I’m the only one left. [Former Congressman] Henry Hyde is dead. [Independent Counsel Kenneth] Star didn’t really hurt her. Yeah. I was scared when I was out there… I’ve been terrified ever since. Because things happen. Things happen.” \\nKlein allowed his interview to drift into the area of Vince Foster’s alleged suicide which Shippers was convinced that his event was a murder designed to cover up Hillary Clinton’s criminal behavior. Shippers also mentioned the impeachment investigation, centering around Clinton lying about his affair with Monica Lewinski, uncovered evidence of at least three murders connected to Hillary Clinton. However, as Shippers stated, the investigation was limited to to the Lewinski angle. This is really ashame because of the fact that Hillary Clinton could have been stopped in the 1990’s and this nation would not, today, be fighting for its life under the threat of an extinction level event such as the specter of a Clinton Presidency. Anthony Weiner Fears for His Life At the Hands of Hillary Clinton \\nThe perverted Congressman, who could not stop sexting grossly inappropriate images of himself to underage girls, may have unwittingly put another very large nail in the political coffin of Hillary Rodham Clinton. According to sources , we now know that the FBI accidentally discovered that Weiner had several emails that were suspiciously marked “life insurance” and the FBI found that these email were directly related to the FBI’s investigation of Hillary Clinton. \\nDisturbingly, these same sources indicated that the sources were turned over to the FBI over a month ago while the FBI was still running interference for the Clinton Crime Family. It is very concerning that Comey never mentioned these damning emails. \\nThe NYPD had the same information and they planned to leak the information despite intense pressure not to do so. This information not only shows that Anthony Weiner was in extreme fear of his life, from the Clintons, that he actually created his Julian Assange’s style of a dead man’s switch in the event of his death. I would add, that Huma may want to avoid subway trains and airplanes for awhile for her own safety. I predict that Weiner will become a star witness in either the immediate take down of Hillary, or her impeachment trial should George Soros be able to steal the election for her. Conclusion For the good of the country, Hillary needs to step down immediately. She has made our justice system and nation, as a whole, a complete laughing stock. Anyone, and I mean anyone, who would vote for Hillary Clinton, needs to take a long look in the mirror and ask yourself what kind of person are you. How can you face your kids and claim to be a moral authority in their lives and vote for this evil monster? This is just another day in the life of the Clinton Crime Family.'"}, "time": 1742564598.9853537}