{"duration": 0.04168081283569336, "input_args": {"text": "'  \\nOn Sunday, during an appearance on Fox and Friends , Trump surrogate Brunell Donald-Kyei went into full-blown Mad Hatter mode as she “argued” the significance of the FBI’s recent announcement concerning Hillary Clinton’s emails. \\nDuring the segment, after proclaiming that she’s an “attorney,” the Vice-Chair of Trump’s National Diversity Coalition declared that the FBI doesn’t just “reopen cases.” However, panelist Brian Benjamin observed that the FBI had not officially reopened the case against Clinton (most likely due to the fact that they have not actually found anything). \\nThis unauthorized use of logic on the Fox News channel prompted Donald-Kyei to quickly dive down a rabbit hole of far-right-wing conspiracy theories, first citing the Wikileaks Podesta emails as proof of Clinton’s corruption and then implying something much darker about the presidential candidate. \\n“We’ve got Huma Abedin with 10,000 emails under “life insurance” because she doesn’t want an accidental death,” declared the Trump surrogate. \\nUm. What? \\nShe then went on to rail against Clinton and Obama, accusing both of making race relations worse over the past eight years. \\n“Hillary Clinton is running around saying [that], when she and the president have worked so hard over the last eight years to divide the country.” \\nWithout citing any concrete evidence, the attorney claimed that both Clinton and Obama worked to pit “whites against blacks, blacks against Hispanics,” and “Hispanics against Asians.” \\nShe further argued that unlike Obama and Clinton, Trump would bring Americans together. \\nDonald-Kyei concluded her rant with a prediction as bulletproof as her logic. \\n“Believe me, believe me, they are convening a grand jury,” Donald-Kyei exclaimed . “Trust me!” \\nDonald Trump must have the greatest collection of mentally unbalanced, intellectually dishonest, and morally dubious surrogates of any presidential candidate in U.S. history. \\nFeatured image via YouTube .'"}, "time": 1742564602.1641326}