{"duration": 0.10367679595947266, "input_args": {"text": "'According to the Associated Press, Chinese diplomats “say they aren’t overly worried by fiery rhetoric from Trump and his Cabinet picks, and that China won’t change its basic approach” to issues like the South China Sea. [“Foreign Ministry spokesman Lu Kang said Thursday that tensions in the strategically vital waterway have lessened and countries from outside the region should support efforts toward stability,” the AP reports.  Kang was speaking in response to Secretary of State nominee Rex Tillerson’s assertion that the U. S. should send a “clear signal” to China about halting its military buildup on South China Sea islands. The New York Times worries that Tillerson’s remarks could “foreshadow” a foreign policy crisis with China: Mr. Tillerson told members of the Senate Foreign Relations Committee on Wednesday that China’s     campaign in the    rich sea was illegal and “akin to Russia’s taking of Crimea. ” “We’re going to have to send China a clear signal that, first, the   stops,” Mr. Tillerson told the senators. “And second, your access to those islands also is not going to be allowed. ” Should those words be translated into action after Donald J. Trump assumes the presidency on Jan. 20, it would be a remarkable change in the American approach to Beijing’s   in the South China Sea, which is transforming the area into what one Washington think tank said would by 2030 become “virtually a Chinese lake. ” China asserts sovereignty over most of the South China Sea despite competing claims by countries including Vietnam and the Philippines and an international ruling rejecting most of Beijing’s assertions. The Secretary of State nominee explained his focus on the South China Sea, as related by Reuters: Tillerson said he considered China’s South China Sea activity “extremely worrisome” and that it would be a threat to the “entire global economy” if Beijing were able to dictate access to the waterway. He blamed the current situation on what he termed an inadequate U. S. response. “The failure of a response has allowed them just to keep pushing the envelope on this,” Tillerson said. “The way we’ve got to deal with this is we’ve got to show back up in the region with our traditional allies in Southeast Asia,” he said. “They’re taking territory or control, or declaring control of territories that are not rightfully China’s,” he added, stressing that China’s   and declaration of an air defense zone in contested waters are “illegal actions. ” If Tillerson is serious about denying China access to the islands, it certainly would be a dramatic change from the Obama policy of “challenging” China’s “excessive maritime claims” without doing anything to actually slow them down. The Times reports Tillerson’s remarks generated “reactions including confusion, disbelief, and warlike threats from analysts in China,” quoting one such analyst boasting that China now has greater   capability than the United States, and would be ready for any “troubles” sent its way. Just about every Western media report on Tillerson’s statement focuses on the ominous ambiguity of what he meant by denying China “access” to South China Sea islands  —   many of which, as Reuters points out, are “equipped with   airstrips and fortified with weapons. ” “This is the sort of    remark akin to a tweet that pours fuel on the fire and maybe makes things worse. Short of going to war with China, there is nothing the Americans can do,” senior analyst Malcolm Davis of the Australian Strategic Policy Institute told Bloomberg News. However, Bloomberg notes that for all the concern about an enraged Chinese response, and a bit of snarling from analysts like those cited and alluded to by the New York Times, the actual official response from Beijing has been “relatively measured” so far  —   consisting mostly of officials like the Foreign Ministry’s Lu Kang saying they aren’t quite certain what Tillerson meant.'"}, "time": 1742561661.2780874}