{"duration": 0.0626673698425293, "input_args": {"text": "\"Print \\nAccording to Democrats, the only thing in life which isn’t rigged is this election. \\nAs long as Hillary Clinton is said by the pollsters to be in the lead and likely to win, the “system” is just fine – but only the election system. \\nIt can’t be rigged if the democrats win. A democrat being in power is the natural order of things. I think it may actually be a part of Darwin’s evolutionary theory. First the protozoa, then the fish, then the ape, then the Neanderthal Republican, and finally, the enlightened progressive Democrat. That’s how it goes – right? \\nIt is amusing that the same people and party, who claim that everything in America is somehow rigged, think it ridiculous when the Republican nominee claims that of this election – and that Republican voters are the ones this time being “disenfranchised.” \\nIn August of this year, the Washington Post claimed that Exxon Mobil is “rigging the system” against green energy. Of course they are. After all, they are the poster-corporation of evil “big oil.” “As recently as last year, it continued to fund organizations that play down the risks of carbon pollution,” writes the Post. \\nSo “rigged” is the system that the AGs of the communist states of New York and Massachusetts, “are investigating whether ExxonMobil violated state laws by knowingly misleading their residents and shareholders about climate change.” \\nBig Oil – Climate Change – Rigged – Check. \\nIn 2015, Director of the University of Cambridge Master of Finance program, Simon Taylor wrote that, “Bank executive pay appears rigged against women.” He found that female bank execs’ “pay packages typically have a much lower level of incentive compensation,” netting women much less than male counterparts. \\nThat same year, the NewStatesman.com wrote that, “Women can’t have it all – because the game is rigged.” The author is upset that women have to “choose” between having a high-powered career and spending time raising a family. Yeah – I know. If the system wasn’t so “rigged,” women could have it all – a model family and equal pay – unless, of course, if they work for the Clinton Foundation. \\nWomen – Equal Pay – Rigged – Check \\nNaturally, the system is “rigged” against the poor and the middle class. The working class warrior, Elizabeth Warren , who is worth almost $15 million, said in an interview with CNN : “Let's just be real clear - the game is rigged and it's rigged in favor of those who have money and who have power,” like Elizabeth Warren. \\nMiddle Class – Poor – Workers of the World Unite - Rigged – Check \\nThere are many more examples of the democrats and liberals in general (redundant) whining of this ethereal system being rigged against every constituent group under their umbrella , that I would be remiss to not mention the seminal complaint of all the left. The system has been and will always be rigged against blacks – particularly the justice system. \\nEverywhere in America, according to the left, are examples of a rigged justice system, where blacks, minding their own business, are rounded up, arrested, and summarily shot. So rigged is the system , that “George Washington University law professor Paul Butler, who is a former federal prosecutor, has suggested the remedy ought to be widespread jury nullification. ‘It is, in fact, the moral responsibility of black jurors to emancipate some guilty black outlaws.’” \\nBlacks – Social Justice – Rigged – Check \\nWith all this “rigging” going on, maybe the only fair thing to do is allow Hillary and her minions to do whatever they must to win, thus righting some of the wrongs of the rigged system. It should be our moral responsibility to emancipate some guilty democrat outlaws. \\nDemocrats lying and cheating on camera – Dead People Voting – Illegals Voting – Election not Rigged – Check. shares\""}, "time": 1742563492.525219}