{"duration": 0.047824859619140625, "input_args": {"text": "'Nigel Farage has said the UK should adopt Donald   “extreme vetting” after the Westminster attack, but not follow Geert Wilders’ plan “for an entire religion to be outlawed” as that will “alienate” moderate Muslims. [“I’ve long taken the view we should be deeply intolerant of sharia law,” the former UKIP leader told Australia’s ABC News.  “But I’ve also long taken the view, that if you go down the route of say in The Netherlands, who says he wants in that country for all the mosques to be closed for the Quran to be banned and for an entire religion to be outlawed, then we will lose. ” He said such policies will “alienate the 80 per cent who are with us” adding: “We have got to try to get [moderate Muslims] on our side. ” Geert Wilders, the leader of the Dutch Party for Freedom, argues that there is little distinction between Islamism, radical Islam, and mainstream Muslim beliefs. Mr. Farage, however, said the difference in the spectrum of Islamic beliefs is great  —   larger than that between moderate Muslim beliefs and Western belief systems. “Let’s be honest: this division, actually, is in some ways less between the Muslim and the Christian community, than it is a division within the Muslim community,” he said. “There is a percentage of people within the Muslim faith in this country who have sympathy with [Islamic State] but the vast majority don’t,” he added. pic. twitter.   —   Geert Wilders (@geertwilderspvv) March 26, 2017,  Mr. Farage also defended his statement that the Westminster terror attack was further evidence of the need for a temporary travel ban from some   states. “If you’ve got a problem already, why on earth would you add to it?” he said. “I want us to have extreme vetting. Of course, why wouldn’t you?” The Westminster attacker was indeed born in the UK, but a travel ban “might stop the next one” he said, However, the distinct problem of “  Islamic terrorism” and radicalisation happening in schools, prisons, and online must also be tackled, he said. “We have been, franking, cowardly with dealing with the divisions within out communities,” Mr. Farage said. “We’ve got to get rid of this failed doctrine of multiculturalism. What that meant, is that we have encouraged division within our communities rather than integration and unity. ”'"}, "time": 1742562120.3636847}