{"duration": 0.11803793907165527, "input_args": {"text": "'November 19, 2016 -  By Eduard Popov for Fort Russ - translated by J. Arnoldski -  \\n\\n\\nThe other day, the disturbing news came from Lvov, the unofficial capital of Ukrainian Galicia, that the Lvov regional council has filed a lawsuit to forcibly evict the Pushkin Russian Cultural Center. As the head of the regional council, V. Girnyak, said in his statement, organizations tied to the Anti-Terrorist Operation are preparing to transfer the building on Korolenko Street. The Lvov deputies hardly expect to earn more money from these “ATOers.” Rather, the eviction of the Pushkin Russian Cultural Center is explained by a different motive: once again punishing anyone ideologically representative of “enemy” Russian culture. \\nThis center’s building was leased to the Russian community of Lvov in 1990. In 1999, the then mayor Vasiliy Kuybida, set the symbolic rent fee of 5 hryvnia (around $1 back then).  \\nLet us quote one founding document signed by Ukraine, the Treaty on Friendship, Cooperation, and Partnership between the Russian Federation and Ukraine from May 31st, 1997. Point 12 of the agreement reads: “The High Agreeing Parties shall protect the ethnic, cultural, linguistic, and religious identities of national minorities on their territory and create conditions for the fostering of their identity….they will contribute to creating equal opportunities and conditions for studying the Russian language in Ukraine and the Ukrainian language in the Russian Federation, training pedagogical staff for teaching these languages in educational establishments, and for these purposes provide equal state support.”  \\nPoints 1-2 of the agreement are based on the recognition of the friendly relations between the countries and their territorial integrity. Hence why the agreement is often called a border treaty. For Ukraine, whose territorial sovereignty over some territories (including Galicia, which was part of the Second Polish Republic until September 1939) is quite disputed, this agreement was a real gift. It is no coincidence that a number of patriotic politicians in Russia demanded that this document not be signed.  \\nRussia’s recognition of Kiev’s sovereignty over territories included in the Ukrainian state is founded on Ukraine’s observance of the rights of its Russian-cultured citizens. After the coup d’etat in 2014, Ukraine began pursuing a policy of cultural genocide (ethnocide) against the Russian-cultured population. Now Ukraine is discussing the initiative of the scandalously infamous politician Irina Farion to deprive Russian residents in Ukraine of civil rights. In fact, this measure is already being implemented. The number of Russian schools has rapidly declined while Russian organizations are being prosecuted and their activities are under close surveillance by Kiev’s intelligence services. \\nIn accordance with the 1997 treaty, an entire network of federal and regional organizations of Ukrainians is funded in Russia . For example, in the Rostov region there is a city-level and regional national-cultural autonomy of Ukrainians. The organization receives funding from the city and regional budgets. Its head, the businessman Makarchuk, is a member of the Public Chamber of the Rostov region and is proud of his friendship with Rostov governor Vasili Golubev. Meanwhile, Makarchuk is published on the website of the Ukrainian neo-Nazi Svoboda party and frequently makes Russophobic statements. \\n\\nUnfortunately, Russia is largely to blame for the fact that the civil rights of Russian-cultured people in Ukraine are being massively violated. An example of this is the patronizing policy of the Rostov region authorities. But on the federal level as well, the state does not have sufficient (or any at all) efforts to defend the Russian population of Ukraine (nearly half of the country’s total population).  \\nMeanwhile, a more responsible attitude towards obligations would lead to a discussion on the 1997 treaty. In a situation in which the second country (Ukraine) massively violates the treaty’s basic premises, then Russia has the right to withdraw from the treaty with all the legal and political implications. I see no reason for the Russian budget to support the activities of Ukrainian organizations in Russia or recognize the territorial sovereignty of Ukraine. \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742563973.1327589}