{"duration": 0.07977962493896484, "input_args": {"text": "'The West’s Media Delusions November 23, 2016 \\nExclusive: The U.S. mainstream news media often holds itself out as the world’s gold standard, home for careful reporting and diverse opinions compared to Russia’s monolithic propaganda, but the reality is quite different, says James W Carden. \\nBy James W Carden \\nIn a wide ranging and necessary survey of Russian political programming , Dr. Gilbert Doctorow, himself a frequent guest on those shows, observes that: \\n“The charges — that Russian media are only an instrument of state propaganda directed at the domestic population to keep Russian citizens in line and at foreign audiences to sow dissent among Russia’s neighbors and within the European Union — are taken as a matter of faith with almost no proofs adduced. Anyone who questions this ‘group think’ is immediately labeled a ‘tool of Putin’ or worse.” MSNBC host Rachel Maddow. \\nDr. Doctorow has launched an important conversation in light of the release of yet another alarmist media report , this time by a British neoconservative group named (oddly) after a long deceased Democratic Senator from Washington State (Henry “Scoop” Jackson), which seeks to stifle debate on Russia policy in the West by smearing dissenters from the Russia-bashing conventional wisdom as “Putin’s useful idiots.” \\nDoctorow’s experience with the Russian media therefore serves a double use: to combat willful Western misconceptions of the Russian media landscape as well as to serve as a useful point of comparison with U.S. media outlets and their coverage of Russia. \\nIf we take the example of the purportedly liberal cable news outlet MSNBC, we find, paradoxically, that the hard-right neoconservative stance toward Russia goes virtually unopposed. Regarding Russia, in comparison with their principal center-left cable news rival CNN, which, to its credit occasionally makes room for the minority “detente” point of view, MSNBC leaves about as much room for dissent as the Soviet-era Pravda – actually, perhaps less. \\nNew McCarthyism \\nAs it happens, there was a similar disparity when it came to the way the two networks covered the U.S. presidential election. While CNN went about bringing much needed balance to its coverage, albeit in the most inept way possible – by hiring paid flacks from each of the campaigns to appear alongside actual journalists, MSNBC (like Republican rival FOX News) wholly dispensed with any pretense of objectivity and served as little more than as a mouth piece for the disastrous Clinton campaign. Sen. Joseph McCarthy, R-Wisconsin, who led the “Red Scare” hearings of the 1950s. \\nAs such, the “liberal” network found itself in the vanguard of the new McCarthyism which swept the 2016 campaign, but which has, in fact, been a feature of the American debate over Russia policy since at least the beginning of the Ukraine crisis in late 2013 – if not earlier. \\nExamples abound, but perhaps the most striking case of the neo-McCarthyite hysteria which MSNBC attempted to dress up as its legitimate concern over U.S. national security was a rant that Rachel Maddow unleashed on her audience in June when Maddow opened her show with a monologue dedicated to the proposition that Donald Trump was in league with Vladimir Putin. \\nMaddow, in her signature smarter-than-thou tone, informed readers that the “admiration” between Putin and Trump “really is mutual. I mean, look at this headline, ‘Putin praises Trump. He`s brilliant and talented person.’ ‘Putin praises bright and talented Trump.’ ‘Vladimir Putin praises outstanding and talented Trump.’ There was some controversy over how to exactly translate Putin`s remarks, but Putin took care to flatter Donald Trump publicly, exactly the way Donald Trump likes to be flattered, and that`s apparently enough for Donald Trump, that`s all he needs to hear, that`s all he needs to know, to tell him, how great Vladimir Putin is. \\n“Putin likes Trump, he must be smart, must be great. So, that is the very, very unusual context here, that you have a Republican presidential nominee who is very, very susceptible to flattery. It`s the most powerful thing in the world to him. If you compliment him, he will never forget it and that`s kind of all he needs to know about you.” \\nMaddow went on in this vein for quite a while longer (meaning: little actual content but lots of “very, very’s” and eye-rolling). But her central insight, such as it was, was little more than a regurgitation of Democratic National Committee talking points. To no one’s surprise, Maddow’s accusations were repeated almost verbatim in the press releases issued by the Clinton campaign which accused Trump of being little more than a Russian fifth columnist. \\nMaddow’s evidence-free, innuendo laden June rant took on an added importance because she was the messenger. After the risible, self-important sports journalist Keith Olbermann left the network in 2011, Maddow took over as the network’s house intellectual. So her words carry weight with its viewers in a way, say, Mika Brzezinki’s do not. \\nNevertheless at no point at which I am aware did Maddow ever host a guest who pushed back against the still unproven charges that the Russian government had interfered in the U.S. election or that Donald Trump was, in the words of former CIA functionary Mike Morell, an “unwitting agent of the Kremlin” – never mind that as recently as Nov. 15, Senate Foreign Relations Committee Chairman Bob Corker admitted he had “no proof” of Moscow’s interference in the U.S. election. \\nWhile it is unclear whether MSNBC’s Joy Reid is seen as “serious” a voice as Maddow, it is unquestionable that she has emerged as the network’s most enthusiastic practitioner of the new McCarthyism. \\nDays before the election Reid hosted Newsweek’s increasingly unhinged Kurt Eichenwald and former Naval officer Malcolm Nance who has repeatedly and without evidence claimed the Wikileaks-Podesta emails were fake. \\nWhy, asked Reid, are the Russians backing Trump? As if that assertion was beyond dispute. Well, said Eichenwald, “They hate Hillary Clinton…” Oh. Reid then went on to wonder why the FBI is down-playing the intelligence community’s allegedly deep concern that Russia was interfering in the election. \\nPutin-Bashing \\nDays later, right after the election, Reid re-assembled a panel featuring Nance, the reliable Putin critic Nina Khrushcheva and Esquire’s Charles Pierce to reinforce the message that MSNBC had been pushing since the summer: that the Russian government had its hand on the scale of the U.S. election. Pierce, in particular, was apoplectic. Russian President Vladimir Putin. (Russian government photo) \\nThat Reid’s roundtable featured Pierce made a good deal of sense. Throughout the campaign, Pierce has been determined to draw a direct link between the Trump campaign and Putin. A sample of his output helps tell the tale. On July 24, Pierce published “Donald Trump’s and Vladimir Putin’s Shared Agenda Should Alarm Anyone Concerned About Democracy” in which Pierce speculated that “Trump seems increasingly dependent on money from Russia and from the former Soviet republics within its increasingly active sphere of influence.” \\nIn his offering of Sept. 9, Pierce protested that “It’s not ‘red-baiting’ to be concerned about Russian interference in our elections.” Pierce, perhaps moved to madness by The Nation editorial “Against Neo-McCarthyism,” sounded as though he were channeling the ghost of James Jesus Angleton, asking, “Are we supposed to believe that Donald Trump really went on RT television by accident ? That nobody on his staff knew that the Russian government’s American network picks up Larry King’s podcast?” \\nAbout a month before the election, on Oct. 11, Pierce informed readers of the once-great Esquire, “Vladimir Putin Is Determined to See Trump in the Oval Office.” Still worse, according to Pierce, “ There is little question now that Vladimir Putin is playing monkey-mischief with the 2016 presidential election, and that the Trump campaign is the primary beneficiary of that.” \\nAll of the aforementioned is to demonstrate that the American media’s much touted pluralism is little more than a fiction when it comes to reporting on Russia. The diversity of Left-Right voices on the political spectrum that Doctorow has encountered in Moscow indicates that the widespread perception that Moscow’s political culture is monolithic compared to that of the Washington’s is, at the very least, challengeable. \\nJames W Carden is a contributing writer for The Nation and editor of The American Committee for East-West Accord’s eastwestaccord.com. He previously served as an advisor on Russia to the Special Representative for Global Inter-governmental Affairs at the US State Department.'"}, "time": 1742628450.3082724}