{"duration": 0.07292556762695312, "input_args": {"text": "'Police barricades wrapped around the headquarters at One Police Plaza and other department buildings in New York. Many cities issued new marching orders: no solo patrols. No officers should be alone. In Burlington, Vt. during roll call, some officers blinked away tears. In Los Angeles, the chief did the same. In the break room at a Manhattan precinct house, officers  —   behind closed doors, comfortable among themselves  —   debated what they saw on the videos of the recent fatal police shootings in Louisiana and Minnesota. Some said race had played a role. Others, one officer said, “put on blinders. ” A rookie officer in Manhattan, five days on the job, texted her mother on Friday. She was on her way to work at a protest. A protest against the police. And a Queens detective quietly seethed. “This is insanity,” said the detective, speaking on the condition of anonymity because he was not authorized to do so publicly. “It’s just freaking horrendous. ” Reactions to Thursday’s deadly ambush in Dallas swept through   rooms and squad cars in police departments across the country. Contempt for the shooter was universal. But behind it followed other, varying observations about what it means to be a police officer in 2016, with the attending fears and frustrations, and amid a seemingly growing gulf between the police and the policed. “We have broken into tribes,” Charlie Beck, chief of the Los Angeles Police Department, told a class of cadets who graduated on Friday. “All of a sudden it becomes more important who your parents are, what the color of your skin is, than whether you are American. ” “This is not about black lives, or brown lives or blue lives,” he added. “This is about America. ” Police culture all but forbids one officer from publicly criticizing or   the actions of others. For that reason, officers interviewed on Friday would not comment directly on the videos taken during and immediately after the shootings in Louisiana and Minnesota. But one fact was clear: When a new video showing what appears to be police misconduct surfaces, it affects officers everywhere. “One of the worries that cops have is that no cop can control what another cop does, but all cops will be judged by what the other cop does,” Chief Brandon del Pozo of the Burlington Police Department said. “We’ll sit there in the   room, watching police videos all over the country, trying to make sense of what we’re seeing and trying to make sure we’re doing the best job we can. ” There is much to watch. “Any time there is a traffic stop made, the cellphones come out,” said George Hofstetter, president of the Association for Los Angeles Deputy Sheriffs. “The people taking them out have nothing to do with the incident, but they feel the need to videotape it. It’s like they think, ‘I am not going to stand across the street, I am going to become part of the problem. ’” Chief del Pozo echoed that thought. “On top of all the legitimate issues in policing,” he said, “street cops worry that there are people looking to foment confrontation to generate the next headline in situations where people just sort of complied before. ” Officers, privately, do not march in lock step after watching videos, the Queens detective said. “There are people that are like, ‘Oh, the cop’s right,’” he said. “I’m not one of those people. It is what it is. ” But he said he had often perceived a rush to judgment after the release of a video and “the fanning of the emotions. ” Officer Pedro Serrano, a   veteran of the New York Police Department, said that as a Hispanic he could sympathize with the anger felt by members of minority groups after shootings like those in Louisiana and Minnesota. “Growing up, I hated the police,” he said. “They abused me for no reason. It’s just because I was in the neighborhood and a person of color. ” It was in the break room at his precinct house on Friday that officers debated what was on the videos. “I work with people who are afraid of people of color, they jump with conclusions,” Officer Serrano said in an interview. “When you take that   into policing you can make very bad decisions. ” At the same time, he said that he worried, particularly in light of the killing of the five officers in Dallas, that anger at the police could push some people to take things too far. “Everything that happened recently is not going to be good for us because they’re going to basically say all cops are bad,” he said. “I know that they, the people who go over the top with the protesting, I know they don’t see me for who I am. They see my uniform. ” Another New York City detective, based in the Bronx, said he was not an apologist for officers committing wrongdoing. He said he had not seen the latest videos, but added that such footage was rarely, if ever, complete. “I’ve been there when cops have shot perps,” he said. “Everything happens so quickly and you have just a moment to life or death, to living or not getting up tomorrow, or your partner being dead. It’s so much easier when you can watch a video over and over. It’s one thing to be in the safety of your own living room or watching on your electronic device, to being there. ” The emotional whiplash on Thursday  —   police officers branded as villains, and then seen as victims, in a span of seconds  —   recalled New York City in 2014, when a gunman claiming to be motivated by anger at the police ambushed two officers, Wenjian Liu and Rafael Ramos, in their patrol car in Brooklyn. Yet, for some, the events leading up to the shootings in Dallas seemed without precedent. For Officer Joe Nocella, a   veteran of the Nassau County Police Department, those killings signified the start of a new era in policing. “Sniper fire against a police officer,” he said. “I don’t think that too many cops across the country could have put a thought in their head that something like this could happen. ” Veteran officers suggested otherwise. Some remembered wearing their uniforms in the 1960s with a fear of assassination by militant attackers. “I came on the job in the late ’70s, and that was still fresh on everyone’s mind,” Edward Davis, a former Boston police commissioner, said. “We then moved to a much better place. But now some of those feelings have crept back in the conversation. ” The Bronx detective put it more bluntly. “It’s always been a bad time to be a cop in this city,” he said. “The cops before me, in the 1970s? They had homegrown terrorists ambushing cops. You had the Weather Underground building bombs to blow up police stations. You had antiwar protesters throwing Molotov cocktails at cops. ” Though he has long worked in a detective’s suit and tie, he said he would not hesitate to leave his home in uniform. “I’m proud of my uniform,” he said. “I’d wear it anytime, anywhere. ” The Queens detective said that feeling like a target was natural to men and women in uniform. “You should always have it in the back of your mind,” he said. “Nobody comes to work thinking, ‘I’m the guy who gets killed today.’ But everyone knows that’s the risk. ” The events in Dallas heightened that sense. “That they could literally be hunted,” the Queens detective said. “That’s what happened. Like a hunter in a tree stand with a gun, lying in wait to shoot prey. ” On Staten Island, a commanding officer said he would make a special announcement at his afternoon roll call: “Be safe. Be vigilant out there. ” In Times Square, a uniformed officer watched traffic on Seventh Avenue. “People want to get angry and everything,” he said. “We’ve just got to keep doing what we do. ”'"}, "time": 1742628502.5852041}