{"duration": 0.06344103813171387, "input_args": {"text": "'The Supreme Court affirmed the Court of Appeals for the Federal Circuit Monday, holding that a law prohibiting “disparaging” trademarks violates the First Amendment. [The unanimous Court in Matal v. Tam struck down a provision of the Lanham Act, the main law on trademarks, that barred the Patent and Trademark Office from issuing any trademark protections to marks that “may disparage   …     persons, living or dead, institutions, beliefs, or national symbols, or bring them into contempt, or disrepute. ”  This case concerned a rock band called the “The Slants,” a reference to the racial slur for Asians. When Simon Tam, the band’s   frontman, tried to register his group’s name with the trademark office, he was told he could not get a valid trademark because the name was offensive to Asians. Before the Court, Tam’s attorneys argued that his intention was to “reclaim” the term “slants” and subvert its offensive potential. The   provision, 15 USC §1052( a) has rarely had any practical effect, but has come to public notice in recent years as   advocates and public officials sought to use it to invalidate “offensive” trademarks. Most prominently, the Washington Redskins football team, who have twice had their trademark protections revoked for having a name that “disparages” American Indians. Writing for the Court, Justice Samuel Alito reasoned that the entire purpose behind the provision rendered it facially unconstitutional. “It offends a bedrock First Amendment principle: Speech may not be banned on the ground that it expresses ideas that offend,” he wrote. In contravention of this principle, the Patent and Trademark Office devised a test to determine whether a trademark was too offensive for the federal government to protect. If a “substantial composite, although not necessarily a majority, of the referenced group would find the proposed mark . . . to be disparaging in the context of contemporary attitudes,” the trademark could not be registered. This test, by disfavoring a certain subset of speech specifically on the view it expressed, constituted “viewpoint discrimination,” a fundamental limit on government’s power to regulate private speech. The provision was not saved by the government’s arguments that trademark protection was a matter of “government speech” or was a “subsidy” over which the first Amendment did not apply in its broadest sense. “If private speech could be passed off as government speech by simply affixing a government seal of approval, government could silence or muffle the expression of disfavored viewpoints,” the opinion reads: Holding that the registration of a   converts the mark into government speech would constitute a huge and dangerous extension of the   doctrine, for other systems of government registration (such as copyright) could easily be characterized in the same way. A concurring opinion by Justice Anthony Kennedy and joined by the Court’s more liberal justices, called the policy “the essence of viewpoint discrimination,” and determined there was no need to even consider the government speech and subsidy arguments. The same law was held unconstitutional on the same grounds by an en banc panel of the Federal Circuit in 2015. The government, then represented by   Solicitor General Donald Verrilli, petitioned to the Supreme Court in a last attempt to save the law. Monday’s ruling by the nations highest court cements the end of the seldom enforced provision.'"}, "time": 1742563581.5904477}