{"duration": 0.060149431228637695, "input_args": {"text": "'In “Star Trek Beyond,” the third film in the reimagined “Trek” universe, the helmsman Hikaru Sulu has a husband and a young daughter  —   but don’t expect the crew of the Enterprise to be as surprised as some fans were by the news that Sulu is gay. “In the film, his family was portrayed really nonchalantly, which I liked,” said John Cho, 44, who has played Sulu since 2009. “He wasn’t coming out of the closet. ” Mr. Cho hopes the revelation of Sulu’s sexual orientation, while not a major focus of the movie, proves encouraging to young fans. He likens it to his own experience as a young Korean immigrant in Houston, watching “Star Trek” for the first time and homing in on the Asian character. “Seeing George Takei on television was very meaningful to me, and I hope there’s a similar effect for gay kids watching,” he said. Previously best known for a title role in the “Harold and Kumar” movies, Mr. Cho has lately been seen gracing many popular movie posters  —   not just for “Star Trek”  —   thanks to a social media campaign started without his knowledge that imagines him as Captain America, James Bond and other   characters. Earlier this month, Mr. Cho, who was in London for work, spoke by phone about “Star Trek Beyond” (due in theaters on Friday, July 22) his surprise at the success of #StarringJohnCho, and why worrying about the challenging reality of being an Asian actor in Hollywood isn’t good for him as an artist. These are edited excerpts from the conversation. My condolences over the loss of your friend and “Trek”   Anton Yelchin. Thank you. He was a special, special kid. We just loved him to pieces, and it’s been very difficult. He was so young. The cast has been together a lot, and we’ve found that as comforting as it can be, under the circumstances. George Takei recently said he was glad there was a gay “Star Trek” character, but he didn’t think it should be Sulu. What did you think when you learned about the decision to write Sulu as gay? It was my understanding that George Takei’s Sulu was heterosexual. We have an alternate timeline in our “Star Trek” universe, but it’s the same genetic Sulu. So I was concerned that people would think we were saying that sexual orientation was a choice and not predetermined. I was also concerned that since it was a bit of a homage to him, George would say, “I’m someone who has worked as a gay actor to craft a straight character, and now you’re seeing just my sexual orientation. ” The posture of the filmmakers was that this was normalized in the future and it was nothing, really. It was a big revelation yet handled in a way that communicated it wasn’t anything the crew didn’t already know about him. You mentioned that Mr. Takei was one of few Asian actors you saw growing up. Did the lack of representation affect you? I wish I was strong enough for it not to matter. It does, I have to admit. It still affects me, and not just as an actor. Movies may be as close to a document of our national culture as there is they’re supposed to represent what we believe ourselves to be. So when you don’t see yourself at all  —   or see yourself erased  —   that hurts. The #StarringJohnCho campaign is drawing attention to a lack of diversity onscreen. How did you feel when you saw it? My first reaction was, are they clowning me? I quickly realized it was sincere, and it was kind of amazing. Maybe [it caught on] because the posters made it seem possible. Instead of talking about it or demanding it, it was like, listen, it could be like this. For a minute, people were talking about it in a very serious way. You’ve talked about facing racism in your professional life, not taking roles that rely on stereotypes. You’ve had to think about these issues in a way white actors don’t. You might hear something along the lines of “They’re not going Asian on this role, because there’s another Asian in the cast,” which is something you’d never hear if you were white. At this stage of my career, it’s more oblique. It can be harder to maneuver your way into the discussion for bigger roles. I get tired of talking about this. I get tired of living with it. The more I have to think about this, the more it makes me feel more like a politician and less of an artist. In the long run, that’s not good for me or anyone else. I don’t like when an   actor says, “I’m entering this business to change Hollywood. ” It feels like the wrong reason  —   I would prefer they entered the business for artistic reasons, because they need to do it. I used to get offered roles, and if I felt they were a stereotype, I would [ask] my Korean friends, “What do you think of this?” I would go through these exhausting mental hoops, arguing both sides in my head, picturing this imaginary   council judging the role. I spent so much energy on that. Now I’m older, and I’m thinking, that’s not healthy! It’s antithetical to the artistic impulse. Actors are supposed to be these runaways that get in a covered wagon filled with hats and tambourines and go from town to town making people smile. Though it’s logical and necessary to think and talk about all of this, it’s a bummer as an artist to have to do it all the time. What are some roles you’d love to take on? I’d love to do a Shakespearean role onscreen. There are some radical things I’d like to do. I’d like to be in a western. I’d like to be ultraviolent onscreen it’s completely different from anything I’ve done. Because I sidestepped all the stereotypical roles, in a way I’ve made a career out of not being Asian  —   a lot of my roles weren’t written as Asian  —   so there’s an impulse in me that wants to take a   and play a very grounded, real Asian character, maybe an immigrant. I’m also tuned in lately to my parents’ generation, thinking about their mortality and all the history that will go with them. I’ve wanted to do a project and record   kids interviewing their parents and grandparents, so we can preserve stories of the Korean diaspora. I guess it’s part of getting older and having kids, you think more about that kind of thing. What are you working on next? Right after this, I’m doing a   movie about a Korean man visiting his father, who has fallen ill in Columbus, Ind. He meets a woman, and they’re both mourning their parents in different ways there’s an interesting relationship. The announcement hasn’t been made, so I can’t talk about it in detail yet, but I’m also acting in and producing a drama in the cable space. What do you like to do when you’re not acting? It’s more like, what do my kids want me to be doing? [My wife, the actress Kerri Higuchi, and I] have two kids, 8 and 3. I have this fantasy of just being left alone for a week, so I can clean out the house and garage.'"}, "time": 1742628572.2367017}