{"duration": 0.0346684455871582, "input_args": {"text": "'Share on Twitter \\nEarlier this week, someone claiming his name was Jamie Otis vandalized Donald Trump\\'s star on the Hollywood “Walk of Fame.” \\nHe pretended to be a construction worker, and attacked the terrazzo and cement star early Wednesday morning with a pickaxe and a sledgehammer. Donald Trump\\'s Walk of Fame star destroyed, police investigate https://t.co/xFfCOdz1iZ pic.twitter.com/qJOsbbjTHp — FOX & Friends (@foxandfriends) October 27, 2016 \\nWhile police searched for Otis, who is likely to be charged with a felony, the star was surrounded by caution tape. Police have monitored the scene as well. But for one homeless woman, that wasn\\'t enough ... \\nThe unnamed woman now stands guard at the star, protecting it from further damage and showing her support for Trump through a number of handwritten signs: Very powerful!Homeless Trump Supporter guards Trump\\'s star on Hollywood Blvd... \"20 million illegals and Americans sleep on streets\" pic.twitter.com/XsDmiMCUNs — America First! (@America_1st_) October 27, 2016 \\n“20 million illegals and Americans sleep on streets in tents.” Homeless woman guards Trump\\'s Hollywood star, surrounded by iPhone &sack of cheap Forever21 clothes, all foreign-made. — Deplorable KYGrifter (@KyGrifter) October 27, 2016 \\n\"Did Hillary have sex with that woman senator Weiner\\'s wife. \\nCan Americans go to Mexico for jobs housing medicine.\" A homeless person guards Trumps star in Hollywood. Even the homeless love Trump. #AmericaFirst #MAGA pic.twitter.com/s4sJ1rNElO — Deplorable Vet (@KGBVeteran) October 27, 2016 \\n“You racist mother-f**kers vote Trump.” — Apafarkas Agmánd (@ApafarkasAgmand) October 27, 2016 \\n“U mother-f**kers know!!! Take care home first. Vote Trump. F**k Mexico.” — Sunflower Girl (@X5MSport15) October 27, 2016 \\nAccording to the LAPD, vandal James Otis was arrested on Thursday. ABC News reported that Otis — heir to the Otis Elevator family and grandson of the man who invented Listerine — remains unapologetic for his actions. He gave a brief statement with his attorney present: \\n\"I\\'m not at all ashamed of what I\\'ve done. What Mr. Trump has done is he\\'s derailed the entire election. I got so upset. I got so frustrated and angry and that\\'s why I did this. \\nI admitted my mistakes. And I\\'m now dealing with my consequences. Unlike Mr. Trump who has never admitted what he\\'s done.\" \\nOtis also claimed that his intent was to auction off the Trump nameplate after he removed it from the sidewalk, giving the proceeds to the women that Trump has allegedly sexually assaulted. However, he was forced to return the nameplate upon his arrest Thursday. '"}, "time": 1742628313.2830095}