{"duration": 0.1049802303314209, "input_args": {"text": "'SIREN: WASHINGTON TO LOSE ITS DAILY BARD AT A MOST UNCERTAIN TIME: MIKE ALLEN WILL STOP WRITING POLITICO’S MORNING PLAYBOOK COLUMN MIDCAMPAIGN, on July 11  —   A Guide to Capital Intrigue Through Entire Obama Era and Part of W. Bush’s  —   MILLENNIAL TAKEOVER: Politico Young Guns ANNA PALMER, JAKE SHERMAN and DANIEL LIPPMAN Grab the Baton  —   CHANGES IN STORE FOR A NEW ENVIRONMENT  —   Times Subscription Deal: 50 percent off for a year! DRIVING THE COLUMN If information is the lifeblood of Washington, the Politico writer Mike Allen’s Playbook forms the veins. Pumped out by email every morning, it is where the most influential political operatives in the United States send tidbits or bigger news scoops that they hope will give them the edge in the D. C. skirmish of the week, month or year (and sure, maybe settle a score or two). They do so because it’s what 100, 000 insiders, outsiders, lobbyists and journalists, governors, senators, presidents and   presidents read every morning of the week to be in the know, or, in some cases, to see their own names in print. If they say they do not look for it in their inboxes in their first waking minute, they are lying. Even if you’re not one of these addicts, it reaches you, too, because the distillation of what Mr. Allen considers the most vital news items of the day can influence the thinking of television news producers and Mr. Allen’s rival national political reporters, sometimes in a   way (especially when Mr. Allen has included their work in his list of TOP TALKERS) and occasionally in an   way (especially if he has dismissed their work as    USED NEWS). THE CONVERSATION Mr. Allen’s Playbook provides a daily sense of cohesion for a town at war with itself. Along with important news items, Playbook lists birthdays, births and swanky parties where Republicans and Democrats manage to hold hostilities in check for a couple of hours. It can also carry the whiff of   coziness, pack journalism and clubbiness that pervades our capital city, contributing to Washington’s case of acute  . But that also goes with its role as official D. C.’s village square. The central element of its success has been the frenetic mind of Mr. Allen, who is preparing to start an undisclosed media venture with his Politico colleagues Jim VandeHei and Roy Schwartz. DATA DU JOUR Monday will be the 3, 285th consecutive edition of Playbook. Mr. Allen has written all but eight (Hat Tip: Peter Cherukuri). FLASHBACK “The Man the White House Wakes Up To,” by Mark Leibovich New York Times Magazine, cover, April 2010. “He bursts in and out of parties, at once manic and serene, chronically toting gifts, cards and flower arrangements. . .. It is as if Mikey is the host of one big party, and by showing up anywhere in Washington, you have served the Playbook community and are deserving of the impresario’s thanks (or “Hat Tip” in Playbookese). . .. Allen was the first reporter hired by Politico’s founding editors, John F. Harris and Jim VandeHei, when they left The Washington Post to start the website and newspaper in 2006. He is considered a Politico ‘founding father.’   …     He speaks in quick and certain cadences, on message, in sound bites. ” Playbook reads in the clipped rhythm that Mr. Leibovich describes, with big, bold headlines, ellipses and em dashes. It separates its items with headings like DRIVING THE DAY, FLASHBACK,   and SIREN (a homage to the internet news titan Matt Drudge) and others that I’m imitating here. What can’t be imitated is the intimacy Mr. Allen has with his audience. THE MONEY, HONEY  Politico found dollars in that intimacy. Big corporations with big business pending in Washington  —   Comcast, BP, the United States Chamber of Commerce  —   take Playbook sponsorships that come in the form of paid items that are marked with asterisks and laid into the flow of the newsletter. Such arrangements, which have at times drawn media criticism for blurring journalistic lines, bring in about $55, 000 a week, an executive vice president, Mr. Cherukuri, told me. Playbook also provides the mother ship with a platform to promote itself, through the newsletter (which I mimicked at the top  —   50 percent off   journalism! ). It all makes Mr. Allen’s departure from Playbook kind of a sensitive deal for the company. ODD TIMING (?) The timing of Mr. Allen’s Playbook retirement  —   in the middle of a presidential election for the ages  —   is unexpected. But Mr. Allen told me on Friday that he agreed with Mr. Harris, the editor in chief, that “2017 effectively begins now, so this is the perfect time for the new team to get airborne. ” Mr. Allen will continue writing for Politico through the election. It does make some sense it always seemed odd that Mr. Allen, 51, would carry on in his   role while a new venture beckoned and the team forming to succeed him was eager to make a splash. Inside Politico’s sleek new offices in Arlington, Va. on Thursday, Mr. Harris asked me, “How do you replace Mike? The answer is you don’t replace Mike. ” These days, brands can be more important than the news organizations they are attached to. Can Politico replicate Mr. Allen’s success at Playbook? Mr. Harris said that it could and that if Politico’s business was to be “scalable,” a franchise like Playbook  —   now with geographically targeted versions in places like Miami and Brussels  —   cannot be built around “a singular personality. ” He added: “I’m not sure anybody else could have invented the franchise, but he’s shown other people how to do this job and how to own this space. ” WHO THEY ARE Anna Palmer, 34, and Jake Sherman, 30, frequently write together as a team  —   they helped break open the scandal that forced the resignation of Representative Aaron Schock of Illinois in 2015  —   and pitched themselves to Mr. Harris as natural   of Playbook 2. 0. (CNN Money reported they were in the running in April.) Mr. Sherman has covered Capitol Hill for Politico since 2009. Ms. Palmer has covered Congress and was a   of Politico’s newsletter specializing in lobbying, called Politico Influence. Daniel Lippman, 26, who has been helping Mr. Allen with Playbook since 2014  —   and is a peripatetic emailer and   himself  —   will assist them. SNEAK PEEK Playbook was built to meet Politico’s vow to “own the morning,” and to be “delivered by automatic email” to the BlackBerry, as it proclaimed at its start in 2007. The new version will be made for today’s smartphones, with color and items that can be shared more easily on Twitter and Facebook. A standing Playbook home page, to be introduced later, will update throughout the day. Mr. Lippman will bring continuity from Mr. Allen’s tenure. Ms. Palmer is interested in “the changing roles for women in Washington and women in politics  —   they’re chiefs of staff and leaders on the Hill, and Playbook needs to reflect that. ” Mr. Sherman says the goal is “expanding the ecosystem of Playbook.   …     We’re of a generation that is coming up and is grabbing control of power in Washington   …     the   to    who are running the town now. ” GAME CHANGE Just when Donald J. Trump and the populist forces he represents are upending Washington’s established order, the town is losing its daily bard. (“The End of Our Times!” the Bloomberg “Masters in Politics” podcast   Tammy Haddad said, only half joking.) But Mr. Allen, who will continue to practice journalism at his new company, said of his successors, “This is the perfect time for them to step in. ” MIKE ALLEN MIND MELD I can’t wait to “sleep in” until 5 a. m. BIRTHWEEK Mr. Allen turns 52 on Tuesday, June 21.'"}, "time": 1742561760.294516}