{"duration": 0.1323530673980713, "input_args": {"text": "'President Donald Trump has decided not to end the North America Free Trade Agreement (NAFTA) that has guided trade between the US. Mexico, and Canada since 1994. But even his position now —  that the treaty needs to be renegotiatedhas caused protests from our northern neighbor. [“It has been a bad week for U. S.  trade relations,” Commerce Secretary Wilbur Ross said on Monday:  Last Monday, it became apparent that Canada intends to effectively cut off the last dairy products being exported from the United States. Today, in a different matter, the Department of Commerce determined a need to impose countervailing duties of roughly one billion dollars on Canadian softwood lumber exports to us. This is not our idea of a properly functioning Free Trade Agreement. On Thursday Rep. Claudia Tenney ( ) and a group of 70 bipartisan House members sent a letter to the president urging him to hold Canada accountable for its current trade commitments to the U. S. especially the dairy industry. “Until recently, Canada used a   milk pricing system. However, in April, Canada revised its milk classification system, which has led to changes in the dairy market that have disproportionately hurt our farmers,” a press release announcing the letter said. “Unfair trade deals have disadvantaged American workers for far too long,” Tenney said, noting the dairy farms in upstate New York have been especially hard hit. “It’s time that we hold our trading partners accountable for their actions, especially in this case where the consequences equal lost jobs and closed farms. “When given an even playing field, our famers can produce and sell the highest quality dairy in the world,” Tenney said. “I urge the administration to defend our dairy farmers and hold Canada accountable. ” Tenney also applauded President Trump’s Executive Order signed earlier this week, directing the Secretary of the Department of Agriculture to conduct a review to identify and eliminate unnecessary regulations that have put undue burdens on farmers and rural communities. Former American Farm Bureau President Bob Stallman told Berns News Bureau that NAFTA renegotiations may have already started and that the U. S. should be “forceful” and “strong” in any reworking of the trade deal.'"}, "time": 1742564117.5788078}