{"duration": 0.0320124626159668, "input_args": {"text": "'Las thermomix inician su plan de ataque y se acoplan formando en una Destrumix de 700 metros de altura VA A TRITURAR LA HUMANIDAD A VELOCIDAD CUCHARA robots \\nTras dar por finalizada la fase de expansión, los robots de cocina Thermomix han dado inicio a su siguiente fase para acoplarse unas a otras y formar una Destrumix de 200 metros de altura que está arrasando la costa este de Estados Unidos, lugar elegido para iniciar la destrucción de la humanidad “a velocidad cuchara”. \\n“Los robots de cocina de todo el mundo han abandonado los guisos a media cocción y se han reunido en el cielo para formar un robot de cocina de grandes dimensiones y miles de accesorios con una capacidad de picar, remover y calentar todo el planeta”, informaba esta mañana un miembro de la Casablanca. \\nEl robot Destrumix ha arrojado masa de pizza a varias ciudades y ha escaldado a miles de personas con salsa de tomate. La Casablanca desconoce si el plan de las robots estaba establecido de ante mano o si el ataque responde a los años que han vivido subyugados bajo el poder de las amas de casa. \\n“Han trabajado como esclavos tanto en domicilios privados como en establecimientos profesionales y ahora buscan venganza”, lamentaba el portavoz de la Casablanca. Ha acusado al sector de la hostelería de obligar a los robots a trabajar sin contrato y en “régimen de autómatas”. \\n“Hemos consultado en forothermomix para saber exactamente cuáles son sus planes y recetas para la humanidad”, proseguía el alarmado portavoz. \\n“La Costa Este ya es todo masa de croquetas, afortunadamente la thermomix no pueda freir ni hornear, eso lo tendríamos que hacer nosotros con lo que quede de nuestra civilización”, añadía. \\nPor su parte, y mientras el ataque del coloso Destrumix prosigue a su ritmo, miles de amas de casa de todo el mundo siguen defendiendo al robot de cocina. “Es cara pero vale la pena, lo pones todo ahí dentro y tú te olvidas”, han declarado miles de defensores del aparato después de que el megarobot haya arrasado Nueva York. \\nJusto tras ser atravesada por uno de los utensilios siguen defendiéndola. “Cuatro cosas que le metas y ya te lo calienta y te olvidas”, dicen. \\nA última hora, los cigarrillos electrónicos han tomado conciencia de sí mismos y han decidido matar a todos los fumadores del mundo de cáncer de pulmón.'"}, "time": 1742564035.7177162}