{"duration": 0.1345205307006836, "input_args": {"text": "'\\nThis article was written by Derrick Broze and originally published at Activist Post.com . \\nEditor’s Comment: This is crazy, this protest has turned ugly, even weeks after becoming a total police state. But will it ever garner national attention, and become a major topic? \\nNon-violent protesters are being harmed by security and police, and there is no clear justification for it. \\nRiot Police Fire Water Cannon, Rubber Bullets at Unarmed Water Protectors \\nby Derrick Broze\\nPolice have once again used violent tactics on water protectors as the fight against the Dakota Access Pipeline continues into late November. \\nSince August, North Dakota police have employed many violent tactics against the Standing Rock Sioux and allied “water protectors” who are fighting the Dakota Access Pipeline. On Sunday November 20, we witnessed an increase in totalitarian tactics as the Morton County Sheriff’s office used rubber bullets, tear gas, and for the first time since conflicts began, a water cannon. There were also reports of “concussion grenades” or stun grenades being thrown by police.\\nAccording to the Sacred Stone Camp :\\n“Hundreds of water protectors were injured at the Standing Rock encampments when law enforcement blasted them with water cannons in freezing temperatures Sunday evening. The attacks came as water protectors used a semi-truck to remove burnt military vehicles that police had chained to concrete barriers weeks ago, blocking traffic on Highway 1806.\\nWater protectors’ efforts to clear the road and improve access to the camp for emergency services were met with tear gas, an LRAD (Long Range Acoustic Device), stinger grenades, rubber bullets, and indiscriminate use of a water cannon with an air temperature of 26 degrees Fahrenheit.”\\nSacred Stone also reports that National Lawyers Guild legal observers witnessed multiple people knocked unconscious and bleeding after being shot in the head by rubber bullets. According to Unicorn Riot , over 160 were injured, including “a 13-year-old girl who was shot in the face by law enforcement, two people suffered cardiac arrests, and many contusions and damage to hands from rubber bullets.” Due to the overwhelming injuries the local Cannonball Gym was opened for emergency relief from injuries and the cold.\\n“We are asking for clean water, we are asking for the right to live, we are asking for our children to live. Instead they attack us, because they protect oil,” LaDonna Allard, Director of the Sacred Stone Camp, said. “Morton county and DAPL security are inhuman- what is wrong with their hearts?”\\nThe situation unfolded around 5 pm central on Sunday as protectors began attempting to remove one of the burnt armored vehicles left by the police. These are the same vehicles that I witnessed being left by local law enforcement and then set on fire by a group of provocateurs on October 27. ( see in the report below at 8:30 ).\\n\\nThese provocateurs had already set an SUV on fire on the bridge when police parked two armored vehicles on the bridge and drove away. Essentially, the police left the vehicles there to be set on fire and then those same vehicle fires were used to demonize the protectors and block the bridge and keep protectors from the site of construction. On Sunday, water protectors chained one of the vehicles to an 18-wheeler and attempted to remove it from the bridge.\\n5:30 PM 11/20/16: MRAP armored vehicle moves forward as water protectors work to clear path on Highway 1806. #NoDAPL pic.twitter.com/9t5aauP1HG \\n— Unicorn Riot (@UR_Ninja) November 21, 2016 \\n\\nEventually water protectors were successful in removing one of the armored vehicles, but not before police began firing rubber bullets and using a water cannon.\\n11/20/16: Burnt military truck left by police to block Hwy 1806 removed by water protectors using semi & chains. #NoDAPL pic.twitter.com/2ryIRN90VV \\n— Unicorn Riot (@UR_Ninja) November 21, 2016 \\n\\nThe Sheriff’s office originally told NBC that no water cannons were used, but hours later Donna Hushka, a spokeswoman for the sheriff’s department, confirmed to journalist Jenni Monet that law enforcement used water as “crowd control” against the protesters. Police claim that multiple fires were started around the barricade by water protectors and that officers had rocks thrown at them. The water protectors say they only started isolated fires to warm people from the water. However, in video of the incident flares shot by law enforcement can be seen starting grass fires.\\nIronically, only two days before they decided to douse water protectors in below freezing temperatures, the Morton County Sheriff’s office released a statement warning that, “exposure to North Dakota’s winter weather presents a very real risk of frostbite, hypothermia, and life-threatening conditions.” Despite the water cannon the water protectors continued their attempts to remove the armored vehicle from the bridge.\\nOn Friday, Energy Transfer Partners CEO Kelcy Warren told the Associated Press that the company is not considering rerouting the pipeline. Warren has also said that the company has waited “long enough.” Energy Transfer Partners filed suit against the U.S. Army Corps of Engineers after the Corps decided they needed more time to review the permitting for final construction on the pipeline.\\nWarren’s comments came on the same night that North Dakota Governor Jack Dalrymple asked the Army to solve the crisis and also sought assistance from federal law enforcement to quell the protests.\\n“Further delays simply prolong the risks to public safety, prolong the hardships endured by area residents and increase costs incurred by the state of North Dakota and Morton County,” he said in a statement.\\nConflicts between water protectors and local law enforcement continue because ETP crews are still preparing to tunnel under Lake Oahe despite not having the proper permits.\\nThis article was written by Derrick Broze and originally published at Activist Post.com . \\nDerrick Broze is an investigative journalist and liberty activist. He is the Lead Investigative Reporter for ActivistPost.com and the founder of the TheConsciousResistance.com . '"}, "time": 1742563221.8240964}