{"duration": 0.03580737113952637, "input_args": {"text": "'In an interview this week with Town Hall, country music star Justin Moore described attempting to engage with gun control advocates as a “misguided” attempt “to rationalize with irrational people. ”[“Misguided’ is the perfect word. I think ‘misinformed’ is another,” he told the outlet.  According to Town Hall, Moore explained that he sees gun control as a “cop out” by weak politicians as a way for them to blame the gun instead of the criminal who uses the gun for ill. Moore said: Mental health is the real problem. If it wasn’t guns, it would be knives, etc. To blame it on the tool being used, in my opinion, is ignorant. They want to put a   over a gaping wound in my opinion. You’re trying to rationalize with irrational people. It’s impossible. The problem isn’t the NRA, we’re not the ones out there doing extreme things. These comments square perfectly with Moore’s new song “Guns. ” The lyrics of the second verse and chorus provide a clear expression of his view of Second Amendment rights: If there ever was a time we need ’em, I’d say it be today. When we’re letting them terrorists watch cable TVAnd walk out of Guantanamo Bay. I just try to do the right thing and raise my family in this land. Treating me like you want to be treated and that’s what I call a man. If we don’t have ’em, what do we do. Tell me where we gonna go. Somebody breaks into my house, I’m gonna need my Colt forty four, Guns, whether Remingtons or Glocks. Come on man it, ain’t like I’m a slingin’ ’em on the block. I’m gonna tell you once and listen son. As long as I’m alive and breathing, You wont take my guns. Town Hall reported that Moore opened his February 3 Fairfax, Virginia, concert by saying, “I was at the NRA museum today. And if you don’t like that you can get the hell out  —   respectfully. ”   AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742564206.9231784}