{"duration": 0.8675119876861572, "input_args": {"text": "'John Kerry’s Remarks at the Chicago Council on Global Affairs by John F. Kerry Voltaire Network | Chicago | 26 October 2016 Well, good evening, everybody. And thank you, very, very much to Ivo Daalder. Thank you, sir, Mr. Ambassador. And thanks to the Chicago Council for Global Affairs for inviting me here. And a profound thank you to Ambassador Lou Susman for his very generous introduction. And most importantly, Marge and Lou, thank you for many, many years of extraordinary friendship. I really value it. And I think everybody is grateful for the service of both of these ambassadors. Thank you.\\nWith respect to my being here, I have to tell you I was surprised that you guys showed up given the Cubbies. (Laughter.) I figured that – I was surprised at the generous welcome, because I thought the only people who would come would be White Sox fans – (applause) – but I’m pleasantly, pleasantly surprised. More to say about that.\\nIvo is one of our top foreign policy experts of the generation, and I had the occasion to be at his residence in Brussels with President Karzai and the then chief of staff of Pakistan’s armed forces, and we abused his premises significantly for hours while we negotiated. But I’m grateful for the job he did. He was an outstanding United States ambassador to NATO.\\nAnd Lou, folks, if you don’t know it, is a Chicago fixture. He is a former emissary to the United Kingdom to the Court of St. James, a lawyer, a businessman, and as I mentioned, a longtime friend. He is also one of those very irritating people who no matter what he tries he succeeds at it. (Laughter.)\\nSo Ambassador Daalder and Susman, you guys make a great team. And my deepest respects to you, and thank you for continuing with the council in providing leadership. We really appreciate it.\\nTo my former colleague on Capitol Hill, Senator Dick Durbin, to Secretary Bill Daley, to Ambassador Jim Dobbins, members of the consular corps, and to all of you, thank you very much for your warm welcome to Chicago, the hometown of my boss. (Applause.)\\nI’m not saying this for your consumption; I say it anywhere and everywhere. President Obama is going to go down in history as one of America’s significant and most accomplished chief executives. (Applause.) And lucky guy, he’s only in his fifties. He’s got a lot more to contribute to the country, so we’re all lucky.\\nAnd over the years, I have heard President Obama talk a lot about Chicago, as you could imagine. And I am sure he has heard me as a champion of Boston complaining about Chicago’s unconscionable kidnapping of Theo Epstein and Jon Lester. (Laughter.) Envy is a terrible thing, folks. (Laughter.)\\nWe all know that for many decades, Boston and Chicago were linked by an evil curse hatched by demons dwelling thousands of miles beneath the Earth’s crust. (Laughter.) And a dozen years ago, with Theo’s help, Boston broke from the spell. And skies opened, the lotus blossoms fell like rain. (Laughter.) And because some of you may be superstitious – which actually means all of you are superstitious – I will say no more except to say: Forget about yesterday. Your Cubbies are wicked awesome, as we say in Boston. (Applause.) And I promise to get you home tonight before the seventh inning stretch. (Laughter.)\\nNow, my focus this evening is on diplomacy, the art of negotiating and building relationships. It is a skill that some people have and others do not. For example, when Ulysses S. Grant was a boy, he lived across the state in Galina. And at the age of eight, he got permission from his dad to buy a neighbor’s horse. So he went to the neighbor’s farm and he told the guy there, “Papa says I can offer you $20 for the colt, but if you don’t take it, I’m to offer twenty-two-and-a-half. And if you don’t take that, I’m to give you 25.”\\nNow, my friends, with that kind of transparency, we could put WikiLeaks out of business. (Laughter.) But I’ve got to tell you, it makes you wonder how the North ever won the Civil War. (Laugher.) Now, we can all read about the Civil War and have, and we can all sit in the grandstands and watch the World Series, but actually, we’re here tonight not as spectators. We’re here as real-life participants in a troubled world. And we know that we have choices to make as citizens and as a country that can spell the difference between security and suffering, progress and stagnation, in an era of rapid, breathtaking transition. And that breathtaking transition is at the heart of a lot of the discontent that we see playing out in the most disturbing and unattractive ways.\\nBut we have to take seriously what’s underneath it. The stark and bipolar divide of the Cold War that I encountered when I first arrived in the United States Senate that I grew up with, as a kid who grew up through the Cold War, but which I arrived at in the Senate more than 30 years ago, that bipolar, simple world has disappeared, and I don’t think anyone regrets that. But we are confronted today by a globe that is both no less dangerous and far more complex, where the power to influence events is less hierarchical, far more broadly dispersed, and change is at least as likely to be driven from the bottom as it is from the top.\\nFor better and often for worse, non-state actors have assumed a more prominent role on the global stage. Chicago’s MacArthur Foundation is one of the happier examples. And the astonishing march of technology has and continues to revolutionize the workplace, and seemingly it has shrunk time and space, and that makes neighbors of all of us. Political instability, economic hardships, and even climate change have caused record numbers of people to migrate across borders in search of a better life. And all of this has made the job of governing in a way that meets public expectations harder than it has ever been before.\\nHere in the United States, we saw our nation attacked on 9/11 and our armed forces enter a fight at great cost in Afghanistan and Iraq. In recent years, we have witnessed the rise of Daesh/ISIL and again experienced the tragedy of terrorist murders close to home. We are confronted as well by the specter of cyber warfare, and by the unwelcome return of vicious sectarian violence and extreme nationalism.\\nIt is little wonder that some yearn for what seems like a far simpler time. But it would be foolish to think that we can move ahead with our eyes firmly fixed on the rearview mirror. International challenges can’t be wished away, they can’t be ignored. They have to be met with honesty and determination and confidence. And that is the approach that our country at its best has always taken. As a famous son of Illinois once said, “optimist” is just another name for an American. And I agree – on at least this point – with Ronald Reagan. (Laughter.)\\nPut simply, the tasks that we face in the world today are more diverse and more complicated than those that our predecessors wrestled with. And frankly, our strategies have to reflect that and they don’t always. Some problems are relatively narrow in scope or they’re confined to a particular region, but a few – such as those that are posed by poor governance, of which there is far too much in this world right now – corruption, climate change, violent extremism; these are problems and challenges that are literally generational in their scope, and they require both short-term and long-term actions – something that our politics is finding it really difficult to deal with to our great detriment as a country.\\nAt times we will be able to count on global institutions, but more often we’re going to have to do a lot of the heavy lifting ourselves. That’s what I’ve learned as Secretary. In every case, we have to act with our nation’s values and our best interests in mind. And I want to be crystal clear that is exactly what we are doing.\\nNow, we’ve all heard some people accuse the United States of standing aloof from the world’s problems or somehow being in retreat. I’ve heard that narrative. I hear people say why is the United States disengaging? Why are you pulling back? And I scratch my head, and I say, where are these people coming from? But those assertions are, to use a diplomatic term of art, absolute nonsense. The truth is that the United States today is more deeply engaged in more places simultaneously on more critical issues with greater consequence than ever before in the history of this nation, and I know that. (Applause.)\\nNow, let me run through that a little bit so it’s not just a sentence, it’s not rhetoric. Consider for a moment the world’s most dynamic region.\\nThe Asia Pacific is essential to the security and the prosperity of the United States – period. Of our top ten trading partners in the world, five of them are in Asia. The globe’s most populous country and its largest democracy are located there. In East Asia, we have enduring defense alliances with Japan and the Republic of Korea that we continue to strengthen and reaffirm and that we have strengthened and reaffirmed in this administration twice since I have been Secretary.\\nWe have a regional diplomatic agenda that covers everything from nonproliferation to the prevention of human trafficking. Just two days ago I chaired – because I chair the Interagency Task Force – we had the Attorney General of the United States, the head of the FBI, the Treasury Department, the entire government – Education Department, Commerce – all at the same table talking about how we’re going to deal with human trafficking and end the scourge of modern-day slavery in the year 2016. I don’t know any other nation. (Applause.) You tell me what other nation has every arm of its government sitting around the same table on the same day wrestling with a global international issue and offering leadership as we have been on the issue of trafficking. Young women who are sold into slavery and sex traffics; a young man with a shackle around his neck that The New York Times chronicled so effectively, who was two years at sea, shackled to a boat where he was made to fish illegally and as a slave. You can run through 27 million stories, folks. I don’t know them all, but I know that each is as horrible as the other, and so do you. And these are people who are powerless; people from whom it is only a country like us that is willing to work to try to stand up and bring them out of the shadows and liberate them that we are their only hope, their only possibility of survival in situations where otherwise they might be forgotten to anybody and everybody – a speck of history that disappeared in some horrible moment that we don’t even witness.\\nWe are cooperating with local (inaudible) leaders to restrain North Korea’s dangerous nuclear program and we’re adding muscle to one of the toughest economic sanctions regimes ever imposed, and we led the effort to achieve that. We consult regularly with regional partners to prevent misunderstandings that would lead to even greater tensions in the South China Sea. And we are helping to guide Myanmar’s historic transition from global outcast to emerging democracy. Just yesterday, I met with leaders from Vietnam to deepen our ties to a one-time adversary with whom we have found areas of common ground that not long ago would have seemed literally unimaginable.\\nYesterday, I sat across a man who told me he fought in Quang Tri in the north of Vietnam while I was in the south, improbable as it might have been years ago for me to imagine we would sit across the table from each other and talk about how we really make peace. We left there in 1975 – as you all know, ’73 – we left in ’75, the fall of Saigon, then-Saigon, and the rest is history. Well, I’m proud that the United States saw the President of the United States Barack Obama, together with the Secretary of State who fought in that war in Hanoi, in Ho Chi Minh City, forging stronger ties with what is now a raging capitalist country that is changing rapidly. And that is how you really make peace, my friends – by building, by diplomacy. (Applause.)\\nIn September, I sat down with New York – in New York with representatives from many Asian nations, and they reiterated a message that I have heard over and over again as Secretary of State. They welcome America’s presence in their region. And they don’t go to bed at night wondering about when we’re going to leave; they worry that we might leave. They don’t want any one country to try and dictate to others what they can and cannot do. And they see the United States of America as a balancing and stabilizing force, but they’re also concerned about what the future is going to bring. And the question they ask, the critical test of our commitment above all others, is whether we will formally approve the Trans Pacific Partnership or the TPP.\\nNow, let me tell you, this 12-nation agreement which we sought, which we led to create, which we have put our credibility on the line in order to build this 40 percent of global GDP entity that will create a race to the top, not a race to the bottom. It’s a global economy, and this agreement includes three of the biggest trading partners of Chicago – Canada, Mexico, and Japan. Unlike any trade agreement that our country has ever previously signed, TPP includes unprecedented labor and environmental protections within the four corners of the agreement, unlike the others. It mandates a level playing field between private sector companies and state-owned companies. Who do you think benefits from that? We don’t have state-owned companies. Other countries do. And now we create a level playing field. And provided Congress approves it, this pact will abolish 18,000 foreign taxes on American goods and services, making it easier for our farmers, our ranchers, and our businesspeople to be able to export overseas.\\nThat is why the TPP is both a good deal for the American economy and it is a litmus test of our country’s capacity to lead. Make no mistake; if we’re going to live up to our responsibilities in Asia, if we’re going to treat our partners with the respect that they deserve while earning their respect at the same time, and if we’re going to do what is necessary to protect our interests, we have to maintain a steady and a reliable presence in that region. And I’ll just share with you our involvement can’t be in one sector and not in others. We can’t focus on one country and not be inclusive. We can’t focus on security at one moment and then ignore the economic dimension. You can’t turn it on and off like a faucet. Whenever and wherever vacuums exist in this world today, others will move to fill them in ways that may not embrace the rule of law and that will certainly not reflect the kind of high trading standards that we, the United States, seek.\\nIf we were to see the TPP rejected, it would be a gigantic self-inflicted wound on our nation – a setback to our own interests in the region, where our credibility as a country on any agreement we’re trying to negotiate would be in doubt. It would amount to a conscious turning of our backs on the Asia Pacific at the very moment that we ought to be linking arms. It would be an act that would hurt American workers, slow our economy, hinder our ability to advance the full range of U.S. objectives in a region that is just, by common sense, with five of the fastest-growing nations in the world, a region that is important to our future.\\nNow, the good news is most of our citizens realize this. A recent survey by this council showed that a majority of Americans favor the TPP and believe that free trade is beneficial – and as I say free, I say fair, because it’s important that it be an agreement like the TPP, where you have labor standards and environment standards. But it is beneficial to our economy and is helpful to America’s standard of living.\\nAnd those people who are the majority in America who say they do support it realize that if America is going to keep growing – just think about this, it’s sort of basic common sense. You want the economy to grow, folks? Then you have to be able to sell to the places where 95 percent of the world’s customers live, and that’s not in the United States. Ninety-five percent of the world’s customers live in other countries – beyond our borders – and we can’t grow our economy unless we’re willing to engage in trade. So don’t throw the baby out with the bathwater. That’s not what this is about. The problem is not that the average American worker is penalized by trade itself. The average American worker is penalized by a system that doesn’t allow them to share in the benefits of that trade, which sees the top 1 percent take most of the benefits away with them. And what we need is a measure of fairness in our tax structure, in our social structure, education, ongoing education, that provides opportunity for all Americans, so that whatever disruption or dislocation might come is adjusted for because we understand what we’re doing.\\nSo I call on Congress when it returns to Washington after the election to take up and approve the TPP. It is the right thing to do for America – and no matter what the loudest voices may be shouting – it is also the popular choice. (Applause.)\\nNow even – but even as we demonstrate sustained leadership on the rebalance of our national security policy towards the Asia Pacific, we have to confront a lot of other tests as well. And none is more urgent than responding to the threat that is posed by violent extremists. This is a danger that has evolved steadily since 9/11 and we work constantly to defend against it, both here and at home; and in helping Nigeria to push back against the terrorist kidnappers of Boko Haram, which we are doing successfully; of helping Somalia to reclaim land from al-Shabaab, which we are doing successfully; of helping Afghanistan to safeguard its citizens from the Taliban; to help friends in the Middle East who are confronted by the most ruthless terrorist organization of all.\\nI want you to think back to the summer of 2014, ask yourself who is retreating. In 2014, Daesh terrorists were rampaging across Syria and Iraq, and you remember seeing on TV the Toyotas and the black flags and the sweeping columns moving through town after town plundering cities, murdering and torturing the innocent, and claiming to establish a caliphate that would rule all Islam. We heard dire predictions that Baghdad was about to fall and that young people from every single corner of the globe were going to flock to Daesh to kill and die in the name of hate.\\nIt was a time to provide leadership, and that is exactly what President Obama did when he ordered U.S. planes to engage and bomb those terrorists and help rescue an endangered group of Yazidis on Mount Sinjar in northern Iraq, where we stopped a slaughter from taking place. We led the effort to mobilize a diverse coalition that now numbers 67 countries. And together with our partners on the ground, we took on the terrorists and began to liberate the cities that they had occupied – Kobani, Tikrit, Fallujah, Ramadi, and more. And today, the citizens who were driven out have returned to those communities. Day after day, we have been eliminating the leaders of Daesh, choking their finances, disrupting their supply lines, hammering their oil facilities, and reducing their recruitment to a trickle.\\nAnd from the outset, we warned that eliminating Daesh completely wasn’t going to happen overnight; it was going to take a number of years. And that remains the case. But I’m telling you, the terrorists haven’t been able to launch a significant offensive and hold territory since May of last year. We have closed off the strategic border between Syria and Turkey.\\nAnd just last week, Iraqi and Peshmerga forces began a campaign to free Mosul, the so-called spiritual capital of Daesh’s phony caliphate and its largest remaining stronghold. Now this is going to be a difficult and consuming assault against a dug-in foe; but I’ll tell you this, our resolve could not be more firm. Daesh is opposed to every value human civilization aspires to. Daesh kills Christians because they are Christians; Jews because they are Jews; Yazidis because they are Yazidis; Shiite Muslims because they are Shiite Muslims; and Sunni Muslims if they reject Daesh’s ugly view of the world. Daesh sells little girls into slavery and brags about it. It cuts off the heads of innocent people in public, and sometimes forces children to watch and to even participate in executions. I said it earlier this year and I will say it again: Daesh is guilty of genocide and we will hold Daesh accountable. (Applause.)\\nMy friends, it matters that every time we defeat these terrorists in one place, we seize files that help us to disrupt the networks that they are trying to establish in others; we learn more about how Daesh operates and who is aiding or conspiring with them. No one hears much about the attacks that don’t happen. We’re glad; we like it that way. But by sharing information, our coalition is helping to deter and break up plots on a regular basis before anyone gets hurt.\\nWe are also engaged in a nonstop effort to rebut the lies that fuel propaganda. Here, too, we are making gains. Daesh’s presence on social media has plummeted and it has become apparent that its pledge to create Paradise on Earth is crumbling into a hand full of dust.\\nSo here’s the bottom line: Because of the determined use of our diplomacy backed by our armed forces and the commitment of our partners, and the leadership that we have provided, we are going to win the fight against Daesh. And we are going to prevail without altering the nature of our societies, without succumbing to bigotry, without closing our borders, without betraying the democratic values that terrorists have vowed to destroy.\\nWe will also persist in our effort to find a diplomatic solution to the conflict in Syria, and I believe we will find a way to ultimately end the most severe humanitarian crisis since World War II. It is a crisis, I might add, that is not going to be solved by just writing checks for refugees. We’re the largest donor in the world to the Syrian refugees. But what we have to do is stop the flow of refugees; we have to end the war. And this is as complicated a bit of diplomatic business as I’ve ever seen.\\nThe situation in Syria is made worse by the multi-sided nature of the fighting as well as the utter depravity of the Assad regime, and there are so many different forces there. But precisely because the war is so complex, clear principles are required to end it. And because some outside powers have been playing an unhelpful role, international cooperation is essential as well. That’s why a year ago, we, the United States, brought together a group of stakeholders – the International Syria Support Group. It includes every single country that is involved in the conflict, including Russia and Iran.\\nAnd some people say, “Well, why are you sitting at the table with those guys?” Because they’re involved. Because without them being part of the solution, they are part of the problem. Each and every one of those countries promised to support a cessation of hostilities, the unfettered delivery of humanitarian aid, and negotiations that would lead to a political transition. Now, these remain the right principles for ending the war; but as the world knows far too well, the promises made on paper have not yet been matched by actions on the ground.\\nAnd this failure to keep faith has been both deeply tragic and unbelievably frustrating, piling misery on top of misery, and squandering opportunities for progress when they’re staring us right in the face. And despite the many setbacks, my friends, there’s a simple reality. The need for diplomacy remains, because the fact remains that a military solution in the judgment of most people is simply not possible – at least not if Syria is ever to be a whole country again.\\nThis is complicated because there are many wars taking place simultaneously in the same place – Kurd on Kurd, Kurd on Turkey, Iran versus Saudi Arabia, Saudi Arabia versus Iran; Iran and Hizballah versus Israel versus us and those who have labeled Hizballah a terrorist organization; a lot of people against Assad; the whole world against Daesh; Daesh against Assad and civilization and everybody else; Shia versus Sunni; Persian Shia versus Arab Sunni. I think that’s more than six.\\nSo let me be clear: There’s nothing inevitable about this war. The Syrian disaster resulted from choices that people made. And what people have the power to choose, they have the ability to change. I don’t think it’s hard to envision the changes that we need: a real and lasting ceasefire, representatives from both sides coming together in Geneva and coming together in the country, coming together in the country to defeat the terrorists and coming together in Geneva to define the transitional governing body of the Geneva Communique; to agree on new leadership and on new forms of governance; and to prepare for elections.\\nAnd why can I say that? Because every single country at the table of the International Syria Support Group has said they support that – elections, a transition government, a whole Syria, respect for rights of all minorities, secular, non-sectarian. The problem is there remains a mountain of mistrust between where we are and where we need to get to. And as we try to chip away at that mountain, we will make – I will make and President Obama will make zero apology for using every single diplomatic tool at our disposal to try to end this war. And we make no apology for not giving up when hospitals are being bombed, when children are still dying in the streets, and more and more refugees are added to the most horrific mass exodus in modern times. We owe the world our best effort to end this war, and we will continue to provide it. (Applause.)\\nNow, the impact of our diplomacy is also being felt in Europe, which is in the process of responding to an array of economic and other dilemmas, including the influx of refugees from Syria, from the Middle East, from Afghanistan, from Africa, and the decision, of course, by Great Britain to leave the European Union.\\nAnd we take these concerns very seriously, but they don’t diminish our faith in the future of the European project or the resilience of the transatlantic relationship partnership. I was in Brussels earlier this month, and I found that the sense of common purpose across the Atlantic is being demonstrated every single day. The United States and Europe continue to maintain tough economic sanctions against Russia because of its aggression in Ukraine, and our unity has been made even stronger by Russian President Putin’s repeated efforts to interfere in the functioning of our democratic systems. In July, at the NATO Summit in Warsaw, we agreed to bolster our security efforts in the Baltics and in Central Europe, and we’re doing that. We’re emphasizing energy diversification, helping to lead countries that have a one-place energy source and try to diversify for them in order to avoid the potential of being exposed to economic blackmail. And as I’ve said clearly on both sides of the English Channel: Brexit does not alter in the least American’s unwavering commitment to a strong Europe, a strong United Kingdom, and close diplomatic cooperation on matters of importance to all of us.\\nOne illustration of that kind of diplomatic cooperation was the nuclear agreement that was referred to in Lou’s introduction regarding Iran. The Joint Comprehensive Plan of Action would never have gotten off the ground without firm European support for the sanctions that helped to bring Iran to the bargaining table. And that support was critical because before negotiations began, Iran had developed the ability to produce enough fissile material for a nuclear bomb in just two months. In fact, they had enough nuclear material for 12 bombs. That’s where we were. The clock was ticking. So we made the decision to negotiate, and it is a good thing we did.\\nUnder the plan that we reached, Iran agreed to ship 98 percent of its enriched uranium out of the country, to shut down two-thirds of its centrifuges, to take the core of its plutonium nuclear reactor and fill it with concrete rendering it unusable forever, and they acceded to a state-of-the-art, rigorous verification regime.\\nNow, as we know, this was a contentious debate here in this country. Many people argued against negotiating with Iran, let alone coming to an agreement, saying it would be a terrible mistake. I’ll tell you, to my core, I still believe they were and are wrong. The Iran agreement wasn’t a miscalculation. It has made the whole world safer, and it shows the value of diplomatic engagement even – and perhaps especially – when the governments involved disagree with another on as many issues as we did. When we came together to begin this negotiation, we hadn’t even talked formally to an official of Iran in 35 years.\\nNow, I’m not standing here pretending to you that diplomacy can solve every problem. It can’t. But the peaceful breakthroughs that it can provide are well worth the attempt. Nothing has ever been accomplished by an unwillingness to try. And I’ve always said I’d rather be caught trying.\\nOur diplomacy is also making a difference on global issues, and at the top of that is the historic progress that we are now beginning to make with regard to climate change.\\nHere in Chicago, as elsewhere around the world, you’ve experienced record high temperatures. If the present trend continues, average thermometer readings in the Midwest are going to reach those traditionally associated with the deep South. Each last month was the hottest month in human history – July the hottest month in recorded history. May, June, run the list – so much so that the last 10 years add to the fact that not only was last year the hottest year in human history, the last 10 years are the hottest year – or the hottest decade. And guess what? The decade before that is the second-hottest in human history, and the decade before that is the third-hottest in human history. You’d think with those trend lines that everybody would catch on. But in fact, we had a political party in our country that didn’t allow – not one single candidate running for president – to say anything about climate change. And in the debates that we just had for president, out of six hours of debates, the vice president and president combined, not one single question was asked about climate change.\\nNow, here in Chicago, you’ve been responding to this challenge by implementing flood protection measures, by planting trees, by committing to green technology. But for these steps to be fully effective, they’re going to have to be matched by a concerted international campaign that is now, because of our efforts, gathering steam. And no one country can solve this problem alone. If we went to zero tomorrow, we’d still have a major problem.\\nLast December in Paris, the United States joined governments from nearly 200 nations in approving the most far-reaching agreement on climate change ever negotiated. And to arrive at that point, we had to put the environment where it belonged: right at the top or near top of our foreign policy agenda.\\nIn 2009 in Copenhagen – I remember being there – the world convened to talk about climate change but adjourned in total disarray, a famous implosion where the Chinese were involved with the G77 in moving in the opposite direction. So recognizing that, one of my first initiatives as Secretary of State was to prevent that from happening again. I went to Beijing to create in the early – within a month and a half or so of being Secretary, we created a bilateral working group in order to see if it was possible for us to find a different way to move forward with the exact purpose of trying to have our presidents be able to announce the level of reductions that we would jointly engage in.\\nWell, that effort paid off when, in January of 2015, President Obama and President Xi stood side by side in Beijing, representing the world’s two largest economies and the two biggest emitters of greenhouse gases, and together we set ambitious targets for action while encouraging other countries to do the same. That is what broke open the possibility of the Paris Agreement.\\nAnd the Paris Agreement was a diplomatic milestone, but it’s still far from the finish line. We began this year hoping to take additional strides. First, we wanted to ensure that enough countries would formally ratify the Paris Agreement so that we could bring it into force by the end of the year. That required a whirlwind effort to gain the approval of cabinets and parliaments, the kind of process that often consumes – ask Ivo or ask Lou – could consume a decade. We did it in 10 months.\\nOur second goal was to map out a path towards carbon-neutral growth for the international aviation industry. We achieved that goal in September.\\nAnd two weeks ago, I flew to Rwanda in pursuit of our third goal: a plan to phase down the use of heat-trapping hydrofluorocarbons in air conditioners, refrigerators, and other devices. And this is probably the single-most important step that we could take to limit the severity of global warming in ways because it, by itself, if properly implemented, will save one-half a degree Centigrade in the warming of Planet Earth. This negotiation also was the product of years of painstaking diplomacy, and it, too, had a positive outcome.\\nSo as I said earlier, shielding our planet from the worst consequences of climate change is a generational challenge. But in the three decades that I have been working on this issue, I have never seen the kind of positive momentum that we have now. Across the globe, leaders from the private sector, from civil society, the scientific community, the religious organizations, and governments at all levels are all together moving in the same direction. Yes, there are still pockets of blindness and denial, some right here in America, as I mentioned. And yes, the agreement does not by itself guarantee that we will halt the temperature increase at 2 degrees Centigrade.\\nBut by acting boldly on all three fronts – Paris Agreement, civil aviation, hydrofluorocarbons – we have sent an unmistakable, powerful message to entrepreneurs and investors everywhere in the world that now is the time to revolutionize the way we produce and use energy. And as I have said many times, the solution to climate change is staring us in the face. It’s not something we have to discover in the future. It’s here, it’s now, it’s energy policy, it’s moving to make better choices about how we power our transportation, our buildings, our electricity. That’s the solution. And the sooner we move to a low-carbon, no-carbon economy, the sooner we will solve this problem for future generations. (Applause.)\\nAnd by the way, it is the biggest market in the history of human beings. The market that grew my state of Massachusetts unbelievably and even our country in the 1990s was a $1 trillion market with a billion users. That was the high-tech market – computers, personal computers, and communications. This market is a 4 to 5 billion user market today going up to 9 billion users, and it’s a multi-trillion-dollar market today and it’s going to go up into the 40, 50 trillion mark in terms of investment over the course of the next years. This is the way you put people back to work. If there is one piece of advice I will have for my successor, it will be to ensure that environmental diplomacy remains an integral part of our foreign policy, because we cannot safeguard the future of this planet for our children and our grandchildren if we fail to defend the fundamental principles of a safe and clean Mother Earth. (Applause.)\\nNow, you should know – now, maybe you’re beginning to get the sense of our engagement. What I’ve discussed so far is really just the tip of a very big iceberg. Every day, the State Department’s Foreign and Civil Service professional are hard at work on issues affecting places like Colombia, where we’re aiding President Santos’s effort to end a 50-year war, the longest-running civil conflict in our hemisphere; Cuba, where we have restored diplomatic relations for the first time in more than half a century; Yemen, where we’re trying to work every day now to establish a roadmap towards a durable peace; Libya, where we are working to strengthen the government of national accord, and I will be meeting in London on Monday of next week on that very subject; Sub-Sahara Africa, where we’re training young leaders, promoting connectivity, supporting the empowerment of women; Central Asia, where we’re engaged on energy security and helping civil society to take root.\\nAnd as the men and women who work in our country’s diplomatic posts can attest to you, being the face of America abroad is an honor, yes, but it’s also a continual challenge filled with personal sacrifice and even risk. I have nothing but admiration for the members of our overseas teams, which is why I think the Chicago Council’s new Youth Diplomats program to help prepare the leaders of tomorrow is a fantastic idea. Let no one doubt the effort by the United States to assist people in other nations makes a major difference to them, but also it makes a major difference to us. And it has done much to shape what our country means to the world.\\nBack in 1949, a junior State Department official named Benjamin Hardy had an idea. He thought that some of the concepts behind America’s New Deal might work if they were applied internationally. He proposed a large-scale program that would harness popular, Quote: , “enthusiasm for social and economic improvement,” and thereby repulse Communism and create a decent life for the Earth’s millions.\\nMr. Hardy sent his suggestion up the State Department chain-of-command only to see it come back down with the deadly words, “Needs further study.” He sent it up again; it came down again. And here I assure you that nothing like this would ever happen in the flawlessly managed State Department of today – (laughter) – but after trying and failing a third time to get support from above, he did something which I do not recommend to anyone’s who’s aggrieved in my department, he reached directly out to the White House. And the next thing he knew, President Harry Truman was unveiling a program of international assistance as the featured fourth point in his Inaugural Address.\\nThis was truly something new. Never before had a country launched a major effort to help people to whom it had no special ties except a shared interest in peace and prosperity. And it’s no accident that that country was the United States of America.\\nI’m not going to tell you that in the time since we’ve solved every problem or that every indicator of international progress is due to America. No, it’s not. But I do know, because I’ve seen it firsthand in country after country, the difference that our leadership and our resources have had a lot to do with what is happening for the good in so many places in the world today. Children born today can expect to live longer and healthier lives than in any previous generation. Did you know that? Compared to just 20 years ago, we have cut in half the number of mothers who die during childbirth and the number of infants who perish because of malnutrition. We’ve vastly expanded access to education for girls and boys. In Afghanistan in 2001, only about a million kids went to school, and they were all boys. Now there are more than 9 million kids in school, and 40 percent of them are girls. (Applause.)\\nWe have driven extreme poverty below 10 percent for the first time in human history. We defied predictions to save hundreds of thousands of people who were at risk of Ebola. Remember they said a million people were going to die two Christmases ago, and we never got close to that because President Obama dared to send 3,000 troops over to build health care delivery capacity, and doctors and nurses and aides provided courageous assistance to save lives. We joined forces with the global health community to turn the tide in the fight against HIV/AIDS. I remember 15, 20 years ago it was death sentence and people didn’t even want to talk about it. Now we can look forward, thanks to our program that we put together first in the Senate and then globally, to the first “born free from AIDS” generation in more than three decades. (Applause.)\\nAnd with the help that we have just received from Congress, you can bet we are going to go after the Zika virus with all the energy that we have, because the prospect of becoming a parent should be a source of joy for everyone everywhere, not a source of fear. (Applause.)\\nThis, my friends, is really just scratching the surface of a record in which all Americans can take pride. And yes, it comes at a cost. But do you know that amazing surveys show that many of our citizens think we devote a full quarter or even a third of our federal budget to foreign aid? Do you know what the reality is? One single penny of every dollar that our government spends abroad in terms of diplomacy and all of the programs and all of our aid – one single penny of every dollar is used for international operations and includes everything from counterterrorism to assistance to providing security at our embassies and paying for the staffs of embassies around the world. One penny out of every dollar. One percent. Without doubt, the biggest and best single bargain in the government today.\\nNow, in October of 1937, President Franklin Delano Roosevelt arrived in Chicago to dedicate the Outer Drive Bridge. He was expected to talk about local issues, but instead he had a global message in mind. Congress had earlier approved a neutrality law prohibiting the Executive from sending aid to the democratic countries of Europe. And there were many in our country who said that to remain safe, America should close its eyes to the storms gathering abroad and avoid making an enemy of Hitler.\\nStanding in front of an array of microphones, legs supported by clamps, hands gripping the podium for support, Roosevelt warned that a “reign of terror and international lawlessness” was threatening “the very foundations of civilization.” In vivid terms, he denounced the rise of fascism in Europe, aggression in the Pacific, and the slaughter of defenseless civilians in Abyssinia and China. He said that trying to ignore these outrages would bring not peace, but more of the same – and he compared them to a disease that people everywhere should join in isolating.\\nFDR’s so-called “quarantine” speech, as it came to be known, was denounced by many as “warlike,” and his summons to action was rebuffed by the European advocates of appeasement. But as history was soon to demonstrate, Roosevelt’s every word was proven true.\\nAs I enter my final three months as Secretary of State, I am as convinced now, as FDR was then, of the need for peace-loving people on every continent to band together to reject the apostles of hate, the authors of aggression, the manipulators of truth who threaten to hold us back and do us harm. We need to fulfill the responsibility that we all share to uphold the global norms, to defend freedom in all of its dimensions, and to respect the rights and the dignity of every single human being.\\nAlso like Roosevelt, I recognize – as I think everyone here does – the importance of flexible and creative U.S. leadership in making that happen. Our country is blessed with an $18 trillion economy. We should be asking ourselves not how quickly or sharply we can shed the responsibilities of leadership, but rather how much more can we do. We have our own storm clouds and our own foundations of civilization to protect. And let us never forget that America is the exceptional nation that so many people in public life like to talk about, but we’re not exceptional because we make speeches about being exceptional, and we’re not exceptional when we shove our face in other people’s faces and tell them how exceptional we are. We are exceptional when and because we do exceptional things. That’s what makes America exceptional. And America can do more, even today, with greater impact. But we have to be willing to put resources on the table and empower people to live our vision – not view it with envy from the outside.\\nI believe that we should look to the future with every ounce of optimism that has always inspired and energized our nation, but we should also acknowledge that we will not be able to chart a sure course for others unless we are at peace with ourselves.\\nA great American from this state once warned, in the words of the scriptures, that, “a house divided against itself cannot stand.” Whatever happens in the next two weeks, our country is going to have to begin a process of healing, of reconnecting with one another, of listening, of forgiving, and remembering that every action we take is being carefully observed by our global allies and adversaries, and that what they see will have a direct impact on our future ability to be able to lead.\\nI think that we have one of the greatest stories in the world to tell. The strength of America, unlike some places where they’re defined by ethnicity or by centuries of homogeneity – we are not. We are defined by an idea, unlike most other countries, and that idea is about freedom and the pursuit of happiness and all people being created equal with the opportunity to make the most of themselves.\\nLadies and gentlemen, American greatness is not an entitlement and it cannot be taken for granted. It has to be demonstrated; it has to be earned by every generation. And one of the great strengths I hear from other people whenever I travel is how they see in America a country that is always changing, always moving forward, always looking to the future, always able to redefine itself. That effort demands the best from us and it demands the best within us. The world will be watching to see whether we, the American people, remain up to that challenge. There is not a scintilla of doubt in my mind that the answer is yes, but we are going to do a better job – all of us together, I believe – or we need to all do a better job in proving it to people.\\nThis Administration still has miles to go before we pass into history, and I intend to work with the president as he does until January 20th to advance the cause of our country. And in doing so, I will be grateful for as long as I live for the privilege I have been given to serve, just as I am now grateful for your hospitality in welcoming me to the matchless city of Chicago. Thank you and go Cubs. (Applause.) Thank you very much. Thank you very much. Please, please, please (inaudible).\\nMR DAALDER: Mr. Secretary, I think I speak for all of us here to thank you for your service and for this really rousing call for continued strong American leadership and engagement in the world. We have a couple more minutes, so we’ve gotten some questions that we’ve collected, and I wanted to start with a question of a young man who is a political science student here in – at DePaul University who wants to think about his future by asking you something about his past. He asks: “How has your experience as a Vietnam veteran influenced you not only throughout your life, but particularly your service as Secretary of State?”\\nSECRETARY KERRY: Well, it’s a great question. Thank you for the question. I did a podcast earlier today with David Axelrod in which we talked a little bit about this. It requires a little bit of biography. But when I – I signed up for the United States military in 1965, not too long after Lyndon Johnson said we need 500,000 troops in Vietnam and the Gulf of Tonkin incident had allegedly happened. And I was, like many, many, many of my classmates, actually, I was surprised when I went back and looked in our reunion book how many classmates served. And I think it was part of our generation’s sense of responsibility – lucky enough to go to great university, mindful of President Kennedy’s call to action that we would bear any price and – pay any price, bear any burden, and recognizing we were in the Cold War and seeing things in a fairly simplistically defined way – East, West, Soviet Union versus the West, bipolar, pretty simple stuff, defend against Communism – and we tended to see most of our challenges within that lens.\\nWell, by time – the first draft card hadn’t been burned. I think it was first burned in about 1967. And by 1968, when I was training – when I left for Vietnam for a tour of duty in the Gulf of Tonkin in a ship, and then when I went over as skipper of a small gun boat, 1968 was an incredible year, as you all know from history and some of you from living it. Medgar Evers was assassinated, Martin Luther King was assassinated, Robert Kennedy was assassinated. There was tumultuous convention right here in this city. And I was in uniform and watching all of this and listening to the stories of those who were coming back from Vietnam and sharing with us what their experience was.\\nSo when I went over in-country as we called in October, I think it was, of 1968, I saw a very different set of circumstances from those that we had mostly read about or had described to us. And I really found myself – as we did all of us who were there – wrapped up in a civil war with very few options in a sense and a war that, in my judgment, we were simply not going to win the way it was being fought and with the choices and options that we had, and perhaps couldn’t be in the long run depending on how you saw the North-South civil component of it.\\nSo what I learned was, in answer to your question, and what I vowed was as a young man, that if I was ever in a position of responsibility to make a judgment about putting people like me in harm’s way again, I was going to make sure that we understood what we were doing, and I was going to make sure that we had the right lens and the right understanding of what it was. We haven’t done that, obviously, in every case, but I think that the notion – I think – when I testified before Congress and before the Senate Foreign Relations Committee in 1971, I laid out my reasons for opposition to the war as a veteran. As I was leading a group of veterans and a small group of my friends – we brought about 5,000 veterans to Washington. We camped out on the Mall and we stared down the Supreme Court and the Washington police and the administration, and stayed on the Mall and delivered a message to Congress about the war. And it was a breakthrough moment where people began to really understand what was happening.\\nI think that the lesson I learned is – are several. Number one, make sure you really ask the right questions, examine all the possibilities, and get an understanding of the place you’re thinking about going so you understand what the dynamics are, what the downside risks are, and what is the what then, what next. Once you’ve succeeded in your immediate goal, how do you manage it as you go forward?\\nI also learned that not everything is Vietnam, and that’s a very important lesson, folks. Some people get trapped in that place in history, and I thought it was very important not to be trapped, that sometimes we do have to use force. I supported what we did in Kosovo and Serbia. I thought it was critical to save lives. And as you all know, President Clinton greatly regrets the fact that they didn’t respond in Rwanda. There are times when I think we do have a responsibility and we have to do some things that we don’t like to do. But it depends on what the stakes are, and you have to examine them very, very carefully.\\nSo the real – I also learned an indelible lesson, because we were the veterans who first called to attention of the nation the treatment of vets in the VA hospitals, the lack of adequate allowances to go to school, the lack of adequate staffing in the hospitals, the absence of any kind of thank you or homecoming for a group of veterans who fought as hard as any other people in war at any other time, and I learned indelibly that this country should never, ever again confuse the war with the warriors. And I think we have learned that lesson, and it’s a good one. (Applause.)\\nMR DAALDER: Mr. Secretary, thank you for your service. Thank you for joining us here today. I very much appreciate you coming to Chicago. Particularly on this night, you’ve kept an audience for a long time, and particularly what’s going on right now.\\nSECRETARY KERRY: Do we have a score?\\nMR DAALDER: They’re winning, 2-nothing. Thank you. (Applause.)\\nSECRETARY KERRY: Two-nothing. That’s a good note to end on. Thank you. (Applause.)\\nJohn F. Kerry'"}, "time": 1742563526.8849652}