{"duration": 0.16386890411376953, "input_args": {"text": "'WASHINGTON  —   Thick with tension, the conversation this week between Stephen K. Bannon, the chief White House strategist, and Jared Kushner, the president’s    and senior adviser, had deteriorated to the point of breakdown. Finally, Mr. Bannon identified why they could not compromise, according to someone with knowledge of the conversation. “Here’s the reason there’s no middle ground,” Mr. Bannon growled. “You’re a Democrat. ” The schism within Mr. Trump’s perpetually fractious White House has grown in recent weeks, fueled by personality, ideology and ambition. At its core are Mr. Bannon, the edgy, nationalist   suddenly in the seat of power, and Mr. Kushner, the polished,   scion of New Jersey and New York real estate. Even as Mr. Kushner’s portfolio of responsibilities has been expanding, Mr. Bannon’s in recent days has shrunk with the loss of a national security post. The escalating feud, though, goes beyond mere West Wing melodrama, the sort of who’   ’  scorekeeping that typically consumes Washington. Instead, it reflects a larger struggle to guide the direction of the Trump presidency, played out in disagreements over the policies Mr. Trump should pursue, the people he should hire and the image he should put forward to the American people. On one side are Mr. Bannon’s guerrilla warriors, eager to close the nation’s borders, dismantle decades of regulations, empower police departments and take on the establishment of both parties in Washington. On the other are Mr. Kushner’s “Democrats,” an appellation used to describe even Republicans who want to soften Mr. Trump’s rough edges and broaden his narrow popular appeal after months of historically low poll numbers. In the middle is Mr. Trump himself, seemingly torn between the two factions, tilting one way or the other depending on the day, or even the hour, while he seeks to recapture momentum after a series of defeats in Congress and the courts. As he did throughout his career in business and entertainment, Mr. Trump plays advisers off one another, encouraging a sort of    competition for influence and ideas within his circle, so long as everyone demonstrates loyalty to him. At different moments, Mr. Trump has given conflicting impressions of his preferences. He has privately scorned the coverage of Mr. Kushner’s recent   trip to Iraq, according to two people who spoke with him, and questioned the need for his   ’s newly created office to overhaul the government. At other points, he has been dismissive of Mr. Bannon, curtly telling him he is not needed at this meeting or that. “This president’s method of managing is by him personally curating points of views from a diverse group of people in whom he has some trust and credibility,” said Thomas Barrack Jr. a longtime friend of Mr. Trump who led his inaugural festivities. “And he very rarely accepts one course of action or one suggestion without laundering it amongst all of them. And what happens in that process is confusion amongst those from whom he’s seeking advice. What works for him is that, out of that milieu, his instincts take him to the right answer. ” But the main players have grown so wary of leaving Mr. Trump’s side that it has become hard to organize meetings of senior officials without him, to thrash through policies or hiring choices, slowing up an already fitful process. Meanwhile, the conflicting sides have been waging proxy battles through friendly news media outlets. While alliances have been fluid in this White House, Mr. Kushner is joined by more   advisers including not only his wife, Ivanka Trump, who now has her own West Wing office, but also Gary Cohn, the president’s national economics adviser, and Dina Powell, a deputy national security adviser, both veterans of Goldman Sachs. Mr. Bannon’s closest ally is Stephen Miller, the president’s senior adviser for policy and the author of orders to temporarily ban visitors from certain predominantly Muslim countries. And although they were once at odds and still come from vastly different vantage points, Mr. Bannon has also maintained an alliance of convenience lately with Reince Priebus, the chief of staff closely associated with the Republican Party establishment. In recent weeks, as Mr. Bannon has felt increasingly frustrated, Mr. Priebus has several times bolstered the chief strategist in discussions with the president, according to people with direct knowledge of the talks. In turn, Mr. Bannon has gone out of his way to praise his onetime rival’s performance. Mr. Kushner and the others are said to be especially concerned about the geyser of bad headlines that have marked the president’s first two and a half months in office. They have resisted many of the more polarizing policy initiatives favored by Mr. Bannon’s side, including the travel ban and rollbacks of environmental regulation and of protections for transgender students, arguing that they undercut Mr. Trump’s election night pledge to be a president for all Americans. On foreign policy, Mr. Kushner is more inclined toward intervention in the Middle East while Mr. Bannon would prefer that the United States remain as uncommitted as possible. Even as the president signaled this week that he might respond militarily to the chemical attack on civilians in Syria, Mr. Bannon has argued that American interests are better served by not getting drawn any further into the quagmire of a civil war. From his point of view, Mr. Bannon describes the struggle in militaristic terms, vowing to associates that he “won’t give an inch. ” He tells Mr. Trump that there is no political benefit to drifting even slightly toward the center on core issues like the Mexican border wall, immigration and the environment, while he argues against a large infrastructure spending package without a clear way to pay for it. Mr. Bannon argues that it would be a fool’s errand to try to placate Democrats on Capitol Hill. That is a view shared by Mr. Priebus, a former chairman of the Republican National Committee. If Mr. Trump made a deal on health care with Democrats, Mr. Priebus told the president, it would jeopardize his chances of winning the Republican nomination in 2020, according to a person present for the conversation. The split has widened in a White House filled with aides facing constant questions from reporters about their place. Kellyanne Conway, the president’s counselor and once the most prominent face of the White House, has been less visible after several public misstatements. Sean Spicer, the press secretary known for combative encounters with reporters, is struggling to match his aggressive boss’s expectations. And Mr. Trump’s penchant for polling outsiders about his staff fosters tension. Mr. Priebus remains in a hot spot. Mr. Trump is fond of asking visitors, “How do you think Reince is doing?” and he expressed anger at the collapse of the health care overhaul, telling a longtime associate last week that he believed that Mr. Priebus was partly to blame. One of Mr. Priebus’s top deputies, Katie Walsh, left the White House unexpectedly last week, and he has been alarmed by a spate of stories questioning his relationships with the president and with Vice President Mike Pence. Mr. Priebus personally reached out to two administration officials urging them to push back with journalists reporting on tension with Mr. Pence. Anxious for a victory, Mr. Priebus hastily convened a meeting with Mr. Pence, House Speaker Paul Ryan and others in his corner office on Wednesday night and pressed for a quick vote on the health care repeal package, or some element of it, before the House left for its spring recess on Thursday. Mr. Ryan, who is close to Mr. Priebus, rejected the idea, explaining that the Republican leadership needed more time to secure votes to pass anything. Similarly, Mr. Bannon has told associates that he has been frustrated by recent setbacks and has resolved to dig in hard. He has been prodded by his longtime financial patron, Rebekah Mercer, the conservative philanthropist and political donor, according to White House insiders. But she was in little position to help him, since Mr. Trump is said to have grown weary of the Mercers’ seeking to enforce control over outside groups supporting him. The wrestling match has spilled over into public view as each camp seeks reinforcements among news media and conservative figures. Roger J. Stone Jr. an    adviser to Mr. Trump for 30 years, accused Mr. Kushner of planting negative views of Mr. Bannon on MSNBC’s “Morning Joe,” a show the president is known to watch. “Many of the   Bannon stories that you see, the themes that you see on ‘Morning Joe,’ are being dictated by Kushner, while Mr. Kushner’s plate is very full with Middle Eastern peace and the China visit and so on,” Mr. Stone said this week on the radio show hosted by Alex Jones, an avid fan of Mr. Trump’s who loathes establishment figures and traffics in conspiracy theories. Mr. Bannon’s supporters are publicly warning about the subversion of Mr. Trump’s real agenda by the   Democrats. “This isn’t about palace intrigue,” Laura Ingraham, the conservative radio host and author who was one of Mr. Trump’s earliest backers, said in an interview. “This is about a   assault against the Trump agenda from within. If the president allows this to continue and drifts away from his key pledges, he risks losing his core constituency and any hope of a second term. ”'"}, "time": 1742561969.3085592}