{"duration": 0.050580739974975586, "input_args": {"text": "\"Blacks For Trump Rejoice! Trump Has A Plan To Save You (Video) By Grownmangrumbles on October 27, 2016 Subscribe \\nWhy is that only the Blacks for Trump crowd can see it? \\nThe crime ridden streets. The sense of hopelessness. Black men loitering outside buildings, taking causal pot shots at each other across barely-lit streets strewn with human refuse. Black women sobbing quietly to themselves, their fingers raw from the caustic touch of the White-folk laundry they labor over. Dark-hued children scampering through the streets barefoot, clutching prizes grubbed from garbage that ooze like the bloated carcasses of animals lost to the summer heat. A half-eaten apple, a burger entombed in the husk of a once-edible bun. \\nSuch treats. \\nOr rather, to Republican presidential nominee Donald Trump’s version of certain parts of America. Africa-America \\nDonald Trump has lived in a bubble his entire life. His has been a life of privilege and of entitlement. He has never ventured out into the Black communities he is so quick to criticize; he’s never had to experience any of the hardships he pretends to lament. \\nWhich helps explain a few things, I guess. Like why he refused to rent property to non-whites back in the 1970s. The answer is simple. \\nBecause the man is fixated on a view of the lives of Black Americans so painfully anachronistic that it’s just plain racist. \\nTo listen to him, you’d think that we were still living in plantation-era America. Speaking to Fox News ‘ Jeanine Pirro last August, he described the lives of Black people in U.S. as a: “Total catastrophe, the unemployment rates, everything is bad — no health care, no education, no anything, no anything.” \\nHe went on to make the kind of pitch to the Black demographic that was as inept as it was inappropriate. “Then, I said, ‘Hey, wait a minute, vote for me. What have you got to lose? You can’t do worse, you can’t do any worse than what these people have been doing and I will do better.'” \\nIt’s not that his observations are entirely without merit. Serious inequality absolutely does exist in the United States. RE: Reality Check \\nIncome inequality between Black people and White people is worse today that it was in 1979. That’s on both parties. Gaps in household incomes persist and home ownership is divided along ethnic lines. That’s on both major parties too. \\nAnd that’s just the tip of the iceberg. Five times as many White people are using drugs as Black, yet Black people are sent to prison for drug offenses at 10 times the rate of White people. And then there are the shootings , the mistrust, the blatant prejudice. \\nSo yes, there is a lot of work to be done. But to say that ‘they’ have nothing is yet one more reason why this man is unfit to be president. To dismiss their gains, to dismiss the vibrancy of their communities, the impact they have had on popular culture, and even the very fact that a Black man is in the White House. To do that is to demean those very same achievements. \\nIt seems that somebody in the Trump camp agrees. Trump 2.0 \\nOn Wednesday, in Charlotte, North Carolina, speaking to an overwhelmingly White crowd, Donald Trump laid out his ‘new’ new deal for Black people, taking aim at those people who were, in his eyes, living in the very worst kind of Dickensian squalor. \\nAs you might expect for a man whose hands are too tiny to pull a trigger, he missed the mark by quite some margin. \\nGone was his insistence that the unconstitutional stop-and-frisk policy had been a rousing success. Gone was his blundering critique of the ongoing tension between the Black community and law enforcement. \\nInstead, he treated us to a new tactic. Sure it was a rehash of the lines that helped him exploit the post-truth delusional mindset of disaffected White people across the country but so what? It’s not like his approval rating with Black people could get any lower, right? He said : “Illegal immigration violates the civil rights of African-Americans.” \\nSticking to his usual modus operandi , he offered no evidence whatsoever to back this claim. Instead he forged ahead with yet more unsubstantiated bullshit : “No group has been more economically harmed by decades of illegal immigration than low-income African-American workers.” \\nEver the defender of the underdog, Trump proceeded to rail against Wall Street, Clinton, and tax laws for a few minutes before admitting, almost as an afterthought, that he wanted to pass legislation that would prioritize helping Black people with businesses : “Get the credit they need.” \\nIncredibly, this close to the election, he did not feel the need to tell the crowd what the legislation would be. Maybe he doesn’t know. Maybe he just said it for fun. \\nWho the hell knows anymore? Comic Relief \\nAlthough some attempt at softening his stance seems to have been made, the old rhetoric was still there. He pointed to slow growth of what he called “blighted communities,” and promised to : “… Seek a federal disaster designation … in order to initiate the rebuilding of vital infrastructure, the demolition of abandoned properties and the increased presence of law enforcement.” \\nPresumably with the intention of doing the rebuilding himself. Or rather, getting someone else to do the work, slapping his name on it and then politely asking all the Black people to get the fuck out of the way because, you know, they kind of spoil his view. \\nWatch Black leaders reject Trump’s proposals: \\nFeatured image by Gage Skidmore via Flickr under a CC By-S.A. 2.0 license About Grownmangrumbles \\nI'm a full- time, somewhat unwilling resident of the planet Earth. I studied journalism at Murdoch University in West Australia and moved back to the UK where I taught politics and studied for a PhD. I've written a number of books on political philosophy that are mostly of interest to scholars. I'm also a seasoned travel writer so I get to stay in fancy hotels for free. I have a pet Lizard called Rousseau. We have only the most cursory of respect for one another. Connect\""}, "time": 1742628430.1660714}