{"duration": 0.12221717834472656, "input_args": {"text": "\"Sabia Rigby Editor's Note The fact that the refugee encampment is called “The Jungle” speaks volumes for how those who must stay there are perceived … and treated. Calais has been home to a United Nations of refugees. The poem above (and picture) are from a Palestinian man. The quote below a Libyan, many others as presented in this article. Where do they go? Where will new refugees go? You read this, hear the voices, and then shake your head at the xenophobic response of the US (at the heart of creation of millions of refugees) who say “You have no home with us – not even those of you who have sacrificed and served under our banner.” There are times when the shame of my nation is almost too much to bear. \\n“I was in jail with a Libyan man, his friends came and broke into the jail and let us go, too. There was fighting everywhere. You pray to be in jail with Libyans, because they do not recognize the current government, they will do what they want.” (spoken by a refugee in “the Jungle”) F orty-two percent of the people who came to the Jungle are from warring parts of Sudan and South Sudan; thirty-two percent are from Afghanistan. Others are from Syria, Yemen, Iraqi Kurdistan, Pakistan, Eritrea, Ethiopia, Egypt, and more; they have crossed between 6 and 13 countries to arrive in Calais, with their final goal to reach the U.K. In Calais, it seems they are facing the hardest border to cross.\\nThere are many who have died or been seriously injured in their attempts to cross the border to the U.K. One couple was trying to cross by train. Her boyfriend made it on; she leapt, wrapped her arms around him, but did not get her bottom half onto the train. She was cut in half. He was deeply traumatized by her tragic death. In another case, a brother and sister tried to cross to the U.K. by truck. They were both hit on the road; he died and she is in the hospital. Most people from the Jungle Camp who are in the hospital were wounded in accidents while trying to get into the U.K. Broken bones and deep cuts on arms, legs, and fingers are the most commonly suffered injuries. Volunteer teams have been visiting refugees; we have had as many as sixteen to visit each time, and during a normal week we visit twice a week. We take food and toiletries and, for those we have come to know, we try and bring a small gift. Last week we spent time in the Jungle relaying information to each community. First, the Calais government won the right to shut down any place of business in the Jungle: restaurants, barber shops, vegetable stalls, and cigarette shops. Second, anyone continuing to work in the businesses can and will be arrested. With the help of others from over twenty organizations, including L’Auberge des Immigrants, Secour Catholique, Refugee Youth Center and The Migrants’ Law Project, we shared pamphlets containing information about the legal rights each person has in case they do get arrested and or harassed. The legal rights information was translated and printed into Arabic, English, Amharic, Farsi and Pashtu. \\nThe Jungle camp was supposed to be demolished on the 17 th of October. Instead, the government moved the date to the 24 th because that would give them “time” to figure out what to do with the unaccompanied minors. The idea is to register as many minors as possible. Some young people have been waiting more than a year to reunite with family. One volunteer likened the process to a child doing homework on the bus to class, after having weeks to get it done. \\nOn the 24 th registration lines were put into place: minors, families, vulnerable people suffering from physical and mental problems, and lastly those who wish to seek asylum in France all lined up. The government thought they would register 3000, but they only managed 1200 registrations. Today, both French and English police are supposed to begin taking down all the dwellings in the Jungle. They have begun destroying dwellings in the Sudanese quarter. The registration lines will continue until further notice. \\nWe asked minors we have come to know about their registration process. Many have registered and are staying in the containers; the containers are supposed to be spared from demolition. One of the children I have grown close to suffers from severe anxiety. Daily, I am reminded of his journey to Calais and the horrors he faced in Libya when his terrors began. The lines are too long; he did not make registration today. He will try again later this afternoon or tomorrow morning. I am nervous for everyone. There is so much misinformation; the refugees of the Jungle and other camps like Isberg hear differing reports which they then share amongst themselves. The tensions grow because we also cannot guarantee them anything. We also are given limited information. Would you trust anyone who cannot give you any guarantees? \\nEditor's Note Sabia Rigby co-coordinates Voices for Creative Nonviolence ( www.vcnv.org ). She is volunteering with the St. Maria Skobstova Catholic Worker house, founded by Brother Johannes Maertens, in Calais . \\nSource: ZNet . Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. ALL CAPTIONS AND PULL-QUOTES BY THE EDITORS, NOT THE AUTHORS.\""}, "time": 1742561868.7340398}