{"duration": 0.2908132076263428, "input_args": {"text": "'By Dr. Mercola\\nCan light affect your health? In this interview, Dr. Alexander Wunsch, a world class expert on photobiology, shares the hidden dangers of light-emitting diode (LED) lighting that most people are completely unaware of.\\nIn fact, this could potentially be one of the most important video interviews I’ve done, as it has enormous impacts — not only on preventing blindness as you age but it is also a pervasive hidden risk factor for sabotaging your health.\\nLargely as a result of energy efficiency, there’s been a major transition to using LED as a primary indoor light source. In this regard, it worked like a charm, reducing energy requirements by as much as 95 percent compared to incandescent thermal analog sources of lighting.\\nHowever, the heat generated by incandescent light bulbs, which is infrared radiation, is actually beneficial to your health, and hence worth the extra cost.\\nThere are major downsides to LEDs that are not fully appreciated. LED lighting may actually be one of the most important, non-native EMF radiation exposures you’re exposed to on a daily basis.\\nIf you chose to ignore these new insights, it can have very serious long-term ramifications. It could lead to age-related macular degeneration (AMD), which is the leading cause of blindness in the United States and elsewhere.\\nOther health problems rooted in mitochondrial dysfunction may also be exacerbated, and these run the gamut from metabolic disorder to cancer.\\n\\nDownload Interview Transcript \\nWhat Is Light? The definition of light, as applied to artificial light sources, is rather distinct. Visible light is only between 400 nanometers (nm) and 780 nm, but “light” is actually more than just what your eye can perceive. As explained by Wunsch:\\n“When we look at sunlight, we have a much broader spectral range, from somewhere around 300 nm up to 2,000 nm or so. For our energy efficiency calculation, it makes a big difference if we are talking about this broad natural range or if we are only talking about … vision performance \\n[T]he definition that we are only looking at the visible part of the spectrum [given in the 1930s]… led to the development of energy-efficient light sources like the fluorescent lamps or what we have nowadays, the LED light sources, because they are only energy efficient as long as you take the visible part of the spectrum [into account]… \\n[F]or example, [lamps providing] phototherapy with red light can be used in medical therapy to increase blood circulation, and this is a part we are taking away as long as we only look at the visible part. \\nPhysicists think that infrared radiation is just thermal waste. But from the viewpoint of a physician, this is absolutely not true; in the last 30 years there have been hundreds of scientific papers published on the beneficial aspects of a certain part in the spectrum, which is called near-infrared or infrared-A.” \\nWhat Makes Near-Infrared so Special? You cannot feel near-infrared as heat, and you cannot see it, but it has a major beneficial impact in terms of health. Near-infrared is what’s missing in non-thermal artificial light sources like LED.\\nThere’s also a difference between analog and digital forms of light sources, and this difference is another part of the complexity. In essence, there are two separate but related issues: the analog versus digital light source problem, and the spectral wavelength differences.\\nStarting with the latter, when you look at the rainbow spectrum, the visible part of light ends in red. Infrared-A or near-infrared is the beginning of the invisible light spectrum following red. This in turn is followed by infrared-B (mid-infrared) and infrared-C (far-infrared).\\nWhile they cannot be seen, the mid- and far-infrared range can be felt as heat. This does not apply to infrared-A, however, which has a wavelength between 700 and 1,500 nm.\\n“Here you have only very low absorption by water molecules, and this is the reason why radiation has a very high transmittance,” Wunsch says . \\n“In other words, it penetrates very deeply into your tissue, so the energy distributes in a large tissue volume. This near-infrared A is not heating up the tissue so you will not feel directly any effect of heat. \\nThis significantly changes when we increase the wavelength, let’s say, to 2,000 nm. Here we are in the infrared-B range and this already is felt as heat. And from 3,000 nm on to the longer wavelength, we have almost full absorption, mainly by the water molecule, and this is [felt as]heating.” \\nNear-Infrared Is Critical for Mitochondrial and Eye Health The near-infrared range affects your health in a number of important ways. For example, it helps prime the cells in your retina for repair and regenerate.\\nSince LEDs have virtually no infrared and an excess of blue light that generates reactive oxygen species (ROS), this explains why LEDs are so harmful for your eyes and overall health.\\nChromophores are molecules that absorb light. There’s an optical tissue window that ranges from 600 to 1,400 nm, which means it is almost completely covered by the infrared-A part of the spectrum. This optical tissue window allows the radiation to penetrate several centimeters or at least an inch or more into the tissue.\\nChromophores are found in your mitochondria and in activated water molecules. In your mitochondria, there’s also a specific molecule called cytochrome c oxidase, which is involved in the energy production within the mitochondria. Adenosine triphosphate (ATP) — cellular energy — is the end product.\\nATP is the fuel your cells need for all of their varied functions, including ion transport, synthesizing and metabolism. Remarkably, your body produces your body weight in ATP every day. And, while you can survive for several minutes without oxygen, were all ATP production to suddenly stop, you’d die within 15 seconds.\\nLighting Plays an Important Role in Biological Energy Production This is why this issue of lighting is so important. Light is a sorely misunderstood and overlooked part of the equation for biological energy production, specifically at the mitochondrial ATP level . As further explained by Wunsch:\\n“The cytochrome c oxidase, which is this [light]absorbing molecule, is the last step before the ATP is finally produced in the mitochondria. Here we have this tipping point where light in a wavelength range between 570 nm and 850 nm is able to boost energy production, especially in cells when energy production is depleted … \\nWe know today that many signs of aging, for example, are the consequence of hampered mitochondrial functioning, and so we have a very interesting … tool to enhance the energy status in our cells, in the mitochondria in our cells, and not only on the surface but also in the depths … of the tissue. This is one important aspect and there are hundreds of papers published on these positive effects … \\nInfrared saunas are another magnificent way to nourish your body with near-infrared light. But not just ANY infrared sauna. Most offer only FAR-infrared and are not full spectrum. Most also emit dangerous non-native EMFs. So you need one that emits low or no non-native EMFs.\\nAfter searching for a long time I finally found a near perfect one and hope to have it made to my customized specs in a few months. And it should be significantly less than $1,000. So stay tuned for this exciting development.\\nWound Healing and Anti-Aging Procedures Make Use of Near-Infrared These beneficial effects can be seen in wound healing and anti-aging procedures where near-infrared is employed. Since the cytochrome c oxidase is responsible for an increased production of ATP, the cell has a better supply of energy, which allows it to perform better, and this is true no matter where the cell resides.\\nThis means liver cells with more ATP will be able to detoxify your body more efficiently; fibroblasts in your skin will be able to synthesize more collagen fibers and so on, because ATP is crucial for all cellular functions. Wunsch expands on this even more in the lecture above.\\nAccording to Wunsch, as little as one-third of the energy your body requires for maintaining the thermal equilibrium comes from the food you eat. The electrons transferred from the food, primarily the fats and the carbohydrates, are ultimately transferred to oxygen and generate ATP. The more near infrared you get, the less nutritional energy is required for maintaining thermal homeostasis.\\nThat said, a differentiation is in order. Most of the METABOLICALLY USED energy does come from food. But there is a thermodynamic aspect to it as well. Maintaining a normal body temperature (37 degrees C or 98.6 degrees F) involves two mechanisms: Energy production in your mitochondria from food, and photonic energy (near-infrared radiation from sunlight and incandescent light bulbs) that is able to penetrate deeply into your tissue, even through clothing.\\n“The radiation can enter your body and then be transformed into longer wavelengths in the infrared part. They are very important for supporting the temperature level, the thermal energy level, of our body which is … a very crucial aspect. A lot of energy comes in the form of radiation and this is supporting our thermal balance,” Wunsch explains.\\nThe key take-home message here is that your body’s energy production involves not just food intake. You also need exposure to certain wavelengths of light in order for your metabolism to function optimally. This is yet another reason why sun exposure is so vitally important for optimal health.\\nAnalog Versus Digital Lighting LED lamps are a form of digital non-thermal lighting whereas incandescent light bulbs and halogens are analog thermal light sources.\\n“For a color changing system you have three different LEDs, a red, a green and a blue LED, and the intensity of these three colored channels has to be changed in order to achieve different color use, which is perceived by the eye in the end. The control of the intensity output of an LED is realized in a digital manner because it’s very difficult to have a low intensity in many different steps. \\nThe dimming of LEDs is realized by a so-called pulse-width modulation, which means the LEDs switch on to the full intensity and then they fully switch off, and then they switch on again. So we have the constant on and off in frequencies, which are higher than our eyes are able to discriminate. But on the cellular level, it is still perceivable for the cells … \\n[T]his causes a flicker, which is not perceivable for let’s say 90 percent of the population. But it’s still biologically active. And flicker is something that is very harmful to your [biology].” \\nYou’ve likely experienced this if you’re old enough to recall the older TVs that had a very visible and intense flicker. Modern flat screens do not have this perceptible flicker, but they’re still switching on and off. Scientists are now trying to develop systems capable of transmitting information via high-frequency flicker in the LED lighting to replace the wireless LAN system. According to Wunsch, this is a very bad idea, from a health perspective.\\n“I call these LEDs Trojan horses because they appear so practical to us. They appear to have so many advantages. They save energy; are solid state and very robust,. So we invited them into our homes. But we are not aware that they have many stealth health-robbing properties, which are harmful to your biology, harmful to your mental health, harmful to your retinal health, and also harmful to your hormonal or endocrine health,” he says.\\nUnfortunately, the use of LEDs has been mandated by federal policy in both the U.S. and much of Europe, in an attempt to conserve energy. While inarguably effective in that regard, the biological impact of these bulbs has been completely ignored, and by mandating them, options have been restricted.\\nUnderstanding the Dangers of LEDs Understanding how LEDs can harm your health begins with the recognition that light emitted from an LED bulb is of a different quality than a natural light source. Normally, a natural light source is a black body radiator that gives off all kinds of wavelengths in a more or less continuous manner.\\nLEDs are fluorescent lamps, consisting of a blue LED, a driver LED, and a fluorescent sheet that covers the blue LED, transforming part of the blue light into longer wavelengths, thereby creating a yellowish light. The yellowish light from the fluorescent layer combines together with the residual blue light to a kind of whitish light, a large portion of which is an aggressive blue light.\\n“Blue has the highest energy in the visible part of the spectrum and produces, infuses, the production of ROS, of oxidative stress,” he says . \\n“The blue light causes ROS in your tissue, and this stress needs to be balanced with near-infrared that is not present in LEDs. We need even more regeneration from blue light, but the regenerative part of the spectrum is not found in the blue, in the short wavelength, part. It’s found in the long wavelength part, in the red and the near-infrared. So tissue regeneration and tissue repair results from the wavelengths that are not present in an LED spectrum. \\nWe have increased stress on the short wavelength part and we have reduced regeneration and repair on the long wavelength part. This is the primary problem … [W]e don’t have this kind of light quality in nature. This has consequences. The stress has consequences in the retina; it has consequences in our endocrine system.” \\nYou probably know by now that blue light in the evening reduces melatonin production in your pineal gland. But you also have cells in your retina that are responsible for producing melatonin in order to regenerate the retina during the night.\\nIf you use LED lights after sunset, you reduce the regenerative and restoring capacities of your eyes. Needless to say, with less regeneration you end up with degeneration. In this case, the degeneration can lead to AMD, which is the primary cause of blindness among the elderly. However, and this is that most fail to appreciate, LED light exposure that is not balanced with full sunlight loaded with the red parts of the spectrum is always damaging to your biology. Just more so at night.\\nSo, to summarize, the main problem with LEDs is the fact that they emit primarily blue wavelengths and lack the counterbalancing healing and regenerative near-infrared frequencies. They have very little red in them, and no infrared, which is the wavelength required for repair and regeneration.\\nWhen you use these aggressive lower frequencies — blue light — it creates ROS that, when generated in excess, causes damage. So when using LEDs, you end up with increased damage and decreased repair and regeneration.\\nAre There Any Healthy LEDs? There’s a wide range of LED lights on the market these days. Some are cool white, others are warm white, for example. The former emits higher amounts of harmful blue light. The warm LEDs can be deceptive, as they give out a warm-appearing light but do not actually have the red wavelength. The warmth comes from masking the blue with high amounts of yellow and orange.\\nThere are also LEDs available with less blue, which are closer to the spectral distribution of incandescent lamps with regard to the blue part of the spectrum. Unfortunately, without tools to measure it, you won’t know exactly what you’re getting. This is in sharp contrast to an incandescent light bulb, where you know exactly what kind of light spectrum you’re getting.\\n“With LED, the layman is not able to tell if it’s a tailored spectrum where you have the blue part only masked by excessive parts of other spectral regions,” Wunsch says . “There are different technologies … Soraa, for example, have violet driver LED, not blue … By their technology, the red is a little bit more emphasized compared to the standard white light fluorescent LEDs. \\nSo there are in fact better and worse LED types around. But the spectral distribution is just one thing … We are interested in the R9, which represents the full reds. This information is sometimes given on the package. You have, for example, CRI, which is the color rendering index of 95 with an R9 of 97 or so. This is the only sign for the customer that you have a high level or a high index for the R9.” \\nHow to Identify a Healthier LED So, when buying LEDs, one way to get a healthier light is to look at the CRI. Sunlight is the gold standard and has a CRI of 100. So do incandescent light bulbs and candles. What you’re looking for is a light that has an R9 (full red spectrum) CRI of about 97, which is the closest you’ll ever get to a natural light with an LED. Another factor to look at is the color temperature. There are two different kinds of color temperature:\\n1. Physical color temperature , which means the temperature of your light in degrees Kelvin (K). This applies to sunlight, candlelight, incandescent lamp light and halogens. What this means is that the source itself is as hot to the touch as the color temperature given.\\nThe sun, for example, which has a color temperature of 5,500 K, has a temperature of 5,500 K at its surface, were you to actually touch the sun. Incandescent lamps have a maximum of 3,000 K, as the filament would melt if the temperature got any higher.\\n2. Correlated color temperature . This is a measurement that tells you how the light source appears to the human eye. In other words, it is a comparative measurement. A correlated color temperature of 2,700 K means it looks the same as a natural light source with a physical color temperature of 2,700 K.\\nThe problem here is that while such a light LOOKS the same as a natural light, it does not actually have the same quality, and your body, on the cellular level, is not fooled by what your eye sees. On a cellular level, and on the level of the retina, the majority of the light is still cold, bluish white, despite its apparent, visible warmth.\\nIncandescent light bulbs have a color temperature of 2,700 K whereas LEDs can go up to 6,500 K — the really bright white LED. In this case, the closer you are to incandescent, the better. Lastly, there’s the digital component, which is virtually unavoidable no matter what. To determine how good or bad a particular LED is:\\n“You would have to measure somehow if the LED produces flicker or not. Two, three years ago, it would have been much easier because the camera of an older smartphone was not as high-tech equipped as they are today. With an old smartphone camera, when you look into the light source, you can see these wandering lines, so you can detect if the light source is flickering,” Wunsch explains.\\nA simpler way would be to purchase a flicker detector, which are available fairly inexpensively. Another way to determine the flicker rate would be to use the slow motion mode on your camera. Record the light source in slow motion mode and check it for visible flickering.\\nUnfortunately, it doesn’t always work. Some newer cameras and smartphones have a built in algorithm that will detect the flicker frequency and change the shutter speed accordingly to improve the recording, thereby eliminating the interference. If your camera has this algorithm, it will not record a visible flicker even if it’s there.\\nHealthier Solutions I like being on the cutting edge of technology and I quickly switched out all my incandescent bulbs for LED lighting. I now realize the enormity of my mistake, but at the time — going back almost 10 years now — I was completely unaware that it could have health consequences. Before that, I used full-spectrum fluorescents, which is equally deceptive, as it is full spectrum in name only.\\nI’m now convinced LED light exposure is a very serious danger, especially if you are in a room without natural light. The biological risks are somewhat mitigated if you have plenty of sunlight streaming through windows. At night, LEDs become a greater danger no matter whether you’re in a windowless room or not, as there is no counterbalancing near-infrared light.\\nPersonally, I’ve not swapped all my lights back to incandescent because they’re such energy hogs. But all the lights I have on at night have been switched to clear incandescent bulbs without any coating that changes their beneficial wavelengths. So the take-home message of this interview is to grab a supply of the old incandescents if you can and switch back to incandescent light bulbs.\\nJust remember to get incandescents that are crystal clear and not coated with white to give off a cool white light. You want a 2,700 K incandescent, thermal analog light source. Actually, fragrance-free candles would be even better. Be particularly mindful to only use this type of light at night. After sunset, I also use blue-blocking glasses .\\n“It is definitely a good idea to keep away the short wavelengths in the evening, so after sunset. It’s also a good idea not to intoxicate your environment with too much light. We know that artificial light levels at night have reached insane intensity. The candle, the intensity of the candle for example, is absolutely sufficient for orientation. \\nIf you have to read in the evening or at night time, my personal favorite light source for reading tasks is a low-voltage incandescent halogen lamp, which is operated on a DC transformer. Direct current will eliminate all the dirty electricity and it will eliminate all the flicker. \\nThere are transformers available where you can adjust the output between 6 volts and 12 volts. As long as it’s direct current, there is no flicker, there is no dirty electricity, and you are able to dim the halogen lamp into a color temperature that is comparable to candle light even. This is the softest, the healthiest electric light you can get at the moment,” Wunsch notes.\\nLow-voltage halogen lights are also very energy efficient — up to 100 percent more energy efficient than the standard incandescent lamp. Just be sure to operate it on DC. Incandescent lights, including halogen, can be operated at both AC and DC, but when operating on AC, you end up generating dirty electricity, Wunsch explains. On DC, you get no electrosmog with a low-voltage halogen.\\nLight Comparisons The following graphic illustrates the differences in color spectrum between an incandescent light, which has very little blue, compared to fluorescent light and white LED.\\n\\nThis next graph illustrates the differences between daylight, incandescent, fluorescent, halogen, cool white LED and warm white LED. As you can see, there’s a tremendous difference between incandescent and warm LED. While they may look the same to the naked eye, there’s no comparison when it comes to their actual light qualities.\\n\\nLooking at the spectral differences between incandescent and halogen lamps, there seems to be no difference at all. In order to elucidate the disparity, Wunsch did some measurements of incandescent and halogen lamps using his UPRtek MK350S spectrometer. The differences are almost imperceptible, indeed.\\n\\nSpectrum of a standard incandescent lamp: Correlated color temperature (CCT) = 2890 K.\\n\\nSpectrum of a energy saving halogen lamp: Correlated color temperature (CCT) = 2842 K.\\nHow to Make Digital Screens Healthier When it comes to computer screens, Wunsch suggests reducing the correlated color temperature down to 2,700 K — even during the day, not just at night. Many use f.lux to do this, but I have a great surprise for you as I have found a FAR better alternative that was created by Daniel, a 22 year old Bulgarian programmer that Ben Greenfield introduced to me.\\nHe is one of the rare people that already knew most of the information in this article. So he was using f.lux but was very frustrated with the controls. He attempted to contact them but they never got back to him. So he created a massively superior alternative called Iris. It is free, but you’ll want to pay the $2 and reward Daniel with the donation. You can purchase the $2 Iris software her e. OLED screen technology is another development that may be better than conventional screens.\\n“[With] the OLEDs technology, I’m not sure if the color is really stable in every angle you can look at the display,” Wunsch says . “But definitely, if you have the screen technology where black is really black, then you have less radiation coming into your eyes and the OLEDs technology is able to provide this. \\nSo the high contrasts between the black and white, all the black areas in the thin-film-transistor (TFT) screen or the standard screen are not really black. They are also emitting shortwave radiation. The OLED screen only emits where you see light, where there is black on the screen, there is no light. This might be preferable as long as you have no problems with the [viewing]angle.” \\nTo Protect Your Health and Vision, Stick to Incandescent Lights LEDs are a perfect example of how we’re sabotaging our health with otherwise useful technology. However, with knowledge, we can proactively prevent the harm from occurring. In summary, we really need to limit our exposure to blue light, both during the daytime and at night. So for nighttime use, swap out your LEDs for clear bulb incandescents, or low-voltage incandescent halogen lights that are run on DC power.\\nI also strongly recommend using blue-blocking glasses after sundown, even if you use incandescent light bulbs. Without these modifications, the excessive blue light from LEDs and electronic screens will trigger your body to overproduce ROS and decrease production of melatonin , both in your pineal gland and your retina, the latter of which will prevent repair and regeneration, thereby speeding up the degeneration of your eyesight.\\n“One thing to emphasize again, it’s not the blue light coming from the sun itself which we should be concerned about. It’s the blue light, the singular high energy visual light (HEV), which comes from cold energy-efficient non-thermal light sources. This is what causes the problem, not the blue light which comes together with longer wavelengths in a kind of natural cocktail that has the beneficial near-infrared spectrum … \\nThe light surrogates from non-thermal light sources, these are [what cause]problems, and you have to be clever to avoid these Trojan horses. If you want to make it [safe], stay with the candles, stay with the incandescents,” Wunsch says.\\nAnother Healthy Light Alternative Candles are even a better light source than incandescent bulbs, as there is no electricity involved and is the light that our ancestors have used for many millennia so our bodies are already adapted to it. The only problem is that you need to be very careful about using just any old candle as most are toxic.\\nAs you may or may not know, many candles available today are riddled with toxins, especially paraffin candles. Did you know that paraffin is a petroleum by-product created when crude oil is refined into gasoline? Further, a number of known carcinogens and toxins are added to the paraffin to increase burn stability, not including the potential for lead added to wicks, and soot invading your lungs.\\nTo complicate matters, a lot of candles, both paraffin and soy, are corrupted with toxic dyes and fragrances; some soy candles are only partially soy with many other additives and/or use GMO soy. There seems to be a strange mind-set that exposure to small amounts of toxins is OK, even though the exposure is exponential over time!\\nThe soy is non-GMO, is clean burning without harmful fumes or soot, is grown in the U.S. and is both sustainable and renewable. Also, my candles are completely free of dyes. The soy in these candles is not tested on animals, is free of herbicides and pesticides.\\nIt’s also kosher, 100 percent natural and biodegradable. All of my fragrances are body safe, phthalate- and paraben-free, and contain no California prop 65 ingredients. The wicks are simply flat braided cotton coated in a natural vegetable wax and self-trimming, which reduces carbon build up.\\nEnjoying a Circle of Life Farms naturally good soy candle and following the simple burn instructions — located inside the candle lid — will give approximately 70+ hours of burn time. Every candle is hand-poured with love for you to enjoy a cooler, cleaner burn, all while being kind to the both the environment and yourself.\\nYou can search online healthy candles, but if you like, you can use the ones I found at www.circleoflifefarms.com . This is not an affiliate link and I earn no commissions on these candles; I just thought you might benefit from the ones I now use in my home.\\nSource: Mercola \\n'"}, "time": 1742628436.9064734}