{"duration": 0.09434008598327637, "input_args": {"text": "'Home › WORLD NEWS › SIXTY KILLED IN NEW US-SAUDI WAR CRIME IN YEMEN SIXTY KILLED IN NEW US-SAUDI WAR CRIME IN YEMEN 0 SHARES \\n[10/31/16] The murderous and criminal character of the US-Saudi war against Yemen, the poorest country of the Middle East, was laid bare once again Sunday with the report of an air strike that claimed the lives of scores of civilians in the Red Sea port city of Al Hudaydah. \\nThe bombs struck a prison facility inside a government compound controlled by the Houthi rebel movement, which controls the north and west of the country. \\nAccording to reports from Yemen, more than 60 people were killed in the air strike, which demolished two detention centers, and at least 40 more were wounded. The Saudi warplanes used their familiar tactic of dropping bombs on the facility and then waiting for people to rush to the scene to search for survivors before bombing again to achieve the maximum death toll. \\nPrisoners and guards alike were buried in the rubble. Photographs released from the scene showed lines of bodies covered in sheets. \\nThe prison bombing, which took place at about midnight Saturday, followed close on the heels of another air strike in the western city of Taiz in the western Yemeni highlands, the country’s third largest population center and a major cultural center. \\nTaiz has been the scene of bitter fighting between the Houthi rebels and Saudi-backed ground forces for the past year and a half. \\nSaturday’s raid there targeted the al-Salw residential district near the front lines, demolishing several homes. Among those struck was the house of Abdullah Abdo, in which the US-supplied bombs dropped by Saudi jets took the lives of 11 members of the same family. Many of the victims were children. Reportedly seven of the dead were women. \\nThe air strikes Saturday were the bloodiest since October 8, when Saudi warplanes attacked a funeral home in the capital of Sana’a, killing and wounding at least 700 people. As many as 155 people died in that attack, which left many of the wounded without limbs and otherwise maimed. Like the latest strike on the prisons, it was a “double tap” bombing raid, timed to ensure that those rushing to the aid of the wounded would also be killed. \\nThere is every reason to believe that this earlier attack was not a matter of collateral damage or mistaken targeting, but rather a deliberate attempt to decapitate the Houthi regime in Sana’a. The funeral that was hit was for the father of the government’s interior minister and was attended by a number of senior officials, who lost their lives. \\nIn the aftermath of that horrific bombing, US officials issued mealy-mouthed statements to the effect that Washington’s support for the Saudi war was “not a blank check” and that it would be realigned in accordance with “American values.” \\nSince then, US aid has continued to flow. US planes are continuing to refuel Saudi fighters in midair so that they can carry out these murderous attacks. And the US Navy has itself joined the onslaught, launching Tomahawk cruise missiles at alleged Houthi radar stations, supposedly in retaliation for missiles fired at a US warship in the Red Sea. US military officials have subsequently acknowledged doubts about the supposed missile attacks, raising the possibility that a US Navy radar malfunction had generated ghost signals. \\nJust one day before the latest atrocities carried out against the Yemeni people, both the United States and Saudi Arabia were voted onto the United Nations Human Rights Council. The elevation to this panel of the two countries most responsible for killing an estimated 10,200 Yemenis in the past year and a half, the great majority of them civilians, and pushing at least half the population to the brink of starvation serves to unmask the hypocrisy of the entire “human rights” framework for justifying imperialist wars and interventions all over the globe. Post navigation'"}, "time": 1742561807.6789305}