{"duration": 0.0573573112487793, "input_args": {"text": "'Comments \\nDonald Trump, the draft-dodging Russophile who cloaks his xenophobia and bigotry in a veneer of false patriotism, reportedly had to ask what a Gold Star family was after he attacked the Muslim-American parents of war hero Capt. Humayun Khan. Trump has thus once again proven his patriotic rhetoric to be nothing but ignorant and self-serving bombast. \\nThe Trump-Khan feud arose after Khizr Khan, Capt. Khan’s father, gave a powerful speech at the Democratic National Convention over the summer repudiating Trump’s hateful anti-Muslim rhetoric. Khan said that Trump had “sacrificed nothing” while he and his wife had paid the ultimate sacrifice for America, and famously held up his pocket-size Constitution and offered to lend it to Trump. Trump, who seems physically incapable of responding to criticism with anything other than blustering attacks, went on a tirade against Mr. Khan, adding for good measure that his wife Ghazala was not allowed to speak at the DNC because she is a Muslim. \\nWhen one of Trump’s advisers warned him against attacking a Gold Star family, Trump reportedly responded, “what’s that?” Paul Manafort, Trump’s campaign manager at the time, apparently had to repeatedly explain to the candidate that a Gold Star family is a family that has lost a loved one serving in war. In a surprising bit of pushback from a Trump campaign staff that seems to consist overwhelmingly of yes men, Manafort reportedly told Trump in response to his feud with Khan that the election “is about the American people, it’s not about you.” \\nThat Trump has the audacity to criticize war heros like Capt. Khan and Sen. John McCain after using his privilege to avoid war and knowing nothing of their sacrifice, that he is so presumptuous as to adopt the mantle of fighting for America while knowing nothing about American institutions, is proof that he is nothing but an opportunistic demagogue who will say anything to appease his own ego. In stark contrast to Trump’s sleaze, however, Khizr Khan has, in the best American tradition, taken the high road. \\nKhan has continued to speak out for American values and against Trump’s hate-peddling. Last week he said that “there comes a time in an ordinary citizen’s life where you have to gather all the courage you have and you stand up and speak against tyranny and speak against un-American hate.” Khan has continued to get under Trump’s skin, with the nominee replying to that speech with the hackneyed lie that he opposed the Iraq war. Perhaps the reason Trump has been so irritated by Mr. Khan is that he has demonstrated so much better than Mr. Trump himself what it means to be a true American.'"}, "time": 1742563669.6841943}