{"duration": 0.03153729438781738, "input_args": {"text": "'BREAKING : Most Accurate Poll in Last 3 Election Cycles Predicts Trump Victory #ElectionDay BREAKING : Most Accurate Poll in Last 3 Election Cycles Predicts Trump Victory #ElectionDay Breaking News By TruthFeedNews November 7, 2016 \\nThe final national poll from the IBD/TIPP, the pollster with the highest rated accuracy the last 3 election cycles predicts a Trump Victory. \\n2004, 2008 and 2012 IBD outranked Pew, ABC, NBC, Fox news, and Rasmussen among many other pollsters with the top ranking and average margin of error of less than one percent. \\nIn their final poll prior to Election day, IBD/TIPP has Trump ahead 43% to 41% in a nail biter. While winning the popular vote would not in itself guarantee a Trump victory, if IBD / TIPP is once again accurate and Trump has a 2% or greater margin in the popular vote, it would far more likely than not he would also catapult above the 270 electoral votes needed to secure the Presidency. \\nIBD’s polling partner TechnoMetrica uses “traditional” telephone methodology using live interviewers for data collection for its public opinion surveys. Roughly 65% of interviews come from a cell phone sample and 35% from a Random Digit Dial (RDD) land line sample. \\nIBD’s result is a outlier if you compare it to polls conducted by network as CBS News, ABC, NBC and Fox News have Clinton up between 1 and 4% in their final pre-Election polls. \\nHowever, today’s LA Times / USC poll has Trump with an even larger 5% margin of victory. \\nWe won’t have to wait long to see which national poll ends up being right. Trump supporters certainly hope the reigning king for accuracy will prevail once again. \\nFor once in our lifetime, we the people have an opportunity to elect a President who was NOT chosen by Multinational Corporations, Big Banks, DC Elites, and the Globalist Lapdog Mainstream Media. \\nPlease like and share if you are a TRUMP VOTER! '"}, "time": 1742562289.9577954}