{"duration": 0.03979969024658203, "input_args": {"text": "'IRONY ALERT: First Person Arrested For Voter Fraud Is A Trump Supporter By Andrew Bradford on October 29, 2016 Subscribe \\nEver since the public opinion polls began showing him behind in the 2016 race for the White House, GOP nominee Donald Trump has alleged that the political system and election is “rigged.” He has even recommended that his supporters show up at polling places to observe what is taking place and assure the election isn’t “stolen” via voter fraud. \\nWhich brings us to Thursday in Des Moines, Iowa. Terri Lynn Rote voted early at an election office in her hometown. A few hours later, Rote then went to another polling location and attempted to vote a second time. She was arrested and charged with first-degree election fraud, a Class D felony. \\nThe irony is almost too much to stomach, isn’t it? \\nPolk County Auditor Jamie Fitzgerald said it’s the first time in 12 years he can remember ever having to report potential voter fraud to the authorities. \\nWhat Trump and other Republicans fail to say when they warn of voter fraud on the left is that based on the demographics of the American electorate, there is no need for Democrats to try and commit fraud when it comes to a national election. In fact, it is far more likely that the GOP will have to try to cheat or intimidate voters (with restrictive voter ID provisions and by cutting back the number of polling places or early voting days) in order to remain competitive. \\nIt should also be noted that when Trump was winning in the Republican primaries, you never once heard him scream about anyone trying to cheat or rig an election. It was only after his own numbers began to slip and he found himself behind by as much at 14 points to Hillary Clinton that such talk began. \\nSo, Donald, what say you about the election being rigged in light of Terri Rote? Donald? Hmm…guess that silence tells us all we need to know. \\nHere’s the Donald alleging that the election is rigged against him: \\nFeatured Image Via Des Moines Police Dept. About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect'"}, "time": 1742562330.4227653}