{"duration": 0.03143453598022461, "input_args": {"text": "'Leave a reply \\nJoseph P Anthony – November 2016 starts on a pretty similar note to that of the previous month except there is feeling of change in the air, that’s because last month’s New Moon in Scorpio marks another momentous crossroads for humanity. \\nThe sign Scorpio rules death, as well as transformation. Its ruler is Pluto, the Greek god of the Underworld, the terrain of the “unconscious”. What needs to die this month before it can be reborn? Scorpio is the only astrological sign that has three symbols- the Scorpion (physical), the Eagle (psychological) and the Phoenix (spiritual) – showing that there are three levels of transformation to be achieved before true metamorphosis can occur. \\nUnfortunately, the mood in November isn’t peaceful at all, not only do we have the presidential election show here in the US, but because we also have Venus and Mars switching signs along with a strong alignment between Jupiter, Pluto and Venus towards the end of the month. As we start off November we have action-oriented Mars still in Capricorn until the November 8th, in the same sign as Pluto and in a deplorable lack of understanding with Jupiter from Libra and Uranus from Aries. But the exact aspects have already been perfected, so the frequency of accidents or violence generated by this combo should be somewhat diminished. \\nThe Full Moon this month will occur in the steadfast sign of Taurus on November 14th. This Taurus lunation serves to calm us down and take a load off. Why rush, why fuss, why push, why pull? Taurus wants us to take a chill pill, man. Full moons tend to be emotional, but a Taurus full moon tends to be calmer. Emotionally, Taurus tends to not get riled up the same way that other signs can. So take it easy, and don’t stress the small stuff. Kick back, and let things happen in their own time and way. \\nTaurus rules our finances, so this Full Moon we see some issues having to do with money in general such as stock market going up or down, or tackling financial issues and finding resolutions on a personal level. We can see this with individuals, groups, corporations, governments. We can see smart financial moves rewarded, and financial recklessness punished. We may find ourselves more indulgent during this lunation since Taurus does love food, drink and sensual activities, so if you’re trying to be good, remember; moderation! \\nHave a good month friends ! Joseph P. Anthony SF Source Joseph P Anthony Oct. 2016 Share this:'"}, "time": 1742628568.7692397}