{"duration": 0.09283328056335449, "input_args": {"text": "'Headlined to H3 10/28/16 - Advertisement - \\nGOP presidential contender Donald Trump giddily and predictably wasted no time when FBI Director James Comey announced that the agency was looking at more Clinton emails. For the umpteenth time, Trump branded her a criminal and demanded that Americans not let her \"criminal enterprise\" into the Oval Office. No matter that Comey made it clear that there is no evidence at the moment that there was anything improper, let alone illegal, in the emails. But the revelation that the Feds were looking at them coming in the stretch run to the White House was more than enough to set off talk of the perennially mentioned October surprise that could derail a presidential candidate\\'s presidential bid; in this case the candidate being Clinton. \\nEven if there is something amiss in the emails, it won\\'t change the race\\'s outcome. Trump\\'s path to an electoral vote win was always dicey at best, but more likely, impossible. The big electoral states such as California, New York, Illinois, Maryland, Washington, and a handful of other less electoral rich states are solid lock down Democratic states. The six or seven key swing states that are crucial, either trend Democratic. In nearly all cases, they voted for President Obama in his election and re-election bids, and are almost certain to stay that way through Election Day. \\nHaving said that, the email flap just won\\'t go away. This does pose something else that could be problematic for Clinton in the White House. That\\'s turning the GOP into an even more ferocious, obstructionist, take-no-prisoners party that will wage open war against her administration. Trump and the GOP have hammered home the line that Clinton is shady, untrustworthy and, less charitably, a serial liar. It\\'s had an effect. Her approval and popularity ratings have hovered just slightly above those of Trump. In some pithy polls, voters vote \"neither\" for and not for either her or Trump. The race to the bottom in the presidential campaign has been fed by the near fetish focus by much of the mainstream media and far too many pundits on the sex and corruption allegations against respectively Trump and Clinton. \\nThe FBI\\'s announcement of more email probes means that Clinton will have to take precious time out from her campaign focus on the issues that should and do really matter to again answer questions about what she did and why she did it with her emails. Reporters will shout this at her no matter what point she\\'s trying to make about jobs, health care, or a foreign policy matter. \\nOnce in the Oval office, this fetish isn\\'t likely to end, Trump and the GOP will see to that. The opening salvo came from Arizona Senator John McCain when he saber rattled Clinton by calling for the rejection of any Clinton SCOTUS pick. Even if the Democrats take back the Senate, that threat is still not just hot air. The GOP will still have enough Senate votes to delay, foot drag, obstruct, harass, pick and probe endlessly at, and ultimately filibuster a Clinton pick. The hope being that this will force Clinton to withdraw the pick, and send the message that the choice for the High Court must pass the hard-nosed conservative ideological litmus test that\\'s the GOP set piece for a SCOTUS judge. \\nThe warfare will be even worse in the House which the GOP almost certainly will control. House Speaker Paul Ryan gave a huge signal just how fierce that warfare against her will be. He was barely a step behind Trump in climbing all over the Comey announcement about the emails to lambaste Clinton. - Advertisement - \\nIf Clinton moves quickly as she\\'s promised with her plan to ramp up spending on jobs and economic reconstruction to the tune of $300 billion, this will send the GOP scurrying even faster to the barricades. It will try and toss every barrier it can in her way, making all kinds of wild charges that the spending is nothing more than a pork barrel, gravy leaden, pay out to the urban poor, and disadvantaged, at the expense of the long suffering, high tax paying white middle-class. \\nClinton takes office with the GOP manufactured and Trump fed cloud of suspicion hanging heavily over her. The great danger is that this will plant the seed even deeper in the public that the Clintons are the personification of sleaze. This in turn would blur, ignore and flat out dodge any real talk about tax reform job growth and the economy, health care, wealth and income inequality, civil rights, environmental concerns and criminal justice reforms. \\nClinton\\'s continuing email problems can\\'t make Trump into what he isn\\'t and never was. And that\\'s a credible, qualified choice to occupy the Oval Office. It just makes it that much easier for the GOP to do even more to make it harder for Clinton who is that choice to do the job that she will be elected to do. \\nEarl Ofari Hutchinson is an author and political analyst. His latest book is \"What We Can Expect from President Clinton\" (Amazon Kindle) He is an associate editor of New America Media. He is a weekly co-host of the Al Sharpton Show on Radio One. He is the host of the weekly Hutchinson Report on KPFK 90.7 FM Los Angeles and the Pacifica Network. - Advertisement -'"}, "time": 1742562275.8710237}