{"duration": 1.6683158874511719, "input_args": {"text": "\"1 comment \\nGee, the State Department and Hillary Clinton’s campaign seem really cozy don’t they? If I’m not mistaken, not only is this unethical, it’s illegal. Last year, the State Department tipped off the Clinton campaign that a New York Times reporter was digging into her email scandal. The State Department had claimed that they had not worked to help Clinton during the whole corrupt mess. Guess what? They lied. \\nMike Schmidt is the reporter that broke the original story on the Hildabeast using a private email account and a home brewed server. They were keeping tabs on the guy and running to the Clinton campaign to report on what he was doing so they could head it off at the pass. That’s called collusion. The State Department should go under immediate review and heads should roll over this. What blatant corruption. \\nFrom The Daily Caller: \\nThe State Department tipped the Hillary Clinton campaign off last year that a New York Times reporter was asking questions about Clinton’s emails. \\nThe revelation undermines the State Department’s claims that it has not worked to help Clinton during the ongoing email scandal. \\n“State just called to tell me that Mike Schmidt seems to have what appear to be summaries of some of the exchanges in the 300 emails the committee has,” Nick Merrill wrote in a March 14, 2015 email . \\nSchmidt is the Times reporter who broke the news that Clinton used a private email account as secretary of state. The article was published on March 2, 2015. Clinton had turned more than 50,000 emails over to the State Department in Dec. 2014. The State Department then provided around 300 emails to the House Select Committee on Benghazi, which was chaired by South Carolina Rep. Trey Gowdy. \\nThe emails seem to indicate that Clinton’s team suspected Trey Gowdy of leaking the contents of Clinton’s emails to Schmidt. “Again, it appears that he does not have the email but that someone, likely from the committee, is slipping him cherry-picked characterizations of the exchanges,” Merrill wrote. “I haven’t heard directly from Schmidt yet but will circle back when I do.” Other Clinton campaign officials were not pleased with the news. In fact, they were pissed and went on a war footing over it. \\n“This is no bueno,” communications director Jennifer Palmieri wrote. “This is some kind of bullshit.” “If Gowdy is doing selective leaks, we are in very different kind of warfare.” This exchange was of course exposed by WikiLeaks… man, the Hildabeast must really hate those guys. \\nAnd it gets even worse. Another email sent days before Schmidt published his first bombshell report on the Clinton emails, shows that Democrats on the Benghazi Committee also tipped off the Democrat’s team that the reporter was snooping around. There’s not a damned one of these Democrats that have any honor. Not one. “Talked to [Clinton attorney Heather Samuelson] late afternoon aand [sic] told her I’d heard from Dem Staff Director on Benghazi Select Comm that NYT was sniffing around, maybe to do a story on State production to Committee or on our production to State,” Clinton lawyer David Kendall wrote on Feb. 28th, 2015. \\n“I’d gotten a call from NYT’s Mike Schmidt (very young) about 2:00 pm–said nothing on background or on record. I didn’t feel he had anything, but. We may get a further inquiry from him over weekend.” This indicates to me that these idiots had no idea how big the NYT’s story would be. \\nKendall also wrote that Schmidt attempted to get him to hand over copies of Clinton’s emails that had already been produced for the Benghazi Committee. “He knew that some of the HRC dox had been produced — wasn’t sure if they all had been. He knew that State had asked other former SOS’s for their emails but didn’t know what the response was. I couldn’t tell what his likely angle was (and even if he had one),” Kendall wrote. \\nThis isn’t the first time there has been dirty dealings between the State Department and other government agencies with Team Clinton. It surely won’t be the last. Our government definitely needs an enema. Related Items Terresa Monroe-Hamilton \\nTerresa Monroe-Hamilton owns and blogs at NoisyRoom.net . She is a Constitutional Conservative and NoisyRoom focuses on political and national issues of interest to the American public. Terresa is the editor at Trevor Loudon's site, New Zeal - trevorloudon.com . She also does research at KeyWiki.org . You can . NoisyRoom can be found on Facebook and on Twitter .\""}, "time": 1742563516.5345879}