{"duration": 0.2291240692138672, "input_args": {"text": "'Appearing on the Jason and Burns show on KIRO Radio, Breitbart Senior editor MILO described himself as “what the future of conservative politics has to look like. ”[“So when we talk about Milo Yiannopoulos,” began show host Zak Burns, “the brand is often defined as this racist,   member who spouts hate speech and should not be allowed on college campuses. When you look back at how you’re targeted, particularly your content, do you see any points that the left is making that may be valid?”  “Ah, no, not really!” replied MILO. “They’re determined to smear and lie and misrepresent at every available opportunity anyone who dares to be even slightly right of center. Now they’re particularly upset with me because I happen to be a conservative gay guy and have black boyfriends and God knows what else so they can’t get me on racism, they can’t get me on sexism, they can’t get me on homophobia, they can’t get me with any of their usual strategies. ” MILO continued, “They are left with the horrifying prospect of actually having to argue on the facts, on the merits and reasoned logic and data and they’re not very good at that. Because they haven’t been doing that for about thirty years and they’ve forgotten how. ” MILO further stated, “The name calling strategies and the smear tactics simply don’t work on me, they haven’t worked for some time actually it’s just that nobody really realised. This last election we saw exactly what the results are when the media goes after people they’re and baselessly calls them names, people tend to vote almost out of spite and mischief and defiance of the politically correct establishment. They vote for somebody, even somebody like Donald Trump. ” “I think my success is part of that too, there’s sort of two MILO’s really, there’s the MILO that the Breitbart fans know, my readers know, the people who come to my shows know which is a sort of slightly waspish, trolly, mischievous provocateur who thinks very deeply, reads very widely, and asks people to reconsider things that they thought they knew. And then there’s the version in the media which is some sort of bizarre,   white supremacist monster. Nobody recognises that picture in the same way that they didn’t really recognise the picture of Donald Trump painted by CNN and The New York Times. ” “Trust me, nobody at Breitbart cares about having a token gay on staff,” said MILO discussing what it’s like to be a non stereotypical conservative. “They couldn’t give two tosses one way or the other, the fact is they like me because I’m mischievous and fun and interesting and smart and they just want me around to start conversations. You know there’s always this sort of assumption, which comes precisely from the identity politics that I’m attacking, that there must be something wrong with you, there must be some sort of tokenism going on, you’re somebody that was sort of acquired and broken into, you’re a black guy who somehow accidentally ended up Republican or you’re a gay who somehow accidentally ended up Republican and there’s something wrong with you so they’re using you because you’re atypical of the whole, well I’m not atypical of the whole. ” MILO continued, “In the last election in the UK, 50% of gay men said that they were voting for the conservatives, for the   party in the UK. There are vast numbers of homosexuals, not just in the Republican party but who love Donald Trump because of course they do! He’s bombastic, he’s fantastic and camp and all the rest of it but he’s also, A) very strong on Islam and B) very strongly against political correctness. Things that are very important to gays. ” “Now nobody covers that,” said MILO. “No one really pays attention to it, you’ll never really see it in the New York Times, but it is a fact, and I’m very much not a token, in fact I’m what   politics looks like now and because the media has been covering this so badly for so many decades you just haven’t worked that out yet. This is what young conservatives look like, they’re fun, mischievous, dissident, punk, trolly, good looking, fashionable. The trendy direction to go, if you want to irritate your parents, you want to get tossed out of polite society, all the things that you would have done if you were a punk in the 60’s or 70’s or you were looking at Madonna in the 90’s who was being banned from MTV, well what do you do now? You put on one of Donald Trump’s red MAGA hats. ” “I’m not a token, I’m what the future of conservative politics has to look like,” he stated. Listen to the full interview here.'"}, "time": 1742628384.938532}