{"duration": 0.09814167022705078, "input_args": {"text": "'HOUSTON  —   They still talk about the Saturday night here 27 years ago when Donald J. Trump partied with former President Richard M. Nixon. Dressed in tuxedos, they sang “Happy Birthday” to Texas royalty  —   former Gov. John B. Connally and his wife, Nellie, whose birthdays were a few days apart  —   as Nixon played the tune on a white baby grand piano. They dined at Tony’s, the “21” Club of Houston, and Nixon was so fond of the cannelloni pasta that he asked the owner, Tony Vallone, to write the recipe for him on a yellow legal pad. And when it was all over, Mr. Trump flew Nixon back to New York on his 727 private jet. It happened one weekend in March 1989. It was one of Nixon’s first public appearances since the Watergate scandal had forced him to resign in 1974. And it was one of Mr. Trump’s first presidential experiences, as he socialized with and had the ear of a former president for two days in Houston at a gala event, an impromptu   at Tony’s, a Sunday brunch the next day at a River Oaks mansion and later aboard his plane. “I think you can see a core of Trump in this,” said Barry Silverman, a Houston advertising and marketing consultant who helped coordinate the gala and was a longtime friend of the Connallys. “He obviously had a road map a lot bigger than any of us ever thought about. ” Mr. Silverman and Mr. Vallone said they did not know what, specifically, Mr. Trump and Nixon had talked about at the gala or at Tony’s. But the time they spent together that weekend most likely fed Mr. Trump’s fascination with and admiration of Nixon. During the campaign, Mr. Trump borrowed phrases from him, used his speech at the 1968 Republican convention as a template for his own convention address, and spoke glowingly of Nixon in interviews. The Connallys helped bring the fallen president and the future   together. They had met Mr. Trump a few months earlier at a wedding in New York in December 1988, and Mr. Connally had been a close friend of Nixon’s, serving as his Treasury secretary. Nixon was already familiar with Mr. Trump. The former president had written an unsolicited letter to  Mr. Trump in 1987, informing him that Nixon’s wife, Pat, had predicted “that whenever you decide to run for office you will be a winner!” Mr. Connally invited Mr. Trump and his wife, Ivana, to Houston as special guests at “A Night for Nellie,” an event to honor Mrs. Connally at the Westin Galleria hotel on March 11, 1989. Houston was just coming out of the 1980s oil bust. Tens of thousands of workers had lost their jobs and homes. Banks had failed. Mr. Connally filed for bankruptcy in 1987, and he and his wife were forced to auction their belongings to help repay creditors in 1988. Then Mrs. Connally learned she had breast cancer. “A Night for Nellie” raised more than $300, 000 for the Juvenile Diabetes Foundation, but it also sought to lift Mrs. Connally’s spirits  —   and Houston’s. Barbara Walters was there, along with the airline executive Frank Lorenzo and the elite of Houston society, including Oscar S. Wyatt Jr. an oilman, and his wife, Lynn, who hosted Nixon, Mr. Trump and others at their mansion the next day. In the hotel ballroom, Mr. Trump introduced Nixon and sat at the head table with him. Mr. Connally had assembled the seating chart for the table himself. His wife was seated with Mr. Trump on one side of her and Nixon on the other. Mr. Trump, the event’s honorary chairman, seemed to be enjoying himself. He was 42 years old, and his book “Trump: The Art of the Deal,” which had been published in November 1987, had enjoyed a position on The New York Times’s   list for nearly a year. “Donald Trump would have made a sensational Texan,” Ms. Walters told the audience, according to The Austin  . Mr. Connally decided late in the evening to keep the party going for some of the V. I. P.s at Tony’s. Mr. Vallone had about a   to clear a third of the restaurant and put on an elaborate buffet. He has wined and dined a host of celebrities and presidents at his restaurant, including Frank Sinatra, Princess Margaret, Andy Warhol and former President Bill Clinton. But he said that night in 1989 was the most memorable. “There was tremendous enthusiasm and electricity in the air,” Mr. Vallone said. “Trump had a commanding presence. People say he’s pompous, but he was not pompous. He was very approachable. He’ll talk to the waiters. After that, I went out and bought six or eight of his books and gave them away as gifts, I was so impressed with Trump. ” At Tony’s, Mr. Trump suggested he was taking a business interest in Houston. “Every time I’m in a particular city that I like, and Houston happens to be a city that I like very much, I do look,” he told   an ABC affiliate, as he stood in the restaurant. Nixon stayed there until 1 a. m. The party continued well after. “Dom Pérignon was flowing like ginger ale,” Mr. Silverman said, “and it went on until 3 in the morning. ” The next day, the Trumps, the Connallys and Nixon were among 36 guests at a brunch at the Wyatts’ mansion. They ate beef Wellington and sipped Champagne with dessert. Ms. Wyatt, one of Houston’s most prominent socialites and philanthropists, asked Nixon to speak about world affairs, and Nixon stood, gave a brief speech and then took questions. Asked if Mr. Trump had asked a question, Ms. Wyatt replied: “I’m sure he did. Everybody did. I was so proud of my guests because they asked such intelligent questions. I don’t have any stupid friends. ”'"}, "time": 1742561789.0760229}