{"duration": 0.0264284610748291, "input_args": {"text": "'Colorado taxpayers paid more than half a billion dollars to imprison criminal illegal aliens over the past 20 years, according to a report. [An analysis of the Colorado Department of Corrections’ State Criminal Alien Assistance Program (SCAAP) applications showed that taxpayers paid more than $522 million toward the incarceration of aliens, CBS Denver reported.  SCAAP is a federal grant designed to foot the bill for some of the costs associated with incarcerating illegal aliens. In order to receive SCAAP funding, the state’s prisons must give the Department of Justice a list of names of illegal aliens and how much time they have served behind bars. In 2015 alone, the Colorado prison system harbored 1, 992 illegal aliens, who made up 7. 8 percent of the state’s prison population, at a cost of $59. 7 million to the taxpayers. But that amount of money only includes the amount spent on state prisons. Here is a breakdown of how much illegal aliens cost taxpayers at the county and city levels: Robert Dunn, a victim of an assault by an illegal alien, says he “feels victimized” by having to pay taxes to support the cost of his assailant’s life behind bars. His assailant is now serving a   prison sentence in a Colorado state prison. “I think America is welcoming and we try to do our best to help people who come over here but we just don’t need those kind of people,” said Dunn. “Send him back right away, why should I feed him for six years?” The federal government is only reimbursing 4 percent of the costs of incarcerating illegal aliens through SCAAP, leaving the rest of the burden to the taxpayer. “When we say immigration is only a federal problem, it’s not,” said state Sen. Lambert (R). “We don’t want people to forget that a lot of the impacts are also on the states because the federal government is not reimbursing us for the cost of this incarceration. ” President Trump plans to cut much of this SCAAP funding at the federal level and shift funding to the state and local level. A county judge in Texas, however, demanded in February that the federal government reimburse Bexar County for the $22. 3 million the county spent to incarcerate illegal aliens.'"}, "time": 1742562239.7443445}