{"duration": 0.08412957191467285, "input_args": {"text": "'By wmw_admin on November 6, 2016 Thomas Erdbrink — New York Times Nov 5, 2016 In the past, Iranians looking to mock the United States would burn cardboard effigies of Uncle Sam or Lady Liberty. But in recent months, as the U.S. presidential election took a series of bizarre turns, Iranians seeking to make fun of the “Great Satan” ditched the arts and crafts and simply switched on their TV sets. Iran’s state television, a bastion of ideologues, for once interrupted its regular programing of the “murders and crimes committed” by the United States, and instead aired all three debates between Hillary Clinton and Donald Trump — live. In a country that tightly controls information about the United States and depictions of Western democracy generally, the decision to air the debates was unprecedented. The election is an opportunity for Iranian hard-liners rather than a threat, insiders said. “We only need to sit back and let these candidates show themselves how idiotic they are,” said Hamidreza Taraghi, a conservative analyst and a regular guest on state television. “The best way for us to prove that the U.S. government is corrupt and hideous is by showing these people live on our TV.” Live, yes, but some parts — especially those criticizing Iran — were not fully translated. After each debate, experts would discuss and agree that the U.S., especially in its current state, “cannot do a damn thing.” Iran’s political establishment has been thoroughly enjoying the campaign. Not because the ruling clerics favor either candidate, but because, they say, the tenor of the debates shows the “catastrophe” that U.S. democracy has become. On Tuesday, Iran’s supreme leader, Ayatollah Ali Khamenei, called the U.S. election “a spectacle for exposing their crimes and debacles.” Khamenei seized on the campaign’s tawdriest details: accusations of infidelity and sexual assault. “The remarks made by these two U.S. presidential candidates over the last few weeks on immoral issues — which are, for the most part, not baseless accusations — are enough to disgrace America,” he said during a speech commemorating the 1979 takeover of the U.S. Embassy in Tehran. His supporters responded enthusiastically by shouting, “Death to America.” Trump, the Republican nominee, was not mentioned by name, but the ayatollah seemed to praise his outspokenness, saying: “People pay more attention to him.” The candidate, he said, is tapping into genuine American dissatisfaction. “Because the people look at what he says and see it is true,” Khamenei said. “They see it in the facts of their lives.” Since the 1979 Islamic Revolution, Iran has been officially anti-American. Many ordinary Iranians have milder feelings for the U.S., where more than 2 million of their relatives live. Iran’s leaders, however, are entangled in a constant battle for power and influence with the United States, which was long the strongest power in the Middle East. The U.S. withdrawals from Iraq and Afghanistan have emboldened Iran. Leaders felt comfortable enough to cut a nuclear deal with the U.S. and expand Iranian influence in the region, local analysts said. “America is no longer a superpower in the region. It’s weak in the Middle East. They are now only one of the players,” said Jalal Barzegar, a reformist journalist. “It’s now just a country.” For Iranians uninterested in watching the debates, Iran’s state television had another option. In recent weeks it has been airing Netflix’s “House of Cards,” called “House of Straw” here because playing cards is considered un-Islamic. Kevin Spacey’s portrayal as the conniving politician Frank Underwood is the perfect embodiment of the “inhumane face” of U.S. politics, state television officials have said. Apparently, Khamenei has also been watching. In his recent speech, he quoted a line uttered by Spacey in the series. “‘Shake with your right hand, but hold a rock in your left one,’ as they say themselves,” Khamenei said. “This is the kind of people they are.”'"}, "time": 1742562200.0772004}