{"duration": 0.09988617897033691, "input_args": {"text": "'MELBOURNE, Australia  —   Serena Williams was utterly unaware that a victory on Saturday night would put her back at No. 1. Her coach, Patrick Mouratoglou, did all he could to keep her in the dark. But there was no hiding the other statistical stakes as Williams walked back into Rod Laver Arena, headphones around her neck and   in place, to play her older sister Venus Williams in the Australian Open final. The tennis circuit can be an echo chamber where the same questions and themes reverberate from week to week as the locations change, but the protagonists do not. So even if Serena Williams refused to entertain questions during the tournament about the possibility of winning her 23rd Grand Slam singles title and breaking her tie for the   record with Steffi Graf, there was no dodging that number in her own head. Now, after her     victory over her sister, she can celebrate No. 23 instead of fret over it. “I’ve been chasing it for a really long time,” Williams said. “When it got on my radar, I knew I had an opportunity to get there, and I’m here. It’s a great feeling. No better place to do it than Melbourne. ” She and her sister made their first visit to Melbourne in 1998. They were teenagers with braces on their teeth and braids in their hair and a clear sense that they were special, but no idea of just how far their talents and confidence would carry them. Much has changed in 19 years. Rod Laver Arena now has a wraparound digital screen at court level and electronic line calling. The court, once green, is now a deep blue. The beads and the braces are long gone, but the sisters’ power tennis remains. And though their father, Richard Williams, in one of the great sports predictions, saw the future clearly when he said the younger, fiercer Serena would turn out to be the better player, perhaps not even he realized how wide the gap would eventually grow. Serena Williams now has 23 major singles titles to her sister’s seven, and has won seven of their nine Grand Slam finals and eight of their last nine matches. Those figures brook no argument. Williams 2. 0 has the better operating system when it comes to locating the lines and creating the angles under the greatest pressure. She also has the purer service motion. But Williams 1. 0 certainly gave it her all Saturday night, throwing herself into the groundstrokes and displaying more emotion when a return struck the net or a rally failed than she has perhaps ever shown in a major final. “It was palpable how much Venus wanted it,” said Isha Price, the Williamses’ half sister. An   final is always an emotionally complex affair, which is all the more reason to admire how the older sister has so often handled the disappointments. “That’s my little sister, guys,” Venus Williams said, pointing at Serena during the   ceremony. She then spoke to her sister directly. It was quite a riff. “Congratulations, Serena, on No. 23,” Williams said. “I have been there right with you. Some of them I lost right there against you. I guess that’s weird, but it’s been an awesome thing. Your win has always been my win. I think you know that. And all the time I couldn’t be there, wouldn’t be there, didn’t get there, you were there. I’m enormously proud of you. You mean the world to me. ” Serena Williams is now within one victory of Margaret Court’s career record of 24 Grand Slam singles titles. “Good on her if she’s good enough to do it,” Court said during the week in Melbourne. Williams has closed in on Court with an unprecedented run of success at an age when most great women’s tennis players of the past had already retired. Graf, for example, was done by 30. But Williams has now won 10 major singles title since turning 30. On Saturday, she became the oldest woman to win a Grand Slam singles title in the Open era, breaking her own record set at Wimbledon last year. Venus, 36, was the oldest Australian Open finalist in the Open era. “There’s no way I would be at 23 without her there’s no way I would be at 1 without her,” Serena Williams said of her sister in the   ceremony. “There’s no way I would have anything without her. She’s my inspiration. She’s the only reason I’m standing here today, and the only reason that the Williams sisters exist. So thank you, Venus, for inspiring me to be the best player I could be and inspiring me to work hard. Every time you won this week, I felt like I’ve got to win, too. ” This final was edgy from the start, beginning with four straight breaks of serve and with Serena Williams angrily breaking a racket in just the third game after she lost her footing trying to change direction when one of her sister’s shots struck the net cord. The quality of play fluctuated considerably, but the match ultimately was determined by Serena Williams’s returns. Venus Williams had won over 50 percent of the points on her second serve in her surprise run to the final. She won just 29 percent Saturday. “Serena always expects a tough match against her sister, but I don’t think she expected it to be quite that tough from the start,” Mouratoglou said. At 35, Williams is back on top after playing little in 2016 except for the Grand Slam events and losing the No. 1 ranking to Angelique Kerber, who defeated her in last year’s Australian Open final. Williams looked shocked when it was announced after her victory that she would return to No. 1. Mouratoglou later explained, a tad sheepishly, that he had not answered truthfully when Serena had inquired about it. He said he wanted to avoid putting extra pressure on her at an already fraught moment. “Actually, I think she’s happy I did it now,” he said. The Open could easily have gone awry for Serena Williams. In her return to the circuit earlier this month at a tournament in Auckland, New Zealand, she was upset in her second match by Madison Brengle, making 88 unforced errors on a blustery day. But Williams has often proved that she can click into a higher gear without much match play, and she did not drop a set in seven matches as she won her seventh Australian Open singles title. Venus Williams, seeded 13th here, remains one of the great players of this era, but she has not won a major singles title since she beat Serena to win Wimbledon in 2008. In the intervening years, she received a diagnosis of Sjogren’s syndrome, an autoimmune disorder, that limited her training and contributed to her falling from the top 100 in 2011. But she has learned to manage her health problems and is having a   renaissance that might be a much bigger talking point if it were not for her younger sister’s   surge. Venus Williams will be at No. 11 in Monday’s WTA rankings. The sisters have become, through experience, adept at compartmentalizing, even if facing each other across the net is still not entirely natural. Their family members struggle with it, too. Their parents, Richard Williams and Oracene Price, did not make the long journey to Melbourne this year, but Isha Price did. And she decided that she preferred to watch the match at her hotel until it was nearly over instead of putting herself through the crucible of watching in person. “Long story short, I don’t think people actually understand the significance of what they see, these two players, who literally for generations have been able to transcend what they do,” Price said. “And it’s very difficult to watch, listen, hear commentary, all of that. We watch tennis on mute. It’s hard. To keep your body in optimal shape to be able to perform at this level consistently over 20 years is an incredible feat. But you still have the conversation where it’s not enough. ” It is becoming increasingly difficult to quibble with the record books, however. Serena keeps moving the bar higher, but the poignant part on Saturday night, was that despite all of Venus’s talent and staying power and eloquence, only one Williams sister has managed to win the singles championship at Melbourne Park.'"}, "time": 1742628391.53367}