{"duration": 0.09110236167907715, "input_args": {"text": "\"According to Conservative Daily Post: Barack Hussein Obama and Hillary Clinton are the founders of ISIS. We have proven that through emails and documents leaked from WikiLeaks, but liberal media outlets still refuse to cover it. After all, they are still more focused on what Trump said eleven years ago than what Hillary has actually done. Because of brave patriots like Julian Assange, we have been given more evidence that Hillary Clinton is more connected to ISIS than we originally believed. An email was leaked between Clinton and John Podesta indicating that: “Western intelligence, US intelligence and sources in the region” to accuse Qatar and Saudi Arabia of “providing clandestine financial and logistic support to ISIL [or ISIS] and other radical Sunni groups in the region.” Citing the need to “use our diplomatic and more traditional intelligence assets,” said Hillary to Podesta while arguing the current developments in the Middle East were “important to the U.S. for reasons that often differ from country to country.” Odd that Clinton argues Saudi Arabia and Qatar are helping fund ISIS when Hillary’s largest donations come from those two countries. In another correspondence from 2012, the Director of Foreign Policy at the Clinton Foundation, Amitabh Desai, set up a meeting with Bill Clinton for five minutes in exchange for a $1,000,000 “birthday check.” The email adds that the small but rich nation occupying the Qatar Peninsula would “welcome [the Clinton Foundation’s] suggestions for investments in Haiti — particularly on education and health.” Desai added that while Qatar had already “allocated most of their $20 million … [they were] happy to consider projects we suggest.” Bill Clinton gets $1M from Qatar for his birthday. FYI: It's legal and common practice in Qatar for husbands to beat and rape their wives. pic.twitter.com/oGM2Z9JrVl \\n— Martin Walsh (@mrwalsh8) October 13, 2016 We now see two more examples of the Clinton’s acting corrupt and being intertwined with nations that fund ISIS. For those that do not see where the dots connect, let’s simplify how this all worked for Hillary. Hillary, as Secretary of State, would sell terrorist nations large weapons deals only after they gave her a very generous donation to her “foundation.” These weapons, provided by Hillary and her State Department, then filtered down from Saudi Arabia, Qatar, Libya, and so on to create, supply, and bolster terrorist groups. That is exactly how ISIS was created. But instead of blowing them up with an air assault, Hillary and Obama decided to leave ISIS alone. Why? Because ISIS being in the Middle East allows the Obama/Clinton machine to make millions in personal profits from these nations in a repetitive cycle of selling weapons. They are choosing personal gain over eliminating a terrorist group. Let that sink in. Why else have they not arrested Hillary for all of these crimes? The FBI would arrest you in a heartbeat if you went to Facebook right now to praise Allah and ISIS. It also speaks volumes as to why they are trying so hard to silence Julian Assange. If Julian Assange is lying, why are they trying so hard to silence him? \\n— Martin Walsh (@mrwalsh8) October 23, 2016 The media remains silent on all of this. This would be plastered all over the news for months if a President Trump was exposed for this. Ignorant politicians are not the problem. The problem is that ignorant people keep voting for them every election. This is the exact reason we desperately need change in this country, and it starts with Donald Trump. People like Julian Assange have given up their lives to expose corruption in government and allowing Hillary Clinton to win this election makes all of his sacrifices meaningless. He has offered us a chance to revolt against our tyrannical government. Chances likes this do not occur often, and if we do not seize the opportunity, we will suffer another four years of suppression from our corrupt leaders. Vote Trump, so that we can save America and he can pardon Julian Assange. Yes America, after all of this, how can you vote for Hillary or stay at home on election day?! How could you?! If you agree, please share and comment below. Join us on Facebook to Stop The Takeover. Click on the button to subscribe. \""}, "time": 1742562156.518507}