{"duration": 0.05087709426879883, "input_args": {"text": "\"(Before It's News)\\nNews and Adventure from Glacier National Park\\nAfter surprising and then being charged by a grizzly bear, a couple fishing along the Lamar River effectively deployed their bear spray and saved themselves from injury on Saturday, October 22.\\nJohn and Lisa Vandenbos from Bozeman, MT, parked at a pullout near the Specimen Ridge trailhead in the Lamar Valley, east of Tower Junction. They walked cross-country to the Lamar River and, while scouting for fishing spots, surprised an adult grizzly bear who was feeding on a partially consumed carcass. The bear immediately charged the couple and came within nine feet when both individuals quickly discharged their bear spray.\\nThe bear initially left. When attempting to charge the couple again, it ran into the original cloud of bear spray. Upon making contact with the cloud, the bear retreated all the way back across the river and up the adjacent hillside “as fast as it could go”. The couple did not sustain injuries and bear spray stopped the charging bear.\\nThe couple left the area immediately and returned to their vehicle. They then reported the incident to a park ranger. Park rangers do not intend to search for the bear since this incident was a surprise encounter with a bear defending its carcass.\\nAll of Yellowstone National Park is bear country. Reduce your risk of a bear encounter by carrying bear spray. Studies show that bear spray is more than 90 percent effective in stopping an aggressive bear. In fact, it is the most effective deterrent when used in combination with regular safety recommendations – be alert, make noise, hike in groups of three or more, do not run if you encounter a bear and stand your ground if charged by a bear.\\n“Yellowstone visitors care deeply about preserving bears and observing them in the wild,” says Kerry Gunther, the park’s Bear Management Specialist. “Carrying bear spray is the best way for visitors to participate in bear conservation because reducing potential conflicts protects both people and bears.”\\nHelp the park increase the number of visitors who carry bear spray and know how to use it. Visit A Bear Doesn’t Care Campaign for more information.\\nJeff\\nHikinginGlacier.com\\nTetonHikingTrails.com\\nRockyMountainHikingTrails.com\\nHikingintheSmokys.com\""}, "time": 1742563963.5138745}