{"duration": 1.4144482612609863, "input_args": {"text": "'Welcome to Watching, The New York Times’s    guide. We comb through releases big and small to email readers twice a week with our timely recommendations. You can browse previous guides here, and to receive recommendations straight to your inbox, sign up here. Stay tuned for our coming website. Dear Watchers, The Emmys are Sunday, and we’ll have plenty of coverage coming up this weekend, but for now, let’s take one last look at the summer that was. Today’s newsletter rounds up the worthy shows that came out in the last few months, some of which you might have missed, and some of which you might have added to ye olde DVR but have not gotten to. Happy watching. “O. J.: Made in America” is maybe Watching’s most mentioned TV specimen so far, and with good reason: It’s one of the best   in living memory. ESPN’s   documentary is gripping and educational and made what I thought was a familiar story into something completely new and riveting. If you don’t want to commit, at least watch the first episode, which alone is one of the best documentaries about race in Los Angeles you are likely ever to see. (Watch on ESPN.) Neflix’s “Stranger Things” has captured the internet’s imagination to a degree that surpasses understanding. It’s pretty good, and I enjoyed it tremendously, but I have no idea how it became such a thing. Aspirational nostalgia from people too young to actually remember 1983? Maybe! “Stranger” is radically straightforward for a horror story: It isn’t trying to trick you, and it isn’t trying to wink at you. (I didn’t find it all that scary, but I am in the minority.) (Watch on Netflix.) “The Great British Baking Show” makes its way to PBS on a seemingly arbitrary schedule, but if one has to endure frustrating broadcast delays in order to encounter the most charming food show currently airing, well, that’s just the way the cookie crumbles.   but brutally exacting, the series pulls off a feat almost unheard of on reality contest shows: There’s zero     drama. The entire story of every episode revolves solely around baking triumphs and failures. Let this show inspire you to live every day as if you were a “star baker. ” (Watch on PBS and Netflix.) Sometimes great shows don’t capture “the conversation. ” Boo. These shows are fantastic give ‘em a go if you haven’t already. The megachurch ensemble drama “Greenleaf” premiered as OWN’s biggest show ever, and yet it didn’t seem to be particularly buzzy. While its network mate “Queen Sugar” is destined for more acclaim, “Greenleaf” deserves plenty of attention, too. It’s vibrant and smart, and not afraid of soapier moments. (Watch on the OWN app.) If you miss “Friday Night Lights”  —   don’t we all?  —   watch Netflix’s “Last Chance U,” a   documentary series about a community college football team that sends most of its players on to Division I programs. After you watch it, please tweet me your thoughts, because I want to talk about this show so much. (Watch on Netflix.) For anyone who likes medical shows, “Boston EMS” is an absorbing spin. It’s a documentary series that never crosses the threshold of a hospital the show only takes place on the road and in the ambulances. Rare is the series that can make you care so much so quickly. (Watch on ABC.) “Take My Wife,” on NBC’s comedy streaming service Seeso, is a quick six episodes, but they charmed me so much I watched them twice.   and wives Cameron Esposito and Rhea Butcher star as loosely themselves, and the show covers the ins and outs of the Los Angeles comedy scene without being tragic or sleazy. There are a ton of shows right now where comedians play themselves, but “Wife” is the only one pulling off     exploring the idea that the more you’re yourself in your life, the better your comedy becomes. (Watch on Seeso for Amazon.) Some people loved them! Some people didn’t care at all! Which one are you? I don’t know! You are the captain of your own vessels. I can only offer guidance. CBS’s twisted political black comedy “BrainDead,” from the creators of “The Good Wife,” was a tough sell. Alien ants crawl into politicos’ ears, turn them extra partisan, and sometimes heads literally explode. I didn’t always grasp the rules that governed the alien invasion, but both Mary Elizabeth Winstead’s sparkling performance and Jonathan Coulton’s silly songs that served as the “previously on” segments delighted me. (Watch on Amazon.) If “Stranger Things” hadn’t come out this summer, would “The Get Down” have been Netflix’s big show? It’s someone’s job to know the answer to that, but not mine. Baz Luhrmann’s   origin story, set in the Bronx in the 1970s, has a messy pilot but pulls itself together in subsequent episodes. I didn’t have the real estate for another sprawling show, but maybe you do. (Watch on Netflix.) If you want to watch two attractive actors in attractive locations learn about attractive beverages, then yeah, “The Wine Show” is for you. But maybe you are just a salty crab crabbing around, and you want educational shows to be more substantive, cohesive and convincing. A toast to however you are. (Watch on Hulu.) If you thought those hidden gems above were hidden, well   …     these were even more hidden. “Still the King” is a Billy Ray Cyrus vehicle on CMT where he plays a   singer pretending to be a minister back in his rural hometown. I know, I know. But it’s reminiscent of “My Name Is Earl” in all the good ways, and it’s an undercover sweetheart of a show. (Watch on CMT.) On the drama front, TNT’s “Animal Kingdom” really aimed for a “Diet ‘Sons Of Anarchy’” vibe and mostly hit it  —   it’s physically and emotionally violent, bordering on grotesque. Ellen Barkin stars as the matriarch of a California crime family, where‚ if you can believe it, there is not honor among thieves. (Watch on TNT Drama.) I didn’t love “Queen of the South,” USA’s drug queenpin drama adapted from a popular book and Telemundo telenovela, but I might give it another try knowing that Season 2 will have a different showrunner. But if you have an insatiable appetite for stories of violent drug trafficking, theoretically you could do worse. (Watch on USA.) Indeed. Lots of good stuff, actually. If you like   family dramas that still have potent dialogue, try the British series“The A Word,” about a family whose    son is autistic. It’s the right amount of emotional without being wrenching  —   it’s not a show that wrecks you, but you might want to drink tea and wear sweaters for a while after watching it. (Watch on Sundance.) Satisfying though never surprising, Australia’s “Cleverman” uses Aboriginal mythology in its superhero storytelling. It’s reminiscent of “District 9” and “Black Mirror,” but a bit sloppier and less horrific. (Watch on Netflix.) For many viewers, the only thing better than a British murder show is a Scandinavian murder show. “The Tunnel” is somewhere in between as a British adaptation of a Scandinavian series. If you’ve watched the original “” or the American adaptation “The Bridge,” this   serial killer mystery will seem redundant, but if not, there are thrills aplenty. (Watch on PBS.) There are plenty of   shows, but “Thirteen” is the rare   show: Ivy is a    woman who was kidnapped 13 years ago and has now returned. It’s creepy and haunting, and luckily moves very quickly. Is England half murderers? Maybe! (Watch on BBC America.) Amazon’s two most promising pilots this   are Jill Soloway’s “I Love Dick” and the reboot of “The Tick. ” Could Amazon market this in a package called “Dick and the Tick”? They could but shouldn’t. “Dick” stars Kathryn Hahn as a frustrated filmmaker who develops an obsession with a mysterious academic (Kevin Bacon). And “The Tick” is an effective entry in the very saturated superhero genre, satirical but thoughtful and textured. On Sept. 17, “Gimme the Loot” will expire from Netflix. In this wonderful “summer in the city” movie, Malcolm (Ty Hickson) and Sofia (Tashiana Washington) are burgeoning graffiti artists struggling to gain respect. So they hatch a plan to boost their reputation: tag a New York City icon so that no one will forget them. But it’s the   realistic friendship between Malcolm and Sofia that makes “Gimme the Loot” memorable. (Watch on Netflix watch the trailer and add the film to your watchlist here.)  —   Monica Castillo “American Horror Story” returns for its sixth season on Wednesday. At this point, you probably know if you like “A. H. S. ” or not. Unlike previous years, FX hasn’t announced the premise or setting for the season, nor have they sent episodes to critics. Enter at your own risk.'"}, "time": 1742563806.9651654}