{"duration": 0.10432100296020508, "input_args": {"text": "\"(mis à jour 18:15 26.10.2016) URL courte 0 57 1 0 Les livres d’entretiens ne réussissent pas aux candidats à la présidentielle ! Après « Un président ne devrait pas dire ça », qui éclabousse Hollande, c’est « Un Fantasme nommé Juppé » qui se retourne contre son auteur. Dans les deux cas, leur livre révèle surtout le manque de vision de ces politiciens. \\nWesh, Péju, trop de la balle le mec, ou quoi ? Trop chanmé, sérieux, comment qu'il les calcule pas les condés ! T'ain, j'le prenais pour un bouffon, deux de tension, trop cheum, tu vois, mais y déchire sa race, le cousin ! \\nEh oui, Juppé, il ne lui manque plus que le sweat capuche, la casquette des Chicago Bulls avec une plaque en simili métal et les chaînes autour du cou. Tel le djeune de base emmerdé par les flics dans ses petits trafics — pardon, dans son activité d'entrepreneur indépendant —, voilà-t'y pas que notre Ali-du 9-3-larchourma-de-ta-vie — ah voilà que ça me reprend — confesse toute la détestation que lui inspirent les flics et les juges. C'est dans un livre à paraître, Un Fantasme nommé Juppé , mais dont mes confrères n'ont pas hésitéà divulguer quelques bonne feuilles. \\nMonsieur le Premier ministre me pardonnera ma familiarité, c'est bien lui qui affirmait, dans un effort de coolitude assez déplacé quand on l'air comme lui de faire un usage plutôt déplacé des balais, qu'il « emmerdait » ceux qui le trouvaient ennuyeux, je vous en parlais d'ailleurs il y a quelque temps. \\nDonc le candidat favori des Français, selon ses propres mots, s'apparente donc à un Black Block de base qui scande en marge des manifs Loi travail « tout le monde déteste la police ». Oui, mais pas que. Dans son bouquin, notre énarque assoiffé de pouvoir explique qu'il n'aime donc pas l'intérieur, la justice, mais pas non plus le ministère des Finances « où il n'y a que des coups à prendre ». Sous Sarkozy, il ne voulait même pas du Quai d'Orsay, expliquant au président « Je ne veux pas porter ton cartable ». \\nBref, rien n'est assez bien pour lui, « le meilleur d'entre nous » ne se voit que sur le trône élyséen. Grattez un peu et sous la couche de coolitude, l'animal à sang froid réapparaît rapidement. Comme la plupart de ses petits camarades, Alain Juppé n'est intéressé que par le pouvoir. Mais pour en faire quoi ? Pas forcément pour appliquer des idées dites « de droite » si l'on en croit cette confession : « J'ai été de droite pour prouver qu'on pouvait être intelligent et de droite ! » Ou pas, donc. \\nD'ailleurs, il suffit de se pencher un peu sur son action pour que le vernis « de droite » craque aussi légèrement. Quel homme de droite — quel républicain sensé, d'ailleurs — entretiendrait des liens aussi étroits avec l'UOIF, c'est-à-dire les Frères musulmans, comme le fait Alain Juppé ? Rappelons qu'il a remis la Légion d'Honneur à l'imam Tareq Oubrou, membre de l'UOIF et ami de Tariq Ramadan en août dernier. \\nJe me réfère également au témoignage d'Amine Elbahi, un jeune ex-soutien du candidat bordelais. Bel exemple d'intégration, le jeune homme s'était engagé dans la réserve citoyenne de l'Éducation nationale et dans les Républicains, aux côtés d'Alain Juppé. « Rester à ses côtés serait renier mes convictions. » explique maintenant Amine Elbahi, qui déplore qu'Alain Juppé travaille aux côtés des salafistes de l'UOIF, comme Amar Lasfar, Tareq Obrou, Ahmed Miktar, qui tous prônent un islam politique incompatible avec nos valeurs françaises et républicaines. \\nOui, le pouvoir pour faire quoi ? On ne sait pas trop donc. Pour l'exercer, tout simplement, tout comme l'actuel locataire de l'Élysée qui lui aussi est là pour le plaisir d'être là et non pour porter une vision. Autre point commun entre les deux hommes : ils ont sorti des livres d'entretiens qu'ils auraient mieux fait de relire avant publication. Le scandale (dans un verre d'eau) du bouquin de Juppé n'ayant pas encore effacé celui du bien nommé« Un président ne devrait pas dire ça » de Hollande, vous avez encore ne mémoire les propos peu amènes du Corrézien de service à propos de la magistrature (tiens encore un point commun), de l'immigration ou de l'islam. \\nEh bien devinez quoi, ce n'est pas de sa faute, à Hollande ! Ce sont les méchants journalistes qui l'ont pousséà la faute ! Tu parles, en 62 entretiens et 10 dîners, ils ont le temps de le pousser, pépère ! et c'est Jean Glavany qui nous l'affirme : \\n« … ils savaient depuis le début qu'ils gagneraient d'autant plus d'argent qu'ils pousseraient le président à la faute. Alors ils l'ont poussé, poussé, poussé… et il est tombé, tombé, tombé dans le piège. » \\nPauvre pépère, il n'a pas fait exprès ! En tout cas, il y en a un qui n'est pas content, c'est Alain Juppé, parce que cette excuse bidon pour des propos foireux dans un livre probablement lamentable, elle est déjà prise, maintenant !\""}, "time": 1742562454.2539427}