{"duration": 0.873624324798584, "input_args": {"text": "'By wmw_admin on October 30, 2016 The Saker — Oct 29, 2016 Dear friends, Here is the latest installment of my quarterly conversations with Catherine Austin Fitts. This time the topic was Russia, Syria & Recommendations for a Trump Presidency . I hope you will enjoy it as much as I did. Here is the main page of the interview: https://solari.com/blog/multipolar-world-with-the-saker/ You can listen to the interview here: sr20160929_InterviewHQ.mp3 (auto-download) You can get the transcript in PDF format here: https://solari.com/00archive/web/solarireports/2016/sr20160929_1.pdf I highly recommend that you check out the rest of the Solari Reports and the Solari Books. Enjoy! The Saker Transcript Austin Fitts: Ladies and gentlemen, it’s a pleasure to welcome back the Saker for our quarterly discussion of the shift to a multipolar world. Every quarter when I arrive, the shift has become so dense, complex, interesting and so, sometimes exciting and scary, that I build a list and think, “I can’t wait to talk to the Saker.” \\nSaker, we have a lot to talk about. Welcome to The Solari Report. \\nSaker: Thank you very much. It’s always a pleasure. And, yes, there is a lot of ground to cover this time. Austin Fitts: For the last three months in the American press, every other headline is, “Well, the Russians did it!” \\nSaker: Oh yes. Austin Fitts: In the American press, the Russians are becoming all powerful. \\nWe’ve just had elections, and had a really great discussion about what it means for Putin and what it means for the Russian sanctions and the relationship between the two countries. Tell us about the elections and what it means, both for Putin and his administration as well as our relationship with Russia. \\nSaker: Alright. First of all, when you say that the US blames everything on Putin, you know that that regularly makes it to the news on Russian TV where everybody laughs. They say, “Look at how powerful we are! We now influence even the elections. We influence everything!” \\nEverybody is laughing about that. “We must be totally invincible if we’re so powerful that we hack everybody and we meddle with US politics. Aren’t we great!” \\nSeriously, the elections were very interesting because the party in power actually increased its share. It was a complete, total victory for the United Russia Party, which is very important. \\nIt’s often misunderstood in the West as to why it is important. The reason for that is: \\nRemember that Russia is under sanctions that are not really hurting Russia too much, but the fall in the price of oil has hurt Russia tremendously. \\nPlus, as we discussed, Russian governments under Medvedev, specifically the economic blocks and everything that is dealing with the economy have done a pretty poor job, I would say. As a result, there is definitely an economic crisis in Russia. That is the important fact. \\nNow why would a party in power – during a time of crisis – actually substantially increase \\nthe number of seats it has in a parliament? When people say that this is going to be a rubber stamp parliament, this is absolutely true. But this is exactly what the Russian people wanted. \\nThe people wanted a rubber stamp parliament because what really happened was a vote of confidence to Putin personally. That’s the only reason that kind of score was made by the ruling party. \\nIn reality, if you look at the popularity of pretty much all the other politicians, including those of the main party, they’re not that popular at all. It was really a referendum on Putin and on his stance. From that point of view, he received a huge mandate from the people. Clearly the vast majority is standing behind him. That sends two signals. First of all, of course, to the West that the idea of sanctioning Russia somehow can trigger regime change by means of color revolution in response to an economic crisis completely failed. \\nWhat happened was the opposite; people circled the wagons around their President. \\nSecondly, as I mentioned on this show in the past, the real opposition in Russia sits inside the Kremlin. It’s the prowestern, pro-AMF Washington consensus types who are in the government of Medvedev. To them it sends the very same signal: We stand behind Putin, so don’t try something. \\nIt’s actually an extremely important election because it really reestablished a power of Putin personally. Austin Fitts: Right. Now let me just go back because I want to talk a little bit about the power of the lower oil price and the sanctions. \\nWe had on The Solari Report, Jim Norman several times and Anne Williamson, and we’ve talked about how the West intentionally brought down the price of oil. They manipulated the price of oil and managed to lower it in the 1980’s for the purpose of bringing down the Soviet Union. It was essentially an act of national security targeted at trying to weaken the Russian government. \\nJim has a wonderful book called The Oil Card, and The Oil Card worked; it really did help to bring down the Soviet machinery. This is a tactic that has been used very successfully by the West. I’m not trying to say that the oil prices coming down has to do only with the Soviet Union, because there are plenty of things going on in the energy industry with technology to bring the oil price down as well. But the reality is that that tactic worked before, and this time it’s not working. Is that fair to say? \\nSaker: I would say that it is working in the economic sense. Russia has most definitely heard. They are actually discussing reducing the budget for the first time, including the finance minister suggesting a 6% reduction of the military budget, which I don’t think will happen. \\nIt has worked in a sense of hurting Russia. That has hurt Russia way more than the formal sanctions. But it failed politically because there is a completely different environment. For one thing, during the Soviet Union there was really very little support for the Soviet state as it was, whereas today there is a complete and different informational picture in Russia. \\nPeople get their information in a competitive market. They see the Western media and the blogosphere, and they clearly have come to the conclusion that this is a war. In case of a war, once you are aware of that, you accept sacrifice – particularly the Russian people. Austin Fitts: Right. \\nSaker: The party in power has a very easy argument to make. It says, “Do you want to surrender Crimea in order to get French cheese back on the market?” \\nOver ninety percent of the people say, “No.” As a matter of fact, during the election, another thing that was very interesting to see, was that the very pro-Western parties – those that essentially don’t accept what is called the ‘Crimea Consensus’ which is, “Crimea is ours,” as they say in Russia –scored about 3%. They couldn’t even make a single seat in parliament. \\nSo politically that factor completely failed. Economically it worked. Austin Fitts: The Russians experienced what happened when they embraced the West in the 1990’s. \\nSaker: Absolutely. Austin Fitts: So that was kind of an economic siege of Leningrad. \\nSaker: And that argument always comes up, “You think we have it bad now? Do you want to go back to the 1990’s?” That is one argument, which Putin supporters are using to demonstrate that effect. \\nThe second one is, “Look across the border at Ukraine.” Austin Fitts: Right. There is one other point that I wanted to bring up, and that is the fact that I’ve had experience with the equivalent of the sanctions that the Russians are dealing with in the United States. When they want to bring pressure to bear, they know how to mess with the individual’s finances. They always go after the lieutenants. \\nYou try to take out the lieutenants before you try to take out the generals. If you had applied those sanctions in the United States, I assure you that it would have gone very differently. The speed at which our system is held together by how much money you’re making this year or certain kinds of approvals this year, you’re talking about sanctions, that if they had been applied to the United States, would have been highly successful, in my opinion, relatively quickly. \\nSaker: Agreed. Austin Fitts: The comparison of how these tactics would have worked in the United States in the US system versus how they’re working in a Russian system says that you have a system in Russia that is being held together by a strategic plan vision values, whereas in the United States, you have something that is held together by much more monetary and short term alignments, not by a shared vision. \\nSaker: Yes, but in all fairness, Russians feel – and I think correctly – that they have absolutely nowhere to retreat. What is happening right now is existential war for survival. \\nI think that if the American people felt similarly – similarly threatened and absolutely knew that negotiation just didn’t work and have nowhere else to go – I think they would take sanctions, too, and just say, “We’re not going to retreat anymore.” Austin Fitts: Right. Although I would say that the media machine has been able tocreate a ‘divide and conquer’ mentality when, in fact, there are large parts of the American population which are cornered. \\nSaker: Yes, that is true. Austin Fitts: But they are so busy dividing and conquering each other that, to this day, they have not yet seen it together. \\nSaker: That is true. Austin Fitts: When you listen to the people who I think relatively reflect the CIA line like George Friedman at Stratfor, he is very adamant that the sanctions are going to wear people down and things are going to come apart. Is that line going to change, or are they just going to hold the line in the face of the Duma elections? What are they saying about the Duma elections? \\nSaker: I don’t know what Stratfor said about the Duma elections, but you have to understand who these people work for. Essentially they really work for those who pay them, and they have to be in a specific line. It has been a very distressing feature of the United States – the beltway community, the think tanks, etc. They will write things, which have nothing to do with reality, and they keep on writing things, which are just not based on reality for the sole purpose of feeding a political agenda or a financial agenda, in many cases. \\nThat reminds me of when Obama said that the Russian economy is in tatters. I think yesterday he spoke at the UN, and said that Russia is trying to regain past glory by military means or something similar. This is absolute nonsense, which is based on nothing, but as long as the people you are speaking to are willing to pay for it, they will do it. But I think it’s irrelevant. \\nFor instance, I can assure you that the sanctions are not having that effect at all. It’s not only the Duma elections that the people stand behind, but even the economy is doing fairly well. There are some hopes that the economy is going to go out of recession, if only mildly, but fairly soon. Even if it doesn’t, the staying power of the Russian people is absolutely huge, particularly when they’re cornered. And they are cornered. That is the key thing. When they say that the sanctions are working, I say, “Great! What do you think the Russians will do in response to that?” They have nothing to do. They don’t have an option. Austin Fitts: Here is what is interesting. If you look at what they’re doing in the area of financial payment systems or in the area of agriculture or any place where the sanction is biting, they are building up their own capacity – which I think, in the long run, will be very healthy for the economy. \\nSaker : Yes, absolutely. And there are sectors that are terrified that the sanctions might be lifted, which I don’t think will happen in the near future. But that is one of the concerns, particularly in this culture. They say they need five years of sanctions to really fully become competitive. The thing is that the sanctions are infinitely worse by the policies of the government. \\nWe said the fall in oil prices has hurt Russia, and that is true, but I would say that the first thing that has hurt Russia is the economic policies of the Medvedev government. They have hurt Russia way more because they’re in the Washington consensus; they are still concerned about inflation. They want a ruble that is not fixed but ‘free-floating’. \\nAll of these things – high interest rates and borrowing inside Russia and still a heavy dependence and imbrications into the Western economic system – are not helpful, but I think that Putin does not have the means. I wrote an article about that, saying, “There is a purge coming,” because I think what Putin is doing is actually preparing for a purge of that fifth column inside Russia. But I think he needs to have unconditional support of the Russian people and prove that that policy is wrong before being able to put other economists, such as Sergey Glazyev and others, in charge of a much more sovereigntist economic policy. \\nAll these phenomena are happening simultaneously. Austin Fitts: Right. If you see what is happening with technology and energy, they need to be building up the local self-sufficiency in the economy in many different ways. I think, that as long as the political structure wants it to, the energy price is going to keep coming down. If you observe what is happening in renewables or other forms of relatedtechnologies like that, you can project a long-term drop in the price of energy. \\nAnyway, let’s turn to Syria because this is a place where the US appears to have a real multiple personality disorder breakdown and it’s almost painful to watch – even for me. Tell us about what has been happening in Syria and what you think it means. \\nSaker: Well, I fully agree with you, first of all, that this is a case of multi-personality disorder. A lot of experts – both Middle Eastern and Russian that I’ve listened to – really seem to think that the latest strike that the US Air Force made with a couple of other air forces, like the Brits and Australia, that broke the ceasefire were actually a Pentagon sabotage of the negotiations that Kerry and Lavrov had conducted. \\nI figured it was actually possible that this was indeed the case. I think that what is happening is the US government is extremely weak, and when you have an extremely weak government, agencies start to become comparatively more powerful and more independent. And there are literally competing interests; I think the United States does not have a single policy on Turkey, on Syria, and on many other things. \\nIf it is true, and I tend to think it probably is, that this was a military sabotage of an agreement that Carter didn’t want to have anything to do with, that shows an extremely advanced level of disorganization and essentially collapse of the empire. Austin Fitts: You said that Carter doesn’t want anything to do with it. Do you mean Obama? \\nSaker : No, Ashton Carter, the Secretary of Defense. Austin Fitts: Right. My impression is that the President and Kerry are saying, “Look, we need to reduce our financial and physical commitment to the Middle East. We’re wasting enormous amounts of resource in the Middle East, and we need to get on with a multipolar world.” \\nThat has very dramatic implications for the people who make money on war. Part of this tension is really between the military-industrial complex and the White House as to where our best strategic interests lie. Does that make sense to you? \\nSaker: Yes, but I would slightly rephrase it. One very interesting analyst in Russia, called Ishchenko, has offered a theory, which I think I endorse. It’s that there is a huge fight happening inside the United States right now between two factions. One faction wants to sacrifice the US for the sake of the empire, and the second faction wants to sacrifice the empire for the sake of the United States. Austin Fitts: Right. \\nSaker: The first faction who wants to sacrifice the US for the sake of the empire –the neocons and everything that surrounds them – and the second faction, according to Ishchenko, and I’m not saying that for a fact is true, but he thinks – and I find that theory at least plausible – is that that is the power base of Trump. \\nIf that’s what is happening, we probably see that struggle already taking place in Syria because the US has basically two options there: Either withdraw and let go, or double down. Austin Fitts: Right. \\nSaker: That’s the risk. Do you double down at any cost, or do you realize, “This is not viable; I need to get a negotiated settlement.” I think that is what is taking place there. Austin Fitts: Are you saying that the neocons are the faction behind Trump? \\nSaker: No, the opposite. I’m saying that the neocons are the faction that wants to sacrifice the US for the sake of the empire and wants the empire at all costs, whereas the Trump people in that hypothesis, would be those who say, “Forget the empire; let’s save the United States.” Austin Fitts: Right. \\nSaker: And these are the people who would favor a negotiated solution pretty much everywhere. They realize that they cannot hold onto the empire, so the smartest thing to do when you come to that realization is, what you call in Russia, ‘bringing down while stepping on the brakes’ which is a controlled deconstruction of the empire – be it the Ukraine, Syria, or the economy or China, etc. \\nNegotiate and find some kind of way to make a compromise. That would be the way to save the United States. The neocon solutions are crazy, which is double down everywhere, and if nothing works, use as much force as needed. Austin Fitts: Exactly where are the neocons planning on living when it fails? \\nSaker: That is a good question that I cannot answer. Maybe Israel? But Israel needs the US, too, so I’m not sure. I think they are actually deluded. I think they truly believe that they’re invincible and that any problem can be solved by brute force and deception. That could have worked for Panama and for Grenada and even for Libya, but even when you’re dealing with Iran, they couldn’t do it; forget about Russia or China. Austin Fitts: Right. I think part of Iran had to do with China and Russia not beingwilling to tolerate whatever they wanted to do in Iran. \\nSaker: I don’t think the US military has what it takes to win a war against Iran even now, even run by its own. They can hurt Iran, and they can bomb Iran. They can do all sorts of bad things, but neither a regime change or occupy – which I think is the only definition of victory – and I don’t think that they could do either. Austin Fitts : I must confess that to this day I still do not understand that part of it. I understand the global chessboard idea of being the hegemon in Eurasia; that makes sense to me. But if you study how much time and money the Bush and Obama Administration have spent in the Middle East, it seems to me like the Obama Administration has been trying to get out pretty much since they went in. \\nBut if you consider how much time and effort we’ve spent in Eurasia relative to what our best interests were globally, the whole picture doesn’t make sense. I keep thinking there is missing information here. \\nTo this day, I still don’t understand why Cheney did what he did. I still think I’m missing information. So the picture is still not clear. \\nLet’s go back to Syria. What happens next in Syria? \\nSaker: Oh, that is a question! First of all, it seems that the collapse of the ceasefire leads back to short-term simple warfare. I would say that the conflict would probably be frozen until the election because, right now, I don’t think the US has in itself to take a major initiative to change something in a major way. The Russians are certainly not going to move either. I don’t think that the Iranians can. I don’t see a military solution – a quick one by nobody. \\nTurkey has made a move, which still is extremely controversial and unclear. I tend to think and agree with those who say that Turkey moved in with knowledge and agreement with the Russians and the Iranians, even though the Turks may have done a little bit more than what they told the Iranians and Russians that they would do. I think it’s a frozen conflict in the sense that I don’t see a major change happening until the election because, clearly if Hillary comes to power, we know that it’s going to be war. And it’s probably going to be a war involving the US military at that point. \\nActually, the chances of US aircraft getting shot down by Russian missiles would become extremely real. Would the US then retaliate against Russia? Possibly. Anything could happen. If Trump comes to power, my biggest hope is that he would convene a long meeting with Putin – something like a Camp David week-long meeting – where he would try to find out and outline some kind of dialogue toward negotiations on every single thing that oppose Russia and the US right now. If I could recommend something to the US President that would be the first thing to do: Sit down and try to find a compromise acceptable to all parties. Austin Fitts: Let’s step back. If Clinton wins – or Trump wins – internally you’re going to have first and foremost a real internal war. Let’s just walk through it. \\nBoth candidates have extremely large disapproval ratings. If Clinton wins, you’re going to have the military, the enforcement, the intelligence bureaucracies view as someone who takes classified information, and their political appointees will use that information for their own personal financial rewards. If you’re the entire bureaucracy that has to implement national security, you are starting day one in a position where you don’t trust anyone at the top. When that happens in Washington and in the Federal bureaucracies, people just freeze. When they decide to do passive-aggressive, it’s unbelievable. \\nMy question is: Can Clinton get the machinery to even act, other than obviously the neocons having influence in certain places and obviously there is a whole installation of private defense contractors and mercenaries who I’m sure would be willing to act along the neocon lines? \\nThe question is not just what the policy will be, but can the policy even be implemented? I think you’re talking about massive – at least in the media and from an economic warfare standpoint – civil war inside the country. \\nSaker: Possibly, but I’m not sure. The neocons completely control the media and Congress. So for a popular uprising or civil protest or sabotage or something, you need to have something triggering it. It’s usually an informational element. \\nIn the good old days before the internet, when you did a military coup, the first thing you took over after the government palace was the local TV station. That’s how important information is. It’s still important today, but is there enough of a blogosphere and internet to somehow coordinate or trigger a reaction? I’m not so sure. The American public is extremely passive. People hate what is happening, but they don’t see an alternative. People inside the bureaucracy – how could they possibly react or sabotage? I don’t know. The neocons have a pretty strong grip on power. Austin Fitts: Right. I’m not saying that they would go to the streets; I’m saying that they have a way of just requiring everything to be by the rulebook. So when the Washington bureaucracy decides everything has to be impeccable according to the rulebook, everything slows down by 90%. It’s unbelievable. \\nSaker: They have been infiltrating the US power structure since at least the 1990’s. Austin Fitts: That is true. \\nSaker: They have people everywhere at every single level who are loyal to each other, and they will keep an eye on their colleagues. If needed, they will fire more people. That is what they’ve been doing for years now. Austin Fitts: Right. \\nSaker: Maybe I’m too pessimistic. Austin Fitts: I think there are a variety of different issues. One has to do with the Federal bureaucracy, and the other has to do with the state bureaucracies and how they respond to the Federal bureaucracy doing something. \\nRemember: The debt capacity is pretty much used up. You can just keep printing paper, but we’ve been doing that for quite some time. The financial ramifications of the neocons going wild are much more extreme today than they were, and that is going to be important to the states. \\nSaker: When I was in college in the US in the late 1980’s and the early 1990’s, we gathered a group of some graduate students – all specialized in national security affairs. We had a debate on what could bring down the established political system – the regime, so to speak – in the United States. We all agreed that it would be an external factor. Internally the system is so good at handling dissent or disagreement or information on everything else that we didn’t see any circumstance in which change would come from within. Our conclusion was that it would be either an economic or a military shock from the outside. I still tend to believe that. I think it would take a collapse of the dollar or a sunken American aircraft carrier to get a massive wake-up call with tremors inside the country. And even that would be hard because there is always the ability to circle the wagons around the flag and do what happened after 9/11. It’s a very tough proposition. Austin Fitts: So let’s say that Trump wins. I agree with you that the Trump faction is much more inclined to preserve the United States at the cost of the empire. I would say that many in that group don’t believe the empire could ever work; it’s just not feasible. \\nSo they win, and you’re still going to have enormous anger and disagreement because Trump’s disapproval ratings are very high. Both candidates have extremely high disapproval ratings. That means that when they get in, it’s very hard to implement any kind of policy that requires action. \\nSaker: Yes, but Trump’s disapproval rating is based on things that he can easily prove. It’s not that I’m a Trump supporter; I’m not. But I think, pragmatically, he is accused of being unstable and will start a war. Well, he won’t. His anti-Muslim rhetoric will run him into legal difficulties anyway. Mexico is not going to be a major problem. \\nReally, if you predict an apocalypse when Trump comes to power, I think his negative ratings might suddenly go down – particularly if Trump is smart and does embark on a number of reforms, which the people would approve of. Austin Fitts: Here is the apocalypse: It is going to happen. You have a whole world of people –a big world and an expensive world of people – whose job has been to yaketyyakety-yak and justify a whole bunch of things for the unipolar vision. That’s a big group. I wrote about the African-American elites who surround Clinton. \\nAll of those people – that whole gravy train – are going to get shut down fast. For those people, it is an apocalypse. \\nSaker: Yes it is. Austin Fitts: And it’s one that I am going to enjoy watching tremendously. \\nSaker: Agreed! If it happens, I will be celebrating. Austin Fitts: Anyway, I think they should all get jobs as cleaning ladies at Motel 6 and discover America and learn what it’s like to earn a living in America. Their gravy train would stop, and I would certainly enjoy that. We just had the anniversary of 9/11, and you wrote an article on it that I thought was excellent. We have it posted at www.Solari.com. Tell us about the article. Walk us through it and tell us why you wrote it and where we are on 9/11. \\nSaker: Well, I wrote it just because of the anniversary. I wanted to make a summary of how far we’ve gotten. Has the 9/11 truth achieved anything or not? \\nI’ve broken it down into, what is called ‘The Three A’s’, which are used in intelligence communities to describe how ideal intelligence should work. The first A is acquisition, which is getting the data and getting the raw information. The second level is analysis. You take the data, and go through it by expert opinion, and evaluate it. The last part is acceptance, where you go to the political authorities or the highest level inside the agency, and submit that and they accept it or not. \\nIf we go by that methodology, I would say the first part – the acquisition – was really the easiest part, and it was extremely well done. There were a number of difficulties initially because a lot of amateurs were actually involved in the acquisition part, which are the recordings and interviews and all of the raw data that is available about 9/11 and all of its aspects. \\nThere was a huge amount of data. Some of it was very poorly analyzed, and others were pretty well analyzed. But the acquisition was easy; we have everything we could possibly want to know in terms of facts about 9/11. Everything is known. Austin Fitts: Could I make a pitch about the amateurs? \\nSaker: Sure. Austin Fitts: I was one of the amateurs because, in the beginning, there was a group of us. We just had an event at the National Press Club for the GATA group, and there were a group of activists on 9/11 that asked me if I would help have a national press conference. I said, “There is no point in having a press conference; we need a process. We need a process of collecting information and data that is ongoing.” \\nWe did do an event at the National Press Club, but we started a website in collaboration with a website Scoop Media in New Zealand called Unanswered Questions. I said, “Look, the process always fall down as you try to figure out what happens. We’re not competent; we can’t create an evidentiary trail. What we can do is ask questions and can say, ‘Look, we have questions.’ We can collect data, we can put it on the website, and we can evolve a process where we’re all asking questions, and holding governments responsible to answer citizens unanswered questions.” \\nWell, that started. Part of that group started supporting Paul Thompson doing a timeline. It went on for a couple of years. It was amazing because it was phenomenally successful. \\nIf you just examined the unanswered questions, it was clear that the official story was complete bunk. \\nSaker: Absolutely. Austin Fitts: They did a good job of collecting evidence. Here is what was amazing, because we were absolutely amateurs. We didn’t have the skills or the knowledge to get into much of the technical issues related to the buildings coming down or anything, but what happened – which was amazing –it held open the space. By holding open the space and collecting enough data, that’s when the architects, the engineers, the scientists, and the pilots all started saying, “Wait a minute. This makes no sense.” \\nSaker: You are absolutely correct. That is exactly what happened. Austin Fitts: It took several years to bring them in. Then when they came in, we all looked at each other and said, “Thank God the big boys have shown up!” \\nSaker: Personally, it took me eight years before I even started looking at having doubts about the official narrative. That’s how blinded I was because that level of arrogance and cynicism was just inconceivable, so you reject it. I always thought, “The empire is the empire, but at least they are patriots of their own empire.” \\nIt is counterintuitive. Of course, initially – at least for me – I couldn’t be bothered with that because it just sounded ridiculous. But it is that acquisition or listing of questions where people said, “That makes no sense,” that got me to think, “What do you mean that it makes no sense?” \\nThe deeper I looked at it, the more I said, “Wait. This really doesn’t make any sense. What is happening here?” Austin Fitts: I’m amazed. \\nSaker: I think the first level was amateurs asking questions, but also getting raw data. Then real specialists coming in and looking at it and going, “There is something wrong here. Let’s look at it deeper.” \\nThat is the other thing. The internet played a huge role because, normally just the acquisition part on a worldwide basis of people, could acquire it straight from the internet. You didn’t have to be in New York to get it. \\nThe second part was the analysis. I’m not sure if some of them are more or less enlightened. It is something that normally would require a multi-billion dollar investigation, and here it was done by volunteers with zero cost or individually covered. \\nThe second phase, the analysis, I would conclude is a stunning success because there is enough strong analysis that I would say you could just deny the facts and ignore it. But if you look into what happened, there are a couple of things. For instance, the freefall of the World Trade Center 7 during 2.25 seconds, which is the one I prefer, which means that eight floors of building were removed instantaneously. That is something, which an amateur, who was a teacher of physics in high school, forced NIST to admit. NIST did admit it, which essentially means that the US government admitted it was controlled militia, because that is the only explanation for that. \\nThere is also thermodynamic material that was discovered in the dust. There are also radar tracks, which indicate that some of these planes had a course, which could not have been plotted by human beings. And there is much more to it. \\nNow I think they have a consensus list which, if I’m not mistaken, has either 40 points or 60 points by now. We have more than enough. We have overwhelming evidence backed by specialists truly competent of absolutely undisputable reputation who say, “You know what? \\nThere is something here.” \\nWe are stuck on the third level, which is acceptance. But the 9/11 truth movement cannot – and it is not its calling – force acceptance. They are trying to do that. Architects and engineers are trying to address more and more people, but really, if most people already doubt the official version, the people won it. So what is left is the iron grip of the regime on the media, on Congress, on the bureaucracy who forces everybody to shut up and not dare to raise the issue. \\nWe pushed them down to their very last limit, with brute force. They basically say, “We are not going to engage you. What are you going to do about it?” There is nothing we can do right now, but that is a success. Austin Fitts: I didn’t own a TV when 9/11 happened, but in the first second of hearing that it happened, I was 100% certain that it was an inside job. \\nSaker: Wow! Austin Fitts: It never occurred to me that anything else was possible. I’ll tell yousomething very interesting. I live in a very racially segregated community, and one of my cousin’s African-American farmhands walked up to me the next morning and said, “We think it was Bush. What do you think?” \\nThe African-American community assumed it was an inside job whereas the Caucasian population didn’t come to that conclusion or didn’t even dare think that for over a year. It was impossible for them to conceive that it could have been an inside job. So it was many people in the African-American community, and me, and then everybody else. \\nHere is the point. If you investigate and, I would encourage you to watch a DVD called New York, New York that PBS presented that describes the triangle fire. If you watch that presentation of the triangle fire, you will see exactly the playbook of 9/11, and it has been done in New York before. It’s the same playbook with the exact same result. At that point it was getting legislation from the New York state legislature, not the national legislature, but this is a very old manual and it’s a very old playbook, and it has been done many, many times before. \\nThe American elites killing the American population, whether it’s with narcotics trafficking or nuclear testing or prototyping various biological things on the population –has been going on for a long, long time. \\nThe thing that was different about 9/11 was that they started to kill upper-class people, the Titanic and a few incidents aside, has not been that common. But American elites have been killing Americans for a very long time. It didn’t surprise me at all. \\nThe big reason it didn’t surprise me was that my focus for the two or three years prior to that was on all the money going missing – essentially the financial coup d’état. One of the reasons for 9/11 was to cover up the trail on a great deal of mortgage and securities fraud. Remember, in Building 7 you are bringing down Solomon Brothers. What was Solomon Brothers? It was one of the leading government and mortgage securities company, and the lead investor was Warren Buffet, who has one of the largest insurance companies. What did they buy? They bought mortgage and government securities. \\nYou’re bringing down and destroying the trail on $4 trillion at that point missing from the Federal government. It looked like an inside job right away. So I’m shocked that you trusted enough to believe that the American elites wouldn’t kill Americans. \\nSaker: Remember that my idea of elites then was the people who I had studied with and under in Washington, DC, and the overwhelming majority of these Americans – mostly in military – were really true patriots. Austin Fitts: Yes. \\nSaker: I had to separate the government from the deep state. I still don’t believe it’s the US government who did it as such; it was the deep state within the US government. The African-Americans think the entire government is hostile and cynical and lying and murderous, but most of them aren’t. Austin Fitts: No, and do you know why? You have to remember that the African-Americans populate the bureaucracies in Washington, particularly at the lower level. Formany generations you had the janitors and the cleaning ladies who see all and know all. They sort through the trash. Their intelligence network to get detailed information about what’s going on is phenomenal, and the community has built up ways of sharing it. \\nThey look at things in a much more complex way. That is my experience. \\nSaker: I was basically naïve. I could not believe that something so brazen could be done. It just blew my mind. Austin Fitts: One of my theories – and I’ll just throw it out there because we’ve done a great deal of work on entrainment technologies on The Solari Report, and I think they’re part of this. I had one subscriber who was putting up cell towers all over the country, and there was a tremendous push that he couldn’t explain – rush, rush, rush putting up multiple towers in multiple places where it didn’t make economic sense to have that many towers. He kept talking to me about this, and how it made no economic sense. What I would discover as I kept driving on the interstate highways because I was travelling so much, was that the towers were compatible with the cell company that I was using at the time. It was amazing because the service wouldn’t work. \\nIt was clear that, whether it was the economics or the service, this was not just about providing cell service. Then in August, 2001, when he called me, he said, “You’re not going to believe this but we just all got laid off. It’s done. Whatever they’re trying to do, it’s done.” I said, “Uh-oh. Something big is going to happen now.” \\nWhen you watch everybody walking around in a trance, listening or talking on their phone, I think that part of what they were hoping to do was get the entrainment technology in place by the time they did it, and that was a real contributor to making it go. \\nSaker: Interesting. Very interesting. Austin Fitts: Anyway, we are in an election, and that election is getting pretty intense. We’re coming into the season that is the most intense. October is the most intense time in Washington every year, but in a Presidential election, it’s phenomenally tense. We’ve seen Trump just slightly pull ahead in the polls, and the disinformation and craziness around the election is really going off the charts. \\nLet’s just say that Trump wins. In your opinion, I ask you what the ten most important steps are if you are Donald Trump and you’ve become President that you need to take? \\nSaker: I came up with twelve. Austin Fitts: Twelve is good! Let’s do twelve. \\nSaker: First, internally, quick and easy: Abolish ATF and DEA, abolish Patriot Act, abolish the Federal Reserve. That’s just for starters. I would legalize the use of drugs. Austin Fitts: Wait. Start again and slow down. You would abolish the ATF? Is that what you said? \\nSaker: The ATF, the DEA, the Federal Reserve, and repeal the Patriot Act. Legalize the use of drugs or decriminalize it, similar to the use of alcohol. Then came along more complicated things. I would order a complete overhaul and reregulation of the US banking system and Wall Street to get it back under government control, but that would be a much longer process which would require some kind of conference. It’s much more complicated at that point, but I think it is essential to recover what I call ‘sovereignty’ because the countries are either run by the government or run by the corporate financial world. I think that, in this case in the United States, the people need to be back in control and wrestle away the sovereignty from the big corporations. \\nI would replace Obamacare with a single payer system. That is what I would recommend inside the United States. Shall I go for the outside? Austin Fitts: Yes. Go. \\nSaker: I would draft a new military doctrine for the United States – a defensive military doctrine whose goal would be conceptually to draw down about 50% of all military forces abroad while remaining committed to allies and security of essential interests. It would not be a worldwide withdrawal, but a new military defensive posture. Austin Fitts: So would you honor and respect current allied agreements? \\nSaker: Not all. I would abolish NATO. That would be the first thing that I would do. Austin Fitts: Okay. \\nSaker: I would scrap the ABM system in Europe, and then I would convene three conferences. That is all within the same logic, which is: I don’t think it makes sense for the empire to double down. If you don’t double down but you need to withdraw, you need to negotiate a withdrawal and not a panicked flight. \\nI would say that three things need to be done: First, a three-party conference on the Ukraine between the US, Russia, and select EU Foreign Ministers. The goal would be obvious: to replace the current regime with something civilized and get a donor’s conference and rebuild the Ukraine, either as a confederate unitary state, or, if it has to go this way, as a number of successive states to an artificial entity. That would have to be negotiated. Austin Fitts: Let me just play a bad guy on Ukraine. If you examine the per capita incomes of the Ukraine as of five years ago, coming out of the collapse of the Soviet Union, the Russian per capita income grew, Polish per capita income grew dramatically, and the Ukraine did not. So there is an older, deeper, longer problem in the Ukraine; it’s not just the last five years. \\nSaker: I completely agree with that, and if you want we can discuss that. Austin Fitts: No. We don’t have to hang on that, but you need a solution for the Ukraine that addresses that. \\nSaker: Yes. I agree with that. My personal solution is to break it up into at least three or four successor states. That is the least bad one, but still it would require humongous effort of all parties. \\nSecond, an international conference on the future of the Middle East with every single regional actor represented, including Iran. Austin Fitts: Okay. \\nSaker: And the last one, an international conference on the future of the dollar and the international financial system. This is to avoid a catastrophe and to negotiate a drawdown and retreat with all interested parties. Austin Fitts: Right. If you retreat, what replaces it? \\nSaker: In every single case, the underlying logic is that as long as you have a ward hegemon, he is in charge of everything and has to carry the burden of everything. Here you pull in international actors and get them to share both the responsibility and the right to promote their own interests and visions of what is happening. \\nThe last three are clearly recommended instead of fighting the multipolar world, it would be participating in its construction in order to secure the best place possible for the United States because it’s going to happen whether the United States likes it or not. Austin Fitts: Right, here is the challenge. Let’s say we go to a system where the central banks are clearing international currencies and letting the market decide. You now have a deep state that has accumulated enormous financial resources that can play the system in many different ways. You’re going to need international government cooperation to ensure the integrity of the digital and other systems, both hardware and software, and make sure the deep state cant’ do that. Otherwise you’re going to have some pretty frightening economic warfare. You’re going to need a very high level of cooperation to make sure that the systems have integrity. \\nSaker: Yes, and that is why I think that tackling the deep state in the US would be crucial, but also in other countries. The planet needs to wrestle back control over its finance and resources and economy from that tentacular multinational deep state which has taken physical control of the main system that runs the planet. Absolutely. That is the purpose behind that. \\nBasically it’s a paraphrase for saying ‘deconstruction of empire’, because the deep state is what builds the empire. Austin Fitts: You’re talking about an international effort of the lawful against the lawless. \\nSaker: Exactly. That’s as good a definition of a multipolar world as I’ve ever heard. Austin Fitts: The question is: How is the lawful going to get together and make itattractive for the lawless to come over to a lawful side? \\nSaker: The lawless are inside every single country and the countries need to go through a process of resovereignization. That is exactly what is happening in Russia right now. \\nThe process is far from complete there, by the way. It’s still an ongoing process, but that is what eventually real people who are patriotic and who love their country and are not imperialists have to do. They have to do that internally, and then they have to join forces to force that upon the resistance. \\nRight now Russia and China are clearly cooperating against the US, but whom are they cooperating against really? They are cooperating against the US deep state. There could be, in theory, an American President who would find more interests in common with Russia and China than with the US deep state. Austin Fitts: Let me bring up two interesting recent events, which I categorize under the topic of ‘cut and run’. For many, many years I’ve worked with reporters. Cynthia McKinney did this in Congressional testimony and said, “Who owns the contracts? Who has the contracts? Who is running the information and payment systems where these trillions of dollars are going missing?” \\nUp until 2001 we had $4 trillion go missing from DOD, HUD, and other government agencies. Since then, because of the wars in the Middle East, much more has gone missing. Then we had the Inspector General come out and say that there were $6.5 trillion of undocumentable adjustments on the books of DOD for 2015. \\nNow here is what is interesting. Last year in January, Lockheed Martin announced that it was going to spin off its information systems, presumably including that DOD contract – I’m assuming it’s included – to a new company that SAIC set up to spin out its information. So SAIC and Lockheed have now spun out their information systems into this new company, so its liabilities are off of their balance sheets, and those contracts have gone to this new company. That was effective as of July. \\nIn August, the DOD Inspector General said, “Oops! We’re missing $6.5 trillion.” I posted a commentary called ‘Lockheed Cuts and Runs’ describing the fact that Lockheed has given up that power point, if you will, just to get the liabilities off their balance sheets, which tells me that something is up in 2017 after the inauguration. That’s a big cut and run. \\nSaker: It is. I was not aware of all of that. Very interesting. Austin Fitts: We now have over $12 trillion missing from the Federal government. I’ve always asserted that under the law – and there is case law on this point – that the \\nDepartment of Justice can assert a ‘common law right of offset’ against Lockheed and seize Lockheed and all of their assets. If they’re the contractor and all of that money is going missing on their systems, then that is in violation of the Constitution and the laws and regulations related to financial whatever, and they have knowledge of it- which they obviously do- then they are liable for the full amount, given past positions that the Department of Justice has taken with other contractors. \\nThat is a very big and important cut and run. Now let’s talk about another cut and run that very much relates to Russia. If you consider where we were in 1995 and the vision of unipolar empire, a very important part of that was getting GMO seeds and terminator seeds adopted globally. \\nIn fact, we know that the Doha Round – the Uruguay Round – went into effect in 1995 with the creation of WTO. We know that the Doha Round is stalled, and one of the biggest reasons it stalled is 200,000 Indian farmers have committed suicide and died trying to stop GMOs in India. \\nIf anything has contributed to stopping GMOs globally, it’s Europe’s resistance and now Russia outlawing GMOs and saying, “No way.” \\nSaker: Yes. Austin Fitts: Putin has used this very effectively as a tactic saying, “We are going to build a GMO-free agricultural industry.” It’s a great business because non-GMO is growing, and fresh and organic is growing gangbusters. It’s one of the great growth areas in the global economy. Now we have Monsanto, and what they did in the United States is went out, and whether using the law and trying to force legal adoption of terminator seed or market adoption, it got very aggressive about trying to force farmers onto their model of GMO seeds and their pesticides. That drove the cost of seed up dramatically. While we were in the commodity super cycle, farmers could afford it. Now with commodities crashing, the seed prices are absolutely driving them out of business. Monsanto is in real political trouble; their stock is way down. \\nWe finally saw the Germans agree to take them over at a 44% premium. The Germans are buying out Monsanto. I don’t know how they’re going to do the legal organization and what that means of stripping those liabilities out of the balance sheet, but whether it’s a name change or stripping out those liabilities, it sure looks like another cut and run. \\nSaker: And do the Germans have any economic interest behind that, or is it a political deal? \\nIs the US just using Germany as a way to cut and run? Austin Fitts: China just bought Syngenta, and just announced something like a $450 billion commitment to revolutionize agriculture over the next ten years. Monsanto has a lot of intellectual capital in the agricultural area. I think the Germans see this as a very important part of the future. I also think that if you observe what some people call ‘the Fourth Reich’, they have an absolute interest in making sure these liabilities are managed, so that could be a piece of it. \\nIt’s murky, but there is definitely an aspect of cut and run. \\nSaker: As for the first example you gave, Russia has a very similar problem of corruption in the military-industrial sector. They’ve been fighting it for a while, and I don’t think it’s solved. I think it has improved but that proves that governments and the people have common problems and common interests. What this is going to look like in Russia, according to an expression in Russia, “What’s needed is an iron broom.” That is a symbol for a merciless crackdown on corruption. That crackdown on corruption where money disappears is a fundamental national security interest for every state that wants to be sovereign and not a host for a parasitic group of people. \\nThe interests are similar. If Russia and the US collaborated, it would be much simpler for them to work together than to fight each other while they are both affected by the same kind of parasite. Austin Fitts: I think if you look at the financial coup d’état here, it was $40 trillion before this $6 trillion was announced. So let’s say we’re up to $45 or $50 trillion. If you study how much it’s drawing out of the economy, let alone the trillion dollars a year plus for military expenditures and costs worldwide, because of new technology we are in a very powerfully deflationary stage. We’ve levered up with debt, and we’ve used that debt to finance things that are not economically productive or for this disappearing money. \\nWhether it’s the black budget tax or the tax of having a corrupt aristocracy, it’s been enormous and we’ve financed it with more and more government debt. \\nThere is a great quote I keep using from the German Finance Minister Schäuble saying in Shanghai in February at the G-20 meeting, “The debt finance growth model is over. There are no shortcuts that aren’t reform.” \\nWhat he’s saying is, “You can’t kick the can with more debt. The reality is: You have to get down to the issues of what is economic and what is productive and what is not.” \\nMy whole 2nd Quarter Wrap Up, which I’m going to send you a hard copy of this week, is on these issues of productivity and how we get to real productivity. The reality is: When you’ve run out of debt capacity and you can’t keep growing debt and you’re deflating, I assure you that your balance sheet, your income statement and your expense items become that much harder to cover your debt service, let alone the black budget tax. \\nThese issues have to come to a head, not just in Russia and the United States, but everywhere. What I see is that we’re all thinking in terms of Russia versus the United States; we’re not thinking in terms of the lawful versus the lawless and bringing transparency to these issues. \\nHow do we get the lawful together globally? I think that’s what you meant when you said that Trump should pull these international conferences together. What you’re saying is that he should get the lawful together globally to have this conversation. \\nSaker: Yes. We can call it the lawful, we can call it the sovereign, or those who want to be parasite-free, but it’s all the same thing. It’s that whatever aspects you look at, the empire is crumbling. There is no doubt about it whatsoever. It’s going to be replaced by something else because it’s unsustainable. \\nThe best way of making that something else happen, is to jointly manage that transition and try to make it the least catastrophic and the least painful, although it will be hard, and to get some kind of pulling forces together to go over a very difficult and potentially dangerous transition period. It is an extremely dangerous one because it is planetary. Austin Fitts: Right. I used to have a deputy when I worked in government, and he used to say, “In the destruction of the old, let there be the creation of the new.” \\nWhat he was pointing out was that when you take down a system, you need a clear vision of where you’re going. You can’t take down one. It’s not a two-step process; it’s a one-step process. It’s like judo; you really need to know where you want to go when you make a defensive move because, in fact, the defense is the offense. \\nIt seems that we need a vision of what could be a highly productive, highly wealth-building way of managing this planet together. \\nSaker: But for that to happen, we would need to ditch the predominant ideology that has been ruling for at least the past 50 years, if not more. That is going to be extremely hard to do. We have an entire class of people who have a vested interest in that. \\nThe empire is still strong because the minority that benefits from it is so big. It’s not ten people; it’s much more. And they hold instruments of power, so that is where the danger comes in. The danger is doubling down. When it’s doubling down on an unsustainable policy, it results in a catastrophe – literally. Austin Fitts: Right. I will never forget when I was in London in 2002, I was being shrieked at by a guy from the Pentagon who was screaming at me about how dare I talk about the $4 trillion missing money. What I realized – and it was very interesting, Saker – was that his wife worked at IBM, he was a long-time bureaucrat at DOD, and what he thinks is that his pension fund is good no matter how much money they steal. \\nSaker: Yes. Austin Fitts: It is as long as you can double down on the whole planet and make them play – play and pay. If you can’t, then all money is real, and guess what? Your pension fund doesn’t work either. \\nIt’s a little bit like the Titanic; everybody thinks that their deck chairs are good as long as they’re government guaranteed. Well, that’s fine as long as the ship is floating. But when the ship is not floating, guess what? We all go down. \\nSaker: But in order to try to protect the ship, it is important to give that Pentagon guy some kind of way out – not necessarily everything that he wants, but if we corner that guy, he will fight to the very last cent, too. Austin Fitts: Absolutely. What you want to say is, “Look, during the last 20 years corruption worked. It was the strategy that worked. But now that is over, and now you need to come back and do this.” \\nI agree with you. You’ve got to make it attractive for as many people as possible to jump ship and go with a new system. \\nSaker: And you’ve essentially just summarized what Putin has been doing since he came to power. That is why he goes in slow steps in reforms and doesn’t go into huge purges or massive, grand actions like in a movie because he has to offer some way out to all of the people who were interested in the old 1990’s kind of Russia. \\nSome you can negotiate with, and some you can’t. It’s going to be the same way in the United States. Some people probably will accept that a transition is needed; others – the hard core – will need to be dealt with by this iron broom that I mentioned. But you want to have that group who will resist down to the last one as small as possible and as weak as possible. Austin Fitts: One of the reasons I’m so adamant on The Solari Report about the importance of, whether it’s your time or your money or your vote, to always support good leadership because, what I know, is that there is a tremendous number of competent people in the leadership who have been pushed to the side because they didn’t want to go along with the corruption, and the general population supported the corruption. \\nSaker: Absolutely. Austin Fitts: We can’t afford to lose that portion. Shifting support and realizing that they’re there if the general population will shift and shift individually with their own money, their own time, and their own everything. Part of that is just turning off the media machinery because the media machinery I see as being one of the most negative influences there is. \\nSaker: I agree 100,000%, and I was just about to say that this is where Putin began. The first thing he did was not take control of the media, but got rid of the fifth columnists and the media – not all of them, but a good 80-90% were removed quietly, nicely, and with some packages negotiated. He got rid of them. \\nRight now the media in the US is the number one target and the number one enemy. If Trump ever gets to power, I hope he will do something about it. \\nAs you said, that is the first level. As long as the media continues to say that black is white and wet is dry and hot is cold, it’s going to be extraordinarily hard. You need people’s support for reforms. Therefore, the media – which right now is completely, totally in bed with the neocon agenda and their worldview –the key people in the media will have to be fired and replaced with other people. That is the iron broom. It has to start with the media because if the media becomes reasonable, then even Congress will calm down. Austin Fitts: Saker, I think it’s not just the media but also the Telco’s. If you scrutinize the entrainment technology and the trance state that everybody is getting put in, that is the hardware and the software. It’s not just the media, but also the Telco’s. \\nYou’re talking about the entire communication infrastructure being manipulated in ways, which are very dangerous to any kind of waffle agenda. I don’t know if you’ve seen the perfectly horrible movie Kingsman, but that’s why I call it the ‘Kingsman campaign’. \\nSaker: Yes, you have mentioned that to me. Austin Fitts: There is another movie with John Cusack called Cell, and it’s the same thing. It’s billionaires using sim cards to manipulate people’s minds and trick them in a variety of ways. I looked at the latest Gallup poll, and interestingly enough, Congress’ approval rating is even lower than the media, which surprises me. \\nTell us what you’re going to be up to for the next three months. We regularly post the links of what you’re writing, but obviously your site is thriving and doing well, so tell us about what you’re doing for the next three months. \\nSaker: I think the main event in the next few months is the elections, and I will try to look at it from the aspect of how it impacts internationally and how people are lining up. It’s very interesting to observe. First of all, not only am I for the first time truly interested in one, but also I love to follow how that election is viewed abroad and how foreign specialists align. \\nIt’s amazing. The consensus against Hillary Clinton is total. Austin Fitts: Really? \\nSaker: Oh yes, real specialists. Everybody says that they’re not sure about Trump, but Clinton horrifies them. Austin Fitts: Let’s talk about this. It’s very interesting. I was down in Australia in the springtime and I was at a meeting that is organized by the group from Australia who go to the World Economic Forum. They go to Davos and the World Economic Forum, and come back and do an Australia-focused meeting. They then invite some outsiders in to inspire thoughts. I was one of the outsiders. \\nIt was fascinating because there were so many people there who I talked with and who I liked tremendously who were terrified by Trump and thought that Clinton was okay. What I kept saying to them was, “If Clinton is okay with you, then it’s hopeless because we’re talking about a criminal system and there is no hope.” \\nSaker: But you’re talking about an Anglo country. Austin Fitts: Right, but they really thought that Brexit and Clinton were one, and that it was a referendum on globalization. I kept saying, “No. We don’t have a problem with globalization; we have a problem with centralization when it’s inefficient and corrupt.” \\nSaker: Right. Austin Fitts: We have a problem with lawlessness and we have a problem with corruption. Globalization doesn’t have to be corrupt, and it doesn’t have to be lawless. But we have a real problem with uneconomic centralization, and that is what has to stop. If globalization is going to involve uneconomic centralization and corruption and promoting people like Clinton, then we’re all going to walk into a wall. \\nWe’re going to have to stop and revisit centralization versus decentralization and lawfulness versus lawlessness. I would say that the global image of Clinton was so completely different from the reality that it was just a little bit frightening. \\nSaker: I have to say that when I mentioned our next President and I was talking about Russia, China, Iran, Latin America and Europe; that is where I’m looking. It’s probably not the same sample as what you would have seen in Australia. Austin Fitts: Here is what I saw in Australia and in the United States: The reality of the Clintons has always been kept off as the ‘right wing conspiracy’. For the first time, we are seeing all of that bust through, and I think much of it was the Bernie Sanders supporters. Now the reality of Clinton is becoming a bipartisan understanding, whereas before, it was really kept off and pooh-poohed as fringe. Now I think folks are looking at what happened in Haiti and at the money and the foundation and at the emails and saying, “Wait a minute. \\nThis is corruption. This is lawlessness. This is something else.” \\nSaker: I sure hope so. I am still very frightened because my impression is that as long as the media is going to be in lockstep with Clinton, it is going to take one heck of an effort to counteract that. But I sure hope so because in the countries that I follow, the consensus is, “God preserve us from Hillary.” All the bets are off. That is what everybody is saying. \\nWith Trump they are dubious; they don’t like him, but they at least think, “Maybe.” Austin Fitts: Right, so if Clinton wins, what happens day one in China and Russia? \\nSaker: More of what has already been happening. I will be honest, Russia has been preparing for war for the past several years. They have been very, very actively preparing for war. It’s down to the level that even banks had an exercise in how they would function during a conflict. Even they are preparing for war, and I think the Chinese are doing exactly the same thing because they are assuming that their only chance to survive a Clinton Presidency would be for her to not think of directly attacking them. \\nIt’s every day military exercises – joint military exercises, civil preparations, restructuring of the emergency ministries and the state security ministries, and everything that has to do with emergencies. They are having preparations for war, and they are going to accelerate it if Clinton gets there. \\nI don’t think they have any other option. It’s not that they are particularly hell-bent on war; it’s just that they literally have no other option. That’s what I would be doing, too. \\nIf you were told that you were going to enter a cage with a rabid tiger inside, you would get the biggest gun you can, and that is what they are doing. Austin Fitts: Right. As you know, I believe that Brexit was the British saying, “We want to get out of the arrangements with the US before Clinton gets elected and before this gets any worse.” \\nIt was the Anglo-American Alliance coming apart at a very deep level. Has the British vote for Brexit changed what is happening? I see that that couldn’t have happened without England making a deal with China. \\nSaker: I don’t know; that is your area of expertise. I have no reason to believe or disbelieve an English negotiation with China. I tend to think that this was a surprise for the British elites. I see the signs of that having been negotiated or prepared, and I think they were caught off guard by it, but I may well be mistaken. I’m not a UK specialist. Austin Fitts: Oh, I think the Queen very much wanted to come apart. I don’t think the aristocracy was of one mind, but if you consider Boris Johnson and Nigel Farage’s effort, someone was behind that. I think it was very much top-down, and part of it came out of the meetings. \\nI’m not saying that there was a direct negotiation with China, but there was a very big meeting in China in the first quarter. China met with the English, and the comments were coming out, “We’re ancient cultures; not everybody is.” It was a real direct dig on the United States. \\nI think England wants to move forward on the multi-polar world and that the neocon agenda is nuts. They don’t want to be brought down by it. \\nSaker: What’s certain is for the British to disengage themselves as much as possible from the sinking EU is a very sound thing. The closer you integrate with that sinking ship, the more likely you are going to go to the bottom. Even at that point I would see similar interests – people who say, “Let’s protect our financial interests here,” and forget about this ideological construct that the EU was. Austin Fitts: Right, but I think part of the EU construct is related to the relationships with the US. \\nSaker: Yes, absolutely, the US modeled the EU. Austin Fitts: Is there anything else that we need to know to follow you in the next quarter? Give us your website again. \\nSaker: It’s www.TheSaker.IS , where you can get the main website, and there are a number of sites in other languages that you could also follow – Latin American, Spanish, Italian, German, French and there are many different languages, and are all part of one community. There is a very good one in Australia that is the Oceania Saker Blog, which I also recommend you check out. Austin Fitts: You’re blossoming like a garden, Saker. I can’t thank you enough for doing these quarterly reports and for your website and all of the work you’re doing. It really gives us a view. It’s so important to understand the shift to a multipolar world that has been going on for quite a while and is going to continue going. As you said, it is a very important and deep change. I can’t thank you enough. We really appreciate your help with it. \\nYou have a wonderful day. \\nSaker : Thank you so much. It’s always an honor and a pleasure, and I wish you and all of the listeners a wonderful day also. Take care.'"}, "time": 1742628421.1161213}