{"duration": 0.030673980712890625, "input_args": {"text": "'Share on Twitter The Wildfire is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nDonald Trump told an invitation-only audience of 700 supporters in Charlotte, North Carolina, on Wednesday that if elected, he will offer a “new deal for black America.” \\nHe rolled out the plan wrapped in three promises . \\n“I want to talk about how to grow the African American middle class and to provide a new deal for black America. That deal is grounded in three promises — safe communities, great education, and high paying jobs.” \\nOf those promises, he said, in part: \\n1. Safe Communities \\n\"Making our communities safe again will be a priority. You walk to the store to buy a loaf of bread maybe with your child and you get shot. We got to stop it. \\n[T]he law will be applied fairly, equally and without prejudice. We will also police our streets—have to keep our streets safe. \\nThe problem is not the presence of police but the absence of police. We need really a great group of people to keep you safe, to keep us all safe.\" \\n2. Education \\n\"School choice is at the center of my plan. And by the way we’re going to terminate common core and bring education local. \\nMy proposal redirects education spending to allow every disadvantaged child to attend the public, private, charter, magnet, religious or home school of their choice.\" \\n3. Jobs \\n\"When we stop off-shoring to low wage countries, we raise wages at home meaning rent and bills become instantly more affordable. \\nI will also propose tax holidays for inner city investments, a new tax incentive to get foreign companies to relocate in blighted American neighborhoods. \\nI will also pursue financial reforms to make it easier for young African Americans to get credit to pursue their dreams in business and create jobs in their communities.\" \\nTrump has repeatedly asked America\\'s blacks “what do you have to lose?” On Wednesday, he once again explained why minorities should reject Hillary Clinton and the Democrats. \\n“We keep electing the same people over and over and over and they keep coming back to the African American community and the Hispanic community and they keep talking about what they’re going to do and they don’t do it and four years later you see them again.” \\nBased on a CBS News poll released last week, Trump has a steep hill to climb with less than two weeks to go — he received support from just 4 percent of likely black voters. '"}, "time": 1742562752.4105804}