{"duration": 1.1825189590454102, "input_args": {"text": "'By Rmuse on Sun, Oct 30th, 2016 at 9:53 pm The F.B.I. has a solemn obligation to remain neutral in political matters; the faintest appearance of using the agency to influence our election is deeply troubling. Share on Twitter Print This Post *The following is an opinion column by R Muse* \\nAs a nation of laws, the American people should, and most likely do, demand that law enforcement officials hew as closely to the law as humanly possible and that goes double for the country’s largest investigative agency. One thing every American who has ever watched a law enforcement press conference after a crime has occurred understands is that the public never really knows the details of an investigation regardless the severity of the crime or who the suspect is. As an occasional print journalist, this author can attest that asking a police spokesman for details during a press conference about what the police are doing or who they are investigating never fails to get a stern scolding about expecting law enforcement to reveal any facts during an investigation for glaringly obvious reasons. The scold always includes referral to the agency responsible for charging and prosecuting a crime after the investigation is complete and the results are handed over to the local district attorney. \\nApparently, the Federal Bureau of Investigation (FBI) director James Comey never got the memo that discussing an investigation publicly is verboten; if for no other reason than to maintain the integrity of said investigation and not hamper a possible prosecution. However, as it turns out Mr. Comey did get “a memo ” from the Department of Justice in the form of a warning . But because he is a law unto himself and his allegiance is to House Republicans and not the Department of Justice, he ignored the DOJ counsel to do a solid for the GOP less than two weeks before a presidential election. \\nSince Mr. Comey can’t keep it (investigations) in his pants, or follow long-standing law enforcement and investigative rules, or take heed to Justice Department warnings, it is incumbent on President Barack Obama to summarily fire F.B.I. Director James Comey on the morning of Wednesday, November 9th 2016. Why should President Obama wait until the day after a general election to fire the partisan director of the F.B.I.? So as not to give the appearance of any impropriety or partisanship during a campaign or just prior a presidential election; something FBI director James Comey is apparently incapable of comprehending. \\nThis incident, just like the one in July when Comey broke precedent and convened a press conference in July, and then publicly testified before Congress to discuss the Bureau’s ongoing investigation is more than just a breach of precedent; it smacks of partisanship for more than one reason. First, as mentioned above, not only did the Department of Justice warn Mr. Comey that it was inappropriate to discuss an ongoing investigation at all, much less so close to an election, that warning came after the F.B.I. contacted the DOJ about going public with information the Bureau admitted it had not yet even “ reviewed .” That was precisely what Comey told his Republican buddies in a letter to Congress. \\nIn the letter , Comey told congressional Republicans that the F.B.I. really had no clue whether any of the emails were related to Hillary Clinton’s private email server, but what he did “ know ” for sure was that they “ appeared ” to be pertinent; even though his agency, the F.B.I. had not yet examined them. So the real pertinent question is: why did Mr. Comey publicly inform Congress about emails the agency had not yet examined if he wasn’t attempting to inject some ‘ partisan drama ’ into the election that might have deleterious impact on the outcome? \\nIt is just as pertinent a question as demanding to know from Mr. Comey precisely what his motivation was in holding a press conference back in July to discuss the agency’s finding on an investigation before the DOJ weighed in, or discuss that investigation in public and before a viciously partisan Republican committee in Congress. And no, it was not to defend the Bureau’s decision not to bring criminal charges against Clinton; only a brain-dead moronic imbecile or partisan Republican hack would begin to think that the F.B.I., C.I.A., local sheriff, or any police investigative agency has the ability to bring charges to prosecute a violation. For dog’s sake even the 1960’s fictional sheriff Andy Griffith’s hapless deputy Barney Fife was competent enough to comprehend that a district attorney’s office or Department of Justice is tasked with prosecution any violation of the law. \\nAccording to Mr. Comey, who was “ stung by criticism from both Democrats and Republicans ” as well as former prosecutors and “ appeared to be on the defensive ;” “ he felt obligated to inform [Republicans in] Congress ” even though the Bureau really didn’t “ know the significance of this newly discovered collection of emails. ’’ Likely because he knew they did not come from Hillary Clinton. As an aside, Sarah Jones has a nifty summary of the “email” caper the F.B.I. Uncovered while investigating “ serial sexter ” Anthony Weiner’s laptop computer, iPad, and cellphone. And no, Anthony Weiner was not sexting nasty pictures to presidential candidate Hillary Clinton. \\nIt doesn’t matter what kind of pathetic excuse Comey gave for publicly commenting on an ongoing investigation, it is virtually impossible to believe he didn’t have partisan intents and purposes in publicly alerting House Republicans. As interim chairwoman of the Democratic National Committee, Donna Brazile said, “ The F.B.I. has a solemn obligation to remain neutral in political matters – even the faintest appearance of using the agency’s power to influence our election is deeply troubling .” Ms. Brazile demanded more information from Comey and didn’t conceal her concern over Comey interfering with the election. \\nMr. Comey claimed, very conveniently one might add, that as a died-in-the-wool Republican he contributed to John McCain and Willard Romney’s presidential campaigns in 2008 and 2012 respectively, that he is not a Republican now. That was his remark back in July when he first began breaking precedent and revealing information about an investigation that was the proper purview of the Department of Justice, not the Federal Bureau of Investigation. It was a suspicious “ confession ” in July and it is nearly impossible to believe in late October after he ignored Department of Justice warnings and revealed information about an ongoing investigation into a disgraced former congressman and serial sexter just 11 days before an election and before the Bureau had even reviewed anything. \\nComey cannot possibly remain as head of the Federal Bureau of Investigation after twice revealing information about an ongoing investigation. If Comey hadn’t taken heat for his ‘reveal’ in July, and a warning from the Justice Department this week, then one might just regard him as an inept law enforcement official pulling a publicity stunt for attention. But since he was warned, and is not an inept law enforcement official, it is more than reasonable to believe that Comey’s most recent act was a partisan political ploy that should earn him a summary termination on November 9, 2016. Because firing his partisan personage just prior to the general election would break a longstanding precedent and look like a highly partisan move; something a sap like James Comey might try, but not President Obama.'"}, "time": 1742563384.1558158}