{"duration": 0.16217303276062012, "input_args": {"text": "'by Pepe Escobar for RT \\nVirtually the whole planet holds its collective breath at the prospect of Hillary Clinton possibly becoming the next President of the United States (POTUS). \\nHow’s that humanly possible, as the (daily) Bonfire of The Scandals – relentlessly fed by WikiLeaks revelations and now converging FBI investigations – can now be seen from interstellar space? \\nIt’s possible because Hillary Clinton, slouching through a paroxysm of manufactured hysteria, is supported by virtually the whole US establishment, a consensual neocon/neoliberalcon War Party/Wall Street/corporate media axis. \\nBut History has a tendency to show us there’s always a straw that breaks the camel’s back. \\nThis could be it – as revealed by WikiLeaks; March 2, 2015, the day when https://wikileaks.org/podesta-emails/emailid/41841 \\nJohn Podesta wrote, “we are going to have to dump all those emails.” \\nThat happened to be the exact same day it was revealed Hillary Clinton had used a personal http://www.nytimes.com/2015/03/03/us/politics/hillary-clintons-use-of-private-email-at-state-department-raises-flags.html?_r=0 email server as Secretary of State. \\nYet this reveals only part of the puzzle. There’s got to be a response to Podesta’s email – which WikiLeaks may, or may not, leak in the next few days before the election. If the back and forth clearly shows intent (to mislead), then we’ve got a 100% smoking gun: the whole Clinton (cash) machine narrative – according to which Hillary just deleted “personal” emails – crumbles like the ultimate House of Cards. \\nMoreover, that would unveil what was from the start the privileged Clinton machine strategy: to thwart the subsequent internal State Dept. and FBI investigations. \\nAs far as the Clinton machine is concerned, an interlocking influence peddling pile up is the norm. John Podesta also happens to be the founder of the Center for American Progress – a George Soros operation and prime recruiting ground for Obama administration officials, including US Treasury operatives who decided which elite Too Big To Fail (TBTF) financial giants would be spared after the 2008 crisis. DCLeaks.com , for its part, has connected Soros Open Society foundations to global funding rackets directly leading to subversion of governments and outright regime change (obviously sparing Clinton Foundation donors.) \\nExceptional bananas, anyone? \\nThe perfectly timed slow drip of WikiLeaks revelations, for the Clinton machine, feels like a sophisticated form of Chinese torture. To alleviate the pain, the relentless standard spin has been to change the subject, blame the messenger, and attribute it all to “evil” Russian hacking when the real source for the leaks might have come straight from the https://www.rt.com/news/365164-assange-interview-wikileaks-russia/ belly of the (Washington) beast. \\nAt the Valdai discussion club last week, it took President Putin \\nhttp://valdaiclub.com/events/posts/articles/vladimir-putin-took-part-in-the-valdai-discussion-club-s-plenary-session/ only a few sentences to debunk the whole Clinton machine narrative with a bang: \\n“Another mythical and imaginary problem is what I can only call the hysteria the USA has whipped up over supposed Russian meddling in the American presidential election. The United States has plenty of genuinely urgent problems, it would seem, from the colossal public debt to the increase in firearms violence and cases of arbitrary action by the police. You would think that the election debates would concentrate on these and other unresolved problems, but the elite has nothing with which to reassure society, it seems, and therefore attempt to distract public attention by pointing instead to supposed Russian hackers, spies, agents of influence and so forth. \\nI have to ask myself and ask you too: Does anyone seriously imagine that Russia can somehow influence the American people’s choice? America is not some kind of ‘banana republic’, after all, but is a great power. Do correct me if I am wrong.” \\nReality, though, continues to insist on offering multiple, overlapping banana republic instances, configuring a giant black hole of transparency. \\nAnthropologist Janine Wedel has been one of the few in Clinton-linked US mainstream media \\nhttp://www.huffingtonpost.com/entry/clintons-latest-email-scandal-why-it-deserves-scrutiny_us_58177d54e4b08301d33e0cdb?24hp9z9vxqa6y9zfr acknowledging how Bill Clinton, while Hillary was Secretary of State, perfected his version of “philantro-capitalism” (actually a money laundering “pay to play” racket), a practice “by no means confined to the Clintons”. \\nAnd the racket prospered with inbuilt nuggets, such as Hillary being http://www.independent.co.uk/voices/hillary-clinton-wikileaks-email-isis-saudi-arabia-qatar-us-allies-funding-barack-obama-knew-all-a7362071.html perfectly aware that prime Clinton Foundation donors Qatar and Saudi Arabia were also financing ISIS/ISIL/Daesh. \\nHuma, the Fall Princess \\nNow, less than a week before the election, we have come to the crucial juncture where the WikiLeaks revelations are merging with the FBI investigations – all three of them. \\nExhibit A is https://wikileaks.org/podesta-emails/emailid/43150#efmABWAB8ACiACqACvADUADXAIF \\nthis WikiLeaks bombshell; Peter Kadzik, who’s now in charge of the Department of Justice (DOJ) probe into the 650,000 emails found on the laptop shared by Clinton’s right-hand woman Huma Abedin and her estranged, pervert husband Anthony Wiener, is a Clinton asset. \\nNot only Kadzik was an attorney for Marc Rich when he was pardoned by Bill Clinton; Podesta – as also revealed by WikiLeaks – thanked Kadzik for keeping him “out of jail”; and it was Kadzik who gave Podesta a secret heads up https://wikileaks.org/podesta-emails/emailid/43150#efmABWAB8ACiACqACvADUADXAIF on the Clinton email investigation. \\nThe Clinton machine, starring a self-described virtuous Madonna, is actually a pretty nasty business. Huma and her family’s close connections to Saudi Arabia – and the Muslim Brotherhood – are legendary (that includes his brother Hassan, who works for Sheikh Yusuf al-Qaradawi). Podesta, by the way, is a handsomely remunerated lobbyist for Saudi Arabia in Washington; that’s part of the Clinton Foundation connection. \\nYet now, with Huma in the spotlight – still maintaining she didn’t know all those emails were in her and Wiener’s laptop – it’s no wonder Hillary has instantly downgraded her, publicly, to “one of my aides”. She used to be Hillary’s ersatz http://www.vanityfair.com/news/2016/01/huma-abedin-hillary-clinton-adviser “daughter”; now she’s being framed as The Fall Princess. \\nAnd that brings us to the intersection of those three FBI investigations; on Hillary’s Subterranean Email Server (in theory closed by FBI’s Comey last summer); on the Clinton Foundation; and on Wiener’s sexting of minors. The FBI has been investigating the Clinton Foundation for over a year now. Let’s try to cut a long story short. \\nFollow the evidence \\nLast July, the DOJ – under Clinton/Obama asset Loretta Lynch – decided not to prosecute anyone on Emailgate. And yet FBI director Comey – who nonetheless stressed Hillary’s “extreme carelessness” – turbo-charged his no-denial mode on another investigation, as in the FBI “sought to refocus the Clinton Foundation probe.” \\nSoon we had Clinton Foundation FBI investigators trying to get access to all the emails turned over in the Emailgate investigation. The East District of New York refused it. Very important point; up to 2015, guess who was the US attorney at the East District; Clinton/Obama asset Lynch. \\nEnter an extra layer of legalese. Less than two months ago, the Clinton Foundation FBI investigators discovered they could not have access to any Emailgate material that was connected to immunity agreements. \\nBut then, roughly a month ago, another FBI team captured the by now famous laptop shared by Huma and Wiener – using a warrant allowing only a probe on Weiner’s sexting of a 15-year-old girl. Subsequently they found Huma Abedin emails at all her accounts – from to the crucial . This meant not only that Huma was forwarding State Dept. emails to her private accounts, but also that Hillary was sending emails from the “secret” clintonemail.com to Huma at yahoo.com. \\nNo one knew for sure, but some of these emails might be duplicates of those the Clinton Foundation FBI investigators could not access because of the pesky immunity agreements. \\nWhat’s established by now is that the metadata in the Huma/Wiener laptop was duly examined. Now picture both teams of FBI investigators – Clinton Foundation and pervert Wiener – comparing notes. And then they decide Huma’s emails are “relevant”. \\nKey questions apply; and the most pressing is how the emails were deemed “relevant” if the investigators could only examine the metadata. What matters is that Comey certainly was made aware of the content of the emails – a potential game-changer. That’s why one of my sources https://sputniknews.com/columnists/201610311046920348-clinton-fbi-november-surprise/ insists his decision to go public came from above. \\nThe other key question now is whether the DOJ – via Kadzik? – will once again thwart another investigation, this time on the Clinton Foundation. Senior, serious FBI agents won’t take that – massive euphemism – kindly. The FBI has been on the Clinton Foundation for over a year. Now, arguably, they are loaded with evidence – and they won’t quit. Winning the presidency now seems to be the least of Hillary Clinton’s Bonfire of Scandals’ problems. The Essential Saker: from the trenches of the emerging multipolar world $27.95'"}, "time": 1742563807.2309003}