{"duration": 0.1385962963104248, "input_args": {"text": "'Rusia, China y Arabia Saudita ponen en jaque la hegemonía del dólar por Ariel Noyola Rodríguez Estados Unidos encuentra cada vez más obstáculos a su paso para mantener la hegemonía del dólar como moneda de reserva mundial. En los meses recientes, los países emergentes han vendido una gran cantidad de bonos del Tesoro de Estados Unidos, principalmente Rusia y China, pero ahora también Arabia Saudita. Además, a fin de protegerse de las violentas fluctuaciones del dólar, los bancos centrales de varios países han venido adquiriendo enormes volúmenes de oro a fin de diversificar sus reservas monetarias. En definitiva, la ofensiva global contra el dólar se está recrudeciendo a través de la venta masiva de deuda norteamericana y, en paralelo, compras colosales de metales preciosos.\\nRed Voltaire | Ciudad de México (México) | 5 de noviembre de 2016 français italiano La supremacía de Washington en el sistema financiero mundial recibió un golpe tremendo el pasado mes de agosto: Rusia, China y Arabia Saudita vendieron bonos del Tesoro de Estados Unidos por la suma de 37 900 millones de dólares, de acuerdo con la última actualización de datos oficiales publicada hace unos días [ 1 ]. Desde una perspectiva general, las inversiones globales en la deuda del Gobierno estadounidense se desplomaron a su nivel más bajo desde julio de 2012. Es evidente, el papel del dólar como moneda de reserva mundial nuevamente se ha puesto en cuestión.\\nYa en 2010, el almirante Michael Mullen, presidente de los Jefes del Estado Mayor Conjunto de Estados Unidos, lanzó la advertencia de que la deuda representaba la principal amenaza para la seguridad nacional [ 2 ]. A mi juicio, no es tanto que un alto nivel de endeudamiento público (actualmente por encima de los 19 billones de dólares [ 3 ]) sea una piedra en el zapato para la economía estadounidense, sino que más bien para Washington es decisivo garantizar diariamente un enorme flujo de recursos desde el exterior a fin de cubrir sus déficit gemelos (comercial y presupuestario); es decir, para el Departamento del Tesoro es un asunto de vida o muerte vender títulos de deuda a todo el mundo para de esta manera poder financiar los gastos del Estado norteamericano.\\nHay que recordar que tras la quiebra de Lehman Brothers, en septiembre de 2008, el Banco Popular de China se vio fuertemente presionado por Ben Bernanke, en aquel entonces presidente del Sistema de la Reserva Federal (FED), para que no vendiera sus títulos de deuda estadounidense. En un primer momento, los chinos aceptaron sostener el dólar. Sin embargo, ya en un segundo momento, el Banco Popular de China se resistió a comprar más bonos del Tesoro de Estados Unidos y, en simultáneo, puso en marcha un plan de diversificación de sus reservas monetarias.\\nPekín ha venido comprando oro de forma masiva en los años recientes, y lo mismo ha estado haciendo el banco central de Rusia. En el segundo trimestre de 2016, las reservas de oro del Banco Popular de China alcanzaron las 1 823 toneladas frente a las 1 762 toneladas registradas el último trimestre de 2015. La Federación rusa por su parte, incrementó sus reservas de oro en alrededor de 290 toneladas entre diciembre de 2014 y junio de 2016, con lo cual, cerró el segundo trimestre de este año con un acumulado de 1 500 toneladas.\\nFrente a los brutales bandazos del dólar, es crucial comprar activos más seguros como el oro que, en momentos de gran inestabilidad financiera, actúa como un valor refugio. Por eso la estrategia de Moscú y Pekín de vender bonos del Tesoro de Estados Unidos para luego comprar oro ha sido seguida por muchos países: según las estimaciones del Fondo Monetario Internacional (FMI), las reservas de oro de los bancos centrales del mundo alcanzan ya el nivel más alto de los últimos 15 años luego de registrar a principios de octubre un volumen total de casi 33 000 toneladas [ 4 ].\\nLa geopolítica también está jugando su parte en la configuración de un nuevo orden financiero mundial. Tras la imposición de sanciones económicas en contra del Kremlin, a partir de 2014, la relación con China tomó gran relevancia para los rusos. Desde entonces, ambas potencias han profundizado sus vínculos en todos los ámbitos, desde la economía y las finanzas, hasta la cooperación militar. Además de comprometer el suministro de gas a China para las próximas tres décadas, el presidente Vladímir Putin construyó junto con su homólogo Xi Jinping una poderosa alianza financiera que busca terminar de una vez por todas con la dominación de la divisa estadounidense.\\nActualmente, los hidrocarburos que Moscú vende a Pekín se pagan en yuanes, ya no en dólares. De este modo, la “moneda del pueblo” (‘renminbi’, en chino) se está abriendo paso poco a poco en el mercado mundial de hidrocarburos a través de los intercambios comerciales entre Rusia y China, los países que, a mi modo de ver, encabezan la construcción de un sistema monetario multipolar.\\nLa gran novedad es que a la carrera por la desdolarización de la economía global se ha sumado Arabia Saudita, país que desde hace varias décadas se había mantenido como un aliado incondicional de la política exterior de Washington. Sorpresivamente, durante los últimos 12 meses Riad se deshizo de más de 19 000 millones de dólares invertidos en bonos del Tesoro de Estados Unidos, convirtiéndose junto con China, en uno de los principales vendedores de deuda norteamericana [ 5 ]. Para colmo de males, la furia del Reino Saudita contra la Casa Blanca viene incrementando su intensidad.\\nSucede que a finales de septiembre, el Congreso norteamericano aprobó la eliminación del veto del presidente Barack Obama a una ley que impedía a los estadounidenses denunciar a Arabia Saudita ante tribunales por su presunta participación en los ataques del 11 de septiembre de 2001 [ 6 ]. Junto, la Organización de Países Exportadores de Petróleo (OPEP) llegó a un acuerdo histórico con Rusia para disminuir el nivel de producción de crudo y, con ello, promover un incremento de precios [ 7 ].\\nEs llamativo también que, justo por esos días, Pekín haya abierto la negociación directa entre el yuan y el riyal de Arabia Saudita a través del Sistema de Comercio de Divisas Extranjeras de China (CFETS, por sus siglas en inglés) a fin de realizar transacciones entre ambas monedas sin necesidad de pasar antes por el dólar [ 8 ]. En consecuencia, es altamente probable que, más temprano que tarde, la empresa petrolera Saudi Aramco acepte pagos en yuanes en lugar de dólares. De concretarse, la Casa de la Saud estaría apostando de lleno por el petroyuan [ 9 ]. Ante nuestros ojos, el mundo está cambiando.\\nAriel Noyola Rodríguez Fuente\\nRussia Today (Rusia)'"}, "time": 1742561783.40255}