{"duration": 0.17783856391906738, "input_args": {"text": "'For Debra Dixon, a principal with TwinLogic Strategies, a boutique lobbying firm in Washington, staying on top of her career has required flexibility and  . Ms. Dixon, 52, worked for former Representative Xavier Becerra, Democrat of California, for nearly 17 years, first as his legislative director and trade counsel, and then as his chief of staff, until she was appointed chief of staff for the United States Department of Education’s Office of Planning, Evaluation and Policy Development in 2014. Two years later, Ms. Dixon started her own consulting business, Dixon Avecilla. “When I worked on the Hill, part of my job was to look around corners and think about what the future might hold,” Ms. Dixon said. “I had to do that for my boss and for my team, so it was a skill that I had, but as I grow older, I’ve had to do it for myself. ” But running her own shop lasted only a few months. “I went out on my own in May and four months later, my client, Elizabeth Frazee, a   of TwinLogic Strategies, hired me full time,” Ms. Dixon said. “She was going to subcontract some work to me, and we were talking about the scope of the work when she said, ‘Unless you want to join us outright,’ and I took her up on it. ” For women like Ms. Dixon who have been in the work force for decades, it is increasingly important to stay relevant and on top of their professional game to remain marketable to employers and clients. Many women need to keep working past traditional retirement age given their longer life spans and often lower earnings than their male counterparts, which often mean less retirement savings. The Bureau of Labor Statistics projects that by 2022 about 28 percent of women ages 65 to 74 will be in the labor force, up from 12. 5 percent in 1992. Many women over 50 find it challenging to manage their careers. “Women tend to have two strikes against them,” said Debra Whitman, AARP’s chief public policy officer. “There is age discrimination as well as gender discrimination, and you add the two of those, and it’s magnified. ” To keep her career moving ahead, Ms. Dixon said she had to make a “big adjustment” from being a leader of teams to being an individual contributor, but she is happy she did it. She also credits her networking skills with helping her stay on track. “I reached out in every direction, 360 degrees, side to side and up and down,” she said. “You never know where opportunities will present themselves, or how someone that you’ve mentored, or helped along the way, might return the favor. ” Ms. Frazee was a contact from Ms. Dixon’s early days in government. “It was a conscious networking back then because she was a Republican and I was a Democrat,” Ms. Dixon said, “and we both wanted to get to know someone from the other party. ” A strong professional and social connection like that one, nurtured over the years, can be a cornerstone of career longevity. “We underestimate the power of our networks,” Ms. Whitman said. “You can’t be complacent. ” Women who flourish at this stage of their careers typically look beyond their immediate peer group for potential relationships that might pay off later. “I always encourage my older clients to have younger people in their network,” said Jayne Mattson of Keystone Associates, a   firm in Boston. “They are the ones who are going to be hiring you. ” Some of the best opportunities for women in their 50s are in the entrepreneurial space, according to Sylvia Ann Hewlett, an economist and the founder and chief executive of the Center for Talent Innovation, a research group on work and talent development a   of the Women’s Leadership Program at Columbia Business School and the author of “Forget a Mentor, Find a Sponsor. ” “With the skills that this generation of women have, they want to go do their thing either on their own or with a more flexible career within the company where they work,” she said. “They’re looking for meaning and purpose and a paycheck at these older years. ” The ticket for many women is to find someone who has some power and can open a door for them, Ms. Hewlett said. “I needed to take sponsorship much more seriously, for instance, as I sought funding for the think tank that I founded at age 56 and my consulting firm that I founded at age 59,” she said. “I was able to convince folks that I had lots of runway left. ” Ms. Hewlett mobilized her network for her ventures by “literally dusting off my Rolodex,” she said. “The great news is that if you’ve been a professional for a number of years, you have all kinds of acquaintances, or former college friends, parents of friends of your children, maybe even your children’s friends, depending on your age. You almost don’t realize the network you’ve got. ” Women need to take an inventory of their strengths and accomplishments, Ms. Hewlett said, and make sure people know about them. For most professions, having an    social media presence and LinkedIn profile show that someone is not a Luddite when it comes to navigating the internet. Ms. Dixon is convinced that although she and Ms. Frazee has been in touch periodically, it was when she brushed up her LinkedIn page that she came across Ms. Frazee’s radar again. “You have to look pretty carefully at the assumptions that people make about women over 50,” said Beverly E. Jones, an executive coach and the author of “Think Like an Entrepreneur, Act Like a CEO. ” “One of the assumptions is that after a certain age you are resistant to change, particularly change related to technology. That’s a red flag. ” The way to fight back is to be curious, she said. “Take classes in areas that interest you,” she said. “Any time that you put yourself in the path of learning something new, it changes how you see the world, and it changes how you perform. ” Career experts widely acknowledge that continuing education and skill building are important to keeping a career viable. “Take an online coding class,” advised Sallie Krawcheck, the author of  “Own It: The Power of Women at Work” a   and chief executive of Ellevest, a digital investment platform for women and the chairwoman of Ellevate Network, a professional women’s network. “Master some new technology,” she said. “Freelance on the side to boost your talents spend time with people who are innovating in your industry and even starting companies. “Whatever you can do to keep yourself moving forward will reduce your career risk and make your life a lot more interesting and fun. ” To signal to the world that you are on a path of action, jump at new opportunities even if they scare you, Ms. Jones said. “You’ve got to raise your hand,” she said. “For me, I recently started doing podcasts. I didn’t know anything about doing podcasts. But I thought, why not?”'"}, "time": 1742562130.2474363}