{"duration": 0.015990495681762695, "input_args": {"text": "'Monday 14 November 2016 by Davywavy and Spacey ‘Suspicious object’ at Daily Mail offices identified as a piece of factual journalism \\nThe offices of The Daily Mail were evacuated earlier after a suspicious object later identified as a piece of journalism was discovered in the building. \\nA spokesman for the Daily Mail & General Trust confirmed they had no idea how the fact came to be at Northcliffe House and it definitely wasn’t theirs. \\nChief Ad salesman Simon Williams told us how he made the discovery. \\n“My suspicions were first aroused when I saw this bit of research that included actual data and verified citations on it just lying about, and I thought ‘There’s no reason that should be here’. \\n“Clearly nobody at the newspaper would have something like that nowadays, so it must have been brought in by an outsider.” \\nThe owner of the factual journalism has not been identified, although police are confident it did not originate in the offices of rival outlets such as the Guardian or the Canary. \\nSecurity services are understood to be wanting to talk to a man they describe as ‘suspicious’ as CCTV footage shows him doing some actual research and speaking to experts before writing an article. \\nPolice described the evacuation of the offices as extremely orderly. \\n“It was dead easy,” we were told. \\n“We just turned on the BBC news and everyone just covered their ears and ran from the building.” \\nThe accurate reflection of events was discovered at around 1.30pm, and staff were told to wait in the street outside while the Mail’s specialist team of fact disposal experts investigated its contents. \\nAs one member of the fact disposal team explained, “We have spent thousands of man-hours perfecting the art of taking dangerous facts and making them safe for consumption by our readers. This was no different, and we were ready. \\n“By the time we had finished, I can assure everyone the content was completely fact-free.” '"}, "time": 1742628543.8920105}