{"duration": 0.10695219039916992, "input_args": {"text": "\"10 Signs That The Global Elite's Ship Is Sinking Nov 16, 2016 9 0 \\nTimes are continuing to shift in a big way and humanity’s rise over the darkness that has plagued our planet for a very long time is gathering momentum by the day. Remember, the elite’s modus operandi is to crush any form of hope or belief that things can or will get better. Truth prevails though and we are seeing the old world order crumble. 2017 is sure to be an exciting year. Continue to dream big. The cabal is being flipped upside down. June 23rd, 2016 : Britain votes to leave the European Union. While some are choosing to see this as an extremist act whose focus was on securing the border from immigrants, there is a much bigger picture to that event. While it must be said that the immigration issue is in the minds of some who were pro-Brexit (and thus needs to be humanely and compassionately addressed), the bigger issue was that Britain reclaimed it’s sovereignty back from the imperialistic banking and political cabal. As it has been reported in The Telegraph, a mainstream media outlet in the UK, the CIA and the U.S. State Department have been heavily involved in the creation of the European Union from the very beginning. As Professor Alan Sked said in the article : Voters in Britain’s referendum need to understand that the European Union was about building a federal superstate from day one. July 22nd, 2016 : Wikileaks releases over 20,000 emails from the Democratic National Convention and shows the deep collusion between the Clinton Campaign and the DNC itself. These revelations ultimately helped force the resignations of the top 4 positions within the DNC. October 8th, 2016 : Shortly after Wikileaks began dumping the PodestaFiles, emails were revealed that John Podesta, the Clinton campaign chairman, was receiving emails about UFO/E.T. disclosure as well as free energy technology , whose emails came from former NASA astronaut Edgar Mitchell. These are highly significant in the fact that it is admitted by Mitchell that such technologies do exist and that even the Vatican knows of them. Once these technologies are known about on an even wider scale, the lies and corruption of the oil industry will fall apart and humanity can then reclaim it’s freedom. October 10th, 2016: Turkey defies the banking cabal and signs the Turkish Stream gas pipeline deal with Russia. Because Russia is in opposition to the cabal, or NWO, as some would prefer, this is a massive financial and geopolitical game-changer. October 20th, 2016: The Philippines president Rodrigo Duterte visits China with 200 Filipino businessmen to mend ties with China. He also announces his separation from the U.S. (which is a blow to the cabal) and seeks an alliance with not only China, but Russia too. The BRICS Alliance continues to grow. October 30th, 2016: Iceland’s Prime Minister steps down as the activist, anti-establishment party, known as The Pirate Party, comes in second in national elections and jumps it’s number of parliament seats from 3 to 10. As more people around the world herald the call for true freedom, political parties reflecting such ideals will continue to prevail. The Pirate Party is in over 40 countries around the world currently, and the movement continues to grow. November 4th, 2016: Wikileaks emails reveal the Podesta brothers were invited to a “spirit cooking dinner” and involved eating sperm and menstrual blood. While some surely laughed this off, keep in mind that former FBI special agent Ted Gunderson spent several years investigating and exposing this information to the public, before being murdered. We must also keep in mind that former BBC star Jimmy Savile was revealed to being involved in a massive, elite-ridden pedophile ring. The pedophilia and ritualistic claims against many of the elites is well known around the world and is a very serious issue. The fact that even a small bit of this came out in the Wikileaks revelations is significant and a sign of the times. So much more is coming . November 8th, 2016: It was revealed by Neil Keenan that several globalists/cabalists, including Mark Carney of the Bank of England, Janet Yellen of the Federal Reserve, the Rothschilds, Malaysian Prime Minister Najib Razak and others were involved in a deal to steal 1 million metric tons of Gold from the global collateral accounts . As of this writing, the deal has been stopped and it very beneficial to humanity. While this story might not make much sense to many readers, understand that the global collateral accounts are the cabal’s biggest financial secret on this planet. It is the reason JFK was killed and it also relates to 9/11 . November 13th, 2016: The European countries of Moldova and Bulgaria elect new presidents, both of whom are pro-Russia. This is yet another major setback for the globalists plans of creating a superstate out of Europe. Watch for even more countries to begin aligning with Russia. November 15th, 2016: More than 200 rallies around the U.S. take place to protest the North Dakota pipeline that is being attempted to form. The world is continuing to awaken and sees the lunacy of oil and gas for energy. Clean solutions already exist. \\nWhat are some other stories that you believe are signs that the elite’s ship is sinking? Some believe that the election of Donald Trump is a sign. Do you agree or disagree with that? Share with us in the comments section what events you feel should be included in the upcoming Part 2 of this ongoing story. If we agree, we’ll post it in Part 2. \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and does health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information and other inspiring articles.\""}, "time": 1742563041.0598226}