{"duration": 0.14567971229553223, "input_args": {"text": "'0 We want to be creative so much, though it is only rarely given to us. \\nOnly when we are not under the pressure to perform and when we can freely let out the creative spark within us: it then goes on a rampage, the creative fire comes alive and prepares to explode and with feverish excitement, we begin to make our vision real. \\nYou may have a brilliant idea. You see the idea crystal clear, you know where you want to get, what you want to make real. You know, you feel what you have to do, how you need to do it in order to realize and manifest your plan. “Oh, this is a really great idea. If I implement this plan, then I will surely help others, and secure my living at the same time.”, the excitement bursts out from you. \\nThe only extremely unpleasant thing is, that these peaks of feverish creativeness occur rather rarely. As your enthusiasm decreases, moderates, countless concerns fill you: “Oh, I am sure I am not able to do this. I am not good enough or skillful enough for this. I am afraid that I will fail.” – this is what you think and your dreams, which seemed to be so refreshing, exciting and radiant, begin to fade. What you thought was great, very important, now it just does not seem like that anymore. In fact, doubt gradually conquers you: “I am sure I cannot accomplish this!”. \\nIn other cases, our plans may not necessarily be “world-changing”, just some smaller-scale idea, but this would be far enough for you to find happiness. Perhaps the planning of a flower bed, or organizing a trip would be just enough to get you all fired up and excited and make you want to completely engage in realizing it. But somehow, your excitement drops underway. You give up. \\nOr maybe your boss forwards an email to you, which begins like this: “This is a creative task, suitable for you!”. You run your eyes through it and note it with disappointment: “This is a routine task, even a machine could do it.”. \\nThe disappointment following the unrealized dreams remains in you every time: “I am doing my job, running around, I can barely breath anymore. I wanted to make real so many things, but I had no time for them. I am getting old, all the gates close in front of me.”. \\nToo many conflicting thoughts attack us and they viciously demand attention: “Can I do this?”, “What am I going to do with the emerging obstacles?”, “Others failed in this, why would I succeed?” \\nThere are those little selves in us, the egos, and they make us do strange things. They want to reach something very important, they project themselves into the future, celebrating the success of their not yet realized plans, they would like to be there in that moment as soon as they can, when everything functions perfectly – and while they daydream about the future or wallow in their doubts, they completely forget about the present moment. \\nBut the only thing they should do, if they want to live, is to take the chances the present moment gives. \\nYou can take those initial steps, which will slowly but surely take you to the realization of your dream, only here and now, never at any other time. Taking you closer and closer to the realized dream each day. The dreams and doubts take over the role of the leader, they fly you far into the future or the past, making you miss those opportunities that open up for you only right here, right now, in this moment. \\nAnd this is really unpleasant. \\nYou lose the grip on reality and drown in your dreams or nightmares. \\nThe source of creativity is your inner quiet, intelligent consciousness that fully embraces and accepts the completeness of the present moment. \\nCreativity, as a creating power, works like a rollercoaster: sometimes it acts in the heat of the feverish creative work, sometimes it turns silently inwards, drawing inspiration from the state of pure consciousness. \\nLike Brahman of the Eastern legends, the only embodied spirit inside us: it dreams a world for itself sometimes, takes up the shapes of millions of forms, the shape of a rock, a grass blade, a tree, a kitten and your shape, it plays the roles of its life, then sheds this human skin and retires from the stage of life. When this happens, the world is destroyed and the sole consciousness turns back into its own emptiness, only to create other dreamworlds for the sake of its own amusement. \\nCreate, then rest. Rest, then create. Be awakened, conscious. Live in the now, in the present moment. \\nLive and enjoy existence, throw yourself into every experience. Be open and enter the game of life. Do! \\nWhen you feel like you need to do something, just do it. \\nDo it consciously, with your full attention focused on how you are doing what you do. \\nDo not seek the future, do not harvest the fruits of the work done, but be there, where you are physically and mentally, and most importantly consciously, and watch how you do what you have to do. \\nIf the idea that you want to realize is present in the space of your consciousness as a crystal clear picture, gently, vaguely affecting every thought and emotion, then you are able to see the dance of the forms clearly in the existence in the present moment, and also when they arrange into opportunities which are necessary to make your plans come to life. \\n“Coincidences” happen, synchronicities. Something happens and you notice it with enthusiasm that this was just what you needed to proceed and go further, climbing more and more steps right until achieving your goal. Like the whole universe is helping you: the events occur when they should, new guides appear, the realization of your plan rapidly unfolds. \\nYou consciously do what you have to do. \\nIf you do not have to do anything or just feel like it, then retire for a while. Put down your to-do list and let yourself get into the quiet, peaceful, calm, relaxing contemplation, the sheer existence without deeds. Be! \\nThose people who “slow down”, sometimes retire to passively recharge themselves, meditate – they do nothing – are still considered to be strange by the Western world. Many people feel that they can only have a good time if they suppress their troubles and concerns. But they ignore the fact that the person, who works day and night and gets lost in their thoughts, is exhausted, their performance is decreased, stressful and depressed. They are those who need it the most to take some time and rest in themselves. \\nWhen the creative force lessens, its fire no longer burns with that lively flames, then it is advisable to switch into the “existence” mode. \\nCompletely pause all your activities. Let go the compulsive feeling to do something: “I have been so good at this, I must be good at it now!”. \\nGive in to resting in your body. \\nStay in the inner silence and peace, contemplate calmly, let your eyes wander and discover things that are important for them. \\nIf you want to, then take a walk in a peaceful, quiet environment of nature. Walk slowly, gracefully, consciously. \\nFeel how relaxed and easy your steps are, and notice the beauty of nature. \\nRelax in the space of consciousness. This is how you can recharge your creative energy. And as the desire to do something comes alive again and you feel its irresistible, blazing fire, do not hesitate, throw yourself back into action. Consciously and with joy again. Be, do, be, do! \\nLife suddenly makes you face a complex exercise, a challenge awaits you, to which you do not know the solution. You speculate, think, your head buzzes, you go through the script of every possible scenario, but none of them satisfies you. You think “These solutions are not good and I do not see if there is a solution at all.”. \\nYour mind examined every previously satisfying template in its arsenal: “Last time I did this and it helped me”, but it did not find a solution pattern in your memories that would come useful in this new situation. And after trying all the old “solution templates”, it has no aces left, it has a tendency to turn anxious or downbeat. It finds no escape from the trap of the problem. It gives up. \\nWhen this happens, the time has come: it is time to retreat into the realm of the quiet inner peace. \\nWe see the things and events in the state of pure consciousness as they really are, the cover of imaginations, glued to them by the mind, falls down. \\nYou are an alert observer. \\nYou sent your mind on a day-off, it does not have to mull on the problems it created. \\nThings become clear in the state of pure consciousness. Nothing is dramatic anymore, things are just the way they really are. You discover the forms, events in the completeness of the moment, which could become tools that help you reach your goal. You notice how you have to alter the processes gently and smoothly, so that they help for you, but also for you fellows. \\nRealizations are born in you. \\nYou wisely understand the completeness of the moment. \\nYou gain inspiration. \\nAnd when you feel you need to do something, you do it. And as the present moment no longer needs your intervention, you return to the silent contemplation again. \\nDo! Be! Do, then be again! Enter the creative-inspiring pulsing of life!'"}, "time": 1742563125.1151774}