{"duration": 0.09101390838623047, "input_args": {"text": "'Greeny celebrities and leftist   launched into widespread and often difficult to understand condemnations of President Donald Trump’s decision to withdraw the United States from the Paris Climate Agreement Wednesday. [The negative responses ranged from the staid and stoic expression of “principled” outrage from members of the business community like Tesla and SpaceX’s Elon Musk and Disney’s Bob Iger  …      As a matter of principle, I’ve resigned from the President’s Council over the  #ParisAgreement withdrawal.  —   Robert Iger (@RobertIger) June 1, 2017,    …    to poignant   by the likes of Sen. Kamala Harris ( ) and #  actor Mark Ruffalo  …     There is no Planet B. This disastrous decision threatens the world our children and children’s children will live in. #ParisAgreement,  —   Kamala Harris (@KamalaHarris) June 1, 2017,  Shame on you @realDonaldTrump as people lose their lives, homes and economic opportunities to your childish refusal to honor #ParisAgreement,  —   Mark Ruffalo (@MarkRuffalo) June 1, 2017,    …    to the truly bizarre resonses of certain   like UNICEF, who implied Trump’s decision to pull the U. S. out of this agreement would harm children, presumably by placing those of them who live on small icebergs in immediate danger of drowning. The youngest of our world can’t wait, NOW is the time for #climateaction. #foreverychild#ParisAgreement pic. twitter.   —   UNICEF (@UNICEF) June 1, 2017,  A strong candidate for the most bizarre response by an organization that ostensibly claims mainstream credibility, however, is the American Civil Liberties Union who, seemingly inexplicably claimed Trump’s decision was “an assault on communities of color. ” Pulling out of the Paris Agreement would be a massive step back for racial justice, and an assault on communities of color across the U. S.  —   ACLU National (@ACLU) June 1, 2017,  The post quickly racked up thousands of reply and retweets from bewildered Twitter users. In response, the ACLU account explained in a series of tweets that “black and brown people” are more likely to live near coal plants and also more likely to have asthma. Black and brown people are more likely to live near coal plants, and have higher asthma rates than white Americans do.  —   ACLU National (@ACLU) June 1, 2017,  The exact connection between these statements, which were unsourced, and the Paris Climate Agreement was not explained. The ACLU account stopped tweeting about the Paris Agreement and switched back to another ACLU campaign, the apparent overbreadth of federal child pornography laws and teens’ right to “sext” each other.   did, however, come from the National Association for the Advancement of Colored People, who supported the validity of the ACLU’s claim, extolling readers to #StayWoke: Climate impacts real people and real communities =that’s not an ” ! ”#staywoke@ACLU. @JacquiPatt. @ECJPNAACP1. @IndianaNAACPECJ. https:  .   —   NAACP (@NAACP) June 1, 2017, '"}, "time": 1742562248.973202}