{"duration": 0.17202377319335938, "input_args": {"text": "'Taming the corporate media beast The Ossetians: From Nomads and Warriors to the Artists of the Caucasus \\nA people that miraculously survived in the mountains after the Tatar-Mongolian invasions of the Middle Ages, today the Ossetians are renowned for being the creative intelligentsia of the Caucasus and the custodians of an unusual form of Christianity   RBTH \\nFor Alik Pagayev, an Ossetian who manages a troupe at the Narty Theater in Vladikavkaz, creativity is in the blood of his people. \\n”I was born in a mountain village and we had this joke: \\'Throw a balalaika out of your window, anyone who catches it can play it,” he says. \\nVladikavkaz, the capital of North Ossetia, a small republic on Russia’s southern edge bordering Georgia, is called the “Caucasian St. Petersburg.” No other city in the North Caucasus has so many creative people: artists, photographers, designers and performers. \\nCreative abilities, however, are not the only national trait of the Ossetians. Pagayev says that every Ossetian has military skills and talents for working with horses in their blood. Creative abilities are not the only national trait of the Ossetians. Alik Pagayev says that every Ossetian has military skills and talents for working with horses in their blood. Source: Anastasia Stepanova \\nOpen-mindedness to new cultures \\nThe Ossetians are descended from Iranian-speaking nomads – the Scythians and the Sarmatians. In historical writings from the 2nd century A.D. these tribes were known for their serious military and political might. \\nBy the 11th century A.D. the medieval kingdom of Alania had been established in the region. Its inhabitants were famous for their military skills: The main army consisted of the cavalry. Despite their glorious reputation, the Alans could not fight off the Tatar-Mongolian invasion and in the 14th century they were practically destroyed as a people. Only few hundred Alans remained in the mountains. However, the nation managed to survive and later it successfully assimilated in Russia. \\nAccording to a 2010 census, today there are almost 700,000 Ossetians in the world, most of whom live in Russia. Most Ossetians live in North Ossetia (459,600 people), while in Moscow there are 7,900 Ossetians and in St. Petersburg slightly over 3,000. \\nWhile 45,900 Ossetians live in the disputed territory of South Ossetia (recognized by just three nations, with the rest of the world continuing to see it as part of Georgia), they also live in Russia’s other Caucasian republics. In Kabardino-Balkaria there are more than 9,000 Ossetians, in the Stavropol Territory there are almost 8,000 and there is even a separate Ossetian village in Karachay-Cherkessia with 3,100 inhabitants. There are also Ossetian diasporas in other countries. In Turkey the fraternity counts 37,000 members and in Georgia – 14,300 outside South Ossetia. \\n”The Caucasus started to become a part of Russia in the 18th century. Our republic was one of the first,” explains Anna Kabisova, a photographer and photojournalist. osetia_woman_working.jpg ”The Ossetians are Christians. So it is easier for them, in comparison to the Muslim republics, to find common ground with the Russian population.” Source: Archive photo, 19th century \\n”The Ossetians perceived these changes as a salvation since it is difficult to survive in the mountains and the intelligentsia understood that it was important to develop. A step towards Russia implied opportunity. Back then many Ossetians went to study in St. Petersburg. That is how this place acquired many artists, sculptors and then its own influential art school, its own distinguishing style,” she said. \\nIn her view, such open-mindedness to new cultures is also a national trait. ”The reason lies in religion. The Ossetians are Christians. So it is easier for them, in comparison to the Muslim republics, to find common ground with the Russian population.” \\nPies, beer and offerings to the gods \\nActually, the Christianity found in the republic is not entirely traditional. Pagan beliefs are also strong here. The Ossetians have dozens of popular religious celebrations with various rituals. There are symbolic peace sacrifices, for example, slaughtering a chicken or a sheep for guests at a feast. \\nThe famous Ossetian national pies are sacred food. These round, thin pies with meat, cheese and potatoes in the Ossetian worldview represent the sun. During a holiday each family places three pies on the table. They also have local breweries. anna_kabisova_b.jpg ”The Caucasus started to become a part of Russia in the 18th century. Our republic was one of the first,” explains Anna Kabisova, a photographer and photojournalist. Anna Kabisova \\nFor many occasions women brew beer according to the national recipe. The Ossetians have their own Oktoberfest. Each October Vladikavkaz holds an Ossetian beer festival/competition, to which Ossetians come from Russia and other countries. The drink, in its aspect and taste, is similar tokvas, the Russian malt drink, and is around 1.5-2 percent alcohol. \\nThe beer is brewed in a large cauldron over a fire. Its main ingredients are the typical ones: hops, malt. But there are also special ones such as lamb ribs and sugar – there are many different recipes. \\nNot merchants \\n”Ask me what I hate doing most and I\\'ll respond: trading,” says Alik Pagayev, describing the national character. \"The Ossetians don\\'t have an entrepreneurial spirit. We have many talented artists, good athletes, especially in freestyle wrestling, horse breeders, but commerce is really not our thing.” ”Ask me what I hate doing most and I\\'ll respond: trading,” says Alik Pagayev, describing the national character. Source: Archive photo, 19th century \\nPagayev also says that tolerance and tact are two other national traits. \\n”I worked in [the neighboring republic of] Kabardino-Balkaria for three years and could not get used to the fact that they speak their national language. I would go to someone\\'s house and they would speak their own language. I wouldn\\'t understand anything and someone would have to translate the general meaning of the conversation. \\n”In Ossetia it\\'s not like that. If there’s even one guest among us, we speak Russian. A friend of mine from Chechnya would often visit us and once he heard people speaking Ossetian on a street in Vladikavkaz. He was surprised because he had thought that we always speak Russian.” vladikavkaz_lori- 39468-a6_b.jpg Vladikavkaz, the capital of North Ossetia, a small republic on Russia’s southern edge bordering Georgia, is called the “Caucasian St. Petersburg.” Source: Lori/Legion-Media \\nIn fact, Pagayev explains, there are some young people who do not even know their national language, which he says is sad. \\n”Our language must be preserved. At home my children speak only Ossetian. If I hear them speak Russian, I tell them, \\'You\\'ll speak Russian where you have to, but at home speak your native language,\\'” he says. \\nAnother important national trait is learning, he explains: ”People always wonder: A young guy from a remote mountain village goes to study in St. Petersburg or Moscow and in two years he fully integrates, speaks Russian without an accent and produces good results in his studies. This is an important trait. I think this is what helped our people survive the difficult times.”'"}, "time": 1742563566.126365}