{"duration": 0.1990032196044922, "input_args": {"text": "'Russia\\'s top economic minister faces criminal charges for bribe solicitation Russia’s high-profile Economic Development Minister, Alexei Ulyukaev, has been arrested on corruption charges. Who or what is behind this new anti-corruption probe? Russia’s high-profile Economic Development Minister, Alexei Ulyukaev, has been arrested on corruption charges. Who or what is behind this new anti-corruption probe? \\n\\nPictured: Russia’s Economic Development Minister Alexei Ulyukaev. Photo: RIA Novosti \\nThe surprising detention of Russia’s Economic Development Minister, Alexei Ulyukaev, on corruption charges comes as yet another sign of sweeping changes within the Kremlin’s inner circle . Recent dismissals and unexpected appointments have led some to suggest that a reshuffle has been going on at the highest levels.\\nOn Nov. 15, Russia’s Investigative Committee announced that Ulyukaev had been arrested under the suspicion of corruption. Law enforcement authorities claim he solicited a bribe in the amount of $2 million to approve the purchase of 50 percent of the assets of the Bashneft oil company by Russian oil giant Rosneft.\\nIn fact, this is the first case when such a high-profile official has been accused of corruption during Vladimir Putin’s presidency. The Russian president and Prime Minister Dmitry Medvedev did not release any comments shortly after the detention. However, the parliamentary opposition called for the dismissal of the entire government of Russia.\\nMeanwhile, experts are mulling over one primary question: What role did Rosneft head Igor Sechin play in this scandalous case? Specifically, did Sechin orchestrate this case and did Ulyukaev really pose a threat to Rosneft? ;\\nUlyukaev vs Sechin According to Investigative Committee spokesperson Svetlana Petrenko, the Economic Development Minister tried to implicate his “patrons,” but failed. Moreover, the Investigative Committee claims that Ulyukaev threatened the representatives of Rosneft. Currently, the official is expecting a decision from the court as to his status. Most likely, he will be placed under house arrest. ;\\nOne of the most striking incongruities in the Investigative Committee’s narrative is the fact that the deal between Rosneft and Bashneft was conducted in accordance with the law. It is legitimate and, thus, cannot be the object of the probe, many experts argue.\\nThe privatization of Bashneft took place in October 2016 without a tender, even though several companies expressed their interest in the deal and offered their bids . In late July, Ulyukaev made no bones about his disapproval of the purchase of the oil company by Rosneft. In fact, at that time he described Rosneft as “an ineligible client” for Bashneft. Likewise, Vice Prime Minister Arkady Dvorkovich and presidential adviser Arkady Belousov were against the deal. Nevertheless, it still took place. ;\\n“Probably, it is not the best option, when one company controlled by the state, acquires the other one,” said Putin following the deal. “I was surprised myself a bit by such position of the Russian government and, first and foremost, by its financial and economic department.”\\nIt is not ruled out that today’s arrest of Ulyukaev can be linked to the direct implementation of Putin’s words, according to Mikhail Vinogradov, the president of the St. Petersburg Politics Foundation.\\n“The sale of Bashneft obviously became the key political event of this year, even more important than Bashneft itself. What is happening now might be the continuation of what Putin said about this deal earlier. I don’t rule out that there will be an attempt to suspend the privatization.”\\nAt the same time, the expert speculates that there might be a political game. By hitting one official, the orchestrators will land a blow in the gut of the entire government. To quote Vinogradov, Medvedev “has been in favor for the last year, but now he is facing a very stressful moment.”\\nThe prime minister himself called for a thorough investigation of this, and the Kremlin’s press service announced that Medvedev is currently discussing the situation with Putin. Regarding the president, he made it clear that he has been aware of the Ulyukaev case since its inception.\\nAlso read Russia Direct\\'s report: \" Russia\\'s political drama heading into 2018 \" Some representatives of Russia’s Federal Security Service (FSB) admitted that they have been tracking Ulyukaev’s activities for a year, with eavesdropping of his telephone calls becoming a routine. Amidst this background, the alleged bribe to Rosneft became a pretext for his detention, because there were no talks on Bashneft a year ago. ;\\n“Despite the fact that FSB has been conducting this work, it is the Investigative Committee that plays the role of the headliner,” Evgeny Minchenko told Russia Direct . “I see it as an additional instrument of strengthening the clout of its head, Alexander Bastrykin. If the probe has been conducted for about a year, I would assume that the investigation started [earlier], when the current vice president responsible for Rosneft’s security was working for the FSB.”\\nLikewise, newspaper Novaya Gazeta argues that Oleg Feoktistov, a former high-profile FSB official, who is currently dealing with security of Rosneft, could have started the investigation. At the same time, Vinogradov believes that the tug of war between Russia’s law enforcement agencies might have resulted in the arrest of Ulyukaev. In such a way, the Ulyukaev affair became the continuation of the reshuffle within the Kremlin’s inner circle .\\nAll experts agree that the size of the bribe is too small for such a minister like Ulyukaev in comparison with the bribes of other high-profile officials, who have been accused of corruption. A former employee of the law enforcement agencies, Kirill Kabanov, who currently works as the chairman of the National Anti-Corruption Committee, argues that the alleged bribe became a good pretext for the arrest of Ulyukaev, because the probe has supposedly been going on for at least one year.\\nAlso read: \" Inside the power struggle within the Russian elite \" “After all, we understand that it is a comparably small bribe for Ulyukaev to resolve such an elementary procedure [like the sale of Bashneft to Rosneft],” he told Russia Direct . “There could have been more information regarding other aspects of his activity, which led to his arrest.”\\nOther pundits also agree that the $2 million bribe was only a pretext. However, they don’t believe that the probe has been ongoing for a year.\\n“It is highly likely that there was no investigation that lasted for a year. There was a conflict with Igor Sechin and then law enforcement forces found out all the information,” a source in the special services told Russia Direct on the condition of anonymity. His colleague confirmed this view: “If there was no personal conflict, he’d be dismissed quietly or due to the loss of trust.”\\nAnother source close to the investigation said that Ulyukaev was not fulfilling his responsibility professionally. “Let’s remember his controversial statements on the economic situation in Russia,” he said.\\n“With regard to Rosneft he failed to demonstrate political instincts by challenging Igor Sechin. Rosneft is not the kind of organization where one can request ‘money for a service’ even through mediators. As a result, there was an arrest, which the Kremlin will use to show that there is no impunity even for high-profile officials when it concerns fighting corruption,” he added.\\nFirst reaction Indeed, high-ranking officials might have been losing their impunity gradually ever since the start of the reshuffle. And it became a matter of fact for politicians at all levels. Numerous reports claim that Ulyukaev was caught red-handed but, according to some sources, the money was held in a bank and the minister did not touch the funds.\\nRecommended: \" 25 years after liberalization, Russians are cautious of democratic reforms \" “Serious allegations were put forward against the minister of the Russian government,” said Vyacheslav Volodin, the chairman of the State Duma. “We live in a law-governed state and everyone is equal before the law, but at the same time, we need to wait for a court trial before making any conclusions on whether he is responsible or not. There is an investigation going on and one should not interfere with it.”\\nYet a number of experts argue that Volodin himself, as a powerful former first deputy head of the Presidential Administration, surely was aware of the case.\\nAt the same time, the leaders of the parliamentary opposition – the Liberal Democratic Party (LDPR) and the Communist Party ¬– called for dismissing the whole government.\\n“The fight against corruption has been launched at all levels of the power vertical,” said Vladimir Zhirinovsky, chairman of the LDPR. “Everyone should feel insecure now. Ideally, every person at a senior position — be it a minister, a governor, or a mayor — should have a deputy representing a different political faction. Now we are likely to have a new Minister of Economic Development.”\\nPreviously Ulyukaev worked in the government and the Central Bank of Russia. As Minister of Economic Development, he supported reforms decreasing the state’s role in the country’s economy and promoted privatization, even in an unfavorable financial environment.\\nHis ministry never abstained from giving difficult forecasts about the Russian economy. In October, the ministry announced that the national economy would stagnate over the next 20 years and that GDP growth would be lower than global rates. On Nov. 9 in an interview with Die Welt , Ulyukaev said that the economy had more or less adapted to sanctions.\\nThe minister himself denies the accusations and sees the case as “a provocation against a government official,” according to his lawyer Timofey Gridnev.\\nArtem Kureev also contributed to the article. '"}, "time": 1742564376.4542053}