{"duration": 0.06406378746032715, "input_args": {"text": "'Language classes and the recruiting of ‘Islam scientists’ are among measures announced by North  ’s (NRW) justice ministry to combat the rising number of ‘disgust attacks’ in prisons by Maghreb migrants. [Across Germany, migrants from North Africa have been setting ‘traps’ for staff in prisons by “greasing” doors handles, floors, and other surfaces that employees are forced to touch and walk over with bodily fluids, mainly faeces and blood.  NRW has acknowledged the problem for some time, but in November the state’s justice minister Thomas Kutschaty was forced to admit the attacks have been growing more frequent.   cases in which “detainees from the Maghreb states have contaminated areas with blood   faeces” were logged in 2016. At prisons in Iserlohn and Cologne, there were even incidents in which staff members were pelted with faeces. Head of Bielefeld Prison, Uwe Nelle Cornelsen, described “restlessness, rioting, rebellion against lawyers, and suicide threats” are typical problems staff have to deal with. He told the Neue Westfälische that prisons “must remain consistent, and refuse to negotiate,” reporting rumours that in some parts of the Maghreb, such tactics encourage centres to release detainees earlier. Along with “security and discipline,” integration centres and language courses form the core of a series of measures recently announced by NRW’s justice ministry to tackle problem prisoners. Integration centres are being set up at each prison to “deal with problems between detainees and prison staff”. So as to “decrease the language barrier” facilities will also expand language courses on offer to prisoners, and hire more interpreters. A programme to provide tablets to staff in NRW jails, enabling them to translate their instructions into Arabic, is also set be rolled out across the state. Bridging the language gap is likely to succeed in preventing grotesque behaviour, according to a report in broadsheet Die Welt. This claimed that many migrants just “wanted to be understood,” and became calmer after conversing with staff in Arabic. The justice ministry hopes that hiring four ‘Islam scientists’ in addition to the two currently employed by the state will also ease tensions. As well as teaching prison staff to spot signs of Islamism in detainees, the ‘Islam scientists’ are also training employees to “deal with emotionally disturbed prisoners” and instructing them in “intercultural competence. ” One final measure announced by Kutschaty, to deal with the growing turmoil in NRW jails, is for faster expulsion of people from the Maghreb, who the justice minister said “have little chance of being granted leave to remain [in Germany]. ” To this end, the Social Democratic Party (SPD) minister called for Germany to recognise North African nations as safe countries of origin, and said “collective charter flights” could be used to deport Maghreb migrants who are causing trouble in prisons.'"}, "time": 1742563200.3978477}