{"duration": 0.07648420333862305, "input_args": {"text": "'Posted by Madeline | Oct 30, 2016 | 2016 , Daily Blog | 0 | Published on Oct 29, 2016 Universal Child Hosted by Joanna L Ross KCOR Digital Radio Network Season 1 Episode 24 \\nI hope you enjoy the show and please tune in every Saturday morning at 10:00 PST that’s 1:00pm EST http://kcorradio.com \\nJoanna L. Ross from Universal Unity and I have some amazing BIG news and I wanted to share it with you first! \\nhttp://universalunity.ca/private-sess… ~ Universal Energy Initiations & Healing Sessions \\nWe are heading to SEDONA! 11/11 GATEWAY First Contact Symposium ~ SEDONA The 11/11 gateway we will be in Sedona, Arizona for a special 2 event Universal Gathering. The first USA ‘First Contact Symposium’ and how fitting we kick it all off in Sedona. http://universalunity.ca/sedona \\nNovember 11th ~ Friday evening, we will do a meditation & discussion aligning us for November 12th, Saturday as we hop on board for a 4.5 hour discussion, channel, and gathering of like-souled family members as we dive into; lightship experiences, preparing for future conscious contact, enhancing communication with spirit and our teams, ascension for humanity and Gaia, and we will even have our usual ‘after event lightship gazing in the desert’ This proves to be a ‘can’t miss’ event as we have tried a venture there before and timing was not right, but this event literally took a day to book & get confirmation, so the Universe is truly aligned for us on this one. I sensed a huge jubilation from my team, so we are so excited to bring our passion, energy, and wisdom for a personal healing, personal engagement and entanglement for a Sedona Special ‘First Contact’ Event. \\nBe sure to get your tickets soon, as there is a limited number available. This event will be held in the highly sought after, and well known ‘Sedona Creative Life Center’ and has been such a pleasure dealing with them. Our event and information will also be advertised through their center to all of their clients and visitors, and it will be up on the ‘calendar of events’ so be sure to get your seat while it lasts. This will be the first event of this kind as we combine spirit, ET’s and Celestial family energy, ascension, Arch Angel energy in one event. Sedona Creative Life Centre http://www.sedonacreativelife.com * There is ample information on the Sedona Creative Life Centre website for travel, shuttle, and more information, as they really make these events much easier to put on. Book your travel arrangements early to avoid disappointment as this fall of 2016 proves to be one that shifts humanity in a whole new way, and we will be immersing ourselves in it during the 11/11 gateway. I will also have my two books available and even do a few minutes of book signing. So FUN! \\nHere is our link to have a look at the fun! We have options for purchase; Friday, Saturday, or both days as a package rate. \\nhttp://universalunity.ca/sedona \\nI am feeling so blessed, grateful, and truly aligned with my highest and best, as this event seemed so fluid and fun to put together. I know that there are a myriad of beings on every level helping us make this happen ~ I am truly grateful to share and inspire in this energy for a heightened and expanded human experience upon our shifting Gaia. Share:'"}, "time": 1742561752.72612}