{"duration": 0.03322911262512207, "input_args": {"text": "'Guilt By Association Smear In NYT Gets Virginia Dare Wrong AGAIN > November 7, 2016, 10:20 am   \\nThe New York Times has done the usual guilt-by-association thing in blaming Trump for us here at VDARE.com, people like us, and people we don’t even know (which last would include David Duke ) For his part, Mr. Trump has not expressed support for the white nationalist groups that have rallied to his candidacy. But neither has he distanced himself from them, with the exception of David Duke , the former Klansman who is running for Senate and whom Mr. Trump disavowed after some initial wavering last winter. It’s nonsense to say he wavered on this–see Ann Coulter’s Ann Coulter: Trump Wins “Disavowal” Game, Then Super Tuesday. [White nationalists]are now beginning to grapple with how to best harness the energy that his campaign has stirred up. Mr. Spencer’s group, the National Policy Institute, which says it is “dedicated to the heritage, identity and future of people of European descent in the United States, and around the world,” is organizing a valedictory conference in the Ronald Reagan Building in Washington shortly after the election. The aim is to take stock of the presidential campaign — “when our ideas began invading the mainstream” — and figure out what’s next. In addition to Mr. Spencer, the speakers will include Peter Brimelow, the founder of Vdare.com , an anti-immigration website named for Virginia Dare, the first white baby born in the English colonies. \\nDonald Trump’s Extremist Supporters Feel Like Winners Either Way, By Jonathan Mahler And Julie Turkewitz, The New York Times, November 6, 2016 \\nThat’s better than the way they frequently get it wrong, when they say she was the first white child born in America, but the way we put it is this: “the first English child to be born in the New World. ” That, by the way, is the way a lot of historians put it. \\nHowever, a pre-multicultural poem by Rosemary and Stephen Vincent Benet put it better: \\nPeregrine White \\nWere the first real Americans \\nAnywhere.'"}, "time": 1742562980.925936}