{"duration": 0.17029166221618652, "input_args": {"text": "\"Posted on October 30, 2016 by Sean Adl-Tabatabai in News , US // 0 Comments \\nAttorney General Loretta Lynch attempted to stop FBI Director James Comey from reopening the Hillary Clinton email investigation this week, according to law enforcement officials connected with the case. \\nLynch and Deputy Attorney General Sally Yates were unhappy with the FBI’s decision to notify Congress about their decision to review new Clinton emails , as it would “embarrass” and potentially “harm” the Clinton campaign. Recommended \\nThe FBI has announced it will reopen it's investigation into Hillary Clinton's use of a private email server whilst serving as Secretary of State. (2 hours ago) \\nAbc-7.com reports: \\nWhile there was no explicit order not to send the letter, department officials expressed concern that what Comey wanted to do was contrary to how the department does business given how close this was to the election. They added it was contrary to department policies and procedures, one law enforcement source said. \\nComey decided to disregard their concerns and sent the letter Friday anyway, shaking the presidential race 11 days before the election and nearly four months after the FBI chief said he wouldn’t recommend criminal charges over the Democratic nominee’s use of the server. \\nThe officials acknowledged there was little Lynch and Yates could do given the fallout over Lynch’s controversial meeting over the summer with former President Bill Clinton. \\nLynch and Yates objected after Comey gave advance notice to top officials at the Justice Department before sending the letter to lawmakers, law enforcement officials briefed on the matter said. Justice officials didn’t sign off on Comey’s decision and he didn’t seek their approval, one official said. Recommended \\nA top FBI official has been served with a subpoena by a senior House Republican, forcing the agency to release it's full case file on the investigation into Hillary Clinton's use of a private email server. (2 hours ago) \\nInstead, he made an independent decision to go against longstanding Justice Department and FBI practice to not comment publicly about politically sensitive investigations within 60 days of an election, the official said. \\nComey later explained his decision to provide Congress with the information in a letter to FBI employees. \\n“We don’t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed,” Comey said. “I also think it would be misleading to the American people were we not to supplement the record.” \\nClinton’s campaign and allies quickly decried the decision’s timing, and the candidate herself on Friday forcefully called on the FBI to release the “full and complete facts” about its review. \\n“Voting is underway, so the American people deserve to get the full and complete facts immediately,” Clinton said at a brief news conference in Des Moines, Iowa, adding it was “imperative that the bureau explain this issue in question, whatever it is, without any delay.” Recommended \\nThe stock market plunged as the FBI announced it is reopening the investigation into Hillary Clinton’s use of private e-mail and mishandling of classified information, a politically explosive development just 11 days before the presidential election. (2 hours ago) \\nClinton said she was “confident whatever (the emails) are will not change the conclusion reached in July,” when Comey said he wouldn’t recommend criminal charges in the matter. \\nRepublican nominee Donald Trump, who has spent the past several weeks on defense, seized on the issue. \\n“Hillary Clinton’s corruption is on a scale we’ve never seen before,” Trump said at a rally in Manchester, New Hampshire. “We must not let her take her criminal scheme into the Oval Office.” \\nHe later responded to Clinton’s statement, saying she “tried to politicize the investigation by attacking and falsely accusing the FBI director of only sending the letter to Republicans.” \\nIn a letter to eight congressional committee chairmen Friday, Comey said investigators are examining newly discovered emails that “appear to be pertinent” to the email probe. Recommended \\nFBI Director James Comey has decided to flex his muscles and ignore the DoJ's request that he cease investigating the Clinton Foundation for criminal activity. (2 hours ago) \\n“In connection with an unrelated case, the FBI has learned of the existence of emails that appear pertinent to the investigation,” Comey wrote the chairmen. “I am writing to inform you that the investigative team briefed me on this yesterday, and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.” \\nAnthony Weiner \\nThe newly discovered emails are part of an investigation into Anthony Weiner, according to law enforcement sources. Weiner, the disgraced former congressman, recently separated from top Clinton aide Huma Abedin after a sexting incident. \\nThe FBI and the New York Police Department have opened preliminary investigations of allegations that Weiner, a former New York Democratic congressman, exchanged sexually explicit text messages with a purportedly underage girl. \\nThe emails in question were sent or received by Abedin, according to a law enforcement official. There were a “considerable number” of emails being reviewed from at least one device shared by Abedin and Weiner, the official said. A separate official described it as thousands of messages. Recommended \\nEvidence has emerged that a top Clinton aide bribed the FBI with a $500,000 donation in order to dissuade them from pressing criminal charges against Hillary Clinton. (2 hours ago) \\nThe FBI is looking at whether any of the newly discovered emails will have an impact on the now-closed investigation into Clinton’s server. In his letter, Comey said he was not sure how long the additional review would take and said the FBI “cannot yet assess whether or not this material may be significant.” \\nThe big question is whether the return of the email storm, which has overshadowed her entire campaign, will have an impact on any remaining undecided voters. Before the latest controversy erupted, Clinton had the advantage in the race for the 270 electoral votes needed to capture the presidency. She is leading Trump by six points in CNN’s Poll of Polls. \\nComey under criticism \\nComey is under withering criticism from the Clinton campaign and congressional Democrats for releasing the letter so close to the election. Earlier Friday, Clinton campaign chairman John Podesta said “it’s extraordinary that we would see something like this just 11 days out from a presidential election.” \\nHe followed up on that criticism in a heated conference call with reporters Saturday, saying Comey’s letter was “light on facts, heavy on innuendo, knowing full what Republicans would do with it. It is not up to him who owes the public answers to questions that are now on the table.” Recommended \\nAttorney General Loretta Lynch has blocked the FBI from opening up a public investigation into the Clinton Foundation. (2 hours ago) \\nDianne Feinstein, the California Democrat who is the vice chairman of the Senate Select Committee on Intelligence, said she was “shocked” to read Comey’s letter. \\n“Director Comey’s announcement played right into the political campaign of Donald Trump,” she said in a statement. \\nEven Republican Sen. Ron Johnson of Wisconsin urged Comey to provide more information: “In line with your commitment to be transparent with Congress and the public, I respectfully request that the FBI provide as much information as possible about these new developments without harming the integrity of its ongoing investigation,” Johnson wrote in a letter to Comey. \\nThe FBI chief felt he had no choice but to tell Congress now or risk being accused of hiding relevant information before the election, law enforcement officials said in explaining the timing. The letter was “carefully worded,” one of the officials said. \\nThe news united Republicans who have spent the past several weeks grappling with Trump’s controversies. Speaker Paul Ryan jumped on Comey’s announcement to blast Clinton. Recommended \\nBill Clinton has blasted FBI director James Comey for his determined attempt to investigate the crimes of The Clinton Foundation. (2 hours ago) \\nTrump’s campaign manager, Kellyanne Conway, tweeted after the news broke, “A great day in our campaign just got even better.” \\nRyan said Clinton betrayed Americans’ trust for handling “the nation’s most important secrets.” \\n“This decision, long overdue, is the result of her reckless use of a private email server, and her refusal to be forthcoming with federal investigators,” Ryan said in a statement. “I renew my call for the Director of National Intelligence to suspend all classified briefings for Secretary Clinton until this matter is fully resolved.”\""}, "time": 1742561864.3257887}