{"duration": 0.1391456127166748, "input_args": {"text": "'The 2010 murder of U. S. Border Patrol Agent Brian Terry by a   previously deported illegal alien could have been prevented, says the agent’s brother Kent Terry in an exclusive interview with Breitbart Texas. Terry’s family hopes the Trump Administration will now go after “the real criminals” responsible for putting the “Fast and Furious” guns in the accused killer’s hands. [A task force including Mexican law enforcement officials, U. S. Drug Enforcement Administration agents and U. S. Border Patrol Border Patrol BORTAC (Border Patrol Tactical Unit) agents arrested accused killer Heraclio   in Mexico earlier this week, Breitbart Texas reported. Court records obtained by Breitbart Texas stated immigration officials deported   seven times before he returned illegally on December 14, 2010, as part of a Mexican bandit “rip crew. ” The accused killer of Agent Terry opened fire on the BORSTAR team in southern Arizona that had been dispatched to find the “rip crew” which had been robbing other drug and human smuggling convoys in the area.  “We just heard that Brian’s shooter had been deported seven times,” Brian Terry’s brother, Kent Terry, told Breitbart Texas. “This is a death that could have been prevented. ” The allegation that   shot Agent Terry with a gun supplied by the U. S. Government in a   operation called “Fast and Furious” made his death even more painful to the family members. To this date, no U. S. law enforcement official involved in supplying over 2, 000 guns to Mexican drug cartels under this program have been held to account. The House of Representatives found Former U. S. Attorney General Eric Holder to be in contempt of Congress for refusing to turn over documents related to the Fast and Furious program, Breitbart News reported in June 2012. Seventeen House Democrats joined with the Republican majority in finding Holder in contempt. “Bob, this arrest puts us another step closer to getting those accountable for Brian’s senseless death that could have been prevented,” Kent Terry explained. “But the real criminals that President Trump and Attorney General Sessions need to look at are Eric Holder, Thomas Brandon, Bill Newell, and the rest who started this scandal known as Fast and Furious. ” “Mr. Trump promised me he would open the books in Brian’s death and now is the time,” an exasperated Kent Terry stated. “My family has waited long enough. In the meantime, I will continue to fight for Brian and Zapata. ” U. S. Immigration and Customs Enforcement Agent Jaime Zapata was also killed by Mexican cartel members using weapons obtained through the Fast and Furious Program.  “Our family is extremely happy to hear of the capture of one of the subjects involved in Brian’s murder,” Terry’s sister, Michelle   told Breitbart Texas. “This is just another step forward toward getting the justice he truly deserves. ” “We want to express our gratitude to the Mexican officials and all the divisions of our US law enforcement that made this apprehension possible,” Michelle expressed. She sends a special thank you to Brian’s brothers in green who are part of the elite BORTAC team that assisted in the apprehension of this suspect. ” “The Terry family continues the fight to bring those held accountable for the botched gun program fast n furious that killed my brother and to honor him through the Brian Terry Foundation that was established to honor his legacy,” she said, echoing Kent’s call for justice. Brian Terry’s third sibling, Kelly   also expressed her gratitude to all involved in bringing Brian’s accused killer to justice. “I would like to thank every person involved from day one in the search and apprehension of the latest suspect,” Kelly expressed. “It does not go unnoticed that they put their lives at risk for this mission to be successful. We are closer to justice for Brian. ” “This latest news gave us more hope than we have had in awhile,” she said cautiously. “My guard is still up with this new administration because of all the lies and   from the previous one, but I more optimistic and hopeful than I have been in six years. Brian cannot and will not be forgotten. ” Nearly one year ago,   candidate Donald Trump met with the Terry family about their brother’s murder, Breitbart Texas reported. “He told us how sorry he was about Brian’s senseless death,” Kent Terry told this reporter after the meeting. “Mr. Trump said it was shameful on this administration for starting a scandal like this and shameful for what they’re doing about it. ” “He also is very sincere about Brian’s death. Yes, he promised us if he becomes president, he will open the books on Fast and Furious. ” The Terry family believes it is now time for President Trump and the Republican led Congress do deliver on their promises. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook. '"}, "time": 1742561645.8437483}