{"duration": 0.21484875679016113, "input_args": {"text": "\"Latest News Justifying the Saudi Slaughter in Yemen One of Obama's biggest failures is letting his policy in Syria be determined primarily by the ambitions of Qatar, Saudi Arabia and Turkey Share This \\nThe Obama administration has carried out a deliberately deceptive campaign accusing Iran of covertly sending arms to the Houthis by sea, a claim that Washington cites to help justify the Saudi massive air attack against the Houthis that began last year. \\nBy repeating the accusation over and over, the administration has been largely successful in turning a dubious allegation into accepted fact, even though it is contradicted by evidence that is well-documented on the public record. \\nSecretary of State John Kerry introduced the new variant of the Obama administration’s familiar theme about Iran’s “nefarious activities” in the region two weeks after Saudi Arabia began its bombing in Yemen on March 26, 2015. Kerry told the PBS NewsHour, “There are obviously supplies that have been coming from Iran,” citing “a number of flights every single week that have been flying in.” Kerry vowed that the United States was “not going to stand by while the region is destabilized.” \\nLater, the administration began accusing Iran of using fishing boats to smuggle arms to the Houthis. The campaign unfolded in a series of four interceptions of small fishing boats or dhows in or near the Arabian Sea from September 2015 through March 2016. The four interceptions had two things in common: the boats did have illicit weapons alright, but the crews always said the ship was bound for Somalia – not Yemen and the Houthis. \\nBut instead of acknowledging the obvious fact that the weapons were not related to the Iran-Houthi relationship, a U.S. military spokesman put out a statement in all four cases citing a U.S. “assessment” that the ultimate destination of the arms was Houthi-controlled territory in Yemen. \\nThe choice of wording was significant. The intelligence community says that it “assesses” that something is true only when it does not have clear-cut proof on the matter. In the case of the alleged Iranian use of fishing dhows to smuggle arms to the Houthis, the U.S. spokesmen did not cite a single piece of evidence for that “assessment” in any of the four cases. In fact, when asked for some justification for it, the military spokesman refused. \\nThe first fishing dhow was intercepted in the Arabian Sea on Sept. 25, 2015, by a member of a 31-nation coalition called the Combined Maritime Forces patrolling the Arabian Sea and nearby waters for piracy. The coalition ship found the dhow to be carrying 18 Konkurs anti-tank missiles, 71 other anti-tank shells and 54 missile-launchers. \\nBlaming Iran \\nThe U.S. Navy’s Fifth Fleet later issued a statement that said, “Based on statements from the dhow’s crew the port of origin of the dhow and its illicit weapons cache is believed to be Iran.” It also said the anti-tank missiles were thought to be of Iranian and Russian origin, and that the papers on the ship had indicated that it had been checked by ports and customs officials in Iran’s Sistan and Baluchistan province. \\nBut the crew of the vessel had said that it was bound not for Yemen but for Somalia, as the spokesman for the U.S. Fifth Fleet acknowledged to The Associated Press . A Saudi military spokesman suggested that Iran intended to reroute the arms later from Somalia to Yemen, but offered no evidence. \\nOn Feb. 27, 2016, an Australian ship intercepted a second fishing dhow off the coast of Oman. The Australians found 1,989 AK-47 assault rifles, 100 rocket-propelled grenades and 40 PKM machine guns on board. The Australian Defense Force issued an official statement on the seizure that did not mention Iranian involvement. It said the boat appeared to be “stateless” and that its cache of weapons was “destined for Somalia.” The Australian Defense Force spokesman explained to CNN that the conclusion was based on interviews with crew members. \\nBut a spokesman for U.S. Naval Forces, Central Command, Lt. Ian McConnaughey gave an entirely different political slant to the interception. In an e-mail to NBC News, McConnaughey said. “Based on the dhow’s course, Iran is believed to be its port of origin and the source of the illicit weapon,” he said. McConnaughey said the crew was “assessed” to be Iranian – implying that the crew itself had not indicated that. \\nMcConnaughey acknowledged to NBC and The Telegraph, “According to coalition forces it is believed that the vessel’s destination was in the vicinity of Somalia.” But the CENTCOM spokesman indicated that it didn’t matter; the U.S. was insisting on its narrative about covert Iranian arms to the Houthis. \\n“[T]he initial U.S. assessment is the weapons’ final destination was likely to be the Houthis in Yemen,” McConnaaughey told NBC and The Telegraph. \\nWhen this writer asked McConnaughey by e-mail why the U.S. “assessed” that the weapons were intended for Yemen, despite the evidence to the contrary, he responded, “We are not going to discuss the intelligence and other information that led us to our assessment.” \\nA Third Shipment \\nOn March 20, a French navy destroyer intercepted a third fishing dhow off the Island of Socotra in the northern Indian Ocean and found several hundred AK-47 assault rifles, machine guns and antitank weapons. The official statement on the seizure from the Combined Maritime Forces stated categorically, “The dhow was spotted heading toward Somalia.” \\nAnd because the weapons were “deemed to be destined for Somalia,” it explained, they “were seized under the United Nations Security Council mandated arms embargo in accordance with UNSCR 2244(2015).” That Security Council resolution mandates an embargo on Eritrea. \\nAustralia and other states participating in the Combined Maritime Forces were thus challenging the U.S. propaganda line. But again the U.S. military used the news media to reinforce the line about Iran smuggling arms to the Houthis. Commander Kevin Stephens, a spokesman for the Fifth Fleet, told CNN that “according to a U.S. assessment,” Yemen was the “likely destination” of the arms. \\nA fourth interception – the third in three weeks – occurred on March 28 by a U.S. Navy ship that was not operating as part of Combined Maritime Forces but directly under U.S. Naval Forces Central Command. That allowed the Naval Forces Central Command to issue its own news story on April 4. \\nIn its lead paragraph, the report said the United States “assessed” that the shipment of illicit arms on board the dhow “originated in Iran and was likely bound for Houthi insurgents in Yemen.” \\nAn Earlier Ruse \\nThe Obama administration also had sought to promote the charge that Iranian was covertly sending weapons to the Houthis by sea more than two years earlier. In January 2013, the Yemen client government backed by the United States and Saudi Arabia had claimed that its forces had intercepted a ship with a large cargo of weaponry that came from Iran and was on its way to Yemen to deliver them to the Houthis. \\nThe Obama administration supported that charge in briefings to journalists. After the Saudi air war against Yemen began in 2015, the U.S. pushed for a report by an experts group on sanctions against Iran that would give the charge credibility. \\nBut the 2013 claim was soon exposed as a ruse. A Security Council Monitoring Group on Somalia and Eritrea revealed in a June 2013 report that the crewmembers had told diplomats who interviewed them that ship’s cargo of diesel fuel was bound for Somalia, not Yemen. And, since the weapons were hidden under the diesel fuel tanks, the weapons could be accessed only after those tanks had been emptied, in other words after the ship docked in Somalia. \\nThe monitoring group learned from authorities in the Puntland region of Somalia, where most of the smuggled weapons have entered the country, that this was a widely used method of smuggling arms into the country. \\nFurthermore, the monitoring group determined that the wide range of types of weapons on board the ship, which was intercepted in January 2013, as well as of their original sources indicated that the weapons cache had been assembled by arms merchants. Authorities in Puntland provided data to the monitoring group showing that most of the shipments of weapons into Puntland in the months before January 2013 had come from politically well-connected arms merchants in Yemen. \\nSome of the fishing boats that were intercepted with illicit arms on board in 2015-16 had Iranian owners. But the monitoring group report reveals that the real reason is the role of such Iranian fishing vessels in illegal fishing in Somali waters. The vast majority of the hundreds of fishing vessels involved in such illegal fishing networks were either Iranian or Yemeni. As many as 300 were believed to be Yemeni-owned, while Iranian-owned 180 of them. \\nThe monitoring group said it was investigating unconfirmed reports that some of those illegal fishing vessels were also being used to carry out arms smuggling and that it had established “other connections between the illegal fishing networks and networks involved in the arms trade and connected to al-Shabaab in northeastern Somalia.” \\nBut the Obama administration has no interest in the considerable evidence gathered by the monitoring group that provides a more credible explanation for the arms found on those four fishing dhows. \\nSuch an explanation isn’t political useful, whereas the accusations of Iranian smuggling of arms to the Houthis fulfilled multiple political and bureaucratic interests, justifying Saudi Arabia’s bloody U.S.-backed air campaign over Yemen and endless Washington alarms about “Iranian aggression.” \\nGareth Porter, an investigative historian and journalist specializing in US national security policy, received the UK-based Gellhorn Prize for journalism for 2011 for articles on the U.S. war in Afghanistan. His new book is Manufactured Crisis: the Untold Story of the Iran Nuclear Scare . He can be contacted at . \\nReprinted from the Middle East Eye with the author’s permission. Read more by Gareth Porter\""}, "time": 1742561943.3542838}