{"duration": 0.18534636497497559, "input_args": {"text": "'By Maxine Bernstein | The Oregonian/OregonLive on October 27, 2016\\nA jury Thursday delivered a stunning across-the-board acquittal to the leaders and participants in the Malheur National Wildlife Refuge occupation and a remarkable blow to the federal government as it tries to tamp down a national movement led by a Nevada family to open public lands to ranchers, miners and loggers. \\nThe verdicts finding Ammon Bundy, older brother Ryan Bundy and five others not guilty of a federal conspiracy drew elation from defense attorneys who spent five weeks arguing that the armed takeover amounted to a time-honored tradition of First Amendment protest and civil disobedience. \\n“Maybe this is a lesson that that’s not the way to engage with these people, who want nothing more than just to be heard, just to have a forum to talk about the injustices like the case of the Hammonds and the treatment of ranchers,” said Lisa Ludwig, standby counsel for Ryan Bundy. \\nThe high-profile case riveted the state and drew national and international attention to the isolated bird sanctuary in rural eastern Oregon. The jury’s decision proved no less dramatic and sets up a showdown in the next stage of the land-rights movement. \\nThe Bundy brothers still face prosecution in Nevada with their father, Cliven Bundy, all accused in the 2014 standoff at the patriarch’s ranch over unpaid grazing fees that pitted the family and their supporters against federal Bureau of Land Management agents. \\nThe Oregon prosecutors sat silently in front of their boss, U.S Attorney Billy Williams, and the head of the FBI in Oregon, Greg Bretzing, as the judge announced the “not guilty” pleas one by one. \\nWilliams later thanked the jury in a written statement. “While we had hoped for a different outcome, we respect the verdict of the jury and thank them for their dedicated service during this long and difficult trial,” Williams said. “We strongly believed that this case needed to be brought before a Court, publicly tried and decided by a jury.” \\nBretzing, whose agents led the response to the Jan. 2 refuge seizure, offered a slightly different take. “We believe now — as we did then – that protecting and defending this nation through rigorous obedience to the U.S. Constitution is our most important responsibility.” \\nEach defendant stood separately, facing the jury, as the judge read the verdicts. Ammon Bundy, his hands clasped behind his back, nodded as the “not guilty” came for him first. As he sat, he smiled and rubbed the shoulder of his lawyer, Marcus Mumford. \\nRyan Bundy nodded his head and mouthed to jurors, “Thank you.” \\n“I had a very peaceful feeling but I didn’t know we’d all be found not guilty,” said defendant Shawna Cox. “… I’m so grateful to the jury.” \\nDefendant Neil Wampler hugged his defense lawyer and gave her a kiss. \\nBut the trial fireworks weren’t quite over. A brawl broke out at the very end, when six to seven U.S. marshals surrounded Ammon Bundy’s lawyer as he stood before the judge, arguing and shouting for his client to walk out the door a free man. They tackled him and stunned him with a Taser gun. As Mumford yelled, “What are you doing?,” U.S. District Judge Anna J. Brown ordered, “Everybody out of the courtroom!” \\n“All I was asking for was papers,” Mumford said after emerging from federal custody nearly two hours later. “Just show me you have the authority to take Mr. Bundy into custody.” \\nMumford was cited by Federal Protective Services for failure to follow a lawful order and creating a disturbance. He said the marshals overreacted. Several fellow defense lawyers echoed his sentiments, though one questioned Mumford’s judgment. \\nAs for the verdict, Mumford said, “Very pleased, very gratified. This jury was dedicated. They listened to our case.” \\nProsecutors had argued the case was simple: The refuge occupiers took control of a wildlife refuge that wasn’t theirs. The heavily armed guards that manned the front gate and watchtower during the 41-day takeover, in an of itself, was “intimidating,” and prevented officers from the U.S. Fish and Wildlife Service and U.S. Bureau of Land Management from carrying out their work. \\nBut defense lawyers said they believe the jury held true to the judge’s instructions, and couldn’t find beyond a reasonable doubt that their “intent” was to prevent the federal employees from going to work. \\nFive of the seven defendants took the stand and said they were protesting the return to prison of Harney County ranchers Dwight Hammond Jr. and Steven Hammond, who faced a minimum mandatory five-year sentence for arson to federal land. Steven Hammond was convicted partially of setting fire to refuge property. They also said they were protesting federal government overreach, and didn’t give much thought at all to the federal employees whose desks and offices they used throughout the refuge takeover. \\nWhile it may be easier to show that defendants charged in a drug trafficking conspiracy shared a common goal, in this case there was “no obvious underlying self-interest,” said Matthew Schindler, who represented Kenneth Medenbach. \\nSchindler also said he believed the judge’s decision to allow defendants to explain their “state of mind,” at the time of the occupation boosted the defense case. The pull of jurors from across the state, not just Portland, also helped defendants, particularly regarding the weapons charges, Schindler said. \\nThe jury saw that the occupiers cared about the Hammonds and didn’t like how the federal government was treating them, said David Fry’s lawyer Per C. Olson. \\n“I think the jury saw through this that they were well-meaning, well-intentioned individuals,” Olson said. “It was the right verdict.” \\nLisa Maxfield, who represented Wampler, came out of the courthouse, holding up her fists. She said she has never seen “anything like this happen,” where multiple defendants in a federal trial were all acquitted. It was one of the most significant cases in her career, she said. \\n“It’s a tremendous victory for rural America,” Wampler said outside the courthouse as supporter and fellow refuge occupier Brand Nu Thornton blew his shofar and another man rode his horse back and forth, hoisting an American flag. \\nBut others, like Jennifer Rokala, executive director of the Center for Western Priorities, worried the verdicts would spur other similar armed standoffs against the government’s control of public lands that involve the militia. \\n“We are deeply disappointed in today’s verdict, which puts our park rangers and scientists at further risk just for doing their jobs. The outcome of today’s trial will undoubtedly embolden extremist groups,” Rokala said. ” It’s imperative that local, state, and federal law enforcement ensure the safety of our land managers.” \\nOregonian Staff Writers Aimee Green and Jim Ryan contributed to this story. \\n— Maxine Bernstein'"}, "time": 1742562524.7138999}