{"duration": 0.06324172019958496, "input_args": {"text": "'BURNASTON, England  —   On Toyota’s brightly lit assembly line here, workers guide wheel and engine assemblies into unfinished sedans. Driverless carts carry parts through narrow aisles to work stations. The assembly line moves with clockwork precision, able to pop out a vehicle every 72 seconds. Britain’s automotive industry, once ailing and plagued by strikes, now hums with the vibrancy of a global manufacturing hub. Most of the cars made in Burnaston, models like Auris and Avensis, will make their way beyond the British borders. Toyota buys parts and hires workers from across the European Union. But the level of integration, previously lauded, has made the carmakers especially vulnerable after Britain’s vote to leave the bloc. If a messy divorce follows, Toyota and others face the prospect of higher tariffs, a smaller labor pool and less access to the 500 million potential customers in Europe  —   all of which will be negotiated in the coming months and years. The drop in the British pound since the vote has not been much help, either. Many of the carmakers’ contracts here are priced in euros, even with suppliers in the same country like Johnson Controls, which makes seats for Toyota. “We have made clear that if we lose some of these elements, it will make making cars in the U. K. less competitive,” said Anthony J. Walker, deputy managing director of Toyota Manufacturing in Britain. “We would have to reduce costs, which would be very hard. ” Carmakers like Toyota are now in   defense mode. Toyota and others are telling the government that they need continued, unfettered access to the European Union, for exports, imports and engineering talents, which they say is in short supply in Britain. Toyota is particularly concerned that its    manufacturing system  —   which requires that parts arrive at the plant in a certain order just a few hours before assembly  —   should not be disrupted. “It is absolutely suicidal,” said Peter Tsouvallaris, the plant’s senior representative for the union, Unite, which also represents workers at other carmakers. “I am concerned about the   future of the plant because we don’t know what Brexit means. ” The British government understands the stakes for the country, which is home to a cluster of   plants for overseas automakers like Nissan, General Motors, BMW and Honda. The sector employs about 169, 000 and accounts for about 12 percent of the value of British exports, according to the Society of Motor Manufacturers  Traders, an industry group. Already, the British prime minister, Theresa May, has shown a protective streak. The government has promised to invest 390 million pounds, or $485 million, to encourage advanced,   vehicles, including driverless and electric cars. It has said it will continue to fund training for Toyota and other auto companies, as well as encourage development in component makers based in Britain. Britain also offered assurances to Nissan, whose plant in Sunderland became a flash point in the time before the vote over the   Brexit. Although specifics have not been made public, Nissan said in October that it would build a new version of its popular Qashqai and another model at the plant. “The support and assurances of the U. K. government enabled us” to make the investment decision,” Nissan’s chairman and chief executive, Carlos Ghosn, who had recently met Mrs. May, said at the time. That clout has been hard won for an industry that was struggling not so long ago. Britain always had a flair for car design, producing such classics as the Jaguar XKE and   Sprite. But the industry in the 1960s and 1970s suffered from underinvestment, dated models, poor quality and frequent strikes. The outlook began to change in the 1980s, as Japanese automakers began to look for a foothold in Europe to gain access to the single market. Britain beckoned. Under Prime Minister Margaret Thatcher, it was increasingly welcoming to foreign investment, unions were in retreat, and Britain’s own auto industry was not much of a competitive threat. Toyota came in the early 1990s, finding a large site in central England that could be cleared and built to the company’s specifications. The Japanese companies brought efficient production methods. The nearby industrial center of Derby welcomed the new manufacturing jobs at a time when jobs at other companies were being lost. “The Japanese completely reversed what was going on,” said Garel Rhys, a professor emeritus of motor industry economics at Cardiff University. “They showed that Britain was not a place that was out of control. ” The Japanese carmakers brought a more   approach to   British manufacturing. Workers at the Toyota plant, who make more than 30, 000 pounds on average a year ($37, 360) are called “members. ” To avoid delays when snags arise on the line, they pull a cord summoning help from a team leader, denoted by two yellow stripes on the navy blue baseball caps all workers wear. Toyota’s collegial approach has helped with labor relations at the plant, which is unionized. Toyota says it has lost no time to strikes in about a   of manufacturing in Britain. “The main reason is their philosophy,” said Mr. Tsouvallaris, the union representative. “There is always a channel open for communication. ” Other automakers soon followed their Japanese rivals. In the early 2000s, BMW of Germany began building a new line of Mini cars in Oxford. Later that decade, Tata of India took over the old British brands Jaguar and Land Rover. It has helped grease Britain’s economy. Over all, the country made about 1. 6 million cars last year. The figure, though much smaller than in powerhouses like the United States and Japan, leaves it roughly level with France as Europe’s   automaker, after Germany and Spain. Toyota has invested £2. 2 billion in the Burnaston operation and an engine plant in Wales. Together, they employ around 3, 200 people. Britain remains a heavyweight for Toyota, producing about 30 percent of the company’s cars in the region. The industry is now plagued with uncertainty. The British prime minister wants to start negotiations in early 2017 on the terms of the country’s exit from the European Union, talks that could last two years or more. The spectrum of possibilities is broad, from Britain remaining part of the single market to the country facing high barriers to trade with the Continent. Both sides have their own competing interests with carmakers, putting the industry in the middle of a potential fraught negotiation. “The car industry really did take the prospectus of the E. U. at face value,” said Stephen Adams, a partner at Global Counsel, a political risk firm in London. “It relies on the free circulation of goods in the E. U. not just to sell products but to make products. ” Toyota has options if the Burnaston plant ultimately proves unprofitable. The carmaker has more than 30 vehicle manufacturing plants around the world and, like many of its rivals, pits them against each other to bid for the right to make various models. Toyota also has a string of plants across the region, including large   hubs in France and Turkey. The company has had to trim operations at Burnaston before, closing an assembly line in 2010. Annual production is down to 180, 000 from a peak of 282, 000 in 2006. Mr. Walker, the Toyota executive, says a new model for Burnaston is under consideration, although no decision has been made. The plant has already handled several changes to models in its history. On display in the reception area is the Avensis, versions of which are exported to Japan. “This is the only plant in the world that sends cars back to Japan,” Mr. Walker said. “We are very proud of that. ”'"}, "time": 1742628581.573721}