{"duration": 0.0316770076751709, "input_args": {"text": "'TRUTH DIED at the Hands of Katherine Frisk By Katherine Frisk on October 29, 2016 Or did the Truth die at the hands of Wikipedia’s Editors? \\nAs of the 26th Of October ( GMT) the editors of Gaven MacFadyen’s profile chose to add this addendum to his personal profile: \\nPersonal life \\nHe was born in Greeley, Colorado in 1940 as Gavin Hall Galter; he eventually took on the surname of his stepfather.[13] MacFadyen lived in the Pimlico district of London with his wife, Susan Benn. He died of lung cancer in London on October 22, 2016 at the age of 76.[5]….Truth died at the hands of Katherine Frisk.. \\nHere is a screen shot: Screen Shot 26th October GMT \\nOn the 24th of October I read about Gavin MacFadyen’s death on RT which you can read HERE, and immediately went to Wikipedia to find out more details on his life. Under his personal life this is what I found: \\nPersonal life \\nMacFadyen lived in the Pimlico district of London with his wife, Susan Benn. He died at the hands of Evan McMullin, a CIA operative, after MacFayden allegedly discovered information relating to numerous scrubbed black-ops missions linked to the assassination of multiple Third World heads of state. \\nHere is a screen shot, which by the way, was not only witnessed by myself but many other people. I did not edit this or add or subtract anything from it. It was as you see it: Screen Shot 24th October (GMT) \\nI then went in search of a person called Evan McMullin. I found a detailed biography on Esquire Magazine which you can read HERE. \\nI then wrote up an article about it for Veterans Today which you can read HERE . \\nTo the editor’s of Wikipedia, a site that is considered by many to report the “facts” and to which millions go for background information on a daily basis, please note, in the article I asked the following questions: \\nWas he involved in MacFadyen’s death and if so what proof does anybody have that he was? \\nAll it says is “He died at the hands of Evan McMullin.” Is Evan McMullin aware of this “fact” on Wikipedia and has he made any statements in this regard? \\nDid Evan McMullin kill Gavin MacFadyen as claimed? Or is this a stunt? \\nI would like to know which part exactly does Wikipedia think caused “ the Truth to die ” at my hands? \\nOn the morning of the 26th of October, I was alerted to the fact that Gavin MacFayden’s personal profile had changed again. \\nThis time it read: \\nPersonal life He was born in Greeley, Colorado in 1940 as Gavin Hall Galter; he eventually took on the surname of his stepfather. MacFadyen lived in the Pimlico district of London with his wife, Susan Benn. He died of lung cancer in London on October 22, 2016 at the age of 76. \\nHere is a screen shot: Screen Shot 26th October \\nOn further examination I found another screen shot of more editing that had been done on Wikipedia on 24th of October. As you can see, it is typical of politics in the USA today where nobody misses a chance at mudslinging, disinformation, “poisoning the well,“and muddying the waters of all journalism : \\nI would like to ask the editors of Wikipedia: By whose hand did the truth die? Mine or your own? \\nPlease read your own prospectus where it says: \\nContentious material about living persons that is unsourced or poorly sourced must be removed immediately, especially if potentially libelous or harmful \\nAnd to “ lidcombe, australia with telstra “, although, no doubt, this is not who you really are, and who posted that “ ….Truth died at the hands of Katherine Frisk” I suggest that you remove it. \\nHere is a tribute to Wikileaks Director Gavin MacFadyen. The readers can make up their own minds as to who and what Gavin was.'"}, "time": 1742628594.2303345}