{"duration": 0.03188300132751465, "input_args": {"text": "'Rep. Jared Huffman ( ) has announced that he will boycott   Donald Trump’s inauguration next Friday, becoming the third U. S. representative to do so. [In a Facebook post on Saturday, Huffman announced that he wanted to protest the start of a “dark and dangerous chapter” for America:  Ordinarily, on Inauguration Day I would take my place above the west steps of the Capitol and join colleagues and dignitaries in honoring a great and solemn American tradition: the peaceful transfer of power which must always transcend partisan differences. Ordinarily, I would do that without hesitation for any President, regardless of their politics or personality, as a show of respect for the institution and the will of the voters  —   and as a gesture of goodwill to foster reconciliation and collaboration as we put the election behind us and prepare to work with the new administration. However, there is nothing ordinary about this inauguration or the man that will be   as our next President. I do accept the election results and support the peaceful transfer of power, but it is abundantly clear to me that with Donald Trump as our President, the United States is entering a dark and very dangerous political chapter. I will do everything I can to limit the damage and the duration of this chapter, and I believe we can get through it. But I will not sit passively and politely applaud as it begins. Instead of attending the inauguration, Huffman said that he would spend the day in his district “doing positive things. ” Huffman represents the second congressional district of California, a coastal district that includes liberal Humboldt County,  the state’s most celebrated marijuana cultivation region. As Breitbart News reported last year, Huffman, a Democratic Party “” defied the views of many of his constituents by supporting former Secretary of State Hillary Clinton over Sen. Bernie Sanders ( ). Huffman joins Reps. Luis Gutierrez ( ) and Katherine Clark ( ) in boycotting what has traditionally been a bipartisan event, where the country comes together for at least one moment to honor the democratic transition of power. The California Democrat said that he had received support from the district, and that “people are really resonating” with his decision to boycott, although he complained about opposition from “these Republicans from Alabama, Indiana and Oklahoma. ” Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, See No Evil: 19 Hard Truths the Left Can’t Handle, is available from Regnery through Amazon. Follow him on Twitter at @joelpollak.'"}, "time": 1742562745.8782241}