{"duration": 0.1103515625, "input_args": {"text": "'At the beginning of every month, subscription streaming services add a new batch of movies and TV shows to their libraries. And at the beginning of every month, we’ll send you a newsletter with a list of the ones we think are most interesting, broken down by service. Everything mentioned is available to stream starting today, Oct. 1, unless otherwise indicated. To receive this information in your email inbox every month, subscribe to Watching, a   newsletter that sifts through the overwhelming number of movies and TV shows, directs you to the best ones and tells you where you can watch them. For examples of what those newsletters look like, head on over here. ‘Quiz Show’ This Robert   film, about a 1950s TV scandal that led to congressional hearings, offers a hit of midcentury style and one of the worst accents to ever appear on a movie screen. (Rob Morrow is good, but his Boston brogue is wicked bad.) John Turturro and Ralph Fiennes are characteristically fantastic as the rival game show participants. ‘Dheepan’ When this film by the French director Jacques Audiard made its debut in May after showing at Cannes the year before, A. O. Scott wrote that “this story of a makeshift family, tossed from a distant war zone into a French housing project, looked to many festival observers less like a work of cinematic art than like a news bulletin. ” (Oct. 3) ‘13th’ Ava DuVernay (“Selma”) directs this documentary about mass incarceration and racial inequality in the United States. The movie, which takes its title from the 13th Amendment, which abolished slavery, opens in select movie theaters on the same day. (Read Manohla Dargis’s review.) (Oct. 7) ‘Black Mirror,’ Season 3  After finding success in America on Netflix, this dystopian   anthology TV series returns with six dark episodes, including installments directed by Joe Wright (“Atonement”) and Dan Trachtenberg (“10 Cloverfield Lane”). (Oct. 21) ‘Kung Fu Panda 3’  This is neither the first nor the second entry in the “Kung Fu Panda” series. (Oct. 26) ‘The Fall,’ Season 3  At Watching, we’ve received a handful of emails every month for the past   asking, “When is the new season of ‘The Fall’ going to hit Netflix?” For those of you who are that invested in this British serial killer drama starring Gillian Anderson, now you know. (Oct. 29) Also of interest: “Breakfast at Tiffany’s,” “Dazed and Confused,” “Grizzly Man,” “Gentleman’s Agreement,” “Once Upon a Time in the West,” “Three Kings,” “Titanic,” “Unforgiven. ” ‘Before Sunrise’   ‘Before Sunset’ Ethan Hawke and Julie Delpy, walking and talking, beautiful European locales, romance and longing. “Before Sunrise” (1995) the first film in the director Richard Linklater’s “Before” trilogy, is cute and cringing in equal measure, as young love often is. “Before Sunset” (2004) which looks at the same characters about a decade later, is a knockout, simultaneously melancholy and hopeful. ‘Pride and Prejudice’ Look, any version of Jane Austen’s novel is going to suffer in comparison next to the beloved 1995 TV version starring Colin Firth and Jennifer Ehle. But this 2005 adaptation directed by Joe Wright (“Atonement”) looks beautiful, and Keira Knightley is radiant. ‘Goliath,’ Season 1 David E. Kelley is one of the kings of the TV legal series  —   ”L. A. Law,” “The Practice,” “Ally McBeal”  —   and he returns to the genre with this   series starring Billy Bob Thornton as a dissolute former   lawyer who happens onto a big case. Don’t expect much humor here, though there’s something charming about Mr. Thornton’s casual line delivery. (Oct. 14) ‘Good Girls Revolt,’ Season 1  In the early 1970s, a group of female researchers at “Newsweek” sued the magazine for gender discrimination, claiming that only men were considered for or appointed to the positions of reporter and writer. If you’re interested in the era, the news industry, “Mad Men” vibes or often think of this GIF, then this might interest you. You can watch the pilot now. (Oct. 28) Also of interest: “Chinatown,” “The Hunger Games: Mockingjay Part 2,” “The Last Waltz,” “Misery,” “Secretary,” “Slap Shot,” “Spectre” (Oct. 21) “Timecrimes,” “Training Day,” “ ” “The Warriors,” “The Witches. ” ‘Deadpool’  Ryan Reynolds, in one of the year’s biggest   hits, proves that it’s O. K. to curse in a superhero movie. (Starting at 8 p. m. Oct. 1.) ‘By the Sea’  Angelina Jolie Pitt wrote and directed this beautiful, if languid, film in which she and Brad Pitt play a couple whose marriage is falling apart. And now we can all watch it. It’s like HBO knew or something. (Starting at 8 p. m. Oct. 13.) Also of interest: “28 Days Later,” “Drumline,” “Eastern Promises,” “Poltergeist,” “” “  2. ” ‘Carol’  Cate Blanchett and Rooney Mara in a Todd Haynes movie. Ravishing. (Starting at 9 p. m. Oct. 8.) ‘45 Years’  This British domestic drama has a   premise for such a quiet film. On the eve of their 45th anniversary, Kate and Geoff’s domestic boredom is shaken by a letter announcing that the body of Geoff’s former lover, who died after falling into a Swiss ravine decades ago, has been found in a melted glacier. This film consists primarily of the actors Charlotte Rampling and Tom Courtenay talking and getting lost in their own private reveries and it’s utterly gripping. (Starting at 7:15 p. m. Oct. 8.) Also of interest: “Blue Velvet,” “The Descent,” “The Original Kings of Comedy. ” ‘Chance,’ Season 1 Hugh Laurie, who played Dr. House in the series “House” plays Dr. Chance in a new series called “Chance. ” That’s an amusing fact, but Mr. Laurie’s new venture is nothing like Fox’s hit “   ” series. Here, he plays a San Francisco neuropsychiatrist in this dark and tense series that, like the novel it’s based on, feels like a take on the Hitchcock’s “Vertigo. ” (Starting at 7:15 p. m. Oct. 8.) ‘Spectre’ Daniel Craig starred in “Casino Royale” and “Skyfall,” two of the James Bond franchise’s best entries. So maybe let’s forgive him this   effort. Does it matter that it’s silly for two people to take a train out into the middle of the desert when they look as good as they do above? (Oct. 21) Also of interest: “Carrie,” “Chinatown,” “How to Survive a Plague,” “Kill Bill: Volume 1 and 2,” “Platoon,” “Room 237,” “Secretary,” “Swingers,” “The Blair Witch Project,” “Thirteen Days,” “The Warriors. ” Starz“A Band Called Death”  —   In Detroit in the   three black teens formed a rock band named Death, recorded some music and disappeared. A 2009 article in The New York Times headlined “This Band Was Punk Before Punk Was Punk,” reintroduced its music to the world. This 2013 documentary tells Death’s fascinating story. Acorn“Casanova” (Oct. 3)  —   This 2005   British TV movie stars David Tennant (the Doctor in “Doctor Who,” Kilgrave in “Jessica Jones”) as the title character. As a reviewer for The New York Times wrote then, the film has “a lively pace, a warm spirit, a contagious sense of fun, some very pretty   European settings and Peter O’Toole as the title character in his later years. ” SundanceNow Doc Club“The Bureau” (Oct. 3)  —   This French series stars Mathieu Kassovitz (“Amélie”) as an intelligence agent who returns to Paris after years undercover in Damascus. If you’re looking for a smart, talky, foreign spy series (though one without much action) this one’s for you. Sign up for the Watching newsletter to get expert film and TV recommendations like this straight to your inbox.'"}, "time": 1742562792.9529545}