{"duration": 0.14560532569885254, "input_args": {"text": "'At first blush, there’s a baffling,   quality to Julian Assange’s latest star turn in our shambolic national story. He belongs in jail for “waging his war” against the United States by exposing its secrets, the conservative Fox News host Sean Hannity has said of him. An “  operative with blood on his hands,” Sarah Palin once called him. Yet last week brought the sight of Mr. Hannity speaking with Mr. Assange in glowing terms about “what drives him to expose government and media corruption” through Clinton campaign hacks that American intelligence has attributed to Russia. And Ms. Palin hailed him as a great truth teller, even apologizing for previous unpleasantries. (Cue sound of needle sliding across record album.) O. K. the fact that WikiLeaks’   splash was bad for the Democrats and good for   Donald J. Trump may have a   bit to do with their change of heart. But what’s up with Mr. Assange, who seems equally comfortable being a hero of the American left as he is being one of the American right, or even of Russian Putinists? What does he want, anyway? The answer has been in front of us all along. And the current imbroglio over Russia, WikiLeaks and their role in Mr. Trump’s victory  —   or, more to the point, Hillary Clinton’s loss  —   might be viewed as the realization of the vision Mr. Assange had when he started WikiLeaks over a decade ago. Mr. Assange spelled it out in prescient terms in an essay he posted online in November of 2006, the year of WikiLeaks’ founding. He wrote it long before becoming the polarizing figure he is today, a “cypherpunk” folk hero with an outsize reputation for being messianic, impetuous and all too cavalier with the personal data that come his way. (He’s currently living in the Ecuadorean Embassy in London, where he was granted asylum from Swedish authorities who are investigating a rape accusation against him that he says is false and politically motivated.) Yet even his toughest critics acknowledge how clearly he saw the politically disruptive potential of technology, back when some of us were getting our first BlackBerries. It’s what prompted him to start WikiLeaks, which “pioneered something extremely important and very dangerous to large organizations that keep lots of secrets digitally,” as the journalist Glenn Greenwald told me in an interview last week. From the start, Mr. Assange said WikiLeaks’ prime directive was to expose hidden data sets that “reveal illegal or immoral behavior” in government and big business. But in the essay he also wrote in more ambitious terms about forcing regime change through data and technology rather than through the old, barbaric means of assassination. As Mr. Assange saw it, power was held by vast networks of conspirators who shared vital information in secret, giving them a superior understanding of reality that enabled them to hold on to power. The technology revolution, he wrote, was providing the conspirators with the means to achieve what he called an even “higher total conspiratorial power. ” But it was also making them more vulnerable to sabotage, so that a governing conspiracy could be “slowed until it falls, stupefied unable to comprehend and control the forces in its environment. ” As an example, he pointed to “two closely balanced and broadly conspiratorial power groupings,” the Democratic and the Republican Parties in the United States. “Consider what would happen if one of these parties gave up their mobile phones, fax and email correspondence  —   let alone the computer systems,” he wrote. “They would immediately fall into an organizational stupor and lose to the other. ” The essay got new attention when WikiLeaks, working in tandem with The Guardian, The New York Times and other outlets, released extensive diplomatic cables in 2010, making WikiLeaks more of a household name. No one seemed to grasp what Mr. Assange was hinting at more clearly than the conservative writer John Sexton, who foresaw the events of 2016 in a post that was published on Breitbart News and his own blogin 2010. “You can take his example further by imagining what would happen to, say, the D. N. C. if it suffered a massive Wikileak of secret data,” Mr. Sexton wrote, referring to Mr. Assange’s essay. “It seems entirely possible that a leak of the contents of their email for one month would be exceedingly damaging to them. ” And here we are, over six years later. Mr. Assange’s essay has resurfaced yet again, after major data breaches of the email accounts of the Democratic National Committee and the Clinton adviser John Podesta, committed, allegedly, by   hackers and fed to the world via WikiLeaks. Clinton aides have said the breach impeded their ability to communicate electronically afterward, causing them to resort to holding more   meetings. But far more damaging were the spilled secrets. They forced the resignations of the Democratic National Committee chairwoman, Debbie   and of the interim chair, Donna Brazile, from her analyst job at CNN. And they provided Mr. Trump with a steady stream of fresh,   data points, which WikiLeaks fed out incrementally, creating a running story that the American news media voraciously seized upon. Political scientists will debate for years to come how decisive the leaks were in the election outcome. But the emails were undeniably in the mix of an election decided by fewer than 100, 000 votes in three key swing states. So, in the end, one political party was technologically compromised in a way the other wasn’t, and that party did indeed “lose to the other. ” It’s a straight line from Mr. Assange’s initial essay. But if WikiLeaks’ disclosures abetted Mr. Trump, how does that square with Mr. Assange’s goals to undercut “authoritarian conspirators” and create incentives for “more humane forms of governance”? Mr. Trump was less transparent than Mrs. Clinton was during the campaign (we’re still waiting for those tax returns) and he made a number of   statements (“lock her up! ”) that were unique to modern American politics. A WikiLeaks journalist, Sarah Harrison, recently wrote in The Times that WikiLeaks was a news organization committed to disclosing vital information, not picking political sides. Mr. Assange addressed the question differently in an interview last month with the Italian journalist Stefania Maurizi of La Repubblica. “Hillary Clinton’s election would have been a consolidation of power in the existing ruling class of the United States,” he said. Mr. Trump and his allies, he said, “do not by themselves form an existing structure, so it is a weak structure which is displacing and destabilizing the   central power network within D. C. ” That, he said, could herald change, both good and bad. A weak power network in Washington, of course, is just what President Vladimir V. Putin of Russia wanted to see, too. Given Russia’s own authoritarianism and opacity  —   try independent journalism there, if you dare  —   it’s a wonder and, for some, cause for suspicion that it’s not a bigger WikiLeaks target. Mr. Assange told Repubblica that while he had released plenty of   documents, WikiLeaks has no staff members who speak Russian. And he told my Times colleagues Jo Becker, Steven Erlanger and Eric Schmitt last summer that Russia was “a bit player” on the world stage compared with the United States and China. (Their article showed how WikiLeaks’ releases often benefited Russia at the expense of the West despite American assessments that it is likely not directly tied to Russian intelligence services). Though Mr. Assange does not as a rule reveal sources, he has repeatedly said he is confident that the Clinton campaign and D. N. C. email caches that WikiLeaks received did not come from a “state party. ” He maintains that the United States has failed to offer conclusive proof of the Russian government’s direct role, and he is not alone. On Friday, The Intercept, a news outlet   by Mr. Greenwald  —   who led the Guardian team that shared a Pulitzer Prize in 2014 with The Washington Post for coverage of Edward Snowden’s revelations on mass surveillance  —   declared the intelligence report “underwhelming. ” Mr. Greenwald has been highly critical of mainstream news reports that, in his view, have been too quick to accept intelligence reports pointing to Russia’s role. That has added to the fun house mirror aspect of the latest Assange turn, given that Mr. Greenwald’s past work was celebrated by people who are so solidly opposed to Mr. Trump now. But Mr. Greenwald has long criticized mainstream American journalists as being too credulous with government intelligence claims (see “weapons of mass destruction”). Unlike, perhaps, Mr. Hannity and Ms. Palin, he is being consistent. “What’s changed is the political earth around me,” he said. “And the same thing has happened to Julian. ” That earth is still shifting. Where Mr. Assange turns up on it next is anyone’s guess.'"}, "time": 1742561801.889491}