{"duration": 0.04742860794067383, "input_args": {"text": "'in: NATO , US News , War Propaganda , World News (© Ints Kalnins / Reuters ) (RT) Russia and NATO are to hold separate drills with the Balkan nations of Serbia and Montenegro, both formerly part of Yugoslavia. It comes as the Russian envoy to NATO has warned that the Western alliance’s buildup could be harmful for other countries’ security. On Monday, 680 personnel from 32 NATO states and partner countries, including Georgia, Albania, Israel and Ukraine, started a series of joint exercises known as Crna Gora (Montenegro) 2016. Between October 31 and November 4, multinational teams will participate in a number of scenarios simulating various disasters such as floods and chemical spills. “This is an opportunity to work with them [NATO] during the four-day exercise to determine our capacity and the capabilities of our response to natural disasters, as well as to recognize our weaknesses and eliminate them in time,” said Montenegro’s Deputy Prime Minister and former intelligence chief Dusko Markovic, as quoted by the newspaper Vijesti. In December, NATO formally invited Montenegro to join the alliance, while in May it has been granted an observer status after accession negotiations. “Montenegro has demonstrated the ability as a future member of NATO, not only through organizing this exercise, but also bearing its burden,”Markovic added. “Montenegro has demonstrated the ability to not only willing to accept but also help realize partnership goals.” Meanwhile in Serbia, 150 paratroopers from the reconnaissance battalion of the Ivanovo Airborne Division are to arrive in Belgrade to take part in the military exercise Slavic Brotherhood 2016. The Russian troops will be joined by Serbian and Belarusian forces. The joint Russian-Serbian exercise will last between November 2 and 15, and will also involve over 50 soldiers from the Russian Military Transport Aviation along with combat vehicles including the BMD-2 infantry fighting vehicle, the Tachyon drone and four ATVs for raids and reconnaissance missions. This would mark the second set of Slavic Brotherhood exercises with Serbia, with the first held last year near Novorossiysk. ‘Undermining regional security’ Russia’s Permanent Representative to NATO, Aleksandr Grushko, said on Monday that NATO’s buildup close to Russian territory could have a negative impact on the general security situation in the region. “NATO’s [systematic] efforts have been changing the very essence of the military security in the regions which are adjacent to the Russian border,” Grushko said in an interview to Rossiya-24 channel which aired on Monday. “This seriously worsens the regional security and the security of those countries that participate in these drills and this activity,”he said, adding that NATO’s ongoing military buildup in its eastern flank is “some sort of project that not only does not correspond to the common European security interests, but goes against them.” Reflecting on the earlier statements by NATO’s Secretary-General Jens Stoltenberg, who said on Thursday that NATO did not want to get caught up in a new Cold War with Russia, Grushko pointed out that NATO has been sending mixed signals on purpose in a bid to justify its military buildup. “I think it’s a double signal. First of all, it’s a signal to western public opinion that all NATO actions on its eastern flank are calibrated and do not transcend the framework of reasonable defense. Secondly, it’s also an apparent attempt to send a signal to us, so that Russia will not react in what they believe to be an excessive and aggressive manner,”he said, adding: “In effect,”NATO’s increased military activity close to Russian borders is “justified by nothing.” While Stoltenberg claimed that NATO aims “to strive for a more cooperative and constructive relationship” with Russia, in reality the alliance does not seem to maintain this approach, as evidenced by its recent refusal to discuss flight security in the Baltic Sea region, the Russian diplomat said. “The very fact that NATO’s countries refused to convene for the meeting, proposed by us and to be held at the level of military experts in Moscow and devoted to all aspects of air traffic security in this region, speaks volumes,” Grushko said, adding that NATO may not be that genuine in its attempt to improve air traffic security over the Baltic Sea. In July, Russia’s Defense Ministry said that Russia is ready to fly all its missions over the Baltic Sea with the transponders on, but only if NATO member states reciprocate. “As soon as we said about this, the issue of transponders practically disappeared from NATO member states’ political lexicon. It ceased to exist… I’m not sure that NATO is sincerely ready to talk about joining such a regime,”he concluded.'"}, "time": 1742628512.3828893}