{"duration": 0.037896156311035156, "input_args": {"text": "'Progressive Nomad: Renewed Hope For Protesters As Wild Buffalo Storm Over The Horizon (VIDEO) By Stephanie Kuklish   \\nDuring peaceful protest and prayer on Thursday, while police armed with weapons shot rubber bullets and bean bags into the crowd, the Native American water protectors fighting the Dakota Access Pipeline were in awe of hundreds of Bison that appeared, showing the warriors they were fighting too. \\nOver 200 Native Americans were arrested for peaceful prayer after being bombarded by state and local police dressed in riot gear and using violent tactics on the unarmed warriors. Though the showing of the Bison didn’t stop the corrupt police attacks it did bring a renewed sense of purpose to the tired but motivated crowd. \\nThe Bison is a potent symbol of Native American heritage. In a blog post about the incident, Davidica Littlespottedhorse explained the legend of the bison by stating : “The great bison or buffalo of North America is a very powerful symbol to American Indians. Though best suited to cooler climates, bison roamed virtually in entire continent. The smaller woodlands bison and its bigger cousin, the plains bison were revered and honored in ceremony and everyday life. To the plains Indian, our Bison Brother meant sacred life and the abundance of the Creator’s blessing on Mother Earth. The bison is powerful medicine that is a symbol of sacrifice and service to the community. The Bison people agreed to give their lives so the American Indian could have food, shelter, and clothing. The Bison is also a symbol of gratitude and honor as it is happy to accept its meager existence as it stands proud against the winds of adversity. The bison represents abundance of the Creator’s bounty and respect for all creation knowing that all things are sacred.” \\nThe moment was awe inspiring. Take a look for yourself. \\nFeatured Image Via Prairie Edge/ Ray Tysdal About Stephanie Kuklish \\nI am a 30 something writer passionate about politics, the environment, human rights and pretty much everything that effects our everyday life. To stay on top of the topics I discuss, like and follow me at https://www.facebook.com/keeponwriting and https://facebook.com/progressivenomad . Connect'"}, "time": 1742562177.3330863}