{"duration": 0.07715559005737305, "input_args": {"text": "'Sent: Monday, March 30, 2015 9:58:55 AM To: Amitabh Desai Cc: Jon Davidson; Margaret Steenburg; Jake Sullivan; Dan Schwerin; Huma Abedin; John Podesta Subject: Re: Victor Pinchuk \\nTeam HRC – we’ll get back to you on this \\nOn Mar 30, 2015, at 9:53 AM, Amitabh Desai <ami@presidentclinton.com> wrote:>> Victor Pinchuk is relentlessly following up (including this morning) about a meeting with WJC in London or anywhere in Europe. Ideally he wants to bring together a few western leaders to show support for Ukraine, with WJC probably their most important participant. If that’s not palatable for us, then he’d like a bilat with WJC.>> If it’s not next week, that’s fine, but he wants a date. I keep saying we have no Europe plans, although we do have those events in London in June. Are folks comfortable offering Victor a private meeting on one of those dates? At this point I get the impression that although I keep saying WJC cares about Ukraine, Pinchuk feels like WJC hasn’t taken enough action to demonstrate that, particularly during this existential moment for the county and for him.> > I sense this is so important because Pinchuk is under Putin’s heel right now, feeling a great degree of pressure and pain for his many years of nurturing stronger ties with the West. >> I get all the downsides and share the concerns. I am happy to go back and say no. It would just be good to know what WJC (and HRC and you all) would like to do, because this will likely impact the future of this relationship, and slow walking our reply will only reinforce his growing angst. >> Thanks, and sorry for the glum note on a Monday morning… \\n\\nRT further reports on the pay-to-play involving Pinchuk and The Clinton Foundation… \\nIn 2008, Viktor Pinchuk, who made a fortune in the pipe-building business, pledged a five-year, $29-million commitment to the Clinton Global Initiative, a program that works to train future Ukrainian leaders “to modernize Ukraine.” The Wall Street Journal revealed the donations the fund received from foreigners abroad between 2009-2014 in their report published earlier this week . \\nSeveral alumni of the program have already graduated into the ranks of Ukraine’s parliament, while a former Clinton pollster went to work as a lobbyist for Pinchuk at the same time Clinton was working in government. \\nBetween 2009 and 2013, the very period when Hillary Clinton was serving as US secretary of state, the Clinton Foundation appears to have received at least $8.6 million from the Victor Pinchuk Foundation. \\nThat places Ukraine as the leading contributor among foreign donators to the Clinton Foundation. \\nThe Pinchuk foundation said its donations to the Clinton-family organization were designed to make Ukraine “a successful, free, modern country based on European values.” It went on to remark that if Pinchuk was hoping to lobby the US State Department about Ukraine, “this cannot be seen as anything but a good thing,” WSJ quoted it as saying. \\nHowever, critics have pointed to some disturbing aspects regarding the donations, including the coincidence of the Ukrainian crisis, which began in November 2013, and the heavy amount of cash donations being made to the Clinton Foundation on behalf of wealthy Ukrainian businessmen. \\nThis article originally appeared on The Duran. Be Sociable, Share!'"}, "time": 1742562307.7822292}