{"duration": 0.0476231575012207, "input_args": {"text": "'President Donald Trump and his administration moved rapidly Tuesday to settle on a replacement for ousted FBI Director James Comey. [Trump has reportedly interviewed several candidates from a wide gamut of backgrounds and judicial philosophies for the job, as he and his top Justice Department officials, Attorney General Jeff Sessions and Deputy Attorney General Rod Rosenstein, reach their decision.  One reputed top candidate, Benghazi Committee Chairman Rep. Trey Gowdy ( ) pulled out of consideration Monday afternoon. The other early   Senate Majority Whip and Judiciary Committee member Sen. John Cornyn ( ) withdrew his own name Tuesday. Cornyn had a long career in the law, having served as both a judge, including on the Texas Supreme Court, and as Attorney General of Texas before becoming a Senator. Cornyn has made support of law enforcement a hallmark of his tenure in the Senate, introducing the American Law Enforcement Heroes Act this term. Cornyn has been a steadfast supporter of Trump’s handling of the Comey dismissal. Pressure built against a Cornyn pick from such as fellow Senator Lindsay Graham ( ) a   Trump opponent who is reportedly running from the   agenda over the Comey dismissal. Graham voiced his opposition to the Cornyn nomination on NBC’s Meet The Press, calling for someone outside the political branches in this    climate. “I think it’s now time to pick someone who comes from within the ranks or has such a reputation that has no political background at all that can go into the job on day one,” he said. Cornyn will now remain in the Senate, where he has been a major public supporter of the   immigration agenda. Some   immigration groups, however, have raised concerns over Cornyn’s reported circulation of an immigration bill that fails to fund the wall and mandate   drawing comparisons to 2013’s “Gang of Eight” amnesty bill. These concerns come on the heels of reports that expansion of the problematic   “investor” visa program might be included in a Cornyn sponsored bill. Alice Fisher, Assistant Attorney General of the DOJ Criminal Division under President George W. Bush, and Michael Garcia of the highest New York State Court, also reportedly interviewed for the directorship over the weekend, but no further progress on their consideration has been made public. It is also possible current acting FBI Director Andrew McCabe, a career Bureau man, will be put in the position on a permanent basis.  Some FBI officials have expressed serious concerns over this possibility, pointing to McCabe’s failure to report $467, 500 of donations to his wife’s state senate campaign from Democratic Virginia Governor and close Clinton ally Terry McAuliffe’s Political Action Committee. McCabe also refused to recuse himself from the investigation into Hillary Clinton’s emails over the scandal. Without an obvious   some Republicans have even suggested Barack Obama Supreme Court nominee Judge Merrick Garland to fill Comey’s post. While no word has been heard on his receiving an interview, several GOP officials have expressed their support. “I’m absolutely serious about it   …     If President Trump were to nominate Merrick Garland as FBI director, I think his nomination would be welcomed by people on both sides of the aisle in the Senate,” Sen. Mike Lee ( ) told Fox News’s Chris Wallace Sunday. Fellow Utah Republican Sen. Orrin Hatch also has suggested considering Garland. Rumors are swirling that Senate Majority Leader Mitch McConnell ( ) may also be supportive of Obama’s SCOTUS   taking the spot. His former    told Fox News, “I think the Senate majority leader thinks that’s a fantastic idea. ” Despite his appointment by President Bill Clinton and decidedly liberal views on some issues, Garland has sometimes been seen as a reliable vote in support of law enforcement during his time on the Appeals Court for the DC Circuit. He also worked as a federal prosecutor as both an Assistant United States Attorney and a Deputy Attorney General. Some    attorneys, however, are suggesting Stephen Markman, the four times   Chief Justice of the Michigan Supreme Court. “Unlike the top contenders, Markman is clearly in sync with the   agenda,” a   conservative lawyer with ties to the DOJ transition told Breitbart News. Markman’s history with Sessions runs deep. During the Reagan administration, he headed the DOJ’s Office of Legal Policy, which made the recommendation to President Ronald Reagan to nominate Jeff Sessions for a federal judgeship in 1986. Later, the two men would serve as fellow United States Attorneys  —   Sessions for the Southern District of Alabama, Markman for the Eastern District of Michigan. Markman wrote a scathing dissent from a 2011 Michigan Supreme Court decision that held illegal aliens could be considered a “vulnerable victim” class. The majority, which included Justice Robert Young, now on Trump’s “short list” for the U. S. Supreme Court, held that criminals who victimized illegals could be sentenced more harshly than those who harmed American citizens, because illegal aliens, due to their own crimes, would be reluctant to go to the police. The majority refused even to use the term “illegal alien” as Markman did, preferring the academic and media left’s “undocumented. ” Ann Coulter, star conservative author and   attorney, was superlative in her support. “Stephen Markman is brilliant, honest, and principled. He knows the law, and law enforcement, inside and out,” she told Breitbart News. “He clearly understands the ways of Washington, but is not part of the swamp,” Coulter said of Markman’s long career in government, “Only a man of total integrity can have that many jobs in the govt  —   as a true conservative  —   without even the hint of scandal and with the respect of liberals and democrats. ” “If Trump wants to make lemonade out of lemons, he will nominate Markman to replace the inept Comey,” Coulter said. “Trump owes Michigan, which is icing on the cake,” Coulter added.'"}, "time": 1742628544.8764179}