{"duration": 0.07258272171020508, "input_args": {"text": "'Posted on October 28, 2016 by Charles Hugh Smith \\nCentral banks are obsessed with boosting inflation, but the “why inflation is good” arguments make no sense for households being ravaged by inflation. The basic argument is that inflation makes it easier for debtors to service their debts. \\nBut this is only true if income rises along with costs. If income stays flat while costs rise, households lose ground–debt remains a burden as the purchasing power of income plummets. \\nCentral banks and the mainstream media make two fatal errors when discussing inflation. \\n1. They assume an inflation rate that lumps all costs/prices into one number is meaningful. But the “headline” consumer price index (CPI) is meaningless for two reasons: \\nA. The “headline” CPI is easily manipulated by underweighting sectors with double-digit cost increases such as higher education, rent and healthcare, and by gaming hedonics and other adjustments. \\nB. Households and enterprises that are exposed to sectors with double-digit cost increases experience inflation at rates that are far higher than those households and enterprises that have little to no exposure to soaring rents, healthcare premiums and college tuition. \\n2. They lump all inflation-adjusted household income into one “headline number” of median household income. This is a meaningless number because it combines the top 5% of households that are experiencing strong income gains in the “recovery” with the 95% of households experiencing stagnant or declining purchasing power. \\nIn other words, there is not one inflation rate or median household income, there are completely different classes of inflation and income. Americans in the top 5% with little exposure to the soaring big-ticket expenses of rent, healthcare and higher education are doing great, as their income/purchasing power is rising while their household budget is protected from 25% increases in rent, healthcare premiums, etc. \\nHouseholds with stagnant incomes that are fully exposed to the ravages of soaring big-ticket expenses are experiencing catastrophic losses of purchasing power (i.e. inflation) on the order of 8% to 12% declines annually. \\nTake a look at these charts: \\nA better measure of how households are doing is to compare GDP (gross domestic product) and wages: if GDP is rising but household incomes aren’t keeping pace with GDP, then households are doing worse–which is exactly what’s happened in the “recovery”: \\nThe share of GDP devoted to wages is another basic measure of household well-being: the wage/salary share of the economy has been declining for 45 years: \\nMeanwhile, the top 5% is riding high: notice how the spending of the top 5% has pulled away from the stagnant spending of the bottom 95% during the “recovery”: \\nAny household paying soaring healthcare premiums and co-pays is being crushed: \\nDitto for households experiencing double-digit rent increases: \\nRising inflation crushes the purchasing power of the bottom 95% whose incomes are not rising along with double-digit cost increases in big-ticket expenses. Central banks seeking to boost inflation are waging financial war on the bottom 95% of households.'"}, "time": 1742562162.1339386}