{"duration": 0.03076910972595215, "input_args": {"text": "'The editorial board of a Detroit newspaper wrote a frantic piece to its readers, calling President Donald Trump’s immigration plans “a moral stain. ”[The editors of the Detroit Free Press claim Trump’s promise to secure the   Border is an “attack America and American values”:  Trump’s vision for American immigration, egged on by a slew of   lawmakers, is an attack on America and American values —  on undocumented residents, sure, but also on the millions of American immigrants here lawfully. This kind of targeted enforcement marks out   Americans, regardless of immigration status, as different, other, suspect. It’s a clear demarcation of whom Trump and his cohort consider real Americans. The Detroit Free Press editorial board goes on to say that “the idea that a border wall would halt or even pause illegal immigration —  much less the idea that Mexico will volunteer payment for such a wall —  is absurd. ” However, Trump has proposed a 20 percent tax on imports coming into the U. S. from Mexico which would serve as a payment from Mexico for the border wall, as Breitbart News reported. Likewise, the claim that walls do not serve to secure borders has been challenged by the National Border Patrol Council, which has heralded Trump’s immigration plans, as Breitbart Texas reported. “We know we won’t have a wall along the 2, 000 miles of border,” the President for the Local 2455 of the National Border Patrol Council Hector Garza said. “What we will have is a wall where it is needed. That barrier with proper manpower, resources, technology and other tools will be effective. But most important, for the first time we have a president that wants to secure the border. ” The editorial board also wrote that Trump tapped into “bigoted fear” over immigration: But Trump gained a lot of his support by manipulating truth about America’s immigration challenges, by painting a picture of Latino and Muslim immigrants as, broadly, leeches and potential terrorists. That’s what his policies are about. That’s the bigoted fear he tapped into. The Federation for American Immigration Reform (FAIR) has found that illegal immigrants are somewhat of a drain on American   social services, costing about $113 billion for them to live in the country, as Breitbart Texas reported. Ending the editorial, the Detroit Free Press calls on residents and citizens to be a “resistance” to Trump, writing, “there is undoubtedly much more to come. Which means the protests over his early actions may need to take a turn toward another tactic: resistance. ” John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742562237.4140537}