{"duration": 0.05239748954772949, "input_args": {"text": "'This post was originally published on this site By Jeremiah Johnson Ready Nutrition November 3, 2016 \\nReadyNutrition Guys and Gals, “Old Man Winter” is starting to rear his ugly head. Yeah, so what? So there is a difference this year on three fronts. The first has to do with the weather itself, and the second is the situation in the U.S. and the world. Throughout history winter has been (at times) so severe as to cause large numbers of deaths and great hardships. Throughout history warfare has been conducted during the winter months after the harvest has been taken in. Between you and I, the harvest is being taken in, and the whole world has been on the brink of war for quite some time. The third front: in the U.S., with the election. \\nWeather, War, and Domestic Issues Could be a Recipe for Disaster \\nLet’s address the weather portion first. Think Progress posted an article on the polar vortex shift that will affect our winter considerably. The polar vortex is usually “confined” to an area around the North Pole. It is a gigantic, constantly-moving system of air that is circulating and swirling. As the site mentioned, the last polar vortex shift affected more than 200 million people in 2014. I can attest to the fact that I was one of them: in January of 2014, it was -26 Fahrenheit outside of my cabin, and never rose above -10 Fahrenheit for almost the entire month. \\nFrom the perspective of a global war, the Ukrainian-Russian situation is intensifying with the Ukrainian Army moving troops and equipment into Eastern Ukraine for operations against the separatists. As we speak, a Russian fleet is sailing toward Syria. The fighting in Syria between Assad’s forces and the Russian army and the Islamic terrorists is burning fiercely. The U.S. and Russia are facing off toward a nuclear war. North Korea continues to test missiles and threatens an EMP (Electromagnetic Pulse) and/or nuclear attack on the U.S. about once a week. \\nThat “third front” of the domestic situation in the U.S…. believe it or not, here is the highest potential for something bad to occur. Such is because Obama will think nothing of enacting Martial Law with either the advent of civil unrest and rioting, and/or a nuclear war. The volatility and unpredictability of the situation can be the undoing of the entire country. '"}, "time": 1742562030.3364608}