{"duration": 1.5423693656921387, "input_args": {"text": "'When Indira Islas was in third grade at Centennial Arts Academy, a public elementary school in Gainesville, Ga. she decided it was time to get serious. It was 2006, and she was in the lowest reading group in her class. She had been in that group since arriving two years earlier, speaking no English, in Gainesville, a city of 38, 000 just northeast of Atlanta’s booming outer suburbs. But being at the bottom went against everything she believed about herself. “I wanted to be with the smart kids,” she recalls. Starting the year before, in second grade, she read every volume of the “Magic Tree House” books in her   library, a series about two ordinary siblings who climb into their backyard treehouse and   to Pompeii, the Wild West, the ice age, feudal Japan and beyond. “I absolutely loved them,” she says. “It was like going on adventures all over the world. ” It was also the opposite of her own life. Indira left Mexico for the United States at age 6 with her parents and two younger sisters. Her mother cleaned houses when she wasn’t caring for the children  —   there would eventually be seven of them  —   and her father worked in construction, and there was no money for   lessons or soccer clubs, let alone traveling. “I’d hear about trips and experiences of my white friends, and I remember thinking: I’ll never go to the beach or Disney World for spring break,” Indira says. Her parents told her that education was all that mattered, and she had to spend all her free time inside, reading and writing. “I tell my children this country is a blessing to all the people living here,” her mother told me. “If you have the opportunity to be good, it’s very important to take it. ” Indira took this advice to heart. By the time she was in fifth grade, her reading skills had improved so much that she tested into the top reading group. By middle school, she consistently got A’s, which qualified her for a celebratory school trip every time report cards came out. “They rewarded us by taking us skating or bowling,” she says. “I felt like I was so smart, just getting the chance to go out for the whole school day with friends. That’s when I said: ‘I can make it. ’’u2009” Indira began to throw herself into everything. At recess, she played soccer and basketball, competing so fiercely that everyone took notice. Boys usually picked other boys for their teams, and white kids tended to favor other white kids. But everyone started picking Indira. In middle school, she was on the track team, running   races. Her coach was stunned by her determination. In meets, even when she won her event, she scolded herself unless she broke her previous record. After practices ended, she would keep running. “I wanted to think,” she says. “I’d stay after practice and run and run and run. ” Indira remembers understanding vaguely that it wasn’t just poverty that set her and her family apart. Her parents had been doctors in Mexico. She admired pictures in their dresser drawer of the two of them in their 20s standing together, tall and proud in their white coats  —   before they all fled the violence of drug gangs who were then taking over their home state, Guerrero. When she asked her parents why they were no longer doctors, they explained it was because they were not American citizens. It didn’t make sense to Indira. Why would her father have shed that beautiful crisp white coat for the fraying pants and shirts he now wore? Soon after Indira turned 13, in 2011, she was riding home from track practice with her mother when another car sideswiped the family’s Ford Expedition. The other driver, who was at fault, insisted on calling the police, according to Indira and a lawyer who assisted the family. Indira pleaded not to involve the police, explaining that her mother did not have a driver’s license because she was not an American citizen. (In Georgia and most other states, undocumented immigrants cannot obtain driver’s licenses.) But the driver said she needed a police report to get insurance to cover the damage to her car. A police officer arrived and asked for Indira’s mother’s license. When she said she did not have one  —   a state crime  —   she was told to get out of the car. Indira got out, too. She remembers two of her younger siblings sleeping in the back, one in a booster seat, one in a car seat. Two elders from the church they attended arrived to ask for mercy. She has seven children, they told the officer. He responded that he was simply enforcing the law. Indira’s mother turned to her and began to cry. “Indira, I don’t know what is going to happen,” she said. “They’re going to take me. ” Indira remembers remaining strangely calm. “When she was being handcuffed, I said: ‘Mom, everything is going to be O. K.’’u2009” Indira’s mother was held in Gainesville’s Hall County jail for three days, but that wasn’t the most frightening part for the family. Hall is one of four counties in Georgia that have a formal agreement to report arrests of undocumented immigrants to the Department of Homeland Security, which means that infractions as minor as a   bulb above a license plate can spiral into deportation proceedings. Indira’s mother says that her charge of driving without a license ultimately led to a referral to immigration court and a deportation order instructing her to leave the country within 30 days. She stayed, slipping into the shadows. Every day since, Indira says, she and her siblings have feared that their mother would be deported. It would take only one more traffic stop. “That woke me up,” Indira says. “Until then, I thought the world was happy. ” In fact, she now realized, it was only American citizens who seemed truly happy. “It must feel pretty good, I guess, to not have to worry about whether your family could be taken away any day. ” Indira has wanted to be a doctor for almost as long as she can remember. When she was 10, her family was shopping for groceries at Sam’s Club, and she spotted a large book about human anatomy. She became so excited about it that her parents bought it for her birthday, even though it was well above her reading level  —   and their price range. She began working her way through it, mesmerized, and when she got stuck, her mother would explain whatever had stumped her. She was determined to go to college and medical school and fulfill her parents’ interrupted dream. In her junior year, Indira began researching college options. She would be a strong applicant. She was consistently at or near the top of her class she was on the   track and soccer teams she volunteered over 1, 000 hours a year at the local hospital, a record in the history of the   program and she led her school’s chapter of the Hispanic Organization Promoting Education (HOPE) which encouraged Latino students  —   who made up just over half the district’s population  —   to stay in school and graduate. She was distressed to discover that Georgia barred undocumented immigrants from attending its top public universities and charged them    tuition at all others  —   triple the rate for citizen residents. She then turned to researching financial aid and learned that Congress barred her from accessing federal Pell grants, loans, scholarships and   jobs  —   the most common forms of assistance for   students. At first, she greeted this as just another set of obstacles to surmount, but as time went on, she began to despair. She would retreat to the classroom of her science teacher, Teresa Leach, who had become her mentor, in need of encouragement. “There were a couple of times when I just cried to her because I was tired,” she said. “I questioned myself if it was all worth the effort. ” All the while, Indira told me, she held onto her religious conviction that God had a plan, and that she must respect it. At a college fair attended by representatives of numerous Georgia colleges, she asked admissions officers what kind of help was available for undocumented students. No one had any to offer her. She switched her focus to private colleges and was admitted to Atlanta’s Agnes Scott, which she says awarded her $20, 000 annually in financial aid, less than half of what she needed. She researched   private scholarships and found two for undocumented students, but she was selected for neither. She was awarded seven small scholarships, which totaled $10, 000, enough to go to a nearby public commuter college for only one semester at the    tuition rate. Last May, Indira attended her graduation ceremony at Gainesville High School, but she had nowhere to go next. In every picture from that day, she wears a wide smile, but she was in pain inside, particularly when she caught a glimpse of her mother in the crowd, looking distraught. Unable to bring herself to celebrate with friends, she went home to be with her family. Days later, a friend told her about a philanthropic organization called TheDream. US, which was offering undocumented students full   scholarships to Delaware State University or Eastern Connecticut State University. The application was demanding, and only 76 students would be chosen. She poured herself into the essays, spending hours composing them alongside an English teacher, Cindy Lloyd. She applied to Delaware State, a historically black college in Dover, five hours closer to home than Eastern Connecticut. In late June, she received an email from TheDream. US. “I saw ‘Congratulations,’’u2009” she remembers, “and I read no more. ” In late August, Indira made the   drive with her parents from Gainesville to Delaware State in unusual silence. She was thinking hard about each of her six younger siblings, wondering how they would fare without her. Over breakfast at a Cracker Barrel in South Carolina, when her mother pressed her about how she was feeling, she talked only of her concerns about not being at home to help everyone. When she arrived on campus  —   a flat expanse of grassy courtyards and buildings amid strip malls, auto dealers and chain restaurants just beyond Dover’s historic capital area  —   she found 33 other “opportunity scholars,” just as worried and hopeful as she was. All of them were assigned to a dorm about a quarter of a mile from the D. S. U. campus, a former Sheraton hotel acquired a few years earlier by the university as part of an expansion. They bonded instantly, traveling as a posse from classes to the library to the cafeteria, often ending up together late at night in the dorm lobby or in a lounge that had been a large hotel suite on the second floor. In their first month on campus, the opportunity scholars were invited to a welcoming ceremony in the school’s Martin Luther King Jr. Student Center with Gov. Jack Markell the Democratic senator Tom Carper Donald Graham, a founder of TheDream. US and D. S. U. ’s president, Harry Williams. “This is not just an opportunity for you it is an opportunity for the state of Delaware,” Markell told them. “It is sad to see your own home state reject such talent and potential. ” He pronounced himself “thrilled that you’re here. ” It was the first time many of the students could recall being welcomed anywhere. “We felt rejection our whole lives from our own states,” Indira said. “We were here only three weeks, and we already met the governor and the senator. It felt like saying ‘Haha!’ to Georgia. ” Of the 34 opportunity scholars enrolled at D. S. U. 28 are from Mexico and one each is from Ecuador, El Salvador, Peru, Gabon, Gambia and Trinidad and Tobago. Their families are a composite portrait of the economic forces that have drawn undocumented immigrants to the nation’s small towns and metropolitan heartland. Their parents work in poultry plants, on factory lines, in warehouses, on construction sites, in restaurants they clean and paint houses and schools, tend gardens. “They make everything look perfect for the tourists,” Yulma Lopez, who left Mexico at age 3, said of her parents’ work for a landscaping company in Charleston, S. C. Almost all their parents work illegally, but many pay income taxes, having obtained federal   numbers. And some, including Indira’s father, have secured temporary federal permission to work and drive lawfully. While most of the students are 18 or 19, typical for college freshmen, some have worked for years in hopes of one day saving enough for college. Olivia Bekale, who is 27 and grew up in Baton Rouge, arrived in Louisiana from Gabon as a child. She graduated from high school in 2008 with a 3. 9 G. P. A. from the Louisiana School for Math, Science and the Arts, a prestigious   boarding school for top achievers. Unable to afford college, she cycled from one   position to the next  —   server at the Melting Pot, a fondue restaurant retail sales consultant for Sprint   agent for Marriott pharmacy tech for Walgreens. Olivia, who had wanted to be a doctor since an aunt died of AIDS when she was 5, had been out of high school for eight years when she learned of the opportunity scholarship she applied immediately. All but one of the students were enrolled in the Deferred Action for Childhood Arrivals program, also known as DACA. Created in 2012 by an   executive action, DACA allowed teenagers and young adults who came to the United States illegally as children with their parents to register with the government and in turn receive a   renewable protection against deportation, along with work permits and Social Security numbers. Most of the students, like Indira, signed up at age 15, as soon as they were eligible. With DACA, Indira, who is now 18, was able to get a driver’s license and a job at a Publix supermarket when she was in high school, working 20 hours a week as a cashier and bagger. Being able to work and drive legally, free of the fears her mother faced, and fitting in with her classmates, Indira says, was “living the American dream. ” With her income from Publix, she even was able to get braces for her teeth. The starting point for all of their dreams was education, and the quest for it has been central to the experience of undocumented young people since long before Indira and her classmates were born. In the late 1970s, when undocumented immigrants had yet to move in large numbers beyond border states, Texas passed a law authorizing local school districts to ban them from public schools or charge them tuition. In a landmark decision in Plyler v. Doe in 1982, a narrowly divided Supreme Court struck down the law, finding that undocumented children had a constitutional right to free    public education. The opinion blamed a dysfunctional immigration system for creating the crisis by failing to keep out undocumented immigrants or provide them a path to citizenship. “Already disadvantaged as a result of poverty, lack of   ability and undeniable racial prejudices, these children, without an education, will become permanently locked into the lowest socioeconomic class,” Justice William Brennan wrote for the majority, quoting the   opinion. The case also introduced the argument that undocumented children were legally blameless, unlike their parents: “The classification at issue deprives a group of children of the opportunity for education afforded all other children simply because they have been assigned a legal status due to a violation of law by their parents,” Justice Lewis Powell wrote in a concurring opinion. Undocumented children poured into the nation’s schools over the next generation, and as they reached college age, they coalesced into a movement, advocating access to higher education as well as full citizenship. In 2001, they began calling themselves Dreamers, now an estimated 2. 1 million young immigrants who have grown up as Americans in almost every way except for their passports. The name came from the Dream Act (Development, Relief and Education for Alien Minors) introduced in Congress in 2001 by Senator Richard Durbin, a Democrat from Illinois, and Senator Orrin Hatch, a Republican from Utah, and for which activists fought for over a decade. The measure, which would have put undocumented children on a path to citizenship, never passed, but the vast network of Dreamers became a compelling political force. In 2001, hundreds of them turned out to testify in Texas in favor of legislation to allow undocumented residents to pay   college tuition if they graduated from Texas high schools and lived in the state for three years. “Something magical happened when those kids told their stories,” says the former Texas state representative Rick Noriega, a Democrat who sponsored the bill. “It was a humanizing of a very real issue dealing with children’s dreams and hopes. Every heart on that committee was touched, Republicans and Democrats. ” The legislation passed both houses almost unanimously and was signed by Rick Perry, then governor of Texas and now President Donald Trump’s pick for energy secretary. Texas became the first state, followed quickly by California, to allow Dreamers to pay   tuition. Today, 21 states charge Dreamers the same tuition as legal residents, including six carried by Trump  —   Florida, Kansas, Nebraska, Oklahoma, Utah and Texas. In many of those states, however, the   issue has turned politically treacherous. In Texas, efforts to repeal the tuition law come closer to passing every year, and Noriega says there is no chance the original measure would pass today. The leading national opponents of   tuition for Dreamers include the Republican senator Jeff Sessions, Trump’s choice for attorney general, and the secretary of state of Kansas, Kris Kobach, a Republican who was a leader of Trump’s transition team on immigration. Each argues that students who are in the United States illegally should not get a public benefit in any state that is denied to a citizen from another state. In other words, if Dreamers pay   tuition in Texas, citizen students next door in Arkansas and Oklahoma  —   or Massachusetts, for that matter  —   should have the same right. “How much sense does that make, to have people here illegally, and they have more benefits than those who are here legally?” Sessions asked in a Senate floor statement. Kobach used the same argument to bring   lawsuits against   tuition for Dreamers in Kansas and California. Judges found no legal basis for the claims and dismissed the cases. The larger debate over how to treat an estimated 11 million immigrants who came here illegally has been at a stalemate for decades, with advocates seeking a “path to citizenship” for   families who have been in the country for years and opponents denouncing “amnesty” for people who broke the law to enter the country. Amid hardening resistance in Congress to immigration reform, Dreamers brought pressure on Obama  —   including   and hunger strikes at his 2012 campaign offices  —   to use his executive power to create DACA. The program, announced on June 15, 2012, the 30th anniversary of the Supreme Court’s Plyler decision, proved transformative for Dreamers. They have entered college, taken    jobs, received driver’s licenses, bought cars. They now fly on planes, passing effortlessly through airport security. They still lack legal immigration status, but no longer are they exactly undocumented. “DACAmented,” many have called themselves. Even in states where they pay   tuition, Dreamers still struggle to afford college because they are disproportionately   and have no access to federal financial aid. Fewer than 10 percent of Dreamers who graduate from high school enroll in college. At a time when college graduates earn 70 percent more than those without degrees, these numbers conjure the 1982 warning by the Supreme Court that undocumented children could become a permanent underclass. In response, a handful of philanthropies have adopted the cause of sending students with DACA status to college. The biggest of these, TheDream. US, has raised $90 million to eventually finance 4, 000 students at public colleges, with significant contributions from Donald Graham, former publisher and chief executive of The Washington Post, and his family Mark Zuckerberg and Priscilla Chan Bill and Melinda Gates the   executive William Ackman and Michael Bloomberg, among others. (I was a reporter at The Washington Post from 1980 to 2008.) In 2014, TheDream. US began offering Dreamers full scholarships in states that charge them   tuition. Last year, in partnership with Delaware and Connecticut, the organization created the   program for students from the other 29 states, financed by $41 million in philanthropy from Graham and his family and two anonymous donors. The governors of Delaware and Connecticut agreed to charge roughly   tuition rates for the 34 scholars at Delaware State and the 42 at Eastern Connecticut State  —   a total of $80, 000 per student for tuition, room and board for four years. In an effort to   political opposition, Graham says, the philanthropy works only with schools, like Delaware State and Eastern Connecticut State, that have excess capacity, so that undocumented students are not displacing citizens. And private donors pay all expenses, so that no state dollars are spent. Still, when The Delaware State News ran an article in September about the D. S. U. opportunity scholars, the online comments complained that undocumented immigrants, not citizens, were benefiting. “Trump isn’t perfect, but I will vote for him because he puts Americans FIRST,” wrote a reader named John Huff of Magnolia, Del. “There are plenty of kids who are citizens who have the same dream and should come first. ” And as news of the scholarship spread on the Delaware campus this fall, a number of   students told Dreamers that they resented that their own families had to go into debt for a portion of their education costs while the DACA students got full scholarships. By then, Trump had mobilized   anger in large swaths of the country, having kicked off his campaign criticizing Mexican immigrants  —   “They’re bringing drugs. They’re bringing crime. They’re rapists”  —   and vowing to build a wall on the border to keep them out. In stump speeches, he promised to deport all 11 million undocumented immigrants and, in his first 100 days in office, to terminate DACA, labeling it “illegal amnesty. ” Both vows became instant applause lines. Indira declared her major in biological sciences at the beginning of the semester and started a demanding   curriculum with six classes, including biology and chemistry, both requiring labs. Her parents had insisted she not take a job, in order to devote herself to education, freeing up four hours a night that she had spent working in high school. With that extra time, she found the academic challenges manageable. Much harder was living apart from her   family for the first time in her life. Her mother texted her daily. “Good morning, hija,” she wrote one recent morning, using the Spanish word for daughter. “May God bless you today in school. Please be kind to everyone. ” That night, over FaceTime, Indira talked with two of her younger sisters, who like her were born in Mexico and are undocumented. One, a junior in high school, is already on a quest for college scholarships. She and Indira came up with potential essay ideas and discussed her résumé. Then Indira helped the other, a freshman who is the smartest of all the family’s children, Indira says, with physics homework. On weekends, she FaceTimes with her four youngest siblings  —   a sixth grader, a fourth grader, a third grader and a first grader  —   all of whom were born in Georgia and are citizens. Separation from family, from home, even from Mexican food made most of the opportunity scholars profoundly lonely. Estephany Martinez, a petite   major with long black hair, couldn’t stop thinking about her sisters in the first weeks. “Whenever we came home from school, all four sisters would sit in the living room and do our homework and talk and watch TV,” she recalled wistfully of her life in Winder, Ga. In Delaware, “I didn’t have anybody that cared for me. I didn’t have anyone to come home to. ” In early September, she summoned all the scholars to a gathering in the dorm’s   lounge. “All right, you guys, we’re going to be here for each other,” she said. “That part of our lives  —   being undocumented  —   is critical to who we are. We have to share our stories. ” Everyone crowded in, sitting on the sofa, spilling onto the floor, sitting shoulder to shoulder on counters that once were part of a kitchenette, sprawling into one another’s space. Carlos Gonzales of Manteo, N. C. a lanky and cheerful marketing major whose mother is a restaurant cook, broke down crying when he recalled the violence that drove his family from Mexico City. He, his mother and his younger sister moved to North Carolina when he was 7. It was his mother who encouraged him, beginning in elementary school, to reach for college. “I don’t want you to live the life we’re living now,” she told him. In high school, he was an honor student and varsity wrestler and runner, working nights and weekends at McDonald’s in his Outer Banks town. When he received the email telling him he was an opportunity scholar, he said: “I hugged my mom and cried for two hours. The only reason I stopped was I had to go to work. ” Indira told the harrowing story that led to her own family’s departure from Mexico. In 2004, when she was 6, three masked gunmen broke into their home, which housed her parents’ clinic, and robbed them of everything  —   money, jewelry, a new computer, a television, cameras and medications. They filed a report with the police, they said, who didn’t investigate, in deference to cartels then taking over Guerrero, now the most violent state in Mexico. An uncle of her father’s already had been killed. In subsequent years, a cousin of her mother’s, a veterinarian, was kidnapped and never found. Two nephews disappeared. Her mother’s sister has been kidnapped twice  —   most recently this past November  —   and returned only after her family paid steep ransoms. Weeks after the robbery, Indira’s family of five arrived in the United States on a tourist visa that her father procured a month earlier in hopes of taking everyone to Disney World. Instead, they went to Gainesville, where her father’s brother worked in construction  —   one of thousands of Mexican workers who flocked to the north Georgia community in the last 25 years, swelling the Hispanic population to more than 40 percent in 2013 from 8 percent in 1990. Indira said her parents are certain they would have been killed had they stayed. They decided to forfeit their careers for their family’s safety. “I no longer saw my future, but I saw my children’s future,” her father said to me. Antonio Patino, a   major who is a lifeguard and plays bass and guitar in his spare time, told the group about riding with his family in their car in 2015 in Lawrenceville, Ga. when a police officer pulled them over, though none of them understood why. His father, who is undocumented and processes returns for a local manufacturer, was driving but did not have a license. Antonio and his mother, younger sister and brother all watched in terror as his father was handcuffed, placed in a police cruiser and driven off to jail. As it turned out, he was released the next day after paying a fine of more than $800 and was not referred to immigration court for further proceedings, but the incident shook Antonio’s sense of belonging in America. “I felt like I got slapped in the face just for living, trying to be a normal person in this beautiful country,” he said. “It feels like a hole inside me. ” He said he now found himself gripped with fears for his parents’ safety at random moments during his days at D. S. U. It is as if he has swapped roles with his mother and father. “Like I’m now the parent and they’re the child, and I’m worried for them,” he told me. “Not being there, all these   swarm into my mind. What if out of nowhere they get pulled over again?” Calling them and hearing their voices usually comforts him. But after one such call, he said: “I went outside, and I had to cry a little. I was feeling like I couldn’t help them. ” A number of students shared the enormous sacrifices they had seen their parents make for them. Juan Chavez, 23, who grew up in Plymouth, Ind. and worked for five years after high school, told of his mother suffering a breakdown after her divorce from his father. He saw it as a response to the crushing instability of their lives, moving from one home to another in search of shelter. “She’s the strongest person I’ll ever know,” he said. “She’s my role model. My father figure as well as my mother. ” He continued: “I felt so helpless to make things better. I decided almost right then I’ll go to college and medical school if it takes me the rest of my life. ” He is now a psychology and   major, intending to become a psychiatrist. On and on the students went until almost 3 a. m. the common threads in their stories drawing them closer. It was the first time most of them had talked openly about being undocumented, but instead of feeling exposed, they felt safer. Until then, Antonio had gone out of his way to avoid conversations with   at D. S. U. about his scholarship, not wanting to have to explain that he got it because he was undocumented. The next day, though, he fell into conversation with a student who asked him how he happened to come all the way from Georgia to D. S. U. and he said without hesitation: “I got a scholarship. ” “What for?” “I’m undocumented,” Antonio said, surprised at how comfortable this felt. “O. K. man, that’s cool,” the student said. After their long night talking, the scholars also better understood what had propelled them all for as long as they could remember. Throughout high school, the opportunity scholars watched undocumented friends and siblings give up and drop out, shamed and beaten down by public scorn over illegal immigration and the   options awaiting even those who excelled in high school. But they kept on striving, steeled to the insults, positioning themselves for a breakthrough they couldn’t yet see. Now this all made sense. “This pain  —   it pushes us,” Estephany said. “It’s motivation. It has made me who I am. It makes me go through every day. ” “Now we know what drives us,” Indira said. One morning in   at 9:50 a. m. 10 minutes before Indira’s   class was scheduled to start, she and two other opportunity scholars were already ensconced in the three center   seats, notebooks, pens and textbooks at the ready. Indira was wearing a Harvard sweatshirt that a classmate bought for her when their   A. P.  class visited Boston. (Indira couldn’t afford to go.) “I’m going to get there one day,” she said with a confident smile. Most of the other students didn’t arrive until class was about to begin  —   or later  —   and there was little competition for the front rows. A similar scene unfolded that morning in the ultramodern science center, in   class, where Antonio and Jose Reyes Rios, another   major, sat front and center with an   classmate named Hanqaamo Lintisio, who is from Maryland and has a track scholarship. The three had formed a study group and tutored one another so effectively that they all scored above 100 on the midterm. (They nailed the bonus question.) Theirs were the only A’s in the class. The Dreamers gather daily at a long Formica table in a D. S. U. cafeteria for food and conversation. At lunch, Carla Moreno propped her English composition textbook, “Patterns for College Writing,” against a napkin holder, securing it with an apple. She paged through a chapter while eating her salad and chili dog. “It’s just a quiz,” she said, “but I want to keep my A. ” “I deal with a lot of students, and I feel like the Dreamers are at a different level,” says Kevin Noriega, the adviser for their scholarships. “They’re saying, ‘I’ve got to make this happen because it’s my only option. ’’u2009” Of the 488 scholars funded by TheDream. US who began college in 2014, 94 percent remain enrolled after their sophomore year research shows that only 66 percent of   college students nationally return after one year. “This is a   population with retention rates like Harvard’s,” Donald Graham says. Because beneficiaries of TheDream. US have full rides, they avoid a common problem faced by other disadvantaged students: running short of money for costs not covered by Pell grants or other forms of aid. One night in October before a biology exam, Indira went to the D. S. U. athletic center for a workout to relieve stress. She was armed with a stack of homemade flash cards and her iPhone, on which she had downloaded discussions of test topics from various websites. While pounding out three miles on the treadmill, she flipped through her study cards, then plugged in her earbuds for a YouTube lecture on glycolysis. Returning to her dorm, she sat down at her desk for a final review. Hanging on the wall in front of her was a collage of family photographs. One showed the whole family of nine around their dinner table. “When I’m struggling, I look at a picture of my mom or dad, and I say, ‘I’m working for that person,’’u2009” she said. That night, her studying complete, she took a last look at her parents’ picture and fell asleep listening to recordings of her biology professor’s lectures. She got an A on the exam. Indira’s determination to become a doctor requires more than a little imagination, because under current law in Georgia and many other states, licenses to practice medicine are reserved for citizens and legal residents. “I’m not planning my life based on the way things are today,” she said. “I’m thinking of the future. ” In her eyes, America is a land of   opportunity. Over Columbus Day weekend, she visited Washington for the first time with her roommate, Karen Baltazar, who is from Lawrenceville, Ga. and also wants to be a doctor. At the Franklin Delano Roosevelt Memorial, Indira stood underneath Roosevelt’s Four Freedoms  —   freedom of speech, freedom of worship, freedom from want, freedom from fear  —   her arms raised high above her head, as if exulting in the message. Her smile was radiant. Karen snapped a picture, and Indira posted it on her Facebook page along with the caption, “I have never forgotten the reasons my parents brought me to this great country. ” Such unsinkable optimism, which I heard from many D. S. U. Dreamers in the early fall, is hard to maintain, and many of the estimated 65, 000 undocumented immigrants who graduate from high school every year  —   and thousands who drop out  —   simply can’t muster it. In a recent book, “Lives in Limbo,” Roberto G. Gonzales, an assistant professor at Harvard’s graduate school of education, writes that academically successful Dreamers are far outnumbered by those who become casualties of “the deeper and more   consequences of being undocumented: living in poverty, having parents and family members who also bear the burdens of being undocumented, watching friends moving forward but being unable to join them, watching opportunities pass you by, navigating a world of exclusions while constantly looking over your shoulder. ” At least some of the opportunity scholars’ optimism last fall came from their assumption, based on reported polls, that Hillary Clinton would be the next president. They were heartened by her speeches about keeping families together and pursuing comprehensive immigration reform. At the very least, they were confident that DACA would remain in effect under her leadership. Though they didn’t believe Trump could win, he unnerved them with his speeches branding Mexicans criminals who stole Americans’ jobs and lived off their tax dollars. They took this rhetoric as a personal affront and were horrified by the hatred they saw on the faces of those who cheered his words. “The only thing that depresses me is so many people support him,” Jose Reyes Rios, the   major, who aspires to work at Google one day, said in late September. On election night, a group of Dreamers gathered around the   TV in the dorm lobby, many of them studying as they watched returns. Indira had exams the next day in math and biology and arrived equipped with her flash cards. The mood turned dark after Trump won Florida. Everyone’s mind flooded with his vows that they had discounted until now  —   to revoke DACA, to deputize local police departments to enforce federal immigration laws. “We will issue detainers for all illegal immigrants who are arrested for any crime whatsoever, and they will be placed into immediate removal proceedings,” Trump said last summer in Arizona. As all of them knew well, these crimes included one of their parents’ daily activities  —   driving without a license. If DACA disappeared, and with it their Social Security numbers, their own driver’s licenses would be worthless. So would their federal work authorization, meaning most would lose the jobs that paid for their books, phones, clothes, travel home and anything else they needed. By 1 a. m. Indira became too distressed to concentrate. Olivia Bekale was one of four opportunity scholars who watched until Trump was declared the  . “We were just looking at each other and crying,” she says. “We hugged each other and went to our rooms. ” On the Sunday after the election, when they gathered in the dorm lobby, the opportunity scholars were struggling with something unfamiliar: despair. They had registered for DACA with the Department of Homeland Security, which now knew exactly where they were. “Life is going to be like it is for our parents,” said Victor Hernandez of Coats, N. C. stunned and shaking his head. “They could come pick us up and take us away any time. ” Social media brought aftershocks for all of them as they discovered that many of their best friends voted for Trump. Almost all of Antonio’s   swim teammates in Lawrenceville had Trump filters on their Facebook and Snapchat profile pictures. “All I could think was: You voted against me,” he said. “What did I do to you?” The day after the election, Indira couldn’t bear to call her mother until the afternoon. Instead, she confided her fears in text messages to her former science teacher, Teresa Leach. “I’ve never been so disappointed in this country,” she wrote. “I’ve never felt so powerless. . .. I’m scared about my family, my mom. . .. Not sure if I’ll even get my degree, much less go to medical school here. ” When Indira finally did call home, her mother insisted she was not afraid and told Indira that education was now even more important. Several of Indira’s friends back home told her they doubted Trump would follow through on all his campaign promises, and in any case, they couldn’t imagine he would target her. “These are people who helped me get to where I am, who remind me they love me, and I love them,” she said. “But they’ll never understand what we feel. They say, ‘He won’t do that.’ Do they think he’s going to send back all the immigrants except Indira?” A lifeline of sorts arrived the week after the election, when the students received letters from TheDream. US, Governor Markell and the president of D. S. U. pledging to stand behind their scholarships no matter what became of DACA. Donald Graham lined up attorneys to represent them if anyone challenged their right to be in school. But their bigger fears were for their parents. Antonio and Indira went home for Christmas to find their families filled with trepidation. “We’re trying to be invisible, trying to stay hidden,” Antonio’s father said, “do only the things we have to do to live, like go to work, go buy groceries. ” During the 2015 holiday season, they took a driving tour of the Christmas lights and celebrated New Year’s Eve in downtown Lawrenceville. “Now we can’t go to any festivities because for us it’s very dangerous,” his mother told me in their apartment in a complex in Buford, Ga. “There are a lot of police there. ” Antonio’s father said he worries about driving his daughter, Litzy, 15, home from her   practice at rush hour, when the police presence increases. Litzy was born in Georgia, and he thought of asking her to leave the team until she is old enough to drive because, as a citizen, she will be able to get a driver’s license. “But then I said to myself: ‘No! That’s crazy. That’s why we’re here  —   for our kids. So they can take advantage of every opportunity. ’’u2009” He continues to ferry her  —   carefully  —   during rush hour. Indira found her mother more frightened than at any time since receiving her deportation order. Her mother says she has no choice but to drive when someone at her church asks for help, when her children call for rides home and when she is needed at a charity medical clinic where she volunteers as a doctor’s assistant and translator. “Life changed after the election,” she told me in December, in her living room decorated with framed academic awards for each child. She was surrounded by her kids, who listened carefully. “The children know I don’t have a driver’s license. They know at any time maybe the police will take me again. ‘If I can’t come back,’ I tell them, ‘you have to go to school every day. You have to study hard  —   even harder. ’’u2009” By the time Indira and the other opportunity scholars returned to campus in January, all of them had come to the same conclusion: There was now only one thing they could control  —   their education. “The only way we can fight back is to excel in school,” Indira wrote to me in a text message. She felt weary in the aftermath of the election, but when she had this epiphany, she said: “I wasn’t tired anymore. I had that drive, that hunger to just come out on top. I was angry. I was staying at the library longer, going to the gym a lot more. ” Estephany Martinez focused on her life’s mission. “My goal is being a police chief  —   something that makes my voice louder,” said the   major. “I have to educate myself to get there. I want to show people who don’t believe in us: ‘I got all the way here. I’m starting from the bottom with education, and I’m going to get there. ’’u2009” As they settled into the semester, they monitored everything Trump and his close allies were saying about immigration, their moods shifting with each utterance. Back in December, they felt hopeful when Trump, in his interview as Time Magazine’s Person of the Year, said approving things about Dreamers and indicated that he would deport serious criminals before other undocumented immigrants. They were discouraged in January when Jeff Sessions, in his confirmation hearing to become attorney general, appeared unconcerned about the consequences of revoking DACA. They took heart two days later when Paul Ryan, the speaker of the House, said in a CNN   meeting that he wanted Congress to pass legislation making Dreamers “right with the law. ” Indira and other Georgia scholars were exhilarated in early January when a state court ordered the Board of Regents to allow DACA holders to pay   tuition. But their hopes collapsed when a state appeals court stayed the decision Trump appeared likely to revoke DACA before Georgia Dreamers could reap the benefits. “I said: ‘I don’t know what’ll happen next, but we’re here in this place, and the only way we can win is to succeed in our education,’’u2009” Indira told me. Soon after classes started, the opportunity scholars learned that their collective grade point average for the first semester was a 3. 76. Six of the 34 students had achieved a perfect 4. 0. Indira was one of them. “Succeeding for me is how I can get my revenge,” she told me over the phone, interrupting her biology homework for a few minutes. “I want to break the stereotype of us being here taking jobs away and not helping the economy. I want Trump to see we’re the total opposite of what he thinks. ”'"}, "time": 1742562460.367999}