{"duration": 0.06827759742736816, "input_args": {"text": "'Maduro declara en \\'sesión permanente\\' al Consejo de Defensa de la Nación   23:15 GMT \\nLuego que el Gobierno venezolano acusara al Parlamento de promover un golpe de Estado, se activa este mecanismo constitucional para la defensa de la soberanía. Reuters   \\nNicolás Maduro Moros , presidente de Venezuela, valiéndose del artículo 232 de la Constitución de este país latinoamericano, declaró en \"sesión permanente\" al Consejo de Defensa de la Nación, según el diario \\' Correo del Orinoco\\' . \\nEl mandatario se dirigió a su país desde el Palacio de Miraflores, sede de la Presidencia, donde convocó \"con la mayor fuerza de mi alma al diálogo\", informa \\'Panorama\\' . \\nMaduro \"lamentó que el presidente a la Asamblea Nacional (AN), Henry Ramos Allup, no haya acudido a la primera reunión\", ya que por ley, está \"obligado\" a presentarse junto con los representantes de los otros poderes públicos. \\n\"Lamento mucho que el presidente de la Asamblea Nacional continúe en desacato con la Constitución y no quiera dialogar. Continúa empleando un verbo de intolerancia y odio\", expresó Nicolás Maduro. \\nRefiriéndose al actual enfrentamiento que mantiene la Asamblea Nacional de Venezuela con el resto de los poderes públicos, explicó que la Constitución está \"pensada para el equilibrio de los poderes públicos\". \\nLa primera vez que se activó este Consejo de Defensa de la Nación fue en el año 2015, cuando la administración de Barack Obama, declaró que Venezuela era \"una amenaza inusual y extraordinaria para la seguridad de Estados Unidos\". \\nVale recordar que el gobierno bolivariano acusó al Parlamento de orquestar un golpe de Estado al estilo de Brasil. \\nEl artículo 323 de la Constitución venezolana y que sirve de argumento a Maduro dice textualmente: \"El Consejo de Defensa de la Nación es el máximo órgano de consulta para la planificación y asesoramiento del Poder Público en los asuntos relacionados con la defensa integral de la Nación, su soberanía y la integridad de su espacio geográfico. A tales efectos, le corresponde también establecer el concepto estratégico de la Nación. Presidido por el Presidente o Presidenta de la República, lo conforman, además, el Vicepresidente Ejecutivo o Vicepresidenta Ejecutiva, el Presidente o Presidenta de la Asamblea Nacional, el Presidente o Presidenta del Tribunal Supremo de Justicia, el Presidente o Presidenta del Consejo Moral Republicano y los Ministros o Ministras de los sectores de la Defensa, la Seguridad Interior, las Relaciones Exteriores y la Planificación, y otros cuya participación se considere pertinente. La ley orgánica respectiva fijará su organización y atribuciones\".'"}, "time": 1742564173.5472355}