{"duration": 0.246124267578125, "input_args": {"text": "'Å finne en syndebukk av Thierry Meyssan I Berlin gjorde Tyskland, Frankrike, Russland og Ukraina et forsøk på å greie opp i konfliktene i Ukraina og Syria. Men fra Russlands synspunkt eksisterer disse blokadene kun fordi de er et påfunn fra De Forente Stater. De er ikke noe forsvar for demokrati, slik USA skryter av selv. De er der for å hindre utviklingen i Russland og Kina og for å få slutt på Silkeveien. Siden de nå disponerer konvensjonell overlegenhet gjorde derfor Moskva alt de kunne for å knytte Midt-Østen til Øst-Europa. De greidde det ved å bytte ut en utvidelse av våpenhvilen i Syria med å få slutt på blokaden av Minsk-avtalen. Mens Washington fremdeles prøver å laste all sin skyld over på sine allierte. Etter å ha feilet i Tyrkia, har CIA nå vendt seg til Saudi-Arabia.\\nVoltaire Network | Damaskus (Syria) | 26 octobre 2016 français Español русский Deutsch English Türkçe Português ελληνικά italiano Konflikten der Russland og Kina er i opposisjon til De Forente Stater utvikler seg på to fronter. På den ene siden leter Washington etter en mulig syndebukk som skal bære ansvaret for krigen mot Syria. Og på den andre siden har vi Moskva som allerede er knyttet til situasjonen i Syria og Jemen. De prøver nå å knytte dem til spørsmålet om Ukraina.\\nWashington vil ha en syndebukk For å frigjøre seg fra sitt engasjement uten å miste ansikt, har USA måttet skylde på en av sine allierte for sine forbrytelser. De har tre muligheter - det er å skylde på Tyrkia, Saudi-Arabia, eller begge. Tyrkia er til stede i Syria og i Ukraina, men ikke i Jemen, mens Saudi-Arabia er til stede i Syria og Jemen, men ikke i Ukraina.\\nTyrkia\\nVi skal nå komme med den verifiserte informasjonen om hva som virkelig hendte i Tyrkia den 15. juli. Disse opplysningene tvinger oss til å revidere vårt første inntrykk.\\nFørst av alt, det begynte da Tyrkia skulle ta seg av jihadist-hordene etter angrepet som såret den saudiske prins Bandar bin Sultan, det var ikke uten problemer. Mens Bandar var en lydig mellommann, fulgte Erdogan sin egen strategi om å gjenskape det 17. tyrkisk-mongolske imperium. Det fikk han til ved å bruke jihadistene til sitt oppdrag.\\nI tillegg til dette kunne USA ikke unngå å kreve sanksjoner mot president Erdogan for å blande sitt land økonomisk sammen med Russland mens han fremdeles var et militært medlem av NATO.\\nTil slutt, med krisen i strukturen om verdensmaktene, ble Erdogan den ideelle syndebukken for USA for å frikjenne seg selv i Syria-krisen.\\nFra USAs synspunkt er ikke problemet Tyrkia, som er en uunnværlig regional alliert, heller ikke Hakan Fidans MIT (de hemmelige tjenestene) som organiserer verdens jihadist-bevegelser, men Recep Tayyip Erdogan selv.\\nSom en konsekvens prøvde National Endowment for Democracy (NED) først av alt å få til en fargerevolusjon i august 2013. De organiserte demonstrasjoner i Cezi-parken i Istanbul. Enten mislyktes planen, eller USA forandret mening.\\nDet ble tatt en beslutning ved avstemming om å styrte islamistenes Justice and Development Party (AKP) (Erdogans parti overs.). CIA hadde organisert People’s Democratic Party (HDP) til et minoritetsparti, og forberedte også en allianse mellom dem og sosialistene i Republican People’s Party (CHP). HDP vedtok et vidt program til forsvar for etniske minoriteter (kurderne) og sosiale minoriteter (feminister og homoseksuelle) og inkluderte et økologisk kapitel. CHP ble reorganisert av to grunner - å dekke over overrepresentasjonen av Alevis (en mystisk gren av islam overs,) i partiet, og med en tanke om å fremme kandidaturet til eks-presidenten i høyesterett. AKP tapte valget i juli 2015, men det viste seg umulig å få til en allianse mellom CHP og HDP. Som et resultat ble det holdt en ny runde med valg i november 2015, men det ble brutalt manipulert av Recep Tayiip Erdogan.\\nWashington bestemte seg derfor å fjerne hr. Erdogan. Tre drapsforsøk ble gjort mellom november 2015 og juli 2016. I motsetning til det som er blitt rapportert, var ikke operasjonen den 15. juli 2016 et forsøk på statskupp, men et forsøk på å fjerne Erdogan alene. CIA brukte tyrkisk-USA industrielle og militære forbindelser for å rekruttere et lite team innenfor luftforsvaret for å henrette presidenten mens han var på ferie. Men dette teamet ble forrådt av islamist-offiserer (som representerte nesten en fjerdedel av hærens personell). Og presidenten ble advart en time før kommandogruppen ankom. Han ble derfor overført under beskyttelse av en lojal militæreskorte.\\nDe var klar over de overskuelige konsekvensene av sine feil, allikevel gjennomførte konspiratørene sitt statskupp uten noen forberedelser og mens gatene i Istanbul fremdeles var fulle av folk. Åpenbart nok mislyktes de. Den undertrykkelsen som fulgte var ikke bare bare å arrestere de som hadde stått bak mordforsøket, ikke bare soldatene som hadde samlet seg for å improvisere statskuppet, men alle USA-vennlige aktivister. Først av alle de sekulære Kemalistene, så islamistene i Fethulla-Gulen-bevegelsen. Totalt ble mer enn 70 000 mennesker anklaget, og de vanlige fangene måtte slippes ut for å få plass til å fengsle de USA-vennlige fangene.\\nPresident Erdogans stormannsgalskap, hans sinnssyke hvite palass, hans manipulering av valgene og hans totale undertrykkelse gjør han til den ideelle syndebukken for feilene som har blitt gjort i Syria. Men hans motstand mot en fargerevolusjon og de fire mordforsøkene antyder at det ikke vil være mulig å bli kvitt han så fort.\\nSaudi-Arabia\\nSaudi-Arabia er like uunnværlig for De Forente Stater som Tyrkia av tre grunner. Først på grunn av oljereservene som har en eksepsjonell kvalitet og eksepsjonell kvantitet (selv om Washington ikke lenger trenger å bruke dem, men bare for å kontrollere salget). Deretter for sine finansielle reserver (selv om disse reservene har falt med 70 %) som gjør dem i stand til å finansiere hemmelige operasjoner som i all stillhet er kontrollert av Kongressen. Og til slutt deres grep om kildene til jihadisme. Faktisk har Riyadh finansiert Muslim World League siden 1962, og de var også med på å grunnlegge denne. Og finansieringen har blitt gjort på vegne av CIA, Det Muslimske Brorskap Naqshbandis, de to organisasjonene som forsyner absolutt alle jihadist-offiserer i hele verden.\\nMen den anakronistiske karakteren i denne staten er at den er den private eiendommen til den kongelige familien, som er fremmede for det allment aksepterte prinsippet om ytringsfrihet og religionsfrihet. Her kreves det radikale forandringer.\\nCIA organiserte derfor etterfølgeren etter kong Abdullah i januar 2015. Den natten statsoverhodet døde ble flertallet av de ineffektive offentlig ansatte løst fra sine funksjoner, og landet ble omorganisert etter en på forhånd etablert plan Fra nå av skulle makten deles mellom de tre hovedklanene, Kong Salmane ( og hans elskede sønn prins Mohammed), sønnen til prins Nayef (den andre prins Mohammed), og til slutt sønnen til den avdøde kongen, prins Mutaib, (kommandør for nasjonalgarden).\\nI praksis lar kong Salmane (81 år gammel) sønnen, den flotte prins Mohammed ( 31 år gammel) styre i hans sted. Mohammed økte det saudiske engasjementet i Syria, deretter gikk han til krig mot Jemen. I tillegg kom han med et enormt program med økonomiske og sosiale reformer som han kalte «Vision for 2030».\\nDessverre ble ikke resultatene så strålende som ventet. Kongedømmet var nå engasjert både i Syria og i Jemen. Denne siste krigen er blitt slått tilbake med angrep fra Houtiene på saudiske områder og med tap for hæren hans. Fra et økonomisk synspunkt er de sikre oljereservene gått ned, og tapene i Jemen hindrer han i å utnytte «The Empty Quarter». Det er ørkenregionen som grenser til begge land. Fallet i oljeprisene har ganske sikkert fjernet et antall konkurrenter, men har også tørket inn det saudiske finansdepartementet, som nå ser seg nødt til å låne på det internasjonale markedet.\\nSaudi-Arabia har aldri vært så mektig som nå, og samtidig så sårbart. Den politiske undertrykkelsen nådde sitt høydepunkt med halshoggingen av lederen for opposisjonen, sjeik Al-Nimr. I shia-minoritetene forberedes nå opprør, men også i sunni-provinsene vest i landet. På internasjonalt nivå ser den arabiske koalisjonen imponerende nok ut. Men den har falt fra hverandre etter at Egypt trakk seg ut. Den offentlige tilnærmingen til Israel mot Iran har reist et ramaskrik i den arabiske og muslimske verden. Heller enn gå inn for en ny allianse, illustrerer dette panikken som har grepet den kongelig familien, som nå er hatet overalt.\\nSett fra Washington er øyeblikket kommet for å velge ut de elementene i Saudi-Arabia som er verdt å redde, og å bli kvitt de andre. Rent logisk ville det være å gå tilbake til den tidligere måten, å dele makten mellom Sudariene (men uten prins Mohammed bin Salman, som hadde vist seg ubrukbar) og Chamar (stammen til den avdøde kong Abdullah).\\nDen beste løsningen for både Washington og det saudiske folket ville være at kong Salmane døde. Sønnen hans, Mohammed ville bli isolert og vekk fra makten. Den ville bli betrodd den andre prins Mohammed (sønnen til Nayef). Prins Mutaib ville beholde sin posisjon. Denne arvefølgen ville bli lettere å styre for Washington hvis den fant sted før innsettelsen av den neste presidenten den 6. januar 2017. Kandidatene ville da kunne anklage den ubrukelige kongen som ansvarlig for alle feil, og så annonsere fred i Syria og Jemen. Dette er CIAs nåværende prosjekt.\\nI Arabia, som i Tyrkia og i andre nasjoner, søker CIA å opprettholde status quo. Til det formålet prøver de å organisere forsøk på å bytte ut ledere uten å røre strukturene selv. Den kosmetiske måten til disse justeringene gjøres på, gjør det lettere å garantere hvor usynlig arbeidet er.\\nMoskva prøver å lenke sammen Midt-Østen og Ukraina i forhandlingene Russland har prøvd å lenke sammen den syriske og jemenittiske slagmarken. Mens deres styrker offisielt har vært utplassert i Levanten i et år, har de uoffisielt vært til sted i Jemen i tre måneder, og tar nå aktivt del i kampene. Ved samtidig å forhandle om en våpenhvile i Aleppo og Jemen, har de tvunget USA til gå med på at det er en sammenheng mellom disse to krigsteatrene. I begge disse landene har hæren vist sin overlegenhet med konvensjonelt utstyr når de står ansikt til ansikt med USAs allierte, men har samtidig unngått en direkte konfrontasjon med Pentagon. Disse omgåelsene hindrer Moskva i å investere i Irak, til tross for deres historiske forløpere i dette tredje landet.\\nMen opprinnelsen til krangelen mellom de to store maktene er i utgangspunktet blokaden av de to Silkeveiene - en i Syria, og en i Ukraina. Logisk nok prøver derfor Moskva å lenke disse to sakene sammen i sine forhandlinger med Washington. Men det er enda mer logisk at CIA selv allerede har skapt en tilknytning mellom de to kamp-plassene via Tyrkia.\\nDa han dro til Berlin den 19. oktober håpet den russiske president, Vladimir Putin, og hans utenriksminister, Sergej Lavrov, å kunne overbevise Tyskland og Frankrike, om ikke De Forente Stater, om å forene disse sakene. De diskuterte utvidelse av våpenhvilen i Syria og slutt på den ukrainske blokaden av Minsk-avtalen. Disse forretningene må ha irritert Washington, som vil gjøre alt som står i deres makt for å sabotere det.\\nNaturligvis vil Berlin og Paris til slutt rette seg etter NATOs politikk. Men fra Moskvas synspunkt er en frossen konflikt bedre enn et tap (i Ukraina, som i Transnistria, for eksempel). Og alt som kan skade enheten i NATO er signaler på slutten av USAs overlegenhet.\\nThierry Meyssan Oversettelse\\nIngunn Kvil Gamst'"}, "time": 1742562871.2017276}