{"duration": 0.05948948860168457, "input_args": {"text": "'Actor Robert Davi electrified the Conservative Political Action Conference Thursday with a brief speech in which he described how President Donald Trump is the “force of nature” America needs to move on from the past three decades of its adherence to globalist policies and principles. [The veteran actor and Breitbart News contributor began his speech by asking how many CPAC attendees were Trump supporters from the very first day he announced  —   a few raised their hands. When he asked how many were Trump supporters now, the room exploded in cheers.  “I’m thrilled to be here with all of you, and I have to say how moved I am to see how many young people are engaged,” Davi began. “You are the future of this country. And you’ve gotta be engaged, and you have to understand how important this moment of your history is, because this nation belongs to you. ” The   “Bond    host” continued by referring to a Breitbart News article he had written on June 16, 2015, the day that Trump announced his bid for the presidency. Davi said that former President George H. W. Bush’s 1988 campaign marked the beginning of a “shift” toward what became a   era of globalist policies that ultimately weakened the country. Davi argued that Bush’s campaign slogan, “A kinder, gentler nation,” was not the kind of message the United States needed after eight years of President Ronald Reagan’s bold reforms. “George Bush is a good man. But that was the globalist flag [being] put in the ground. That was the beginning of it all,” he said. “After Reagan we’ve had Bush, Clinton, Bush Two, Obama. We needed a force of nature to take the ship back. ” Later in his speech, Davi criticized the news media, which he said he had seen been manipulated for years. “There are good people. I respect everyone’s living, everyone’s point of view, that’s what America is about,” he said. “But I understand when I see the vitriol, and the continued misrepresentation of certain things, or the exaggeration of certain things, carried to a point that they shouldn’t be  —   and that’s what we see happening now. ” “Every media outlet is saying, ‘The first hundred days  …   ’” he added. “Well, he’s only been in office   days. It’s not a hundred days! And look what’s been accomplished! Look what the future is going to be. ” Davi concluded his speech by quoting the late Red Skelton’s commentary on the Pledge of Allegiance, suggesting that young people and unassimilated immigrants today lack the patriotism that was so vital in building the country. “‘Indivisible’  —   incapable of being divided. ‘With liberty,’ which is freedom, the right to live one’s own life without threats, fear or some form of retaliation,” Davi said. “‘Justice’  —   the principle equality of dealing fairly with others. ‘For all,’ which means boys and girls it’s as much your country as it is mine. ” He then led the audience in the Pledge of Allegiance. Watch the full speech above.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562283.5259202}