{"duration": 0.06181979179382324, "input_args": {"text": "'LOS ANGELES  —   The chief executive of Sony’s underperforming entertainment division, Michael Lynton, announced Friday that he would step down to focus more intently on the popular messaging service Snapchat, where he was an early investor. Mr. Lynton, who weathered various corporate crises at Sony Entertainment over his   tenure, including a devastating cyberattack and a battle with activist investors, will step down on Feb. 2, the company said. After that, Kazuo Hirai, the president and chief executive of Sony Corporation, based in Tokyo, will take a more   role at the conglomerate’s movie, television and music division, at least for a time. Mr. Hirai will begin keeping a second office at Sony’s studio complex in Culver City, Calif. the company said, and take the additional title of   executive of Sony Entertainment. Mr. Lynton will also serve as   executive for a   period starting in February to help Mr. Hirai learn the inner workings of the   movie and television businesses and select a permanent successor. In the meantime, Mr. Lynton, 57, will officially become chairman of the board at Snap Inc. which owns Snapchat. Snap is expected to go public  —   with an eye toward being valued at $30 billion or more  —   this spring. As chairman, Mr. Lynton is not expected to play a direct management role, but rather focus on matters involving strategy and governance in support of Evan Spiegel, Snap’s chief executive. “I have been involved with Evan and Snapchat since its early days, and, given its growth since then, decided the time was right to transition,” Mr. Lynton said in a statement. He added that he was confident that “the broad changes we have made and new management team we have assembled over the last few years” at Sony would bear fruit. Despite wrenching turnaround efforts  —   Mr. Lynton hired a new movie chief in 2015  —   Sony’s film operation, which includes the Columbia, Screen Gems and TriStar labels, has experienced a prolonged shortage of breakout hits. Last year, Sony released 22 movies (not including those distributed by its New   art house unit) and collected $911. 5 million at the domestic box office, with moderate successes like “The Angry Birds Movie” offset by clunkers like “The Brothers Grimsby. ” Among the six major Hollywood studios, only Paramount fared worse, with 15 releases taking in $876. 8 million. The leader, Walt Disney Studios, where Mr. Lynton worked in the 1990s, had 13 releases and $3 billion in domestic sales. In a statement, Mr. Hirai said Mr. Lynton’s structural changes “set the path for restoring profitability and future growth, though we recognize current challenges in the motion picture businesses and its turnaround will take some time. ” That suggests Mr. Hirai plans to be patient with Thomas E. Rothman, the chairman of Sony Pictures, who has ruffled feathers at the studio as he has pushed for change. Mr. Hirai also emphasized that the studio was not for sale  —   a persistent topic of Hollywood speculation  —   calling movies, television and music “essential parts of Sony. ” Although the studio’s top television executive was pushed out in June after clashing with Mr. Lynton, Sony’s   business has been a bright spot. It makes “The Crown” for Netflix, “Blacklist” for NBC and “The Goldbergs” for ABC, in addition to lucrative chestnuts like “Jeopardy” and “Wheel of Fortune. ” Sony also delivered the seminal series “Breaking Bad” during Mr. Lynton’s tenure. Sony Music, which  went through management changes of its own in October, has strengthened its position by focusing on growth areas like streaming and paying the estate of Michael Jackson $750 million for its share of the   Music Publishing catalog, which contains more than one million copyrights, including 250 songs by the Beatles. Sony Music has also released hits by artists like Beyoncé and Meghan Trainor. In his statement, Mr. Hirai thanked Mr. Lynton for “his strong leadership and dedication to Sony throughout his long and illustrious career with the company. ”'"}, "time": 1742562189.3244705}