{"duration": 0.07633256912231445, "input_args": {"text": "'President Donald Trump met Lilian Tintori, the wife of Venezuela’s most prominent prisoner of conscience, at the White House Wednesday night, demanding freedom for Popular Will party leader Leopoldo López “immediately. ”[  The President met Tintori along with Vice President Mike Pence and Senator Marco Rubio, who had delivered a speech against the oppressive Venezuelan socialist regime to the Senate floor on Wednesday. Trump posted a photo of the group together to Twitter Wednesday night, with the message “Venezuela should allow Leopoldo Lopez, a political prisoner  husband of @liliantintori (just met   @marcorubio) out of prison immediately. ”  Venezuela should allow Leopoldo Lopez, a political prisoner  husband of @liliantintori (just met   @marcorubio) out of prison immediately. pic. twitter.   —   Donald J. Trump (@realDonaldTrump) February 15, 2017,   The Miami Herald notes that Trump did not appear to have a meeting with Tintori scheduled, but instead a dinner with former Republican primary rival Marco Rubio. The two appeared to agree to cooperate in the interest of helping Tintori and López. Rubio delivered a speech on the Senate floor Wednesday demanding the United States do more to help López and other political prisoners in the South American nation, arrested for organizing peaceful assemblies. Rubio delivered a speech on the Senate floor Wednesday in López’s defense, calling him “a Venezuelan opposition leader who three years ago this week led peaceful demonstrations against the regime of Nicolas Maduro  —   and he was thrown in jail for it. ” Of Tintori, he said she “is an incredibly brave woman who does not rest as she continues advocating for her husband’s release and the release of all political prisoners. And continues to fight for a free and democratic Venezuela. ” The Venezuelan government arrested López in 2014 for organizing a peaceful   protest and sentenced him to 13 years in prison. Tintori has since taken on the mantle of advocating for the freedom of Venezuelans worldwide. In December, Tintori chained herself to the walls of the Vatican seeking a meeting with Pope Francis but did not receive an invitation. The Pope met with her once months before that protest. In his meeting with Venezuelan dictator Nicolás Maduro, however, Pope Francis vowed to “take any step that would contribute to resolving open questions and generate greater trust between the parties. ” President Trump repeatedly promised Latin Americans from oppressed countries that he would use the Oval Office to advocate for freedom in their homelands. He particularly singled out Venezuela and Cuba, the latter with which President Barack Obama expanded diplomatic relations, as requiring his attention. President Trump has also made empowering women a priority of his administration.  '"}, "time": 1742562137.8432178}