{"duration": 0.08135509490966797, "input_args": {"text": "'  Mayhem Awaits As Crooked Hillary Clinton Is Now Being Advised To Contest The Election Results If the results in the three states were to be overturned, Clinton would win enough electoral votes to win the presidential election. The pro-Hillary computer scientists want the Clinton campaign to contest the election results. Each state has a separate deadline to file a challenge, with Wisconsin’s coming first on Friday.   23, 2016 Top aides to Hillary Clinton have been briefed on unproven claims that the presidential election was hacked by computer scientists, according to a new report. \\nCampaign chair John Podesta and counsel Marc Elias heard the complaints in a conference call last Thursday, New York magazine reports . The allegations say Clinton won 7 percent fewer votes in counties that use electronic voting, compared with counties that rely on paper ballots in the state of Wisconsin. \\nThe campaign was told that the margin of suspicious votes would swing 30,000 votes to Clinton’s favor. Clinton only lost Wisconsin to Donald Trump in the presidential election earlier this month by .7 percentage points, or around 27,000 votes. Hillary Clinton delivers statement on election results: The allegations also pointed to voting patterns in Michigan and Pennsylvania, states that Trump won only by razor-thin margins. \\nIf the results in the three states were to be overturned, Clinton would win enough electoral votes to win the presidential election. The pro-Hillary computer scientists want the Clinton campaign to contest the election results. \\nEach state has a separate deadline to file a challenge, with Wisconsin’s coming first on Friday. Clinton Supporters Breaks Down in Tears as Trump wins election: Nate Cohn, a New York Times reporter, poured cold water on the New York magazine report with his own analysis. \\n“Effect of paper ballots in Wisconsin goes from 7 pts, like NY article, to 0 if you control for race education, density (true w&w/o weights,),” Cohn tweeted . \\nHe said the same voting pattern would apply in the other two states. \\nSo far, there’s no indication the Clinton campaign intends to listen to the computer scientists and contest the election results. A spokesman for Clinton did not immediately respond to a request for comment. source SHARE THIS ARTICLE  '"}, "time": 1742563969.1872497}