{"duration": 0.03650355339050293, "input_args": {"text": "'Bad News For Hillary After Camera Caught Why She Gave Strange Men $300 Posted on October 31, 2016 by Amanda Shea in Politics Share This Man from video (left), Hillary Clinton thinking she got away with it (right) \\nHillary Clinton can’t seem to escape the karma that’s coming her way as the days are dwindling down to the election, and with each one, something else comes out against her that she can’t escape. After the FBI dropped the ball on the first investigation, they’re redeeming themselves the second time around, and now it’s out what she paid strange men $300 to do. \\nThe hits just keep on coming at Hillary. If she gets off the hook again this investigation in addition to everything WikiLeaks has released about her, then we know that there is something seriously corrupt with our government. \\nWorse yet would be if she’s elected as president, which will force Americans to pay an exceptionally detrimental price for the next four years that could bring lasting implications. The man in this video knows who may have helped in that destructive outcome, done for a small fee that Hillary’s campaign evidently handed out like candy for this cause at a halfway house in California. \\nMicroSpookyLeaks came forward with the footage they obtained, when they posted it to social media on Saturday which shows the unnamed person in this video admitting what Democrats were giving halfway house patients $300 to do for them. While this man in the video may not have accepted the payment himself, he’s caught saying that Democrats are giving others in the house a $300 rebate check if they vote for Hillary in the state of California. DEMS caught paying patients from a halfway house $300 rebate to vote for HRC in CA! pic.twitter.com/qpxgNt6KgR \\n— MicroSpookyLeaks™ (@WDFx2EU7) October 29, 2016 \\nThis is just one place where cash was probably offered for votes. We can only imagine that if her party is willing to do this there, they hit up other places and people in key states to do the same. What’s particular sick about it isn’t just that they are fraudulently obtaining votes for this woman who can’t get them on her own merit, it’s that they are targeting vulnerable people to get them as part of the dishonest plan. \\nIf Hillary is able to continue on with this campaign and take the White House, Americans have the duty to demand how it happened since there’s no way she could legitimately win. Had Donald Trump been caught bribing halfway house patients for votes or any of the other dishonest deeds leaked out about Hillary lately, the media would have exiled him from the election.'"}, "time": 1742628308.5654647}