{"duration": 0.10738277435302734, "input_args": {"text": "'SEOUL, South Korea  —   The acting president of South Korea, Hwang   on Monday called the killing of Kim   the estranged half brother of North Korea’s leader, “an intolerable crime against humanity and terrorist act” masterminded by the North Korean regime. The remarks were the strongest yet by the South Korean leadership linking the North Korean government, led by Kim   to the brazen killing of Mr. Kim’s half brother on Feb. 13 at Kuala Lumpur International Airport in Malaysia. In his remarks, Mr. Hwang also urged the world to hold North Korea accountable for the killing. “It starkly demonstrated the North Korean regime’s recklessness and cruelty as well as the fact that it will do anything, everything in order to maintain its power,” Mr. Hwang said during a meeting of   cabinet ministers on Monday. “We need to cooperate with the international community to ensure that North Korea will pay a just price for its terrorist act. ” Mr. Hwang’s comments escalated pressure on North Korea by formally accusing Mr. Kim’s government of carrying out a terrorist attack, which could encourage other nations, including the United States, to try to punish the government in Pyongyang. Mr. Hwang instructed his government to strengthen vigilance and precautions against possible North Korean terrorist attacks on the government and citizens of the South. He also warned that North Korea may try military provocations to divert international attention from the killing. The statement came as tensions escalated Monday between North Korea and Malaysia as the police in Kuala Lumpur press on with their investigation of the killing, in which several North Korean citizens are being sought. Fuji TV in Japan posted what appeared to be airport security video footage of the attack on YouTube, which was later reposted by other sources. The North Korean ambassador to Malaysia, Kang Chol, called the Malaysian inquiry politically motivated and demanded that his government be allowed to take part. Mr. Kang also found fault with Kim  ’s autopsy. “It has been seven days since the incident, but there is no clear evidence on the cause of death, and at the moment we cannot trust the investigation by the Malaysian police,” Mr. Kang said. The North Korean Embassy later released a statement trying to raise doubts about whether the body was that of Mr. Kim, faulting the Malaysian authorities for “identifying the other name alleged by the hostile foreign forces. ” The statement said the deceased man, whom it identified as Kim Chol, held a diplomatic passport, and it criticized the Malaysian authorities for requiring the presence of next of kin for the body to be released. The Malaysian Foreign Ministry said it had summoned Mr. Kang to explain his accusation that Malaysia was “colluding” with North Korea’s enemies in its handling of Mr. Kim’s death. Late Monday, the Malaysian foreign minister, Anifah Aman, responded to Mr. Kang’s charges, saying they were based on “delusions, lies and  . ” Mr. Kang’s suggestion that someone else’s hand was behind the investigation was “deeply insulting to Malaysia,” he said in a statement issued by his office. “In all civilized nations, it is the norm for cases such as these to be comprehensively investigated,” Mr. Anifah said. “It is the responsibility of the government to do so. ” Mr. Kim was apparently poisoned by a woman who grabbed him from behind at the airport and wiped his face with a cloth. He died on the way to a hospital. The Malaysian police have arrested four people and are seeking seven others, most of them North Korean. In its meeting with Mr. Kang, the Malaysian government called his accusations “baseless” and said the police were following normal procedures in the case of a death “under mysterious circumstances. ” Malaysia has told North Korea that it will give the body to Mr. Kim’s next of kin once the investigation is complete. “The Malaysian government has been transparent,” the statement said. “The Malaysian government takes very seriously any unfounded attempt to tarnish its reputation. ” The South Korean unification minister, Hong   said on Monday that eight North Koreans were involved in the case, including one who was arrested, four who were believed to have returned home and three others who were still being sought by the Malaysian authorities. Speaking to reporters in Seoul, Mr. Hong declined to reveal the additional information his government had that helped it determine North Korean involvement. But he said the fact that several suspects were from North Korea was significant evidence itself. He also noted that North Korea had a history of committing terrorist attacks abroad and executing its own officials deemed a threat to the country’s leader. “The North Korean regime depends on a reign of terror and fears to help maintain its grip on power,” Mr. Hong said about the possible motive behind the killing. In Indonesia, Agung Sampurno, an Immigration Department spokesman, said that at least three North Korean suspects who left Malaysia in the hours after the killing on Feb. 13 arrived in Jakarta later that day. They left Jakarta at 10:20 p. m. on a flight to Dubai, in the United Arab Emirates, before they were believed to have returned to North Korea.'"}, "time": 1742563812.3189375}