{"duration": 0.07995319366455078, "input_args": {"text": "'Two million people in the contested Syrian city of Aleppo lack access to running water because of escalated fighting, the United Nations said Tuesday, beseeching combatants to declare a humanitarian pause to permit emergency deliveries of aid and to fix damaged pumps. “The U. N. is extremely concerned that the consequences will be dire for millions of civilians if the electricity and water networks are not immediately repaired,” the organization said in a statement. “The U. N. stands ready to assist the civilian population of Aleppo, a city now united in its suffering,” the statement said. “At a minimum, the U. N. requires a     or weekly   humanitarian pauses to reach the millions of people in need throughout Aleppo and replenish the food and medicine stocks, which are running dangerously low. ” The statement also denounced the military targeting of hospitals and clinics, which it said “continues unabated, seriously jeopardizing the health and welfare of all citizens of Aleppo. ” The fighting in Aleppo, Syria’s largest city before the civil war that began more than five years ago, escalated sharply over the weekend, when rebel forces and their jihadist allies challenged the government’s siege of   districts. They severed the primary government supply route to Aleppo, effectively isolating the entire city. Roughly 275, 000 people in   eastern Aleppo have been under siege by Syrian forces and their Russian military partners since July. The rebel advance put civilians in   western Aleppo at risk, increasing the total population under threat to about two million. The crisis worsened as the United Nations Security Council was briefed privately on Tuesday by the special envoy for Syria, Staffan de Mistura, and the top humanitarian aid official, Stephen O’Brien. Mr. de Mistura, who has been seeking to restart peace talks, did not speak publicly afterward, but diplomats later told reporters that he did not foresee a resumption of talks in August. “He doesn’t want any preconditions to exist, he wants to be able to control the process, he wants to decide about the timing,” said Alexis Lamek, France’s deputy ambassador. “I don’t see how we can have meaningful talks if there is not the minimal conducive environment for that. ” Samantha Power, the United States ambassador, was also pessimistic: “We’re in reverse gear” on the issues of humanitarian access and a cessation of hostilities in the conflict, she said, the two conditions for peace talks to resume. “So we’ve always understood that these were three legs on a stool, and in order for the stool to be upright, all of the legs have to be stable,” she said. “And from what we heard, we’re a long way from that. ” Mr. O’Brien, who spoke outside the council’s chambers after his appearance, said he had told council diplomats of “the horrific humanitarian situation in Aleppo, where fighting rages and two million people live in fear of besiegement. ” He said children were especially vulnerable from the water crisis and that wells drilled in the city were “not nearly enough to sustain the population. ” Mr. O’Brien also said there had been no emergency deliveries to Aleppo this month, despite a previously negotiated agreement for humanitarian access. “This was not in line with the plan,” he said. Aid delivery teams for the United Nations were “ready to roll” if a humanitarian pause could be enforced, Mr. O’Brien said, but for now it was too dangerous “even for the very brave people on the ground  —   they are brave, but they are not suicidal. ” Hundreds of thousands of people have been killed in Syria and millions displaced since the conflict began in March 2011 as a peaceful opposition movement against President Bashar  . The Syrian Center for Policy Research, a   group, estimated earlier this year that the death toll was at least 470, 000. '"}, "time": 1742562101.8462129}