{"duration": 0.0672769546508789, "input_args": {"text": "'PILZONE, Italy  —   It was a   dream, but finally, this week, the conceptual artist Christo walked on water. On Thursday, he tried out his latest project, “The Floating Piers,” a walkway stretching three kilometers, or nearly two miles, that connects two small islands in Lake Iseo, in Italy’s Lombardy region, to each other and to the mainland. Christo stepped out on the floating walkway of puckered   nylon fabric, designed to change color according to the time of the day and the weather. On Thursday, it was pockmarked with bright orange blotches left by footsteps treading on the   fabric. “It’s actually very painterly, like an abstract painting, but it will change all the time,” Christo, 81, a   American, said of his project. “The Floating Piers” is his first outdoor installation since 2005, when he and   his collaborator and wife, installed 7, 500   gates in Central Park in New York City. Like his other environmental artworks, which try to reframe familiar landscapes, the 15 million euro project (or $16. 8 million) will be funded through the sale of his original drawings and collages. “I think this is a record in the history of Christo’s special projects because he and the team realized it in 22 months normally it takes decades,” the curator Germano Celant, the project’s director, said. “So I will say that it’s an Italian and American miracle at the same time. ” Walking on the floating pier, as I discovered, is akin to being on a lightly rocking boat, without feeling wary about suddenly toppling over should a strong wave arrive. Shoes are optional, and it’s probably worth taking them off, at least for a moment, to feel the fabric’s texture. (There is a layer of felt beneath the saffron cover.) When wet, the walkway is a little squishy when sunny, it should feel warm to the toes. “Look!” Christo said, pointing to a juncture where two pathways joined to form a bright   V, contrasting against the deep blue of the lake. “You see! It falls in that way so you can see the movement,” he said. “It’s actually breathing. ” Getting the walkway to both gently undulate and remain securely affixed to the uneven lake bottom was a feat that has occupied engineers, construction companies, French   divers and even a team of Bulgarian athletes drafted over the past two years. The walkway is assembled from 220, 000   polyethylene cubes that form its    (53 feet) spine, covered this week with a waterproof and   fabric made by a German company for the project. “Each project is like a slice of our lives,” Christo said, “and part of something that I will never forget. ” From Saturday through July 3, the project will be open and free to the public 24 hours a day, with a legion of boat hands, lifeguards, monitors and information officers standing guard to avert unintentional dips in the lake. “It’s really a physical thing, you need to be there, walking it, on the streets, here,” Christo said. “And it’s demanding. ” The route, which laps around the small island of San Paolo, also includes pedestrian areas in the towns of Sulzano, on the mainland, and Peschiera Maraglio, on Monte Isola, an islet rising out of the lake. The project, he said, “is all this”  —   the piers, the lake, the mountains, “with the sun, the rain, the wind, it’s part of the physicality of the project, you have to live it. ” “I know these projects are totally irrational, totally useless,” he added. “The world can live without them, nobody needs them, only me and  . She always made the point that they exist because we like to have them, and if others like them, it’s only a bonus. ” Christo, whose full name is Christo Javacheff, and his wife, who died in 2009, envisaged a floating piers project 46 years ago, when they were approached by an Argentine art historian who suggested the Río de la Plata basin in South America as a site, but the plans fell through. Drawings for that version are on display at the Museo di Santa Giulia, in nearby Brescia.  In 1995, they considered reviving it in Tokyo Bay, but that project, too, was never realized. Yet Christo was determined. “Some projects remain in your heart,” he said. Apart from the sporadic protests of labor unions and a national environmental organization that was worried about the impact on the lake, the Italian project went smoothly after local officials and administrators came on board. Christo said it was about positively exploiting “the incredible chemistry of humans” from all walks of life, each member of the team focusing energy on “something that does not exist”  —   to the point where it does. He was also relieved that there was never a discussion with officials about installing a safety fence along the sides of the walkway, allowing visitors to walk to the edge of the water. “The moment you have a parapet, forget it,” he said, the feeling of walking on water is gone. Other concerns about the ability of a small lake community to deal with the avalanche of visitors that the walkway is expected to draw  —   an estimated 40, 000 people a day  —   appear to have been muted for now by enthusiasm for the project. Lake Iseo is perhaps northern Italy’s least famous lake, overshadowed by the neighboring Lake Garda. But hotels and other lodging options here and in nearby towns are nearly booked for the duration of the run. “Lake Iseo won’t be the same after this event,” said Fiorello Turla, the mayor of Monte Isola. “Monte Isola will change skin,” as its exposure to the global spotlight puts it on the map, he added. “It’s a great opportunity that we’ve been given and that we want to seize and bring forward. ” At the close of its   run, the walkway will be dismantled and its parts recycled and resold. “The important part of this project is the temporary part, the nomadic quality,” Christo said. “The work needs to be gone, because I do not own the work, no one does. This is why it is free. ”'"}, "time": 1742628514.1078935}