{"duration": 0.09374523162841797, "input_args": {"text": "'Image: Bin im Garten, Creative Commons\\nThis article was written by Tyler Durden and originally published at Zero Hedge . \\nEditor’s Comment: The entire campaign season was composed of stories about how Trump couldn’t win, about the derogatory comments he has made, and the terror he would bring. But their lopsided attacks against Trump, and their continuing praise of nothing-but-Hillary was completely wrong in every way… the epitome of “fake news.” \\nAnd President-elect Trump reportedly let the media hear his mind… interesting account of this off-the-record meeting. \\nTrump “Exploded” At Media Execs During Off-The-Record Meeting: “It Was A F–king Firing Squad” \\nby Tyler Durden\\nEarlier today we reported that in a “summit” organized by Trump’s campaign manager Kellyanne Conway, executives and anchors from the major US media outlets, including CNN president Jeff Zucker, ABC News president James Goldston, Fox News co-presidents Bill Shine and Jack Abernethy, and NBC News president Deborah Turness, visited Donald Trump at his Trump Tower penthouse for an off the record meeting.\\nCourtesy of the Post, we have a complete list of the participants at the Trump media meeting: the hour-long powwow included top execs from network and cable news channels. Among the attendees were NBC’s Deborah Turness, Lester Holt and Chuck Todd, ABC’s James Goldston, George Stephanopoulos, David Muir and Martha Raddatz, CBS’ Norah O’Donnell John Dickerson, Charlie Rose, Christopher Isham and Gayle King, Fox News’ Bill Shine, Jack Abernethy, Jay Wallace, Suzanne Scott, MSNBC’s Phil Griffin and CNN’s Jeff Zucker and Erin Burnett.\\nThe contents of what was discussed were initially unclear.\\n\\nNow, according to the Post and Politico , we learn that the President-elect “ exploded at media bigs in an off-the-record Trump Tower powow on Monday .”\\n“ It was like a f—ing firing squad ,” one source told the Post.\\nAccording to the Post’s recound of the conversation, “ Trump started with Jeff Zucker and said I hate your network, everyone at CNN is a liar and you should be ashamed ….”\\n\\nJeff Zucker (left) \\n“The meeting was a total disaster . The TV execs and anchors went in there thinking they would be discussing the access they would get to the Trump administration, but instead they got a Trump-style dressing down,” the source added. A second source confirmed the encounter.\\nThe Post adds that “the meeting took place in a big board room and there were about 30 or 40 people, including the big news anchors from all the networks…”\\n“Trump kept saying, ‘ We’re in a room of liars, the deceitful dishonest media who got it all wrong. He addressed everyone in the room calling the media dishonest, deceitful liars. He called out Jeff Zucker by name and said everyone at CNN was a liar, and CNN was network of liars .\\n“Trump didn’t say Katy Tur by name, but talked about an NBC female correspondent who got it wrong, then he referred to a horrible network correspondent who cried when Hillary lost who hosted a debate – which was Martha Raddatz who was also in the room.\\n“Gayle did not stand up, but asked some question, ‘How do you propose we the media work with you?’ Chuck Todd asked some pretty pointed questions. David Muir asked how are you going to cope living in DC while your family is in NYC? It was a horrible meeting.”\\nPolitico adds further details, according to which “Trump complained about photos of himself that NBC used that he found unflattering, the source said. Trump turned to NBC News President Deborah Turness at one point, the source said, and told her the network won’t run a nice picture of him, instead choosing “this picture of me,” as he made a face with a double chin. Turness replied that they had a “very nice” picture of him on their website at the moment.”\\nAmusingly, since the meeting was off the record, meaning the participants agreed not to talk about the substance of the conversations, it means they will most likely be unable to confirm or deny the Post’s report.\\nPolitco’s recollection of events was slightly less dramatic:\\nThe New York Post on Monday afternoon portrayed a much more heated meeting, including a quote from one source who said the encounter was “like a f–ing firing squad.” The Post also said Trump called CNN journalists “liars” and that they should be “ashamed.” The source who spoke with POLITICO characterized the meeting as less intense, and said the discussion included Trump expressing the possibility of a “reset” of the tumultuous relationship between the president-elect and the media and that all he wants is “fairness.”\\nAsked how he defines fairness by a network executive, Trump said simply, “The truth.” But aside from the few moments of contention in the beginning, the source said the meeting was largely substantive.\\nPolitico also adds that Trump, flanked by chief of staff Reince Priebus and campaign manager Kellyanne Conway at the table, also expressed annoyance at the protective press pool and the complaints over him ditching the press when he went out to dinner last week with his family after reporters were advised he was in for the night. But Priebus assured the attendees that the protective press pool will be taken care of and it would all work out.\\nOther attendees at the meeting from Trump’s team included chief strategist Stephen Bannon, Trump’s son-in-law Jared Kushner, spokesman Jason Miller, and Republican National Committee chief strategist and communications director Sean Spicer.\\nAsked for comment, Miller referred POLITICO to Conway’s comments to reporters after the meeting, in which she echoed the sentiments made in the meeting about turning over a new leaf with the media.\\n“There was no need to mend fences,” Conway said. “It was very cordial, very genial. But it was very candid and very honest. From my own perspective, it’s great to hit the reset button.”\\nConway later on Monday hit back at the New York Post report. “He did not explode in anger,” she said.\\nWhile one can have a subjective interpretuation of the nuances at the meeting, one thing was clear: Trump’s attempt at a ‘reset’ will be frowned at by the media which is not used to this kind of treatment, even if the “kindler, gentler” version of events as reported by Politico is accurate.\\nIt also means that what has already been a conventional war between the various US media organizations and Trump, is likely about to go nuclear.\\nThis article was written by Tyler Durden and originally published at Zero Hedge . '"}, "time": 1742564173.762514}