{"duration": 0.5493712425231934, "input_args": {"text": "\"The Rise of the Robots Written by John T. Larabell Email \\nSan Francisco: the home of Haight-Ashbury, the Golden Gate Bridge, and Pier 39; an icon of neoliberalism and left-wing policies, homosexual activism, and countercultural movements. It’s also an incredibly expensive place to live that is becoming increasingly gentrified by young urban tech-sector workers. Now, a new revolution is coming to the City by the Bay: a fully automated “gourmet” fast-food restaurant opening at 680 Folsom Street in the SoMa neighborhood. \\nYes, you read that right. Imagine walking into a “fast-food” restaurant and ordering a burger using a tablet at the counter. Your burger can have practically any combination of fresh toppings you want, a variety of seasonings, a nice toasted gourmet bun, and — get this — a custom blend of gourmet meat. Want beef and pork? No problem. How about beef and bison? Coming right up. You can even pick how lean or fatty you want the meat blend. No, this is not a fantasy: Momentum Machines of San Francisco has produced a burger-making machine that can crank out nearly 400 burgers per hour. It can do everything from grilling the patties, toasting the buns, loading on the toppings, and bagging the finished product all without human interaction. According to a Craigslist ad posted by the company, “This location will feature the world-premiere of our proprietary and remarkable new advances in technology that enable the automatic creation of impossibly delicious burgers at prices everyone can afford.” The ad states that burgers “will be fresh-ground and grilled to order, served on toasted brioche, and accented by an infinitely personalizable variety of fresh produce, seasonings, and sauces.” \\nAccording to a 2014 Huffington Post article, Momentum Machines “plans to sell its invention to restaurants and, eventually, open its own chain to sell gourmet burgers at fast-food prices by eliminating the cost of paying line cooks. This, the company’s website claims, will ‘democratize access to high quality food, making it available to the masses.’” “Our device isn’t meant to make employees more efficient,” Momentum co-founder Alexandros Vardakostas told the website Xconomy in 2012, “It’s meant to completely obviate them.” \\nWe are now at a crossroads in the relationship between technology and human labor. Machines are now so advanced that, according to some experts, they are likely to replace a substantial portion of human workers in the next 20 or 30 years. Consider this from a March 18 LA Times op-ed by Bryan Dean Wright: A viral video released in February showed Boston Dynamics’ new bipedal robot, Atlas, performing human-like tasks: opening doors, tromping about in the snow, lifting and stacking boxes. Tech geeks cheered and Silicon Valley investors salivated at the potential end to human manual labor. Shortly thereafter, White House economists released a forecast that calculated more precisely whom Atlas and other forms of automation are going to put out of work. Most occupations that pay less than $20 an hour are likely to be, in the words of the report, “automated into obsolescence.” In other words, the so-called Fourth Industrial Revolution has found its first victims: blue-collar workers and the poor. The general response in working America is disbelief or outright denial. A recent Pew Research Center survey found that 80% of Americans think their job will still exist in 50 years, and only 11% of today’s workers were worried about losing their job to automation. Some — like my former colleagues at the CIA — insist that their specialized skills and knowledge can’t be replaced by artificial intelligence. That is, until they see plans for autonomous drones that don’t require a human hand and automated imagery analysis that outperforms human eyes. Human workers of all stripes pound the table claiming desperately that they’re irreplaceable. Bus drivers. Bartenders. Financial advisors. Speechwriters. Firefighters. Umpires. Even doctors and surgeons. Meanwhile, corporations and investors are spending billions — at least $8.5 billion last year on AI, and $1.8 billion on robots — toward making all those jobs replaceable. Why? Simply put, robots and computers don’t need healthcare, pensions, vacation days or even salaries. \\nSound scary? If what Wright writes is true, this could understandably be terrifying to many people. To get a deeper understanding of this issue, we’ll take a look at the history of technology and human labor, the situation as it stands today, and what can be expected in the future. \\nMan vs. Machine \\nThe relationship between technology and human workers has always been a mixed bag. Technology has nearly always brought advancements in standards of living for the majority of people, but in doing so, some human labor has always been replaced by that technology. This displacement of labor has not always been a bad thing, as new technologies have often led to jobs being created elsewhere. Let’s take a trip back through history and find out how increased mechanization has led to shifts in human employment, and what’s different with our situation today. \\nThe invention of the printing press in 1440 was an early technological game-changer for human labor. While scribes were made obsolete, new jobs sprang up almost overnight as people were needed to run print shops, and all the ancillary industries supporting book production. Furthermore, books, while still expensive by today’s standards, were within reach of the common man, whereas before, the hand-copied manuscripts were prohibitively expensive for all but the wealthy. \\nThe next great technological advancement that led to massive shifts in human employment was in the realm of agriculture. Strictly speaking, the very first technological advancements in agriculture involved the use of animal labor, such as horses or teams of oxen used for plowing fields or turning mills, and this freed humans from backbreaking, unpleasant work. But as agriculture became more mechanized in the 19th and 20th centuries, animal labor was displaced, and increased efficiency meant fewer people were needed on farms. In the 1800s, for instance, over 80 percent of Americans worked on farms in some capacity. Today, less than two percent of Americans work on farms. This massive shift in human capital, of course, was absorbed by the growing industrial and service economy. \\nAlong with the shift in agriculture came a technological revolution in the textile industry. The industrial revolution saw the rise of power looms and other equipment that obviated much of the human labor involved in textile manufacture. In England, this led to an uprising of displaced textile workers known as Luddites, hence the pejorative “Luddite” for someone in modern times who resists technological or other forms of societal advancement. The Luddites went so far as to destroy those very machines that took their jobs. Of course, industrialization opened up many new jobs for people, and the Luddites’ fears were largely unfounded. As an aside, there are almost no textile mills in Western countries anymore; they’ve all moved to poorer nations, mainly in Central America or Southeast Asia. \\nBy and large, industrialization and its attendant advances in technology have always provided more employment and raised people’s standards of living, not the other way around. But is this about to change? Many fear that we are entering an era when technology has advanced to the point where machines are capable of doing so many tasks that are currently done by humans that there won’t be any “other jobs” for people to do. And what about building and servicing these machines? Again, most of that could soon be done by other machines , or a small number of very specialized human workers. \\nAmy Webb, a digital media futurist and founder of Webbmedia Group, predicts at least eight career fields are “ripe for disruption” very soon — most likely in the next 10 to 20 years. She points to toll booth operators and cashiers, marketers, phone-based customer service, factory workers, financial middlemen, journalists, non-litigation lawyers, and telephone installation/maintenance workers as jobs that could be phased out soon. \\nUniversity of Oxford researchers Carl Benedikt Frey and Michael Osborne estimated in 2013 that 47 percent of total U.S. jobs could be automated and taken over by computers by 2035. Said a March 24, 2015 article for Tech Times regarding this prediction: If you want to stay employed by then, you better think about a career shift into software development, higher level management or the information sector. Those professions are only at a 10 percent risk of replacement by robots, according to Osborne. By contrast, lower-skilled jobs in the accommodation and food service industries are at a 87 percent risk, transportation and warehousing are at a 75 percent risk and real estate at 67 percent. The researcher warns that driverless cars, burger-flipping robots and other automatons taking over low-skilled jobs is the way of the future. \\nThere’s potentially a real problem on the horizon. Let’s take a more detailed look at what economists and tech experts say about the types of jobs that will be replaced, or are already being replaced, by machines. \\nBlue-collar Blues \\nBlue-collar, manual-labor jobs are obvious candidates for being replaced by machines in the near future. In fact, this has already happened to some extent, as robots have been used in assembly lines (think automotive manufacturing) for a few decades. But as the capability of such industrial robots increases, so will their ability to replace more and more human laborers. \\nAs we noted above, fast-food workers will most definitely be some of those whose jobs are on the chopping block. As noted in the U.K. Mirror on May 25: A former McDonald’s CEO warned that robots will take over staff jobs at the fast food empire — because it’s cheaper than employing humans. Ed Rensi has said that buying highly skilled robotics is a cheaper alternative than employing people on minimum wage to work in the company’s worldwide restaurants. He warned that huge job losses are imminent, and commented that it would be “common sense” to replace humans in the workplace.... Rensi said: “I was at the National Restaurant Show yesterday [and looked] at the robotic devices that are coming into the restaurant industry. It’s cheaper to buy a $35,000 (£24,000) robotic arm than it is to hire an employee who’s inefficient making $15 (£10.20) an hour bagging French fries. [A $15 minimum wage is] nonsense and it’s very destructive and it’s inflationary and it’s going to cause a job loss across in this country like you’re not going to believe.” He told FOX: “It’s not just going to be in the fast food business. Franchising is the best business model in the United States. It’s dependent on people that have low job skills that have to grow. Well if you can’t get people [at] a reasonable wage, you’re going to get machines to do the work. It’s just common sense. It’s going to happen whether you like it or not. And the more you push this it’s going to happen faster.” \\nAlong with service-sector jobs, manufacturing jobs will be among the hardest hit by the coming robot revolution. Again, these are mostly repetitive, low-skill labor jobs that lend themselves well to mechanization. In Chinese factories, robots are currently being brought in to replace human workers who are seeking higher wages. At a production line based in Guangdong province for German optical system manufacturer Carl Zeiss AG, robots are being used for applying protective films, cutting, polishing, and packaging — jobs that used to be performed by humans. What’s happening at the Carl Zeiss factory is illustrative of a larger trend in China. As MIT Technology Review observed April 26: Countless manufacturers in China are planning to transform their production processes using robotics and automation at an unprecedented scale. In some ways, they don’t really have a choice. Human labor in China is no longer as cheap as it once was, especially compared with labor in rival manufacturing hubs growing quickly in Asia. In Vietnam, Thailand, and Indonesia, factory wages can be less than a third of what they are in the urban centers of China. One solution, many manufacturers — and government officials — believe, is to replace human workers with machines.... The goal is to overtake Germany, Japan, and the United States in terms of manufacturing sophistication by 2049, the 100th anniversary of the founding of the People’s Republic of China. To make that happen, the government needs Chinese manufacturers to adopt robots by the millions. It also wants Chinese companies to start producing more of these robots. \\nTo ship all those robot-made Chinese products to the United States requires cargo ships and dockworkers at both ends. What about those jobs? Well, they’re being replaced by machines, too. For instance, at TraPac LLC’s shipping terminal in Los Angeles, dozens of robots move shipping containers about, setting them in precise spots with little need for human interaction. Despite strong opposition from longshoremen’s unions, other U.S. ports may soon follow TracPac’s example and become more automated, as many overseas ports have already done. \\nRobots are already being used to provide greater efficiency in warehouses. Amazon uses its Kiva Systems robots (to which the Internet retail giant has exclusive rights), and Locus Robotics has created a warehouse order-picking robot that it says is superior to Kiva’s. In a warehouse in Devens, Massachusetts, owned by Quiet Logistics, Locus robots silently zip around a warehouse bigger than six football fields, transporting orders 24 hours a day with no need for lunch breaks, vacations, or a paycheck. “We developed a system where the robots do all the walking,” Locus Robotics CEO Bruce Welty told Tech Insider in February. “As retailers continue to exceed expectation around next-day shipping, they’re going to look to technology to help them provide an even faster turn-around,” Welty said. In some warehouse applications, Quiet Logistics being one of them, robots won’t replace any human jobs — yet . But one could imagine that as fewer humans are needed, fewer will be hired. \\nSome say that within a decade or two we could see fleets of driverless trucks on the road, guided by GPS navigation and onboard radar. Big companies are eager to streamline their shipping operations by cutting down on hours lost owing to human drivers, and are spending big money on R&D in the hope to ship their products using self-driving trucks. Take Walmart, for example. The retail giant is already developing “semi-autonomous” trucks that are mostly self-driving, only requiring a human driver to take the reins in heavy traffic or inclement weather. Semi-autonomous or even fully autonomous trucks are also being sought to mitigate a shortage of human truck drivers on the horizon. \\nIn addition to driverless trucks, a future with electric-powered, self-driving cars functioning as “taxis” for people is not far from reality. In fact, the “big three” Detroit automakers (GM, Chrysler, and Ford) are already rolling out self-driving cars, or “autonomous vehicles” (AVs) in limited markets for testing. All plan to have fully autonomous cars by 2020 or 2021. And the Europeans aren’t being left in the dust: Volkswagen, BMW, and Mercedes are all developing AV lines of their own. \\nAssuming any bugs and safety issues can be worked out, will there even be a market for such vehicles in the near future? There already is. Ride-hailing service Uber is currently offering self-driving cars in certain markets as part of a pilot program, with the goal to eventually axe all of its drivers in favor of AVs. Young entrepreneurial Uber drivers will probably not be too excited about that, but such is life. And Uber’s main competitor in the United States, San Francisco-based Lyft, plans to use self-driving cars for the majority of its rides within five years. To start with, such self-driving taxis will only operate at speeds up to 25 miles per hour in limited areas, and won’t operate in bad weather. That is, until the technology improves enough to allow them to operate in all conditions at higher speeds. Lyft co-founder John Zimmer believes that personal car ownership, at least for city dwellers, will come to an end as using AV “taxis” quickly becomes a less-costly alternative to owning a vehicle. \\nWhite-collar Woes \\nIt’s not just blue-collar jobs that are being threatened. As Business Insider noted in May of 2015, “Artificial intelligence and robots are not just challenging blue-collar jobs; they are starting to take over white-collar professions as well. Financial and sports reporters, online marketers, surgeons, anesthesiologists, and financial analysts are already in danger of being replaced by robots.” And as a March 16 article for Christian Science Monitor noted: If you think being a “professional” makes your job safe, think again. The two sectors of the economy harboring the most professionals — healthcare and education — are under increasing pressure to cut costs. And expert machines are poised to take over. We’re on the verge of a wave of mobile apps for measuring everything from your cholesterol to your blood pressure, along with diagnostic software that tells you what it means and what to do about it. In coming years, software apps will be doing many of the things physicians, nurses, and technicians now do (think ultrasound, CT scans, and electrocardiograms). Meanwhile, the jobs of many teachers and university professors will disappear, replaced by online courses and interactive online textbooks. \\nLeigh Watson Healy, chief analyst at market research firm Outsell, has this to say about the capability of machines to make market predictions as financial advisors: “Now with machine algorithms and big data disrupting, stock and equity analysts will have to figure out what their value ad is going to be.” The fact of the matter is, machines are able to process so much data so quickly that they could theoretically make market predictions much better than human advisors. Particularly for many younger clients or others with simple investment needs, robo-advisors could very well be the wave of the future. \\nRegarding legal jobs, as noted in a 2015 Fortune article, new software systems “use syntactic analysis and keyword recognition to comb through emails, texts, databases, and scanned documents to find those that one party in a lawsuit would be obliged to turn over to the other through the legal discovery process.” This, conceivably, could replace associates and paralegals in law firms. \\nWith such legal jobs being threatened, it should come as no surprise that writing and research jobs are also in danger of being automated. The Internet wiped out countless newspapers, and new technology could kill even more journalism positions. The next innovation will be algorithms that allow news outlets to automatically create stories and place them on websites without human interaction. Robot journalists are already writing thousands of articles a quarter at the Associated Press. And it should come as no surprise that machines have the potential to be better researchers than humans, provided they are given the correct search parameters. The speed at which they are able to access data and the fact that they don’t get tired make them ideal researchers. \\nBut what about the medical field? Surely this requires a great deal of hands-on, human-controlled interactions. Not so fast: Robots are already used in surgeries, and are able to perform operations with greater precision than human surgeons. A human surgeon controls the robot remotely, and in this way can “amplify” his or her surgical ability. According to the above-mentioned article in Fortune : Johnson & Johnson’s Sedasys system, already FDA approved, can automate delivery of low-level anesthesia in applications like colonoscopies at [a] fraction of the cost of a dedicated anesthesiologist. A doctor can supervise multiple machines at the same time to keep the human element. IBM’s Watson, well known for its stellar performance in the TV game show Jeopardy! , has already demonstrated a far more accurate diagnosis rate for lung cancers than humans — 90 percent versus 50 percent in some tests. The reason is data. Keeping pace with the release of medical data could take doctors 160 hours a week, so doctors can’t possibly review the amount of new insights or even bodies of clinical evidence that can give an edge in making a diagnosis. \\nPharmacists aren’t safe either. As Business Insider noted in 2012, The [University of California, San Francisco] Medical Center recently launched an automated, robotics-controlled pharmacy at two UCSF hospitals. Once computers at the new pharmacy electronically receive medication orders from UCSF physicians and pharmacists, the robotics pick, package, and dispense individual doses of pills. Machines assemble doses onto a thin plastic ring that contains all the medications for a patient for a 12-hour period, which is bar-coded. The pharmacy system, which was phased in over the past year, so far has prepared 350,000 doses of medication without error. \\nThis is not to suggest robots will take all jobs. There will still be a number of things that robots will not be able to do as well as humans. For instance, jobs requiring creativity, “people skills,” or human interaction will likely stay with human employees. Nurses, managers, salespeople, entrepreneurs, and artists come to mind. Unfortunately, politicians won’t be done away with. \\nIn truth, jobs will likely align themselves around several loci. There will be demand for hands-on, “caregiver” type jobs such as nurses, nursing home caregivers, physical therapists, massage therapists, etc. There will be opportunities for “creative” jobs such as artists, musicians, entertainers, athletes, fiction writers, public speakers, and the like. “Managerial” jobs such as C-level corporate jobs and politicians will exist. Finally, “tech” jobs such as programmers, web developers, and software engineers will obviously be in demand. \\nWhat Does It All Mean? \\nSo what will this Brave New World look like when machines do most of our work for us, and humans are needed for very few jobs? How will people even be able to buy all of the goods and services produced by these robot workers if they don’t have jobs to begin with? Naturally, many economists and futurists are suggesting that government will be the solution. \\nThere have been talks of having government give every adult person a “basic income” regardless of their employment status or current income level. Some have suggested giving people a paycheck of more than $2,000 per month, just for being human. And where would this money come from? Why, the rich folks who own the companies that either produce or “employ” the machines that took the people’s jobs, of course. Since, as the argument goes, money will be concentrated in fewer and fewer hands if companies no longer have to employ people, those who benefit from this arrangement should support those who have been displaced. \\nSome European countries have actually toyed with the idea over the last few decades, with Switzerland actually having a referendum on the issue in June. Under the proposed scheme of a Basic Income Guarantee (BIG), all Swiss adults would have received a monthly check of 2,500 Swiss francs, or slightly over $2,500. Children would have received 625 francs per month. The fiscally conservative Swiss roundly rejected the idea, with nearly 80 percent voting against a BIG. As Charles Wyplosz, an economics professor at the Geneva Graduate Institute, remarked, “If you pay people to do nothing, they will do nothing.” Member of Parliament Luzi Stamm of the Swiss People’s Party voiced another concern: “Theoretically, if Switzerland were an island, the answer is yes. But with open borders, it’s a total impossibility, especially for Switzerland, with a high living standard.... If you would offer every individual a Swiss amount of money, you would have billions of people who would try to move into Switzerland.” But proponents of the idea aren’t giving up: They’ve vowed to keep pressing the issue, and keep having referendums, until it becomes a reality. The Dutch city of Utrecht, on the other hand, is experimenting with a basic income among its current welfare recipients. One-third of the recipients will receive welfare as currently administered, one-third will receive the welfare albeit with different rules, and the remaining third will simply receive a $1,000 check every month whether or not they even attempt to find a job. And Finland will conduct its own experiment in 2017, with 180,000 Finns set to receive a basic income of 500 to 700 euros a month. \\nThe idea of a guaranteed basic income is nothing new. In fact, it has been proposed by progressives for more than a century. Martin Luther King, Jr. even suggested that some form of basic income would eliminate poverty. Bill Gross of Janus Capital Group wrote for the Wall Street Journal in May, “Millions of jobs will be lost over the next 10-15 years,” and that the usual solutions to this problem won’t work anymore. “Four years of college for everyone might better prepare them to be a contestant on Jeopardy , but I doubt it’ll create more growth,” Gross contends. The former bond king recommends a “Universal Basic Income.” Gross points out that welfare already exists in other forms, such as food stamps and the earned-income tax credit. “If more and more workers are going to be displaced by robots, then they will need money to live on, will they not? And if that strikes you as a form of socialism, I would suggest we get used to it,” he said. Gross says it’s not a matter of “if,” but “when,” and the way to pay for it is, in his words, “helicopter money.” Yep, that’s right: Have central banks crank up the printing presses and start creating money to give to people, no strings attached. \\nLet’s move into the realm of the hypothetical here and imagine an entire world where, say, 95 percent of the population is supported by a government income. Even if more than five percent of the populace could find employment, there would be little incentive to do so. People would demand that government provide for their very existence. Government-provided food, entertainment, housing, income, etc. would be akin to the Roman policy of “bread and circuses” for the poor. The glaring problem with this is the fact that government will effectively be a parent who controls everyone’s life. The old adage, “He who pays the piper calls the tune” comes to mind. A society where a wealthy, property-owning, technocratic elite supports and cares for the masses would necessitate those elites “managing” society and the masses. After all, the masses would effectively become the “property” of the elite. Bearing that in mind, such “management” would undoubtedly include management of the world’s human population. \\nGovernment-supplied “free” contraceptives and abortions (heavily promoted by media and public schools, of course), adding sterilants to the municipal water supply or infertility-causing substances to food and/or vaccines, and even controlling the birth rate by fiat as in Communist China, have all been suggested as ways to limit, and reduce, world population. Far-fetched? Perhaps, but one must admit that much of this is not outside the realm of possibility. \\nBut what might happen if government did not get involved (as difficult as that might be to imagine)? A truly free market would find ways to keep people employed. More precisely, people themselves, acting out of their own rational self-interest, would find ways to get by, whether this means working as an employee at a “job” or something else entirely. Realistically, many people could revert back to being entrepreneurs producing small quantities of artisan, hand-made items such as crafts, tools, artwork, food, beer, clothing, etc. People could either pay or barter for such items. Such “niche” businesses already exist, to be sure, but more could flourish under an economy where machines do most of the mundane jobs for large employers that people currently perform now. Indeed, people could return to the days of being more self-reliant, growing their own food in either private or communal gardens and raising small livestock, and bartering for items they don’t produce themselves. \\nIf, for the sake of argument, half of all jobs in America were taken by machines, many people might choose to return to single-income households, with one parent (typically the mother) staying home to raise the kids. In this scenario, becoming more self-reliant and producing artisan goods for sale or barter would certainly help to make ends meet, especially since inflation has made it very difficult for most American families to live comfortably on one income. Plus, having a parent stay at home would offer many families the opportunity to homeschool their children and give children experience in producing homemade crafts and goods. Education is becoming increasingly Internet-based anyway, so keeping kids at home would not prevent them from having excellent educational opportunities. Of course, owing to the breakup of the “nuclear family” in America, many households are already single-income because they are single-parent. Such situations would be difficult in a world of reduced human employment. But again, if people are allowed the freedom to act in their own rational self-interest, they will find ways to make it work. Human creativity knows no bounds, and when government planners step out of the way and let people follow their desires and creativity, who can foresee what amazing new products, inventions, and jobs might emerge? And truly, this was the desire of the Founding Fathers of our Republic: to have a nation where a self-reliant people were free to use their creativity to pursue their own interests and desires. Such an attitude is illustrated in a letter from John Adams to Abigail Adams, written May 12, 1780: I must study Politicks and War that my sons may have liberty to study Painting and Poetry Mathematicks and Philosophy. My sons ought to study Mathematicks and Philosophy, Geography, natural History, Naval Architecture, navigation, Commerce and Agriculture, in order to give their Children a right to study Painting, Poetry, Musick, Architecture, Statuary, Tapestry and Porcelaine. \\nSo what will the future bring after the rise of the robots? The answer, really, depends upon whether or not government interferes. If people are allowed to use their own ingenuity and creativity, society and humanity in general could flourish, and indeed enter a true “golden age” of civilization. Or we could see the masses reduced to absolute servitude beneath a technocratic elite who control every aspect of human life. Sadly, if our current trajectory is not changed, the latter scenario seems most likely. This underscores the need to restore and preserve our American system of constitutional limited government; humanity’s future literally hangs in the balance. \\n\\nThis article is an example of the exclusive content that's available by subscribing to our print magazine. Twice a month get in-depth features covering the political gamut: education, candidate profiles, immigration, healthcare, foreign policy, guns, etc. Digital as well as print options are available! Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.\""}, "time": 1742628381.1558394}