{"duration": 0.051102638244628906, "input_args": {"text": "'On Friday, the Japanese cabinet approved a bill that would allow    Emperor Akihito to abdicate his throne. [The bill does not abolish the monarchy as CNN observes, Emperor Akihito is ready to pass the throne along to his oldest son,    Crown Prince Naruhito.   In fact, the bill specifically refers to Akihito instead of changing the rules of abdication for all emperors to follow because, as the Daily Sabah puts it, “the conservative government of Prime Minister Shinzo Abe is reluctant to open the imperial system to   debate. ” However, Daily Sabah notes there is strong popular support in Japan for a permanent law on abdication. Although Akihito and his Empress Michiko are currently in good health, he has publicly expressed concerns about their advancing age becoming an impediment to their official duties. “When I consider that my fitness level is gradually declining, I am worried that it may become difficult for me to carry out my duties as the symbol of the State with my whole being as I have done until now,” Akihito said last year. The BBC recalls that the emperor has undergone both heart surgery and treatment for prostate cancer. He has been on the throne since 1989, when he succeeded Hirohito  —   the ruler who brought Japan into World War II  —   and became the 125th Emperor. The Japanese imperial line is the longest unbroken hereditary monarchy in the world, stretching back for fourteen centuries. Akihito is a direct descendant of the first emperor, Jimmu, who reigned around 660 B. C.  Empress Michiko is the first empress of common birth in the entire history of Japan, celebrated as Japan’s answer to Cinderella when she married Akihito in 1959. She said she was “surprised and pained” when she learned of her husband’s desire to abdicate while still alive.  Legislation to permit abdication is necessary because emperors are currently required to serve for life under Japanese law. The previous voluntary abdication occurred in 1817 when the scholarly Emperor Kokaku retired after an exceptionally long reign. Following approval by the Cabinet, the bill must still be debated and approved by the Japanese parliament, but plans are already being made for Akihito to pass the throne along to Naruhito on New Year’s Day 2019. Another possible date is Emperor Akihito’s birthday on December 23rd, although that would be inconvenient for the Japanese calendar since beginning a new imperial “era” in the middle of a year is complicated. Japan Times offers a preview of how the ceremony might proceed: The likely location for the abdication ceremony of Emperor Akihito is the Imperial Palace. The timing of the event will be either before or after      a ceremony to hand down traditional properties, such as the sacred sword and jewels, to the new emperor, the sources said. After the handing of properties ceremony, which marks the completion of the throne ascending procedures, the new emperor is to hold the    first audience ceremony to meet with the heads of the   administrative and judicial systems. The government is planning to hold those ceremonies by the end of 2018, and an enthronement ceremony, called    that formally announces the new emperor’s accession sometime in 2019. Channel News Asia observes that there has been some anxiety about the shortage of princes to take over after Naruhito only a handful of other male relatives  —   four, by the most generous count  —   are eligible to follow Naruhito.  “The scarcity of young men in the family has prompted talk of alternatives, including letting women ascend the throne, though traditionalists abhor the idea,” Channel News Asia reports. Other ideas include expanding the size of the royal family to make more distant relations eligible for the throne, for instance by permitting female royals to marry commoners without losing their royal status. Such is the situation currently confronting    Princess Mako, Akihito’s oldest granddaughter, who is engaged to marry a young man who works at a law firm. Her aunt Princess Sayako, Akihito’s only daughter, likewise surrendered royal status by marrying a commoner in 2005. '"}, "time": 1742561833.1083765}