{"duration": 0.06156039237976074, "input_args": {"text": "'SYDNEY, Australia  —   That map of Australia you have? It’s wrong. And the whole country is going to officially relocate to correct the error. The trouble is caused by plate tectonics, the shifting of big chunks of the earth’s surface. Australia happens to be on one of the   pieces of all, and by geological standards it’s practically flying: about 2. 7 inches northward a year, with a slight clockwise rotation as well. People on the ground may not notice, but the Global Positioning System does. So Australia needs to adjust its longitudes and latitudes so they line up with GPS coordinates. Four times in the last 50 years, Australia has reset the official coordinates of everything in the country to make them more accurate, correcting for other sources of error as well as continental drift. The last adjustment, in 1994, was a doozy: about 656 feet, enough to give the delivery driver an alibi for ringing your neighbor’s doorbell instead of yours. “You might think, ‘Where’s my pizza? ’” said Dan Jaksa of Geoscience Australia, the government agency that worries about the coordinates. But something bigger is at stake, he said: intelligent transportation systems that rely on the finer accuracy that will come with the next generation of GPS technology. The next adjustment, due at the end of the year, will be about 1. 5 meters (4. 9 feet)  —   not really enough of a discrepancy to throw off   satellite navigation systems, which are generally accurate only to within 15 to 30 feet. But the next generation of GPS devices, using both satellites and ground stations, will be accurate to within an inch or less, and new technologies that depend on precise location will be important to Australia’s future. The mining company Rio Tinto already has 71 immense ore trucks rumbling around iron mines in the remote Pilbara region of Western Australia that are guided remotely from an office in Perth, 930 miles away. Pilots who patrol the Anna Creek cattle ranch in South Australia must pick out small water bores in the ranch’s 8, 880 square miles of dry pasture, an area larger than Israel, where small errors can equate to big misses. “If we get a new pilot, he’s relying on GPS until he finds his way around landmarks,” said the ranch manager, Norm Sims. Not to mention driverless cars. “If you’re 1. 5 meters out,” Mr. Jaksa said, “you’re potentially on the wrong side of the road. ”'"}, "time": 1742561815.4821105}