{"duration": 0.038374900817871094, "input_args": {"text": "\"You are here: Home / US / Ethan Hawk Weighs In on Election, Insults MILLIONS Of Americans Ethan Hawk Weighs In on Election, Insults MILLIONS Of Americans October 26, 2016 Pinterest \\nEthan Hawke — that guy who was in that movie, or something — just claimed that it was “fascist” to hold Hillary Clinton accountable for the crimes she has committed. Oh and he also said that wanting to make American great again was racist. \\nThe Daily Beast published an interview with Hawke, gracing us with the musings of a man who should stick to memorizing the lines that someone else wrote for him. Then again, that’s what he did, he spewed liberal talking points. This is also known as the “stuff people incapable of higher level thinking” say in interviews to get attention. \\n“When you see a man, if he wins, threatening to put his opponent in jail?” Hawke said in reference to Donald Trump promising that he would hold Clinton accountable for breaking the law. “That’s fascist behavior.” \\nYeah, you guys (oops, I forgot that’s sexist but fortunately I also just remembered that I don’t care). Anyway, Hawke may not understand how the law works, but it’s pretty simple, even for him. If you break a law, consequences are supposed to follow. \\nFor most of us, there are consequences, but Clinton has been held to a different set of standards than the rest of us. Just ask retired 4-star Gen. James Cartwright how that works — he’s facing jail time and a fine for doing something quite similar to Clinton yet she’s still running for president. \\nLet’s take a gander at the definition of Fascism from Dictionary.com : \\nnoun \\n1. \\n( sometimes initial capital letter ) a governmental system led by a dictator having complete power, forcibly suppressing opposition and criticism, regimenting all industry, commerce, etc., and emphasizing an aggressive nationalism and often racism. \\nAll you have to do is swap out “nationalism” for “globalism” and that definition fits Clinton like a glove. Complete power, suppression of free speech, control of the economy, globalism, and racism are Clinton’s platform. \\nLiberals like to throw the word fascism around because they think it makes them sound smart, but far more often than not the fascist label is much more befitting of the liberal candidate than the conservative, and in this case especially, it is a fine example of what a Clinton presidency would look like. \\nHawke also called Trump’s campaign slogan, “Make America Great Again, racist in the interview. “What ‘Make America Great Again’ means is not lost on any of us,” Hawke said. “It means ‘white’ and ‘male.'” \\nIs that what it meant when former President Bill Clinton used it during his wife’s 2008 presidential campaign? If so, boy, that makes things awkward, doesn’t it? Slick Willy also used the phrase back in 1992 during his own campaign.\""}, "time": 1742563640.8259776}