{"duration": 0.05208706855773926, "input_args": {"text": "'Leave a reply \\nNick Hodge – The theme of all things “Outsider” has cropped up once more. \\nThis time in the form of the election of Donald Trump to the White House — the first such electee with neither political nor military experience. A true Outsider. \\nThe New York Times captured it perfectly if unintentionally in an article today: Journalists, it said “portrayed Trump supporters as out of touch with reality. In the end, it was the other way around.” \\nThe Establishment is out of touch with reality. No one told them being an Outsider was in. \\nAs well, no one told them that, despite their Fed-induced papered-over recovery in which 95% of the wealth gained in the U.S. since 2009 went to the top 1%, most of the country is utterly pissed off. \\nThat’s what you saw last night: high turnout of the pissed off vote. \\nPissed off at all the things we’ve covered in these pages for years: – Political payola – Continued bank scandals with no prosecution – Incessant war – No wage growth (over half of full-time workers make $30k or less) – Complete civilian surveillance – General ‘above the law’ attitude of elites \\nHillary Clinton was a true poster girl of the Establishment, and the election easily became a referendum on it and her rather than anything else. \\nDonald Trump didn’t win. The Establishment lost. \\nI say this not as a Trump supporter. Indeed, I voted for Gary Johnson. \\nRather, I’m simply pointing out that, as they have been for years, Outsiders are now rising up. They, and their ideas. \\nThere’s still much further to go, of course, for America to get back on track. But I truly view the election of an Outsider as one small step in the right direction. \\nAt least the general electorate is finally repudiating the status quo. \\nThe years ahead are going to be interesting — politically, economically, and financially. SF Source The Outsider Club  '"}, "time": 1742564356.2584245}