{"duration": 0.10231876373291016, "input_args": {"text": "'If Donald J. Trump’s first news conference as   was a raucous, chaotic affair on Wednesday  —   and it was  —   the parody of it on “Saturday Night Live” was somehow calmer and more organized than the actual event. Still, the “S. N. L. ” sketch pulled few punches as it swung at the show’s most powerful, persistent critic, mocking Mr. Trump on a range of subjects, including the perceived lack of star power at his coming inauguration his opaque plan to divest himself from his businesses and the possibility that Russia possessed unverified compromising information on him. Saturday night’s episode, the first new one of 2017, once again featured Alec Baldwin as Mr. Trump. He started off the faux news conference by vowing to answer what he said was “the question that’s on everyone’s mind. ” “Yes, this is real life,” he said. “This is really happening. On January 20, I, Donald J. Trump, will become the 45th president of the United States. ” He continued: “And then, two months later, Mike Pence will become the 46th. ” Listing the performers who are scheduled for his inauguration, he cited the rock band 3 Doors Down, “Jackie What’  ” from “America’s Got Talent” and “the one Rockette with the least money in her savings. ” (He also said the actors Angelina Jolie, Ryan Gosling and Jennifer Lawrence would be in attendance “courtesy of Madame Tussauds. ”) Turning to questions from reporters played by the “S. N. L. ” cast, Mr.    pointedly refused to answer questions about an alleged compromising videotape, because, he said, “it didn’t happen and it wasn’t as cool as it sounded. ” Asked by a reporter played by Sasheer Zamata how he planned to repeal and replace Obamacare, Mr. Baldwin said, “I actually do have a replacement plan, O. K.? I just read about it this week. It’s a terrific plan. Just great. It’s called the Affordable Care Act. ” When Ms. Zamata’s character said that repealing Obamacare meant that people could die, Mr. Baldwin replied, “Listen, sweetheart, I’m about to be president, we’re all going to die. ” As the   Mr. Baldwin went on to say that he was turning his companies over to his sons, “Beavis and  . ” (“You can tell they’re good businessmen because of how   their hair is,” he said.) Recreating another scene from the news conference, the “S. N. L. ” cast member Cecily Strong appeared as Sheri A. Dillon, a tax lawyer for Mr. Trump who spoke at the actual news conference. In a low monotone, Ms. Strong motioned toward a large pile of   papers in various folders that she said proved Mr. Trump was divesting from his companies. “If he wasn’t divesting, how could there be so many damn papers?” she said. The “S. N. L. ” sketch repeated Mr. Trump’s angry repudiation of the news media organization BuzzFeed, which he called “a failing pile of garbage. ” (In the sketch, Mr. Baldwin said he was dissatisfied with the results of a BuzzFeed quiz. “I’m not a Joey, I’m a Rachel,” he said, referring to the “Friends” characters.) There was also a gentle reenactment of Mr. Trump’s refusal to take questions from the CNN White House correspondent Jim Acosta. “You’re fake news,” Mr. Baldwin said in the sketch. “I tried to watch your network last night, and there was just some crazy blond woman spouting lies. ” Bobby Moynihan, playing Mr. Acosta, answered: “That was Kellyanne Conway. ” Finally, after acknowledging to a reporter that Russia probably played a role in hacking the election, Mr. Baldwin took one last question from the cast member Beck Bennett. Though the   Mr. Bennett clearly appeared to be playing President Vladimir V. Putin of Russia, he said, in a thick Russian accent, “I am American journalist Wolf Blitzer. Are you sure Russia was behind hacking?” Then he held up a potentially incriminating videotape and asked, “But are you really, really sure?” Mr. Baldwin stammered in reply, “It was China. I mean Canada. It was Meryl Streep. ” Ever since Mr. Trump hosted the program in November 2015 while still vying for the Republican presidential nomination, he has made no secret of his dislike for how “Saturday Night Live” and Mr. Baldwin have portrayed him. After some sketches this season, Mr. Trump has gone on his Twitter account to air his grievances, writing, for example, that the show is “unwatchable,” “totally biased” and “not funny,” and that Mr. Baldwin’s impersonation of him “just can’t get any worse. ” At other times, Mr. Trump has not responded to the show. During Saturday’s opening monologue, Tina Fey, the “S. N. L. ” alumna and “30 Rock” star, offered some advice to the actress Felicity Jones, a   guest host. No matter how the show goes, Ms. Fey said, “The president of the United States will say that it’s sad and overrated. ” She added, “It’s fine, no one cares. ” And then TV viewers warily turned their eyes to Twitter to see what, if anything, would happen next. Late Sunday afternoon, Mr. Trump did respond with a tweet critical of the show, caling it “the worst of NBC,” adding, “Really bad television!”'"}, "time": 1742561880.4888518}