{"duration": 0.039711713790893555, "input_args": {"text": "'Home » Headlines » World News » Wikileaks Releases Clinton Foundation BOMBSHELL: “If This Story Gets Out, We Are Screwed” “If This Story Gets Out, We Are Screwed” John, I would appreciate your feedback and any suggestions I’m also starting to worry that if this story gets out, we are screwed… We’ve been waiting for a SMOKING GUN Wikileaks release. Today, it appears we got just that, courtesy an email from Doug Band to Cheryl Mills and John Podesta dated November 12, 2011. \\nBand sent Podesta an email concerned that Bill and Hillary’s daughter Chelsea was threatening business as usual at the Clinton Foundation, and apparently was concerned the Clinton daughter would discover the true extent of the criminal fraud and corruption, telling Podesta, “ if this story gets out, we are screwed.” Was Comey’s FBI letter to Congress on Friday merely a ploy to distract media attention from a SMOKING GUN Wikileaks release? \\nDecide for yourself… \\nFull Wikileaks email : \\nNeed get this asap to them although I’m sure cvc [Chelsea Clinton] won’t believe it to be true bc she doesn’t want to Even though the facts speak for themselves. \\nJohn, I would appreciate your feedback and any suggestions I’m also starting to worry that if this story gets out, we are screwed . Dk [Declan Kelly] and I built a business. 65 people work for us who have wives and husbands and kids, they all depend on us. \\nOur business has almost nothing to do with the clintons, the foundation or cgi in any way . The chairman of ubs could care a less about cgi. Our fund clients who we do restructuring and m and a advising the same just as bhp nor tivo do. These are real companies who we provide real advice to through very serious people. Comm head for goldman, dep press secretary to bloomberg, former head of banking, and his team, from morgan stanley for asia and latin am. \\nI realize it is difficult to confront and reason with her but this could go to far and then we all will have a real serious set of other problems . I don’t deserve this from her and deserve a tad more respect or at least a direct dialogue for me to explain these things. She is acting like a spoiled brat kid who has nothing else to do but create issues to justify what she’s doing because she, as she has said, hasn’t found her way and has a lack of focus in her life. I realize she will be off of this soon but if it doesn’t come soon enough…'"}, "time": 1742564218.3373024}