{"duration": 0.023131847381591797, "input_args": {"text": "'Sen. Bernie Sanders ( ) said the Democrats lost to   Donald Trump because they are out of touch with America. [“I happen to believe that the Democratic Party has been not doing a good job in terms of communicating with people in cities, in towns and in rural America, all over this country,” Sanders said in an interview on NPR’s Morning Edition.  The Vermont senator, who ran for president on the Democratic ticket and then switched back to Independent after losing the primary to defeated former Secretary of State Hillary Clinton, added, “Look, you can’t simply go around to wealthy people’s homes raising money and expect to win elections. You’ve got to go out and mix it up and be with ordinary people. ” Sanders and Trump both ran on a platform that pushed against the political establishment, and both were successful at tapping into the   base. However, it was arguably Clinton’s decision to ignore her husband’s advice that contributed most to her loss in the general election. Former President Bill Clinton suggested that Hillary court   white men, a demographic that has long been ignored by the Democratic Party. Sanders told NPR that Trump has a choice: “Either he can have the courage and get up in front of the American people, or do it through a Tweet, and say, ‘You know what? Hey, I was just kidding. I was really lying. ’” Or, he suggested, Trump can tell his fellow Republicans that “the right thing to do” is stop wasting their time on legislation that cuts programs. “And I look forward to Trump telling the American people that that is what he intends to do,” Sanders said. It is unlikely Trump will take up either of Sanders’ suggestions. Sanders and other Democratic leaders have called for a “Day of Action” on January 15  —   ahead of Martin Luther King, Jr. Day  —   “to vigorously oppose the Republican plan to end Medicare as we know it and throw our health care system into chaos,” according to a December 28 letter addressed to colleagues and signed by Sanders, Senate Minority leader Chuck Schumer ( ) and House Minority Leader Nancy Pelosi ( ). The letter adds, “Millions of Americans voted for Donald Trump after he promised not to cut Social Security, Medicare and Medicaid. He must be held to his promises and should veto any legislation which cuts these vital and necessary health programs. ” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742628584.6874554}