{"duration": 0.1515204906463623, "input_args": {"text": "'LIVERPOOL, England  —   Jackie O’Neill, a    administrative assistant, was explaining the other day why Britain should vote to divorce itself from the European Union in this month’s referendum. As she enumerated her many grievances, I couldn’t help thinking of the scene in Monty Python’s “Life of Brian” in which a bunch of disaffected Judeans sit around, complaining about the Romans. “They’ve bled us white, the bastards,” says their leader, Reg, played by John Cleese. “And what have they ever given us in return?” His colleagues mention a few things, by way of example. O. K. Reg says. “But apart from the sanitation, the medicine, education, wine, public order, irrigation, roads, the freshwater system and public health, what have the Romans ever done for us?” Even Britain’s most enthusiastic European Union supporters would not argue that Europe has been quite so helpful to their country, of course. But as chance would have it, Ms. O’Neill was heaping her abuse on Europe in a spot that has been a particularly enthusiastic recipient of European largess over the years. So when she declared, of the European Union, “We’re subsidizing them, and what do we get out of it except for a load of laws that we don’t vote for?” it was an easy question to answer. For one thing, there was the large building directly behind her, the Echo Arena and BT Convention Center. When the complex was built, in 2008, Europe kicked in 50 million pounds. “Well, I’ve never been to the Echo Arena,” Ms. O’Neill said. Just as many Britons feel emotionally apart and even alien from Europe, so they see the European Union as an opaque, bewildering abstraction, a mysterious bureaucratic behemoth that hoovers up their money and independence while giving little (or nothing) in return. British understanding of its workings and purpose has not been helped by the    arguments being thrown around in the debate over the referendum, set for June 23. No one likes having this debate anyway, much less the unpleasantly       descriptions of its sides: “Brexit” (go) and “Remain” (stay). But underlying all the dire predictions of doom  —   that staying or going will cause Britain to fall apart in various apocalyptic ways  —   is a deeper emotional issue that speaks to the country’s sense of self. Who does it think it is, and where does it think it belongs? Has it ever felt like it’s part of Europe? Separated from the Continent by language, tradition, historic antagonism and an inhospitable body of water, Britain has always seemed to be an uneasy participant in the wider European project. It took years to sign up, and its agreement was always marked by caveats and exceptions to the rules. Even when it did join, it felt to many Britons as if someone had given a British pub owner a bunch of fancy French Champagne bottles and said, “Here, use these for your British ale from now on. ” The trappings might be different, but the beer is still the same. In the 15 years I lived in London (I returned home to the United States three years ago) I was constantly struck by the sense of otherness with which many English people regarded Europeans. (It’s more complicated for Scots, whose mistrust of Britain’s   government makes them more   and for younger people and Londoners, who generally feel part of a wider world.) But travel around England, talking to older people, and you find below the surface a sense of unease, of distrust. Even people who believe that Britain should stay in the European Union, for economic and trading purposes, do not feel very European. At every turn, Britain proclaims its singularity. Most countries fly the European flag next to their national flags Britain doesn’t. Most of Europe uses euros Britain uses pounds. British airports have a passport line that says “British and E. U. Passports. ” British politicians in the last 20 years have increasingly talked about British values and British traditions, about what sets Britons apart from Europeans rather than what they have in common. British people don’t speak the same language as other people in the European Union  —   not literally, not metaphorically. This is a country where one of the main railroad stations, Waterloo, commemorates Napoleon’s defeat by the British, where a serious objection to building the Channel Tunnel was that it might encourage rabid animals to sneak in from France, and where Beauchamp Place in London is pronounced “ . ” The idea that things are easily lost in translation is reflected in the opening line of P. G. Wodehouse’s “The Luck of the Bodkins,” as a Briton confronts the daunting prospect of having to make himself understood on the Continent. “Into the face of the young man who sat on the terrace of the Hotel Magnifique at Cannes,” Wodehouse writes, “there had crept a look of furtive shame, the shifty, hangdog look which announces that an Englishman is about to talk French. ” The   special relationship with the United States isn’t providing much comfort to the Brexit side these days President Obama’s recent admonition to vote no in the referendum enraged many people who believe America should stay out of it and let their country think for itself. As for Europe, some of the British sense of dissonance comes from loss of empire and the country’s complicated feelings about World War II, a moment that showed Britain at its shining best while simultaneously stripping it of its position as a major international power. And some of it stems, simply, from an   sense of otherness. “I might be part of the E. U. but I live on an island,” said Alan Lyon, 49, who shovels cullet  —   broken glass  —   in a glass factory. Mr. Lyon’s    lost both legs in World War I his grandfather fought in World War II. “We couldn’t mention Germany or France around him, he hated them so much,” he said. Britain’s populist tabloids have a long history of slipping happily into   remarks. “Up Yours Delors” read a famous headline in 1990 in The Sun, urging its readers to tell Jacques Delors, then the French head of the European Commission, to “frog off. ” (Mr. Delors supported increased European economic integration, which The Sun did not.) Prince Harry once wore a Nazi commandant costume to a party. And in 2006, officials specifically warned fans traveling to Germany for a soccer match not to do things like shout “Sieg heil” at the referees, or to put their fingers under their noses in a way meant to evoke Hitler’s mustache. Perhaps the favorite television episode here is one on “Fawlty Towers” when a hotel owner, played (again) by Mr. Cleese, responds to a group of German guests by lapsing into xenophobic insanity,   around the dining room and referring to prawn cocktail as “prawn Goebbels. ” (“You started it,” he says when the traumatized customers object. “You invaded Poland. ”) The   side has tapped into   feeling by conflating the European migrant crisis with what many Britons see as a local immigration crisis caused by lax European laws and porous European borders. In their view, the country is being overrun by foreigners who not only take their jobs and welfare benefits, but also bring fundamentally different values into Britain. Recently, Britons were appalled at the news that a German comedian who went on television and recited a rude poem about Recep Tayyip Erdogan, the Turkish president, is to be prosecuted under a German law prohibiting the insulting of foreign leaders. As a way to thumb its nose at both Germany and Turkey, the influential   Spectator magazine started a “President Erdogan Offensive Poetry” competition, inviting readers to submit   limericks. The winner was Boris Johnson, the former mayor of London and leader of the Brexit campaign, who implied in his poem that Mr. Erdogan was overly fond of goats. Announcing the winner in the magazine, Douglas Murray, who organized the competition, said the existence of the poem (and of Mr. Johnson) showed Britain’s superiority over Germany, which is part of the European Union, and Turkey, which would like to be. “I think it a wonderful thing that a British political leader has shown that Britain will not bow before the putative caliph in Ankara,” he said. “Erdogan may imprison his opponents in Turkey. Chancellor Merkel may imprison Erdogan’s critics in Germany. But in Britain we still live and breathe free. ”'"}, "time": 1742561647.2634995}