{"duration": 0.047868967056274414, "input_args": {"text": "' Guardian Plays Robin to MI5\\x92s Batman By Jonathan Cook\\n Today the Guardian offers decisive confirmation that it is only too willing to serve as an establishment mouthpiece. It proudly announces that it is the venue selected by Andrew Parker, the head of MI5, Britain\\x92s FBI, to receive the agency\\x92s first-ever newspaper interview.\\nIf the Guardian were a proper independent newspaper, it would regard this interview as a stain. Instead it bills it as a front-page \\x93exclusive\\x94. Exclusively, the Guardian has been given the chance to regurgitate MI5\\x92s propaganda \\x96 propaganda designed to help stoke a new Cold War with Russia.\\nIn fact, this is not an \\x93interview\\x94 as the Guardian claims, for the simple reason that the paper\\x92s two \\x93interviewers\\x94 \\x96 one of them its deputy editor, Paul Johnson \\x96 have no basis on which to question the quality of the \\x93classified\\x94 information they are being fed.\\nEverything Parker tells them could have been guessed at without the interview:\\nthe Russians under Vladimir Putin are an evil empire; Islamic jihadists are everywhere but MI5 is brilliant at foiling their terror attacks; the increased budget MI5 has received is entirely justified because it is doing such a brilliant job of foiling terror attacks; MI5\\x92s extra powers to surveil us all are necessary to foil those terror attacks; whatever happens with Brexit, MI5 will continue doing a brilliant job protecting the British people; MI5 is determined to become a friendlier place for women and minority ethnic applicants. This isn\\x92t journalism, it\\x92s the very definition of stenography.\\nEven the Guardian seems to sense that its readers might wonder why this interview is being published in their newspaper. But rather than discuss why the Guardian would want to publish an interview with Parker, the paper asks the opposite question: why has MI5 chosen the Guardian? This is framed in a way to make it look as though Parker has entered a combative environment in coming to the Guardian. The paper reminds us that it broke the Edward Snowden story.\\nIn fact, the Guardian\\x92s Snowden revelations seem like another era. Remember that the Guardian got access to Snowden\\x92s documents only via their star columnist Glenn Greenwald, who has since departed after what appeared to be an increasingly troubled relationship, especially after the Snowden revelations. Instead Parker is once again given an opportunity to attack Snowden, accentuating the \\x93damage that was done to the work of British and allied intelligence agencies\\x94 by Snowden\\x92s efforts to bring to public attention the systematic and secretive invasions of our privacy.\\nThe Guardian is in far more comfortable territory playing Robin to MI5\\x92s Batman.\\nSo why has Parker selected the Guardian rather than, say, the more obviously establishment London Times?\\nBecause the Guardian\\x92s articles are not behind a paywall and so are easily accessible to anyone online? Because it has become the preferred British news source for American elites, whose own media are even more servile to power? Because the Guardian\\x92s (unjustified) reputation for leftwing and critical journalism will bestow on this MI5 press release the necessary pretence that Parker has been subjected to tough questioning from the Guardian? Or because Parker knew that the Guardian would be as docilely accepting of his propaganda as any rightwing outlet of the corporate media?\\nDraw your own conclusions.\\nJonathan Cook is a Nazareth- based journalist and winner of the Martha Gellhorn Special Prize for Journalism'"}, "time": 1742562243.4652114}