{"duration": 1.6662650108337402, "input_args": {"text": "'Tesla, ‘World’s Safest Car,’ Explodes Like a Bomb By DailyBellStaff - November 05, 2016 \\n\\nFiery Tesla Crash Sends Flaming Batteries Shooting Like Projectiles, Killing Two In World’s Safest Car … When a Tesla Model S collided with a tree in downtown Indianapolis Thursday, an inferno erupted. The crash, which killed the driver and her one passenger, sent battery cells “firing off almost like projectiles around rescuers,” fire department officials told local NBC affiliate WTHR. “It hit that tree and it bounced around and all of a sudden it just exploded,” Al Finnell, an eyewitness, told the station. -IBD \\nThe world’s safest car just blew up like a bomb but that message seems to be getting lost amidst the larger coverage about Tesla. \\nFor years and years, Tesla has never made a nickel despite spending hundreds of millions of dollars. But the company is beloved by the predictable monetary elites that seek more and more control over the rest of us. \\nFounder Elon Musk offers that potential control. Every day, he works as hard as he can to ensure that sooner or later government will take away your ability to drive where you want when you want. \\nHere at DB, we’ve written several articles about Tesla ( here and here , most recently). We don’t like the car and much more than that, we don’t like the implications behind it. \\nElon Musk, CEO of Tesla, is fairly clear about his goals. He wants to create an electric, self-driving car. And he has Tesla fans throughout the US and the world. \\nExtend the logic and you come the inevitable conclusion that larger entities will have to support Tesla’s vision. These entities will surely be linked to some sort of government control. \\nDon’t pay your ticket? Have a confrontation of some sort outside of the home? Or simply fall afoul of one of a plethora of rules and regulations that increasingly hem-in behavior … and you will pay the consequences in terms of your driving life. \\nYou will get up in the morning and your car won’t start because someone has flagged your behavior. If you do manage to get your car started, it won’t go anywhere because its driving mechanisms have been disabled. \\nYou’ll have to go to court. You’ll have to pay a fine. Then you’ll be able to drive again. Or maybe not. Think driving is a “privilege”? Just wait. \\nWe could extend this logic beyond government. It’s perfectly possible that large private entities could have relationships with government that generate similar consequences. \\nWhy Musk has managed to attract fans for his cars given the inevitable results of his technology is a mystery to us. His ability to continue to fund his endless automotive depredations are a mystery as well. \\nIt is most probable that his access to funds has a lot to do with the maturation of his technology and the increasing governmental control it offers. \\nWe live in a time when technology is being celebrated as an enabler of freedom but it the kinds of technology that Musk is perfecting has little to do with freedom. No doubt it could, but not in the current climate. \\nThere are other issues as well. Musk is running a vast corporation with other people’s money. But if you look elsewhere you will see other titanic entities are throwing their resources behind the development of technology, especially robots. \\nIt would be one thing if these technological innovations were being developed by entrepreneurs. But one of the biggest developer of robot technology – deadly technology at that – is the Pentagon. \\nSince we’ve already seen movies about deadly robots, we’re not shocked by the idea of what the Pentagon is doing. But that doesn’t make it much better. \\nHow many people wake up in the morning and decide they’re going to build a robot that will kill people automatically? \\nBut that’s what is going on. This technology is being developed by huge corporations with virtually unlimited funds. These corporations wouldn’t exist without monopoly central banking and a variety of rules and regulations to support them and ensure they have little or no competition. \\nThe world today is technocratic and fascist. It is run by gigantic corporations that would not exist without laws and judicial decisions that guarantee their viability no matter how incompetently they operate. \\nThese corporations work hand-in-glove with governments around the world. Both the corporations and governments are run secretly by the same banking cabal that runs central banking via the Bank for International Settlements in Switzerland. \\nIn other words, the technological progress that we are supposed to celebrate is actually being organized for nefarious purposes. It wouldn’t exist in the form it does without vast entities that have turned their energies toward perfecting technology that is intended to create additional control, not freedom. \\nA normal entrepreneurial society in which individuals and groups applied technology with an eye toward marketplace acceptance might end up with completely different kinds of technology. \\nMany people might reject self-driving cars and killer robots – at least without proper safeguards. \\nBut we don’t have normal societies in the world, for the most part. Instead we have people like Elon Musk who builds “the world’s safest car,” albeit one that explodes like a bomb at high impact. \\nMore: \\nThe impact knocked the wheels off of the car before the batteries caught fire and exploded. Speckman died at the scene while her passenger, 44-year-old Kevin McCarthy, died at the hospital. \\nWhat else do we learn? “’Lithium-ion battery cell fires are tough to put out,’ Indiana Fire Trucks Battalion Chief Kevin Jones said.” \\nThe Tesla Model S is “known” for being fabulously safe. As the article informs us, it achieved the highest National Highway Traffic Safety Administration rating of any car ever tested. \\nConclusion: Except when it explodes.'"}, "time": 1742562393.235345}