{"duration": 0.15812420845031738, "input_args": {"text": "'The war on UNESCO: Al-Aqsa Mosque is Palestinian and East Jerusalem is illegally occupied By Ramzy Baroud \\nDid Italian Prime Minister Matteo Renzi actually read the full text of the UNESCO resolution on Palestine and Israel, before he raved with anger ? \\n“I think this is a mistaken, inconceivable resolution,” he said. \\n“It is not possible to continue with these resolutions at the UN and UNESCO that aim to attack Israel. It is shocking and I have ordered that we stop taking this position (his country’s abstention) even if it means diverging from the position taken by the rest of Europe,” he added. \\nRenzi, who became prime minister in 2014 at the relatively young age of 39 knows exactly how the game is played. In order to win favor with Washington, he must first please Tel Aviv. \\nHis country has abstained from the October 12 vote on a resolution that condemns Israel’s violations of the cultural and legal status of Occupied East Jerusalem. This decision has ignited the ire of Israeli Ambassador to Rome Ofer Zaks who riled up the Jewish community in Italy to protest the abstention. Renzi, in turn, was converted into a champion of the ‘Temple Mount,’ the name Israel uses to describe the Palestinian Muslim holy site. \\nRenzi cravenly went on damage control mode without truly understanding the nature of the resolution, which merely condemned Israel’s obvious violations of international law, and only calls for Israel to respect the status of Palestinian culture in the occupied city. \\nNone of procedures that led to the vote on the UNESCO’s resolution —voted by 24–6, with 26 abstentions—violated protocol, nor was any of the wording inconsistent with international law. In fact, UNESCO was merely doing its job: attempting to protect and preserve the historical and cultural heritage of the world. \\nJerusalem is a sacred and a holy city to a majority of humanity, simply because it is significant to the spiritual wellbeing of the adherents of the three monotheistic religions. In fact, the resolution stated so : “Affirming the importance of the Old City of Jerusalem and its Walls for the three monotheistic religions . . .” \\nRenzi’s outburst is quite disappointing, to say the least, for the young, eager politician simply tried to score cheap political points with Israel—thus the United States—without a full, or even partial comprehension of what the UNESCO resolution resolved. Nor did he seem aware of the fact that such text is largely a repeat of what has been discussed by the world’s leading cultural organization in April, and repeatedly before that date. \\n“If anyone wants to say something about Israel, let them say it, but they should not use UNESCO . . . To say that the Jews have no links to Jerusalem is like saying the sun creates darkness,” he said, paraphrasing the sentiment displayed by the Israeli Prime Minister. \\nIt would be rather sad if Renzi sees a mentor in Benjamin Netanyahu, for the latter is one of the least liked world leaders who has made a mockery of international forums and derided the United Nations itself as anti-Semitic and its process as ‘theater of the absurd.’ \\nThis is what Netanyahu had said in response to the resolution and shortly before he suspended his country’s membership in UNESCO. Using a language that is as amusing as his cartoon depiction of the Iranian nuclear bomb in his famous UN spectacle in 2012, he said: “To say that Israel has no connection to the Temple Mount and the Western Wall is like saying that China has no connection to the Great Wall of China or that Egypt has no connection to the Pyramids.” \\nOther Israeli officials followed suit with a chorus of denunciations, included Israeli President Reuven Rivilin, who described the decision as an “embarrassment” for UNESCO. Culture Minister, Miri Regev, cut to the chase, by labeling the resolution “shameful and anti-Semitic.” \\nIn fact, it was neither. \\nIn addition to Renzi’s odd reaction, the United States and other Western governments reacted with exaggerated anger, again without even addressing the situation on the ground, which prompted the resolution—and numerous other UN resolutions in the past—in the first place. \\nEven the Czech parliament jumped on board , voting to condemn what they described as a “hateful, anti-Israel’ sentiment.” \\nI have read the resolution repeatedly to pinpoint the specific text that could possibly be understood by Israel’s friends as hateful, to no avail. The entirety of the text was based on past international conventions, resolutions, international law, and refers to Israel as the Occupying Power, as per the diktat of the Geneva Conventions. \\nThe Italian, Czech, American anger is, of course, misdirected and is largely political theater. \\nBut, of course, there is an important context that they refuse to address. \\nIsrael is working diligently to appropriate Muslim and Christian heritage in East Jerusalem, a city that is designated by international law as illegally occupied. \\nThe Israeli army and police have restricted the movement of Palestinian worshipers and is excavating under the foundation of the third holiest Muslim shrine, Haram al-Sharif, in search of a mythological Temple. \\nIn the process of doing so, numerous Palestinians, trying to defend their mosque from the attacks staged by Israeli occupation forces and extremist Jewish groups, have been killed. \\nHow is UNESCO to react to this? \\nThe resolution merely, ‘called on Israel’ to “allow for the restoration of the historic status quo that prevailed until September 2000, under which the Jordanian Awqaf (Religious Foundation) Department exercised exclusive authority on Al-Aqṣa Mosque/Al-Ḥaram Al-Sharif.” \\nMoreover, it ‘stressed,’ the “urgent need of the implementation of the UNESCO reactive monitoring mission to the Old City of Jerusalem and its Walls.” \\nWhere is the ‘hate’ and ‘anti-Semitism’ in that? \\nIsrael’s anger is, of course, fathomable. For nearly fifty years, following the illegal occupation and annexation of the Palestinian Arab city, Israel has done everything it could possibly do to strip the city of its universal appeal and Arab heritage, and make it exclusive to Jews only—thus the slogan of Jerusalem being Israel’s ‘eternal and undivided capital.’ \\nIsrael is angry because, after five decades of ceaseless efforts, neither UNESCO nor other UN institutions will accept Israel’s practices and designations. In 2011, following the admission of ‘Palestine’ as a member state, Israel ranted and raved as well, resulting in the US cutting off funding to UNESCO. \\nThe latest resolution indicates \\nSince its establishment atop Palestinian towns and village, Israel has been on a mission to rename everything Arabic with Hebrew alternatives \\nDr. Ramzy Baroud has been writing about the Middle East for over 20 years. He is an internationally-syndicated columnist, a media consultant, an author of several books and the founder of PalestineChronicle.com. His books include “Searching Jenin,” “The Second Palestinian Intifada” and his latest “My Father Was a Freedom Fighter: Gaza’s Untold Story.” His website is www.ramzybaroud.net This entry was posted in Commentary  '"}, "time": 1742562988.6336927}