{"duration": 0.07959437370300293, "input_args": {"text": "'Thursday on Fox News Channel’s “Tucker Carlson Tonight,” Washington Post columnist Charles Krauthammer criticized 2016 Democratic presidential nominee Hillary Clinton for her remarks a day earlier at a tech conference in California.  Clinton avoided blaming herself for the loss, for which Krauthammer called “childish” and “pathetic. ” “Look, I know I’m in a minority with conservatives, but I actually feel sorry for her,” Krauthammer said. “I have a soft spot. It could be because I was in my youth a liberal. I retain the marshmallow deep inside of my heart that I try not to betray these days. But it’s a pathetic performance. It’s sort of childish. She can’t accept responsibility. She has practiced at this where she says  —   I love in one of her riffs she says was a perfect candidate? No. Did I make mistakes? Yes. These are rhetorical devices, whoever said she was a perfect candidate? She was a terrible candidate. She was the worst of imaginable. I mean just look at the fact she couldn’t shake the challenge of a    socialist, who, this is the best part about Bernie Sanders, honeymooned in the Soviet Union. She couldn’t shake his challenge for six months. ” “By the way, Lindsey Graham once said about Bernie and the Soviet Union, yes, and he never left,” he continued. “That was her challenge, and she had the DNC behind her. She complained about the DNC being against her. It’s not delusional. Losing an election, losing something you’ve been after for eight years probably 16 years is pretty hard. And I think her handlers are somebody who cares for her should have said don’t go out there. You wait a few more years, people will mellow to you. They want to remember details. Maybe they will have some affection for you. Michael Dukakis, Walter Mondale  —   these are people who didn’t elicit the same kind of antipathy she does because they didn’t wallow in  . ” Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742562728.9282837}