{"duration": 0.05491995811462402, "input_args": {"text": "'The hot topic for sports media is still that NFL quarterback Colin Kaepernick has not yet signed anywhere as a free agent, and at least one commentator now says that Kaepernick will never shake the accusation that he hates America. [ESPN’s Jemele Hill made an interesting point in a recent tweet saying that the NFL can excuse a lot of bad behavior by players, but Kaepernick’s perceived   is one that can’t be ignored.  No, he won’t. In the NFL you can   an abuser, a drunk driver and a multitude of sins. But an ” ?” Nope. https:  .   —   Jemele Hill (@jemelehill) March 22, 2017,  That is a solid point, for sure. The league has allowed wife abusers, drug users, past gang members, and tax cheats continue playing, but Colin Kaepernick’s transgression was against the whole country and seems far more than a mere personal failing, especially for a sport that wants to be considered as America’s game. Hill added another thought to the discussion after President Donald Trump took some measure of credit for Kaepernick’s troubles. Think we’ve seen the last of Kaep as an NFL player. There was a limited market before but after Trump’s comments, it’s a wrap. https:  .   —   Jemele Hill (@jemelehill) March 22, 2017,  The ESPNer is referring to Trump’s March 20 rally in Louisville, Kentucky, where the president slammed Kaepernick, broaching the subject by assuring the audience that no one wants a “nasty tweet from Donald Trump. ” As the crowd roared, the president continued, saying, “I said, if I remember that one, I’m going to the people of Kentucky because they like when people actually stand for the American flag. ” This is far from the first time Trump has criticized Kaepernick. Last August he told The Hill newspaper that maybe Kaepernick “should find a country that works better for him. ” The news that the 49ers   quarterback can’t find a new birth in the NFL is on the tongue of nearly every sports commentator, as Sporting News noted. To mention a few, Los Angeles Times sports columnist Bill Plaschke says Kaepernick is “clearly” being blackballed for his   protests, Mike Golic of ESPN2’s “Mike  Mike in the Morning” also noted that team executives and owners are wary about bringing Kaepernick’s sort of trouble to their teams, and Mike Freeman of Bleacher Report exclaimed that Kaepernick is being punished “for the crime of speaking his mind. ” Sports reporters aren’t the only ones claiming Kaepernick is being mistreated. A growing list of liberals are now insisting that the NFL’s pass on hiring the player is evidence of “racism. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742562763.025194}