{"duration": 0.10783815383911133, "input_args": {"text": "'OTTAWA  —   With Canada’s 150th anniversary looming next year, a gap was noticed in the country’s roster of patriotic icons. It had a national anthem, a national tree, two national animals, two national sports  —   but no national bird. That would not do. The United States has the bald eagle, Mexico the golden eagle, France the rooster. Down in El Salvador they have the   motmot. But Canada, one of the world’s major bird habitats, had gone a century and a half without ever choosing an avian avatar. Why? The Department of Canadian Heritage, the official government keeper of symbols, could not explain it. Neither could ornithologists, nor the editor of Canadian Geographic magazine, Aaron Kylie. So the Royal Canadian Geographic Society, which publishes the magazine and perhaps saw a chance for some nice publicity, took up the   task of selecting one. And boy, did it ruffle feathers. To get the public involved, the society set up a website where Canadians could vote for their favorite bird  —   but it did not promise to heed the result. (Nobody wanted something like the “Boaty McBoatface” online   debacle.) Instead, a panel of experts was given the final say. Prominent Canadian writers championed their favorites in the magazine’s pages, and the contest became a popular topic on (of course) Twitter under the hashtag #CanadaBird. The society even staged a public debate in September, with naturalists and Canada’s poet laureate, George Elliott Clarke, each backing a species. And then came the big reveal. The proposed Canadian national bird would be   …     the gray jay. The what? It’s a fluffy songbird found in all 13 of Canada’s provinces and territories, which is a plus. But it tends to stick to the deep northern woods, and isn’t often seen as far south as the strip of land along the American border where most Canadians live. To them, the gray jay is a stranger. David Bird, a professor emeritus of wildlife biology and an ornithologist at McGill University in Montreal, was the bird’s booster in the debate. In an interview, Professor Bird gave a long list of reasons. For example, he said that instead of migrating, the gray jay stays in Canada and nests through the winter, feeding on frozen food that it stashed away in the fall under the loose bark of spruce trees. Mating pairs are monogamous, he said, unlike many other species. And gray jays like people when they meet them, alighting on their clothing or hands in the hope of a snack. “You’ve got loyal, you’ve got friendly, you’ve got smart, you’ve got hearty: That’s what Canadians think we are,” Professor Bird said. What you haven’t got is huge popularity. When about 50, 000 people voted in the magazine’s online poll, the gray jay finished third, behind the loon, which adorns Canada’s   coin, and the snowy owl. “I know a lot of Canadians didn’t know what the gray jay was, and were asking: ‘Do I see it in my feeder? ’” Professor Bird said. “And there are still people angry because they felt the popular vote was not honored. ” Mr. Kylie, the editor of Canadian Geographic, said that the loon and snowy owl were excluded from final consideration because they were already used as symbols by the provinces of Ontario and Quebec. He said the relative unfamiliarity of the gray jay, also known as the whiskey jack, weighed on the plus side, not the minus. “We have an animal symbol, which is the beaver,” he said by way of analogy. “I would say that most Canadians don’t see a beaver in a given year. The fact that some Canadians don’t know this bird, I think, is all the more reason to have it proclaimed the national bird. ” Then you have the spelling of the bird’s names. Following the usual Canadian style, it ought to be called the grey jay, with an e, or the whisky jack, without one. The “gray” and “whiskey” spellings are seen (and resented) as Americanisms. The issue particularly vexes Dan Strickland, who began researching the bird as a graduate student at the Université de Montréal in late 1960s and continues to do so even after retiring as chief naturalist at Algonquin Provincial Park in Ontario. The spellings, he said, come from the American Ornithologists’ Union, which took it upon itself to determine official names for all the birds in North America. The union gave the species the Latin name Perisoreus canadensis, and at first, from 1886 to 1910, referred to it in English as the Canada jay. The union dropped all English bird names in 1910, but brought them back later, and the current ones stem from a sweeping revision of its naming system in 1957. Mr. Strickland, whose license plate reads GRAY JAY, said that if the government did adopt the bird as a symbol, it ought to legislate a Canadian name for it. “The bird is obviously a viable, valid contender to be the national bird,” Mr. Strickland said. “But it is entirely inappropriate for the Canadian national bird to have a name imposed by a   foreign body. The A. O. U. can fall into line for once, or do whatever they want. But they do not get to name our national symbols. ” However you spell it, the magazine’s proposal has met with a cool reception from officialdom. “At this time, the government of Canada is not actively considering proposals to adopt a bird as a national symbol,”   Herbert, the press secretary for Mélanie Joly, the heritage minister, wrote in an email. Even so, Professor Bird is among those now pushing to get a gray jay bill through Parliament somehow. And he expressed relief that another bird associated with Canada was never a real contender. “Canada goose? Over my dead body,” he said. “They’re basically pooping machines, and they’re obnoxious. If we had picked that bird, we would be getting a lot more outrage than we have now. ”'"}, "time": 1742561635.5983658}