{"duration": 0.12903809547424316, "input_args": {"text": "'WASHINGTON  —   Until Tuesday, the fight over Betsy DeVos’s nomination to be secretary of education revolved mostly around her support of contentious school choice programs. But her confirmation hearing that night opened her up to new criticism: that her long battle for school choice, controversial as it has been, is the sum total of her experience and understanding of education policy. In questioning by senators, she seemed either unaware or unsupportive of the longstanding policies and functions of the department she is in line to lead, from special education rules to the policing of   universities. Ms. DeVos admitted that she might have been “confused” when she appeared not to know that the broad statute that has governed special education for more than four decades is federal law. A billionaire investor, education philanthropist and Michigan Republican activist, Ms. DeVos acknowledged that she has no personal experience with student loans  —   the federal government is the largest provider  —   and said she would have to “review” the department’s policies that try to prevent fraud by   colleges. She appeared blank on basic education terms. Asked how school performance should be assessed, she did not know the difference between growth, which measures how much students have learned over a given period, and proficiency, which measures how many students reach a targeted score. Ms. DeVos even became something of an internet punch line when she suggested that some school officials should be allowed to carry guns on the premises to defend against grizzly bears. But if she was sometimes rattled on the specifics, Ms. DeVos was unshakable in her belief that education authority should devolve away from the federal government and toward state and local authorities. Whether the issue was allowing guns in schools, how to investigate sexual assault on college campuses, or how to measure learning, her answer was always that states and what she called “locales” knew best. Those answers reflected the same instinct that has driven her advocacy of school choice, primarily vouchers, which take money from public schools to help families pay tuition at private schools, and charter schools, which are publicly funded but typically independent of school district or union rules. As she said bluntly in a 2015 education speech, “Government really sucks. ” Ms. DeVos’s supporters defended her performance at the hearing, saying she showed herself to be a champion of innovation against Democrats’ defending the status quo. “They tried their best to turn her into Cruella de Vil, but America got to see the real Betsy DeVos first hand,” said Ed Patru, a spokesman for a group calling itself Friends of Betsy DeVos. “The country saw an authentic, compassionate and eminently reasonable education leader who is committed to empowering parents and putting kids first. ” With a   Senate, Ms. DeVos is still likely to be confirmed. But her statements on special education could make her vulnerable families of children with special needs are a vocal lobby, one that Republicans do not want to alienate. The federal Individuals With Disabilities Education Act, or IDEA, has governed special education in the nation’s public schools since the  . Before the law, states and local school districts had been excluding or essentially warehousing students with disabilities. Complaints from states and local school districts have been less about the law than about the federal government’s failure to pay its promised share of the costs. But at the hearing, Ms. DeVos questioned the basic premise that the federal government has a role in ensuring that any school receiving taxpayer dollars  —   whether a traditional public school, a charter or a private school accepting vouchers  —   comply with the law’s requirements for students with special needs. Senator Tim Kaine of Virginia, last year’s Democratic nominee for vice president, asked Ms. DeVos whether schools that receive tax dollars should be required to meet the requirements of IDEA. “I think that is a matter that’s best left to the states,” Ms. DeVos replied. Mr. Kaine came back: “So some states might be good to kids with disabilities, and other states might not be so good, and then what? People can just move around the country if they don’t like how their kids are being treated?” Ms. DeVos repeated, “I think that is an issue that’s best left to the states. ” “It’s federal law,” an exasperated Mr. Kaine replied. Mr. Kaine then asked if all elementary and secondary schools receiving tax dollars should be required to comply with reporting requirements on harassment, discipline and bullying. Ms. DeVos answered, “I would look forward to reviewing that provision. ” Senator Maggie Hassan, Democrat of New Hampshire, pressed Ms. DeVos about whether she really intended to say that states could ignore the law. “Were you unaware that it was federal law?” Ms. Hassan asked. Ms. DeVos answered, “I may have confused it. ” Ms. Hassan, who has a son with cerebral palsy, expressed concerns about private schools that accept vouchers on the condition that students waive legal rights under federal education law. “Do you think families should have recourse in the courts if schools don’t meet their needs?” she asked. “Senator, I assure you that if confirmed I will be very sensitive to the needs of special needs students,” Ms. DeVos said. “It’s not about sensitivity, although that helps,” Ms. Hassan countered. “It’s about being willing to enforce the law to make sure that my child and every child has the same access to public education,   public education. ” In her opening statement, Ms. DeVos spoke of wanting to expand options for higher education beyond traditional “brick and mortar and ivy. ” Senator Elizabeth Warren, a Massachusetts Democrat, asked Ms. DeVos whether she would enforce   education policies intended to prevent fraud at   colleges  —   institutions like Trump University, which paid to settle federal class action lawsuits accusing it of using marketing tactics to enroll students. “I will review that rule and see that it is actually achieving what the intentions are,” Ms. DeVos said. Ms. Warren, in apparent disbelief, responded: “Swindlers and crooks are out there doing back flips when they hear an answer like this. ” She added, “If confirmed, you will be the cop on the beat, and if you can’t commit to use the tools already available to you in the Department of Education, then I don’t see how you can be the secretary of education. ”'"}, "time": 1742563714.6815379}