{"duration": 0.09662604331970215, "input_args": {"text": "'Garrison Keillor’s “A Prairie Home Companion” signed off the air for good on Saturday evening, after 42 seasons, as millions of listeners, many in their cars on a holiday weekend, tuned in via public radio. With the exception of a telephone call from President Obama, the show, which was recorded Friday at the Hollywood Bowl in front of 18, 000 people, ambled along the way it always has. There were pretty   songs an ad for Powdermilk Biscuits a   “Lives of the Cowboys” skit a heartfelt version of “Every Time We Say Goodbye. ” The phone call was telling. The   Mr. Keillor refused to allow the conversation to be about himself. He praised Mr. Obama’s “dignity and wit and humor” and the fact he’d “never had an awkward moment in all these years. ” When the president was finally allowed to speak about Mr. Keillor, he said, “One of the reasons I miss driving is that you kept me company. ” “A Prairie Home Companion,” he said, “made me feel better and more human. ” Mr. Keillor responded with awkward silence. The segment of the show that promised a bit of stronger emotional drama was Mr. Keillor’s final monologue, his concluding “News from Lake Wobegon. ” And it delivered, in its way, by not trying too hard to deliver. It was, to borrow words the former New York Times critic Anatole Broyard once used to describe a middling Philip Roth novel, “reasonably funny, reasonably sad, reasonably interesting. ” If that sounds dismissive, it’s not meant to be. Mr. Keillor has always worn his storytelling gifts casually. Here, he seemed to take a page from “Pontoon” (2007) one of his Lake Wobegon novels, in which he wrote, “You get old and you realize there are no answers, just stories. ” Mr. Keillor liked to say that his fictional town’s name, Wobegon, comes from an also fictional Indian word that means “the place where we waited all day in the rain [for you]. ” His final monologue was 17 minutes long and opened with a hymn to rain. About sunny days, he asked, “How many do we deserve?” As a boy, he said, sunny days meant ruined days. He’d have to go dig potatoes or play softball, for which he had no talent. How much more blissful to be indoors with an adventure novel. Mr. Keillor described a   day, even as the talk moved into the shadows. This monologue was a ghost tour, a rumination on impermanence. The narrator walked through his hometown and commented: “When you’ve lived in one place for so long, you go back and you are in a museum. Everywhere you go, there are the dead. ” Mr. Keillor’s fictional universe, in his radio shows and books, has often been compared to Sherwood Anderson’s “Winesburg, Ohio. ” The comparisons are apt. Like Anderson, Mr. Keillor has a feel for loneliness and isolation. In the final “News From Lake Wobegon,” Mr. Keillor’s narrator walks by the town’s Chatterbox Cafe (“the place to go that’s just like home”) and recalls where various locals, now dead, used to sit. One of these is Jack, from Jack’s Auto Repair, who made appearances in these monologues. In this monologue, Jack stood in for the listeners who dislike Mr. Keillor’s show, who’ve found it to be more Mayberry than Winesburg, an overly sugared Midwestern hot dish. (I sometimes felt this way, and have dialed the show out for years at time. On many other Saturday evenings over the decades, I’ve been overjoyed to find it during a long drive. The show could indeed be good company.) “Jack never cared for my radio show and he told me every time he saw me,” Mr. Keillor said. “He was a jazz guy. He did not care for sentimental songs about home. Though I did point out to him that half the sentimental songs about home are about wanting to leave home. ” Mr. Keillor reported talking to Larry, the owner of the town’s graveyard, who tells him he’ll be buried next to Jack. There’s no escaping one’s critics. As the monologue began to come to its close, Mr. Keillor, 73, spoke about how he might be remembered, if at all. “I am at that age now where people start to use the word ‘legacy,’ although there is no such thing and we all know that,” he said. “Radio has the permanence of a sand castle. Even books that are printed on   paper, they tend to migrate toward recycling rather quickly. ” It’s an interesting question, Mr. Keillor’s legacy. He left a lot of uncomplicated pleasure in his wake, and some complicated pleasure, too. For his show’s fans there are always reruns and downloads. For those of us who’ve gravitated more to his prose, which can be savvy and   the best news is that he’s said to be working on a memoir. It’s a book that, if he bears down, I’d wait in the rain for.'"}, "time": 1742562205.6981037}