{"duration": 0.04437518119812012, "input_args": {"text": "'The two undergraduates were acing their presentation. Good cadence. Sharp slides. Sunny dispositions. But it was a tough crowd. As the first slides flashed by, one audience member got up and paced the room. The other, breathing with conspicuous heaviness, rested her head sleepily on the ground. The students inflected their voices and gestured with gusto to regain their attention. So it goes when your audience is canine  —   specifically Teddy, a Jack Russell terrier, and Ellie, a Bernese mountain dog. The session was part of a pilot program pairing   business school students at American University with amiable, if unpredictable, dogs. According to promotional material for the program: “Addressing a friendly and nonjudgmental canine can lower blood pressure, decrease stress and elevate mood  —   perfect for practicing your speech or team presentation. ” The audience dogs, as they are called, are a pet project of Bonnie Auslander, the director of the Kogod Center for Business Communications, which helps students hone their writing and speaking skills. Given “the whole fever pitch of dogs in therapy”  —   pettable pooches routinely show up before finals on some campuses  —   Ms. Auslander decided to use dogs to help students with speech anxiety. The center booked about a dozen sessions last semester and employed six “locally sourced” dogs, recruited for their calm personalities For now, evidence of the benefits is mostly anecdotal. “It makes you smile looking out at the dogs,” said Jessica Lewinson, a sophomore who practiced a presentation on corporate responsibility in front of Teddy and Ellie. “It kind of gives you a chance to step back from your presentation, to step out of that track you get stuck in. ” And, she added, a dog is no more distracted than your typical college student. You might even get a lick. Virtual reality has become a popular experimental treatment for a variety of anxiety disorders, including public speaking. Advocates say it is an efficient and safe form of exposure therapy, and a growing body of research backs them up. At treatment centers, participants are immersed in a     environment, where a therapist guides them through contact with feared stimuli. Thanks to a free app from VirtualSpeech, students can try this method at home. By plugging a smartphone into Google Cardboard or any VR headset, users will find themselves in a   virtual presentation room and have the option of uploading their own PowerPoint, which appears on the virtual screen as they address the virtual crowd.'"}, "time": 1742561914.7359948}