{"duration": 0.07974791526794434, "input_args": {"text": "'Donald J. Trump and his allies struggled on Sunday to move beyond the revelation that he might have been able to legally avoid nearly two decades of federal income taxation, putting new pressure on the candidate just as he tries to recover from a lackluster debate performance. Mr. Trump’s campaign lurched between refusing to acknowledge that the 1995 tax records, portions of which were published on Saturday night by The New York Times, were bona fide, to insisting that his not having paid taxes was evidence of his unrivaled business prowess. The Times report, based on documents obtained by the newspaper, showed that Mr. Trump, the Republican nominee, declared a $916 million loss on his 1995 income tax returns, which could have allowed him to legally avoid paying any federal income taxes for up to 18 years. At a rally in Lancaster County, Pa. that began shortly before the article was published, Mr. Trump seemed jarred by the pending revelation, shifting from topic to topic mocking his Democratic rival, Hillary Clinton, for having had pneumonia and insinuating that she might have cheated on her husband. The performance capped a bruising week for Mr. Trump, who went from a widely panned debate performance against Mrs. Clinton on Sept. 26 to repeatedly mocking Alicia Machado, a former Miss Universe who is Hispanic, including with a string of Twitter posts around 5 a. m. on Friday. That Twitter storm raised new questions about Mr. Trump’s temperament, for which Mrs. Clinton has often criticized him. Mr. Trump is now limping into the final five weeks of a race in which he has lost the momentum, some of his allies acknowledged. “This is the most important week of his campaign,” said Newt Gingrich, a former House speaker and an adviser to Mr. Trump. Mr. Gingrich was critical of the taxes article but said the candidate must prepare seriously for the second presidential debate, on Oct. 9. Mr. Trump, he said, will have to decide whether he cares enough about the presidency to change his style. To regain footing and try to turn attention back on Mrs. Clinton, Mr. Trump plans to use a speech on Monday in Colorado to call attention to how both Clintons became very wealthy after leaving the White House, said Jason Miller, a campaign spokesman. On Sunday, Mr. Trump’s advisers sought to play down questions about the tax returns. “The man’s a genius,” Rudolph W. Giuliani, a former New York mayor and a close adviser to Mr. Trump, said on Sunday on CNN’s “State of the Union. ” “He knows how to operate the tax code for the people that he’s serving. ” In this case, Mr. Giuliani added, Mr. Trump had simply acted as any responsible American businessman would to save money for his enterprises. Mr. Trump’s investors, he added, could have brought legal action against Mr. Trump had he not taken advantage of the tax law’s provisions to avoid taxation. But in an ABC News interview, Mr. Giuliani, sounding increasingly frayed, offered a remark that focused explicitly on Mrs. Clinton’s gender. “Don’t you think a man who has this kind of economic genius is a lot better for the United States than a woman, and the only thing she’s ever produced is a lot of work for the F. B. I. checking out her emails?” he asked. Gov. Chris Christie of New Jersey, another adviser to Mr. Trump, argued that rather than demonstrating any kind of malfeasance, the tax records published by The Times showed Mr. Trump to be singularly qualified to overhaul the federal tax code. Not only that, Mr. Christie said, but the documents supporting the report illustrated Mr. Trump’s success in what the governor characterized as the weak economic climate of the early 1990s. “This is a guy who, when lots of businesses went out of business in the early 1990s, he fought and clawed back to build another fortune, to create tens of thousands of more jobs,” Mr. Christie said on “Fox News Sunday. ” “This is actually a very, very good story for Donald Trump,” he added. Mr. Trump’s tax returns  —   which he has repeatedly refused to release, in defiance of what has become the norm for presidential candidates over the last four decades  —   have been a lingering battle in his contest with Mrs. Clinton, who has released her returns regularly throughout her political career. Mrs. Clinton seized on the Times report, using Twitter on Sunday to release a “Trump ‘Smart’ Tax Calculator” to show how much users would pay in taxes “if you paid the same as ‘billionaire’ Donald Trump. ” The answer  —   at different income levels reaching into the tens of millions of dollars  —   came up as zero. The Times report has refocused attention on Mr. Trump’s finances as the campaign moves into its final phase, giving Democrats a new opportunity to discredit the Republican nominee and forcing his surrogates to quickly try to change the conversation. Mr. Trump’s campaign did not contest or confirm the report, but a lawyer for the candidate said in a statement that the publication of the tax records was illegal. Writing on Twitter on Sunday morning, Mr. Trump reiterated part of his campaign’s statement, boasting that he understood “our complex tax laws better than anyone who has ever run for president” and that he had created far more jobs than Mrs. Clinton. Supporters of Mrs. Clinton used the Times report not only to draw attention to Mr. Trump’s refusal to release his returns, but also to portray him as an unreliable businessman and the embodiment of a system “rigged” in favor of the wealthy, a line that Mr. Trump has favored on the campaign trail. “He crashes businesses into bankruptcy, leaving scores of businesses unpaid  —   people really hurting with the losses his companies have suffered  —   but he walks away unscathed,” Senator Claire McCaskill, Democrat of Missouri, said on “Fox News Sunday. ” “It appears he walks away with a golden ticket that allows him under the tax code to avoid taxes for decades. ” Senator Bernie Sanders of Vermont, who battled for the Democratic nomination with Mrs. Clinton, said that far from making Mr. Trump a genius, the tax disclosure illustrated the unfair advantage given to wealthy Americans. “The rich are getting richer,” Mr. Sanders said on ABC’s “This Week. ” “Almost everybody else is getting poorer. And yet billionaires like Donald Trump are able to manipulate the tax system so that they avoid paying federal income tax. ”'"}, "time": 1742561997.897137}