{"duration": 0.05071616172790527, "input_args": {"text": "'The Left Says I Hate Myself For Voting Trump While Female. I Don\\'t. I Just Hate You. By: Amanda Prestigiacomo November 17, 2016 \\nAs a woman who rejects third-wave feminism with the burning passion of a thousand suns on a regular basis, I\\'ve had my fair share of feminists tell me that I only reject them and their ideas because I suffer from \"internalized misogyny,\" or, in other words, I\\'m a self-loathing sexist. \\nHere\\'s exactly how Everyday Feminism defines \"internalized misogyny,\" if you\\'re unfamiliar with bats*** crazy: \\nInternalized misogyny, by definition, is sexism turned inward toward ourselves and outward toward other women. \\nIt becomes innate as we are socialized to the norms of our culture that indicate, overtly and covertly, that women are less than men – less worthy, less strong, less dependable, less able, less of a leader, less logical – while also more than men: more emotional, more irrational, more complex, more to manage. \\nOf course, this is ridiculous, and I gave such an assertion about as much time as a I would a male feminist hitting on me: zero seconds. \\nBut on Wednesday, I learned that Team Hillary, the political left, likewise thought me a self-loathing sexist who passed on my obligation to vote for Queen Pantsuit because I couldn\\'t stomach the thought of a powerful woman, since I apparently believe women are lessers. In fact, I—a woman with a chronic case of \"internalized misogyny”—cost Hillary the election; not her decision to engage in potentially criminal activity, nor her inability to campaign her way out of a paper bag. It was my fault. Clinton campaign communications director @jess_mc on election loss: \"Internalized misogyny is a real thing\" #inners https://t.co/8RV74T0UIh — All In w/Chris Hayes (@allinwithchris) November 15, 2016 \\nYeah, no. I didn\\'t pull the lever for Trump because I hate myself. I don\\'t. Not even a little actually. I just hate you. \\nLet me define \"you.\" \\n\"You\" are the feminists who contend my uterus must dictate all my choices; those who make it their mission to drag down any woman who has the audacity to veer from your ideology one iota. \\n\"You\" are the feminists who tell me that there\\'s a special place in hell for me if I don\\'t cast my ballot for Crooked Hillary. (Like all of a sudden feminists believe in God and an afterlife. LOL.) \\n\"You\" are the feminists who tell me I\\'m super mean and *shame* women when I point out that bragging about murdering unborn babies is gross and despicable. By the way, it is gross and despicable . \\n\"You\" are the feminists who demonize men with think-pieces on how and why we should banish so-called \" toxic masculinity \" from this world. \\n\"You\" are the feminists who shut men up because of their gender while simultaneously telling me gender is a social construct. And no, I will not cater to your preferred pronouns, you entitled brat. (Pro-tip: Once the number of genders you\\'ve made-up passes the number of flavors at Baskin Robbins, it\\'s time to admit you have a problem.) \\n\"You\" are the social justice warriors who tell me I\\'m a hateful, selfish, capitalistic pig from your iPhone at your local safe space, equipped with coloring books, bubbles and puppies, across from the Starbucks you work weekends at. \\n\"You\" are the social justice warriors who viciously riot when you don\\'t get your way, meanwhile you\\'re not even registered to vote . \\n\"You\" are the social justice warriors shouting-down any free speech which doesn\\'t perfectly align with your ideology, ironically in the name of tolerance and inclusiveness. \\n\"You\" are the virtue-signaling celebrities who think I give a hoot about your political stance. Please, go ahead and move to Canada, no one will miss you. I certainly won\\'t. \\n\"You\" are the mainstream media so desperate for your leftist narrative that you\\'ll lie to the American people to advance it; so hell-bent on painting middle-America and Republicans as racist you\\'ll frame actual policy discussions into a segment of \"Who\\'s The Biggest Xenophobe: Republican Edition.\" \\n\"You\" are the leftist telling me I\\'m a racist for not supporting the divisive hate group Black Lives Matter. First of all, it\\'s mostly comprised of a bunch of loser white kids. Second of all, call me crazy, but once you start calling for and actually assassinating police officers , I\\'m out. I know, how *racist* of me. \\n\"You\" are leftists calling me an Islamophobe because I use the term \"radical Islam\" and resist an influx of refugees whom the FBI said we cannot properly vet pouring into our country. \\nYou see, this election had virtually nothing to do with Donald Trump—I could take him or leave him—and almost everything to do with you, the left. Trump was indeed a protest vote; he was a direct repudiation of everything you stand for and everything you tell me I should stand for by virtue of my uterus. \\nSo, no, I\\'m not a self-loathing victim of \"the patriarchy\" who passed on a vote for Hillary because she\\'s a woman. I just hate you. \\n'"}, "time": 1742628602.1455243}