{"duration": 0.03153347969055176, "input_args": {"text": "'A fund has been set up to help an    farmer forced to spend £30, 000 to fund his own defence after he was prosecuted for shooting a convicted burglar in the foot when he intruded on his isolated Yorkshire farm. [Kenneth Hugill, who uses a walking stick and a hearing aid, wept with relief after it took a jury at Hull Crown Court just 24 minutes to acquit him of grievous bodily harm.  Despite being cleared of wrongdoing, the octogenarian farmer was left with a legal bill of at least £30, 000 for the   trial. The family has said they will have to borrow the money and pay it back over decades. Mr. Hugill said he fired an antiquated shotgun in the dark towards a vehicle as it revved its engine and began driving towards him, explaining in court that he had never intended to hurt anyone. Outside court, the pensioner wiped away tears as he said: “I am very, very pleased  —   it’s marvellous. I thought I should not have been prosecuted right from the start. I don’t shock easily. I didn’t feel it was justified. “The court ordeal has not affect[ed] me much, but it was more my wife and daughter in law. I pulled the trigger because I thought the car was going to kill me. ” While the    farmer, who has had two hip replacements and a   operation, was arrested, fingerprinted, and forced to fund his own £30, 000 defence, police took no further action against the two intruders who were questioned on suspicion of attempted diesel theft and poaching. Lawyer Nick Freeman felt so strongly about the case he set up a crowdfunding page, on which he brands the legal system a “disgrace”. He writes that Mr. Hugill “never should have been prosecuted”. “I’m sure there are plenty of people who felt as equally incensed as I did after reading about the case, and will be happy to spare a few pounds in helping this   family in their hour of financial need. ” Noting that “people break into other people’s homes [and] cause fear and misery” North Thanet MP Sir Roger Hale said the case is another example of the Crown Prosecution Service (CPS) treating criminals as though they were ‘victims’. “Given the circumstances, perhaps the CPS will now think twice about doing this again. It’s quite simple: people should have the right to defend their own property,” he said. “The jury in this case clearly heard the evidence and thought the old boy was quite right to defend his own property. If you don’t want to come to harm, don’t break into somebody’s else’s home or trespass on their land. “We need to have a sense of proportion about this. The people who the CPS sometimes like to present as a victim is sometimes the criminal. ” Gerry Wareham, Chief Crown Prosecutor, said it was in the public interest to prosecute Mr. Hugill. He said: “We considered all the evidence in this case extremely carefully, and took full account of the situation Mr Hugill found himself in that evening. “We are satisfied that there was sufficient evidence to put the matter before a court and that it was in the public interest to do so. ” Back to work and ploughing his fields ready to sow wheat on Tuesday, Mr. Hugill thanked supporters and said he hopes to get his guns and ammunition back after they were seized by police so he can get back to shooting rabbits on the farm. “I have been shooting since I was less than 12 years old, and it has been part of my life on the farm,” he told MailOnline. “I’m glad to get back to work and put the last 16 months behind me. Farming has been my life. ”  '"}, "time": 1742628468.7690992}