{"duration": 0.15012598037719727, "input_args": {"text": "'The uniquely uncivil presidential campaign is about to produce one of the biggest civic gatherings in decades: For 90 minutes on Monday night, a polarized nation will pause to watch the first    encounter between Hillary Clinton and Donald J. Trump. The total audience, network executives and political strategists say, could be as high as 100 million viewers  —   Super Bowl territory. That would surpass the 80 million who watched Jimmy Carter and Ronald Reagan in 1980, the record for a presidential debate, and rank among television benchmarks like the finales of “MASH” and “Cheers. ” Not all viewers will watch from their living rooms. At the Dreamland Theater in tiny Nantucket, Mass. so many are expected for a   party that the town assigned a police officer to stand watch in case of rowdiness. In Paris, many of those abroad for Fashion Week are setting     alarms so they can watch the debate live  —   at 3 a. m. local time. “I need to feel like I’m part of this,” said Laura Brown, InStyle’s editor in chief. And in Richardson, Tex. the Alamo Drafthouse had to switch to a bigger room after overwhelming interest in a screening with refreshments like a “build a wall around it” taco salad. Mass experiences  —   built around news events like the moon landing, and pop culture moments for older generations like the “Who shot J. R. ?” episode of “Dallas”  —   are rare in an age of fragmented media and the drift toward partisan outlets, where viewers can effectively choose their own news. But tight polls and curiosity about the unconventional Mr. Trump are luring viewers. In a New York   News poll this month, 83 percent of registered voters said they were very or somewhat likely to watch on Monday. “It’s a throwback to a phenomenon that has essentially disappeared in the era of digital media,” said Andrew Heyward, a former president of CBS News. “This is Americans gathering around the electronic hearth. ” Advertisers, including Audi cars and Tecate beer, are taking advantage, introducing   commercials in the kind of   marketing usually reserved for events like the Super Bowl. Although the debate will air without commercials, cable and broadcast channels have sold millions of dollars’ worth of ads for programming before and afterward. Television networks and online streaming sites, including Facebook and Twitter, will carry the same feed on Monday, showing a spare debate stage at Hofstra University, on Long Island, a format that predates the blaring graphics and   sets that now dominate television news. Still, even if a large portion of the country is watching, what Americans see may be as much about their beliefs and preferred news outlets as what transpires onstage. About 8 percent of registered voters remain undecided, according to the New York   News poll, a thin if crucial sliver of the electorate. And after Mrs. Clinton and Mr. Trump conclude on Monday, viewers are likely to return to their ideological silos, absorbing instant analysis from   anchors on MSNBC or commentators at   outlets like Breitbart News. The debate itself will be subject to instant,    interpretation on social media. “Regardless of where you’re watching, whether it’s Facebook Live or NBC or Fox News, there will be a moment where we all witness it,” said Charles L. Ponce de Leon, author of “That’s the Way It Is,” a history of television news. “But that moment will quickly crumble when all the instant analysis and opining comes into play. ” The event’s impact is unlikely to rival that of, say, 1960, when John F. Kennedy’s smooth performance in the first televised debate helped sway voters against his opponent, Richard Nixon. That debate aired without commentary  —   or graphics and captions on the screen. “Journalists were of the opinion they should wait and ruminate and think about what went down, and then, a day or a week later, talk about it,” Mr. de Leon said. Tom Sander, who runs a program on civic engagement at the Harvard Kennedy School of Government, said he was worried that voters might not have a chance to remove partisan blinders. “Many of us come to these events more to confirm what we already think we know, rather than to search for common ground,” Mr. Sander said. The candidates may hope otherwise. Mrs. Clinton has told donors privately that she expects 100 million people to watch the debate, and that 60 million of those viewers may be focusing on the campaign for the first time, a prime opportunity for her to make inroads. Many may tune in merely for the spectacle. “It’s like waiting for the   fight,” said Dick Cavett, the longtime   host, referring to the highly anticipated boxing bouts between Muhammad Ali and Joe Frazier in the 1970s. Mr. Cavett said he would cut short a dinner on Monday to ensure he would be in front of a TV by 9 p. m. “There’s possible drama and fireworks and insults and horror and disaster and potential enlightenment,” Mr. Cavett said. “It would attract anybody. ” Some in TV noted that the 2008 meeting between Joseph R. Biden and Sarah Palin attracted 70 million viewers, more than any of that year’s presidential debates, a sign that civic interest may be less of a draw than seeing a colorful candidate like Ms. Palin  —   or Mr. Trump. The 1980   debate scored a record audience in part because it was the only    matchup between the candidates in a precable era. But Neal Shapiro, a former president of NBC News, recalled that Mr. Reagan’s unusual background as a Hollywood actor spurred interest. “People wanted to see, would they really feel comfortable with Reagan as president?” Mr. Shapiro said. “People were wondering, ‘Can I live with this guy? ’” The first debate between President Obama and Mitt Romney in 2012 drew 67 million viewers. Advertisers, anticipating even more this time, are using the opportunity to unveil new ads with themes that may resonate with Americans focused on the campaign. Audi’s commercial shows a man and woman, both hotel valets, battling for the right to drive an Audi RS7 luxury car, and features the slogan “Choose the next driver wisely. ” American flags, and ice sculptures of a donkey and an elephant, convey the message that the car, as an Audi vice president for marketing put it, is “a metaphor for the importance of America. ” In a spot set for Monday night, Tecate, a Mexican beer label owned by Heineken, features a view of the Mexican border and a     that declares, “The time has come for a wall  —   a tremendous wall. ” The wall is revealed as a   resting place for Tecate beers, “a wall that brings us together. ” The ad, airing on networks including Fox News and Univision, is “absolutely not” about a political point of view or affiliation, said Felix Palau, a vice president at Tecate. “Tecate, being a Mexican beer, is a perfect protagonist of a story where a wall brings people together in a very fun way,” Mr. Palau said. The debate’s biggest televised competition on Monday is likely to be another program featuring intricate strategies and crushing blows: “Monday Night Football” on ESPN. And one famous political junkie says he may flip the channel  —   for a few minutes, at least  —   to the action on the gridiron. “The president’s fired up about ‘Monday Night Football,’” Josh Earnest, the White House press secretary, playfully told reporters who asked if President Obama planned to watch the debate. “There will be millions of people across the country who are quite interested to see the two candidates onstage together for the first time,” Mr. Earnest added. “I imagine the president will be one of them. ”'"}, "time": 1742561914.9965293}