{"duration": 0.13101506233215332, "input_args": {"text": "'It is a section of Panama’s newly expanded canal that has troubled veteran canal workers. To safely guide the new generation of massive ships through the two sets of locks, tugboat captains and ship pilots rely on an approach wall to properly align the vessels before escorting them into the first narrow chamber. The wall is an antidote to the currents and winds that push and pull ships into awkward angles, making tugboats wrestle the elements before achieving the proper position. Each entrance has this structure  —   except one. And it was at this opening on the afternoon of July 21 that the Chinese container ship Xin Fei Zhou struck a lock wall, tearing small holes in its hull  —   canal officials call it a dent  —   and forcing it out of service. The new canal was not even a month old. Another container ship had experienced tense moments three weeks earlier as crew members responded to “countless” instructions from a canal employee who was attempting to guide it into the same set of locks. Ultimately, that transit was successful. But the Xin Fei Zhou’s mishap was not the canal’s only setback. Other vessels have sheared or badly damaged up to 100 buffering fenders that are supposed to protect the lock walls and ship hulls should they come into contact, according to interviews with canal workers. Several days before the expanded sea lane opened  —   nearly two years late and with more than $3. 4 billion in disputed costs  —   an examination by The New York Times raised questions about its viability, citing concerns over safety, design, changes in the world’s shipping patterns and demand. Canal workers had expressed concern about whether the plastic fenders on the lock walls would be adequate and whether tugboat captains had received the proper training in how to guide the giant ships through the chambers  —   a procedure that differed from the one used in the original canal. On July 22, in response to complaints, the canal’s administrator, Jorge Quijano, said the expanded canal was safe and was providing   service. To back that up, he pointed to the 224 ships that had reserved future transit slots, in addition to the dozens that had already gone through. Canal officials called the Xin Fei Zhou’s incident “minor,” saying it did not significantly damage the vessel, disrupt canal traffic or injure anyone. No official investigation occurred, Mr. Quijano said, “because the   informed that they would not attend the investigation meeting. ” Mr. Quijano also defended the utility of the canal’s buffering system, insisting that the fenders are sturdy and effective. “To imply that fenders are falling off as a sign of something wrong or that something is not functioning appropriately is inaccurate,” he said by email. “Because of its intended use, fenders will get damaged and sometimes do fall off the walls and subsequently are replaced. ” If the fenders prove inadequate, he added, changes will be made. “We believe in continuous improvements. ” The expanded canal operates differently from the original one. The new canal uses tugs to move ships through, while the original, which still operates, pulls ships through with locomotives that run alongside the lock walls. According to the Panama Canal Authority, tugs not only are cheaper, but are the only practical way to move the newer giant ships that carry much of the world’s cargo. In a 2014 report, written well before the expanded canal opened, the global insurance company Allianz wrote that the change was risky because it replaced “an elegant, simple system”  —   one that had lasted for 100 years  —   with “a more complicated system. ” It added: “Yes, they will be more up to date, but there will also be a greater potential for damage. ” Allianz believes that the tugs will be sufficient, but identified training as the key to mitigating the risks. “This will be a challenge,” the report stated. It is a challenge, tugboat captains say, made more difficult because so many of them have not been fully trained in the new system, said Iván de la Guardia, who heads the tugboat captains’ union. After three weeks of operation, Mr. de la Guardia said, 60 percent of his members had yet to be trained. Mr. Quijano said that “while we have an adequate amount of trained captains to cover our needs, the training is still being provided in order to satisfy the increased demand in the future. ” Given that the expanded canal is new, shippers are closely monitoring its operations, especially since the Xin Fei Zhou accident. “This is not an accident that should be happening,” said Basil Karatzas, a New   maritime adviser to shipping companies. He estimated that repairs to the Chinese ship could cost “a few hundred thousand dollars. ” The ship waited several days before resuming its journey. “The delays and costs entailed with repairing the damage easily negate any benefits from passing through the canal,” Mr. Karatzas said. The Times obtained    accounts of the two ships experiencing difficulty as they attempted to enter the set of locks without the approach wall. Canal workers also provided pictures of the damaged ship and the damaged fenders. Computer images, apparently recorded in real time, show tugboats struggling to position the Xin Fei Zhou as it approached the chamber before striking the left corner of the lock wall. Five days after the canal opened, the operators of another container ship, the MOL Benefactor, recorded details of its roughly   transit through the expanded locks. It was uneventful until the ship reached the lock with no approach wall. The ship’s ranking officer became concerned, records show, because of what he described as “numerous” or “countless” bow thruster orders in addition to helm and engine orders  —   all indicating a level of uncertainty on the pilot’s part. Unlike the Chinese container ship, the MOL Benefactor eventually passed through the final set of locks without incident. Londor A. Rankin leads the union of canal pilots, who board transiting ships and direct them, along with the tugboats. Two days before the Xin Fei Zhou accident, in response to email questions, Mr. Rankin said pilots were indeed experiencing problems at the entrance without an approach wall. He also said that canal officials had said they were interested in designing and building some sort of structure to help pilots and that they had considered his union’s proposal to buy floating fenders as a better way to ease ships into the chamber. But, he added, “they have mentioned the inconvenience of doing so while the warranty of the new set of locks is still in effect. ” Asked why no approach wall had been built at the one entrance, Mr. Quijano said the walls had been built where the topography allowed it. He also said   locks elsewhere do not use approach walls. Panama, in fact, copied the concept of the Berendrecht lock in Antwerp, Belgium, but that chamber is significantly wider than those in Panama’s new locks. Andrew Kinsey, a senior marine risk engineer for Allianz, said he eagerly awaited the results of the canal authority’s investigation, which he said should be shared with all interested parties. The authority has said it is conducting only an internal review that will not be released publicly, rather than a formal investigation. Historical weather data for the area, provided by CustomWeather, reported that when the accident occurred, the wind was around nine miles an hour, with light rain and scattered clouds. Mr. Quijano said that “just at the moment the vessel was entering the lock, it was suddenly hit by heavy crosswinds and very dense rain. ” Cosco Container Lines, which owns the ship, said in a statement: “This is a serious matter. ” “Is it a serious marine incident?” Mr. Kinsey asked. “That will depend on the findings and the extent of repairs. Is it a concern? Yes, there’s a hole in the ship. ” Another Chinese container ship, also owned by Cosco, was the first commercial vessel to pass through Panama’s enlarged canal, in late June. At the time, the authority proclaimed a “new era of global trade” that would provide “greater economies of scale to global commerce. ” Witnessing this historic transit, the officials said, were “25, 000 jubilant Panamanians,” heads of state, shipping executives and nearly 1, 000 journalists. Canal publicists asserted that the ship carried thousands of shipping containers, a load that would not have fit in the smaller, original canal. But the new canal’s sparkling narrative omitted one important fact: Most, if not all, of the shipping containers were empty. And even with the lighter load, the ship awkwardly brushed against a canal wall, according to photos posted online by canal workers. Mr. Quijano said some containers had contained cargo. Besides, he said, cargo containers constitute cargo even when empty. On Tuesday, Mr. Quijano announced that the canal authority was contemplating a ban on cellphones during transits because they were a distraction.'"}, "time": 1742563877.097122}