{"duration": 0.23013639450073242, "input_args": {"text": "'WASHINGTON  —   The announcement that the F. B. I. is reviewing newly discovered emails of a top Hillary Clinton aide has slowed the campaign’s momentum and the hopes of expanding support in traditional Midwestern battleground states. Leading Democratic strategists say the news has caused some of Mrs. Clinton’s more casual supporters to drift away. Her campaign expressed confidence that she would weather the political turbulence, but acknowledged that optimism about gaining ground in places like Ohio and Iowa, where the demographics favor Donald J. Trump, was fading. Still, it said, even as Mrs. Clinton’s overall support has shrunk in recent days, she can easily assemble the 270 electoral votes she needs for a victory next Tuesday, given her broad base of voters in more demographically diverse states. “Even if this takes two points off her national lead, she’ll still clear 300,” said Michael Podhorzer, the political director of the A. F. L. . I. O. “We’ve seen that Clinton’s support has been solid in enough states to give her an Electoral College majority and that should remain true. ” And while Mr. Trump has crowed about the   twist to the race, the F. B. I. director’s letter about the emails has not yet produced a major shift in private polling, according to Republican and Democratic strategists with access to confidential data, who spoke on the condition of anonymity. Mrs. Clinton’s lead over Mr. Trump appears to have contracted modestly, but not enough to threaten her advantage over all or to make the electoral math less forbidding for Mr. Trump, Republicans and Democrats said. Mr. Trump has consistently struggled to capture lasting momentum in the race, often battling damaging disclosures about his past or veering wildly off script in his public speeches. The loss of a few percentage points from Mrs. Clinton’s lead, and perhaps a state or two from the battleground column, would deny Democrats a possible landslide and likely give her a decisive but not overpowering victory, much like the one President Obama earned in 2012. More significant, though, such a decline in support could cost the party some of the six Senate races that are right now effectively dead heats and will determine who controls the chamber. The most enduring obstacle to Mr. Trump is Mrs. Clinton’s formidable position in the Electoral College, where Democrats and a significant cohort of Republicans believe she is close to locking down the 270 electoral votes required for victory. Early vote totals in several states, including North Carolina, are outpacing Mr. Obama’s performance at this time four years ago and have buoyed Democratic confidence even amid a burst of late adversity. And Republicans privy to private polling data said surveys they had seen since the news from the F. B. I. on Friday still showed Mrs. Clinton leading in North Carolina, a state Mr. Obama lost in 2012. Facing a wall of opposition in Pennsylvania, Colorado, Virginia and New Hampshire, states Mr. Trump had hoped to dislodge from the Democrats, the Republican candidate has been forced to try to find other states he can win in the campaign’s final week. On Sunday, he was in New Mexico, claiming without evidence that the race is tied in the heavily Hispanic state, and on Monday, he appeared in Grand Rapids, Mich. vowing victory in a state no Republican has won since 1988. “When you look around your state and you see the   factories, the empty buildings and the long unemployment lines, remember Hillary Clinton did much of this to you,” Mr. Trump said, invoking the names of the Big Three automakers and bringing Bob Knight, the storied former Indiana University basketball coach and Big 10 icon, onstage to introduce him. Mr. Trump’s   gambit was reminiscent of Mitt Romney’s late effort four years ago to make forays into a handful of   battlegrounds, including Pennsylvania and Minnesota, and crack the political firewall assembled by Mr. Obama’s campaign. Mr. Romney did not succeed. Russ Schriefer, an adviser to Mr. Romney’s campaign, said Mr. Trump was engaging in the “wishful thinking” of a candidate cornered on the electoral map. “If the feeling is that you’re blocked in Virginia and you’re looking like you might be blocked in North Carolina, then you’re trying to say, ‘Well, where can we steal it? ’” Mr. Schriefer said. “‘Where can we possibly give a little extra push and maybe  —   maybe  —   we can get over the top? ’” While Mr. Trump was grasping on Monday for a new route to 270 electoral votes, Mrs. Clinton was trying to secure a swing state that could prove elusive. For decades a political bellwether, Ohio has grown difficult for Democrats in this election in large part because of Mr. Trump’s appeal to   white voters. Mrs. Clinton assured supporters at Kent State University on Monday that the F. B. I. review would “reach the same conclusion they did when they looked at my emails for the last year. ” She tried to rally her supporters by wondering aloud “why in the world the F. B. I. would decide to jump into an election with no evidence of any wrongdoing with just days to go. ” Mrs. Clinton called Ohio “one of the most competitive and consequential battleground states. ” But other leading Democrats said a defeat in Ohio and Iowa would not prove all that consequential, except to her ultimate margin. “It’s not surprising that these are two tough states for her,” said Tom Vilsack, the secretary of agriculture, pointing to the heavily white areas that have drifted to Republicans. “Things are turning around economically, but that has not penetrated the psyche of a lot of people. ” Because of Mrs. Clinton’s strength in more diverse states, Mr. Vilsack noted that she could still capture the presidency without winning the two Midwestern battlegrounds. “They’re lower on the priority list for her getting to 270 than they were for us in 2012,” said Jeremy Bird, a senior aide to Mr. Obama’s last campaign. “North Carolina, on the other hand, was at the bottom of our list and the hardest for us to reach, but it’s much easier for her. ” What alarms Democrats more is that Republicans who were turned off by Mr. Trump may now show up to vote for   candidates. Concerned about their prospects to win a   Senate seat in Wisconsin long thought to be in hand, an array of Democratic groups have started airing ads in the state, and Mrs. Clinton was planning to dispatch her running mate, Senator Tim Kaine of Virginia, there on Tuesday. But Mrs. Clinton’s troubles still have not altered the overwhelming difficulties faced by Republicans running in states that Mr. Trump is likely to lose. And Republicans in some of these races have quietly started to take steps to win with the help of Mrs. Clinton’s supporters. Late last week, Pennsylvania Republicans updated their scripts for volunteer phone callers and canvassers to identify, and ultimately turn out, voters who are supporting Senator Patrick J. Toomey  —   but who also plan to back Mrs. Clinton.'"}, "time": 1742563573.1264439}