{"duration": 0.04313778877258301, "input_args": {"text": "'President Donald Trump gave a   to the “forgotten” industrial heartland that delivered him the White House as he announced America’s unilateral withdrawal from the Paris Climate Accords Thursday. [“I was elected to help the citizens of Pittsburgh, not Paris,” Trump told those gathered in the White House Rose Garden, as he gave a forceful   condemnation of the global climate agreement, under which the United States is to meet progressively lower caps on certain emissions while subsidizing developing countries in the hope they do the same.  “This agreement is less about the climate and more about other countries gaining a financial advantage over the United States, ” Trump explained. Citing a comprehensive report by NERA Economic Consulting, Trump laid out the economic disadvantage that would befall American workers, especially those in the Appalachian energy industries and the Midwestern industrial heartland. That report, for example, envisions a potential 86% reduction in American coal output and a 38% reduction in iron and steel production by 2040 if the Paris Agreement’s targets were actually met. According to Trump, apparently citing the   climate model, the most climate activists could hope to gain from America’s dearly bought reductions in carbon dioxide emissions is  0. 2 degrees Celsius less warming over the rest of the century. This did not stop the political left from accusing the President of “telling the Earth to drop dead,” by pulling out of the   climate accord. Trump cast doubt on the lofty goals supposedly motivating the accord, pointing out how it allows to China, India, and even Europe to continue to ramp up coal production while placing incredible burdens on our own domestic industry. “In short the agreement doesn’t eliminate coal jobs, it just transfers those jobs out of America   …     and ships them to foreign countries,” he told the crowd. “The current agreement effectively blocks development of clean coal in America. ” At several points, Trump took the opportunity to highlight the economic benefits he claims have already returned to the heartland since his election. “And the mines are starting to open up. Having a big opening in two weeks. Pennsylvannia, Ohio, West Virginia, so many places. A big opening of a brand new mine, it’s unheard of. For many many years it hasn’t happened,” Trump said, referring to the Acosta Coal Mine due to open in Somerset County, PA amid the slew of mine openings announced across the rich energy region. Trump’s rejection of the the globalist economic paradigm underpinning agreements like the Paris accord became more explicit as the speech went on. “It would once have been unthinkable that an international agreement could prevent the United States from conducting its own domestic economic affairs. But this is the reality we face if we do not leave the agreement,” he said before making his appeal directly to the Midwestern voters who put him over the top in November. “It is time to put Youngstown, Ohio Detroit, Michigan and Pittsburgh, Pennsylvania, along with many other locations within our great country, before Paris, France,” Trump said. “It is time to make America great again. ” The President also promised that the withdrawal from the Paris Accord will not be the end of his   reexamination of America’s position in the international economic landscape. “Many trade deals will soon be under renegotiation. ”'"}, "time": 1742563041.701272}