{"duration": 0.06709814071655273, "input_args": {"text": "'PARIS, France  —   Paris Génération Identitaire leader Pierre Larti gave a rare exclusive interview with Breitbart London saying harassment towards ethnic French by migrants is now commonplace in parts of Paris and the problem will only get worse if Macron wins. [In a small cafe in Paris’s 13th district, leader of the Paris branch of Génération Identitaire (GI) the French   migration Identitarian youth movement founded in 2012 who protest   and Islamisation, told Breitbart London his personal life has shaped his political leanings.  He said he and his brother were constantly harassed by men of foreign backgrounds simply for being French. “Sometimes there was violence, I was beaten because I was the only French on public transport or on the streets,” explained Mr. Larti. Larti then described one incident in which he and his brother had a knife held to their throat by a man and robbed for no other reason than their ethnicity. According to the GI Paris chief, those types of experiences have become increasingly common for young people living in suburbs in the north of Paris. Women, in particular, he said, were targets for   men. “The conditions for women in France are terrible now. If you are a blonde woman in the north of Paris I  wouldn’t give you five minutes without being harassed. ” The worsening conditions for women, along with the Cologne sex attacks in 2015, have brought many women into the movement, Larti said. “You don’t feel [like you are] in your country anymore,” he said adding, “We have the right to live in our country with our values. ” “In some areas of France, you have no more French natives. It’s finished you know?”   migration presidential candidate Marine Le Pen has advocated closing the borders and deporting known Islamic radicals, something that Larti supports, but believes does not go far enough to tackle the problems facing France. Larti said that he would like to see an eventual repatriation of those who refuse to accept French values which he claimed the government was working to systematically destroy. On the subject of the European Union, the GI leader said he was not against the EU as a concept, but was against the leadership of the political bloc. “In my point of view, the European countries are very united now. Not because of the EU, but because of mass immigration which is a threat to our life as a country, as a nation,” he said. Aside from large, often spectacular protests, the group also engages in charity work during the winter months, in what they call “Solidarity Generation” by helping homeless Europeans in France.  Larti said many of the native French homeless are afraid of going to shelters full of migrants because they are often subjected to violence and so end up on the street with no one else to help them. Looking forward to Sunday’s election between Ms. Le Pen and her globalist rival Emmanuel Macron, Larti said he feared things will only get worse if Macron wins. “I still believe in political solutions, but for how long? I don’t know, to be honest. If Emmanuel Macron wins the election, I am not sure. This is my personal opinion  —   not of the organisation  —   [but] for me, this is maybe the last election that we have. ” He noted terrorist attacks have dramatically escalated since the election of François Hollande five years ago. “If Emmanuel Macron doesn’t take any, or maybe Marine Le Pen, any powerful solutions, I don’t believe that we can organise elections in the next five years,” he said. Larti’s view is similar to French Islamic scholar Gilles Kepel who has predicted that radical Islamists could lead Europe into a potential civil war. Follow Chris Tomlinson on Twitter at @TomlinsonCJ or email at ctomlinson@breitbart. com '"}, "time": 1742561942.8961408}