{"duration": 0.04732966423034668, "input_args": {"text": "'Demonstrators protested Sen. Dianne Feinstein ( ) Friday outside of her appearance at the Public Policy Institute of California Friday in San Francisco, to complain about her decision not to hold town hall meetings during the week’s congressional recess. [Protesters outside of the Public Policy Institute of California, where U. S. Senator Dianne Feinstein will soon speak @KQEDnews pic. twitter.   —   Cesar James Saldana (@cesarjsaldana) February 24, 2017,   According to the San Francisco Chronicle, “Feinstein, who has not debated her Republican opponent in her last two U. S. Senate campaigns  —   state Sen. Dick Mountjoy in 2006 and Republican Elizabeth Emken in 2012  —   has no plans for any town halls during Congress’ current recess. ” People attending Feinstein’s ticketed event were reportedly invited to send questions via email to the event moderator in advance. Tickets were free. There were reportedly only 240 chairs in the room, although many more were standing. The Sacramento Bee reported that during the event, Feinstein said she somewhat enjoyed the outbursts. The moderator reportedly “asked the audience to settle down so that he could continue asking questions” when “Feinstein admitted, ‘I kind of enjoy it. ’” The protesters were from the San Francisco chapter of Indivisible, a liberal group that has crashed talks in recent weeks to push their “  Trump” agenda. The Bee notes that they held up signs reading, “Hold a real town hall. ” Others held up a green “agree” and a red “disagree” sign. At another point during the event, Feinstein reportedly said there was not much she could do to remove Stephen K. Bannon from his position as President Trump’s chief White House strategist, which prompted the activists to hold up a red “disagree” sign. ” “Wait a minute, all the   geniuses,” Feinstein reportedly objected, before noticing a sign that said, “Ban Bannon to Russia. ” The Bee notes that she then said, “Well, it’s a nice thought. ” Friday was not the first time Feinstein’s constituents have confronted her. In January, approximately 200 radical leftists protested and picketed outside of her Pacific Heights mansion in San Francisco to oppose what they have labeled as her “  voting record” because she voted for confirming several of the president’s Cabinet picks. Protesters outside of the Public Policy Institute of California, where U. S. Senator Dianne Feinstein will soon speak @KQEDnews pic. twitter.   —   Cesar James Saldana (@cesarjsaldana) February 24, 2017,  Also on Friday night, Rep. Adam Schiff ( ) held a town hall in Glendale, California where he discussed President Donald Trump’s temporary travel ban and the refugee crisis. Amazing turnout tonight for our town hall on the President’s travel ban. It’s fantastic to see so many engaged. pic. twitter.   —   Adam Schiff (@RepAdamSchiff) February 25, 2017,  So many showed up to our town hall, we filled the overflow room too.  Important to hear from everyone here tonight. pic. twitter.   —   Adam Schiff (@RepAdamSchiff) February 25, 2017,  The Chronicle notes that on Sunday, at 10 a. m. several hundred   activists will also hold an “empty chair” town hall despite the fact that Feinstein will not attend in person. She reportedly declined their invitation. However, a spokeswoman for Indivisible East Bay told the Chronicle that Sunday “is not really a protest” of the senator. “It’s a demonstration of our request that she meet with us. ” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742562467.002887}