{"duration": 0.04785752296447754, "input_args": {"text": "'November 2, 2016 \\nFears of a huge influx of immigrants from Romania and Bulgaria have given way to indignation after a poll showed workers from the two countries are preparing to ‘avoid Britain like the plague’, when movement restrictions are eased later this year. \\nA new survey of over 2,000 people in both countries revealed that, rather than preparing to flood into the UK and take all the jobs recently vacated by returning Poles, Romanians and Bulgarians are actually surprisingly well acquainted with how crap everything is and will most probably steer clear. \\n‘There was a time last summer when it looked quite fun in Britain,’ said Liana Domescu, a 25-year-old unemployed graduate from Timisoara. ‘You know, with the Jubilee and the Olympics and Kate Middleton and stuff. But since then it’s all been back to the Britain we know and hate – sex abuse, measles outbreaks, HMV going under, your failing post-war-era Health Service, David Cameron, how do you people cope?’ \\nThe news came as a surprise to analysts, who had predicted that up to 25,000 Romanian and Bulgarian jobseekers would arrive at Heathrow each day. BAA Ltd, the owners of Heathrow, had already warned that this would be ‘roughly 24,990 more than we can cope with per day’ and even hinted that queues could develop in the arrivals lounge. \\nUKIP leader Nigel Farage was ‘incensed’ by the news. ‘It’s a shocking insult to the people of Britain,’ said Farage. ‘We’ve been preparing a well-honed tirade of crackpot dogma, frosty glares and grumbling about the strain on public services to welcome these people to this country, only to find they’re only interested in coming if there are jobs! That’s the problem with foreign freeloaders, they just aren’t willing to put the work in. What am I going to do with this ‘Boris Out’ placard now? I can’t possibly use it for any other political purpose.’ \\nFor Domescu, the final straw came during the funeral of Margaret Thatcher last week. ‘I was still thinking of coming to Britain, but then they broadcast those pictures of your Chancellor Osborne openly weeping on national television and it finally hit home how bad things must be for that to happen,’ she said. ‘So I’ll just stay here after all – the weather’s far nicer and I hear there’s a job going at the local horse abattoir.’ Share this story...'"}, "time": 1742561854.7403464}