{"duration": 0.06714034080505371, "input_args": {"text": "'TEL AVIV  —   The   of the United Nations was roundly condemned Tuesday by both   and Israeli leaders for a statement slamming the ongoing “occupation” of Palestinian territories. [Marking the 50th anniversary of the Six Day War, António Guterres issued a statement saying that the 1967 defensive war “resulted in Israel’s occupation of the West Bank, East Jerusalem, Gaza and the Syrian Golan and the displacement of hundreds of thousands of Palestinians and Syrians” that “fueled recurring cycles of violence and retribution,” while making no mention of Israel’s right to defend itself at the time against the threat of annihilation from combined Arab armies.  “Ending the occupation that began in 1967 and achieving a negotiated   outcome is the only way to lay the foundations for enduring peace that meets Israeli security needs and Palestinian aspirations for statehood and sovereignty. It is the only way to achieve the inalienable rights of the Palestinian people,” Guterres said. “This occupation has imposed a heavy humanitarian and development burden on the Palestinian people,” he added. “Among them are generation after generation of Palestinians who have been compelled to grow up and live in ever more crowded refugee camps, many in abject poverty, and with little or no prospect of a better life for their children. ” Israel’s ambassador to the UN, Danny Danon, accused the   of disseminating “Palestinian misinformation. ” “Any attempt at a moral equivalency between killing innocent people and the building of homes is absurd,” he said. “It is preposterous to blame terror and violence in the Middle East on the one true democracy in the region,” he said. “The moment the Palestinian leadership abandons terror, ceases to incite against our people and finally returns to direct negotiations, then real progress can be made towards peace. ” Danon later slammed UN High Commissioner for Human Rights Zeid Ra’ad   for opening a session of the UN Human Rights Council by decrying Palestinian suffering. “It comes as no surprise that he chose to spread lies about Israel before he even mentioned the massacres in Syria. The Commissioner has forgotten that it is his job to care for human rights throughout the world, not to incite against Israel,” Danon said in a statement. Deputy Foreign Minister Tzipi Hotovely called on Guterres to “correct the [UN’s] distortion” of “occupation. ” “On the day when the UN sticks to the facts and ceases the misguided use of the term ‘occupation’ it will restore its credibility as an organization founded to uphold justice and truth,” she said in a statement. Israel is celebrating the 50th anniversary of “the liberation of Jerusalem and Judea and Samaria, and these are the facts,” she added. The   League (ADL) also slammed Guterres for what it described as an “incomplete and misleading” statement. “We are troubled by the  ’s incomplete statement on the anniversary of the   War and urge him to clarify his remarks,” ADL CEO Jonathan Greenblatt said in a statement. “While we share his desire for a return to negotiations to achieve a   solution, this anniversary cannot be viewed in a vacuum. It is grossly misleading to examine only the enduring effects of the war while ignoring the context in which the war took place  —   the belligerence of the Arab states in the spring of 1967, and the silence of the international community in the face of these threats and its failure to ensure the rights to free passage of international waterways. ” Greenblatt added his appreciation for Guterres’ “supportive statements on Israel, including recognizing the double standard with which Israel is treated at the UN, and his labeling as   the delegitimization of Israel’s right to exist. ” “We would have hoped that he would use this anniversary to address the Palestinian condition and call for peace and resolution in a   and historically accurate manner,” Greenblatt concluded. The UN coordinator for humanitarian aid and development also marked the 50th anniversary of the Six Day War by condemning Israel. “It should be obvious, but it bears repeating, that occupation is ugly,” Robert Piper said in a statement released Tuesday. “Living under foreign military rule for years on end, generates despair, suffocates initiative and leaves generations in a kind of political and economic limbo,” he said.'"}, "time": 1742561824.0807495}