{"duration": 0.025565624237060547, "input_args": {"text": "'By wmw_admin on October 28, 2016 Joe Barnes — Daily Express.com Oct 27, 2016 The Veliky Novgorod ready to launch. Click to enlarge \\nThe Veliky Novgorod is the latest addition to Russia’s Black Sea fleet which is capable of striking land, sea and underwater targets, and follows other significant movements by the Russian navy. \\nThe diesel-electric vessel, which sports advanced stealth technologies and increased combat range was officially launched in St. Petersburg on Wednesday. \\nDeputy Commander of the Russian Navy Vice-Admiral Aleksandr Fedotenkov and Admiralty Shipyard CEO Alexander Buzakov were in attendance at the official flag-raising ceremony before the vessels moved to the Black Sea for operation. \\nEarlier this month, Mr Buzakov said that another Varshavyanka-class submarine, the Kolpino, would be launched in November. \\nHe said: “The state of tests of the fifth submarine, the Veliky Novgorod, were successfully completed and on October 25 it will be handed over to the Black Sea Fleet. \\n“The transfer of the sixth submarine, the Kolpino, is underway, scheduled to be completed on November 25.” \\nThe submarines are designed for anti-ship and anti-submarine operations in mid-depth waters, are capable of holding a crew of 52, have a top underwater speed of 20 knots and a cruising range of 4000 miles. \\nThey can stay submerged for 45 days and are armed with 18 torpedoes and high surface-to-air missiles and will join Russian efforts to defeat ISIS in Syria. \\nRussian President Putin has also bolstered his warship fleet in the Baltic sea by arming them with long-range missiles which are capable of striking Europe. \\nTwo ships, traveling through the Mediterranean in the fleet of five, were thought to be remaining in the sea, where they were due to refueling in Spain before making their way towards Syria. \\nBut instead, the two ships have moved through the North Sea, passing through the Great Belt around Denmark and into the Baltic Sea. \\nIt is believed the ships are on their way to Russia’s Baltic enclave Kaliningrad, which has recently had scores of missiles deployed to the area. \\nA source told Russian media: “With the appearance of two small missile ships armed with the Kalibr cruise missiles the Fleet’s potential targeting range will be significantly expanded in the norther European military theatre.” \\nNato has stepped up its plans to deploy thousands more troops to the Russian border as President Putin continues to increase his nation’s preparation for war. \\nThe global alliance will use its meeting with European Union officials to launch an aggressive push to implement troops in Poland, Estonia, Latvia and Lithuania. \\nAn agreement – signed at a Nato summit in Warsaw in July – will see as many as 4,000 soldiers stationed close to the Russian border in case Moscow launches all out war.'"}, "time": 1742628568.5724921}