{"duration": 0.12703227996826172, "input_args": {"text": "'Most people say “I’m sorry” many times a day for a host of trivial affronts  —   accidentally bumping into someone or failing to hold open a door. These apologies are easy and usually readily accepted, often with a response like, “No problem. ” But when “I’m sorry” are the words needed to right truly hurtful words, acts or inaction, they can be the hardest ones to utter. And even when an apology is offered with the best of intentions, it can be seriously undermined by the way in which it is worded. Instead of eradicating the emotional pain the affront caused, a poorly worded apology can result in lasting anger and antagonism, and undermine an important relationship. I admit to a lifetime of challenges when it comes to apologizing, especially when I thought I was right or misunderstood or that the offended party was being overly sensitive. But I recently discovered that the need for an apology is less about me than the person who, for whatever reason, is offended by something I said or did or failed to do, regardless of my intentions. I also learned that a sincere apology can be powerful medicine with surprising value for the giver as well as the recipient. After learning that a neighbor who had assaulted me verbally was furious about an oversight I had not known I committed, I wrote a letter in hopes of defusing the hostility. Without offering any excuses, I apologized for my lapse in etiquette and respect. I said I was not asking for or expecting forgiveness, merely that I hoped we could have a civil, if not friendly, relationship going forward, then delivered the letter with a jar of my homemade jam. Expecting nothing in return, I was greatly relieved when my doorbell rang and the neighbor thanked me warmly for what I had said and done. My relief was palpable. I felt as if I’d not only discarded an enemy but made a new friend, which is indeed how it played out in the days that followed. About a week later I learned that, according to the psychologist and author Harriet Lerner, the wording of my apology was just what the “doctor” would have ordered. In the very first chapter of her new book, “Why Won’t You Apologize? ,” Dr. Lerner points out that apologies followed by rationalizations are “never satisfying” and can even be harmful. “When ‘but’ is tagged on to an apology,” she wrote, it’s an excuse that counters the sincerity of the original message. The best apologies are short and don’t include explanations that can undo them. Nor should a request for forgiveness be part of an apology. The offended party may accept a sincere apology but still be unready to forgive the transgression. Forgiveness, should it come, may depend on a demonstration going forward that the offense will not be repeated. “It’s not our place to tell anyone to forgive or not to forgive,” Dr. Lerner said in an interview. She disputes popular thinking that failing to forgive is bad for one’s health and can lead to a life mired in bitterness and hate. “There is no one path to healing,” she said. “There are many roads to letting go of corrosive emotions without forgiving, like therapy, meditation, medication, even swimming. ” Hardest of all, Dr. Lerner said, is to forgive a nonapologetic offender, like my aunt whom I had loved dearly and who served as my second mother after mine died. But when I, raised Jewish, married a Christian, she refused to come to the wedding and never apologized for the intense hurt her absence had caused. Although I made several attempts to restore the relationship, she always managed to deflect them, and to this day, more than half a century later, I cannot forgive her. The focus of an apology should be on what the offender has said or done, not on the person’s reaction to it. Saying “I’m sorry you feel that way” shifts the focus away from the person who is supposedly apologizing and turns “I’m sorry” into “I’m not really sorry at all,” the psychologist wrote. As to why many people find it hard to offer a sincere, unfettered apology, Dr. Lerner pointed out that “humans are   for defensiveness. It’s very difficult to take direct, unequivocal responsibility for our hurtful actions. It takes a great deal of maturity to put a relationship or another person before our need to be right. ” Offering an apology is an admission of guilt that admittedly leaves people vulnerable. There’s no guarantee as to how it will be received. It is the prerogative of the injured party to reject an apology, even when sincerely offered. The person may feel the offense was so enormous  —   for example, having been sexually abused by a parent  —   that it is impossible to accept a mea culpa offered by the abusive parent years later. Righting a perceived wrong can be especially challenging when it involves family members, who may be inclined to cite history  —   he was abused by his father, or she was raised by a distant mother  —   as an excuse for hurtful behavior. “History can be used as an explanation, not an excuse,” the psychologist said. “It should involve a conversation that allows the hurt party to express anger and pain if an apology, however sincere, is to heal a broken connection. ” As she wrote: “Nondefensive listening [to the hurt party] is at the heart of offering a sincere apology. ” She urges the listener not to “interrupt, argue, refute, or correct facts, or bring up your own criticisms and complaints. ” Even when the offended party is largely at fault, she suggests apologizing for one’s own part in the incident, however small it may be. Dr. Lerner views apology as “central to health, both physical and emotional. ‘I’m sorry’ are the two most healing words in the English language,” she said. “The courage to apologize wisely and well is not just a gift to the injured person, who can then feel soothed and released from obsessive recriminations, bitterness and corrosive anger. It’s also a gift to one’s own health, bestowing   integrity and maturity  —   an ability to take a cleareyed look at how our behavior affects others and to assume responsibility for acting at another person’s expense. ” Beverly Engel, the author of “The Power of Apology,” relates how her life was changed by a sincere, effective apology from her mother for years of emotional abuse. “Almost like magic,” she wrote, “apology has the power to repair harm, mend relationships, soothe wounds and heal broken hearts. An apology actually affects the bodily functions of the person receiving it  —   blood pressure decreases, heart rate slows and breathing becomes steadier. ”'"}, "time": 1742562312.9467833}