{"duration": 0.033538818359375, "input_args": {"text": "'In comments on CNN, Trump spokesperson Kellyanne Conway said that the Obama administration’s new moves against Russia are likely designed to “box in”   Donald Trump before he even takes office. [Conway appeared on CNN’s Anderson Cooper 360 on December 30 and noted that accusations that Russia hacked the 2016 election are rising to a “fever pitch” since Donald J. Trump won the White House. She also pointed out that Obama seems to have motives other than serious foreign policy behind his moves.  Kellyanne Conway wonders if Russian sanctions were intended to restrict Trump https:  .  https:  .   —   Anderson Cooper 360° (@AC360) December 30, 2016,  “Even those who are sympathetic to President Obama on most issues are saying that part of the reason he did this today was to quote, ‘box in’   Trump,” Conway said. Conway did not outright accuse the President of acting in bad faith. “I was quoting David Sanger’s piece in The New York Times,” Conway insisted. “I am merely saying that if The New York Times’ report is true and credible, that that would be very unfortunate if politics were the motivating factor here, but we can’t help but think that that’s often true. ” The incoming President’s adviser also pointed out that Trump is “not in favor of foreign governments interfering in our elections or interfering in our intelligence, but we’re also not in favor of our intelligence interfering with elections after the fact. ” Earlier that Friday, President Obama took the unusual action of ejecting dozens of Russian diplomats from the country as he ramped up his response to his charge that Russian hackers interfered in the November elections. Despite Obama’s constant claim, however, no actual proof has been forthcoming that Russia hacked our elections. In response to Obama’s ouster of 35 Russian officials, Russian strongman Vladimir Putin dismissed Obama’s actions and did not retaliate in kind as he has in the past. “Reserving the right to retaliate, we will not resort to the level of irresponsible ‘kitchen’ diplomacy,” Putin said in a Friday statement, calling it “regrettable” that Obama was choosing to end his administration with such a provocative action. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742563618.5668998}