{"duration": 0.06712079048156738, "input_args": {"text": "'In every office, every corporate executive suite, and every law firm across this great land, the men who had got pantsed and received numerous swirlies at the hands of jocks in high school finally have their chance at redemption against their brawny tormentors. [According to a press release from CBS, “The Big Bang Theory,” the brainy sitcom which references pyramids and autotrophs in its theme song, beat out NBC’s Sunday Night Football as the   live, primetime same day show. For the past five years Sunday Night Football had owned that coveted, top spot.  Now, there’s a caveat to this. According to The Comeback, “  …    this data factors in live+3 and live+7 viewings (from later in the week) so given how close it is and how sports are typically watched more live than scripted TV, SNF is probably ahead in live+sameday still. That’s important for advertisers, so it may still pull in more per spot. However, it’s worth mentioning that SNF won the overall crown last year even with live+7 factored in, and TBBT has passed it there now. ” “The Big Bang Theory” has at drawn statistically even with the NFL, if not surpassed it, which represents a clear change from the past   where SNF dominated thoroughly. Steven Perlberg of The Wall Street Journal wrote about this trend in November, “A pair of CBS programs were the   shows of 2016, dethroning NBC’s “Sunday Night Football” as the     primetime program on television, according to a new report from Nielsen. “The Big Bang Theory” averaged 19. 94 million viewers this year, followed by 19. 89 million for “NCIS” and 19. 28 million for “Sunday Night Football,” which last year topped the list with an average of 23. 29 million people tuning in. The report measured live viewing plus seven days of delayed viewing. “NBC said that “Sunday Night Football” is averaging 20. 08 million viewers this year when factoring in live and same day viewing for games through Dec. 12, while the Nielsen report only covered contests through Nov. 6. ” Even if “The Big Bang Theory” wasn’t breathing down SNF’s neck, the fact that one of the NFL’s premier television offerings has lost over three million viewers from last year should cause major concern for the league. In fairness, it’s not like Sunday Night Football lost to “The Real Housewives of Sheboygan,” or whatever. “The Big Bang Theory” has consistently been one of the most watched shows on television. Given that, the NFL should not feel ashamed by any of this. However, what the league absolutely should freak out about is the clear loss of their “favored nation” status among viewers. In 2016, the NFL got taught the lesson that they can’t just wheel out a bad product, court   player activists, and expect people to salivate over watching their games. That’s the lesson, will the jocks learn from it? Well, that’s another question entirely. For now though, it appears the nerds have gotten their revenge. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742563766.0362327}