{"duration": 0.06661367416381836, "input_args": {"text": "'U. S. Immigration and Customs Enforcement (ICE) officials are fighting back against false reports of checkpoints and sweeps during the ongoing operation targeting criminal (ICE) aliens. [“Reports of ICE checkpoints and sweeps are false, dangerous and irresponsible,” ICE officials wrote in a statement obtained by Breitbart Texas. “These reports create mass panic and put communities and law enforcement personnel in unnecessary danger. Any groups falsely reporting such activities are doing a disservice to those they claim to support. ”  Media outlets have been reporting statements by community activists that appear to be aimed at instilling fear and false information about the ICE’s Operation Crosscheck, a program targeting criminal aliens and those with immigration court removal orders. “Our community has seen an increase of ICE activity where we have heard ICE agents are going to people’s homes and detaining people,” Cristina Jimenez, executive director of United We Dream, said, according to NBCNews. While not speaking directly to the   operation, ICE officials stated, “ICE regularly conducts targeted enforcement operations during which additional resources and personnel are dedicated to apprehending deportable foreign nationals. All enforcement activities are conducted with the same level of professionalism and respect that ICE officers exhibit every day. ” “The focus of these operations is no different than the routine, targeted arrests carried out by ICE’s Fugitive Operations Teams on a daily basis,” the ICE statement concluded. News reports indicate ICE agents have arrested hundreds of criminal aliens over the past few days under this operation. Breitbart Texas reported from Austin, Texas, that 44 criminal aliens had been taken into custody this week. A Texas Congressman, Joaquin Castro ( ) confirmed the arrests were part of Operation Cross Check but questioned the threat posed by those being arrested. “I am asking ICE to clarify whether these individuals are in fact dangerous, violent threats to our communities, and not people who are here peacefully raising families and contributing to our state,” Castro said in a written statement obtained by Breitbart Texas. “I will continue to monitor this situation. ” Austin City Councilman Greg Casar added to the fear and false information about the operation by claiming the enforcement action was retaliation for standing up against President Donald Trump’s immigration plans. “I believe ICE is out in public arresting people in order to retaliate against our community for standing up for our values against people like Abbott and Trump,” Councilman Casar posted on Facebook. “Trump and his allies will do everything they can to divide Americans, invoke fear in vulnerable neighborhoods, and demonize an entire community of people. ” Breitbart California’s Michelle Moons reported ICE officials had arrested 160 illegal aliens over the past several days. Department of Homeland Security Spokesperson Gillian Christensen confirmed the arrests as part of a “routine” immigration enforcement action. President pro Tempore of the California State Senate Kevin de Leon also challenged the motivation of the operation and those being targeted for arrest. “There are reports that ICE today executed raids across Southern California,” de Leon said via a written statement obtained by Breitbart California. “I have asked federal officials to disclose how many children, men, and women they have detained what the processing time will be what the rationale is for their detention and I asked that everyone be offered access to an attorney. ” These types of   rhetoric comes despite statements from ICE and DHS that the operation is part of a routinely recurring operation targeting criminal aliens.  “Our operations are targeted and lead driven, prioritizing individuals who pose a risk to our communities,” ICE Spokesperson Virginia Kice told the Los Angeles Times. “Examples would include known street gang members, child sex offenders, and deportable foreign nationals with significant drug trafficking convictions. ” The operation is   in several states. In addition to California and Texas, ICE officials have arrested about 200 people in North Carolina, South Carolina and Georgia, FOX 8 News reported. “These reports show the serious consequences of the president’s executive order, which allows all undocumented immigrants to be categorized as criminals and requires increased enforcement in communities, rather than prioritizing dangerous criminals,” California Sen. Dianne Feinstein said in a statement without supporting her claims. The statement was also reported by Fox 8 News. Democrat leaders like Feinstein and Castro do not appear to have made similar protestations following this same ICE operation in March 2015. During the operation carried out under the Obama Administration, more than 2, 000 criminal aliens were rounded up for deportation in the   Operation Cross Check. “This nationwide operation led to the apprehension of more than 2, 000 convicted criminal aliens who pose the greatest risk to our public safety,”   Secretary of Homeland Security Alejandro Mayorkas said in a press release obtained by Breitbart Texas. “Today, communities around the country are safer because of the great work of the men and women of U. S. Immigration and Customs Enforcement. ” A full report on the 2017 Operation Cross Check, planned and scheduled during the Obama Administration, is expected to be released by ICE officials on Monday. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.  '"}, "time": 1742628307.627507}