{"duration": 0.15349674224853516, "input_args": {"text": "'PARENTS think a lot about what their money might one day do for their children. Will it give them options in life to accomplish something meaningful, or rob them of ambition? Or will a lack of family money leave them at a disadvantage? Of course, there are a lot of other outcomes. But fear about the bad things that money can do to children sends some    parents to lawyers and advisers to create trust documents with rules stating what children need to do to obtain the money. Even parents of modest means are encouraged to own life insurance policies in trusts to inhibit their children from getting all the cash at once should the parents die. These are necessary in certain cases. But long before children are aware of what they might inherit, there are more foundational conversations that parents should have. What if parents thought about the capital  —   yes, financial, but also emotional and intellectual  —   that they were spending on their young children as assets in an “emotional trust fund” with trustee duties inherent in it? That’s the concept being advanced by Jacalyn S. Burke, a former nanny, a commentator on parenthood issues, and the author of “The Nanny Time Bomb: Navigating the Crisis in Child Care” (Praeger, 2015). She argues that thinking in financial terms when it comes to parental choices could make a difference in shaping children who grow up to live meaningful lives  —   regardless of whether any money comes to them. The essential components of an emotional trust fund are analogous to those of a conventional one  —   cash, stocks, bonds and property as the holdings, with trustees directing the investments in each, with an eye toward the recipient’s best interest. How investments in those assets are divided up, though, is what matters. “That same structure we use for our financial lives could be applied to how we raise our children,” Ms. Burke said. “The different components could relate to a child’s life. A nanny comes in as a massive part of that portfolio, particularly if they work with them 9 to 5 and sometimes longer. ” Nannies and child care workers more broadly are the stocks in the emotional trust fund. Their influence on children is a bet on the future, and just like stocks, no one makes a selection thinking it will underperform. Like stocks, some nannies do well from the start. Others pay dividends over time. And then there are the ones that seem like   but prove to be disappointments. Ms. Burke said this is where her thinking started, largely because she found parents not putting enough time into selecting someone  —   or enough money into paying such a crucial person in their children’s development. Cutting corners and hiring a disengaged nanny early on, she said, could hurt a child’s ability to form relationships over the long run. To choose well, she said, parents need to do their due diligence. “For someone who you’re employing for the majority of the time when you’re out of the home, you should go back and see how that stock has performed in the past,” she said. “Did it perform well for six months or for 10 years? A reliable performer is someone with various credentials who shows up each week  —   that’s a solid stock that’s not going to wobble. ” Karen Kaufman, a clinical psychologist in Manhattan, who also wrote the preface to Ms. Burke’s book, said distracted nannies can inflict lasting damage on children. (The same goes for parents.) “Just about every nanny I see is on the phone,” Dr. Kaufman said. “They’re distracted. It’s all these little tiny disruptions that make kids question if they’re enough. ” Separating good from bad nannies is as difficult as trying to select a stock. Ms. Burke recommends detailed background checks but also visiting the nanny at home or where she was last working, to gauge her interaction with that family. This also serves to make sure the nanny is telling the truth. “I was routinely asked by other nannies to pretend I was a parent and be a reference,” she said. For people who have consistently chosen nannies who didn’t work out, Ms. Burke suggested finding a consultant to work with the family on finding the right fit, much as one would go to an adviser to help with selecting securities. And as with stocks, trustees need to be dutiful managers  —   in terms of nannies’ work but also their happiness in their jobs. “When nannies got together and complained, you’d think the No. 1 complaint would be the awful wages they got paid,” Ms. Burke said. “It wasn’t. It was the lack of respect. ” Of course, it may take time before parents can judge how well their child care money was spent  —   or they may have an anchoring bias that keeps them with a mediocre nanny for fear that others will be worse. Enrichment activities are different. They’re the bonds in the portfolio. Just as analysts following the declining prices of municipal bonds knew Detroit and Puerto Rico were headed into trouble long before a crisis hit, parents can measure their children’s responses to enrichment fairly quickly. Ms. Burke said she is not focused on the number or kind of activities for a child, but on how those activities are inspiring or hurting a child. “There is so much value in doing something outside their school curriculum,” she said. “There’s a consummate value in enriching your children but not overextending them. ” Community, broadly defined, is the property component of the emotional trust fund. “A cloistered sense of the world does not do them well,” Ms. Burke said. “At the weekends, walk the dog around the neighborhood, have pancakes, play ball in your neighborhood, get involved in your church or synagogue. It gives your kid a great grounding in life. ” How parents spend time with their children is the cash in the emotional trust fund. It can be spent wisely to maximum benefits or it can be squandered on things that don’t matter or could do harm. In some ways, spending that cash carelessly dovetails with too much enrichment  —   activities scheduled throughout the weekend keep families apart. Instead, Ms. Burke calls for parents to spend their emotional cash on experiences  —   sitting, playing, baking, talking  —   and not on more things. “Cash is switching your phone off and doing things with your children,” she said. “What I hear from children is they just want down time with their parents. I can’t tell you how many extremely wealthy children say ‘I just want to play ball with Dad. ’” Like any trust fund, an emotional one needs a balance between what the trustees  —   the parents  —   are doing and how those actions are received by children  —   the beneficiaries. “The nannies can provide a tremendous amount of education,” Dr. Kaufman said. “But the main theme is no one is as important as the parents. It’s encouraging parents to be more physically present, not to be on their devices, to make eye contact. ” None of this is to say that parents can substitute an emotional trust fund for talking to their children as they grow up about wealth and the responsibilities that come with it. “Financial wealth is not a free ride  —   it’s a powerful tool,” said Kristen Armstrong, a wealth dynamics coach with U. S. Bank’s Ascent Private Capital Management. “In high school, having some conversations about being a family with significant wealth and being a family who has some opportunities is important. ” Given the amount of time and money parents spend on their children today, the emotional trust fund is an interesting concept. If nothing else, thinking in these terms might reframe how people spend time and money in their family.'"}, "time": 1742564148.8516607}