{"duration": 0.054833173751831055, "input_args": {"text": "'0 Add Comment \\nON the verge of being elected, the first female president of the United States of America, Hillary Clinton admitted her first official act in office would probably be replacing FBI director James Comey or failing that, just scraping the FBI altogether. \\nAccused of politicizing his role as the FBI’s director and wilfully manufacturing a scandal that has implicated Clinton in some wrongdoing while failing to specify just what, who or why he is investigating anything, Comey remained defiant. \\n“Well, it’s not a bad way to spend your last few days in a job before being fired, ya gotta go out with a bang,” Comey explained. \\nComey remains under fire for reopening an investigation into Hillary Clinton’s much publicised personal email server, while refusing to give any details, just days before the November 8th polling day. \\nClinton’s campaign has asked for the public to be given all relevant information on the investigation so there can be no cynical insinuation of illegality without a shred of proof, however, the candidate herself admitted if elected ‘shit will go down’. \\n“More like Federal Bullshit Investigators, am I right?” Clinton shared with a rally of her supporters this morning, “I am not a petty person, but Comey’s desk better be cleared out come November 9th or he’ll suffer a fate more graphic than illicit images sent to minors by idiot politicians who have nothing to fucking do with my campaign,” Clinton added in a calm fashion. \\nIn a rare moment of candour, Clinton’s rival for president, Donald Trump, gave his support to the Democratic candidate. \\n“Shit, maybe my whole crazy bullshit about a shadowy network of people trying to fix elections for one side is actually a real thing,” Trump explained before correcting himself and calling for Clinton’s execution instead.'"}, "time": 1742561948.9126303}