{"duration": 0.06445884704589844, "input_args": {"text": "'A California woman accused of murdering her    was videotaped during her police interview celebrating his death and showing no remorse.[  Prosecutors showed jurors a videotape of Cynthia Cdebaca, 65, raising her arms in celebration of Geoward Eustaquio’s death by shooting, the Daily Mail reported. Cdebaca told police that she had planned on shooting Eustaquio for two weeks and that she bought a gun specifically for the purpose of killing him, KSWB reported. “Did you check on him after you shot him?” asked detectives. “I didn’t care,” answered Cdebaca.  “I would do it again. ” Cdebaca told detectives that she got into a fight with her    the morning of the shooting. “I got dressed and he said, ‘you can’t go like that.’ He told me you look ghetto,” said Cdebaca during the video testimony. She said she got angry when Eustaquio told her she wasn’t invited to attend her granddaughter’s spelling bee that day, and that she reached her breaking point after that argument. She even recounted how she shot her    10 times, even stopping to reload and shoot at him again after initially wounding him. “I shot him 10 times, then he went inside the house and locked the door,” said Cdebaca. That’s when she said she shot through the door, entered the home, fired the final rounds and stood over him. “Did you shoot till it was empty?” a detective was heard asking Cdebaca. “Yes, until it was empty,” said Cdebaca. Cdebaca told investigators that she and her family suffered Eustaquio’s abuse for 13 years. “So mean to me, to all of them. Yes he is,” said Cdebaca. “They were afraid of him, yes. So mean to my daughter. I told her 13 years ago, he’s evil. ” The video showed each member of Cdebaca’s family hugging her and saying goodbye before she was taken to jail. When Cdebaca asked her youngest granddaughter for a hug, the girl refused. “No, you killed my dad,” said the girl.'"}, "time": 1742562243.259084}