{"duration": 0.03058934211730957, "input_args": {"text": "'  Israeli Supporters Of Donald Trump Rally At ‘Jerusalem Forever’ Event In Israel’s Capital City Donald Trump addressed the crowd of several hundred Israelis via a one minute pre-recorded video message and vowed to make Israel and America safe again.   Supporters of Republican presidential candidate Donald Trump take part in a Trump Pro-Jerusalem rally overlooking the Old City of Jerusalem, Israel, on October 26, 2016. \\n“And I will bless them that bless thee, and curse him that curseth thee: and in thee shall all families of the earth be blessed.” Genesis 12:3 (KJV) \\nDonald Trump addressed the crowd of several hundred Israelis via a one minute pre-recorded video message and vowed to make Israel and America safe again. The event was entitled ‘Jerusalem Forever,’ and was held by Republicans Overseas Israel to affirm the Jewish ties to Jerusalem in light of the recent UNESCO resolution . Donald Trump’s message to Jerusalem rally: \\nThis was the message played at the Jerusalem Forever rally in the capital city of Israel yesterday. Awesomeness. Israel: Trump tells Jerusalem rally he ‘will make America and Israel safe again’ \\nCheck out this awesome footage from the pro-Trump rally in Jerusalem held yesterday. Donald Trump Promises To Move Embassy From Tel Aviv To Jerusalem: \\nWhy am I voting for Donald Trump? For this reason right here, I want to see with my own eyes an American president move the embassy from Tel Aviv to Jerusalem, thus recognizing that Jerusalem is the capital of Israel. Bam. Donald Trump to recognize Jerusalem as Israeli capital: On a rooftop overlooking the walls of Jerusalem’s Old City, around 200 American-Israeli fans of Donald Trump gathered to proclaim their support for the Republican candidate , convinced he will be Israel’s best friend if elected. “Trump will let Israel be itself and make its own decisions, that’s what I like,” David Weissman, a 35-year-old from Queens, New York, who moved to Israel three years ago, said at the event late on Wednesday. “He’s not a saint, but look at his achievements. He’s not afraid to identify the enemy as radical Islam, and he’s not going to support the two-state solution,” he said, referring to long-standing efforts to forge peace with the Palestinians. SHARE THIS ARTICLE  '"}, "time": 1742628606.4357567}