{"duration": 0.10539913177490234, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump, defending his recent phone call with Taiwan’s president, asserted in an interview broadcast on Sunday that the United States was not bound by the One China policy, the   diplomatic understanding that underpins America’s relationship with its biggest rival. Mr. Trump, speaking on Fox News, said he understood the principle of a single China that includes Taiwan, but declared, “I don’t know why we have to be bound by a One China policy unless we make a deal with China having to do with other things, including trade. ” “I mean, look,” he continued, “we’re being hurt very badly by China with devaluation with taxing us heavy at the borders when we don’t tax them with building a massive fortress in the middle of the South China Sea, which they shouldn’t be doing and, frankly, with not helping us at all with North Korea. ” Mr. Trump is not the first incoming Republican president to question the One China policy, but his suggestion that it could be used as a chip to correct Chinese behavior sets him apart, several Asia experts said. While Mr. Trump has been praised by some Republicans for taking a new look at China policy, his stance could risk a backlash by Beijing, the analysts said. Not since 1972, when President Richard M. Nixon and Mao Zedong enshrined the One China principle in the Shanghai Communiqué, has an American president or   so publicly and explicitly questioned the agreement, which resulted in the United States’ ending its diplomatic recognition of Taiwan in 1979. A spokesman for the Chinese Foreign Ministry said on Monday that the government had “serious concern” about Mr. Trump’s remarks, renewing a debate that erupted nine days ago when he took a congratulatory phone call from President Tsai   of Taiwan. At first, Mr. Trump played down the implications of the call, saying he was just being polite. Later, his aides said he was well aware of the diplomatic repercussions of speaking to Taiwan’s leader. Lobbyists for Taiwan, including the law firm of former Senator Bob Dole of Kansas, spent months laying the groundwork for the call. On Friday, China’s senior foreign policy official, Yang Jiechi, met with Lt. Gen. Michael T. Flynn, whom Mr. Trump has designated as his national security adviser, according to a person told about the meeting. It was not clear what the men had discussed. Some Republican foreign policy experts  —   including John R. Bolton, who is believed to be a   for the post of deputy secretary of state  —   have praised Mr. Trump for shaking up a   diplomatic agreement. As a candidate, Ronald Reagan criticized the decision to abrogate recognition of Taiwan after his election, he invited a delegation from Taiwan to attend his inauguration, antagonizing Beijing. In 1982, as president, Reagan pushed for the   Six Assurances, one of which was a reaffirmation that the United States did not formally recognize Chinese sovereignty over Taiwan. Still, he abided by the terms of the 1979 joint communiqué that established relations between the United States and China. But Mr. Trump’s suggestion that the policy could be wielded as a chip in a broader negotiation with China has implications not just for Washington’s relationship with Beijing, several experts on Asia said, but also for America’s support for Taiwan. “By putting One China up for grabs, Trump will suck all the oxygen out of the U. S.  relationship, and it risks eventually trading away U. S. support for Taiwan for another U. S. interest,” said Evan Medeiros, a former senior director for Asia at the National Security Council. “There are good reasons why eight presidents since 1972 have relied on the One China policy,” he added. “This is one area where the Trump team would do well to heed the lessons of history instead of bucking them in the uncertain hope of getting something. ” Jeffrey A. Bader, Mr. Medeiros’s predecessor in the Obama administration, said the One China policy had “always been seen as a foundation of the relationship. ” “Now Trump apparently sees it as part of a broader set of new transactions,” he said. “Mixing trade with an issue seen by Beijing as involving sovereignty is likely to produce an angry Chinese backlash and worsen both issues. ” An editorial on Monday in The Global Times, a Chinese   tabloid, said that Mr. Trump was “like a child in his ignorance of foreign policy. ” “The One China policy cannot be bought and sold,” the editorial said. “Trump, it seems, only understands business and believes that everything has a price. ” Mr. Trump, however, did not appear worried about inflaming Beijing. He repeated in the Fox News interview many of the criticisms he has made about China, emphasizing what he said was its unwillingness to help curb the nuclear ambitions of its neighbor North Korea  —   an issue that foreign policy experts believe could confront Mr. Trump as the first geopolitical crisis of his presidency. The   said he would not tolerate having the Chinese government dictate whether he could take a call from the president of Taiwan. He reiterated that he had not placed the call, and described it as “a very short call saying, ‘Congratulations, sir, on the victory. ’” The Chinese government, which once viewed Mr. Trump favorably as an alternative to the hawkish Hillary Clinton, has struggled to respond to Mr. Trump’s unorthodox approach. China’s foreign minister, Wang Yi, initially played down the significance of the phone call, calling it a “petty action by the Taiwan side” that he said would not upset the longstanding policy of One China. But as Mr. Trump has repeated his campaign criticisms of China  —   and as his statements about Taiwan have rippled throughout the region  —   Beijing has noticeably hardened its tone. It warned him last week, in a   editorial in the overseas edition of People’s Daily, that “creating troubles for the  . S. relationship is creating troubles for the U. S. itself. ” In a pointed rejoinder to Mr. Trump, the editorial said that pushing China on Taiwan “would greatly reduce the chance to achieve the goal of making America great again. ”'"}, "time": 1742561743.8824708}