{"duration": 0.08567476272583008, "input_args": {"text": "'Mittwoch, 16. November 2016 Neue App ruft automatisch bei Ex an, sobald man betrunken ist Berlin (dpo) - Mitten in der Nacht im Vollrausch den Ex-Partner anzurufen ist gar nicht so einfach. Oft ist man zu alkoholisiert, um die Nummer korrekt einzugeben. Nicht selten schläft man vorher ein und verpasst die Gelegenheit ganz, der Person, für die man immer noch Gefühle hat, unverständliche Dinge ins Ohr zu lallen. Die neue App \"DialX\" soll das nun ändern. Das nützliche Programm kontaktiert den Ex-Partner des Smartphone-Besitzers automatisch, sobald dieser deutliche Anzeichen von Betrunkenheit erkennen lässt. Dabei kann \"DialX\" anhand von Spracherkennung (Lallgrad) sowie durch eine Auswertung der Bewegungssensoren (Torkelgrad) des Handys abschätzen, ob der App-User die richtige Menge Alkohol zu sich genommen hat. \"Der Trick ist, nicht zu früh anzurufen, sonst kann man sich im Zweifelsfall am nächsten Tag noch an das peinliche Gespräch erinnern\", erklärt Christopher Jungwirth, der die App entwickelte. \"Zu spät ist aber auch nicht gut, da der oder die Ex dann womöglich keine der dahingelallten Beleidigungen oder Liebesbekundungen mehr verstehen kann. \\'DialX\\' findet genau den richtigen Zeitpunkt.\" Ist der ideale Alkoholwert bestimmt, wählt die App automatisch die Nummer der Ex-Freundin oder des Ex-Freundes. Gleichzeitig klingelt das eigene Telefon, damit der alkoholisierte Anrufer informiert ist und das Gespräch führen kann. Während der Unterhaltung bietet die App auf dem Display in extra großen Buchstaben unterstützende Stichworte an wie \"ich hab noch ein T-Shirt von dir\", \"mir doch egal, wie spät es ist\", \"ich lieb dich doch immer noch\", \"warum lässt du mich nicht einfach in Ruhe, du Schlampe/Arschloch?\" oder \"RÜLPS!\". Sollte der oder die Angerufene den Anruf in weiser Voraussicht auch nach dem zehnten Versuch nicht annehmen, verfasst die App automatisch eine wütende SMS oder eine WhatsApp-Nachricht mit zahlreichen Rechtschreibfehlern: \"DialX\" ist kostenlos bei Google Play und im AppStore erhältlich. Dem Macher der App ging es nach eigener Aussage nicht um Geld, sondern nur darum, seine Ex-Freundin zu beeindrucken. fed, ssi, dan; Foto [M]: Shutterstock Artikel teilen:'"}, "time": 1742561778.4400802}