{"duration": 0.06173586845397949, "input_args": {"text": "'Good morning. (Want to get California Today by email? Sign up.) California’s bullet train plan is the state’s biggest public works project. If all goes to plan, the $64 billion rail line would whisk passengers between San Francisco and Los Angeles in 2 hours 40 minutes. Other rides would make stops in the Silicon and Central Valleys. But it’s not taking off soon. A segment between San Jose and a station near Bakersfield is expected to begin operating in 2025. The target date for the San   Angeles line isn’t until 2029. (A second phase would extend the lines north to Sacramento and south to San Diego.) As you may have guessed, to pull all of this off is complicated  —   technically, financially and politically. From time to time, California Today readers have written to ask for an update on where things stand. We checked in with Karen E. Philbrick, executive director of the Mineta Transportation Institute at San Jose State University, who has studied the plan and responded to questions via email. • How is the work going? • How does the funding picture look? And what’s the burden going to be for California taxpayers? • Some critics are calling the project a boondoggle that should be halted. What’s your take? • What does a Donald Trump administration mean for the project? • Besides faster trips, what are other upsides of the rail line? • Yahoo said more than one billion user accounts were hacked in 2013. Among the stolen data were passwords and security questions. [The New York Times] • Uber debuted   cars in San Francisco, only to have the D. M. V. say it was illegal. [The New York Times] • “I’m here to help you folks do well,”   Trump told Jeff Bezos, Elon Musk, Tim Cook and other technology leaders. [The New York Times] • “We’ve got a lot of firepower”: Gov. Jerry Brown vowed to fight the incoming Trump administration on climate change. [San Francisco Chronicle] • The 102 million dead trees in California’s forests are turning tree cutters into millionaires. [The Los Angeles Times] • Oakland lawmakers are working on legislation that might allow people living illegally in warehouses to stay. [The New York Times] • Sacramento once had an underground art and music scene. No more. [Sacramento Bee] • Military veterans make up a growing part of San Diego’s   community. [The New York Times] • Warner Bros. is consolidating its filmmaking power after a creatively inconsistent stretch. [The New York Times] • A San Francisco 49ers executive has found his voice in helping to educate people about anorexia. [The New York Times] • At an N. F. L. meeting, team owners showed grudging support for relocation efforts by the Raiders and Chargers. [The New York Times] • The youngest member of the   clan has built a business empire for herself. [The New York Times] • Photographs: A group of women dressed as angels paddleboarded around Morro Bay Harbor singing Christmas carols. [The Tribune] You might want to grab your umbrella. A big storm is expected to drench much of the state. Forecasters warned of high winds, surging waterways and the potential for flooding in places throughout the state into Friday. On Thursday, heavy rain was poised to soak the northern half, especially along the coasts and in the Sierra Nevada, where up to five inches of rain could fall, said Brooke Bingaman, a forecaster with the National Weather Service’s Sacramento office. From there, it was expected to spread to Southern California, where officials circulated warnings about the possibility of flash floods and mudflows on slopes stripped bare by wildfires. At the same time, the anticipated rain was seen as more welcome news for the state’s lakes and reservoirs, depleted by five years of drought. Strong rainfall in Northern California over the last few months has helped lift water levels above historical averages at several reservoirs, including Lake Don Pedro, Lake Shasta and Folsom Lake. “We’ve had some nice rain,” said Doug Carlson, information officer for the California Department of Water Resources. “And that’s reflected in some of these reservoirs. ” But Mr. Carlson added that the greater concern for drought relief was the level of snowpack in the Sierra Nevada, which plays a vital role in replenishing the reservoirs in the spring and summer. On Wednesday, the statewide snowpack was only 55 percent of the historical average, according to government data. “That’s a bad sign,” Mr. Carlson said. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742628469.671299}