{"duration": 0.22701215744018555, "input_args": {"text": "'I was born in the shadow of the 21st century, so I never knew O. J. Simpson as an athlete or as an actor. I wasn’t quite a year old on Jan. 1, 1989, the day Simpson beat his wife, Nicole   so badly that she fled their house screaming, “He’s going to kill me!” I was only 6 on June 17, 1994, when the N. B. A. finals broadcast cut away to a shot of Simpson’s white Ford Bronco creeping down a California highway, escorted by a line of    as if in a funeral procession. That was four days after   35, and her friend Ronald Goldman, 25, were found dead in pools of blood, nearly decapitated. Some of my earliest memories are of that white Bronco, and of the “Trial of the Century” that followed, and of my parents’ happiness when Simpson was acquitted. I understand now that I was watching Simpson’s fall. As recently as a few months ago, though, I still couldn’t contextualize Simpson, the things he had accomplished or the lofty position he occupied in America  —   in white America. I approached older friends, people who had grown up watching Simpson move from a Hall of Fame N. F. L. career to mainstream megastardom, and asked them who his modern equivalent would be. But there aren’t any. Few American athletes have been as widely beloved as Simpson was. Even today, his popularity seems inconceivable. “O. J.: Made in America,” the ESPN “30 for 30” documentary directed by Ezra Edelman that is airing this week, busies itself with the making of the man at the myth’s center and with the country that helped him become a monster. It’s the best thing ESPN has ever produced. And it answers my question: Simpson’s story is that of a black man who came of age during the civil rights era and spent his entire adult life trying to “transcend race”  —   to claim that strange accolade bestowed on blacks spanning from Pelé to Prince to Nelson Mandela to Muhammad Ali. Which is to say, it’s the story of a halfback trying, and failing, to outrun his own blackness. This country was built on the backs of black slaves whose lives and labor were stolen by their white masters. That theft created a caste system in which both groups of people could occupy the same spaces yet have completely different experiences: a white America and a black America. This was true in 1619, in 1865 and in 1947, when Simpson was born it holds true today. Yet there are a few blacks  —   the most singular and spectacular among us  —   who have unique and priceless gifts to offer. Racial transcendence happens when white America takes these gifts for itself, in exchange for acceptance within white culture. It is the mechanism through which whites acknowledge the humanity of black superhumans and which allows these few to move, supposedly, beyond blackness, their talents granting them safe passage through white spaces, mouths and memories. Every black person, successful or not, has to overcome a steep handicap the idea of racial transcendence is anchored in the fallacy that the handicap is blackness itself, rather than a society that terrorizes and undermines blacks at every turn. Racial transcendence is a lie, but it’s one that Simpson believed in deeply. In the first installment of “O. J.: Made in America,” a sociologist and activist named Dr. Harry Edwards describes his efforts to recruit Simpson into a collective of black athletes working for civil rights in the late 1960s  —   people like Muhammad Ali, Lew Alcindor (later Kareem  ) Jim Brown and the Olympic sprinters Tommie Smith and John Carlos, who raised their fists in a   salute at the 1968 Olympics. Simpson refused. After just one season at the University of Southern California, it was obvious that he was a priceless talent. It wasn’t just that he was stronger and faster than everyone else was Simpson ran almost daintily, tiptoeing through seams visible only to him, leaving defenders diving at air. He had emerged from nowhere, fully formed, already one of the best college running backs of all time and already more famous than most of the athletes in Edwards’s collective. “His response,” Edwards remembers in the documentary, “was, ‘I’m not black, I’m O. J.’ ” In 1968, the same year Martin Luther King Jr. was assassinated, Simpson believed he could escape race in America. For as long as there have been Negroes in the country, there have been “exceptional Negroes. ” When Joe Louis was boxing in the 1930s and 1940s, his talent and humility allowed him to be thought of, his son claimed, “as an American, not as a black. By winning, he became white America’s first black hero. ” The sportswriter Jimmy Cannon called Louis “a credit to his race  —   the human race. ” This is the same fraudulent   that remains widespread today, found in people who claim that they “don’t see color” or that “All Lives Matter” it’s a nasty bit of gaslighting  —   the denial of racism through the denial of race itself. At its best, Edelman’s documentary reveals what made Simpson unique: not simply that he tried to outrun his blackness, but the herculean efforts he made to do so. Simpson, with his team of friends and   erected a     universe, one he inhabited for much of his adult life. At no point is this more obvious than when the documentary recounts the shooting of his famous 1978 Hertz commercial. To advertise the   giant’s speed of service, the company’s chief executive, Frank Olson, enlisted Simpson to run through Newark International Airport. That simple conceit required that an entire false reality be built to support it. No other black people could be included in the shot. Fred Levinson, who directed the scene, instead added white bystanders, who cheered on Simpson as he sprinted through the empty hallways, telegraphing that he was safe, and therefore that they were, too. Hertz’s universe was like Simpson’s, held together with lies, ever on the verge of collapse. Levinson was able to look at a man with hickory skin, full lips, a wide nose and a nappy Afro, and say this: “He’s African, but he’s a   man. He almost has white features. ” Olson continues: “For us, O. J. was colorless. None of the people that we associated with looked at him as a black man. ” One of the most alarming anecdotes in the documentary comes from Robert Lipsyte, a former sportswriter for The New York Times. “He was telling me a story about being at a teammate’s wedding with his wife and sitting at a table of mostly, as he said it, mostly Negroes,” Lipsyte recounts. “And he overheard a white woman sitting at the next table saying, ‘Look, there’s O. J. sitting with all those niggers.’ And I remember in my naïveté saying, ‘That must have been terrible for you.’ And he said, ‘No, it was great. Don’t you understand? She knew that I wasn’t black. She saw me as O. J.’ ” In a time of black revolution, Simpson was a counterrevolutionary as blacks embraced black power and   Simpson surrounded himself with white people. There were plenty of great black football players around his time, but Simpson was special: Not only did he play better than most, he also used his wit and charm in the service of making white people feel safe. In a period of nationwide change and unrest, he was “one of the good ones. ” He played the role happily, and it brought him a level of fame as unprecedented as his eventual fall. “O. J.: Made in America” makes it very plain that Simpson almost certainly committed the murders and that he almost certainly was going to be acquitted from the beginning. The Los Angeles Police Department’s collection of evidence from the crime scene was botched, as was the prosecution itself. The trial was held just two years after Rodney King’s beating by L. A. P. D. officers, their acquittals and the ensuing riots. The two cases further divided the city along racial lines, laying bare the way that blacks and whites could occupy the same space yet live in separate worlds. When Simpson left the courthouse a free man, blacks across the country rejoiced, his white friends and fawners abandoned him and the universe around him crumbled. Simpson seems to have understood many things about how   racial transcendence works. He understood how black talent could be   for white gain and how, by denying his blackness, he could exercise a perverse control over his image. He understood that racial transcendence is less about who you are and more about who you aren’t. In this country, racially transcendent blacks are used as exemplars, direct foils to creeping black counterculture. Some blacks are complicit in the caper Simpson was the perfect portrait of an   black athlete. When Richard Pryor was lacing his sets with the word “nigger,” Bill Cosby was beginning to peddle respectability politics he remained transcendent until the world was reminded of allegations that he had spent his career drugging and raping women. When Allen Iverson was popularizing cornrows, baggy shorts and tattoos in the N. B. A. Tiger Woods was the respectable black athlete on the golf circuit. Even now, the N. B. A. ’s most valuable player, Steph Curry  —   who transforms from a   showman during the game to a humble,   introvert minutes after  —   is the subject of all manner of racial projection and notes on skin tone. A white friend of mine once called him the league’s first Great White Hope since Larry Bird. What Simpson may not have recognized, though, is that the United States’ history is a story of theft, and theft doesn’t require cooperation. Talents you don’t trade can be stolen through your silence, through your absence or after your death. And once you’ve been marked as having “transcended race,” the success you’ve earned in spite of white racism can be twisted into an example of white magnanimity. Muhammad Ali was a menace, a black fighter who engaged in psychological warfare with his opponents, changed his name after joining a   sect and gave up the best years of his career in exile rather than killing for a country he decried as racist  —   yet after his death, the sportscaster Chris Myers could tweet that “When you saw #Ali, you didn’t see color, you didn’t see religion. ” Martin Luther King Jr. harassed by the F. B. I. and ultimately assassinated, is now deployed as a symbol of a nation that has achieved colorblindness. Whitney Houston, a black woman who made black music after finding her voice in a black church, was congratulated on transcending race after her death. You can imagine the Barack Obama obituaries to come. I grew up in a different America from the one in which Simpson did, but one thing still unites our two worlds: The highest compliment America will pay black people today is to say they escaped their blackness, which is to say they escaped themselves. As long as Simpson’s shortcomings were kept to cheating in golf against wealthy, white businessmen, and his physical abuse of   was kept behind closed doors, he could pretend that he wasn’t black  —   just O. J. But when he stood trial for murder, he did so as a black man. Racial transcendence is, above all, probationary.'"}, "time": 1742563767.3390212}