{"duration": 0.030912160873413086, "input_args": {"text": "'  actor Matthew McConaughey sent a sobering message to celebrities and the cultural elites protesting Donald Trump’s election and his new administration: get over it. [During an interview with ChannelFi to promote his new film, Gold, McConaughey was asked if he thinks Hollywood had given Trump a chance to govern.  “Well, they don’t have a choice now. He’s our president,” the Oscar winner said. “And, it’s very dynamic and as divisive of an Inauguration and time as we’ve had. At the same time, it’s time for us to embrace and shake hands with this fact. And be constructive with him over the next four years. ” Even if you have strong disagreements with Trump, McConaughey says, it’s worth waiting to see what he actually does in his first term in office. “So anyone, even those who may strongly disagree with his principles or things he’s said and done  —   and that’s another thing, we’ll see what he does compares to what he has said  —   no matter how much you even disagreed along the way, it’s time to think about how constructive can you be,” he said.  Some of the entertainment industry’s biggest stars have spent months protesting Trump’s stunning Election Night victory over Hillary Clinton, and have caused outrage over his Cabinet appointments, his executive orders, and even his pick for the Supreme Court. Celebrities have even gone so far as to launch personal attacks against Trump’s    son. But McConaughey says it’s past time Trump’s detractors stop protesting Trump for the sake of protesting. “‘Cause he’s our president for the next four years, at least,” McConaughey said, “the President of the United States. ” McConaughey’s new thriller Gold, in which he plays a prospector in Indonesia, opened in theaters on Jan. 27 and is directed by Stephen Gaghan. Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628378.3048797}