{"duration": 0.0734415054321289, "input_args": {"text": "'Print Saeed Toosi, right, and Ayatollah Khamenei \\nAfter failed attempts by top Iran officials to cover up the scandal, the nation’s leading reciter of the Quran and close friend of Ayatollah Khamenei has been accused of raping 19 of his students and charged with “advocating corruption.” \\nSaeed Toosi, 46, winner of the first prize for reading the Quran, both internationally and locally, fell under suspicion after a broadcast by Persian Voice of America – banned for viewing by Tehran – in which three alleged rape victims came forward with written and audio evidence and described sexual assaults by Toosi, reported Al Arabiya. \\nIn an audio recording, Toosi said that Khamenei knew of the sexual assaults and, together with the head of Iran’s judicial authority, had agreed to a cover-up to protect the reputation of the nation’s quranic institution and the regime. \\nIt’s time to stop tiptoeing around the facts. “The Politically Incorrect Guide to Islam and the Crusades” is a much-needed dose of truth about the “religion of peace.” \\nOne document has Toosi admitting that his actions with his students had been a “mistake.” One of the victims – a recent first-place winner in a quranic competition – claimed he was raped when he was 12 while traveling abroad with Toosi to attend a competition. The mentor, according to the charge, booked the pair in a single hotel room where the attack took place. \\nAll victims who have filed statements were between 12 and 14 at the time of the alleged attacks. The incidents took place over the past seven years during “quranic trips to more than 20 countries in the world aimed at ‘spreading the quranic culture’ and to participate in quranic competitions.” \\nToosi is highly respected as Iran’s most celebrated reader of the Quran and was previously called an “exemplary model to be followed” by Khamenei, current supreme leader of Iran. He is a permanent guest of Khamenei in the annual quranic councils celebrated during Ramadan. Last May, Toosi was asked to recite verses from the Quran at the opening session of the Shura council, with many of Iran’s top officials in attendance. \\nThe students told Persian VOA they had filed charges with the House of Leadership, but officials dismissed their claims, citing a “repentance letter” from Toosi admitting his actions and claiming to be a “changed man.” \\nWhile Iran officially imposes the death penalty for homosexuality, sex between men and boys is viewed with some toleration in the culture, causing confusion as to whether the resulting relationships are consensual or forced. The case is further complicated by the fact allegations of sexual misconduct against powerful officials are unheard of in the Islamic Republic. \\nAccording to the reformist Amad News, officials held a two-hour emergency meeting with the judiciary following outcries over the broadcast. The initial intent to bury the story failed after it reached the national press and resulted in Toosi now being charged. \\nJudiciary chief Ayatollah Sadeq Larijani, whom the victims’ audio showed conspiring with Khamenei to cover up the incidents, defended the regime’s handling of the case, London Guardian reported. Larijani called for punishment of those who cooperated with “hostile media” in the VOA story, “so we know who is [loyal] to the revolution and who is not.” \\nThe case has been given to a judge for a ruling, though there will be no public trial. Awad News reports members of the Army of the Guardians of the Islamic Revolution are planning to “assassinate” Toosi to end the scandal and save the regime’s reputation. \\nToosi, who has denied the charges against him – calling them “total lies” meant to discredit Iran’s religious institutions and the ayatollah – is reportedly threatening to release the names of 100 of Iran’s top officials he claims are implicated in the rape and molestation of children, if the prosecution proceeds.'"}, "time": 1742563127.0396214}