{"duration": 0.04938983917236328, "input_args": {"text": "'Sen. Tom Cotton ( ) took to the Senate floor on Thursday ahead of the vote on the spending bill to fund the federal government through September, citing as the main reason he voted against it the flood of unskilled workers that could be admitted to the United States under the legislation. [“I want to hone in on one particular provision that shows just how bad this process is,” Cotton said, noting the bill is almost 1, 700 pages in length.  “They don’t hide the good things in the bill, they only hide the bad things,” Cotton said. “So look to page 735, section   you will find an increase in   visas of almost 79, 000. “A 120 percent increase over the normal annual cap of a   seasonal visa program for temporary workers that can take up to nine or ten months,” Cotton said. “It’s not necessary. It has nothing to do with funding the government, nothing. ” Cotton criticized the process and noted it is unclear how the visa section got into a spending bill. “But this is what it does: it takes jobs away from American workers and abuses the immigrants that come into this country,” Cotton said, noting that according to the Department of Labor thousands of guest workers have been abused by American employers, including sexual abuse. “It is a   form of indentured servitude,” Cotton said. Breitbart News reported ahead of the spending bill vote that the it allows the Department of Homeland Security to import at least 20, 000 extra foreign   workers for seasonal jobs in the United States, instead of requiring companies to recruit, train, and pay marginalized Americans. The   program currently allows companies that do seasonal work to import up to 66, 000 foreign workers each year instead of recruiting and hiring Americans. The program is supported by Democrats and Republicans eager to aid local business groups, which are competing against each other for American workers, and which face competition from the companies that employ roughly eight million illegal immigrants. The program means companies don’t have to pay a premium to hire Americans for seasonal overtime work that leaves them unemployed in winter, and it also reduces pressure on the companies to recruit and train youths and marginalized Americans, including millions of Americans who have fallen out of the workforce. The imported workers are also paid at rates that are lower than needed to attract Americans to those jobs  —   which also means that the companies can pay lower wages to their   American workers. Cotton said the spending bill reinforces the false narrative about American workers and what jobs they are willing to take. “A lot of the arguments for this kind of program boil down to this: No American worker will do that job,” Cotton said. “That is a lie. It is a lie. ” “There is no job that Americans will not do,” Cotton said. “There is no industry in America where a majority of workers are not   American citizens or   lawful immigrants  —   not landscapers, not construction workers, not ski instructors, not lifeguards, not resort workers, not crab men, not a single one. ” “If the wage is decent and the employer obeys the law, Americans will do the job,” Cotton said. “And if it’s not, they should pay higher wages. To say anything else is an insult to the work ethic of the American people who make this country run. ” '"}, "time": 1742562320.3285213}