{"duration": 0.08475232124328613, "input_args": {"text": "'Cook these six vegetables for even greater health benefits \\n  raw food , cooking , vegetables (NaturalNews) \"To cook or not to cook?\" has been a topic of heated debate among some health food advocates. Raw food junkies claim that eating foods in their most natural state is the answer to all our issues and diseases, cancer included. They believe that cooking destroys essential vitamins, live enzymes and antioxidants vital to our health.While nobody will dispute the fact that adding more raw, organic fruits and vegetables to our diet is essential for overall health and well-being, going raw all the way isn\\'t always the best option either. A study published in the British Journal of Nutrition found that people who followed a strictly raw food diet had normal levels of vitamin A and beta-carotene, but low levels of the antioxidant lycopene. As reported by Scientific American , high lycopene levels have been associated with a lower risk of cancer and heart attacks. According to Rui Hai Liu, an associate professor of food science at Cornell University, lycopene may be an even more potent antioxidant than vitamin C .It seems that some vegetables need a little heat to release their plant goodness. Most plants have a tough cellular structure. Lightly cooking these food makes it easier for the body to break down the plant\\'s thick cell walls, making nutrients more available for absorption .Read on to discover six foods that are healthier cooked. 1. Asparagus Lightly cooking asparagus spears makes it easier for the body to absorb cancer-fighting vitamins such as vitamin A, C and E, as well as folate. Furthermore, higher levels of antioxidants, ferulic acid in particular, have been reported when this vegetable is cooked. 2. Carrots Beta-carotene is the compound that gives carrots their vibrant orange color. The body converts beta-carotene to vitamin A, which is vital for vision, reproduction, bone growth and immune health.Carrots, however, are sturdy vegetables and don\\'t give up their nutrients that quickly. To get the most out of your carrots, Researchers at the University of Arkansas advise that higher levels of beta-carotene are obtained when carrots are cooked. 3. Mushrooms According to Andrew Weil, M.D., mushrooms are indigestible when they are uncooked. He said that thoroughly heating them releases the nutrients they contain, including B vitamins, proteins and minerals, as well as compounds not found in other foods. 4. Pumpkin and other winter squash Not many people will eat raw pumpkin, unless it is put through a juicer , and that is just fine, since cooked pumpkin has been shown to be more nutritious. Just like carrots, pumpkins need a little heat to break down tougher cell walls and release their plant goodness. 5. Spinach Folate, vitamin C, niacin, riboflavin and potassium are more available in raw spinach. However, slightly cooking spinach increases the levels of vitamin A and E, fiber, zinc, thiamin, calcium, iron and protein – as well as essential carotenoids, such as beta-carotene, lutein and zeaxanthin. 6. Tomatoes While cooking tomatoes reduces vitamin C levels, it also makes lycopene more available to the body. As mentioned earlier, lycopene has been linked to a lower risk of cancer and heart attacks. Vitamin C is an abundant vitamin, so it is well worth the loss.As you can see, raw isn\\'t necessarily always best. However, if you love tomato or spinach salads and can\\'t stand them cooked, that doesn\\'t mean you should stop eating them raw. Whether you enjoy your veggies raw or cooked, the most important thing is that you are eating them in the first place.  '"}, "time": 1742564400.587115}