{"duration": 0.15728187561035156, "input_args": {"text": "\"Submit Home This Month Popular 8 Reasons Why You Should Try Photography As A Hobby 8 Reasons Why You Should Try Photography As A Hobby Photography really is one of the most rewarding hobbies a man could pursue Ness Nomadison \\nNess is a thirty-something American with almost a decade of experience living and traveling across Asia. He's a strong believer in pursuing one's passions, continual self-improvement, and just being the best man he can be. He runs his own website, NessTheNomad.com . November 21, 2016 Lifestyle \\nHave you ever had a curiosity in photography, yet you weren’t sure if it’s a hobby really worthy of your limited time? Then this article was written for you, as I was also once in your shoes. \\nI picked up a DSLR camera for the first time back in 2013, which awoke a passion inside me that I never even knew was there. Three and half years later, I’m here to tell you just a few of the many benefits and realizations I’ve experienced by taking on this timeless hobby. Here are eight reasons photography might just be the most meaningful hobby you’ve overlooked your entire life. 1. An Opportunity to Flex Your Creative Muscle \\nIn order to be balanced human beings, I believe people need to be physically healthy, spiritually awake, and creatively expressive. Photography, just like writing and film, is a selfless way to be creative while also giving something back to the world. \\nThe way we interpret our world changes from individual to individual, and photography provides a medium for people to express themselves. Ask ten different photographers to photograph the same thing – a city for example – and be prepared to see ten wildly different visions of the same subject. In our sensory-overload world, it feels good to create something that’s uniquely you. 2. Appreciate and Understand Your Surroundings More \\nI now find myself seeing everything around me in rectangular frames–a takeaway from having to frame so many pictures over the years. “Oh, those people over there would fit perfectly into a 3:2 box,” or “that building over there would look perfect boxed in from this angle.” My eyes are now sharper than ever. \\nBut I also find myself observing and appreciating all the little things around me. I always have to keep my camera nearby, because I often want to photograph something I’ve noticed in my daily routine. The pattern on a sewer lid, a reflection in a puddle, birds perched in a tree, and so forth. \\nMy pre-photographer self, just like most of the rest of the world, would have walked right past these things without a care in the world. Yet now I can be entertained from the most minuscule and simple things, especially if my camera is handy. The world is full of photogenic things, if can just teach yourself to notice them. 3. Help Preserve History \\nSince its inception, photography has always been one of the most moving ways to preserve history in our rapidly changing modern times. Photos touch people in a way other media can’t. Both photography and video are both visual arts, but photographs differ in that they capture merely one frame of what is going on. Yet one frame is all one needs to feel taken back to another time. \\nWith the advent of the smartphone, photography is as accessible as ever. While this sounds good on paper, the truth is our world’s becoming more and more flooded with garbage and narcissistic photographs. Our world needs more adventurous and well-trained photographers out there taking photos of the modern world we live in and the rapid changes it’s undergoing. These are the photos that will be cherished decades down the road, not all the shitty selfies that bog down social media. 4. Travel Experiences Will Be More Meaningful \\nPhotography goes with traveling like bread goes with butter. It took me nearly five years of traveling internationally to finally get serious about doing photography on my trips, and after I got started, I never looked back. \\nRather than traveling for escapism and hedonism, I’m traveling to learn about and document our world. As a result, my trips feel much more meaningful and fulfilling than they ever did before. The way you see and come to understand a country as a photographer is quite different than if you weren’t one. \\nI now divide my history of travel experiences into two separate groups–the trips I had before I owned a DSLR camera, and the trips I had after buying one. Photography is so fun and addicting, that I find myself wanting to go back to all those pre-DSLR camera destinations, even the ones I didn’t enjoy all that much, just so I can re-experience them with a camera in hand. 5. An Opportunity to Meet New People \\nOne thing I always try to do when I travel is meet fellow photographers. Whether they be foreign or local, I appreciate talking to people with an observational eye, as they can provide me with unique insight that non-photographers rarely can. \\nBut photography doesn’t just help you meet other photographers, it helps you meet other people from all walks of life. I’ve had regular people on the street come up and talk to me once they saw I was taking photos. I’ve also met people from online for no other reason than they liked my work. \\nBeing a good photographer can also be a great way to meet women. They’re not gonna start blowing you as soon as they see your awesome pictures, but don’t be surprised if you discover some newfound female admiration once your excellent photography skills are out in the open. And if you can make a woman look beautiful in a photo, she’ll admire you in a way you never imagined. 6. A Blog with an Edge \\nIn the diverse world of independently run blogs, how many bloggers do you know who can both write well and photograph well? I can literally only think of one , and the fact that this blogger is just as good at utilizing a camera as he is at wielding a pen (or rather a keyboard), puts his website in a league of its own in terms of quality content. \\nThough I still highly respect the good bloggers out there for their amazing writing skills and insights, I think they’re doing both their readers and websites a great disservice by merely using stock photos or shitty shot-with-a-cell-phone photos in their articles. \\nReaders can definitely tell the difference when a blogger takes all of their own photos with a nice DSLR camera. Start taking nice, DSLR-shot photos and see for yourself how they can enhance your articles. They’ll give you just that much more of an edge over all the other bloggers who don’t. 7. You’ll Also Have an Edge over 98% of Others on Social Media and Dating Sites \\nSince everyone else is posting lame, smartphone-taken shots all over their social media accounts, your DSLR-shot photos could shine like diamonds in the rough. The same way you stand above 98% of other men by lifting weights regularly, the same advantage can be expected by not taking cheap shortcuts with your social media-bound photography. Your Facebook, Instagram, and Twitter accounts will all look better than ever before. \\nThis is also true for dating websites and apps, where most chumps just take some lame mirror selfies with their smartphone and then upload them to their accounts. Dudes with well-taken, nontraditional photos stand out big time. Don’t just take my word for it, as there has actually been plenty of discussion about these benefits over at the Roosh V Forum . \\nAnd although they can be very helpful, you don’t actually need another photographer with you to get some good shots of yourself. Rather all you need is your camera, an autofocus lens, a tripod, a remote shutter, and a creative eye. 8. A Resume-enhancing, Marketable Skill \\nPhotography isn’t just mentally rewarding, it can also be financially rewarding if you play your cards right. The field of profitable photography may be vast and highly competitive, but one thing’s for sure – the demand for new photographs is infinite. The world never stops turning after all. Stock, portrait, wedding, wildlife, travel, sports, and news photography are just a few of the most in demand and profitable niches. \\nBut if you really wanna make money selling your photographs, you gotta make a name for yourself by sharpening your skills and networking with the right people. A great photographer who no one knows exists won’t make any money. \\nMy father is an outdoorsman slash wildlife photographer with decades of experience, tens of thousands of photos, and a giant network of contacts from his industry. It seems like magazine and website editors are always knocking on his door, because they know he probably has a nice shot of exactly what they’re looking for. Often all he has to do is dig through his archives, and boom–he’s made 500 bucks. Conclusion \\nStop dreaming about it, and just give photography a shot already. Borrow your friend or a family member’s DSLR camera for the weekend, and just get out there and take pictures of anything that strikes your fancy. \\nPhotography takes decades to master, but it all begins with a single click of the shutter button. Yet sometimes all it takes is one little click to realize you’ve been missing out on something very big and meaningful your entire life. You’ll never know until you try.\""}, "time": 1742563276.0088534}