{"duration": 0.12266159057617188, "input_args": {"text": "'As everyone embraces the power of publicity, industry leader Annie Jennings, founder of the National Firm, Annie Jennings PR, shares the new way to think of publicity and avoid the many pitfalls that stand in your way. With so many people selling services without a track record of success for their clients, you have to protect yourself and ask the right questions.\\nWhat is in it for me? \\nThis is the first question you should be asking about your publicity strategy. In addition, the first of a new, three-headed PR mindset for success. The other two, understanding the power of being socially relevant and thinking of your media bookings as assets to be leveraged over the long haul, come into play as you start building your ascent to the top.\\nTo be sure, you are aligned with the right approach to your publicity that will elevate your credibility, exposure, and business; you must ask, “What’s in it for me?” This question is designed to make sure you are buying deliverables. This means secured PR media placements that actually occur and are designed to propel your personal and business growth forward. Asking this question makes sure you are working with a publicist who specializes in your particular growth area and can answer the question as it pertains to your goals.\\nThis one piece of advice is precious. Asking this question will help you avoid wasting your money and instead leads to you investing your money in a targeted media strategy with specific outcomes in mind that serve to advance your level of achievement and standing in your industry. When you simply spend your marketing money without a plan that supports outcomes, once you buy the service, the money is gone.\\nHowever, when you know “what’s in it for you” and invest accordingly, you can expect to get a return on your investment. Now this is how a great PR firm works. They are always asking the question “what is in it for my client?”\\nIt’s go time \\nOnce you have your PR strategy in place, it’s time to go after the media placements. It is time to decide how you, your message, your book and/or area of expertise relates to society today.\\nMany people will try to force a topic through to the media. This is a mistake. It is so much better to go with the media flow (that is, the issues of the day) than try to push a concept or conversation that has no social relevance at the time. \\nDefine what it is you want to say and understand where you fit into the national conversation on topics within your areas of expertise. When you can address an issue people are talking about right now and are qualified to discuss it, the bookers can say YES to you.\\nThat is what we call the triple win. The show keeps its listeners or viewers glued to the program, the audience is fascinated and the guest (YOU) is very happy as you got a chance to share your message, promote yourself and live your book out loud. You also get a strong media asset that you can leverage into more opportunity.\\nCollecting assets \\nAccumulating these bookings as assets allows you to keep them working for you for years to come, giving you a competitive edge. The final part of the all new PR strategy for success focuses on incorporating the big brand names into your marketing outreach.\\nConsultants, speakers, and authors have said that major national media is a critical component in a greater business and marketing strategy. It enhances growth and allows you to realize a potential that in many cases, you would not have been able to reach without that publicity. Becoming a regular contributor to a highly respected news outlet, for example. On the other hand, perhaps being the consultant hired for big money contracts with prestigious organizations that enhance your image. With this scaled up reputation, you may be able to name your price when it comes to speaking engagements. What happens in the all new PR mindset, is that over time, you become the prize. You are now the one being pursued.\\nNo miracle outcomes \\nThis is why investing in publicity assets offers a tremendous advantage over just plunking down money on any old publicity plan hoping for a miracle outcome. There are no miracle outcomes. There is just a careful planning of a PR strategy that is implemented accordingly. The plan should be specifically designed for your intended objectives. What do you want to achieve? Do you want to be regular or do you want to be great? Do you want to be the envy of your industry and call the shots? It is all possible. Consistency over time following a PR strategy that has been tailored to your goals and dreams is the secret.\\nOptimal success is the result of an investment in yourself and again, not just careless spending with no advance knowledge of the outcome. That is why you always have to ask, “What’s in it for me?”\\nWritten by Annie Jennings\\n(Edited by Cherese Jackson) \\nSource:\\nAnnie Jennings PR : Ever Wonder How The Big Experts Think About Publicity?\\nPhoto Credits:\\nFeatured Image Courtesy of Niuton may – Flickr License\\nTop and Inline Images Courtesy of Annie Jennings\\nAnnie Jennings, founder of the National Publicity Firm Annie Jennings PR , has innovated industry concepts for more than 20 years as the media has rapidly evolved. Annie has been a contributing commentator in the national media including Fast Company, Inc., Entrepreneur, US Weekly, TheStreet.com and been an invited speaker to NYU’s publishing program, The Harvard Club, the American Society of Journalists and Authors and hundreds more.    brand , Marketing , media , PR , public relations'"}, "time": 1742562689.5446315}