{"duration": 0.06360840797424316, "input_args": {"text": "'Comments \\nA bombshell report from CNBC confirms that FBI Director James Comey had in fact concluded that the government of the Russian Federation was interfering with the election, but fought to keep that information from being released to the public because it was “too close to the election.” \\nInstead, Comey prevented the name FBI from appearing on the statement the government ultimately made on October 7th. \\nThis attitude stands in stark contrast to the cavalier way in which Director Comey threw a wrench into the election by writing a letter to “update” Congress on the Hillary Clinton email investigation since the FBI discovered emails that “may” be pertinent to their previous inquiries. \\nThat announcement has drastically shifted the polling landscape of the election and given the Republican Party the final stretch ammunition that the Donald Trump campaign, sinking after weeks of sexual assault revelations, needed to bail themselves out and redirect the national narrative away from their own bad press. \\nThe hypocrisy is astounding; it appears that the Director of the Federal Bureau of Investigation attempted to hide the machinations by a foreign power to interfere in the elections of the United States to protect the Republican nominee, who has a long documented history with the operatives of said foreign power and a personally profitable reason to cultivate their support. \\nThe Director then said that he couldn’t release that information to the public – which definitely deserves to know if a foreign power is interfering with our electoral process – because it was “too close to the election” but then releases an intentionally vague and misleading letter concerning new emails that “may or may not be” pertinent to an investigation which the FBI itself had already exonerated Democratic nominee Hillary Clinton over? \\nIt’s obvious that Director Comey has joined Congressional Republicans in their efforts to conduct a witch-hunt against one of our nation’s most devoted public servants and usher in the election of a treasonous sexual predator instead.'"}, "time": 1742561979.3378036}