{"duration": 0.03801846504211426, "input_args": {"text": "\"Trump’s Walk of Fame star smashed with a sledgehammer (VIDEO) Published time: 26 Oct, 2016 18:46 Edited time: 26 Oct, 2016 18:46 Get short URL People take photos of Donald Trump's star on the Hollywood Walk of Fame after it was vandalized in Hollywood, California U.S., October 26, 2016. © Mario Anzuoni / Reuters Donald Trump’s star on the Hollywood Walk of Fame has been reduced to dust with a sledgehammer. Trends US Elections 2016 \\nA man dressed as a construction worker arrived at the site early Wednesday morning to inflict some serious damage on the Hollywood Boulevard star. Using a sledgehammer, the man later identified as Jamie Otis attacked the star, literally pounding it to dust as onlookers watched. \\nTrump’s star has seen a lot of abuse during his presidential run. From being spray-painted with a Swastika to being covered in dog feces and having its own wall built around it, the star has been a target for disgruntled Americans angered by the Republican candidate’s controversial statements. Someone defaced Donald Trump's Star,the idiot trying to portray him as a Nazi,used the Buddhist swastika LOL pic.twitter.com/CxhBzBa2sP — Faolan (@TheCoffeeSnolf) January 31, 2016 \\nOtis originally planned to remove the star and then auction it off, with the money going towards victims of Trump’s alleged sexual harassment and assault. Speaking to reporters at the scene, Otis explained “four or five” of his family members had been victims of sexual assault, and he wa s “terribly upset that we have a presidential nominee who is the poster child for sexual violence.” \\nOver the past month, nearly a dozen women have come forth to accuse Trump of sexually assaulting them in the past. Most are represented by Gloria Allred, a California lawyer and outspoken Democrat. \\nThe Hollywood Chamber of Commerce, which is in charge of the Walk of Fame, condemned the star’s destruction. \\n“The Hollywood Walk of Fame is an institution celebrating the positive contributions of the inductees,” Chamber of Commerce’s Leon Gubler said. “When people are unhappy with one of our honorees, we would hope that they would project their anger in more positive ways than to vandalize a California State landmark. Our democracy is based on respect for the law. People can make a difference by voting and not destroying public property.” \\nThe Chamber of Commerce is working to prosecute those involved, Gubler said, adding that the star will be repaired immediately. A city worker repairs Trump's star on the Hollywood Walk Of Fame, which was destroyed by a man with a jackhammer pic.twitter.com/sonjT2Osiw — Super Deluxe (@superdeluxe) October 26, 2016 \\nTrump received a star on the famous walkway in 2007 for his work on the reality show The Apprentice.\""}, "time": 1742628426.7222054}