{"duration": 0.08149123191833496, "input_args": {"text": "'  Germany  —   The United States broke with other large industrial nations over trade on Saturday as the Trump administration rejected concerns among allies about spreading protectionism and made clear that it would seek new approaches to managing global commerce. At a meeting of finance ministers and central bankers from the Group of 20 industrialized and emerging nations and the European Union, Steven Mnuchin, attending his first major international gathering as Treasury secretary, signaled that American policy would follow the campaign promises made by President Trump to put “America first” and review existing trade agreements to seek better deals for the United States. As a result, the ministers’ joint statement, normally a study in blandness, became an unlikely focus of controversy here. The representatives could agree only on a tortured compromise stating, in effect, that trade is a good thing. Adjectives like “open” were dropped, and the ministers omitted language used in previous communiqués that condemned protectionism, repudiating decades of free trade doctrine. For Asian and European officials, many of them meeting their Trump administration counterparts for the first time, it was a startling lesson in how Mr. Trump and his team are overturning   assumptions about international commerce. Mr. Mnuchin led off the ministers’ meeting on Friday with a declaration that current trade rules were unfair to the United States, positioning the administration against virtually all the other participants, according to an official who attended the closed session and spoke on the condition of anonymity because of the sensitivity of the talks. “We thought that it was very important for the communiqué to reflect what we discussed here,” Mr. Mnuchin said at a news conference on Saturday. “The historical language was not relevant. ” At the insistence of the United States, the communiqué also dropped a pledge to observe the Paris accords on climate change. Mr. Mnuchin deflected questions on the issue, saying it was outside his purview. The American government’s lack of reverence for existing norms and treaties is particularly unsettling to the   Europeans, who are coping with weak economic growth and a surge in populism. The last thing they need is a disruption in commerce with their biggest trading partner. Some complained privately that the American delegation rode into this stately spa and casino town, where Romans once bathed in the   waters, determined to shake up the existing order but without any clear idea of what should replace it. The disagreement over trade principles was a sharp contrast to the statement issued when the central bankers and finance ministers met in Chengdu, China, last July. “We underscore the role of open trade policies,” the leaders said in the Chengdu communiqué, which used the word “trade” six times. They promised to “resist all forms of protectionism. ” Less than a year ago, such a statement was not questioned. Business leaders on both sides of the Atlantic still hoped for a trade pact between the United States and the European Union that would eliminate already low tariffs and harmonize regulations governing things like vehicle headlights. Since then, Mr. Trump has pulled out of the   Partnership negotiated by President Barack Obama, vowed to renegotiate the North American Free Trade Agreement with Mexico and Canada, and criticized the German carmaker BMW for building a factory in Mexico. The best that the Group of 20 participants could come up with on Saturday was this: “We are working to strengthen the contribution of trade to our economies. ” Mr. Mnuchin argued that the news media’s focus on the language of the communiqué was overblown and said that the discussions in Baden Baden had been congenial. “We were incredibly productive,” he said. But he also made it clear that the Trump administration had a vastly different view than its recent predecessors. “We believe in free trade,” he said. But he added, “We want to   certain agreements. ” “Balanced trade has to be what’s good for us and what’s good for other people,” Mr. Mnuchin said. “It has to be a   situation. ” The communiqués issued at the end of Group of 20 summit meetings are meant to show that nations like Brazil, China, France and Japan can put aside competing interests and reach consensus, however vague, on major issues. The statements emerge from tortuous deliberations and are the opposite of impulsive. But even the usual boilerplate platitudes proved fraught at this summit meeting. For many European and Asian officials, meeting in a Belle Époch spa building with polished marble floors and chandeliers dangling from the ceiling, it was their first encounter with the Trump administration and its “America first” foreign policy. Some viewed the meetings as a chance to socialize with the new American representatives and to try to absorb them into the international order. Angel Gurría, the   of the Organization for Economic Cooperation and Development and a participant in the meetings, said the chance to get to know Mr. Mnuchin was more important than any joint statement. “We want to make him feel comfortable we want to make him feel at home,” Mr. Gurría told reporters. “These meetings are not about the communiqué. ” In their public statements, European leaders played down the conflicts and said that the discussions had been amiable. The meetings in   came after Mr. Mnuchin visited Wolfgang Schäuble, the German finance minister, in Berlin. “Naturally we have different points of view,” Mr. Schäuble said at a news conference on Saturday in  . But he added, “We worked very hard for two days in a pleasant atmosphere. ” He also denied that the American delegation was at odds with other participants. “The Americans were not isolated,” Mr. Schäuble said. Mr. Trump’s threats to impose punitive taxes on imported goods are a particular worry for Germany, whose economy is built around exports of automobiles and industrial machinery. The United States is the biggest purchaser of German goods, buying 107 billion euros, or $115 billion, worth last year. Germany imported goods from the United States worth 58 billion euros. The trade imbalance has made Germany a target for Trump administration officials, who have accused Germany of manipulating the value of the euro and have said they want to renegotiate trade terms directly with Berlin, even though that task is done at a European level by Brussels. “We are going to look to our counterparts to continue to trade, but to look to have more balanced trade,” Mr. Mnuchin said. “That means over time reducing our trade deficits. I think we can do that in a way that’s good for the American worker, that’s good for our companies and that’s good for our counterparties. ”'"}, "time": 1742628360.294433}