{"duration": 0.06114840507507324, "input_args": {"text": "'This post was originally published on this site \\nsott.net/news \\nA meeting of the contact group on the settlement of the Ukrainian crisis is going to be held today in Minsk. \\nSteinmeier’s formula \\nThe primary issue of this meeting is going to be the consideration of Steinmeier’s formula, which determines a special status for Donetsk and Lugansk and, after the publication of the election results in these regions, potential transfer to self-government. Moreover, the officials of these republics say that, without agreement on this matter, it is impossible to solve any other problems. \\nMeanwhile, Kiev is delaying decision-making on this issue. The talks are going very slowly and unproductively. \\nProvocations \\nIn addition, Kiev is continuing provocations against Russia. Despite the fact that Russia is not a party to the conflict and does not participate in these talks, Kiev’s provocations negatively affect the credibility of Ukraine and do not help the course of the group’s work. \\nJust recently, Kiev sent several groups of spies and saboteurs to Russia and kidnapped two Russian citizens. Now they are being detained with the possibility of ransom, which suggests that all of this was started for the sole purpose of at least slightly improving Ukraine’s deplorable financial condition. \\nThe neutral territory \\nDuring his visit to Moscow yesterday, President of Belarus Alexander Lukashenko said that Belarus was a neutral party and would not support any of the conflict’s sides, despite the fact that Kiev has really done everything possible to foment bad relations with all of its neighbors, including even its traditional anti-Russian ally – Poland. \\nThe incident with the Belarusian aircraft, when Ukraine threatened to raise fighters against a passenger liner flying from Kiev to Minsk, did nothing good for the international image of Poroshenko, nor for Ukrainian-Belarusian relations, which until recently were considered to be even closer than relations between Minsk and Moscow. \\nExpectations \\nAll of these facts suggest that no high expectations should be held for the meeting. Most likely, Kiev will once again delay the solution of fundamental problems, confining itself to blackmail over prisoners of the DPR and the LPR. Perhaps some contract clauses will be agreed upon, but no more should be expected. Related '"}, "time": 1742561863.9194636}