{"duration": 0.05995917320251465, "input_args": {"text": "'October 26, 2016 Trump Has Hissy Fit After Reporter Points Out Pausing Campaign To Open Hotel Is Really Dumb (VIDEO)   \\nDon’t bother pointing out how incredibly dim-witted it is to pause a losing campaign just days away from Election Day to open up a luxury hotel to the Republican nominee, Trump doesn’t want to hear it. \\nAfter inexplicably spending a day participating in an opening ceremony for a new Trump Hotel in Washington DC, its namesake was in no mood to discuss his failing campaign. CNN’s Dana Bash learned that the hard way when she asked the question on everyone’s mind: What were you thinking? \\nRather than answer, Trump threw a hissy fit. \\n“I say the following: You have been covering me for the last — long time. I did yesterday eight stops and three major speeches, and I’ve been doing this for weeks straight,” Trump said. \\n“For you to ask me that question is actually very insulting because Hillary Clinton does one stop and then she goes home and sleeps. And yet you’ll ask me that question. I think that’s a very rude question, to be honest with you.” Dana Bash: Is your DC hotel opening free advertising? Donald Trump: “No, not at all” https://t.co/6OZtrfIwim https://t.co/9HHqooom8r \\n— CNN Politics (@CNNPolitics) October 26, 2016 \\nFor those keeping score that short answer checks a lot of boxes: Whining about the media Flagrant conspiracy theory about Hillary Clinton’s health Groundless accusation that asking a simple question is “rude” No answer whatsoever \\nTrump may be testy due to his slow realization that his campaign is under water, he has no practical way forward, and it would take a miracle to win. \\nInstead of even trying, he seems to be retreating to the things he knows will make him money after the election. His campaign recently launched the prototype to “Trump TV,” a daily live stream filled with confused campaign staffers, shameless opportunists and Rudy Giuliani. He also seems desperate to salvage his failing properties, something that may not be possible after running a campaign that offended practically every group in America. \\nAlready there are signs that Trump’s hotels have taken a hit. Yahoo explains : Rates for rooms at Trump’s new D.C. hotel are being slashed as travelers weigh their options, and smartphone data suggest fewer people are visiting his properties compared to rival venues nearby. The Republican nominee for president is in danger of losing not just the election, but something dear to a man who claims the marketing value of his name alone is worth $3 billion: the many customers, mostly wealthy, who have stayed at his hotels, played a round at his golf courses or held galas at his oceanside resorts. \\nTrump may find that his bigotry has cost him not only the election, but the fortune he valued more than his reputation as well. \\nFeatured image via Twitter'"}, "time": 1742561806.3205206}