{"duration": 1.5918431282043457, "input_args": {"text": "'0 comments \\nWe all know the corruption in DC is real, but it’s still be a very SHOCKING past few weeks with all the skeletons coming out of the closet proving us right! \\nNow, we have learned that the FBI really wanted to do their job and investigate Hillary correctly to see if she needed to be put away. The problem was …. Obama’s Justice Department. \\nThey got in the way. \\nCLASSIC corruption move… \\nNow they are busted….and metaphorically caught with their pants down. What the FBI has released now, is going to make it REAL hard for the Justice Department to dodge this one… \\nFBI investigators believed the audio was at least worth investigating and they grew increasingly frustrated as they ran into roadblocks erected by corruption prosecutors and even some FBI executives, sources told The Wall Street Journal. The prosecutors reportedly felt the case wasn’t worth bringing to a grand jury because the individual in the secret recording wasn’t working inside the Clinton Foundation. \\nFBI Deputy Director Andrew McCabe and U.S. Attorney for the Eastern District of New York, Robert Capers, were both at the center of the internal dispute, per the report: \\nAmid the internal finger-pointing on the Clinton Foundation matter, some have blamed the FBI’s No. 2 official, deputy director Andrew McCabe, claiming he sought to stop agents from pursuing the case this summer. His defenders deny that, and say it was the Justice Department that kept pushing back on the investigation. \\nAt times, people on both sides of the dispute thought Mr. Capers agreed with them. Defenders of Mr. Capers said he was straightforward and always told people he thought the case wasn’t strong. \\nAnother bombshell Fox News report published Wednesday suggested that FBI agents are now “actively and aggressively pursuing” the Clinton Foundation case. Two separate sources told Fox News the case is now “very high priority.” \\nTo see the FOX reporting CLICK HERE \\nThere are no answers in DC, and there hasn’t been for a very long time. There is now, only corruption. I’d say it’s high time we do drain the swamp. \\nLets hope what need to happen in order for that to be done… happens on November 8th. Related Items'"}, "time": 1742562693.4218342}