{"duration": 0.04959416389465332, "input_args": {"text": "'Posted on October 31, 2016 by Dr. Eowyn | 5 Comments \\nLast Saturday, Oct. 29, the Medford Police Patrolmen’s Association (MPPA) of Medford, Massachusetts, posted 3 photos on its Facebook page of two Medford police officers seemingly arresting a person in a Hillary Clinton mask and orange prison clothes at the Halloween Fall Festival in Haines Square, West Medford. \\nCBS Boston reports, Oct. 30, 2016, that the caption on the photos read: \\n“Look who MPD grabbed at the Fall Festival in Haines Square today…” \\nAnother photo showed three Medford police officers posing with someone in a Donald Trump mask, with the caption, “Making America GREAT again in West Medford Square!!” \\nBy 8:15 pm that night, MPPA removed the posts from its Facebook page, with an apology in a statement from MPPA President Harry MacGilvray: \\n“These were Halloween costumes. It was meant totally as a joke. I apologize if this offended anyone in any way. I never expected this sort of reaction. It was poor judgment on my part.” \\nMacGilvray was one of the officers in the photos. LOL \\nFox25 WFXT reports that the police union removed the photos because of a flurry of negative Facebook comments from Hillary supporters, such as: \\nJennifer Popkin: “I can’t believe this unprofessional behavior. Police in uniform should not be espousing political beliefs, let alone the kind of irresponsible rhetoric coming from Donald Trump. Absolutely deplorable and also likely illegal under Section 23(b)(2)(ii) of the conflict of interest law.” \\nMike Piehl: “Trump goes on trial for fraud in November and child rape in December but YOU . . . .” \\nJeremy Thorpe: “This is illegal. I am screen-shotting this comment to demonstrate that you are deleting critical comments.” \\nKatarina Dutton: “As a citizen of Medford, I am appalled by police making it clear that I, and so many others, are not welcome or safe here.” \\nTamar Amidon: “This is so shameful for Medford. I’m so glad I don’t live there now. I never thought of them being one of the bad apple bins.” \\nThat Popkin, Piehl, Thorpe, Dutton, Amidon, et al. are outraged by the Medford police Halloween prank but not in the least bothered by of Hillary Clinton’s criminal use of an unsecured email server, her utterly corrupt pay-for-play Clinton Foundation, and her abandoning four Americans to die in Benghazi, can only mean one thing: \\n~Eowyn'"}, "time": 1742561694.7542918}