{"duration": 0.05153703689575195, "input_args": {"text": "'Wed, 26 Oct 2016 03:20 UTC From CARDIFF UNIVERSITY Why does our planet experience an ice age every 100,000 years? Deep storage of carbon dioxide in the oceans may have triggered this unexplained phenomena, new research shows. © Lisieki and Raymo LR04 δ18O from Lisieki and Raymo (2005) correlated to the temperature anomaly inferred from the deuterium concentration in ice cores from EPICA Dome C, Antarctica (Jouzel et al., 2007). The main orbital (purple), tectonic (brown) and oceanic (blue) events are indicated (see the text for the references of each event). The orange box represents the start of the onset of the Northern Hemisphere glaciations. 100 kyrs and 40 kyrs correspond to the orbitally-driven glacial/interglacial cycles period. This period changed from 41 kyrs to 100 kyrs during the Mid-Pleistocene Transition toward 1 Ma (MPT). click to enlarge Experts from Cardiff University have offered up an explanation as to why our planet began to move in and out of ice ages every 100,000 years. This mysterious phenomena, dubbed the \\'100,000 year problem\\', has been occurring for the past million years or so and leads to vast ice sheets covering North America, Europe and Asia. Up until now, scientists have been unable to explain why this happens. Our planet\\'s ice ages used to occur at intervals of every 40,000 years, which made sense to scientists as the Earth\\'s seasons vary in a predictable way, with colder summers occurring at these intervals. However there was a point, about a million years ago, called the \\'Mid-Pleistocene Transition\\', in which the ice age intervals changed from every 40,000 years to every 100,000 years. New research published today in the journal Geology has suggested the oceans may be responsible for this change, specifically in the way that they suck carbon dioxide (CO2) out of the atmosphere. By studying the chemical make-up of tiny fossils on the ocean floor, the team discovered that there was more CO2 stored in the deep ocean during the ice age periods at regular intervals every 100,000 years. This suggests that extra carbon dioxide was being pulled from the atmosphere and into the oceans at this time, subsequently lowering the temperature on Earth and enabling vast ice sheets to engulf the Northern Hemisphere. Lead author of the research Professor Carrie Lear, from the School of Earth and Ocean Sciences, said: \"We can think of the oceans as inhaling and exhaling carbon dioxide, so when the ice sheets are larger, the oceans have inhaled carbon dioxide from the atmosphere, making the planet colder. When the ice sheets are small, the oceans have exhaled carbon dioxide, so there is more in the atmosphere which makes the planet warmer. \"By looking at the fossils of tiny creatures on the ocean floor, we showed that when ice sheets were advancing and retreating every 100,000 years the oceans were inhaling more carbon dioxide in the cold periods, suggesting that there was less left in the atmosphere.\" Marine algae play a key role in removing CO2 from the atmosphere as it is an essential ingredient of photosynthesis. CO2 is put back into the atmosphere when deep ocean water rises to the surface through a process called upwelling, but when a vast amount of sea ice is present this prevents the CO2 from being exhaled, which could make the ice sheets bigger and prolong the ice age. \"If we think of the oceans inhaling and exhaling carbon dioxide, the presence of vast amounts of ice is like a giant gobstopper. It\\'s like a lid on the surface of the ocean,\" Prof Lear continued. The Earth\\'s climate is currently in a warm spell between glacial periods. The last ice age ended about 11,000 years ago. Since then, temperatures and sea levels have risen, and ice caps have retreated back to the poles. In addition to these natural cycles, manmade carbon emissions are also having an effect by warming the climate.'"}, "time": 1742628363.3269112}