{"duration": 0.04497027397155762, "input_args": {"text": "'\\nThe lawlessness of the Obama Administration knows no bounds.\\nNot only has President Obama made every move he can through executive order to create and foster amnesty for illegal immigrants, but his Justice Department is now attempting to force people to hire undocumented workers.\\nIronically, the agency on the other end of intimidation is the Denver County Sheriff’s Office.\\nIncredibly backwards…\\nvia the Daily Caller :\\nDenver County’s sheriff office has been slapped with a fine by the Department of Justice (DOJ) because it refused to hire non-citizens as deputies. \\nFrom the beginning of 2015 through last March, the Denver Sheriff Department went on a major hiring binge, adding more than 200 new deputies. But those jobs ended up only going to citizens, because the department made citizenship a stated requirement on the job application . The department admitted as much in a new settlement with the U.S. government, which requires it to pay a $10,000 fine. \\nThe department will also have to comb through all of its job applications from the past two years, identifying immigrants who were excluded from the hiring process and giving them due consideration. \\nHow can someone be hired to enforce the law, if they are living in violation and ignorance of it?\\nHow can counties, state agencies, small businesses or individuals be forced to hire in violation of the law, in order to comply with non-discrimination?\\nObviously the system has a logical loop failure, either that, or someone wants this country to eat itself.\\nRead more: \\nOutrage: Border Patrol Ordered To Release All Illegal Alien Drunk Drivers: “Allow Them to Go On Their Way” \\nWatch: How Liberals React When Asked to House An Illegal Immigrant Child In Their Homes \\nImmigration End Game Revealed: New Law Would Give Illegal Immigrants The Right To Vote, Collect Government Benefits \\nUrged by Obama, Illegal Immigrants Line Up to Vote Against Trump: “Donald Trump Never!” '"}, "time": 1742563165.9098775}