{"duration": 0.1434776782989502, "input_args": {"text": "'LOS ANGELES  —   Nine days after Nikolas Michaud’s latest heroin relapse, the skinny    sat on a roof deck at a new drug rehabilitation clinic here. He picked up a bong, filled it with a pinch of marijuana, lit the leaves and inhaled. All this took place in plain view of the clinic’s director. “The rules here are a little lax,” Mr. Michaud said. In almost any other rehab setting in the country, smoking pot would be a major infraction and a likely cause for being booted out. But here at High Sobriety  —   the clinic with a name that sounds like the title of a Cheech and Chong comeback movie  —   it is not just permitted, but part of the treatment. The new clinic is experimenting with a concept made possible by the growing legalization of marijuana: that pot, rather than being a gateway into drugs, could be a gateway out. A small but growing number of pain doctors and addiction specialists are overseeing the use of marijuana as a substitute for more potent and dangerous drugs. Dr. Mark Wallace, chairman of the division of pain medicine in the department of anesthesia at the University of California, San Diego, said over the last five years he has used marijuana to help several hundred patients transition off opiates. “The majority of patients continue to use it,” he said of marijuana. But he added that they tell him of the opiates: “I feel like I was a slave to that drug. I feel like I have my life back. ” Dr. Wallace is quick to note that his evidence is anecdotal and more study is needed. Research in rats, he said, supports the idea that the use of cannabinoids can induce withdrawal from heavier substances. But in humans? A report published in  January from the National Academy of Sciences on the health effects of cannabis “found no evidence to support or refute the conclusion that cannabinoids are an effective treatment for achieving abstinence in the use of addictive substances,” said Dr. Marie McCormick, a Harvard professor who was the chairwoman of the report committee. The group’s research did find strong evidence to support that cannabis or related compounds can be used to treat chronic pain in adults. But that is different from using it safely and effectively to wean people off drugs, and some experts in the addiction field are highly skeptical. “The concept on its face is absurd,” said Dr. Mark Willenbring, a psychiatrist who treats addicts and formerly oversaw research at the National Institute for Alcohol Abuse and Alcoholism. He said that alternative approaches are needed to traditional drug treatment, but not this. “I’m not prone to making exaggerated or unqualified statements and in this case I don’t need to make any: It doesn’t work,” he said. “Like trying to cure alcoholism with Valium. ” The idea stems not only from the legalization of marijuana in several states, including California, but also from a broader reckoning taking place in the traditional addiction treatment business:   treatment often fails, costing families, the government or insurers tens of thousands of dollars per therapy. Many patients quit partway through treatment, or relapse time and again. These failings have become more apparent owing to a handful of developments: a growing death toll from opiates and an increase in the death rate of young white adults caused by drug overdoses. There also is a growing conversation about whether some update is needed to the bedrock   program: It demands total abstinence but many people fail and ultimately die. Some research suggests that marijuana might help stem the tide. A study published in 2014 in JAMA Internal Medicine found that states with medical marijuana laws have lower rates of death from opiate overdose. Another paper, published this year in The International Journal of Drug Policy, found that 30 percent of the 271 respondents reported that they used marijuana as a substitute for opiates. (But the researchers noted that the sample could be unrepresentative and that it was not known if marijuana provided a partial or total substitute for other drugs, and how much other drug use was displaced.) More concrete and direct evidence has been hard to gather given that marijuana is still seen as a   Schedule 1 drug by the federal government, which severely limits availability of funding for studies on humans. Amanda Reiman, a   expert and lecturer at the University of California, Berkeley, called the lack of such studies “a huge barrier. ” She said that the dearth of evidence argues not just for further study, but for pushing ahead with clinics like High Sobriety. Her main point is that opiates and other addictive drugs kill people so why not make every effort to find a better way. “There’s no scientific reason to believe that somebody is better off being completely miserable and sober than using cannabis occasionally, or even fairly regularly, as an adult and being functional and happy and productive,” said Dr. Reiman, an unpaid consultant with High Sobriety, who added, “Using cannabis is a relatively safe practice. ” The   and main investor in High Sobriety, Michael Welch, is a recovering heroin addict who was helped by a traditional,   program. He also   and operates several    rehabilitation clinics that have a total of 100 beds. (Charges range from $25, 000 to $80, 000 a month for a private room). “Every single treatment center knows it, and we know it,’’ Mr. Welch said. “Some of us have had the same clients, five, 10, 15 times over. We say: ‘We just can’t reach Billy, we just can’t reach Joe. ’” Why not, he said, try marijuana to help take the edge off for clients who “can’t face the emotional threshold” of abstinence. “People are dying,” he said. His   Joe Schrank, argued that marijuana will not kill patients as opiates do. But it does help clients sleep, relax and develop an appetite. The drug, he said, gives addicts some sense of emotional control. High Sobriety’s first inpatient was Mr. Michaud, who shared his story in February and it seems tailor made to test their hypothesis. A military brat who moved around, he said he felt traumatized when his homosexuality surfaced as a child and he was told in places like Kansas and South Carolina that he wasn’t gay but suffering from various mental disorders.   led to   until his life, he said, was a cocktail party of morphine, heroin and pills. His mother, Kristen Michaud, said that over the years she sent him to half a dozen programs, several of them more than once, and spent more than $300, 000. But so far he has stayed the course at High Sobriety, which Mr. Schrank attributed to the availability of marijuana. “If this kid doesn’t get cannabis, he’s a goner,” said Mr. Schrank, himself a recovering addict who previously founded and ran a clinic in Brooklyn. “If it wasn’t for cannabis, he’d have bolted in the middle of the night. ”'"}, "time": 1742563378.1684444}