{"duration": 0.09253215789794922, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. President Trump, in his fourth tumultuous week in office, boasted that his new administration was a “  machine. ” A news conference to announce his new nominee for labor secretary, R. Alexander Acosta, a former assistant attorney general for civil rights, turned into an extraordinarily raw and angry  . “The tone is such hatred,” he said of cable TV commentary. “I’m really not a bad person. ” _____ 2. Representative Mick Mulvaney of South Carolina was confirmed as budget director. He is a fiscal hawk who will play a central role in the administration’s plans to reshape the federal government. But Mr. Trump’s nominee to lead the Environmental Protection Agency, Scott Pruitt, heads to a confirmation vote Friday amid an extraordinary wave of protest from former E. P. A. staff members. Such   confirmation battles have helped make Republican lawmakers unable to deliver on their promises of sweeping legislation on health care, overhauling the tax code or upgrading the nation’s infrastructure. They are particularly fractured on how to repeal and replace Obamacare. _____ 3. An uncounted number of immigrants across the country  —   carpenters and cooks, students, cleaners and grocery store owners  —   stayed home in protest of the Trump administration’s immigration policies. “We’re at a stage where we’re like, what else is there to do except organize and boycott?” said an activist in New York. The Justice Department said it would not seek a rehearing on the president’s targeted travel ban in a federal appeals court, saying a new order was in the works. _____ 4. Intelligence officials, on edge over Mr. Trump’s criticism of leaks related to his associates’   contacts with Russian intelligence agents, are resisting his plans to assign Stephen A. Feinberg, a New York billionaire, to review intelligence agencies. That Russian naval intelligence ship hanging off the East Coast? For some, it’s a symbol of current tensions, but the Coast Guard says there’s nothing all that unusual about it. Today’s episode of the podcast The Daily asks, did the Trump campaign collude with Russia? Listen from a computer, on an iOS device or on an Android device. _____ 5. In environmental news, a Greenpeace report tied the toxic waves of air pollution sweeping northern China to an increase in already excessive steel production last year, made counter to promised cuts. Scientists are also coming to understand the crucial importance of the vast, and endangered, seagrass meadows that surround every continent except Antarctica. _____ 6. The Islamic State has destroyed many of the prized antiquities and ruins in the Syrian city of Palmyra. But a new digital exhibition is helping preserve its legacy. The Getty has gathered   etchings of Palmyra and the oldest known photographs of the city. Most have not been seen widely before. “More than just testaments to a threatened archaeological inheritance,” our critic writes, they are “traces of explorations and crosscultural exchange too many now seek to shut down. ” _____ 7. Mark Zuckerberg updated Facebook’s mission statement in a   letter that was close to a political statement from the    executive. He expressed alarm over growing rejections of globalism and argued that “progress now requires humanity coming together not just as cities or nations, but also as a global community. ” And Snap Inc. Snapchat’s parent company, is aiming for a valuation of more than $20 billion as it nears what’s expected to be the biggest initial public offering in the tech world since Alibaba and Facebook. _____ 8. You don’t need us to tell you the world is full of paradoxes. But one of our sports reporters found a special case: Hunts for bighorn sheep  —   prized as challenging, and prohibitively expensive  —   are helping revive wild sheep populations and expand their territory. A permit sold for a record $480, 000 in 2013. _____ 9.   TV continues to showcase jokes about the White House and Russia. Stephen Colbert took particular aim at Mr. Trump’s efforts to blame the leakers who revealed Trump associates’ contacts with Russian intelligence over the last year. “Here’s the thing,” Mr. Colbert said. “It can’t be both fake news and an illegal leak of classified information. ‘Your honor, I did not murder that man. The real criminal is whoever filmed me strangling him. ’” _____ 10. Finally, the announcement of a double jailhouse wedding more than a century ago got Lena Dunham thinking about what it means to love and to be a “good woman. ” The notice is part of our review of 165 years of Times wedding announcements. In a turnabout, it was the women who were incarcerated. They were serving short sentences, but the 1912 article made no mention of their infractions. The grooms, the creator of HBO’s “Girls” writes, were able to get beyond societal expectations of the brides’ behavior: “They didn’t need them to be good girls. They were their girls. ” Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742564057.2999165}