{"duration": 0.17796921730041504, "input_args": {"text": "'Donald J. Trump issued an unusual videotaped apology early Saturday after a 2005 recording surfaced that showed him speaking in extraordinarily vulgar terms about women, setting off an uproar in the Republican Party. “Anyone who knows me knows these words don’t reflect who I am,” he said. “I said it, I was wrong, and I apologize. ” The apology came as the presidential nominee faced extraordinary censure from Republican leaders after the tape was made public. The recording captures Mr. Trump speaking about pushing himself on women and boasting that he could get away with “anything” because of his celebrity. In the   recording, which was obtained by The Washington Post, Mr. Trump recounts to the television personality Billy Bush of “Access Hollywood” how he once pursued a married woman and “moved on her like a bitch, but I couldn’t get there,” expressing regret that they did not have sex. But he brags of a special status with women: Because he was “a star,” he says, he could “grab them by the pussy” whenever he wanted. “You can do anything,” Mr. Trump says. He also said he was compulsively drawn to kissing beautiful women “like a magnet”  —   “I don’t even wait”  —   and talked about plotting to seduce the married woman by taking her furniture shopping. Mr. Trump, who was 59 at the time he made the remarks, went on to disparage the woman, whom he did not name, saying, “I did try and fuck her. She was married,” and saying, “She’s now got the big phony tits and everything. ” On Friday night, Speaker Paul D. Ryan withdrew an invitation for Mr. Trump to appear alongside him in Wisconsin this weekend. Mr. Ryan described himself in a statement as “sickened” by Mr. Trump’s remarks. Hours before his video apology, Mr. Trump released a statement on Friday afternoon expressing regret “if anyone was offended” by his comments, but he tried to play down the tape as a snippet of “locker room banter. ” His running mate, Gov. Mike Pence of Indiana, brushed off the banter at a rally in Rossford, Ohio. “They’ll say, this time we got him,” Mr. Pence said. “This time we got another thing, another issue that’s come forward. Then they turn on the next television the next morning, and Donald Trump is still standing stronger than ever before and fighting for the American people. ” But Mr. Pence also telephoned Mr. Trump on Friday night and urged him to show humility, according to an adviser to the nominee who requested anonymity to reveal a private conversation. (Mr. Trump had already decided to apologize when Mr. Pence called, the adviser noted.) Senator Mitch McConnell, the majority leader, issued a statement late Friday night calling on Mr. Trump to express contrition  —   and possibly offering other Senate Republicans cover to disavow the nominee if he refused to apologize. “As the father of three daughters, I strongly believe that Trump needs to apologize directly to women and girls everywhere, and take full responsibility for the utter lack of respect for women shown in his comments on that tape,” Mr. McConnell said. While neither Mr. Ryan nor Mr. McConnell immediately withdrew formal support for Mr. Trump, Republican leaders in Washington held anguished discussions throughout the evening about how the party should proceed with a badly wounded and potentially toxic nominee. They cannot remove their nominee from the ticket, but some Republican lawmakers called on Mr. Trump to step down voluntarily, including Senator Mark S. Kirk of Illinois, who previously said he would not support Mr. Trump, and Representatives Mike Coffman of Colorado and Barbara Comstock of Virginia. Senator Mike Lee of Utah, who also has not endorsed Mr. Trump, recorded a live video on Facebook in which he asked the candidate, “with all due respect, to step aside. ” Mr. Trump, seeking to minimize the import of the disclosure despite the public rebuke by Mr. Ryan, announced late Friday evening that he would no longer travel to Wisconsin as planned and would send Mr. Pence in his stead. Mr. Trump said he would spend Saturday preparing for his second debate with Hillary Clinton, set to take place Sunday in St. Louis. Mr. Trump, who has repeatedly attacked and mocked Mrs. Clinton’s marriage in recent weeks, also sought to implicate Bill Clinton in his coarse conduct. “Bill Clinton has said far worse to me on the golf course  —   not even close,” Mr. Trump said in a statement. “I apologize if anyone was offended. ” And in his video apology later, he said: “I’ve said some foolish things. But there’s a big difference between the words and actions of other people. Bill Clinton has actually abused women, and Hillary has bullied, attacked, shamed and intimidated his victims. ” Mr. Trump has repeatedly threatened to attack Mrs. Clinton over her husband’s affairs and how she responded to them. The disclosure of the recording comes at the end of a punishing two weeks, during which Mr. Trump has faced intense backlash over his treatment of women and intensifying scrutiny of his personal finances and views on national security. Mrs. Clinton’s campaign condemned Mr. Trump forcefully for the comments captured on the recording. Her running mate, Senator Tim Kaine of Virginia, said in response to the remarks, “It makes me sick to my stomach. ” More Republicans joined in the denunciation, including Gov. Gary Herbert and Representative Jason Chaffetz, both of Utah, who had said this summer that they would vote for Mr. Trump, and on Friday retracted their support. “Donald Trump’s statements are beyond offensive  despicable,” Mr. Herbert wrote on Twitter. “While I cannot vote for Hillary Clinton, I will not vote for Trump. ” Mr. Trump had already been on the defensive on Friday after telling CNN that he still believed the exonerated defendants known as the Central Park Five were guilty of a 1989 rape of a female jogger despite DNA evidence to the contrary that later overturned their convictions. Earlier in the day, he also asserted, again without evidence, that the Obama administration was allowing illegal immigrants to enter the country in order to vote in November. Also in the last week, The New York Times reported that Mr. Trump had declared a $916 million loss on his 1995 income tax returns, a tax deduction so substantial it could have allowed him to legally avoid paying any federal income taxes for up to 18 years. For Republicans on the ballot this fall, the uproar over Mr. Trump’s past statements about women touched off an agonizing political cycle, marked by partial denunciations of Mr. Trump  —   and demands from Democrats that their denunciations go further. Republican candidates for the House and Senate, and for governorships across the country, chastised Mr. Trump sternly but stopped short of renouncing him as their choice for the presidency. One Republican senator seeking   Kelly Ayotte of New Hampshire, who was criticized this week when she called Mr. Trump a role model for children, said his comments were “totally inappropriate and offensive. ” Ms. Ayotte, one of the most prominent women in the party, was facing immense pressure Friday night from other Republicans to disavow Mr. Trump entirely, and was said to be considering it. In an illustration of the Democratic onslaught, her opponent, Gov. Maggie Hassan, called Mr. Trump’s comments inexcusable. “It is beyond comprehension how Senator Ayotte could continue to support this man for the highest office in the land, let alone call him a role model,” Ms. Hassan said. Senator John McCain of Arizona, who has endorsed Mr. Trump, said, “There are no excuses for Donald Trump’s offensive and demeaning comments. ” He was clearly worried about how they might affect his own   campaign, adding, “He alone bears the burden of his conduct and alone should suffer the consequences. ” Another Republican to turn his back on Mr. Trump on Friday was Jon M. Huntsman, the former governor of Utah, who just a week ago said he planned to vote for Mr. Trump. He told The Salt Lake Tribune that the nominee should withdraw from the race. “In a campaign cycle that has been nothing but a race to the bottom  —   at such a critical moment for our nation  —   and with so many who have tried to be respectful of a record primary vote, the time has come for Governor Pence to lead the ticket,” Mr. Huntsman told the newspaper. Mr. Trump’s behavior has at times startled and unnerved women in his life, from employees at his company to the contestants in his beauty pageants, The Times found after interviewing dozens of them for an article in May. They described unwanted romantic advances and unending commentary on the female form. Temple Taggart, Miss Utah in 1997, was uncomfortable with how forward Mr. Trump was with young contestants like her in his first year as the owner of Miss USA, a branch of the beauty pageant organization. As she recalls it, he introduced himself in an unusually intimate manner. “He kissed me directly on the lips. I thought, ‘Oh, my God. Gross.’ He was married to Marla Maples at the time,” she said. “I think there were a few other girls that he kissed on the mouth. I was like, “Wow, that’s inappropriate. ” Dawn Laguens, the executive vice president of the Planned Parenthood Action Fund, suggested Mr. Trump had discussed committing a violent crime in his 2005 conversation with Mr. Bush. “What Trump described in these tapes amounts to sexual assault,” said Ms. Laguens. “Trump’s behavior is disgusting and unacceptable in any context, and it is disqualifying for a man who is running for president of this country. ” The recording of Mr. Trump talking to Mr. Bush was made as they sat on a bus on the set of a soap opera where Mr. Trump was making a cameo appearance. The conversation was recorded after he had married Melania Trump, his third and current wife. At one point, the conversation in the video was interrupted when an actress arrived to take Mr. Trump and Mr. Bush to the set. Mr. Trump seemed excited. “You know I’m automatically attracted to beautiful  —   I just start kissing them,” Mr. Trump says. “It’s like a magnet. Just kiss. I don’t even wait. ” Ms. Trump was pregnant at the time that Mr. Trump’s remarks were recorded in   2005 their son, Barron, was born the next March.'"}, "time": 1742564612.4305873}