{"duration": 0.06603264808654785, "input_args": {"text": "'Murder Inc. in the White House; Obama’s Drones for Breakfast Club By Thomas C. Mountain   Thomas C. Mountain \\nElections come and go but when “The Don,” Barack Obama, meets with his inner circle of Capos every Tuesday morning its breakfast with drones as in the Murder Incorporated assassination program. \\nThink about it, every Tuesday morning in the White House this breakfast club decides who they are going to blow to smithereens that week, with fresh fruit and cappuccinos all around. \\nDoes Obama lie in bed on Monday nights deciding who to have assasinated the next day? You think I am joking? I went to the same school as Barack Obama, I know it torments the brother to blow away all those women and children at those village weddings but someone has to protect Pax Americana . . . right? \\nHear it straight from the mouth of Barack in 2012. “Turns out I’m really good at killing people. Didn’t know that was a strong suit of mine.” . \\nThe criminal absurdity of the right to kill at will without consequence when you head the most powerful military on the planet as the commander in chief seems to be completely lost on the American sheeple. \\nAs a star basketball player in high school Barry O’Bomber, as he was known, left a life of being the only black kid in an elite school of 3,000 to being amongst black Americans for the first time in his life when he left Hawaii for college on “the continent,” as it is known in the islands. \\nObama spent most of his childhood completely isolated from blacks, had reached early adulthood before having any black friends and then made his career out of being black. Could this explain his sociopathic behavior? \\nI suspect “Barry,” as his white grandmother renamed him, must know about Murder Inc., the national crime syndicate headed by Lucky Luciano in the 1930s who met regularly to decide whom to kill. \\nMr. Luciano ended up serving life in a federal prison only to be released to set up the Italian Mafia nationally after WW2 as a part of the CIA’s forerunners plan for murder and mayhem against the Italian Communist Party to prevent them from winning the postwar Italian elections. \\nImpunity to kill, it runs in American history and Barack Obama finds himself surprisingly good at it. Breakfast with drones, approving the hit list alongside expressos and bagels, Tuesday morning is still Murder Inc. in the Obama White House. \\nThomas C. Mountain is an independent journalist in Eritrea, living and reporting from the country since 2006. His speeches, interviews and articles can be found on Facebook at thomascmountain and he can best be reached at thomascmountain at g mail dot com. This entry was posted in Commentary . Bookmark the permalink .'"}, "time": 1742628296.1428337}