{"duration": 0.044727325439453125, "input_args": {"text": "'Nat Geo’s iconic ‘Afghan Girl’ arrested for false documents in Pakistan Published time: 26 Oct, 2016 19:10 Get short URL © Tim Chong / Reuters The woman behind National Geographic photographer Steve McCurry’s famous ‘Afghan Girl’ portrait has been arrested in Peshawar, Pakistan for possessing falsified documents. \\nPakistan’s Federal Investigation Agency arrested Sharbat Gula at her home on Wednesday for having a forged Computerised National Identity Card. \\nGula’s ID cards for both Pakistan and Afghanistan were taken from her. She faces up to 14 years in prison if convicted. \\nThe arrests coincides with a Pakistani crackdown on undocumented immigrants. URGENT: Britain stops taking child #refugees from Calais ‘Jungle’ at request of French police https://t.co/sI3LYeEZTg pic.twitter.com/Lec9tVMGEu — RT (@RT_com) October 24, 2016 \\nGula swept to fame after her image appeared on a 1985 cover of National Geographic. It was taken by McCurry at the Nasir Bagh refugee camp near Peshawar in 1984 when she was about 12-years-old. \\nGula’s striking green eyes has seen her being dubbed the Afghan Mona Lisa, and her photograph is ranked in the top 5 of National Geographic’s most iconic images. Steve McCurry\\'s famed Afghan Girl on the cover of @NatGeo \\'s 1984 magazine is on a judicial remand for a fake Pak-ID with the FIA #Peshawar . pic.twitter.com/3szkw1KesG — Iftikhar Firdous (@IftikharFirdous) October 26, 2016 \\nGula’s identity was a mystery for 18 years, until McCurry finally tracked her down in 2002, after returning to the region more than 10 times hoping to find her. \\nGula’s parents were killed in Afghanistan during the Soviet-Afghan war. \\nIn 1992, Gula left Pakistan and returned to Afghanistan where she married a baker and had three children in a village in Eastern Afghanistan. National Geographic was able to verify Gula was the famous girl by comparing her moles and scar, as well as using iris scanning technology. \\n\"Her eyes are as haunting now as they were then,\" McCurry said at the time. \"She remembered me, primarily because she had never been photographed before I made the image of her in 1984, or since then.\" Mentally ill convict to be executed after court rules schizophrenia \\'not a mental disorder\\' in #Pakistan https://t.co/UZZSogP6QS pic.twitter.com/UqfLREcAKM — RT (@RT_com) October 22, 2016 \\nLast year, Pakistani media reported the National Database and Registration Authority had cancelled the cards of Gula and two men said to be her sons because they had been illegally issued. Three officials are wanted for issuing her card and have been missing since it was first reported. \\nGula applied for an identity card in 2014, using the name Sharbat Bibi. It isn’t clear why Gula returned to Pakistan after living in Afghanistan. \\nPakistan’s investigation into fake ID cards has found more than 60,000 cases of non-nationals holding cards. The country is home to 2.5 million Afghan refugees.'"}, "time": 1742563438.2360275}