{"duration": 1.4027574062347412, "input_args": {"text": "\"Obama's Weighs Options for His Final Stab at Israel In his twilight months in office, Obama seeks to undermine America’s closest ally. November 4, 2016 Ari Lieberman \\nIsraelis and the pro-Israel community at large will breathe a collective sigh of relief when Obama leaves office. During Obama’s tenure, relations with Israel were caustic at best. Barely five months after taking office, he publicly launched a scathing attack against Israel – where he perversely insinuated a moral equivalence between Israeli and Palestinian actions – and did so in one of the most virulently anti-Semitic countries on the planet. He later skipped over Israel despite the fact that Israel was a mere 20-minute plane ride away. That was Obama’s opening salvo against America’s closest ally. It was only downhill from there. \\nObama utilized high-level administration sources to leak negative information about Israel to sympathetic members of the press. In one such instance, an administration official –probably Ben Rhodes – referred to Prime Minister Benjamin Netanyahu as a “ chicken-Sh*t .” In another instance, Obama voiced concurrence with French president, Nicholas Sarkozy, when Sarkozy characterized Netanyahu as a “ liar .” \\nOften, the Obama administration would subject Israeli dignitaries to humiliating treatment during official state visits. Israel’s defense minister, Moshe Yaalon, was shamefully transformed into a persona non grata. In the most notorious incident, Obama left Netanyahu out in the cold while having dinner with Michelle and his daughters. One commentator dryly noted that Obama treated Netanyahu as though he was the president of Equatorial Guinea. \\nUltimately, Obama crossed the line and received significant pushback from Democratic lawmakers and donors. Obama got the message and toned down the rhetoric but his deep-seeded animus against Israel never dissipated and relations with Israel’s prime minister remained toxic. \\nTensions surfaced again during Israel’s counter insurgency campaign against the Gaza-based terror group Hamas. Obama held up a shipment of Hellfire missiles to Israel and then tried to strong-arm Israel into accepting a suicidal ceasefire agreement brokered by Turkey and Qatar, two despotic nations that support Hamas and gave aid and comfort to Islamic State terrorists. \\nObama saw Netanyahu’s opposition to the JCPOA, the so-called Iran deal, as a personal attack and allowed his petulant nature to further sour relations. The so-called “settlements” were another point of contention. Obama disregarded a letter of assurance to Israel provided by the Bush administration specifying that “In light of new realities on the ground, including already existing major Israeli population[s] centers, it is unrealistic to expect that the outcome of final status negotiations will be a full and complete return to the armistice lines of 1949…” \\nBush gave implicit recognition to existing settlement blocs and the right of Israel to build within those blocs. It is also important to note that no new settlement was created during Obama’s term of office and Netanyahu had even agreed to an unprecedented 10-month moratorium on construction within the disputed territories. But nothing was ever enough for Obama who never wasted an opportunity to excoriate Israel at every turn. His parting shot was at the United Nations General Assembly. During a recent address to that contemptible body, he explicitly singled out Israel for criticism but heaped praise on the xenophobic nation of Indonesia. Obama’s moral compass had gone completely awry. \\nDespite the fact that Obama is in his twilight months, he can still inflict immeasurable harm on Israel. According to a report featured in the Wall Street Journal , Obama is contemplating several options, each with significant negative implications for Israel. The report noted that he will only implement those options during the transitional period after November 8, so as not to harm Clinton’s presidential prospects. \\nHe may seek to remove tax exempt status for organizations supportive of Israeli communities living in East Jerusalem, Judea and Samaria. Perhaps more ominously, he may seek to impose dictates on Israel utilizing the U.N. Security Council. \\nIn one such scenario, Obama may seek to pass a resolution condemning settlement construction and declaring Israeli communities situated in Judea and Samaria to be illegal. Alternatively, the administration may seek formal recognition of the “State of Palestine” even though such a state has no formal boundaries and rejects Israel’s existence as a Jewish state. Lastly, he is said to be considering the possibility of setting up the parameters of a future peace agreement that would entail significant Israeli territorial concessions. \\nThe United States does not have to actively support any UNSC resolution to see the successful passage of anti-Israeli measures. It merely has to fail to exercise its veto powers. France, facing significant problems of its own in connection with its growing radicalized Muslim population, has historically been the fiercest advocate for the Palestinian Arabs. It is likely that the administration would seek to have the French submit a draft resolution and the United States would simply abstain while the permanent and non-permanent members voted, thus guaranteeing passage. \\nIsrael has few friends on the Security Council and American collusion with a body that could arguably be considered today’s greatest purveyors of anti-Semitism, would be an act of extreme betrayal. It would also represent bad policy and would significantly complicate efforts to broker a future peace agreement. \\nBut Israel is not without recourse. There is strong bipartisan support for Israel in Congress and lawmakers from both sides of the political divide have already expressed to the White House their strong opposition to U.N. involvement. \\nSome, like the Jerusalem Post’s Caroline Glick, have suggested that the Israelis can reach out to the Russians with carrots in an effort to counter Obama’s nefarious plans but this option seems to be a stretch. Moscow has always been in the pockets of the Muslim bloc and its recent vote at UNESCO in support of a resolution denying the Jewish nexus to Jerusalem, serves to reinforce this view. Moreover, even if Russia can be persuaded, relying on Putin for favors is akin to borrowing money from the Mafia and would come with a steep price. \\nIt is ironic that with the multitude of problems currently facing the administration – spiraling healthcare costs, racial discord, cyber breaches, Russia’s seizure of Crimea and eastern Ukraine, ISIS, the meltdown in the Arab world, Iranian terrorism, China’s expansion into the South and East China Seas, the migrant crisis, immigration reform – Obama would choose to focus his negative energies on harming the Mideast’s only democracy and America’s staunchest ally. That fact, in it of itself, speaks volumes about the man.\""}, "time": 1742563512.7014573}