{"duration": 0.07279062271118164, "input_args": {"text": "'Monday on his nationally syndicated radio show, conservative talker Rush Limbaugh addressed President Donald Trump’s tweets over the weekend accusing the Obama administration of wiretapping Trump Tower before the presidential election.  Partial transcript as follows: RUSH LIMBAUGH, HOST: Let me ask you a question. Is it unreasonable, is it unreasonable that President Trump would suspect he’s being spied on? It’s not unreasonable, is it? Telephone calls that he’s made to presidents of other countries have been leaked, transcripts have been leaked  …     So a lot to try to explain here today, and it all makes sense when it is explained in not just necessarily a timeline format, but just when you provide and when you learn the information of things that are going on, all of this makes sense. It all seems reasonable. It all seems like it could be happening. We know, for example, that there has been an effort on the part of what I’ve been calling the deep state, this is embedded Obamaites that are in the bureaucracy that have been trying to sabotage and undermine the Trump administration ever since he was elected and through the transition into the inauguration and up to now. I mean, this is undeniable. These various leaks, many of them are criminal. How are people getting this information? How are people acquiring the information that they are disseminating? I have here, ladies and gentlemen, I went and looked and I’ve got a copy here of the actual New York Times front page on January 20th of this year. And the primary story, the lead story, “Trump Arrives, Set to Assume Power. ” But right next to it is this headline: “Wiretapped Data Used in Inquiry of Trump Aides. ” Well, the New York Times has a story back in January admitting that wiretapped data has been used in an inquiry of Trump aides. And this article goes on to say “intelligence reports based on some of the wiretapped communications had been provided to the White House. ” So it isn’t unreasonable at all for Donald Trump to suspect that he’s being tapped, that his aides are being tapped, at Trump Tower. We know that there were two FISA warrants that were issued starting last summer and then another one in October, and I want to walk you through those as the program unfolds today. It’s kind of unsettling. I mean, you don’t want to think things like this happen, but you know that they do, and so you have to face it. And we are in a polarized circumstance in our country. We are really divided, and the gap is wide. The partisanship is profound and it’s worsening here, to the point that there isn’t any common ground and crossing the aisle and shaking hands and cooperating. This is a war that’s going to result in somebody winning and somebody losing, within a political context, of course. And what’s new about this one is we have a Republican president for the first time in my lifetime fighting back. Well, I can’t exclude Ronald Reagan from that. And I actually think a part of this  —   and I can’t substantiate this, ’cause it goes to motive  —   but I think part of what President Trump is doing by tweeting out on Saturday that he believes the Obama administration’s wiretapping him, I think he’s not just tweeting to the American public and tweeting to the news media. I think Trump confounds these people because he’s always a step or two ahead. Trump plays the long game. And I think in addition to whatever else these tweets are intended to accomplish, it’s also a direct line to the Democrat Party and Obama and members of the Obama administration that Trump is signaling, “You don’t face the usual feckless bunch of opponents who never fight you back. You’ve got me here, and if you’re gonna start lying about me, if you’re gonna keep lying about me, I’m not gonna sit here and take it. ” Now, why might Trump think that he’s been bugged? Why might he believe that Trump Tower has been bugged? Well, folks, from the moment that Donald Trump won the election back in November, there have been leaks, illegal leaks that were no question hopefully damaging. There has been a sabotage effort to undermine Trump and his administration since the election. We’ve talked about it ever since it began. I’ve had various names for it, the deep state, Friday called it silent coup or whatever, but there isn’t any doubt in my mind that this is going on. The media is complicit in it, that there is an effort to undermine the Trump administration. We have these     protests that come up out of nowhere, and they appear instantly. So I think it’s totally reasonable to believe that something like this could be happening. It would be unreasonable to think that this is crazy, unreasonable to think that this is absurd, unreasonable to think that this is nothing more than a big batch of conspiracy theories stitched together for whatever purpose. (  RCP Video) Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742564157.987073}