{"duration": 0.059309959411621094, "input_args": {"text": "'A former United States Marine who traveled to New Jersey with a gun he legally owned  —   but which was not registered in New Jersey  —   is facing three years in prison for firearm law violations. [The three years is the minimum sentence that former Marine Sergeant Hisashi Pompey has to serve before he can even be eligible for parole under New Jersey’s strict gun control laws.  ABC 7 reports that Pompey did “three tours of duty in Iraq and Afghanistan for which he received medals for bravery. ” He was a military police sergeant. Six years ago Pompey visited New Jersey and brought his legally owned handgun with him from Virginia. During the course of the night, one of Pompey’s friends got involved in a fight, retrieved the gun, and “carried it into a confrontation with police. ” Police arrested Pompey’s friend then arrested Pompey, as well, for having brought an unregistered handgun into the state. He is now asking Governor Chris Christie (R) to grant him clemency. Pompey said, “Only help I am asking for is from the governor, that’s the only one, everyone from judges to lawyers say the only person who will help me now is the governor. ” Pompey has a wife and children at home, all of whom he will have to leave for a minimum of three years if Christie does not act. In April 2015, Christie pardoned Pennsylvania resident Shaneen Allen, who was arrested in 2013 for carrying a legally owned handgun in her car. Allen even had a Pennsylvania permit to carry the gun, but New Jersey does not recognize Pennsylvania’s permit. On December 23, 2015, Christie pardoned U. S. Marine Joshua Velez, a Massachusetts concealed carry permit holder who was arrested over a year earlier for bringing his 9mm handgun into the state of New Jersey. The pardon said: WHEREAS, Joshua Velez has made a written application to the Governor for a pardon for the aforesaid offenses, and the State Parole Board, upon request of the Governor, in accordance with the law, has made an investigation of the facts and circumstances surrounding said application for a Pardon, NOW, THEREFORE, I, CHRIS CHRISTIE, Governor the State of New Jersey, by virtue of the authority conferred upon me by the Constitution of the State of New Jersey and the statutes of this State, do hereby grant Joshua Velez a full and free Pardon for all criminal charges arising from the arrest occurring September 6, 2015, to include the aforesaid crimes, and this Order is applicable solely to said criminal charges and to no other. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562147.4482298}