{"duration": 0.21394729614257812, "input_args": {"text": "'By wmw_admin on October 28, 2016 Alana Goodman — Daily Mail.com Oct 27, 2016 \\nBill Clinton is a sex-addicted ‘monster’ who mocked Hillary Clinton by calling her ‘The Warden’ in front of friends and privately boasted about his high notch count, according to his long-time mistress and childhood friend Dolly Kyle. Dolly Kyle. Click to enlarge \\nKyle, now 68, says she had a decades-long affair with the former president before and during his marriage and had a front-row seat to Bill’s salacious double-life in the 1970s and ’80s. \\nTheir on-again, off-again relationship ended abruptly in the 1990s, after Bill Clinton allegedly threatened to ‘destroy’ Kyle if she spoke to the media about their relationship. \\nKyle’s decades of observations, shared in an interview with the DailyMail.com as well as in her 2016 book The Other Woman, provide a unique perspective on the Clintons’ marriage and the couple’s treatment of the women who have accused the former president of infidelity or sexual assault over the years. \\nKyle, an Arkansas native who has since befriended several of Bill Clinton’s sexual assault accusers, said she was determined to come forward with her story after hearing Hillary Clinton say on the campaign trail that women who have been sexually assaulted have the ‘right to be believed’. \\n‘When [Hillary Clinton] said women who claim they are raped or sexually assaulted should be believed, we should support them, I thought “You lying dog hypocrite”,’ said Kyle. \\nShe said the Clintons’ attacks on her reputation – and alleged attacks on other women who had relationships with or were assaulted by Bill Clinton – show that Hillary Clinton is not a supporter of women or victims of sexual violence. \\nKyle said Bill Clinton threatened her over the phone in the early 1990s after she alerted him that a reporter had been asking her questions about their relationship. \\n‘When I warned him about this story, which I had no intention of cooperating with, his threat to me was, “If you cooperate with the media, we will destroy you”,’ said Kyle. ‘Bam. I slammed the phone down. It rang immediately. Kept ringing, I didn’t answer it again.’ \\nKyle first met Clinton at a country club in Hot Springs, Arkansas, when she was 11 and he was just shy of his 13th birthday. She described it as a ‘thunderbolt’ of immediate attraction even then. \\nThe two became good friends and dated casually throughout high school, and later began a sexual affair in 1974 after Kyle and her first husband divorced. \\nTheir relationship spanned three decades, continuing through Bill Clinton’s marriage to Hillary and Kyle’s remarriage, and culminating in a dramatic confrontation at the lovers’ 35th high school reunion. Hillary Clinton admires Christine Aguilera’s breasts. Clinton is rumoured to be an active bisexual. Click to enlarge \\nDuring this time, Kyle said Clinton often indicated that he was unhappy in his marriage – calling Hillary Clinton ‘The Warden’, admitting that he was a sex addict, and complaining to Kyle that his sex life was ‘over’ after he moved in with Hillary at Yale. \\nDuring one secret rendezvous in 1979, Kyle said then-Governor Clinton confided to her that he was desperate to have a baby for political reasons. \\nKyle initially thought Bill wanted to have a baby with her, until he clarified that he wanted to have one with Hillary – hinting that he was concerned about political rumors that Hillary was a lesbian. \\n‘I said, “Why do you want to have a baby? You don’t even have time, you’re so busy”,’ said Kyle. ‘He said [Hillary and I] have to have a baby so that we will look like a normal couple, and we need to take attention away from The Warden’s “lifestyle”.’ \\n‘Now, he did not say Hillary is a lesbian,’ she added. ‘Billy didn’t have to spell out what that meant… Everybody in Little Rock knew the same rumors about Hillary being a lesbian as they did about Billy being a lech.’ \\nOne night in 1972 when Bill was visiting with Kyle in Arkansas, he told her he had moved in with a girl named Hillary and sadly added that he thought this would be the end of his sex life. \\n`It was in 1972, before Billy and I were having our adult relationship, when he had moved in with Hillary,’ said Kyle. ‘He said, “I think my sex life is over”.’ \\nKyle said she first met Hillary Clinton two years later, when Bill brought his future wife to Hot Springs for his unsuccessful congressional race, and asked Kyle – who he was also dating at the time – to pick them up at the airport. \\nKyle said she was ‘shocked’ by Hillary’s unkempt appearance, poor hygiene and matronly clothes, and didn’t believe it was the same girl Bill had moved in with. \\n‘I picked Billy up at the airport and he had this dowdy-looking middle-aged woman with him…this woman was Hillary,’ she said. ‘Hillary, I thought was a Hillary impersonator. Because she looked so bad and she smelled so bad I just didn’t believe this was Hillary. \\n‘Seriously, I thought this was some kind of a joke Billy was playing on me.’ \\nHillary’s eyes, glared at her from behind ‘coke-bottle-thick lenses with an air of real hostility. Her thick eyebrows melded together stretching across her forehead. \\nFinally the introduction: ‘Dolly, this is Hillary. Hillary, Dolly.’ \\n‘I was stunned,’ Kyle recalled, thinking it was ‘some kind of a sick joke’– a woman in a hideous disguise. \\nKyle extended her hand but Hillary only glared and nodded. \\n‘I couldn’t imagine why Billy would haul such a person in the plane with him in public. She was wearing a misshapen, brown, dress-like thing that must have been intended to hide her lumpy body. The garment was long, but stopped too soon to hide her fat ankles and her thick calves covered with black hair,’ Kyle said. \\nBut was Hillary’s smell that Kyle says she remembers most. \\n‘In that moment I noticed that the woman emitted an overpowering odor of perspiration and greasy hair. I hoped that I wouldn’t gag when she got in my car,’ she said. ‘The sandal-shod woman with lank, smelly hair stood off to the side and glared at everyone.` \\n`I vowed to myself not to drive off without the other woman, no matter how bad she smelled.’ \\nAfter the meeting, Kyle said Hillary Clinton sent her father and her brother to Arkansas to ostensibly help with Bill’s campaign but also to keep tabs on his womanizing. \\nAt the time, Kyle said Bill was also dating a University of Arkansas co-ed named Marla Crider – and Hillary Clinton allegedly threw a fit when she found evidence of the fling. \\n‘Hillary came swooping in from Washington to Fayetteville, went through Billy’s things, found little cards and notes, you know, the cutesy kind of things you do when you’re dating someone,’ said Kyle. ‘She shredded them. She shredded those documents…these were notes to him from Marla, these were things from Marla.’ \\nKyle said Hillary also ‘started calling [Marla] in the middle of the night, threatening her’. \\nShe speculated that part of the reason Hillary was so enraged was that Bill’s affair with Marla Crider undermined the public story about the Clintons’ early romance. \\n‘They had this story about their romance at Yale law school. Billy even repeated it at the Democratic National Convention. Well what if people knew about Dolly Kyle and Gennifer Flowers and Marla Crider? It kind of ruins Hillary’s story,’ said Kyle. \\nAccording to Kyle, Bill Clinton often used a derogatory nickname for Hillary when he was talking to his mistress or the security guards at the governor’s mansion. \\n‘After the day Billy introduced me to Hillary…he never used her name again. He always called her ‘The Warden,’ said Kyle. ‘She was the person who was trying to keep control of him who was in charge of what he was doing.’ \\nKyle said this nickname fit with Hillary’s reputation in Arkansas, where she was often portrayed as a coarse northerner who disdained the traditional role of an Arkansas first lady. \\nAccording to Kyle, there were constant stories about Hillary’s alleged temper. On the night Bill Clinton lost his congressional race in 1974, Hillary was allegedly overheard lashing out at a Jewish campaign staffer with an anti-Semitic slur. \\n‘Apparently that night when Billy was losing, she went on one of her tirades to a guy named Paul,’ said Kyle. ‘People in the other room heard her call him an “f***ing Jew bastard”.’ \\nIn another incident from Bill Clinton’s term as governor, Hillary Clinton was tasked with hosting an annual Easter egg hunt at the governor’s mansion for special needs children. But, according to Kyle, Hillary allegedly became irritated by the slow pace of the event. Bill and Hillary Clinton at Yale in 1973 \\n‘Some of [the kids] were physically impaired some of them were mentally impaired. But [the governor’s staff] hid the eggs in plain sight and made it easier for these kids to find these eggs,’ said Kyle, whose close friend was involved in organizing the event. \\n‘So during this hunt it was getting warm in Arkansas. Well, Hillary was getting tired of it, and the kids were moving slowly, so she goes stomping onto the veranda. She said ‘When are they gonna get those f-ing retards out of here?’ said Kyle. ‘Thankfully, and blessedly, the children were oblivious to it. Their parents were appalled.’ \\nKyle, who says she suffered from sex addiction for many years after she was raped as a teenager, recalled one candid conversation she had with Bill Clinton after she entered therapy. She said Clinton told her he was also a sex addict. \\n‘I talked to Billy about that, and I went through the 25 questions we use to ask “Am I a sex addict?” It’s a self-diagnosed thing, like [Alcoholics Anonymous],’ said Kyle. ‘Billy and I went through the questions, and he said, “Oh my god. I’m a sex addict”.’ \\n‘I don’t know if Hillary had the cognitive awareness that he was a sex addict. This is a problem that can be dealt with,’ Kyle added. \\nAt some point in the evening, I felt a hand on my arm and it was Billy. He says “How are you?” Condescending, patronizing, despicable. “How are you?” And I just turned around, and I just said “You are such an anatomical part, I can’t believe you’d bother to ask”,’ said Kyle. \\nShe said after a brief, heated exchange – during which a Secret Service agent tried to separate them – she finally agreed to sit down and talk to Bill Clinton in a quiet corner of the event. \\nShe told Clinton that she had no plans to talk to the press, but was going to put out a novel that alluded to their affair. \\nShe also told Clinton about a legal aid non-profit she had started in Dallas. The president told her to ‘come to Washington’, and allegedly promised to turn the organization into a project of the Department of Housing and Urban Development. Kyle said she declined the offer. \\nClinton later denied having a sexual relationship with Kyle during a deposition for the Paula Jones sexual assault case \\nKyle said she was shocked to hear this, calling it ‘lie after lie’. She said just a short while before Bill’s testimony, his attorneys had tried to prevent her from testifying in the Paula Jones case by arguing that the two of them had a consensual sexual relationship and her testimony would not be relevant. \\n‘What he did was perjury,’ said Kyle, who ended up testifying during the Jones case about Clinton’s alleged sex addiction. \\nAlthough Kyle said she was appalled to hear the sexual assault allegations against Clinton, she said she absolutely believed them – even though Clinton was never violent to her during their relationship. \\n‘Knowing he was a sex addict, it was easy for me to believe that. Easy for me intellectually to believe it. Very difficult emotionally,’ she said. ‘And that’s when I started realizing, the Billy Clinton I knew was not this monster he became.’ \\nKyle claimed she sees a double standard in how the media covers sexual assault allegations against Donald Trump and Bill Clinton. \\n‘I’m sorry, I’m not saying [Trump] didn’t leer at some girl. I’m not saying he didn’t pat one on the fanny. I don’t know. I don’t know what all of those charges are,’ said Kyle. ‘But the media is focusing on that every single day while Billy Clinton raped a woman, and sexually assaulted god knows how many women.’ \\nShe said that since publishing her book earlier this year, she has been contacted by multiple women who have also had sexual run-ins with Clinton but do not want to go public. \\n‘When I say, please come out and talk about this, they’re afraid,’ she said. ‘Because they know that the mainstream media if they get on this story, is just going to trash them. \\n‘Some of them say, “I was 17 at the time, I was 18 or 19 years old”, or, “I haven’t told my husband about this”, or, “my children would be appalled”, or, “my grandchildren would be embarrassed”. So they don’t say anything.’'"}, "time": 1742564394.1133313}