{"duration": 0.04187440872192383, "input_args": {"text": "'Posted on September 3, 2015 by DCG | 25 Comments \\nThese kids still understand basic biology. \\nDaily Mail : Almost 200 high school students in Missouri walked out of their classes to protest one a transgender student in senior year being allowed in the girls’ bathroom. \\nMembers of the Hillsboro High School in Hillsboro, Missouri, ditched two hours of lessons to object to Lila Perry, a 17-year-old senior, being granted access to female bathrooms. Perry, who started identifying as transgender earlier this year, was using the female facilities to change for gym classes, which upset many other girls at the school. \\nThey objected that Perry, who has not had any gender reassignment therapy, is still biologically male , Fox News reported. \\nPerry, who wears a wig, makeup and skirts to school, used to use a unisex facilities meant for staff – but decided for this academic year she wanted to be allowed in the girls’ bathrooms . \\nShe said: ‘I’m not going to expose myself. I’m not a pervert. I’m a transgender woman. I’m a girl. I’m just in there to change, do my business, and… if they have any questions about being transgender, they are more than welcome to talk to me, and I’ll be happy to explain it.’ \\nOne student, Sophie Beel, told local station Fox 2 St Louis : ‘I find it offensive because Lila has not went through any procedure to become female, putting on a dress and putting on a wig is not transgender to me’. \\nThe unrest comes as transgender issues are taking a higher profile on the national stage, partly thanks to the highly public transition of Caitlyn Jenner from her former identity as Bruce. \\nAccording to the St Louis Post-Dispatch , the protest lasted for two hours before school officials told students to go back inside. \\nDuring the demonstration, Perry was locked in a staff member’s office because there were fears for her safety. \\nThe paper reported that some of the students protesting supported Perry’s right to use the bathroom she wants to, though most were in opposition. Tammy Sorden, a mother of a Hillsboro High student, said: ‘The girls have rights, and they shouldn’t have to share a bathroom with a boy.’ She said she objected to Perry being given what she asks for ‘while the girls just have to suck it up’. \\nThe School Board also organized a meeting to deal with the situation, which attracted a large crowd of parents last Thursday, where school officials pointed out that denying fair access to a transgender student could bring reprisals from the federal government. \\nPerry has since dropped gym class due to the outcry, but still intends to use female bathrooms. \\nDCG'"}, "time": 1742563502.8375087}