{"duration": 0.0166015625, "input_args": {"text": "'This post was originally published on this site \\nDOHA (Qatar), November 16. /TASS/. Real steps should be taken to restore Russia’s anti-doping system, President of the Russian Olympic Committee (ROC) Alexander Zhukov said at a session of the General Assembly of the Association of National Olympic Committees (ANOC) on Wednesday. \\n“Our NOC shares the concern over the situation in the anti-doping system,” Zhukov said. “Let us take practical measures to change the situation for the better and restore the atmosphere of trust and openness.” \\nRussia’s Investigative Committee has questioned over 50 persons in the anti-doping probe, Zhukov said. \\n“Speaking about measures taken in Russia to fight doping, I would like to stress that our steps for restoring the anti-doping system in Russia are consistent and being implemented at all the levels with the full support of the Russian government,” Zhukov told the ANOC General Assembly. \\n“Recently, a federal law was adopted to stipulate punishment for encouraging doping. All the people who were involved in doping scandals were disqualified and dismissed. During the investigation of criminal cases related to the breach of anti-doping rules, prosecutors questioned over 50 athletes, representatives of federations and employees of the Sports Ministry,” he said. \\n“Already now, a whole number of employees have been dismissed from the Sports Ministry and those organizations that are controlled by it,” Zhukov said. \\nRussia’s Olympic chief thanked the international sports community for the decision to admit the Russian national team to the 2016 Rio Olympics. \\n“The Olympiad in Rio was a great success and we overcame all the obstacles and traversed a difficult road,” Zhukov said. \\n“It was not easy for us, especially considering the situation with the possible ban on Russians. I want to express gratitude to the IOC, colleagues and international sports federations for the decision to allow our clean athletes to participate in the Rio Olympics,” Zhukov said. \\nThe ANOC General Assembly is holding its session in Doha on November 15-16. \\n{{item.group_date}} '"}, "time": 1742628392.8165398}