{"duration": 0.07852888107299805, "input_args": {"text": "\"Dienstag, 8. November 2016 Ratgeber: Alles, was Sie jetzt über die US-Wahl wissen müssen Für die USA ist es ein Schicksalstag: Heute entscheidet sich, ob Donald Trump oder Hillary Clinton in das Weiße Haus einziehen wird. Doch wie genau funktioniert eigentlich die Präsidentschaftswahl in den USA? Hier erfahren Sie alles, was Sie jetzt wissen müssen: Warum wird in den USA an einem Dienstag gewählt? Die Amerikaner wählen nicht dienstags, sondern - wie die meisten anderen Länder auch - am Sonntag. Durch die Zeitverschiebung von rund zwei Tagen zwischen den USA (General Motor Time) und Deutschland (Mittelhochdeutsche Winterzeit) ist es nur für uns Dienstag. Wann genau erfahre ich hier in Deutschland, wer die US-Wahl gewonnen hat? Voraussichtlich im Herbst 2028. Spätestens dann sollte der auf die Wahl folgende Bürgerkrieg ausgefochten und einer der beiden Kandidaten siegreich aus dem Gemetzel hervorgegangen sein. Ich habe keine Wahlbenachrichtigung erhalten. Was ist nun zu tun? Laut Ihrer IP-Adresse und Ihren Facebook-Posts leben Sie nicht in den USA. Die US-Wahlen sind - wie der Name schon sagt - US-Bürgern vorbehalten. Ach so! Wer darf denn dann wählen? Wählen darf in den USA jeder Mensch, der folgende Voraussetzungen erfüllt: - Über 18 Jahre alt: So hat jeder drei Jahre Zeit, um das Wahlsystem kennenzulernen, bevor er seine Frustration ab seinem 21. Geburtstag mit Alkohol betäuben darf. - US-Bürger: Bürger der USA wird man entweder durch Geburt oder durch Ritterschlag der Königin von Amerika. - Patriot: Wer kein Patriot ist, darf nicht wählen. Um als Patriot anerkannt zu werden, muss man mindestens einmal nachweislich Sex mit der US-amerikanischen Flagge gehabt haben. - Jemand anderes als Sie: Wer Sie ist, darf nicht wählen. Also vergessen Sie's einfach. Achtung: Jeder US-Bürger hat nur EINE Stimme. Das heißt, dass Bürger, die schon bei einer der letzten Präsidentschaftswahlen abgestimmt haben, automatisch disqualifiziert sind. Wird der US-Präsident direkt gewählt? Nein, der US-Präsident wird nicht direkt vom Volk gewählt. Das Volk wählt lediglich sogenannte Wahlmänner, die wiederum innerhalb von 14 Tagen einen ihrer Freunde damit beauftragen müssen, einen geeigneten Nachbarn auszusuchen, dessen Tante väterlicherseits dann auf dem großen Tantenkonvent in Washington DC gemeinsam mit den anderen entsandten Tanten den Präsidenten bestimmt. Nachteil für den Wähler: Dadurch kann es passieren, dass jemand Präsident wird, den man selbst gar nicht gewählt hat. Was passiert bei Gleichstand? Bei Gleichstand der Stimmen dürfen beide Endkandidaten zusammen US-Präsident sein. In der Geschichte der USA kam das lediglich einmal vor (1945-53: Truman/Capote). Was hilft gegen Schluckauf? Es gibt diverse Hausmittel. So soll es zum Beispiel helfen, den/die Betroffene/n zu erschre… Moment mal! Bitte nur Fragen zur US-Wahl! Menno! Na gut: Welche Bundesstaaten sind am 8. November entscheidend? Spannend wird es insbesondere in den sogenannten Swing-States. Sie heißen so, weil sie wie das Pendel einer Uhr unkontrolliert über dem Gebiet der USA herumschwingen. Da die Wähler, denen es ohnehin von früh bis spät speiübel ist, aufgrund der heftigen Schwingbewegung ihres Staates große Schwierigkeiten haben, ihr Kreuz bei dem Kandidaten zu machen, den sie wählen wollen, gelten sie als unkalkulierbar. Folgende Staaten gelten als Swing-States: East Virginia, Montezuma, Haribo, Ohiowa, Old Baconshire, Guantanamo und New Vada Es war so viel von möglichem Wahlbetrug die Rede – ist das wahrscheinlich? Wahlbetrug im großen Stil im Sinne einer mehrfachen oder unberechtigten Stimmabgabe ist nach Meinung aller Experten sehr unwahrscheinlich. Echte Profis manipulieren die Wahl, indem BUH! Ist der Schluckauf weg?... äh, weiter im Text: indem sie der Bevölkerung etwa versprechen, ihr Land wieder großartig zu machen, ohne näher darauf einzugehen, wie das gelingen soll. Welche Auswirkungen hat der Ausgang der Wahl auf Deutschland? Egal, wer die Wahl gewinnt: Als Deutscher dürfen Sie sich grundsätzlich überlegen fühlen und die Wähler in den USA für ihre Dummheit verachten. Ob der Atomkrieg mit Russland am Ende aus geostrategischen Hardliner-Positionen entsteht (Clinton) oder das Ende einer Twitterfehde mit Wladimir Putin ist (Trump), spielt ohnehin keine große Rolle. ssi, dan, pfg, fed\""}, "time": 1742563645.9525135}