{"duration": 0.125213623046875, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name => \\nIntroduction \\nCastigating the US electorate as accomplices and facilitators of wars, or at best describing it as ignorant sheep herded by political elites, speaks only to a partial reality; in public opinion polls, even in ones weighted overwhelmingly to the center-right, the American people consistently opposse militarism and wars, past and present. \\nThe right and Left, each in their own way, fail to grasp the contradiction that define US political life, namely, the profound gap between the American public and the Washington elite on questions of war and peace, and the electoral process which results in the perpetuation of militarism. We will proceed to analyze the most recent polling of US public opinion and then turn to the electoral outcomes. In the second part we will discuss the contradictions and raise several ways in which the contradiction can be resolved. \\nMethod \\nThe survey of public opinion was sponsored by the Charles Koch Institute and the Center for the National Interest and was conducted by the Survey Sampling International which interviewed a sample of one thousand respondents. \\nThe Results: War or Peace \\nOver half (50%) of the American public oppose an increase in the role of the US military overseas; only as quarter (25%) back an expansion. \\nThe public expresses disillusionment with the foreign policy of the Obama regime, especially of new military commitments in the Middle East, which Israel and its Zionist lobby would be the first likely to support. \\nThe US public has a historical memory of past military debacles by Presidents Bush and Obama. Over half of the public (51%) state that the US is less safe over the past 15 years (2001-2015), while one eighth (13%) claim we are safer. \\nIn the present period 51% of the American public opposes the deployment of ground troops in Syria and Yemen while only 10% believe the US should support Saudi Arabia. \\nWith regard to specific US wars, over 50% believe that the Iraq war made the US less secure while only 25% believe it didn’t increase or decrease US security. Similar responses were expressed with regard to Afghanistan, 42% believe it increased insecurity and about a third (34%) stated it neither increased or decreased US security. \\nIn terms of future perspectives, over three quarters (75%) of the American public believe that the next President should rely less on the military abroad or are uncertain. Only 37% favor increasing military spending. \\nThe mass media and the backers of the Democratic Presidential candidate demonize Russia and China. In contrast almost two thirds (63.4%) of the US public believe the greatest threat at this time comes from overseas or domestic terrorists, while less than a fifth (18%) believe that it comes from Russia and China. \\nIn terms of pursuing a peaceful or military policy, 56% want to reduce or freeze current spending while only 37% want to increase military spending. \\nWars and Peace: The Political Elites \\nContrary to the views of a majority of the public,the last five US Presidents have increased the military budget for over two decades, sent US troops to overseas’ wars in three Middle Eastern , three North African and two europian countries. Despite public opinion majorities, believe that the Afghan and Iraqi wars heighten threats to the US, Obama has retained ground troops, drones and fighter planes in military combat. Despite only 10% approval, the Obama regime has sent arms, advisors and Special Forces in support of the Saudi dictatorship’s invasion of Yemen. \\nObama and Democratic presidential candidate Clinton has encircled Russia, and demonized President Putin as the greatest threat to the US at this time, contrary to US opinion which considers the Islamic terrorists a five times more serious threat. \\nWhile the political elite and especially the leading Presidential candidates promise to increase US troops abroad and military spending, over three quarters of the American public object or are unsure. \\nWhile candidate Clinton campaigns for the deployment of the US air force to establish a ‘no fly zone’ in Syria, the majority public opposes by 51%. \\nIn terms of constitutional law, fully four-fifths (80%) of the US public believes the President needs Congressional approval for military action abroad. Presidents of both parties, Bush and Obama acted without Congressional approval, a precedent which both current presidential candidates are likely to continue. \\nAnalysis and Perspectives \\nOn all major issues of foreign policy pertaining to war and peace, the political elite is far more bellicose than the US public; far more likely to ignore wars that threaten national security; more likely to violate the Constitution;and are committed to increasing military spending even as it reduces social programs. \\nThe political elites are more likely to intervene or become “entangled” in Middle East wars, against the opinion of majoritarian popular opinion. No doubt the decidedly oligarchical military-industrial complexes, Israeli power configuration and mass media publicists, are far more influential than the pro-democracy public. \\nThe future portends the political elites’ continuation of military policies, increasing security threats and diminishing public representation. \\nSome Hypothesis on the Contradiction between Popular Opinion and Electoral Outcomes \\nThere is clearly a substantial gap between the majority of Americans and the political elite regarding the military’s role overseas, wars, constitutional prerogives, the demonization of Russia, the deployment of US troops to Syria and the US entanglement in Middle East wars, which it is understood to be Israel. \\nYet it is also a fact that the US electorate votes for the two major political parties that supports wars, back Middle East alliances with warring states, Saudi Arabia and Israel,and sanction Russia as the main threat to US security. ORDER IT NOW \\nSeveral hypotheses regarding this contradiction should be considered. \\n1. Close to 50% of the electorate abstain from voting in Presidential and Congressional elections, which most likely includes those Americans that oppose the US military role overseas. In other words the war parties ‘win’ elections with 25% or less of the electorate. \\n2. The fact that the mass media vehemently supports one or the other of the two war parties probably influences a minority of the electorate which votes in the elections. However, critics of the mass media have exaggerated their influence because they fail to explain why the majority of the American public respondents are in contrary to the mass media and oppose their militarist propaganda. \\n3. Many of the anti-militarism Americans who decide to vote for war parties may be choosing the lesser evil. They may decide there are possible degrees of war mongering. \\n4. Americans who oppose militarism may decide to vote for militarist politicians for reasons other than overseas wars. For example, majoritarian Americans may vote for a militarist politician who secures financing for local infrastructure programs, or dairy subsidies or promises of employment, or lowering the public debt or opposing corrupt incumbents. \\n5. Americans opposed to militarism may be deceived by demagogic war party presidential candidates who promise peace and who, once in power, escalate wars. \\n6. Likewise, ‘identity politics’ can divert anti-militarist voters into supporting war party candidates who claim office because of their race, ethnicity, gender, loyalties to overseas states and sexual preference. \\n7. The war parties block anti-militarist parties from access to the mass media, especially during electoral debates viewed by tens of millions. War parties establish onerous restrictions for registering anti-militarist parties, voters with non-violent prison records or lacking photo identification or transport to voting sites or time-off from work. In other words the electoral process is rigged and imposes ‘forced voting’ and abstention: limited choices obligate abstention or voting for war parties. \\nOnly if elections were open and democratic, where anti-militarist parties were allowed equal rights to register and debate in the mass media, and where financial campaigns are equalized will the contradictions between anti-militarist majorities and voters for pro-war elites be resolved.\""}, "time": 1742562009.0666199}