{"duration": 0.0941157341003418, "input_args": {"text": "'Meditation: The Chicago Cubs Winning Edge? Nov 7, 2016 0 0 \\nIt is no secret to sports fan around the United States that the Chicago Cubs baseball team just recently won the World Series, which was done for the first time in 108 years. Last year, the Cubs made it to the playoffs, but fell short of the world series. Still though, for an organization who has been used to losing for over a century, the past two years have been a delight in the fans’ eyes. Is it simply a coincidence that for these past two seasons, the Cubs have implemented meditation and yoga into their training regimen, or is there something more to it? \\nFor major league outfielder Darnell McDonald has been the coordinator for the Cubs new mental skills program for the past couple years and has helped to sharpen the mental edge of the players he works with. The Cubs president Theo Epstein helped push for the creation of the program as he knows the importance of having a mental edge in the game. \\n“If you approached a player to talk to them about working on his mental game [20 years ago], his response would be, ‘You think I’m nuts?’ You still see that now and then, but that’s the exception, not the rule.” \\nDarnell McDonald explains that gaining a mental edge over opponents in major league baseball is important because of the incredibly high physical skills that all players have at that level. \\n“You learn when you get to professional baseball, that everyone is good…they’re really good. And so the separator is the 7th game of the world series; the teams that are able to execute under pressure. It’s when we take off the auto-pilot button and when we’re present and alive and aware.” Darnell McDonald, the Cubs Mental Skills Program Coordinator \\nThe Cubs’ manager, Joe Maddon, has been a big proponent of the program as he meditates himself and understands the importance it can have on the player’s attitudes and their performance. He often says to his team, “I don’t ask you to be perfect, I just want you to be present.” \\nJake Arrieta, a starting pitcher for the Cubs and last years Cy Young award winner (best pitcher), loves the program and has benefited tremendously from both yoga and meditation. \\n“I’m much better at it now. For me, it’s about trying to evolve and be better, not only as a player but as a person, too.” \\nMeditation has been scientifically proven to help people be more focused, helps to regulate pain receptors in the body, helps reduce physical and emotional stress, strengthens the immune system and helps people to get better sleep, which equates to a better recovery for an athlete’s body and mind. Meditation is spreading quickly in the sports world. \\nThe professional football team of the Seattle Seahawks coach Pete Carroll introduced mindfulness meditation to his team in 2011. Since the 2012 season, the Seahawks have made it to the playoffs the each of the last 4 years, while winning the Superbowl in 2013 and making it back to the Superbowl in 2014. The results of including meditation into training regimens speak for themselves. \\nLong time NBA coach Phil Jackson is an avid meditator and has discussed why he used mindfulness with his teams like the Chicago Bulls and Los Angeles Lakers and says that it helped his teams communicate better and be able to handle frustrating or stressful events throughout any given game. \\nDo you know of other sports teams that use meditation in training or before games? How has it benefited you in games or practice? \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and practices health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information on how to receive health coaching for yourself, a family member or a friend as well as view other inspiring articles.'"}, "time": 1742563024.9251175}