{"duration": 0.07611942291259766, "input_args": {"text": "'Guards accompanying Turkish President Recep Tayyip Erdogan violently attacked protesters in Washington, D. C. Tuesday who had congregated outside the Turkish ambassador to America’s residence, most Armenians and Kurds protesting Turkey’s increasingly authoritarian bent under Erdogan. [CNN cites D. C. officials as stating that nine individuals, most protesters, were injured in the brawl. An estimated two dozen protesters congregated in front of Turkish ambassador Serdar Kılıç’s residence, some waving a flag associated with the Syrian Kurdish People’s Democratic Union (PYD) which Erdogan’s government perceives as a direct threat to the integrity of Turkey. Two were arrested, one charged with assaulting a police officer it is unclear whether those arrested were protesters or members of Erdogan’s security detail.  Videos circulating on social media appear to show Erdogan’s guards among the most violent aggressors. A video published by Voice of America appears to show men in black suits carrying Turkish flags  —   believed to be Erdogan’s security detail  —   attacking individuals holding megaphones and protest signs. The guards surround a   man who had been kicked to the ground and continuously kick him in the face. Men who appear to be wearing D. C. police uniforms then attempt to surround and capture the men in black suits.  The Kurdish outlet Rudaw published an exclusive video showing the injuries of some of the protesters involved. One man, walking away from the incident with a bloodied face, tells the camera, “the Turks attacked me. ”   Speaking to CNN, a protester identified as Flint Arthur said that his group had congregated to protest Erdogan’s presence in Washington and his “policies in Turkey, in Syria and Iraq. ” “They think they can engage in the same sort of suppression of protest and free speech that they engage in in Turkey,” he argued. A similar incident occurred during Erdogan’s visit to Washington last year, in which Erdogan guards beat Turkish journalists protesting for their rights. Erdogan’s government has engaged in a prolonged military operation against the nation’s Kurdish minority in the southeast of the country, arguing that the Kurdistan Workers’ Party (PKK) a U. S.  Marxist terrorist group, is a threat to Turkish security. Ankara does not distinguish between the PKK and the PYD and its militia, the People’s Protection Units (YPG) who are strong U. S. allies and considered the most effective force against the Islamic State in Syria. Erdogan came to Washington in part to demand that President Donald Trump rescind his approval of a program to arm the YPG in anticipation of an operation to liberate Raqqa, the Islamic State “capital” and its final stronghold in Syria. A week before arriving in America, Erdogan announced his “patience has ended” with the United States and its alliance with the YPG. Prime Minister Binali Yıldırım reiterated that resolve hours before Erdogan met with Trump, telling reporters that Turkey was open to doing “what is necessary” to keep the YPG from participating in the fight against the Islamic State, implying military action. Shortly after the Pentagon’s announcement that Washington would provide the Syrian Kurds with heavy weapons, the Turkish military executed airstrikes against YPG positions in Syria. While Trump confirmed in a joint statement following their meeting Tuesday that he opposed the PKK, he did not walk back his administration’s support for the YPG. Follow Frances Martel on Facebook and Twitter.'"}, "time": 1742564307.5691147}