{"duration": 0.05746269226074219, "input_args": {"text": "'A una chica se le sincroniza el Mac con la regla DURANTE EL PERIODO, EL ORDENADOR DESACTIVA LA CÁMARA PORQUE NO QUIERE VER A NADIE Siri \\nA Marisa Puertas, una joven de 27 años natural de Torrelodones, se le ha sincronizado el Mac con la regla. Esta vecina de la Comunidad de Madrid, clienta de Apple desde hace dos años, comenzó a sospechar que algo raro pasaba en sus últimas menstruaciones cuando Siri empezó a responderle con escuetos monosílabos. “Noté que tenía menos paciencia y que estaba muy irritada, como yo”, explica la joven. \\nMarisa, acostumbrada ya a que su regla se sincronice con la de todos sus dispositivos, agradece sentirse más acompañada en esos días del mes. “Nunca me quedo sin tampones porque Siri me recuerda que los compre ya que ella también los necesita”, explica encantada. \\nReconoce, eso sí, que los días que tiene la regla el Mac funciona mucho más lento y es mejor no agobiarlo con demasiadas peticiones. “Se pasa todo el día en modo hibernación”, lamenta Marisa. “Es como tener un PC durante cinco días al mes”, añade. Durante la menstruación, el sistema operativo sufre desarreglos en sus procesos de ejecución y también desactiva la cámara porque no quiere ver a nadie. \\n“A veces rescata fotos de mi ex pareja y me recuerda que hay que comprar helado de chocolate”, explica Puertas. “Y se pone a buscar en Google a qué huele la nube”, dice. \\nApple ha admitido esta semana que la menstruación de sus dispositivos “es un proceso natural del que no hay que avergonzarse” y que puede traducirse en una mayor sensibilidad de la pantalla táctil y un mayor consumo de batería. La compañía recomienda que, durante el periodo, se guarde el dispositivo en el sofá, sin enlazar con otros dispositivos “y bien tapadito con su funda”.'"}, "time": 1742562271.0898385}