{"duration": 0.059988975524902344, "input_args": {"text": "'Los periodistas de La Sexta cobrarán por “zascas” SI EL \"ZASCA\" SE CONVIERTE EN \"MEME\", EL REDACTOR OBTENDRÁ CIEN EUROS ADICIONALES zasca \\nCon el fin de estimular la revelación de exclusivas y premiar a los periodistas más incisivos, La Sexta pagará a todos sus redactores en función de los “zascas” que hayan propinado cada mes. Por “zascas” la cadena de Atresmedia entiende “cualquier dato, réplica o documento que ponga en evidencia a un político, opinador o medio de comunicación, demostrando que miente o que está equivocado”. \\nLos “zascas” en Twitter, es decir, las respuestas a mensajes que dejen sin argumentos a sus autores, merecerán un plus de cien euros, al igual que los “zascas” que se conviertan en “memes” y los “zascas” en toda la boca. \\nUna medida similar estaba aplicándose ya en El Huffington Post, donde los redactores cobran por cada artículo en el que no te vas a creer lo que ocurre a continuación. “Con seis artículos al mes en los que no te vas a creer lo que ocurre a continuación puedes sacarte un sueldo más o menos digno, especialmente si lo redondeas con un ‘zasca’ o recopilando los mejores ‘zascas’ de alguien”, explica un periodista del medio de Prisa. “Siempre hay alguna medusa rara o una anciana tomando droga caníbal con los que puedes redondear y llegar a los mil euros. No es fácil pero por algo estudiamos una carrera”, añade. \\nEl éxito de la revista Cuore, que lleva más de diez años pagando por “Arrggs”, confirma que este modelo de remuneración está sustituyendo las nóminas tradicionales. “Tenemos a los mejores buscadores de celulitis del periodismo español y eso se ha conseguido con un entorno de trabajo que fomenta la competitividad”, confirma la publicación. \\nLos profesionales más veteranos, como Matías Prats, han criticado internamente este tipo de fórmulas de remuneración porque “erosionan la esencia del periodismo, basada en anuncios de ING Direct cada dos o tres piezas”.'"}, "time": 1742564147.928416}