{"duration": 0.13029885292053223, "input_args": {"text": "\"Share on Twitter \\nWith less than two weeks before the big faceoff between Donald Trump and Hillary Clinton, celebrities haven't been shy about voicing their support for their chosen candidate. \\nKaty Perry, Amy Schumer, and Justin Timberlake have been actively campaigning for Clinton while Stacey Dash, Kid Rock, and Sarah Palin have been putting in the hours for Trump. \\nOther big-name celebs, however, have decided to stay mum. \\nAccording to Esquire , there might be quite a few more than you'd think. Take a look: Dwayne “The Rock” Johnson Image Credit: Jason Kempin/Getty Images \\nThe Rock has been in countless films and can boast over 67 million followers on social media. \\nWhile he has come out saying that he may run for office one day, Johnson has not publically announced who he'll be voting for in November. Chris Pratt Image Credit: Jason Merritt/Getty Images \\nChris Pratt has been killing the box office over the past few years with films like “Jurassic World” and “Guardians of the Galaxy,” but he hasn't voiced support for either Trump or Clinton so far. \\nPratt is a noted conservative and supporter of the nd Amendment, though. Taylor Swift Image Credit: Anthony Harvey/Getty Images \\nTaylor Swift is perhaps one of the biggest pop stars in the world. \\nSwift has avoided politics at all costs, despite having over 156 million followers across numerous social media platforms. Garth Brooks Image Credit: Kevin Mazur/Getty Images for ASCAP \\nGarth Brooks hasn't been afraid to speak out about politics in the past. He expressed his support for President Obama back in 2012, but this year, the country singer has been quiet. \\nAt one point in his life, Brooks was a registered Republican. Carrie Underwood Image Credit: Theo Wargo/NBC/Getty Images \\nCountry singer Carrie Underwood is a devout Christian , and has mostly abstained from showing her political side in public. \\nAt one point, she did perform at an event honoring former President George W. Bush, but she's also a vegan, an animal rights activist and supporter of gay marriage. \\nBut it's safe to say she won't be endorsing a candidate this year, based on this 2008 interview : \\n“There is someone I do support, but I don’t support publicly. I lose all respect for celebrities when they back a candidate.” Mark Wahlberg Image Credit: Alberto E. Rodriguez/Getty Images \\nMark Wahlberg has managed to stay away from politics for most of his career, although he has golfed with Donald Trump in the past. \\nThe “Deepwater Horizon” star has refused to say whom he's voting for on many occasions, although he was a big supporter of Barack Obama in 2008 and 2012 . Bruno Mars Image Credit: Robyn Beck/AFP/Getty Images \\nBruno Mars, whose real name is Peter Gene Hernandez, is a mystery, both politically and spiritually. Although he wears a cross around his neck, he's never professed to which faith he belongs. There is very little information about his political beliefs, as well. \\nMars seems to be focused on his music rather than preaching politics or religion to his many fans. Miranda Lambert Image Credit: Tibrina Hobson/Getty Images \\nLambert doesn't talk politics, but she isn't afraid to show her love for firearms. \\nWhile she hasn't endorsed anyone for president in 2016, Lambert is a professed Christian and a “lifetime member of the NRA,” so she is probably leaning to the right. \\nHer ex-husband, Blake Shelton, holds some very similar values... Blake Shelton Image Credit: Kevin Winter/Getty Images for Stagecoach \\nBlake Shelton might have had some kind words to say about Trump this year, but that doesn't mean he's endorsed him. \\nIn fact, he's tweeted about it : Hey before this gets going like it always does... I haven't enforced ANYBODY for president. And I not going to. I don't do that shit. — Blake Shelton (@blakeshelton) July 28, 2016 Sean “P. Diddy” Combs Image Credit: Gareth Cattermole/Getty Images \\nSean “P Diddy” Combs, formerly known as “Puff Daddy,” has said a lot about Donald Trump, but hasn't quite offered a full endorsement. \\nCombs believes Obama “ shortchanged ” black people and that Hillary Clinton needs to prove herself before she gets the black vote. Ronda Rousey Image Credit: Theo Wargo/NBC/Getty Images \\nMMA fighter Ronda Rousey initially showed her support for Bernie Sanders in 2015, but now she's without a candidate. \\nBut she's also said that she will not vote for Clinton, so it's possible her support will go to a third party candidate this election. Kenny Chesney Image Credit: Kevin Winter/Getty Images \\nCountry music star Kenny Chesney won't be voting for Donald Trump, that much is clear. According to Esquire , he doesn't like talking politics at all. \\nHe did admit to voting for John McCain in the past, though. Tom Cruise Image Credit: Kevin Winter/Getty Images \\nTom Cruise has become quite the enigma over the past decade. He is a dedicated Scientologist and very successful movie star, but his politics are very obscure. \\nHe's donated thousands of dollars to the Democratic party, but has also appeared in commercials for Republican candidates... Cam Newton Image Credit: Rich Polk/Getty Images \\nCam Newton has avoided taking political stances for much of his career in the NFL. \\nIn a recent GQ article , Newton refused to comment on Trump other than saying Trump is an “unbelievable businessperson.” Danica Patrick Image Credit: C Flanigan/Getty Images \\nDanica Patrick is one of the few women in history who has been very successful in the dangerous world of motorsports. Her success is unparalleled, but don't go asking her about religious or political beliefs. \\nShe told Fox Business earlier this year: \\n“I feel like religion and politics are the two things that you just stay away from. \\nI’m not going to comment about what I like or don’t like or what people say. But we live in America and it’s a free country and you can say whatever you want.” Phil Mickelson Image Credit: Nicholas Kamm/Getty Images \\nPhil Mickelson is one of the most successful golfers out there. He's made millions out on the links during his career and donated some of it to the Republican party in the past. \\nBut he has been quiet during this election, opting to keep his opinion to himself. \\nWith so little time left before the election, it's doubtful these megastars will break their silence. \""}, "time": 1742563853.1288402}