{"duration": 0.1582038402557373, "input_args": {"text": "'“I was called a whore and a witch,” Madonna said on Friday in a searing speech about the sexism and bullying that women face in the music industry and the culture at large. “Such a nasty woman,” Donald J. Trump interjected in October as Hillary Clinton pointed out holes in his Social Security plan during their final presidential debate. Madonna and Mrs. Clinton: both trailblazers, both polarizing figures, and both attacked for actions, choices and behavior that are broadly accepted  —   even applauded  —   when done by their male peers. Madonna herself made a connection between the two women before her speech Friday, saying it was “really important to make a stand and speak my mind” about women’s rights after Mrs. Clinton’s loss in November. Our pop music editor, Caryn Ganz, and deputy Culture editor and former political correspondent Patrick Healy looked at how Madonna and her speech put Mrs. Clinton’s candidacy in fresh perspective. PATRICK HEALY: Caryn, I’m coming off 18 months covering the presidential campaign, and frankly I’ve been wondering if Mrs. Clinton would ever give a speech like Madonna’s on Friday  —   calling out sexism in America and the rules that trap women but not men. “If you’re a girl, you have to play the game,” Madonna said. “Don’t have an opinion that’s out of line with the status quo. ” Madonna and Mrs. Clinton have been controversial in part because they didn’t play “the game. ” It’s easy to forget, amid their celebrity and longevity, that Madonna and Mrs. Clinton were once renegades: speaking out and pursuing power in ways that were considered overly ambitious for women. They fought for equality and respect  —   and they sought the kind of influence and money and fame that men have. Mrs. Clinton’s place and legacy in our culture is just starting to be considered and debated. But only after her speech yesterday did I start to think about her and Madonna as sisters in arms. CARYN GANZ: Mrs. Clinton is so buttoned up and Madonna is so, well, unbuttoned, that I think many people have been hesitant to make this connection. And because Madonna has used sexual expressiveness as code for all kinds of liberation, she hasn’t been courted as a political ally. But now that both of them have reached a certain age, the sexism they’ve faced for decades has become something more insidious, paired with ageism. HEALY: A lot of people don’t see sexism hurting Mrs. Clinton  —   after all, she won the Democratic nomination  —   but she and her advisers did. As for the sort of “liberation” that Madonna pioneered, Mrs. Clinton has a complicated relationship with it. She came of age in the era of women’s lib, and yet  —   to help Bill Clinton’s career in Arkansas  —   she changed her last name from Rodham to Clinton and got new hairstyles and glasses. And when she was most visibly liberated, including in her   performances in political debates, she got called “likable enough” by Barack Obama in 2008 and a “nasty woman” by Mr. Trump this fall. Madonna, in her speech Friday, recalled that she got so much abuse after releasing her “Erotica” album and “Sex” book in 1992 that she felt like “the most hated person on the planet. ” GANZ: In a 2008 “Weekend Update” segment about Mrs. Clinton’s initial presidential run, Tina Fey said: “Maybe what bothers me the most is that people say that Hillary is a bitch. Let me say something about that: Yeah, she is. ” (Ms. Fey later proclaimed, “Bitch is the new black. ”) I thought about this when Madonna put the song “Unapologetic Bitch” on her most recent album, “Rebel Heart,” the record where she started to speak openly about the discrimination she’s faced as a female artist over 55. Madonna has referred to herself in many ways in songs over the years, but she waited until 2015, on her 13th album, to reclaim “bitch. ” HEALY: Mrs. Clinton knew some people used that word about her. Like Madonna, she answered the haters with a strong work ethic. Mrs. Clinton put in   days, thought deeply about policy, and was a tireless campaigner even if she wasn’t the world’s most natural politician. Madonna is no Adele: She wasn’t born with a     talent and voice. But she succeeded through work, grit and guts. GANZ: But she was born with a     ability to understand and command the power of connecting her voice to her image. Nobody did this the way Madonna did before her, though many have followed her example. Knowing that as a woman, her appearance would be a talking point, Madonna   this scrutiny as a weapon from the beginning of her career, forcing everyone to talk about what she looked like by evolving  —   it was a conversation she essentially started herself. But as she has gotten older, the commentary about her work is almost entirely centered on how she looks rather than how she sounds, and whether what she is wearing or saying is “appropriate for a woman her age”  —   a question that musicians like Mick Jagger, who is 15 years older than Madonna, have never had to answer. And certainly no other candidate was the subject of stories about what he wore to the debate and what his clothes meant. (Continuing investigations into Mr. Trump’s hair aside.) HEALY: I remember Mrs. Clinton telling me during the 2008 race that she probably woke up two hours earlier than Barack Obama each day because she had to do her hair and makeup, and he could just roll out of bed and into a suit. She has had no room for error in what she says or how she looks, her advisers felt, while a candidate like Mr. Trump could sound like a crazy man on Twitter, and many voters shrugged. Then again, Mrs. Clinton is far more of a perfectionist than Mr. Trump, as is Madonna. GANZ: But Madonna and Mrs. Clinton have had their perfectionism interpreted as a pathology. As women cutting a path no woman had traveled before, they had no choice but to be as precise and   as possible, knowing the slightest failure would invite a deluge of criticism. Madonna is known to control every aspect of rooms in which she will appear, down to the color of the lampshades. While Mr. Trump was making brash statements, Mrs. Clinton was tweeting    policy plans and rigorously preparing for the debates. HEALY: But Mrs. Clinton could also take control too far, like keeping her State Department email on a private server. “I don’t want any risk of the personal being accessible,” she wrote in 2010. And in 2008, she rarely talked about being a woman because she wanted to control her image  —   she wanted voters to think she would be as tough as any male commander in chief. GANZ: Trailblazing is a solitary game. They’re both lonely warriors who reached a critical moment this year: the time when they had to speak up for their achievements and call out their haters. HEALY: As Madonna said in her speech, “I remember wishing I had a female peer I could look to for support. ” But she and Mrs. Clinton have a mixed record as allies of feminists. Mrs. Clinton put aside her career to support her husband’s, and stood by him during his extramarital affairs, and she supported some policies, like a welfare overhaul, that critics regarded as  . She was also a champion of women’s rights as human rights  —   even as she opposed gay rights like   marriage. Do Mrs. Clinton and Madonna bear any responsibility for being polarizing figures, Caryn? GANZ: Oh, certainly, although Madonna has always been a steadfast supporter of gay rights (something Mrs. Clinton can’t claim). Madonna designed herself to be a polarizing figure, and her breed of feminism has evolved over the years  —   at times she’s been more focused on   than the advancement of womankind. She has defended Sean Penn from accusations of domestic abuse. She wrote one of the most famous songs about not having an abortion. And she’s also often been a covert feminist: On “Material Girl,” a song still cited as an ode to consumerism, Madonna is the winner because “experience has made me rich, and now they’re after me. ” It wasn’t the objects she was after, or the men  —   it was the power. And that was in 1984. HEALY: Mrs. Clinton has been labeled   since she was a young woman. And it drove her crazy, advisers said, because Mr. Trump and other men never faced that accusation. She felt held to the double standard that Madonna spoke about on Friday. I can imagine Mrs. Clinton listening to that speech and just saying “Yaaaas” over and over.'"}, "time": 1742562351.6434686}