{"duration": 0.04982805252075195, "input_args": {"text": "'Monica Crowley, who was selected just weeks ago to serve in a   post on   Donald J. Trump’s National Security Council, has decided against taking the position after allegations that she plagiarized key passages in a 2012 book. Ms. Crowley, whose name was briefly floated as a candidate for White House press secretary, has been dogged by accusations of plagiarism in recent weeks, beginning with the discovery by CNN that she copied several passages in a book she published with HarperCollins. A later report in Politico unearthed similar issues in her doctoral dissertation. “After much reflection, I have decided to remain in New York to pursue other opportunities and will not be taking a position in the incoming administration,” Ms. Crowley said in a statement to The Washington Times. “I greatly appreciate being asked to be part of   Trump’s team, and I will continue to enthusiastically support him and his agenda for American renewal,” she said. She did not address the allegations of plagiarism. Ms. Crowley is the second official announced by the transition team to decide not to go to the White House, following Jason Miller, who was to be the communications director. One person close to the transition said that Ms. Crowley’s role would have involved overseeing certain speeches, something that would have been difficult after the plagiarism claims. HarperCollins has withdrawn the digital edition of Ms. Crowley’s book “What the (Bleep) Just Happened?” Published by Broadside Books, a conservative imprint at HarperCollins, it is a critical look at Barack Obama’s presidency. It sold out 20, 000 copies in hardcover, Publishers Marketplace said. Mr. Trump’s transition team had labeled the plagiarism reports “a politically motivated attack” and defended Ms. Crowley’s ability to serve. “Monica’s exceptional insight and thoughtful work on how to turn this country around is exactly why she will be serving in the administration,” transition officials said in a statement to CNN. “HarperCollins  —   one of the largest and most respected publishers in the world  —   published her book, which has become a national best seller,” the statement said. “Any attempt to discredit Monica is nothing more than a politically motivated attack that seeks to distract from the real issues facing this country. ” Most publishers do not check for plagiarism, fabrication or factual inaccuracies.'"}, "time": 1742628344.2995892}