{"duration": 1.3852555751800537, "input_args": {"text": "'Do you really like sexy women like the one in the photo above? Are you sure? Big Brother Google says “Why don’t you look at this story about alternative lifestyles about men who have realized what terrible misogynists they are for having sexual desires?” rather than searching for articles on for pick-up artistry .\\nSooner rather than later, all Internet roads will lead to the same New World Order Socialist philosophy.\\nAs profiling of Internet users becomes more prolific and the algorithms more sophisticated in the coming years, the news and information we search for will be tailored to slowly “nudge” us one way or the other politically, one small step at a time.\\nThe management of the information we get to read is already in its infancy.\\nWhy do you think that “free” app on your phone that only performs a few functions swells in size with each “update” that is released? Do you really think they give a damn about your privacy and are plugging security holes? Hell no. The apps we download are moving from useful, low-resource using services to resource hogs (necessitating an upgrade in processing power every year or two) because they only provide us with a “free” service in order to hook us so the apps can gather information about everything we’ve ever written on our devices for social engineers and marketing flacks. The apps are becoming more sophisticated in the way they monitor everything we do – which is why the apps need all that memory size.\\nAnd soon, apps will be gathering information about everything we’ve ever said aloud by using the built in microphones on each device and speech recognition technology. CIA agents confirm microphones can easily be activated even when a device is switched completely off.\\nThis type of information will be collected in giant databases such as the Utah Data Center, with the ultimate goal being the corporate-government complex knowing more about us than we know about ourselves.\\nBig Brother Was So Yesterday Orwell’s Big Brother idea never could have imagined the insidious nature of today’s information technology\\nToday’s information technology has put Big Brother on steroids.\\nThe Waking Times details this frightful world that is already emerging as anyone who pays attention knows search engines are already tailoring information to what we search for and even what we text people about.\\n“Mr. X, we’ve studied the little virtual bubble you live in, and now we can sell you your own special brand of truth.”\\nMost of the time, the information one will see in this Internet bubble will be customized to suit a person’s interests. This is why Facebook relentlessly pushes the “Like a page or product” portion of its web site. This information is used to build a profile of a person that ultimately will be able to accurately predict the color of their next bowel movement.\\nIf a man is interested in non-GMO foods advertising and “news” stories will be tailored to inform him of grocers who sell organics and about news from “approved” outlets with stories written on the topic. Most of the time, this will be insidious advertising and ads disguised as information.\\n“Hello, audience. We’re going to pitch you on becoming full-fledged obsessed consumers, as if there is no other worthy goal in life—and then we’re going to profile you from top to bottom, to find out exactly what kind of obsessed consumer you are, so we can hit you and trigger you with information that uniquely stimulates your adrenal glands…”\\nThe Utah Data Center is designed to store exabytes of information on “all forms of communication, including emails, cell phone calls, and Internet searches, as well as all types of personal data trails—parking receipts, travel itineraries, and bookstore purchases”\\nAs another example: Okay, we know you are interested in traditional gender roles. We ( the information managers like Facebook and Google) will now to find news stories and customize the information you get to read online in order to cause you to doubt the validity of your beliefs. The ultimate goal is to slowly but steadily move you away from believing in traditional gender roles to believing in militant feminism without you realizing what we have done.\\nThis type of information management is even more insidious than outright censorship, as it will be designed to steer everyone towards what the controllers of society want us to think and buy, no matter how far from the ideal consumer and fellow traveler we may be.\\nThink of it as a game of Plinko on The Price is Right, in which all chips ultimately fall into the “perfect, braindead consumer” slot at the bottom of the maze. The social engineers’ dream is a world of nothing but sexless consumers who perform mindless work in meaningless jobs, whose only outlets for pleasure are shopping and eating out and other State-approved activities.\\nThink that’s hyperbole? Travel around the world for six months to a year, then come back to the United States and tell me what you think.\\nLittle Information Bubbles Merge Into Big Information Bubbles We become what we are repeatedly exposed to, which is why a war is on for your mind\\nOnce we have you believing a certain way or questioning your established beliefs, the key comes when it is time to steer public perception one way or the other. This is where the “rubber meets the road” in the realm of managing the populace like so many sheeple.\\nBUT when a Big One comes along, like the 2016 national election in the US, the separate tunes come together and ring as one. Then the overriding need to extend Globalism’s goals (in the person of Hillary Clinton) blot out every other priority. Then the major media twist whatever they need to twist. Then it’s the same bubble for everyone.\\nSoon, just like the mainstream media on television and in print, everything you see online will be directed at making you think, behave and vote a certain way. The micromanagement and control of information just hasn’t become that sophisticated – yet.\\nObama already hinted that only “official” information should be linked up by the corporate interests of Facebook, Google, etc. Look for Hillary to implement that idea with an iron fist if she is whisked into the Oval Office . An Internet security “crisis” will likely be engineered in the near future in which—you guessed it—Big Daddy Government needs to step in and take control of the web. From there on out we will be back to corporate-government propaganda instead of the Libertarian’s dream the current iteration of the Internet is.\\nSo, the awakening we have seen from the brainwashing of the corporate media will be a temporary one if the elite have anything to do with it. The groundwork of this new, Socialist system of micromanaging information is already being laid. You already see it every time you do a search.\\nSomeday soon the only information we’ll be able to find online will be from sources the corporate-government complex approves of. Of course, there will be renegades and rebels like us who resist, but most of the braindead sheeple out there will go along to get along just as has been happening since time immemorial.\\nOur options will be to get off the grid or to move to a new Internet. Neither move will be peacefully tolerated by the powers that be.\\nRead More: Are Sweatshops Coming To America? \\n'"}, "time": 1742563818.654608}