{"duration": 0.04000139236450195, "input_args": {"text": "'English patriotism is on the rise, with increasing numbers of people identifying as predominantly English rather than British, a survey has found. [According to the recent YouGov poll, nearly   of those questioned described themselves as English instead of British  —   a rise of 5 per cent on 2015 figures.  Last year, just 18 per cent of those surveyed said they felt only British or more British than English, but 35 per cent said they were English not British or more English than British. The number of people saying they feel equally English and British rose from 35 to 38 per cent between 2015 and 2016. Numerous polls during and after the European Union (EU) referendum showed that those who felt mostly English were more likely to vote for Brexit. Speaking to The Telegraph shortly after his election, UKIP leader Paul Nuttall described how he aimed to appeal to this renewed sense of Englishness, particularly following the devolution of other UK nations. “The next big issue that’s going to come up in British politics beyond Brexit is Englishness,” he said. Adding: “There is a value that unites that vast majority of British people away from the small metropolitan clique, and that value is patriotism. ” The former Labour cabinet minister John Denham, who now heads the University of Winchester’s Centre for English Identity and Politics, led the study. He said he found a growing correlation between identity and political behaviour. “Voters who most strongly identify as English are much more likely to reject Labour as a party and key Labour messages, like support for the EU,” Mr. Dunham explained. “Without a change in Labour’s appeal, rising English identity may make attracting key groups of voters even harder. ” On Tuesday, Labour leader Jeremy Corbyn attempted to appeal to patriotism, claiming he was not “wedded” to the principle of EU free movement. However, he refused to say he would limit numbers and insisted that current levels of migration were not too high. His only solution was to say that labour reforms would “probably” reduce the incentive to come to the UK.'"}, "time": 1742562679.1072245}