{"duration": 0.0794670581817627, "input_args": {"text": "'Almost six years have passed since the death of Colonel Muammar Gaddafi – a death that changed Libya forever. Arguably, once a stable country, it now fights an inner disease, known as Daesh or ISIL. \\nVia AnonHQ \\n\\nHowever, the murder of the Libyan leader was orchestrated, some say because of his plan to question the standard money system. Gaddafi also wanted to introduce actual gold in the form of money – as the African Gold Dinar. This Dinar wouldn’t be just paper money, but would represent value in the form of tangible precious metals itself, rather than within the government’s vault. Gaddafi also wanted to trade oil for gold, not the American Dollar.\\nApart from Libya being the largest oil producer in the upper African region (when under Gaddafi) and wanting the returns in gold (which obliviously made the west very upset) – Gaddafi’s death makes things a bit different. If you remember his murder, then you would remember how he begged for mercy while covered in wounds and blood, and it going viral on the Internet. While these videos raced across the entire world, for all to see; this wasn’t the case for another so-called terrorist, out of respect for the burial customs of the locals. Osama bin Laden, who was a supposed open threat to the United States, who was, at the time held accountable for the 9/11 attacks, had his body taken and thrown into the ocean without the humiliating torture and degradation posed in front of the world.\\nAccording to an article published by The Guardian , a completely different story emerged from the men who were present during Gaddafi’s death. Mansur Dhao, one of the men present, who was in control of the defenses for Gaddafi, stated that Gaddafi never wanted to leave his country, nor was he running away, as it was portrayed in the blurry clip. Dhao said that Colonel Gaddafi changed locations every few days, and a few days before his death, Sirte (the place where he died) was under heavy siege. Therefore, it was unlikely for anyone to enter the city.\\nApart from this, in the early hours of the morning, the defector force known as the Transitional National Council (TNC), took control of the final territory in Sirte and in an area no larger than 840 yards, Gaddafi’s loyalists were ready to break out.\\nHaving said that, when NATO hit the convoy, they were unaware that Gaddafi was in one of those cars, and according to a NATO official, those heavy vehicles were forcing their way out of Sirte, heading to the outskirts of the city. These vehicles had heavy weapons mounted on them; the locals were fearful, and NATO aircraft fired upon them. The attack destroyed more than twelve cars, and as a reaction, the convoy was scattered into several groups, with the members of TNC following those cars.\\nMany people from inside those cars that were fired upon, jumped, and Gaddafi was amongst them. Heavily wounded, he went into hiding, leaving behind a trail of blood, which led TNC members to his hiding place.\\nHere is an interesting documentary that gives details on the events that lead to the death of Colonel Gaddafi. https://t.co/0RcP7aydtS \\n— Anon.Dos (@anondos_) October 28, 2016 \\nThere were many people present that day, and several videos of Gaddafi’s death are easily found. Fighters say that when they found Gaddafi, he was begging for them not to shoot him. Others, on the other hand say that Gaddafi’s last words were, “What did I do to you?”\\nSource: The Guardian , The Mirror '"}, "time": 1742562676.991178}