{"duration": 0.046968698501586914, "input_args": {"text": "'Thursday at the Senate Banking, Housing and Urban Affairs Committee update on the Trump administration’s fiscal policies, Sen. Elizabeth Warren ( ) peppered Treasury Secretary Steven Mnuchin with hostile questions, interrupting several times over an updated   law.  Mnuchin said, “Republican platform did have  . We during the campaign and I had the opportunity to work with the president on this, specifically came out and said we do support a 21st century   which is, that means there are aspects of it, okay, that we think may make sense. But we never said before that we supported a full separation of banks  —  ” Warren interpreted Mnuchin saying “I’m sorry, let me just stop you right there, Mr. Secretary. ” Mnuchin objected saying, “You’re not letting me finish. ” Warren shot back,  “Yeah, I’m not because I really have to understand what you’ve just said. There are aspects of   that you support, but not breaking up the banks and separating commercial banking from investment banking? What do you think   was if that’s not right at the heart of it?” As Mnuchin tried to explain, Warren said, “So you’re in favor of   which breaks apart the two arms of banking, regular banking, and commercial banking, except you don’t want to break apart the two parts of banking. This is like something straight out of George Orwell. ” Warren continued the grilling, saying, “This is just bizarre. The idea that you can say we are in favor of   but not breaking up the banks. ” Mnuchin said, “We never said we were in favor of  . We said we were in favor of a    . It couldn’t be clearer. ” She ended by saying, “We are in favor of a bill that is called breaking up the banks only don’t break up the banks. Thank you, Mr. Chairman. This is crazy. ” (  Grabien) Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742564217.1435673}