{"duration": 0.1051781177520752, "input_args": {"text": "'During another week of presidential declarations that some journalists were “enemies of the people” of new steps to restrict White House press access by way of a    list, and of reported moves to force national intelligence agencies to toe the administration line, a   pattern set in. Journalists, their subscriptions and ratings spiking, howled about another move to undercut the role the free press plays in a democracy (which “Dies in Darkness” as the new Washington Post slogan has it). The administration doubled down on its antipress aggression, this time declaring it was “going to get worse every day” for these “globalist” and “corporatist” journalists (and other such gobbledygook from the former Goldman Sachs executive Stephen K. Bannon). And all the while, so many of the most important and credible leaders in the president’s own party more or less kept their traps shut or looked the other way. If there were ever a moment for government leaders who believe that true information unearthed by independent news sources is vital to our nation to stand up and say so, this would be it. President Trump’s argument that the national press corps is illegitimate and dishonest has emerged as one of the most consistent themes of his presidency, alongside  —   and seemingly as important to him  —   his calls for a major tax code overhaul, an end to Obamacare, a border wall and “extreme vetting. ” Those other parts of his agenda appeal to large groups of Republicans on Capitol Hill, including the leaders of the House and the Senate. So you could see the appeal of staying out of the way to let Mr. Trump do his thing against the press  —   no great favorite on The Hill anyway  —   as their other big policy dishes marinate and cook. But they might be wise to rethink that strategy. The journalism that Mr. Trump and his aides seek to delegitimize today could be the legitimate research and bipartisan data points they try to use to make policy arguments with Mr. Trump tomorrow. There’s also that part of putting your money where your mouth is after spending long careers extolling the genius of the founders who created our system to ensure our president never became an infallible king, ever cognizant that, as James Madison put it, “popular government without popular information,” is “a prologue to a farce or tragedy. ” Asked on Thursday about Mr. Trump’s first declaration that the press was “the enemy,” Senator Mitch McConnell of Kentucky, the majority leader, said, “I don’t view you guys as the enemy. ” It warms the heart. He went on to say: “I expect adversarial questions. And you rarely disappoint me. And I think it’s part of what make America function. ” It was a start, I guess. But it fell short of the   “knock it off” to Mr. Trump that these times demand, at least when it comes to calling true journalism false or calling journalists dishonest enemies. The office of Representative Paul D. Ryan, the House speaker, declined to engage with me on Saturday when I asked for a comment on whether Mr. Ryan was comfortable with what I called Mr. Trump’s attempt to delegitimize the fourth estate. His office said it disputed the premise of the question. As a couple of senior congressional Republican aides told me on Saturday  —   on condition of anonymity, to speak candidly about private discussions  —   there is a view on their side of the aisle that, while Mr. Trump’s bombast is notable, the press is being too quick to hyperventilate, and that, in the end, things will be just fine. And every week I wonder about it myself  —   how serious are all the threats and bluster against the news media by Mr. Trump and Mr. Bannon, given that news organizations continue to break big stories about the administration with help from leaks that have not abated despite the presidential pounding? None of it stopped The Washington Post from reporting on Friday that presidential aides, after failing to convince the F. B. I. to publicly dispute reports by The New York Times and CNN about contact between Trump campaign aides and Russian intelligence, went on to successfully pressure other intelligence officials and key congressmen to do the same. It didn’t keep The Associated Press and The Wall Street Journal from reporting on a Department of Homeland Security assessment disputing the basis for the administration’s attempt to block travel to the United States from seven predominantly Muslim countries. Nor did it stop the news team at KOKH, a Fox television station in Oklahoma City, from learning and reporting that Mr. Trump’s new leader of the Environmental Protection Agency, Scott Pruitt, conducted some state business by private email during his time as Oklahoma’s attorney general, despite denying that he did so in recent Senate testimony. On Saturday, I turned to a sage of the Washington press corps, Bob Schieffer of CBS, whose time in Washington dates to the Nixon administration, to see how seriously he took the recent threats against the press. It was his 80th birthday. “We need to be taking this very seriously  —   any time you undermine the press, I think that’s very dangerous for democracy,” Mr. Schieffer said. “Do we want a situation where the only source of information is the government? I mean, really? Somehow I don’t think that’s what the founders intended. ” Mr. Schieffer was struck by Mr. Trump’s declaration on Friday that the press should not rely on anonymous government sources when his administration had pushed officials to speak anonymously to reporters that very same day. Mr. Trump was quite fond of anonymous sources himself when, for instance, he promoted the lie that President Barack Obama wasn’t born in the United States by announcing “an extremely credible source” had told him Mr. Obama’s “birth certificate is a fraud. ” All of which leaves the question of what’s to be done about it. The most obvious answer came in the statement CNN made after the network  —   along with The New York Times, BuzzFeed, Politico and The Los Angeles Times  —   was cut out of an   press briefing with Sean Spicer, the White House press secretary, on Friday: “We’ll keep reporting regardless,” the network declared. There should be, however, legitimate questions about whether that reporting should include blanket coverage of the next speech Mr. Trump gives in which he calls honest journalists dishonest or “the opposition. ” Those kinds of polemical statements are no longer “news” (defined as “new”) but rather part of a repetitive, antipress, negative branding campaign. Another lesson came on Friday after several news organizations went along with Mr. Spicer’s exclusive gaggle, including CBS News, ABC News, Bloomberg and The Wall Street Journal, even as Time and The Associated Press refused. After Twitter vented proper umbrage  —   I was in that chorus  —   The Journal and Bloomberg said they wouldn’t “participate in exclusionary briefings of the sort that happened today” in the future, as the Bloomberg editor in chief John Micklethwait said. It was the   thing to do. Your turn, responsible leaders of America.'"}, "time": 1742563074.8520708}