{"duration": 0.06937408447265625, "input_args": {"text": "'Has George Soros Committed Treason?\\n“His only legitimacy is his wallet.”\\nhttps://www.rt.com/usa/366579-soros-orgs-driving-trump-protests/ \\nThe press prostitutes continue to lie to us. They pretend that the anti-Trump protests are real spontaneous events although the prostitutes know that the “protests” are orchestrated by George Soros and front groups for the Oligarchy such as change.org and other fake progressive groups funded by the oligarchs.\\nSoros, change.org and various progressive and leftwing fronts for the oligarchs pretend to be for democracy, but they are acting in behalf of Oligarchy. We are witnessing a direct attack on American democracy. These protesters are the hired mercenary enemy of the American people.\\nBelow is an email I received from a friend in Massachusetts. They preach peace and love while they commit violence: \\nBelow is one of the emails I rec’d regarding immediate organizing to get rid of Trump. JWJ is Jobs for Justice serving Massachusetts with the main group in Boston and the subsidiary in western MA. You appear to be correct, because I rec’d the notice below the day following the election and election results were not even in until 3:00 a.m. Moveon.org was/is behind this one. Moveon.org is link under 3rd local event.\\nDear JWJ and allies,\\nIf you were like me, today was a hard day to get up. Donald Trump is\\nthe president-elect, and last night Republicans took the House, the\\nSenate, and thus the Supreme Court. This is a terrible situation for\\nhumanity, let alone the workers’ movement and our ability to expand\\norganizing and collective bargaining rights. And yet, there is no time\\nto really brood about it. We are called to take immediate action.\\nToday, we are joining with others throughout the movement to demonstrate\\nour non-consent with the election results, in particular the election of\\nDonald Trump. This evening, thousands will gather in cities across the\\nnation to affirm to ourselves and one another that we will not give up\\nthe fight-the fight for a nation with liberty and justice for all. We\\nwill stand with one another, across race, religion, gender, age,\\nability, national origin, sexual orientation, and all of our identities.\\nWe will join hands, pledge our solidarity, and resolve to forge ahead\\neven in this moment of peril and challenge. See local events below. \\nCheck out moveon.org/standtogether.\\nIn these most difficult of political moments, we have to come together\\nand stand stronger. Never has the “I ‘ll\\nBe There” pledge been more necessary than today. \\nIn struggle,\\nErica Smiley\\nLOCAL EVENTS\\nTHIS EVENING:\\nLove and Unity Gathering\\nhttps://www.facebook.com/events/553790148146217/ \\n5 PM, Holyoke City Hall\\nAmherst Vigil for Love \\n5 PM, Amherst Common\\nPeaceful gathering of solidarity, resistance, and resolve\\nhttps://act.moveon.org/event/Solidarity_gatherings/5139/signup/?akid=&zip= \\n5:30 PM, Edwards Church, Northampton\\nTUESDAY NOVEMBER 15:\\nWhere Do We Go From Here? A Post-Election Analysis\\n” target=”_blank”>http://afscwm.org/blog/2016/11/02/go-post-election-analysis> \\n6:00 PM, Northampton Friends Meeting, 43 Center Street, Northampton\\nAnd check out President Donald Trump and The Great Repudiation\\nhttp://www.commondreams.org/views/2016/11/09/president-donald-trump-and-great-repudiation \\nand The Best Democracy Money Can Buy \\nhttp://thebestdemocracymoneycanbuy.com/stream/ \\nThe post Has George Soros Committed Treason? appeared first on PaulCraigRoberts.org .'"}, "time": 1742562989.2022464}