{"duration": 0.06615996360778809, "input_args": {"text": "'Breitbart.com reports: \\nLong-time political operative Roger Stone told Breitbart News Daily SiriusXM host Stephen K. Bannon Wednesday of Hillary Clinton confidant Huma Abedin, “Most of the experts I’ve spoken to conclude, looking at the various facts regarding Huma–her rise, where she came from, her family background, her various connections–conclude that she is most likely a Saudi spy, which is my own conclusion.” \\nStone also discusses the “clear, deep, inarguable, indisputable connections between Huma Abedin and a Saudi Arabian official named Abdullah Omar Naseef … one of the founders of the Muslim World League (MWL). …. The MWL is directly tied to the Rabita Trust, a “Specially Designated Global Terrorist Entity,” which Stone previously discussed : Naseef, the Muslim World League, and the government of Pakistan created the Rabita Trust in 1988. Naseef was a sponsor and financial supporter of Syed Abedin’s IMMA. Just a month after the 9/11 jihadist attack left thousands dead and brought down the World Trade Center, President George W. Bush’s Executive Order designated the Rabita Trust as a Specially Designated Global Terrorist Entity and the Treasury Department froze its assets on October 12, 2001. Naseef founded the Rabita Trust and remains involved with it to this day. A Treasury Department press release issued when Rabita Trust’s assets were frozen indicated that Rabita Trust is headed by Wa’el Hamza Jalaidan, one of the founders of al-Qaida with bin Laden. He was the logistics chief of bin Laden’s organization and fought on bin Laden’s side in Afghanistan. Jalaidan himself was branded a Specially Designated Global Terrorist Entity by the United States Treasury Department, and his assets have been frozen, as well. \\nStone also contended that much of what the Clintons have done via their foundation is “treasonous.” \\n“They have taken money from the Chinese, the Russians, the Saudis and they’d sold our country’s secrets. They’ve sold our country’s decisions.” \\nStone delved into some of the emerging details involving Hillary confidant Huma Abedin previously with Breitbart News: Huma Abedin is Vice Chair of Hillary Clinton’s 2016 presidential campaign. But Huma is more, much more than that. She is the person closest to the most powerful woman in American politics and perhaps the next President. Huma has been described variously as Hillary’s “body woman,” a sort of glorified go-to personal maid, gentle confidant, and by others as an Islamic spy. She may be all of these things, because as we shall see, Huma Abedin has an interesting and complex career history. \\nPolitico and several other Beltway media outlets followed up on Stone’s previous appearance on Breitbart News Daily: “ Trump Ally: Clinton Aide Could Be ‘Terrorist Agent’ ”: In the wake of Sunday’s deadly terrorist shooting in Orlando, Donald Trump’s longtime friend and informal adviser wants the presumptive Republican nominee to hit Hillary Clinton even harder, suggesting the former secretary of state’s top aide Huma Abedin could be a “Saudi spy” or a “terrorist agent.” Only Trump, Roger Stone said on Sirius XM’s “Breitbart News Daily,” will be able to draw the necessary amount of attention to the theories, which have drawn significant blowback from Democrats and Republicans alike. “I also think that now that Islamic terrorism is going to be front and center, there’s going to be a new focus on whether this administration, the administration of Hillary Clinton at State was permeated at the highest levels by Saudi intelligence and others who are not loyal Americans,” Stone said. “I speak specifically of Huma Abedin, the right-hand woman, now vice-chairman or co-chairman of vice—of Hillary Clinton’s presidential campaign.”'"}, "time": 1742564618.2243247}