{"duration": 0.07800126075744629, "input_args": {"text": "'\\nAs USA Supreme first reported U.S. Code is clear Hillary is disqualified to be president! This news was just confirmed by Chris Wallace for Hillary there is no going back.The news that FBI Director James Comey has unilaterally decided to reopen the FBI investigation into Hillary Clinton’s email server is unwelcome news in the Clinton camp. Not only does it give her opponent an incredibly potent talking point, it presents some legal problems for Clinton regardless of the election’s outcome. (you can view the full article below) Whatever emerges from the new emails could cross the line of “intent” that Comey said didn’t exist in July. And as Fox News’ Chris Wallace said to Brit Hume on On the Record on Friday, “We could end up with a president-elect who could, conceivably, be indicted after she becomes president.” Hillary Clinton has stated on many occasions that her candidacy is “historic.” While she’s only talking about her gender, it may be historic for more nefarious reasons. Never before has a candidate from a major political party run for the presidency while under criminal investigation. This is a fact that will go down in the history books alongside the fact that Clinton is the first woman to capture a major party’s nomination for President of the United States. \\nWallace just confirmed USA Supreme news that under U.S. Code Hillary is disqualified from running for president You can view the full article here http://www.usasupreme.com/confirmed-u-s-code-title-18-part-1-chapter-2071-hillary-officially-disqualified-run-president/ \\nPosted by USA Supreme on Sunday, October 30, 2016 Comey’s reopening of the investigation is based on information gleaned from the Anthony Weiner pedophilia investigation. Clinton uber-aide Huma Abedin is married to Weiner (not for long) and their shared computer likely led to the trove of 33,000 emails Hillary Clinton insisted she deleted. It should be noted here that Clinton deleted these emails after the entirety of her emails were requested under a subpoena. In fact, the only people who vetted the information in those 33,000 missing emails were Clinton’s personal lawyers, including Cheryl Mills. Mills received immunity from the FBI with assurances her computer would be permanently destroyed. Should Clinton be indicted, and should she be found guilty of the crime of mishandling classified information – among the other criminal acts she committed as Secretary of State along with her abuse of the Clinton Foundation – we would have a constitutional crisis. US law – 18 US Code § 2071 – states that a violator of this statute: “Shall Forfeit His Office And Be Disqualified From Holding Any Office Under The United States…Whoever, having the custody of any such record, proceeding, map, book, document, paper, or other thing, willfully and unlawfully conceals, removes, mutilates, obliterates, falsifies, or destroys the same, shall be fined under this title or imprisoned not more than three years, or both; and shall forfeit his office and be disqualified from holding any office under the United States.” This would necessarily mean that Clinton, if elected, would have to be impeached in the US House of Representatives, convicted in the US Senate, and then removed from office. That would add another first to Mrs. Clinton’s list of firsts. She would go down in history as one part of the married duo who were both impeached from the presidency. As Wallace said, “Just when you think it couldn’t get any more shocking, any more twisted…” Will Hillary break the law again and keep her security clearance we have to wait and see, but if there is any law in our country she would be disqualified to run for president! '"}, "time": 1742563424.5667398}