{"duration": 0.06058812141418457, "input_args": {"text": "'Sen. Elizabeth Warren ( ) used her time at the podium giving a commencement speech at the University of Massachusetts Amherst to slam the Trump administration and Attorney General Jeff Sessions regarding President Donald’s Trump decision to fire James Comey as FBI director and the Department of Justice’s effort to replace him.[  Warren asked the graduates to become activists for causes and named a few, including animal rescue,   care and “bullying. ” Then she attacked her political opponents, saying, “I can’t help myself. ” “And I have one more: the principle that no one in this country is above the law  —   and we need a justice department not an obstruction of justice department,” Warren said. Warren also told the graduates that big corporations and the wealthy are trying to “fundamentally change” the country and it is up to them to stop it. “Your elected officials are increasingly working only for the few  —   the very wealthy few,” Warren said. “And they are setting policies only to benefit the few  —   the very wealthy few. And if that doesn’t change then this country will fundamentally change. “It is your world, your future that is on the line,” Warren said. Warren also made several references to drinking alcohol during her speech, including mentioning a drinking game named for her, during her   speech. “I understand that every extra minute I speak is that much longer before you can hit the bars,” Warren said. Fortune magazine previewed Warren’s speech by noting that she was on TIME magazine’s list of the 100 most influential people in the world this year and included the statement by the university’s Chancellor Kumble R. Subbaswamy, who called the senator “a strong role model for students. ” “We are inspired by her staunch advocacy for equitable access to education, environmental resource conservation and support for economic justice,” Subbaswamy said in a statement. “These issues are in alignment with our campus’s core values and our long history of activism in pursuit of social justice. ” “At UMass Amherst we stand for the hopes, the ambitions, the bold experiments and the innovative solutions of the people of Massachusetts and the world beyond,” Subbaswamy said. “We share Sen. Warren’s commitment to making a profound, transformative contribution to the common good. ”'"}, "time": 1742628300.4326115}