{"duration": 0.02999091148376465, "input_args": {"text": "'A follower of radical preacher Anjem Choudary is likely to have used his wife’s housing benefits to fund a journey to Syria to join Islamic State terrorists. [Shahan Choudhury, a former suspect in a teenage gang murder who was ‘radicalised’ in prison, disappeared from his London flat at the end of 2015. In 2016, his wife, Mehak, and their three young children, including a baby, joined him.  Mehak had received monthly housing benefit payments of about £1, 000 that she had failed to pass on in rent the month she left for the Middle East, The Sunday Times reports. Shahan Choudhury, of Tower Hamlets, east London, is just one of at least a dozen acolytes of Anjem Choudary to have joined Islamic State, with a further three being placed under antiterrorism controls. The hate preacher was jailed last year for recruiting for the terror group, after twenty years of freely preaching radical Islam in the UK. There are fears, however, that he is now influencing inmates. In 2005, when he was    Shahan Choudhury was charged with the murder of Karl Hamilton, a    hospital worker, allegedly over a £15 drug debt. He was acquitted in 2007, after spending 18 months awaiting trial on remand at Belmarsh   prison in   London, where his family say he was “brain washed”. “He was just like any other western kid when he went in but by the time he came out he was going on about religion and how the kuffar [ ] would all end up in the hellfire,” a relative said. Soon after leaving prison Shana had fallen in with Anjem Choudary and his notorious, marauding group of radicals of the now banned terror group  . Court documents relating to a separate case last summer cite police evidence stating that Choudhury “was believed to be a member of [ ] and had joined [Islamic State] in Syria”. His wife’s most recent tweets order Britons to travel to the Islamic State “caliphate” in Syria and Iraq “or wage jihad by himself w[ith] resources available to him”. Posting under the name Umm Umaarah, she also quotes Isis’s former external attacks chief: “Migrate or fight where u stand. ”'"}, "time": 1742561906.1923676}