{"duration": 0.016127824783325195, "input_args": {"text": "'Using the hashtag #PutObamaUnderOath,   author and political pundit Ann Coulter tweeted that while knowing the truth about Barack Obama’s National Security Advisor Susan Rice allegedly ordering surveillance of President Donald Trump’s presidential campaign aides, Obama should also testify before Congress on the matter. [“Susan Rice testimony now essential, but insufficient,” Coulter tweeted on Tuesday. “Must hear from Obama. ”  Susan Rice testimony now essential, but insufficient.  Must hear from Obama. #PutObamaUnderOath,  —   Ann Coulter (@AnnCoulter) April 4, 2017,  Coulter also suggested in another tweet that Michelle Obama may be able to shed some light on the White House surveillance activities during her husband’s tenure. “I don’t know if what she knows is privileged, but we need to hear from Michelle too,” Coulter tweeted. I don’t know if what she knows is privileged, but we need to hear from Michelle, too. #PutObamaUnderOath,  —   Ann Coulter (@AnnCoulter) April 4, 2017,  Rice allegedly ordered surveillance of Donald Trump’s campaign aides during the 2016 presidential election, and maintained spreadsheets of their telephone calls, the Daily Caller reported. The alleged spreadsheets add a new dimension to reports on Sunday and Monday by blogger Mike Cernovich and Eli Lake of Bloomberg News that Rice had asked for Trump aides’ names to be “unmasked” in intelligence reports. The alleged “unmasking” may have been legal, but may also have been part of an alleged political intelligence operation to disseminate reports on the Trump campaign widely throughout government with the aim of leaking them to the press. The surveillance and spreadsheet operation were allegedly “ordered one year before the 2016 presidential election. ” According to a Fox News report on Monday, former White House aide Ben Rhodes was also involved.'"}, "time": 1742562247.2849233}