{"duration": 0.03189444541931152, "input_args": {"text": "'The U. S. Army Corps will spend more than $1 million to clean up the mess left behind by the Standing Rock Sioux Tribe and others opposed to the Dakota Access Pipeline in North Dakota. The protesters  —   who succeeded in temporarily shutting down pipeline construction under orders from President Barack Obama  —   were evicted after President Donald Trump put the pipeline project back online. [“The corps’ contract with a   company to provide trash removal and environmental cleanup includes the main Oceti Sakowin camp on the north side of the Cannonball River and the smaller Rosebud camp on the south side,” the Bismarck Tribune reported on Friday. “Both are on corps’  property. ”  Despite efforts by the tribe to clean up the protest sites, the land was littered with garbage, and even cars and motor homes had to be removed. “About 240 rollout dumpsters have been hauled out, each brimming with debris of old food stores, structures, tents, building materials and personal belongings, much of it buried under winter blizzards or simply left behind,” the Tribune reported. “Officials are estimating it will require another equal number of loads to get the job done. ” The article said special consideration would be given to some items, such as teepees, that could have cultural significance and toxic materials. Logan Thompson, owner of Prairie View equipment contractor, said his company got instructions on handling human waste and waste compost from health officials. In January, Stand Rock Sioux Tribal Chairman Dave Archambault II spoke out about the clean up after the protest, which was staged because the tribe and others believed a pipeline spill could contaminate the Missouri River and a reservoir, the Tribune reported. “Because of this risk of flood, we’re worried about what’s going to be left at the camp,” Archambault said. “What we want to do is make sure none of that waste gets into the Missouri River .  …     We’re water protectors, but we’re the ones that are going to start contaminating the water. ” “The Dakota Access Pipeline is a   underground state of the art 30” pipeline extending from the   Forks production area in North Dakota to Patoka, Illinois,” according to Energy Transfer Partners, the company responsible for the project. “The pipeline will transport   light, sweet crude oil from North Dakota to major refining markets. ” Other facts about the pipeline include:'"}, "time": 1742628515.2719235}