{"duration": 0.05023050308227539, "input_args": {"text": "'Comments \\nRepublicans have successfully conducted an entire primary and general election without addressing a single key issue on the campaign trail. Now that we’re just days from the election ending, Donald Trump’s campaign has finally addressed climate change – by planning to cut $100 billion dollars in climate change spending, presumably to pay for the ridiculous tax cuts to the rich he proposes. \\nIt’s been days since the Trump campaign policy was unveiled, but the mainstream media hasn’t even noticed. Most major media outlets who consider themselves “objective” are interested in “FBI has become Trumplandia” drama, more than this vitally important policy matter that might actually inform voters. Luckily, Bloomberg noticed and reports : \\nDonald Trump says he would save $100 billion over eight years by cutting all federal climate change spending—a sum his campaign says would be achieved by eliminating domestic and international climate programs. \\n“We’re going to put America first. That includes canceling billions in climate change spending for the United Nations, a number Hillary wants to increase, and instead use that money to provide for American infrastructure including clean water, clean air and safety,” the Republican presidential candidate said Oct. 31 at a rally in Warren, Mich. “We’re giving away billions and billions and billions of dollars,” he said. The Trump campaign did not give a specific tally to account for the $100 billion total in response to a query from Bloomberg BNA. \\nBut in an e-mail, the campaign press office said that the figure combined an estimate of what the Obama administration had spent on climate-related programs, the amount of U.S. contributions to an international climate fund that Trump would cancel, and a calculation of what Trump believes would be savings to the economy if Obama’s and Clinton’s climate policies were reversed. The Trump campaign said the $100 billion total included $50 billion, or what it estimated the Obama administration has spent on programs related to climate change. “Eliminating that spending will save similar amounts over the Trump administration,” it said. \\nTrump and his elected Republican supporters have spent this entire election practicing the art of political distraction by choosing a reality TV clown for President, and it’s worked perfectly on the mainstream media who have ignored actual policy for months, feasting on the high ratings of substantive debates about plagiarism, pussy grabbing and Putin. \\nThis story is important for any voter who’s not sure what you’re getting between the two parties, or torn between a third-party and Democratic nominee Hillary Clinton. While a third-party might promise the moon and the stars, letting Republicans take over the Oval Office with Trump guarantees that climate change efforts will be defunded, quickly. \\nThe first beneficiary of that kind of environmental know nothing-ism would be the Koch Brothers, oil companies and the wealthiest of the wealthy who will get the savings on their tax bills when Trump slashes every form of taxation on the rich to benefit himself and the top 1% of earners. \\nLet your undecided voter friends know about this travesty which must be stopped on November 8th.'"}, "time": 1742562958.691548}