{"duration": 0.06026601791381836, "input_args": {"text": "'Posted on October 26, 2016 by Edmondo Burr in News , UK // 0 Comments In a show of force against Russia, the UK is sending 800 soldiers with tanks and drones to take up a “serious military presence” near Russia’s western border with Estonia. \\nIt comes just days after Russian ships sailed through the English Channel testing British defences on their way to the Mediterranean for possible offensive operations in Syria. \\nInternational tensions are mounting as communications between America and Russia over their operations in Syria break down. \\nThe Daily Express report: \\nBritish soldiers will travel to Estonia in what is one of the biggest build-ups of foreign firepower on Russia’s border since the Cold War. \\nThe move will take place next spring, with Denmark and France also taking part in the huge military exercise. \\nThe project was revealed by Defence Secretary Michael Fallon, who said the UK’s forces will be “fully combat-capable”. \\nHe said: “That battalion will be defensive in nature, but it will be fully combat-capable. \\n“This is about two things: reassurance, and that needs to be done with some formidable presence, and deterrence. \\n“This is not simply a trip-wire. This is a serious military presence.” \\nCold War-style tensions between Moscow and Washington took a further dip this week after the US revealed plans to station marines in Norway – just a few hundred miles from the border with Russia. \\nOfficials in Norway and the US said they were considering a deal for extra equipment and training for the Scandinavian country. \\nRussia has reacted angrily to the plans, saying there was “the absence of threat from Russia to Norway”. \\nMr Putin made a similar show of force last month, when he orchestrated a military evacuation drill including a staggering 40 million people. \\nThe huge four-day “civil defence” drill set alarm bells ringing in Washington and London, with tensions already high over disagreements in Syria. \\nRussia’s Ministry for Civil Defence, Emergencies and Elimination of Consequences of Natural Disaster revealed 40 million civilians, 200,000 emergency rescuers and 50,000 units of equipment were involved in the war game, which ran from October 4 to October 7. \\nAnd last month two RAF jets were scrambled to intercept Russian bombers which had flown threateningly close to British airspace. \\nWhile the two Russian Blackjack bombers did not enter British airspace, authorities were alarmed when they passed to the west of the Shetland Islands. \\nThe Ministry of Defence revealed jets from RAF Lossiemouth and RAF Coningsby were eventually launched as a “precautionary measure”. \\nThe Russian planes, which had travelled from the direction of Norway, then continued their route away from Britain. \\nA similar incident occurred again last, when the RAF were twice forced to scramble jets to intercept Russian bombers. \\nPutin’s aircrafts flew in an “area of interest” off the coast of Scotland on October 12 and October 16, the MoD revealed. This latest development comes amid a massive break-down in communication between America and Russia over their operations in Syria. \\nA spokesman for the US State Department said earlier this month: “Extremist groups will continue to exploit the vacuums that are there in Syria to expand their operations. \\nA spokesman for the US State Department said earlier this month: “Extremist groups will continue to exploit the vacuums that are there in Syria to expand their operations. \\n“This could include attacks against Russian interests, perhaps even Russian cities. \\n“Russia will continue to send troops home in body bags, and will continue to lose resources, perhaps even aircraft.”'"}, "time": 1742563105.508249}