{"duration": 0.04745173454284668, "input_args": {"text": "'We Are Change \\nActress and activist Susan Sarandon formally endorsed the Green Party presidential candidate, Dr. Jill Stein, on Wednesday.\\n\\nIn a letter explaining her endorsement, published on Stein’s website , the former Bernie Sanders supporter listed eleven reasons that she could not support Hillary Clinton. \\nHer letter of endorsement reads as follows: \\nDear Jill and team, \\nI’ve been waiting for any indication that Hillary Clinton’s position on the issues that are most urgent to me, has changed. But … \\nShe does not support the $15 minimum wage. She shows no support for legalizing marijuana. She supports TPP. She has sold fracking and Monsanto. She supports offshore drilling. She has no position on the Dakota Access Pipeline. She opposes the labeling of GMOs. She opposes the breakup of big banks. She takes lobbyists’ money for campaigning. She opposes a binding climate treaty. She supports unconditional military aid to Israel. I’m therefore very happy to endorse Jill Stein for the presidency because she does stand for everything I believe in. \\nIt’s clear a third party is necessary and viable at this time. And this is the first step in accomplishing this end. \\nFear of Donald Trump is not enough for me to support Clinton, with her record of corruption. \\nNow that Trump is self-destructing, I feel even those in swing states have the opportunity to vote their conscience. \\nSusan Sarandon \\nThe actress has been outspoken over her concerns about Clinton’s track record since early on in the primary season. Six months ago, she even publicly asserted that Clinton is “more dangerous” than the Republican nominee. \\n“I believe in a way she is more dangerous,” Sarandon told The Young Turks. “They’re both talking to Henry Kissinger apparently late … She did not learn from Iraq, and she is an interventionist, and she has done horrible things and very callously, I don’t know if she is overcompensating or what her trip is. But that scares me. I think we’ll be in Iran in two seconds. It frightens me.” \\nShe explained that while the media force feeds us fear of Trump to justify a Clinton vote, the former Secretary of State seems to get a pass on her disastrous policies. \\n“This is what we’re fed,” Sarandon continued. “‘He’s so dangerous, he’s so dangerous,’ but seriously I am not worried about a wall being built, he is not going to get rid of every Muslim in this country. Has he made it the norm to be racist and to vent these kind of un-American things? Yes. But seriously, I don’t know what his policy is. I do know what her policies are. I do know who she is taking money from. And I do know that she is not transparent, and I do know that nobody calls her on it,” she said. \\nThe post Susan Sarandon Formally Endorses Jill Stein, Slams Clinton Corruption appeared first on We Are Change .\\n'"}, "time": 1742561959.9126637}