{"duration": 0.13003849983215332, "input_args": {"text": "'After President Donald Trump described former President Barack Obama as a “sick guy,” the former president’s loyal team rose in unison to defend him. [Obama’s office quickly asserted that the president had a “cardinal rule” not to interfere with investigations led by the Department of Justice.  “Enough said,” wrote former White House senior adviser Valerie Jarrett, sharing the statement on Twitter. Trump’s accusations clearly triggered a nerve among former Obama staffers, as many of them spent their weekend battling back the suggestion that their boss engaged in shady tactics to take down Trump. Obama’s former foreign policy spokesman Ben Rhodes sprang into action on Twitter, directing a series of challenges to Trump’s statements. “No President can order a wiretap. Those restrictions were put in place to protect citizens from people like you,” he wrote on Twitter, challenging Trump. He also denounced Trump’s assertion that a lawyer could make a case that Obama was wiretapping his phones. “No. They couldn’t. Only a liar could do that,” he replied. Rhodes appeared disturbed that the pundits had lauded Trump’s speech to Congress earlier in the week, suggesting that they were part of the problem and shaming them for their assessment. “Dear Pundits who lauded his speech. Is it still ‘presidential’ to call your dignified predecessor ‘Bad (or sick) guy! ’” he asked. Rhodes, who famously bragged about creating an “echo chamber” to sell the Iran nuclear deal to the public, was deep in the process of creating a new one as Trump’s claims rocketed through the news. “This isn’t a campaign anymore. WH needs to explain what’s going on with these repeated blatant lies about a matter of justice and natsec,” he wrote. “He’s lying no matter what ‘3 people with direct knowledge’ say. This isn’t he said   he said. Obama did not order a wiretap. That is a fact. ” “This seems ‘nutts,’” Obama’s former campaign chief David Axelrod chimed in on Twitter. “Frantic way in which Donald Trump is kicking up dust only adds to suspicions and the need for full public reckoning. If there were the wiretap Donald Trump loudly alleges, such an extraordinary warrant would only have been OKed by a court for a reason. ” Former Obama speechwriters Jon Lovett and Jon Favreau, who recently launched a “Crooked Media” left wing media outlet, immediately launched a series of snarky messages on Twitter. “They said Trump was presidential on Tuesday,” Lovett wrote on Twitter. “Nixon got weird at night. Trump wakes up angry. ” He directed his angry followers on Twitter to question members of Congress. “Important also to direct your anger at the Republicans in Congress who have enabled and apologized for this awful devious moron,” he wrote. Obama former senior adviser Dan Pfeiffer also questioned Republicans for their failure to denounce Trump’s accusations. “Have any elected Republicans had the courage to speak out against Trump’s deeply, deranged tweets this morning?” he asked. Other Obama staffers were still reacting to initial accusations. “Jesus, I can’t sleep until 8am on Saturday anymore?” complained Favreau\\u200f on Twitter on Saturday. After Obama’s statement was released, Favreau asserted that the former president never denied any wiretapping of Trump Tower, suggesting that Trump was guilty. “I’d be careful about reporting that Obama said there was no wiretapping. Statement just said that neither he nor the WH ordered it,” he wrote. Other staffers reacted with incredulity. “Why would Obama decide close out his presidency by illegally wiretapping a buffoon that everyone thought was going to lose in a landslide?” questioned Tommy Vietor, Obama’s former National Security Council spokesman. Citing a report from CNN’s Jake Tapper asserting that Trump’s claim came from a Breitbart News story, Vietor added,”Jake confirms what we all assumed. Trump shares conspiracies with all the forethought of your crazy uncle on Facebook. ” Favreau quickly slipped into gallows humor as the afternoon wore on. “By tomorrow morning, the party line will be that Obama personally bugged Trump Tower while disguised as the cable guy,” he wrote, and added, “I just learned that Trump robbed a bank. And I have exactly as much evidence for that claim as Trump does that Obama tapped his phone. ” “Wiretap birtherism is not a governing strategy,” Rhodes replied, citing Favreau’s tweet. On Sunday, former White House press secretary Josh Earnest went on ABC’s This Week to deny the allegations and raise more questions about Trump’s involvement in Russia. “The bigger the scandal, the more outrageous the tweet,” he said as he joined the show with Martha Raddatz. Earnest stoked the fires of speculation surrounding Trump’s campaign communications with the Russians. “It is almost like a Russian novel to try to keep up with all these conversations,” Earnest said, citing multiple incidents of Trump campaign officials coming into contact with representatives of the Russian government. When pressed for details about the investigation, Earnest feigned ignorance, pointing out that he was “not aware” of any details but repeated that Obama did not meddle with the investigation. “Here’s the simple answer to that question, is, Martha, I don’t know and it’s not because I’m no longer in government,” he said. “The fact is, even when I was in government, I was not in a position of being regularly briefed on an FBI criminal or counterintelligence investigation. ” But as the day wore on, the team appeared increasingly frustrated that Trump’s narrative was taking hold. “Needs to be repeated: this is not he     it’s   Obama didn’t do what Trump said. Trump lied about it and offered no proof,” Rhodes urged on Twitter. “[F]or the MILLIONTH TIME, the White House doesn’t interfere in independent investigations,” Favreau complained in response to the former United States director of National Intelligence’s denial of the existence of a wiretap on Trump Tower in an interview on Meet the Press. The group, who maintained discipline during the Obama administration, appeared to enjoy their new found freedom to defend their boss and detract from his successor. The squad began cynically floating their own conspiracy theories with a thread of gallows humor. “What did you know and when did you know it about Trump lying about where Obama was born, when he founded ISIL, ordering wiretaps?” Rhodes joked to Favreau, who promoted his upcoming podcast about the fiasco. Citing a claim from Trump’s former campaign manager Cory Lewandowski, Rhodes mockingly added that “the Easter Bunny and Tooth Fairy” joined Obama by listening into a meeting between the Russian ambassador and Sen. Jeff Sessions. “Remember that time Valerie and I took the space shuttle to the moon to get the forged birth certificate?” he wrote to Favreau and Feiffer. “Do you even know how many Mass voters I drove to NH on Election Day?” replied Favreau, citing another one of Trump’s claims of voter fraud. “Don’t tell anyone, but I worked with Ted Cruz’s dad to kill JFK,” joked Feiffer. “My last act on the job was using massive amounts of Iranian invisible ink to make Trump inauguration crowds disappear,” Rhodes continued.'"}, "time": 1742564247.2820783}