{"duration": 0.1111605167388916, "input_args": {"text": "'ROME  —   Excavations that unearth some artifact or another are common enough in Rome, but archaeologists monitoring a building restoration were taken aback when they found 38   skeletons that they believe were once buried in the   Campus Iudeorum, or Field of the Jews. Scholars knew that Jews were buried in the Trastevere neighborhood of Rome from 1363 to 1645, when the cemetery was moved to make room for new city walls, but the recovery of the remains was the first tangible sign  —   at least in recent times  —   of one section of the burial site near the Tiber River. “We didn’t understand who the skeletons could have belonged to at first,” because there were no markers to explain their provenance, said Daniela Rossi, an archaeologist who oversaw the dig, which began six years ago when work began on the renovation of a building from the early 20th century. So the archaeologists scrutinized historical maps showing the cemetery, and, using carbon dating technology, they estimated that the skeletons were from the   to the   century, which also coincided with the dates the cemetery existed. Except for two women who were buried wearing gold rings, and a man buried with a scale, the corpses had been buried without funerary goods, “which is typical of Jewish funerary practices,” Ms. Rossi said. Further proof came via a fragment of travertine marble found nearby with Hebrew writing unmistakably associated with a cemetery. “The characters read ‘here lies,’” said Alessio De Cristofaro, one of the archaeologists involved in the excavation. “All the elements converged to identify this as the Campus Iudeorum. ” Jews first came to Rome in the second century B. C. and for centuries many inhabited the Trastevere neighborhood, said Claudio Procaccia, the director of the culture department for the Jewish Community of Rome. Though Jews were forcibly confined to a ghetto under Pope Paul IV in 1555, living in overcrowded and unhygienic conditions in a constantly flooding area on the opposite side of the river from Trastevere, in previous centuries “the condition of Jews in Rome was more acceptable than in other cities,” Mr. Procaccia said. In 1645, when Pope Urban VIII built new city walls, the cemetery was moved to the Aventine Hill, where Jews were buried until 1934. Tombs were upended during the construction of the walls, but the cemetery may already have been despoiled after Urban VIII in 1625 decreed that Jews had to be buried in unmarked graves, while   gravestones had to be destroyed. The skeletons showed signs of malnutrition, but Ms. Rossi said that such malnourishment was typical of   citizens of the time, regardless of their religion. Trastevere was once a seaport, and was mostly populated by artisans, traders, and warehouse hands of different religions and communities, “a working class that worked physically and subsisted on a   diet,” she said. The excavation was documented and the skeletons will be entrusted to Rome’s Jewish community, which will “bury them in more correct form or, say, manner,” Mr. Procaccia said. As archaeologists dug deeper, they also found the monumental foundations of tanneries  —   the   Coraria Septimiana  —   built in the third century by the emperor Septimius Severus to equip the Roman Army, as well as various artifacts and animal bones.'"}, "time": 1742564603.210685}