{"duration": 0.031831979751586914, "input_args": {"text": "'Posted on October 31, 2016 by Carol Adl in News , US // 0 Comments \\nThe United Nations and Amnesty International have both announced that they are sending officials to investigate allegations of human rights violations at the site of the Dakota Access Pipeline at the Standing Rock Sioux Reservation in North Dakota. \\nAccording to a UN press release expert Grand Chief Edward John was due to arrive at Standing Rock on Saturday 30th October to gather information on human rights violations RELATED CONTENT UN Panel Warns About Israel & Saudi Arabia’s Human Rights Violations \\nGrand Chief Edward John has been an Indigenous expert member of the UNPFII from North America for the past six years. \\nAs a UN expert, he will be visiting in his official capacity to observe the continued impacts of the Dakota Access Pipeline (DAPL) construction such as threats to water, treaty rights and sacred areas. \\nHe will also collect information and testimonies on the escalating levels of repression, violence and intimidation against tribal members and their supporters by state law enforcement, private security and the National Guard. Roberto Borrero representing the International Indian Treaty Council (IITC) will accompany him as a human rights observer. IITC Board member William Means of the Oglala Lakota Nation is already on site. \\nInquisitr reports: \\nAmnesty International announced Friday that they were sending a delegation of human rights observers to monitor the response of law enforcement against DAPL protesters after concerns mounted about increasingly violent actions towards the peaceful protesters. “A Shameful Moment for This Country”: Report Back on Militarized Police Raid of DAPL Resistance Camp https://t.co/grje8XIA3N pic.twitter.com/mzDNDDy7tS \\n— Democracy Now! (@democracynow) October 28, 2016 \\n\\nPolice have responded to protesters in some instances with pepper spray, bean bags, and other controversial means, and used private security staff with guard dogs in one confrontation with protesters that included women and children. Amnesty International also reports that those recently arrested have reported being strip searched and forced to pay bail for minor offenses. \\nMembers of the media and legal observers have also been arrested or charged with minor offenses. The arrest of journalists and filmmakers covering the #DAPL is a threat to democracy #StandWithAmy \\n— Sam Praus (@SamanthaPraus) October 17, 2016 \\nAmnesty International sent a letter to the Morton County Sheriff’s Department expressing concern about the degree of force used against the protesters and is calling on the Department of Justice to investigate the police practices being used against them. \\n“Arrests of protesters, who call themselves water protectors, have increased in recent weeks and law enforcement has employed a more militarized response to protests and encampments near the construction site of the Dakota Access Pipeline.” The international human rights agency sent a delegation of observers to the area in August. They report that they have stayed in contact both with members of the Standing Rock community and those policing the protests since then. Live from #StandingRock #NoDAPL prayer ceremony/drum circle on road blocked by police for DAPL workers- making clear who they serve&protect pic.twitter.com/tD3iUzcm3g \\n— NYC Revolution Club (@NYCRevClub) October 29, 2016 *'"}, "time": 1742628489.8895805}