{"duration": 0.04250383377075195, "input_args": {"text": "'Halloween and The One World Religion The Meaning of Halloween \\nChristian fundamentalism is a ‘malignant form of Christianity’ more dangerous than Islamic terrorism, scholar says – The Blaze \\nA humanist scholar has declared Christian fundamentalism more dangerous than Islamic terrorism, the Chicago Maroon reported. \\nCatherine M. Wallace, an author and faculty member at Northwestern’s Feinberg School of Medicine, told an audience last week near the University of Chicago that a Christian fundamentalist “in control of nuclear codes was a much, much greater threat” than Islamic terrorists who “need to put bombs on their own children and send young men in to kill themselves” in order to “blow up a concert,” the paper said. \\nWallace — a historian and “Christian humanist,” the Maroon said — noted that Christian fundamentalism has roots in the American South: “The religious right in its most contemporary form has an origin in Southern opposition to desegregation and to the Civil Rights Movement … a transparently racist appeal.” \\nShe added that radicalism comes from a literal interpretation of the Bible. “Nobody in the ancient world would have read the Bible literally,” she said, the Maroon reported, adding that a literal reading of scripture is a modern construct. \\n“Christian fundamentalism is a malignant form of Christianity,” Wallace said, \\nChristian Fundamentalism – Collins English Dictionary states, “Is the belief that every word of the Bible is divinely inspired and therefore true and advocates strict adherence to the fundamental principles of that set of beliefs. \\nJesus and the Apostles would be considered fundamentalists. \\nJohn 8:24 Jesus said, “I said therefore unto you, that ye shall die in your sins: for if ye believe not that I am he, ye shall die in your sins.” \\nJohn 10:1, “Verily, verily, I say unto you, He that entereth not by the door into the sheepfold, but climbeth up some other way, the same is a thief and a robber.” \\nActs 4:12, “Neither is there salvation in any other: for there is none other name under heaven given among men, whereby we must be saved.” \\nIn 2016, I am a fundamentalist. I believe that the Bible is the word of God, that it is the absolute truth and that it requires strict adherence to the doctrines taught in the Bible to be saved. \\nMatthew 24:3-4, “And as he sat upon the mount of Olives, the disciples came unto him privately, saying, Tell us, when shall these things be? and what shall be the sign of thy coming, and of the end of the world?” \\nIn response to this question, the first words out of Jesus’ mouth were, “…Take heed that no man deceive you.” \\nNever forget: “A strict adherence to the doctrines taught in the Bible is absolutely essential for salvation.” Join the Conversation'"}, "time": 1742561806.736555}