{"duration": 0.15884804725646973, "input_args": {"text": "'Good morning.  Here’s what you need to know: • A South Korean court announced the arrest of the de facto leader of Samsung, Lee   on bribery accusations connected to the corruption scandal that had engulfed the government. Above, Mr. Lee as he arrived at a detention center ahead of the court’s decision. Prosecutors say Samsung paid almost $38 million to groups connected to a presidential friend and adviser, Choi   to win the government’s backing for a merger of two Samsung units. _____ • The crisis facing the White House over questions about its connections to Russia made for an awkward inaugural trip abroad for Secretary of State Rex W. Tillerson. Conventional joint statements with the Russian foreign minister, Sergey V. Lavrov, at a   gathering in Germany could not overshadow the growing distance with European counterparts on immigration, refugees, defense and trade. In Washington, President Trump held a news conference that turned into an extraordinarily raw   bemoaning “the false, horrible fake reporting” on his administration. Here’s the video. _____ • Mr. Trump’s plans to have Stephen A. Feinberg, above, a billionaire investor with no intelligence experience, review the U. S. intelligence agencies has the agencies’ top officials on edge. They were already worried by Mr. Trump’s response to reports of contacts over the last year between Trump aides and Russian intelligence officials: trying to focus public attention on the source of intelligence leaks rather than their content. Today’s episode of The Daily podcast asks, did the Trump campaign collude with Russia? Listen from a computer, on an iOS device or on an Android device. _____ • The investigation into the apparent assassination of  the half brother of North Korea’s leader Kim   is widening. The Malaysian police detained two more people  —   a woman with an Indonesian passport, above, and her Malaysian boyfriend  —   and said they were looking for four male suspects. Airport surveillance images showed how one suspect ended up waiting at a taxi stand. Mr. Kim’s body is expected to be sent to North Korea. It’s not clear whether the Malaysian autopsy results will be made public. _____ • In environmental news, a Greenpeace report tied the toxic waves of air pollution sweeping northern China to an increase in already excessive steel production last year, made counter to promised cuts. Scientists are also coming to understand the crucial importance of the vast, and endangered, seagrass meadows that surround every continent except Antarctica. And Mr. Trump’s nominee to head the Environmental Protection Agency, Scott Pruitt, heads to a confirmation vote today amid an extraordinary wave of protest from former E. P. A. staff members. _____ • Snapchat’s parent company is aiming for a valuation of more than $20 billion as it nears what’s expected to be the biggest initial public offering in the tech world since Alibaba and Facebook. • Speaking of Facebook, Mark Zuckerberg posted a   update of his founder’s statement that expressed alarm over growing rejections of globalism and argued that “progress now requires humanity coming together not just as cities or nations, but also as a global community. ” • Asian financial conglomerates, including SoftBank of Japan or HNA Group of China, are scouring the U. S. for management expertise to help them invest their cash stockpiles. • European markets ended a   rally. Here’s a snapshot of global markets. • The Islamic State claimed a suicide attack on a dance celebration at a Sufi shrine in Pakistan’s Sindh Province that killed at least 70 worshipers and injured more than 250. It was the worst act of terrorism in the country in months. [The New York Times] • ISIS also claimed the deadliest attack in Baghdad in at least a month, a car bombing in a crowded Shiite Muslim neighborhood that killed more than 50 people and injured scores. [The New York Times] • The Catholic Church in Australia has paid more than $200 million in compensation, treatment, legal and other costs in sexual abuse cases since 1980, according to information presented to a government investigation. [BBC] • In China, a    ethnic Korean faces prison for criticism of the authorities that included posting a photo of himself in a   calling President Xi Jinping “Xitler. ” [The New York Times] • Tens of thousands of nomadic herders in Mongolia face hunger and another bout of the extreme winter conditions known as a “dzud. ” [Reuters] • South Africa is debating whether a minimum wage of about $1. 50 an hour would help reduce poverty and inequality or worsen already high unemployment. [The New York Times] • The cute Kumamon stuffed bear racked up more than $1 billion in sales last year, partly thanks to a surge of supportive purchases after its home prefecture, Kumamoto, was struck by earthquakes. [The Asahi Shimbun] • Cake for breakfast? Yes, please. • A cat named Tammany was living at New York’s City Hall in the 1930s. Then came talk of eviction proceedings  —   but the cat emerged victorious. • Recipe of the day: End the week with these simple fish tacos. • For 17 years, Hugh Jackman has been synonymous with Wolverine, a mutant with a metal skeleton and a tormented past. But the Australian actor may be popping the  ’s adamantium claws for the final time. • In Taipei, a growing number of restaurants are riding the “eat local” movement. That can mean cured mullet roe, lily stems, purple taro and honeycombed pong tang (that’s candy). • Ready for “cutthroat” golf? This week in Australia, the Perth World Super 6 is debuting a format  —   a   last round, with match play and a special hole  —   to adapt the sport to changing times. Happy Birthday to Michael Jordan. The basketball legend turns 54 today. He won’t be competing at this weekend’s N. B. A.   dunk contest, but three decades ago he helped elevate the competition with   slams from the   line. Jordan’s seemingly effortless flights to the basket made him one of the most instantly recognizable faces in the world. Years later, he even managed to dunk from   in the partly animated movie “Space Jam. ” C. G. I. though, wasn’t needed in 1984 to capture Jordan leaping, legs in an airborne split. “It may be the most famous silhouette ever photographed,” Time Magazine said as it designated the image one of the 100 most influential of all time. The image lives on as the inspiration for the logo of Nike’s Air Jordan shoes. Jordan, who is now a billionaire, and his brand have thrived despite his lackluster second career in baseball, criticism over his reluctance to discuss politics (though he spoke last year about police brutality) and the popularity on social media of the Crying Jordan meme, which our culture writer says “takes one of America’s biggest sports stars and makes him small. ” “Michael actually thinks it’s funny,” his spokeswoman said. Des Shoe contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742564622.779351}