{"duration": 0.09578752517700195, "input_args": {"text": "'While former aides to President Obama and members of Hillary Clinton’s presidential campaign predictably panned President Donald Trump for firing James Comey as FBI director, it was only a few months ago that Clinton’s campaign repeatedly alleged wrongdoing by Comey over his investigation into Clinton’s use of a private email server. [And last October, Obama’s former attorney general, Eric Holder, signed his name to a letter circulated by Clinton’s campaign strongly criticizing Comey’s decision to publicize aspects of the FBI investigation, alleging Comey’s moves were inconsistent with FBI protocol.  In late October, less than two weeks before the presidential election, Comey informed key members of Congress that the FBI was reviewing additional emails that may have been relevant to the Clinton probe. This after emails were reportedly discovered on the personal devices of disgraced former Congressman Anthony Weiner, the estranged husband of   top Clinton aide Huma Abedin. At the time, Clinton’s campaign circulated the   letter, signed by Holder as well as nearly 100 former federal prosecutors and   Department of Justice officials. The letter stated: “Many of us have worked with Director Comey all of us respect him. But his unprecedented decision to publicly comment on evidence in what may be an ongoing inquiry just eleven days before a presidential election leaves us both astonished and perplexed. ” ABC News reported on the letter: The authors of the letter said they were “moved” to speak out publicly because Comey’s action violated “settled” DOJ tenets. Justice Department officials are instructed to refrain from commenting publicly on pending investigations except in “exceptional circumstances,” as well as to “exercise heightened restraint near the time of a primary or general election,” said the letter. “We cannot recall a prior instance where a senior Justice Department official —   Republican or Democrat —  has, on the eve of a major election, issued a public statement where the mere disclosure of information may impact the election’s outcome, yet the official acknowledges the information to be examined may not be significant or new,” they wrote. The nearly 100 former DOJ officials who signed on to the letter wrote that Comey’s letter to Congress was inconsistent with prevailing department policy and that it broke with longstanding practices followed during past elections. “Perhaps most troubling to us is the precedent set by this departure from the Department’s     traditions,” they wrote. After Comey renewed the email probe in late October, Clinton herself called the FBI chief’s actions “deeply troubling. ” “It is pretty strange,” she said. “It’s pretty strange to put something like that out with such little information, right before an election. In fact, it’s not just strange it’s unprecedented and it’s deeply troubling. ” Clinton’s campaign chairman, John Podesta, said Comey had “not been forthcoming with the facts. ” However, now that Trump has fired Comey, with administration officials citing Comey’s handling of the Clinton email investigation, former Obama aides and Clinton officials claim to be dismayed. Deputy Attorney General Rod J. Rosenstein clarified the firing in a letter, writing, “I cannot defend the director’s handling of the conclusion of the investigation of Secretary Clinton’s emails. ” Yet Sen. Tim Kaine, Clinton’s running mate, claimed the firing was about the Russia investigation. “Trump firing Comey shows how frightened the Admin is over Russia investigation,” Kaine tweeted in response to the news. “Comey firing part of a growing pattern by White House to   the truth. ” Trump firing Comey shows how frightened the Admin is over Russia investigation,  —   Senator Tim Kaine (@timkaine) May 9, 2017,  Robby Mook, Clinton’s campaign manager, released the following statement: I was as frustrated, concerned and disappointed as anyone with Director Comey’s handling of the email investigation, but President Trump just fired the man investigating how Russia meddled in our election and whether members of his campaign were involved, an investigation President Trump called a “charade” only 24 hours ago. It’s equally concerning that our attorney general, who lied about his own meetings with the Russians, approved Director Comey’s firing. Clinton’s press secretary, Brian Fallon, tweeted, “I’m not shedding any tears for Comey personally  —   he hurt the FBI’s reputation  —   but I do worry whether we ever get to the bottom of Russia now. ” Former aides to Obama also claimed Trump fired Comey over the Russia investigation. “This should not be sugarcoated. Firing Comey is up there in terms of the scariest things Trump has done,” former Obama White House Communications Director Jen Psaki wrote on Twitter. Former Obama National Security Adviser Ben Rhodes expressed concern: “This is not normal. This is not healthy for a democracy. The fixed 10 year term for an FBI Director exists to prevent   …     this,” he wrote. “This justification several months into this Administration is just completely and insultingly unbelievable. ” Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. With research by Joshua Klein.'"}, "time": 1742562458.5844705}