{"duration": 0.10104036331176758, "input_args": {"text": "'WASHINGTON  —   The Supreme Court ruled on Monday that evidence found by police officers after illegal stops may be used in court if the officers conducted their searches after learning that the defendants had outstanding arrest warrants. Justice Clarence Thomas, writing for the majority in the    decision, said such searches do not violate the Fourth Amendment when the warrant is valid and unconnected to the conduct that prompted the stop. Justice Thomas’s opinion drew a fiery dissent from Justice Sonia Sotomayor, who said that “it is no secret that people of color are disproportionate victims of this type of scrutiny. ” “This case tells everyone, white and black, guilty and innocent, that an officer can verify your legal status at any time,” she wrote. “It says that your body is subject to invasion while courts excuse the violation of your rights. It implies that you are not a citizen of a democracy but the subject of a carceral state, just waiting to be cataloged. ” The case, Utah v. Strieff, No.   arose from police surveillance of a house in South Salt Lake based on an anonymous tip of “narcotics activity” there. A police officer, Douglas Fackrell, stopped Edward Strieff after he had left the house based on what the state later conceded were insufficient grounds, making the stop unlawful. Officer Fackrell then ran a check and discovered a warrant for a minor traffic violation. He arrested Mr. Strieff, searched him and found a baggie containing methamphetamines and drug paraphernalia. The question for the justices was whether the drugs must be suppressed given the unlawful stop or whether they could be used as evidence given the arrest warrant. “Officer Fackrell was at most negligent,” Justice Thomas wrote, adding that “there is no evidence that Officer Fackrell’s illegal stop reflected flagrantly unlawful police misconduct. ” Chief Justice John G. Roberts Jr. and Justices Anthony M. Kennedy, Stephen G. Breyer and Samuel A. Alito Jr. joined the majority opinion. In a dissent that cited W. E. B. Du Bois, James Baldwin and   Coates, Justice Sotomayor said the court had vastly expanded police power. “The court today holds that the discovery of a warrant for an unpaid parking ticket will forgive a police officer’s violation of your Fourth Amendment rights,” she wrote. “Do not be soothed by the opinion’s technical language: This case allows the police to stop you on the street, demand your identification and check it for outstanding traffic warrants  —   even if you are doing nothing wrong. “If the officer discovers a warrant for a fine you forgot to pay,” she continued, “courts will now excuse his illegal stop and will admit into evidence anything he happens to find by searching you after arresting you on the warrant. ” Justice Sotomayor added that many people were at risk. Federal and state databases show more than 7. 8 million outstanding warrants, she wrote, “the vast majority of which appear to be for minor offenses. ” There are, she added, 180, 000 misdemeanor warrants in Utah. And according to the Justice Department, about 16, 000 of the 21, 000 residents of Ferguson, Mo. are subject to arrest warrants. Justice Ruth Bader Ginsburg joined most of Justice Sotomayor’s dissent, along with all of a separate dissent from Justice Elena Kagan. But Justice Sotomayor reserved her most personal reflection for a part of her dissent in which she wrote only for herself, setting out in detail the dangers and indignities that often accompany police stops. “For generations,” she wrote, “black and brown parents have given their children ‘the talk’  —   instructing them never to run down the street always keep your hands where they can be seen do not even think of talking back to a stranger  —   all out of fear of how an officer with a gun will react to them. ” “We must not pretend that the countless people who are routinely targeted by police are ‘isolated,’” she wrote. “They are the canaries in the coal mine whose deaths, civil and literal, warn us that no one can breathe in this atmosphere. They are the ones who recognize that unlawful police stops corrode all our civil liberties and threaten all our lives. Until their voices matter, too, our justice system will continue to be anything but. ” Justin Driver, a law professor at the University of Chicago, said Justice Sotomayor’s dissent was remarkable. It is, he said, “the strongest indication we have yet that the Black Lives Matter movement has made a difference at the Supreme Court  —   at least with one justice. ”'"}, "time": 1742563661.1516705}