{"duration": 0.04734539985656738, "input_args": {"text": "'October 26, 2016 - Fort Russ -  Antifashist - translated by J. Arnoldski -  \\n\\n\\nRussia’s permanent representative to the UN, Vitaly Churkin, is sure that the bloodshed in South-East Ukraine could be avoided if the country’s authorities apologized to the population of the DPR and LPR like Verkhovna Rada deputy Nadezhda Savchenko proposed. \\nThe Russian diplomat said this in commenting on the statement of the Verhkovna Rada’s vice speaker, Irina Gerashchenko, made at a meeting of the UN Security council in which the Kiev representative once again accused Russia of aggression against Ukraine. In addition, the Ukrainian politician called Savchenko “the most famous prisoner of the Kremlin freed in exchange for military personnel from the Russian Army.” \\n“In her speech, Ukraine’s representative mentioned Nadezhda Savchenko. After being pardoned, she returned to her homeland where she stated that Kiev should apologize to the residents of Donetsk and Lugansk. It is a pity that Ukrainian authorities don’t have enough humanity or political courage to do so,” Churkin said. \\nAccording to Churkin, the inter-Ukrainian crisis would have been resolved long ago if Kiev didn’t attempt time and time again to change the Minsk Agreements. He stressed: “There would have been no conflict in Donbass if Kiev had not opted for armed suppression of the dissent that arose after a coup backed by foreign forces was carried out in the country.”  \\n\\nRussia’s UN representative added that for two years already “Ukrainian security forces have shelled residential areas of Donetsk and Lugansk, as a result of which civilians, including women and children, have been killed.” He referred to the UN High Commissioner for Human Right’s report on abductions and torture to which Ukrainian forces have subjected women. \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742563472.9875064}