{"duration": 0.031720876693725586, "input_args": {"text": "'Times columnist and author India Knight has called for the assassination of U. S. President, Donald J. Trump. [During a   invective against the newly inaugurated President on Twitter in which Knight called Mr. Trump a “moron,” “mad,” “needy,” and an “arse,” among other things, before telling him to “shut up,” she mused, “The assassination is taking such a long time”:  The assassination is taking such a long time.  —   India Knight (@indiaknight) January 28, 2017,  Knight’s attitude is directly   with the British media class, many of whom she has cheered on via Twitter over the last few days. Watching the joint press conference held by Mr Trump and the British Prime Minister Theresa May, in which they heralded a rebooting of the Special Relationship between their two countries, Knight retweeted a post by Buzzfeed political editor Jim Waterstone which implied that the American Secret Service were so incompetent that they couldn’t understand the British conventional way of rendering dates into numerical format (  ). Another from fellow Times journalist Hugo Rifkind highlighted that the British press had use the question and answer session to call Trump a racist and a liar. British press corp is locked outside the White House because our birthdates were submitted in UK format and secret service don’t get it.  —   Jim Waterson (@jimwaterson) January 27, 2017,  Two questions in, the British press have so far called Trump a racist and a liar.  —   Hugo Rifkind (@hugorifkind) January 27, 2017,  Knight herself also cheered on the BBC’s Laura Kuenssberg, who used her question during the QA to attack Mr Trump in such a manner that he was moved to respond, “That was your question? There goes that relationship!” Knight tweeted “Go @bbclaurak! [Kuenssberg]” followed by “I love the British press”.  Go @bbclaurak!  —   India Knight (@indiaknight) January 27, 2017,  I love the British press.  —   India Knight (@indiaknight) January 27, 2017,  She later   posts from British journalists celebrating forcing the Prime Minister to respond to demands from the British press pack to condemn the President’s decision to pause immigration from some   countries.  But Knight’s opposition to Mr Trump  —   and in particular her call for his assassination  —   has not gone down well with fellow Twitter users.  Members of the public tweeted back to call her a “horrible person” and a “psychopath” for wishing death on anyone, while one person mused that she was typical of   “tolerant” liberals. @HeimishCon @indiaknight if the only way to get your way, involves murder, you might be a psychopath,  —   existino (@existino) January 29, 2017,  @indiaknight Wow.  You have a different opinion than someone so wish them dead?  What a horrible person you are.  —   Aidan (@engcricketfan75) January 28, 2017,  @indiaknight Just another peace loving, tolerant liberal. Nothing to see here.  —   Mark (@n7gooner72) January 29, 2017,  Others noted that they had reported her Tweet to the authorities and to Twitter. A number of people have been jailed in the past for tweeting abusive messages most notably student Liam Stacey who in 2012 was jailed for 56 days for tweeting racist comments while drunk  —   a sentence which the judge said must be imposed due to the level of “public outrage”. Knight’s comment comes days after a German newspaper editor suggested on television that “murder in the White House” could be a way to end the “Trump catastrophe”.'"}, "time": 1742628605.3219342}