{"duration": 0.1683647632598877, "input_args": {"text": "'shorty By Darío Mizrahi T homas Sankara was a young communist officer who attempted to take Burkina Faso out of the neocolonial orbit of France, but was murdered by his closest comrades. During Sankara’s short time in power, Burkina Faso became self-sufficient in grains. “He was the first to forbid female genital mutilation, and included women in all realms of public administration.” His killer, Blaise Compaoré, ruled for 27 years, until run out of the country in 2014 . This article previously appeared in The Dawn [3] . “He created the Communist Officers’ Group, which overthrew the government on November 7, 1982.” Earlier this month, Burkina Faso began to exhume the remains of the leader that founded the country in 1984. They seek to reveal the murderous conspiracy that ended his life, after four years of leading a revolutionary government. Thomas Isidore Noël Sankara was born on December 21, 1949 in what is known today as Burkina Faso, but was then still a French colony called Alta Volta . When he finished secondary school, at 19, he began a prolific military career that would be inextricably linked to politics. Just 14 years later, Sankara made a coup d’état through armed struggle and an overwhelming support from the population and assumed the leadership of the country. Back then, he was already a symbol throughout the continent. Thanks to a combination of charisma, courage and intelligence and his undoubtedly revolutionary convictions, the world began to talk about “African Che Guevara.” Just like the Argentine guerrilla, he had an early, tragic death, due to the betrayal of his closest comrade. Now, 28 years after his murder, and after the work to exhume his remains began, to unveil his mysterious end, Infobae interviewed Spanish writer Antonio Lozano, one of the most notorious experts on the Burkinese leader. As a corollary to his investigations, in 2006 he published The Sankara Case (Almuzara Ed), a novel that combines historical accuracy with fiction to retell his eventful life and tragic murder. The creation of a revolutionary leader “Sankara wanted to be a doctor, but his family was poor and his only option if he wanted to study was to attend a military academy. He was a Christian and that was always a part of his ideology,” Lozano says. “Surprisingly, at the time many of the professors of the military academy were Marxists”, Lozano explained, “so there he came into contact with these ideas. When he finished the first level of studies, his good grades allowed him to train as an Official of the Army in Madagascar, a country where there were constant popular revolts”. When he returned to Alto Volta, Sankara had strong convictions and thought that it was essential to break with the colonial oppression of his nation, which was one of the poorest of the planet. They sent him to the city of Pô, where his military and political career began. He had soldiers under his command which he taught his ideas. And on the other hand he worked with the poor people of the city and earned their respect and admiration. “When he went to Rabat, Morocco, to take a course he met Blaise Compaoré, who became a great friend and comrade-in-arms of his, and who would later do the revolution with him. When he returned to Alto Volta, he participated in a short war against Mali, where he shined for an incursion he did with his men and made him famous and praised by the population,” the historian says. “Sankara had strong convictions and thought that it was essential to break with the colonial oppression of his nation, which was one of the poorest of the planet.” I n 1981, he was appointed Secretary of Information of the State. But six months after, he announced his resignation in an explosive press conference, in which he denounced the authoritarianism of the government and the attempts to “put a gag on the people.” This consolidated his fame as one of the most notorious figures of the country. He had created, together with Campaoré and other members of the Armed Forces, the Communist Officers’ Group. This group overthrew the government on November 7, 1982, and appointed a new President: Jean-Baptiste Ouédraogo. Sankara was appointed Prime Minister in January 1983. “Muammar Khadafi, who was already governing Linya and was one of the biggest figures of Arab socialism at the time, invited him to his country and considered him a comrade. At that time, every rally he held in Alto Volta was attended by thousands.” But France wouldn’t have this. “Due to the pressure of France and the right-wing coalition that was still in the government, he was imprisoned”, Lozano recounts. “So Compaoré and his allies started to act” to get him released, and “with the help of mass mobilizations of the Burkinese people”, they recovered Sankara from the claws of the metropoli. In August 4, 1983, they took the power through armed struggle. At 33, he was appointed president and the Sankara’s Revolution began. The foundation of a new country “He created a revolutionary process that was unheard of in Africa. On August 4, 1984, he changed the name of Alto Volta to Burkina Faso, which means “Land of the Honest People” which reflects his struggle against corruption, an endemic disease of African governments. He lead by example: he continued earning the same amount he made as Captain of the Army, sold all of the expensive cars owned by the state and adopted as official vehicle the cheapest car in the market, the Renault 5.” He decreased the salaries of all public officers, forbade the use of chauffeurs and mandated that all ministers had to travel in tourist class. He also stood against nepotisms and didn’t allow family-members to work for the state. His austerity was a characteristic that defined him until his death. “At the time he was murdered, his only possessions were a mortgaged house and three bikes” Lozano says. The other main axis of his administration was the incentive to education and culture. “In a single year, the alphabetization rate went from 12 to 36%, and it kept raising thanks to the rural schools he created throughout the country.” He also made great advances in health. He created vaccination commands that in just a few months immunized almost all Burkinese children against infectious diseases that were causing great harm. “At the time he was murdered, his only possessions were a mortgaged house and three bikes.” B ut the greatest revolution he led was the one in favor of women’s rights . He was the first to forbid female genital mutilation. He promoted the celebration of March 8 and included women in all realms of public administration. In the economic aspect, “he made an agrarian reform that redistributed land and gave out fertilizers and seeds to peasants, and created small dams. Through this, he managed to make Burkina Faso one of the few countries of the region to acquire self-sufficiency in the cereal supply, which is the base of the population’s diet.” Sankara knew that in order to be able to implement his agenda of reforms, he had to achieve “economic independence” for the country. This led him to confront the international financial system, and particularly the French one. Despite the declaration of independence, the country was still heavily tied to its former metropoli. The refusal to pay the external debt, which had been taken by previous governments, was one of his main measures. “In his last big speech, which he gave in September 1987 in the context of the General Assembly of the African Union, he defended these ideas once again and said that if they didn’t stand with him, he wouldn’t be there the following year. And, in fact, he didn’t live to see the 1988 assembly,” the biographer said. “He said that the only one with the ability to kill him was Blaise Compaoré, because he knew him better than anybody else.” S ankara had made powerful enemies, both inside and outside the country. “He saw the end coming. In an interview he gave 15 days before his death to a newspaper from Belgium, when they asked about potential conspiracies he said that the only one with the ability to kill him was Blaise Compaoré, because he knew him better than anybody else. His circle told him several times to cut him off because he was a threat. But his answer was always the same: he was like a brother.” Compaoré disagreed with many of Sankara’s policies, especially with the ones that restricted the acts of public officers. On October 15, 1987, an armed group entered Thomas Sankara’s office while he was in a meeting with the 12 members of the National Council of the Revolution. Sankara, who was 37 at the time, was murdered along with the rest of the attendants. Simultaneously, Compaoré made a coup d’état and became the President of Burkina Faso. He stayed in power for 27 years, until mass revolts forced him to flee the country in 2014. Source URL: http://blackagendareport.com/thomas_sankara_murdered_29_years_ago'"}, "time": 1742564466.0186145}