{"duration": 0.04380917549133301, "input_args": {"text": "'WASHINGTON  —   A California man who climbed over the White House fence last week managed to roam undetected on the grounds for about 17 minutes, as Secret Service agents appeared to ignore several alarms, officials said Friday. The new details indicated that the episode was more serious than the Secret Service had originally stated. A Republican lawmaker said it also suggested the Secret Service’s security measures remain inadequate two and a half years after a series of lapses tarred the agency and led to major upheaval. In a separate episode, officials also reported Friday that a Secret Service laptop was stolen from an agency vehicle in Brooklyn. But the Secret Service said in a statement about the theft that agency laptops are fully encrypted and “are not permitted to contain classified information. ” The   episode took place on the night of March 10, and President Trump was inside the White House residence at the time. Jonathan   Tran, 26, of Milpitas, Calif. breached the outer perimeter of the White House by the Treasury Department building while carrying a backpack holding two cans of pepper spray, a book by Mr. Trump, a letter to the president and other items, the authorities said. After an officer ultimately detained him, Mr. Tran  —   who appears to have a history of mental illness  —   said, “I am a friend of the president. I have an appointment,” according to a court filing. “Secret Service did a fantastic job last night,” Mr. Trump said the next day. Representative Jason Chaffetz, Republican of Utah and the chairman of the House Committee on Oversight and Government Reform, wrote in a letter on Friday to the Secret Service that the committee received “additional information” about the episode, including indications that Mr. Tran “may have moved around on the White House grounds undetected for a considerable amount of time. ” The Secret Service said in a statement late Friday that Mr. Tran, after climbing several gates as high as eight feet, was inside the grounds for about 17 minutes before he was apprehended at 11:38 p. m. The agency said it is conducting an investigation. CNN first reported on the new details in the case. Mr. Chaffetz also said that the committee had received information indicating that the Secret Service “ignored” alarms that Mr. Tran tripped and that he may have attempted to get into the White House itself. “If true, these allegations raise questions about whether the agency’s security protocols are adequate,” Mr. Chaffetz said, stressing “longstanding concerns” about security episodes at facilities protected by the Secret Service. Last week’s   recalled an embarrassing episode for the Secret Service in September 2014, when an intruder with a knife, Omar J. Gonzalez, managed to run through the ceremonial East Room of the White House before he was apprehended. The Secret Service was criticized for playing down the severity of the episode until a fuller account emerged in an investigation by a House subcommittee led by Mr. Chaffetz. That episode, along with a series of other safety lapses revealed at the time, led to intense congressional criticism, a   of the Secret Service’s top management and the addition of spikes atop the White House fencing to deter climbers. Plans were recently approved for a taller, stronger fence. A 2015 report by the House Oversight Committee called the Secret Service “an agency in crisis” and found that over a   period, there had been 143 security breaches and attempted security breaches at secured facilities.'"}, "time": 1742562025.8202653}