{"duration": 0.1259903907775879, "input_args": {"text": "'Posted by Devin Peterson on 11/16/2016 to Outdoor Survival Many of us head out into the woods or the wilderness to “lose ourselves” in the beauty of Mother Nature, but this stops being fun and can become horrible if we are unlucky enough to actually get lost while out there. You might not think it can happen to you, but even the best, most experienced hikers get lost. There are loads of things to consider once you realize you are lost and it is helpful to have an action plan in case it ever happens to you. We’ve come up with a list of questions you should ask yourself once you determine you are in fact lost to try and help you take control of the situation. This is a good way to start, but to get a full idea of what you need to know check out this complete guide of how to survive being lost in the woods . 1. Can I get help? \\nOnce you have admitted to yourself that you are lost one of the first things you want to consider is how you are going to get help. Here’s a few ways that you could do this, some more obvious than others. Check your cell phone - obviously if you have service and can reach either a friend or can call 9/11, this situation is going to be much easier. Stay in the area and yell - you never know who might be in the area or how close to a trail you might be. Stick around in the same spot and shout at the top of your lungs for help. If someone is in the area, they’ll come find you. Make a fire - if you are in an area where it might be hard to find you, try to make a small fire using heavier, smokier woods. This could alert someone to your presence and could direct anyone looking for you to where you are. 2. What time is it? \\nNow that you have tried a few things to try and get help, you need to assess the situation and the time of day that it is will play a huge role in what you decide to do next. Depending on what your clock says you can: Begin looking for a place to camp Retrace your steps Rest until it gets cooler Have an idea of which way is East and which way is West. \\nThe idea of using the sun to help you orient yourself is useful, but obviously depends on you knowing where it is you are headed. You may think East is the way back, but if you are already East of where you started this could be dangerous. Also, the sun is actually very rarely aligned perfectly with East and West. This could be helpful in some situations, but be careful basing major decisions on this information. 3. Do I have enough water? \\nNo matter if you have enough time to try and find your way back to where you came or if you have decided to make camp, you are going to need water. Also, since you are now lost, it is important that you ration the water you do have until you find a new source. If you decide to walk around looking for where you came from, you are going to get thirsty and want to drink, which will deplete your supply. If you can find a water supply, stick to it and start thinking about how you can purify it to make sure it is safe to drink. Here are some of the most effective ways: Boil the water - this is relatively easy and safe to do, but it might be difficult if you are not carrying a pot or some other receptacle to hold the water Make a filter - you can make a filter using rocks and leaves and any burnt wood you might be able to find. This is not the cleanest way to do this, but could be effective in desperate situations Use chemicals - if you are a prepared hiker you might be carrying some iodine or chlorine with you that you can drop into the water you collect in order to make sure it is clean. If you don’t have this, see the first two options. \\nIf it is impossible to do any of these, the only thing left to do is to look for a running stream and chance drinking out of it. This is risky and not recommended, but if you really need water you may not have any other choice. If you can’t find a stream you could use one of the following water collection techniques: Collect condensation from trees with plastic bags Collect rain water with a shirt or a towel Neither of these is ideal, but desperate times call for desperate measures. 4. Where can I get food? \\nIf you are not carrying any food with you or it looks like you are going to be on your own for a while, you are going to need to figure out where your food is going to come from. If you are near a lake or a pond or in an area with wildlife, you could try to be inventive and fashion a fishing pole or a spear out of some branches to try and get food. However, if the area you’re in doesn’t allow for this or you’re not handy enough, there are some plants easily found that can be eaten that offer nutrients for emergency situations. Here are a few: Pine needles - sounds weird, but they are full of Vitamin C, especially the light green parts that come out in Spring Dandelion leaves - they taste quite bitter, but are full of iron and will help you maintain your energy level Elder weed - legend has it that the Roman army helped feed itself on this plant while out campaigning. It’s got lots of nutrients and can be found anywhere. \\nWhen you have to resort to eating in the woods, just be careful. The most harmless looking berry can be poisonous. You should be okay, but play it safe. Hopefully you never need this \\nIt is good information to have in case you ever are lost in the woods, but hopefully proper preparation and practicing safe hiking techniques will mean you will never have to ask yourself the questions we’ve discussed. Having said that, do you have any experience surviving in the woods? Let us know what you did to stay alive, but again, let’s hope it doesn’t happen.'"}, "time": 1742563323.408266}