{"duration": 0.09046220779418945, "input_args": {"text": "'Email \\nIn a speech before the American Israel Public Affairs Committee earlier this year, Hillary Clinton, who vehemently opposes the Boycott, Divestment and Sanctions movement warned against anyone who tries to “to shut down debate, especially in places of learning like colleges and universities.” Her concern, of course, was with reassuring pro-Israel students that she stood behind them as they battled efforts to criticize Israel from the left. \\nIt is certainly sportsman-like of Clinton to be open to debate, but the reality is that the free exchange of ideas on campus is currently under assault, not from the left but from the right. Consider the following incident from here in Ohio. \\nOn September 21, the Case Western Reserve University Radical Student Union showed a documentary titled “ ,” which is available to all members of the university community through the Kanopy streaming service. Today, the RSU stands accused by the , a nonprofit pro-Israel group, of engaging in an “antisemitic expression” that “condoned terrorism,” simply for showing the film in public. One radical student critical of Israel’s policies likened the climate of fear on the CWRU campus with respect to this issue as akin to be “stalked.” \\nThe RSU decided to host the film to raise awareness and in the words of its president, Gabriel Murcia, to give “voice to people who don’t have a voice.” Although some 100 people attended the screening, the RSU decided at the last minute not to have a formal discussion after the film when an email raising the specter of antisemitism emerged from the president of a pro-Israel student group. \\nI have watched this film at least four times now. There is absolutely not one shred of evidence of antisemitism in it if by that word we mean hatred or discrimination against the Jewish people. The film does, however, take Israel to task for engaging in a dishonest campaign of public diplomacy. These efforts have tended to cast the problem in Israel/Palestine in terms of terror instead of territory, and have made it seem as if Palestinians are on the whole just prone to violence instead of people with legitimate grievances about displacement and dispossession of land. \\nAfter the movie, a student fellow of the Committee for Accuracy in Middle East Reporting in America (CAMERA), a group formed after the Israeli invasion of Lebanon in 1982, noted that though “every student on this campus is entitled to express their opinion” the film was biased and “unacceptable to be presented by a student organization at our university.” The her opposition to the BDS movement and argued that the president of CWRU had made opposition to academic boycotts the institution’s official stance. \\nThe student’s reference is to a in which the president and provost, like many university administrations across the country, communicated their personal opposition to the academic boycott of Israel following the American Studies Association’s endorsement of it. They argued that the boycott compromised academic freedom. Never mind that the academic boycott was set up to help Palestinian scholars achieve academic freedom while under the Israeli occupation. The AMCHA Initiative liked their statement so much that it still links to it on its website. The statement was not, however, the official position of CWRU, simply the personal opinions of its two highest administrators. \\nThe statement by the CWRU administration and the letter from the CAMERA fellow recall, as I pointed out in a , Edward Said’s comment, nearly 40 years ago, that politically speaking, the Palestinian in the United States “does not exist.” \\nI thought the matter was at an end, but to my surprise the about the movie screening. A university administrator who directs a continuing education center dedicated to “ ” condemned the film and the RSU, as if a radical Jewish tradition did not exist. He also implied that faculty drove the group’s agenda, implying that the students were not bright enough to think for themselves. The chairman of the board of trustees of the Jewish Federation of Cleveland, Gary Gross, meanwhile, called the film a bunch of “lies and distortions” without providing any evidence in support of the assertion. In fact, the film is about a policy of using lies and distortions to advance the interests of a foreign government. Gross added that he supports free speech, but then ominously intoned, “We will follow what’s happening on [the CWRU] campus through our partner agency, Cleveland Hillel.” \\nThe reference to Hillel was not an idle one. Cleveland Hillel just partnered with CWRU on the creation of the new Albert & Norma Geller Hillel Student Center which includes within it classrooms available for undergraduate courses. Some students on the left are dismayed that they are forced to take classes in a building run by a group that offers “ .” \\nThis incident is part of nationwide trend. Universities all over the country are under surveillance, most famously at the University of California, Berkeley, where a student-led course titled Palestine: A Settler-Colonial Analysis was canceled after AMCHA coordinated with other groups, including CAMERA, to pressure administrators. The course was later reinstated, but the intimidation continues online. An anonymous website called the Canary Mission, established in 2015, targets those on campus critical of the Israeli occupation. The site’s main goal is to harass student activists and attempt to block their admission into graduate school. \\nIf Hillary Clinton really does care about academic freedom, she should step up and publicly condemn the blacklisting of students and faculty concerned about Palestinian human rights. And so should the university presidents who invoked academic freedom as the rationale for their opposition to the ASA’s endorsement of the boycott of Israeli academic institutions. These leaders should also learn something from the experience on the Berkeley campus and stop caving in to people who have trouble tolerating a perspective that challenges them to think. \\nWhen I informed Mr. Murcia about his group’s inclusion on the AMCHA website he was saddened. As he put it, “All we did was show a movie.” \\nTed Steinberg teaches history and law at Case Western Reserve University. He is the faculty advisor to the Radical Student Union and the author, most recently, of Gotham Unbound: The Ecological History of Greater New York .'"}, "time": 1742562441.923895}