{"duration": 0.04729104042053223, "input_args": {"text": "'‘Go Back to Where You Claim Home,’ Kansas Lawmaker Tells Protester Dion Lefler, Wichita Eagle, October 25, 2016 \\nKansas state Rep. Joe Seiwert commented on Facebook that an African-American singer who knelt while performing “The Star Spangled Banner” at a Miami Heat game should “go back” to where she claims as home. \\nSeiwert, R-Pretty Prairie, posted that comment and a longer follow-up on an anti-black meme that was originally posted to a pro-Donald Trump Facebook group and then shared by one of Seiwert’s constituents. \\nSeiwert confirmed the comments were his and said he was exercising his First Amendment right to free speech, as he says the woman in the meme did when she wore a Black Lives Matter T-shirt and knelt while singing the anthem. \\n{snip} \\nThe photo in the meme is of Denasia Lawrence, a Miami social worker and, according to the Miami Sun-Sentinel, a part-time game-night employee of the Heat professional basketball team. The team has issued a statement saying team officials were unaware that Lawrence planned to protest when they asked her to sing the anthem at Friday’s preseason game with the Philadelphia 76ers. \\n{snip} \\nTo which Seiwert responded: “I am where I claim home and like it, they want to claim it and it is their right to go where ever they like, so if they don’t like it here, I believe that their freedom completely allows them to go wherever they believe is more free and non racist if that’s what they believe.” \\nSeiwert said he didn’t see the profanity in the meme when he commented and didn’t do anything wrong. \\n“I have a personal life besides a legislative life,” he said. “Maybe it was inappropriate; I don’t believe so, because I said nothing derogatory. And I believe that (if) people are that upset with the national anthem, they can do whatever they want to on their own time, but when they’re using it on national TV to make a statement, that’s not right. \\n“I said if she (Lawrence) doesn’t like it here, then go where she would like it. What’s wrong with that?” he said. \\nAsked why a person should leave rather than try to change things where they are, Seiwert responded: “Because maybe there’s other people who don’t want their place changed.” \\nHe also said he did not think his comments had anything to do with race. \\n“It don’t make any difference if they’re black, white or green, it’s the disrespect to our country,” he said. “And why does everybody put the color to it?” \\n{snip} \\nThe person who made the meme took a photo of Lawrence from the web and added, in capital letters, “KNEELING WHILE SINGING THE NATIONAL ANTHEM . . . I’M SO SICK OF THESE ANTI-AMERICAN BLACKS . . . (Expletive) BLACK LIVES MATTER.” \\nSeiwert’s comment, directed at Lawrence, was: “Go back to where you claim home than (sic).” \\n{snip}'"}, "time": 1742562073.6890445}