{"duration": 0.09884953498840332, "input_args": {"text": "\"For those who are too young or too unwilling to remember, a trip down memory lane. \\n1969 – Debut: Hillary speaks at Wellesley graduation, insults Edward Brooke, Senate’s lone black member. \\n1973 – Watergate committee: Says Chief Counsel Jerry Zeifman of Hillary’s performance, “She was a liar. She was an unethical, dishonest lawyer. She conspired to violate the Constitution, the rules of the House, the rules of the committee and the rules of confidentiality.” \\n1978-79 – Cattlegate: as wife of Arkansas governor, she invests $1,000 in cattle futures, makes $100,000. \\n1978 – Whitewater: Clintons borrow money to launch Whitewater Development Corporations. Several people go to prison over it. Clintons don’t. \\n1992 – Bimbo eruptions: Bill and Hillary swear to Steve Kroft on “60 minutes” Bill had nothing to do with Gennifer Flowers. \\n1992 – Private investigators: “We reached out to them,” Hillary tells CBS’ Steve Kroft of Bill’s women. “I met with two of them to reassure them they were friends of ours.” They also hire PIs to bribe and/or threaten as many as two-dozen of them. \\n1993 – Health care reform: Hillary heads secret health-care task force, sued successfully for violating open meeting laws. Subsequent plan killed by Democratic-controlled House. \\n1993 – Waco: Hillary’s DOJ authorizes armed assault against religious community in Waco, 80 dead, many of them children, more than half racial minorities. \\n1993 – Travelgate: Hillary orchestrates firing of travel office employees, replaces them with her own people. Independent Counsel Robert Ray calls her sworn testimony “factually false” but can’t prove beyond a reasonable doubt it was ”knowingly false.” \\n1993 – Vince Foster: White House counsel and reputed Hillary lover is found dead in Fort Marcy Park. The DOJ opens a separate investigation of possible obstruction of justice by Hillary and her cohorts for blocking search of Foster office. \\n1994 – Chinagate: Hillary meets with disgraced fixer Webb Hubbell. A week later Clinton Indonesian money man James Riady gives Hubbell $100,000 “job.” Hubbell never talks. Reads the NYT headline, “Payment to an Ex-Clinton Aide Is Linked to Big Chinese Project.” \\n1994 – Filegate: Hillary henchman Craig Livingstone improperly requests and receives FBI background reports on several hundred individuals. Multiple investigations follow. \\n1994 – November elections: Due in no small part to health-care fiasco, Dems lose Senate and House for first time in nearly 50 years. \\n1995 – Chinagate: Hillary convenes secret meeting with Bill and Dick Morris. They launch what Thompson Committee calls “the most corrupt political campaign in modern history.” \\nSign the precedent-setting petition supporting Trump’s call for an independent prosecutor to investigate Hillary Clinton! \\n1995 – Pay to play: The $100,000 donation to travel with the Clintons on trade missions morphs from a discreet expectation into the price of admission. Independent counsel investigates. \\n1995-96 – Thompson Committee: The Clintons “pulled down all the barriers that would normally be in place to keep out illegal contributions, pressured policy makers, and left themselves open to strong suspicion that they were selling not only access to high-ranking officials, but policy as well.” \\n1996 – Blizzard of lies: Hillary dodges imaginary “sniper fire” in Bosnia’s Tuzla airport. \\n1996 – Ron Brown death: Nine days later embattled Commerce Secretary Ron Brown, who hates being “Hillary Clinton’s being mother-f—ing tour guide,” leaves Tuzla on final, fatal flight to Croatia. \\n1996 – Enron connection: Brown goes to Croatia to broker a sweetheart deal between the neo-fascists who run the country and the Enron Corporation. Despite his death, the deal goes through, ends very badly. \\n1996 – Ron Brown cover-up: Pathologists find an apparent bullet hole in Brown’s head. He is buried without autopsy. Head X-rays are lost. Three pathologists and photographer have careers wrecked for going public. \\n1995-96 – Thompson Committee: “Millions of dollars were raised in illegal contributions, much of it from foreign sources.” \\n1996 – TWA Flight 800: Hillary is in family quarters with Bill and Sandy Berger when plans are launched to cover up real cause of the destruction of the aircraft. \\n1996 – Blizzard of Lies: In a New York Times op-ed titled “Blizzard of Lies,” the usually restrained William Safire famously calls Hillary “a congenital liar.” \\n1997 – Pay to play: Johnny Chung tells Thompson Committee he funneled $100,000 from the Chinese military to the DNC. “The White House is like a subway. You have to put in coins to open the gates.” \\n1998 – Monica: “There isn’t any fire,” Hillary tells Matt Lauer about the “smoke” surrounding Monica Lewinsky accusations. ”The great story here is this vast right-wing conspiracy that has been conspiring against my husband.” \\n1999 – FALN: Clinton pardons 16 lethal Puerto Rican terrorists to boost Hillary’s chance to win N.Y. Senate seat. She supports move until outrage mounts. \\n1999 – Christopher Hitchens: “Like him, [Hillary] is not just a liar but a lie; a phony construct of shreds and patches and hysterical, self-pitying demagogic improvisations.” \\n2001 – Pardongate: Clinton pardons 140 people on final day of office, including cocaine dealer, drug-dealing brother, Whitewater pal and billionaire fugitive Marc Rich. Hillary’s brothers Hugh and Tony both implicated during subsequent investigation. James Comey investigates, finds no illegality. \\n2001 – Furnituregate: The Clintons leave the White House with $134,000 worth of items that they, once the story breaks, have to return or pay for. \\nPlease share with your Republican friends who seem comfortable with this woman returning to the White House. Unless, they get a royalty every time the suffix “gate” is applied to a word, they are in for a rough four years. \\nMedia wishing to interview Jack Cashill, please contact . Receive Jack Cashill's commentaries in your email BONUS: By signing up for Jack Cashill's alerts, you will also be signed up for news and special offers from WND via email. Name *\""}, "time": 1742562959.6856744}