{"duration": 0.21264028549194336, "input_args": {"text": "'By Ann Deslandes / thevocal.com.au \\nThe feminist and feminist-adjacent internet had a mild implosion in February in response to an article by Canadian organiser, writer, and college professor Nora Samaran (a pseudonym). Titled ‘The opposite of rape culture is nurturance culture’ , Samaran proposes that the solution to rape culture and other manifestations of gendered abuse lies in the inverse of violence, which she says is nurturance – that is,a deep capacity to create safety and trust that many men are not permitted to develop in patriarchal culture. Patriarchal masculinity, as Samaran observes, teaches men that healthy attachment needs, such as attunement, comfort and responsiveness, or emotional availability are weak and wrong. As such, men become “less able to experience women as whole beings”, and are “less able to make sense of their own needs”. So, as Samaran argues, if men can work together to connect with their capacity to nurture and teach each other the skills and qualities of “healthy attachment”, violence against women and non-binary folks might be turned around to its opposite: nurturance. \\nAs a proposed antidote to rape culture (most recently, most painfully highlighted by the now-viral letter written by the victim of barely-convicted rapist Brock Allen Turner), Nurturance Culture (short title) has been welcomed, argued over, and extended in multiple corners of the social web (and wept over by the MRA ones, natch). 300,000 people from almost every country in the world read the piece in the first week it was posted, and it has been translated into Spanish and Portuguese with more languages likely to come. This is particularly remarkable because Nurturance Culture is not your typical punchy, between-the-eyes manifesto that is easily parsed through social media channels – it’s long; it draws from fields as diverse as neuroscience, psychology, racial justice, cultural theory, and science fiction; and it is concerned with no less than the deep, structural transformation of heteropatriarchal gendered culture. \\nWhen I interviewed Samaran via Skype last month, she suggested that the length and depth of the piece might actually be the reason it had such an impact. In her words, “the piece seems to have resonated so deeply because it combines current knowledge about the brain and nervous system with an analysis of power”. And, she observes, this kind of thinking is becoming quietly more common. “It seems to me that for those who are paying attention, we are shifting away from cultures of dominance. While on the surface we live in very violent times and so much seems so hopeless, underneath there is a kind of tapping into a vast and deep reservoir of purpose and hope. When you begin to pay attention, you feel and see it emerging on many different fronts seemingly simultaneously. Even in very traditional places this change is happening; we see it in climate scientists beginning to legitimise considering feelings as important sources of information , or the field of medicine beginning to grapple with the possibility of a shared consciousness , it’s happening in so many very significant places seemingly independently, such as Black Lives Matter , Indigenous resurgence happening across Turtle Island , the radical mental health movement in work such as The Icarus Project … so much is arising against different forms of dominance simultaneously and it feels like rigid masculinity is one of those forms and is connected to all the others.” \\nAs Nurturance Culture gained traction, Samaran began inviting people to submit their own descriptions of what the “nurturance” she is proposing looks like, which resulted in dozens of stories of husbands, boyfriends, lovers, friends, brothers, and fathers showing the kind of dependable love and intimate care that is indeed the opposite of hurting, hitting, bashing and raping. This included responses from men keen to share their understanding of the skills of nurturance, such as this one: \\n“For at least a little while, especially when someone you are with is in need of nurture, let go of your own needs and desires. What does that mean? It means stop thinking about anything related to yourself: how you feel, what you need, what you think is best. Just listen and listen very closely. Try to imagine what it must be like to be this other person: absorb everything you know about their history and experiences and try to embody these. Listen to what they are saying, and repeat it back to them in order to clarify whether or not you’ve actually absorbed the essential meaning of what they are communicating to you.” \\nResponses like this reflects one of Samaran’s intentions for the piece – in her words, “for men to teach one another what they are currently learning individually from women about how to be nurturing”. Samaran notes there were unforeseen responses too, such as those who “interpreted the piece to mean that men should love and nurture and bond with one another ” . On the one hand, “men connecting more with other men in a way that skips nurturing women entirely is not really my goal…. I’ve even seen all-male panels on masculine nurturance culture!” she laughs. Still, she adds, “I think this piece cracked open an existing profound desire among men to be able to get closer to one another. And that is beautiful – men want to love each other, to nurture each other, and they don’t feel allowed. That’s one of the big things I hear is being discussed when this piece is used in workshops and discussion groups and conference panels. I just hope they do it in ways that grow their love and capacity to be nurturing to the women and non-binary folks in their lives – not just to strengthen masculine bonds.” Moreover, the answer to the question ‘Nurturance is….’ must amount to something more than just ‘not raping or assaulting’, Samaran adds. “I’m saying that “nurturance is about learning how to make someone feel safe. I’m saying that it is totally ok to be honest and speak without shame of what we do and don’t know, but social scripts about masculinity put a lot of pressure on men to never admit when they don’t know something. It’s completely ok to say ‘hey I don’t know how to be a safe man, a safe male presence in women’s lives’– because that is about a lot more than just not raping, it is about creating safe connection and spaces in which women and non-binary folks can heal from the massive gendered violence we experience. And, it is about recognising that men need to do this work and teach it to each other because we are already so exhausted from doing it.” \\nAccording to Samaran, another critical aspect of Nurturance Culture that people have responded to is its discussion of shame: “On the surface, the shame over not being able to provide what someone needs is massive, and apparently that’s a big thing for men. However, underneath, there is a complex operation of shame going on in masculinity. If you have shamed yourself for having perfectly normal needs, you may not realise that you are doing so, and instead may perceive those same needs as shameful when they appear in other people. You may then actively shame people when they express those same normal needs you have internalised as shameful for yourself. So let’s say you learned very early on that needing to be held tenderly and gazed upon lovingly is shameful. You put it away, and can’t access it or even remember it. When someone you are lovers with has that very normal and healthy need, instead of comforting her appropriately, you may treat her as shameful and confusing, or become angry and withdrawn, and then blame her for this tension by calling her ‘needy’ or ‘unreasonable’– when really it is your own denied need that you are seeing. If you can recognise nurturance needs as completely normal and healthy, you can get your own denied needs met, and also respond in a good way to the needs of a lover, partner, or close friend. Ironically, guilt and shame can be paralysing and can prevent emotional maturity from emerging. We really do need to understand how to work to reduce shame and guilt and increase our culture’s ability to let people be vulnerable. I’m interested in how we create a culture that is safe enough that vulnerability and being completely accepted as our whole selves is taken as a matter of course, as a strength, as a normal part of daily life, not just in our families but in our society across the board. That is how we will move away from shame and guilt and towards accountability and love.” \\nConsidering Australia’s current crisis of violence against women, I asked Samaran about the role of public, government-sponsored campaigns like ‘The Line’ aimed at raising awareness amongst young people about consent and the impact of intimate partner violence, and the rollout of relationships education in schools where students learn about respectful relationships. Can measures like this complement or help build a nurturance culture? “Sure”, she replied. “Mainstream media and the education system are both central in raising young people so these programs are helpful. Still, programs like the ones you describe are not enough – they’re not a replacement for the daily, intimate work of building a culture that does the opposite of harm. Programs like this are resources, but let’s not overlook where the learning really comes from – it is deep cultural change we need, and schools can be slow to change.” In this vein, Samaran also encourages readers to consider characters and plots that demonstrate nurturance in popular culture and in existing social movements primarily led by Black and Indigenous people of colour who are creating the world we want to see: “when thinking about huge social problems like men’s violence, it’s so important to think about what the world we want could look like, and where it already looks more like what we want.” \\nAnn Deslandes is a freelance writer and researcher. Tweet her at @Ann_dLandes and read her other writing at xterrafirma.net . 0.0 ·'"}, "time": 1742561644.973579}