{"duration": 0.16399025917053223, "input_args": {"text": "'HAVANA  —   At the Salon Rojo, one of Havana’s most popular nightspots, where the reggaeton usually blares into the early hours, the music stopped abruptly. An announcement was made: Fidel Castro had died. The police waved along young women in miniskirts and young men with gelled mohawks as they spilled into the streets. No one was weeping. No one was chanting. Some said the country would be better off, freer now, though they said it quietly, wary that someone might overhear such hopes. A hearse, repurposed as a taxi, happened to drive by. “Take him with you,” one of the young men shouted with a smile as a friend cheered him on. The young women with them looked embarrassed, but not angry. A few feet away from a crowd of partygoers, three neighbors, each in their 50s and consoling one another, stood in their apartment building’s doorway facing the iconic Hotel Nacional. Concepcion Garcia, 55, looked at the young people around her with disappointment. “What a rich experience we have had, to live the two periods of Cuba  —   capitalism and socialism,” she said. “Imagine how we Cubans feel. The most precious thing we have just died. ” With the departure of Cuba’s epic revolutionary in green fatigues, at the age of 90, the residents of Havana have not erupted so much as moved into their own emotional corners. All over this city on Saturday, indifference and relief stood side by side with sorrow and surprise as the conflicts that characterized Fidel Castro in life continued to reverberate after his death. “He was the only leader I ever knew,” Graciela Martinez, 51, said as she mopped the floors of a cafe near the American Embassy on Saturday morning. She paused, then began to weep, thinking of her father, who fought for the revolution  —   and of her relatives who had fled to the United States. “For those who loved him, he was the greatest,” she said of Mr. Castro. “For those who hated him, there was no one worse. ” Cuba, a verdant, struggling country of 11 million people that has been moving slowly toward   changes, finds itself again at an international crossroads. Mr. Castro died as Venezuela has pulled back financial support, facing its own political and economic crisis, and the détente engineered under President Obama threatens to be rolled back by   Donald J. Trump. While Mr. Obama issued condolences to the Castro family and offered “a hand of friendship to the Cuban people,” Mr. Trump wrote on Twitter, “Fidel Castro is dead!” and later issued a statement calling him a “brutal dictator. ” Cuban officials have long maintained that the island has diversified its international ties enough to withstand financial or political storms. But after decades of unfulfilled promises about economic growth, the passing of Mr. Castro may open rifts both inside and outside Cuba over how to proceed. Elaine Díaz, an independent blogger in Cuba, said she expected Mr. Castro’s death to lead to more diversity of opinion within the leadership. The Cuban government likes to portray itself as a monolith, even though some factions are more conservative than others, she said. “This is going to bring that out in public,” she said. Other divides may also become more visible, especially between generations. Mr. Castro molded the country and governed it for so long that many older Cubans can hardly think of the nation apart from his legacy. But he has also been out of the national spotlight for so long (after handing power to his brother Raúl Castro in stages, beginning in 2006) that many young Cubans have had little exposure to him and do not seem to identify with him. Theirs is a generation that has, in many ways, already become    —   seeing politics as useless and intractable, craving technology and, in many cases, much more eager to leave Cuba than to defend the Communist slogans that are as faded as the billboards still displaying them on the nation’s highways and roads. “In my parents’ generation, there is also still a lot of loyalty. In my generation, you’ll see more differences,” said Ms. Diaz, 31. “In a large portion of the young people, what you will see is apathy. ” On Friday night, for example, many young people did not respond with any visible emotion when they were told of Mr. Castro’s death. On Saturday, many went about their day as usual, arguing that little would change because of Mr. Castro’s demise. “The country will continue on the path that it’s on,” said Abraham Jimenez Enoa, 27, a   of an independent blog called “el estornudo,” or “the sneeze. ” “I don’t really see changes in the near future. ” The response could not have been more different from that of the government or its strongest supporters. Their grief began with a brief televised speech by Raúl Castro announcing that “El Comandante” had died. He did not emphasize that the man was also his brother  —   his passing was a loss for the nation. By sunrise, flags all over Havana had been lowered to  . Young and old gathered in small groups, and where there might have normally been laughter or yelling, whispers filled the void. Much of Havana seemed uncertain about exactly how to feel, or at least how to talk about it. “It is a very strange feeling,” said Francisco Rodríguez Cruz, a prominent blogger and gay activist who supports the revolution. He was one of many who said losing Mr. Castro was like losing a parent. “With this death, you feel that your own life is spread before you,” Mr. Cruz, 46, said. Many others looked back to what they had gained in Fidel’s Cuba. Ms. Garcia removed her glasses and pointed at her eyes. “I have the revolution and Fidel to thank for this cataract surgery,” she said, adding that she would not have been able to afford the procedure without Cuba’s socialized medical care. It did not cost her a cent, she said. “He put Cuba on the map,” Ms. Garcia added, “and the world has recognized that. ” Her neighbor Josue Carmon Arramo, 57, chimed in, “His life may be over, but his work will live on. ” “This story will not die, because we are followers of his ideas of nationalism and solidarity of the Cuban people,” he said. “That’s who we are. ” The official state apparatus seemed ready for the news. A night watchman working near the Malecon  —   the seaside boulevard where so many young people gather that Cubans often call it the city’s longest sofa  —   said he had seen busloads of soldiers pass by before Mr. Castro’s death was widely known. Cuban national television interrupted its regular schedule in favor of historic video clips of Mr. Castro and scenes of the reunion of Elián González with his family in Cuba after the boy was returned from Florida in 2000. Near the American Embassy on Saturday morning, the police circled in patrol cars while men in plain clothes who refused to answer questions about Mr. Castro seemed determined to keep an eye on those nearby. Long after the sun soared over Havana harbor, the Malecon, usually bustling at all hours, was devoid of all but jogging tourists and a few cars. But the news for Cuba’s memorial plans moved through the streets quickly. He was to be cremated Saturday. There would be a period of public mourning in Havana on Monday and Tuesday, and then a procession over the course of the week, with the revolutionary’s ashes moving across the country from Havana to the city known as the cradle of the revolution, Santiago de Cuba, where he would be put to rest on Sunday, Dec. 4. The details, at least, were easier to talk about in public than his legacy. They could not be argued about, or get you in trouble if overheard in conversation. In Miami, by contrast, celebratory crowds gathered at Versailles, a Cuban restaurant in the Little Havana neighborhood that has become a focal point of the Cuban exile community in the United States. Revelers posted videos on social media of popping champagne bottles. Still, in Havana, expectations were limited and often more narrowly focused, on economic survival, and on how little would really change when the mourning was done. “It closes one chapter and starts another,” Miguel Fernandez, 56, said as he walked his dog Saturday near the Malecon. “But it won’t bring about anything substantial. He’s been out of the picture for a while. ”'"}, "time": 1742564401.1045208}