{"duration": 0.051726579666137695, "input_args": {"text": "'VIDEOS Obama, Clinton, and Sanders could stop the riots but they just watch If Obama, Clinton, and Sanders really loved America, these three would use their influence to ease the transition By Daisy Luther - Friday, November 18, 2016 1:21 PM EST \\nIs it just me or have you also noticed that Hillary Clinton, Bernie Sanders, and President Obama have been silent about the protests? \\nThe very people who have the power to stop these protests and riots with just a few well-spoken words have been completely silent on the issue. Hillary Clinton \\nDuring her concession speech , Clinton said, “We must accept this result, and then look to the future. … Donald Trump is going to be our president. We owe him an open mind and the chance to lead.” \\nAfter that, she has been mum on the entire thing. \\nHillary Clinton could have asked her followers to stop this nonsense, and they probably would have listened out of respect for her. (Misplaced respect but that’s a whole different article.) Instead, her silence makes me think that she is hidden away, relishing the chaos. That she has done nothing to attempt to calm the situation underlines the fact that she was not fit to govern. A leader would look out for the best interests of a country they love, rather than watching from afar to apply balm to her wounded ego. \\nInstead, her Twitter is full of Bible quotes (huh?) and mentions nary a word about the protests. It has not been updated since the day after her failed bid. Bernie Sanders \\nBernie Sanders, the one from whom the Democratic primary was fraudulently stolen, the one who backed up Hillary Clinton anyway, has also been uncharacteristically silent, especially for an aging peace-and-love hippie kind of guy. \\nHe hasn’t once asked the protesters to be peaceful or to give Trump a chance, but he has fueled the fire with his cries for them to remain vigilant. He’s already opposing Trump before the guy even gets inaugurated. \\nEven in his essay for the NY Times yesterday, entitled “ Where Do Democrats Go From Here? ” he did not gently suggest to his supporters that they turn toward peace. He had the opportunity, the platform, and the love from his followers, and his choice to remain silent tells me that he is just as self-serving as the other politicians, despite his humble, grandfatherly demeanor. President Obama \\nThen there’s the President, who met cordially with Trump . His Twitter account is likewise mute on the subject of vandalism, arson, and violence in reaction to the election. \\nNote to President Obama: I didn’t like it when you were elected either, but I burned neither flags nor effigies. I peacefully dissented throughout your administration but never damaged one single item of property. You screwed the middle class with your horrible health care catastrophe, and yet no one rioted in the streets when you were re-elected to screw us for another four years. \\nObama’s only statement of semi-support was on Wednesday, when he said, ““The peaceful transfer of power is one of the hallmarks of our democracy. We’re actually all on the same team.” \\nHis statement about the riots was via his press secretary . White House Press Secretary Josh Earnest, asked Thursday about the protests, said the president believes the right to free speech should be protected. He added, “It is a right that should be exercised without violence. And there are people who are disappointed in the outcome. And the president’s message in the Rose Garden was it’s not surprising that people are disappointed in the outcome, but it’s important for us to remember, a day or two after the election, that we’re Democrats and Republicans, but we’re Americans and patriots first.” This won’t end well. \\nKellyanne Conway, Trump’s campaign manager, sees it the same way. She has called on Obama and Clinton to address the violence, but thus far, her request seems to have fallen on willfully deaf ears. Not cool. @POTUS or Hillary should address. ‘People Have to Die’: Anti-Trump Protester Calls For Violence on CNN https://t.co/NfEqhkrTvu \\n— Kellyanne Conway (@KellyannePolls) November 10, 2016 \\nNot accepting the result and keeping up the protests will lead to nowhere except more trouble as the contagion of anger spreads. It is only a matter of time before it really gets out of hand and people start dying. \\nSince protesters are now actually calling for war and death, if Obama, Clinton, and Sanders really loved America, these three would use their influence to ease the transition and call for peace. Instead, one must wonder if the rumors about a Soros-funded, Clinton-approved Purple Revolution to destabilize America are about to become our new reality. \\nOh – and one quick note. It has to be said \\nThe people calling for war and death are overwhelmingly anti-gun. \\nThey just might want to rethink the wisdom of directing their death threats, physical attacks, and aggression toward Second Amendment proponents. Via Daisy Luther Featured Image: Brett Weinstein/Flickr Daisy Luther is a freelance writer and editor. Her website, The Organic Prepper , where this article first appeared , offers information on healthy prepping, including premium nutritional choices, general wellness and non-tech solutions. You can follow Daisy on Facebook and Twitter , and you can email her at'"}, "time": 1742628502.506535}