{"duration": 0.10903000831604004, "input_args": {"text": "'There was the myth of Trump supporters sending wild dogs to scare off black voters in Ohio. In Texas, some of the voting booths supposedly became possessed, switching ballots cast for Donald J. Trump to Hillary Clinton. And then there was the amateur genealogist said to be committing voter fraud by jotting down names found on gravestones. A week before Election Day, warnings of a rigged vote, amplified largely by Mr. Trump himself, have led to anxiety across the country about the integrity of the electoral process. In some instances, the concerns appear to be justified, but many have resulted from simple glitches or a heightened sense of suspicion. In any case, a year of extraordinary political polarization has left voters increasingly wary about their fellow citizens and the credibility of the country’s method for picking a president. “I think there’s definitely more paranoia this year,” said Pamela Smith, the president of Verified Voting, a nonpartisan group that promotes the integrity of elections. “There has been a lot of talk about election rigging. If you think an election is going to be rigged, then you look at everything through that filter. ” Many of the rumors of rigged votes have taken on a life of their own on social media, where conspiracy theories flourish and accusations fly. The reports have left election officials and the local authorities scrambling to verify claims of mischief and, often, to offer reality checks. One of the most fiercely contested battlegrounds, Ohio, has been a hotbed of suspicion. Over the weekend, a political activist with more than 30, 000 Twitter followers wrote a post saying that Trump supporters with dogs were threatening black voters who went to the polls early in Cincinnati. The post sent his followers into a frenzy, but local officials said the man, Jim Wallis, was making a false claim. The message was later deleted. “I saw a couple of Seeing Eye dogs, one miniature horse wearing a campaign sign and another rather large but friendly dog on a leash,” Tim Burke, the chairman of the Hamilton County Board of Elections, told The Cincinnati Enquirer. In Butler County, Ohio, Leah Edwards notified the authorities about voter fraud when she saw a man taking notes and photographing gravestones at a cemetery. “I can’t think of any other reason a person would be doing this,” she wrote on the Facebook page of the Butler County Sheriff’s Office. A man who said that he was the one later detained at the cemetery, Frank Flack, posted a reply that assailed Ms. Edwards for being irresponsible. He said he had been photographing grave markers for a “find a grave” memorial project. “Sorry to dispel your conspiracy theory on voter fraud,” Mr. Flack wrote. “If you would have stopped and talked to me, I could have let you know that I am a registered Republican!” Texas is known for its skepticism about the system, and early voting there spurred an uproar about glitches with voting machines. Voters in several counties complained that they had voted for a straight Republican ticket, only to see the box for Mrs. Clinton highlighted. The anecdotes ricocheted around conservative corners of the web, leading to urgent warnings from the likes of Sean Hannity and the site Infowars. The notion of a widespread conspiracy was debunked by Nancy Tanner, a judge in Potter County, Tex. who blamed user error for most of the malfunctions. “As everyone knows, our fingers don’t always do what our brain tells them,” Judge Tanner said. Voter registration problems in North Carolina and other states have led to confusion and long lines. With talk of rigging so pervasive, anything out of the ordinary can be taken as potentially untoward. When faulty machines would not accept ballots in Boone, N. C. Allison Critcher was asked by a poll worker to slip her ballot through a little metal slot on the ballot box. She felt that something might be fishy. “They did not, however, explain what they were going to do with our ballots, which made me a little wary,” said Ms. Critcher, who voted in late October. Not all of the   problems reported this year are figments of imagination. Kristen Clarke, the executive director of the Lawyers’ Committee for Civil Rights Under Law, said that her organization’s national hotline for reporting problems at the polls had received about 50, 000 calls this year, and that there had been more complaints about voter intimidation than in 2012. “We have observed a more fevered pitch in the kinds of calls that we received from voters,” Ms. Clarke said. “Most certainly this is an election cycle fueled by toxic rhetoric and one in which anxiety levels are higher. ” The local authorities have been taking action against people who may have committed voter fraud, and civil rights groups are pushing back against what they say are acts of disenfranchisement. A woman from Des Moines was arrested last week and accused of casting early ballots for Mr. Trump in two Iowa locations. In   County, Fla. a    elections employee was arrested after her   said she had tampered with ballots sent by mail. On Monday, the North Carolina N. A. A. C. P. filed a federal lawsuit to try to stop state and local election boards from canceling the registrations of thousands of black voters. Voters appear to be more suspicious of one another this year, said Wendy Weiser, the director of the democracy program at the Brennan Center for Justice at New York University. But Ms. Weiser said she did not expect voter fraud to be more prevalent than in other general elections. In fact, Mr. Trump’s loud assertion that the election is rigged may have the effect of making irregularities even rarer. “One of the silver linings is that people are even more prepared,” Ms. Weiser said. “There’s undoubtedly more attention being paid to what’s going on in polling places. ” For his part, Mr. Trump appears content to keep the integrity of the voting process in doubt. At a rally in Colorado on Sunday, Mr. Trump suggested that people were probably voting multiple times across the country and that their votes were probably not being counted properly. “I know they’re all saying, ‘Of course, everything is so legitimate,’” Mr. Trump said. “Perhaps I’m a more skeptical person. ”'"}, "time": 1742561809.6686022}