{"duration": 0.15456581115722656, "input_args": {"text": "\"Email \\nWhat happens when you get thousands of lawyers involved in the craziest election in modern American history? Unfortunately, we may be about to find out. We all remember the legal tug of war between Al Gore and George W. Bush in 2000, and with each passing day it is becoming more likely that we could see something similar (or even worse) in 2016. In a brand new article entitled “ Clinton, Trump Prepare for Possibility of Election Overtime “, Bloomberg discusses the armies of lawyers that Clinton and Trump are both assembling for this election. It would be nice if it was the American people that actually decided the outcome of this election, but if things are very close on November 8th it may come down to what the courts decide. \\nTraditionally, there has been a lot of pressure on the losing candidate to concede to the winning candidate before election night is over. \\nHowever, in recent elections this has begun to change. I already mentioned what took place in the aftermath of the 2000 election, and in 2004 John Kerry did not concede to George W. Bush until the next morning. \\nAnd looking back at the numbers from the 2012 election, it is clear that Mitt Romney should not have conceded the race to Barack Obama so early. There was evidence of election fraud in key battleground states such as Ohio, Pennsylvania, Florida, Colorado and Virginia , and many people out there still believe that Mitt Romney would have won if the election would have been conducted fairly. \\nSo when Donald Trump says that he may not immediately concede the election if the results are tight, I think that there is wisdom in that. \\nA couple of weeks ago, it looked like we may have had a situation where Hillary Clinton could have won by a landslide . But the FBI changed everything when they announced that they were renewing their investigation into Hillary Clinton’s emails. Since that announcement, the poll numbers have been rapidly shifting and now Trump has all of the momentum . \\nFor example, the ABC News/Washington Post tracking poll had Hillary Clinton up by double digits not too long ago, but now it is showing a one point lead for Trump . \\nThe race is very close at this point, and if the race to 270 electoral votes is razor tight on election night, I don’t anticipate that either candidate will be eager to concede. We could see a prolonged legal battle ensue, and that could mean that we don’t have a new president until long after election day is over. \\nAlready, both campaigns are assembling large armies of lawyers. In fact, Bloomberg is reporting that Clinton already has “thousands of lawyers” that have donated their time to her campaign… \\nClinton is assembling a voter protection program that has drawn thousands of lawyers agreeing to lend their time and expertise in battleground states, though the campaign isn’t saying exactly how many or where. It is readying election observers in Florida, North Carolina, Pennsylvania, Ohio, New Hampshire, Iowa, Nevada and Arizona to assess any concerns — including the potential for voter intimidation — and to verify normal procedures. \\nThe Republican National Lawyers Association, which trains attorneys in battleground states and in local jurisdictions where races are expected to be close, aims to assemble 1,000 lawyers ready to monitor polls and possibly challenge election results across the country. Hedge fund manager Robert Mercer, one of Trump’s biggest backers, has sunk $500,000 into the group, its biggest donation in at least four presidential elections, Internal Revenue Service filings show. \\nAnd most Americans don’t realize this, but Reuters is reporting that the Democrats have already filed election-related lawsuits in four key swing states… \\nDemocratic Party officials sued Republican presidential candidate Donald Trump in four battleground states on Monday, seeking to shut down a poll-watching effort they said was designed to harass minority voters in the Nov. 8 election . \\nIn lawsuits filed in federal courts in Pennsylvania, Nevada, Arizona and Ohio, Democrats argued that Trump and Republican Party officials were mounting a “campaign of vigilante voter intimidation” that violated the 1965 Voting Rights Act and an 1871 law aimed at the Ku Klux Klan. \\nMeanwhile, the legal challenges for the Clinton campaign continue to mount. The renewed investigation into Hillary Clinton’s mishandling of classified documents is just one of five FBI investigations that are currently looking into the conduct of “Clinton’s inner circle” … \\nThere are, in fact, not one but five separate FBI investigations which involve members of Clinton’s inner circle or their closest relatives – the people at the center of what has come to be known as Clintonworld. \\nThe five known investigations are into: Anthony Weiner, Huma Abedin’s estranged husband sexting a 15-year-old; the handling of classified material by Clinton and her staff on her private email server; questions over whether the Clinton Foundation was used as a front for influence-peddling; whether the Virginia governor broke laws about foreign donations; and whether Hillary’s campaign chairman’s brother did the same. \\nDespite everything that we already know about Hillary, about half the country still plans to vote for her. \\nIf the American people willingly choose to elect the most corrupt presidential candidate in our history, it may be a sign that the events that I talk about in my new book are a lot closer than many people had originally been anticipating. \\nBut the good news is that a Clinton victory is looking a whole lot less likely than it was just a week or two ago. \\nCould it be possible that the FBI has just delivered the “ miracle ” that Donald Trump desperately needed? \\nAmericans are more emotionally invested in this presidential campaign than they have been in any presidential campaign since at least 1980. Many of those that are backing Trump will be emotionally devastated if he does not win on November 8th, but if Trump does win we are likely to see the radical left throw a political temper tantrum unlike anything that we have ever seen before. \\nEarlier today, I shared with my readers the amazing fact that Donald Trump would be 70 years, 7 months and 7 days old during his first full day in the White House if he wins the election. \\nMany conservatives are fully convinced that it is Donald Trump’s destiny to be president. \\nPersonally, I do not know what is going to happen. But with a race this close, it may be the courts that end up deciding who our next president is, and that is an outcome that none of us should want to see. \\nTake a look at the future of America: The Beginning of the End and then prepare Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here . shares\""}, "time": 1742562062.2317271}