{"duration": 0.06803560256958008, "input_args": {"text": "'MILO’s event at the University of California, Davis has been cancelled after protesters tore down barricades and engaged in scuffles outside the venue. A camerman for ABC10 was also attacked with hot coffee. [Earlier reports that windows had been smashed at the venue have not yet been confirmed.  UPDATE: UC Davis has stated that no property damage was sustained. UPDATE 2: There are now competing accounts of what happened. A protester appears to have acknowledged property damage, saying he was “happy” windows were broken and that they had to smash windows “to get attention. ” #BREAKING UC Davis College Repubicans announce through loud speaker Milo Yiannapoulos event officially cancelled, after protests.  —   stevelarge_cbs13 (@largesteven) January 14, 2017,  At least one protester was arrested at the venue, according to photos. UC Davis Police standing between protestors and lecture hall where controversial Milo Yiannapoulos is now cancelled. pic. twitter.   —   stevelarge_cbs13 (@largesteven) January 14, 2017,  Organizers, UC officials,  police discussing safety of holding #SHKRELOPOULOS event @ucdavis #abc7now pic. twitter.   —   Katie Utehs (@KatieUtehs) January 14, 2017,  MILO and his   entrepeneur Martin Shkreli are both reportedly unharmed. One student was arrested. Shrekli was videoed outside the venue, where he explained his plans to explain   feminism to MILO. #MartinShkreli, the other controversial speaker taking selfies with fans  talking to media @ucdavis @ABC10 pic. twitter.   —   Frances Wang (@ABC10Frances) January 14, 2017,    reports “violent interactions with protesters. ” Video footage shows protesters jumping barricades and throwing them towards police. University of California, Davis cancels event featuring Milo Yiannopoulos and Martin Shkreli after protests, fights pic. twitter.   —   BNO News (@BNONews) January 14, 2017,  When protestors started rushing the barricades, getting dragged out @ucdavis @ABC10 pic. twitter.   —   Frances Wang (@ABC10Frances) January 14, 2017,    reporter Frances Wang reports that her photographer was attacked with hot coffee  . My photographer was doing an interview when someone poured hot coffee on him  out equipment. @ucdavis @ABC10 pic. twitter.   —   Frances Wang (@ABC10Frances) January 14, 2017,  Protesters were chanting “no justice, no peace, no racist police. ” Protestors chanting ”No justice, no peace. No racist police.” @ucdavis @ABC10 pic. twitter.   —   Frances Wang (@ABC10Frances) January 14, 2017,  Protesters could be seen wearing masks, holding LGBT flags, and wearing “ ” badges.       Protesters also chanted an old staple, “No Milo, no KKK, no fascist USA. ” ”No Milo, no KKK, no fascist     …    no Breitbart.” @ucdavis @ABC10 pic. twitter.   —   Frances Wang (@ABC10Frances) January 14, 2017,  Protesters @ucdavis Milo Yiannopolous  Martin Shkreli event. #abc7now pic. twitter.   —   Katie Utehs (@KatieUtehs) January 14, 2017,  MILO fans were also present at the event, interacting with protesters and singing the national anthem. At least one brought her own placard. Protestors now chanting on both sides of Yiannapoulos event. pic. twitter.   —   stevelarge_cbs13 (@largesteven) January 14, 2017,  Protestors on @ucdavis campus. Peaceful so far, but a lot of people here for Milo mocking the protestors. @ABC10 pic. twitter.   —   Frances Wang (@ABC10Frances) January 14, 2017,  Those here for Milo are singing ”land of the free” at protestors with   signs @ucdavis @ABC10 pic. twitter.   —   Frances Wang (@ABC10Frances) January 14, 2017,  Those here for event going back  forth with protestors. @ABC10 pic. twitter.   —   Frances Wang (@ABC10Frances) January 14, 2017,  This was set to be the first event on the third leg of the Breitbart senior editor’s “Dangerous Faggot Tour, Protesters @ucdavis Milo Yiannopolous  Martin Shkreli event. #abc7now pic. twitter.   —   Katie Utehs (@KatieUtehs) January 14, 2017,  This story is developing, and will be updated as more information, photos and footage comes in. UPDATE: A statement from the UC Davis College Republicans: “We were told by the chief of Davis police that they could not guarantee the safety of the students, the speaker, or the police officers if the event should go ahead,” said Gabrielle McDowell, vice chair of the UC Davis College Republicans. “As the organisation hosting the event, we would have been held personally responsible for any harm caused as a result of its taking place. We were therefore forced to cancel the event” she continued. UPDATE 2: The Davis College Republicans have clarified their position, and are now saying they were lied to and intimidated by UC Davis, who, according to DCR executive director Andrew Mendoza, “basically took the decision [to cancel] without us. ” DCR communications director Kurtie Kellner also alleges that they were told by UC Davis official Milton Lang that protesters were wielding hammers, a concern that was a significant factor in the decision to cancel.'"}, "time": 1742562539.62347}