{"duration": 0.06612372398376465, "input_args": {"text": "'Email \\nFollowing one of the most contentious presidential elections in recent memory, Hillary Clinton won more popular votes than Donald Trump in the nationwide election — while losing to Trump in the Electoral College vote. As of Wednesday morning (when this is being written), incomplete returns showed Clinton leading Trump by 165,292 popular votes — 59,344,158 to 59,178,867. But since the Constitution still reigns, members of the Electoral College are expected to meet next month and elect Donald Trump as the 45th president of the United States. \\nArticle II, Section 1, Clause 2 of the Constitution states: Each State shall appoint, in such Manner as the Legislature thereof may direct, a Number of Electors, equal to the whole Number of Senators and Representatives to which the State may be entitled in the Congress…. \\nThat means that 100 electors (representing two senators from each of the 50 states) plus 435 electors (representing the 435 members of the House of Representatives) plus three electors granted to the District of Columbia (a total of 538 electors) will actually elect the next president of the United States, not the voters themselves. Those electors are going to give Trump at least 289 votes, more than the 270 needed to elect him as president. \\nIf Hillary had her way she would be president instead. As far back as the year 2000, in her first public appearance as New York’s junior senator-elect, she said: “I believe strongly that in a democracy [sic], we should respect the will of the people, and to me that means it’s time to do away with the Electoral College and move to the popular election of our president.” \\nWhich is precisely why the Founders of the Republic did everything they could think of to keep the newborn republic from being transformed by power seekers such as Clinton into a democracy by putting in place such apparent anomalies as the Electoral College. \\nWriting in The New American , constitutional lawyer Joe Wolverton explained one of the reasons why. In an article just before the national elections in 2012, he noted: As the situation stands today, a successful candidate is required to build a coalition of electoral support from across the country. The frequent trips to Iowa, New Hampshire, and other less populous states witness this campaign reality. To be elected, a candidate cannot simply woo voters in urban areas while ignoring those citizens living between the two coastal megalopolises. Should [a] National Popular Vote measure become the de facto law of the land, a candidate could simply spend time, money, and attention on the large cities in order to ensure garnering a plurality of votes on Election Day. \\nJohn Ryder, then a member of the Republican National Committee, expanded: “Under such an arrangement, presidential candidates would have no incentive to campaign anywhere except the major media markets in a few states. The country would, in essence, cede our presidential elections to the largest metropolitan areas, whose concerns are different from those of other areas of the country.” \\nThe Founders knew from history the dangers of letting a majority override the interests and rights of a minority — that that majority would eventually become tyrannical, inimical to the minority’s rights. Constitutional scholar Dan Smoot explained: From their vast knowledge of history, the American Founding Fathers knew that unlimited political power cannot safely be trusted to anyone — not to appointed officials of government, not to elected representatives of the people, not to the people themselves. Hence, they devised a system to control political power by dispersing it and balancing it so that too much power could not be concentrated in any one place. \\nBy requiring the states to nominate its own electors, those smaller states would have a larger voice in the national election, as James Madison noted in The Federalist Papers : “It may well be that the public voice, pronounced by the representatives of the people , will be more consonant to the public good than if pronounced by the people themselves.” (Emphasis added.) \\nMadison continued: The immediate election should be made by men most capable of analyzing the qualities adapted to the station [of president] and acting under circumstances favorable to deliberation, and to a judicious combination of all the reasons and inducements which were proper to govern their choices. A small number of persons, selected by their fellow citizens from the general mass, will be most likely to possess the information and discernment requisite to so complicated an investigation. \\nPulitzer-Prize winner and conservative commentator George Will saw clearly what the Founders were trying to accomplish through the Electoral College’s interposition between the people and those running for the presidency, noting: The core principle of our republicanism is representation: The people do not decide things[;] they decide who will decide. Representatives are supposed to deliberate about the national interest, not just broker demands registered from various factions. \\nThere were other reasons as well. Gouvenour Morris, a Founding Father who represented Pennsylvania during the Constitutional Convention in 1787, explained that there were fears of “intrigue” if the president were chosen by a small group of men who met clandestinely, as well as concerns over his independence from the Legislative branch if he was elected by the Congress. \\nFisher Ames, a member of the first three Congresses, was blunt: The Electoral College was designed to protect the citizenry against the dangers and ravages of a runaway democracy: “Popular reason does not always know how to act right, nor does it always act right when it knows.” He added that “every move … towards a more complete, unmixed democracy is an advance towards destruction; it is treading where the ground is treacherous and excavated for an explosion. Liberty has never yet lasted long in a democracy; nor has it ever ended in anything better than despotism.” \\nA scant 165,292 votes cast on Tuesday, without the Electoral College in place, would have elected one skilled in the ways of treachery, despotism, and destruction. \\n\\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. \\nRelated articles: '"}, "time": 1742628607.3560638}