{"duration": 0.262317419052124, "input_args": {"text": "'• The record seven awards for the musical “La La Land” included for best picture comedy or musical and wins by Ryan Gosling and Emma Stone. “Moonlight” won for best picture drama. • Meryl Streep gave an impassioned, politically charged speech after receiving the Cecil B. DeMille Award. • Casey Affleck, Viola Davis, Isabelle Huppert and Tracee Ellis Ross also won awards. Here is a list of the winners. • And in TV categories, “The Crown” and “Atlanta” were triumphant. • Wesley Morris, Melena Ryzik and Dave Itzkoff provided   commentary. And The Times was also on the red carpet. The     “La La Land” dominated the 74th Golden Globes on Sunday, receiving a promotional boost in the form of a lavish tribute that kicked off the awards telecast and collecting a record seven prizes, including one for best comedy or musical. No film has won more than four Globes since 1979, when the crime drama “Midnight Express” received six, the previous   number. “I’m in a daze now officially,” said the force behind “La La Land,” Damien Chazelle, 31, as he accepted the directing award. Noting the “La La Land” plot  —     dreamers try to make it in show business  —   Emma Stone said in accepting the award for best actress in a musical or comedy, “I think that hope and creativity are two of the most important things in the world, and that’s what this movie is about. ” “La La Land,” made by Lionsgate, also won Globes for song, score, screenplay and actor. The bliss felt by the “La La Land” cast and crew was likely mirrored by the disappointment of those involved with “Moonlight,” the night’s    film. Despite six nominations, “Moonlight,” about a young black man growing up in Miami, received a lone trophy  —   albeit an important one: best drama. “Please, tell a friend, tell a friend, tell a friend,” Barry Jenkins, the director of “Moonlight,” said in accepting the award, trying to boost the art film’s box office performance. A year after Hollywood was excoriated for its lack of diversity at the Oscars, inclusion was a major theme on Sunday. “This is for all of the women of color and colorful people whose stories, ideas, thoughts are not always considered worthy,” said Tracee Ellis Ross, as she accepted the best television actress Globe for her role in the ABC series “ . ” “I want you to know that I see you. We see you. ” Ms. Ross was the first black woman to win in the category since 1983, when Debbie Allen won for “Fame. ” There were several surprises. Isabelle Huppert took best actress in a drama for the French film “Elle,” beating Natalie Portman, who was favored to win for “Jackie. ” (“Elle,” a thriller about a businesswoman who tracks her rapist, also won best foreign film.) The foreign journalists who bestow the Globes are known for spreading their awards far and wide, but several films received nothing, including “Florence Foster Jenkins,” “Lion,” “Hacksaw Ridge” and “Hell or High Water. ” “Manchester by the Sea,” despite five nominations, was honored only in the best actor category for Casey Affleck. HBO, despite 14 nominations, the most of any network, was shut out altogether. The first award of the night, for best supporting actor, dropped jaws: Aaron   won for his performance in Tom Ford’s   “Nocturnal Animals,” beating favorites like Mahershala Ali of “Moonlight. ” “I made it  —   thank you,” Mr.   said, looking a bit startled. To the surprise of almost no one, Viola Davis took the supporting actress prize for playing a 1950s homemaker in “Fences. ” After doling out two kisses, one to her husband and one to Denzel Washington, who directed “Fences” and stars in it, Ms. Davis thanked its producers for taking a risk on the film. “It doesn’t scream moneymaker,” she said. “But it does scream art. It does scream heart. ” Early television awards were widely distributed. The   FX series “Atlanta,” about an aspiring rapper and his manager cousin, was honored as best comedy and Donald Glover won for best comedic actor for his performance in the show. Beating the likes of Rami Malek (“Mr. Robot”) and Bob Odenkirk (“Better Call Saul”) for best actor in a drama was Billy Bob Thornton, honored for his performance in “Goliath,” a show with little buzz. Best actress in a TV drama went to Claire Foy, who plays a young Queen Elizabeth II in Netflix’s “The Crown,” which won for best dramatic series. As expected, “The People vs. O. J. Simpson: Crime Story” was named best   and Sarah Paulson, repeating her win at the Emmys, collected a trophy for her portrayal of the prosecutor Marcia Clark in that show. A   Ms. Paulson was showered with hugs from   as she returned to her seat. The night got off to a jerky start. After the host, Jimmy Fallon, opened the show with the taped “La La Land”  number, he became befuddled after a teleprompter malfunction. Still, he kept it breezy. “Let’s make tonight a celebration,” Mr. Fallon said in his monologue. Despite promises in preshow interviews to zing Donald J. Trump ahead of his inauguration, Mr. Fallon even kept his political jokes to a minimum. “One of the few places left where America still honors the popular vote,” he said, almost in a mumble. For casual movie fans, the annual Oscar race starts with the Globes. (Oscar nomination ballots are due on Friday.) But the Hollywood Foreign Press Association, the group behind the Globes, has worked in recent years to make its television honors more relevant by leaning toward rookie shows like “The Affair” and “Transparent. ” Hollywood stylists spent most of the week fretting about the weather forecast. For days, it looked like torrential rain would threaten a repeat of the 2010 Globes ceremony, when the red carpet turned into a swamp. On Sunday, however, Angelenos awakened to “another day of sun,” to borrow a lyric from “La La Land. ” When Meryl Streep, a   Globes nominee and   winner, accepted her Cecil B. DeMille lifetime achievement award, she gave an impassioned speech that, while never mentioning Mr. Trump by name, was a clear reaction to the election. “Take your broken heart, make it into art,” she said, quoting Carrie Fisher. Mr. Trump, in a brief telephone interview, said that he had not watched the Globes or Ms. Streep’s speech, but that he was “not surprised” that she and some other entertainment figures had criticized him during the Hollywood event. “Meryl Streep introduced Hillary Clinton at her convention, and a lot of these people supported Hillary,” Mr. Trump said, referring to Ms. Streep’s remarks at the Democratic National Convention last summer on behalf of Mrs. Clinton. While winners steered away from directly criticizing Mr. Trump, several used their moment onstage to take clear jabs. The British actor Hugh Laurie, collecting a   actor award for “The Night Manager,” said: “I can say I won this at the   Golden Globes. I mean, it has the words ‘Hollywood,’ “Foreign’ and ‘Press’ in it. ” He added, “I also think to some Republicans, even the word ‘Association’ is sketchy. ” Some Trump supporters, either anticipating the barbs or irritated that many Hollywood stars have been outspoken in their horror at his election, made #BoycottGoldenGlobes trend on Twitter early on Sunday. The Golden Globes are great fun, and so is its red carpet. Among this year’s first arrivals were the Stallone sisters, this year’s Miss Golden Globes, shepherded about by their father Sylvester’s     publicist no buttering up of reporters. A news crew from Canada was promised a question with the sisters but then told “They need to go do Twitter” first. Issa Rae and Donald Glover were among the luminaries who admitted to feeling slightly intimidated to being there. Mr. Glover said he really wanted to meet Ms. Davis, and that he was still shocked at the huge response to “Atlanta,” his FX series. “It was supposed to be a punk show,” he said. “And they screened it at A. F. I. and Scorsese was laughing. ” Ms. Rae, of the HBO show “Insecure,” said she was still adjusting to her growing fame. “I’m an introvert, I barely leave the house,” she said. “To be out here is a blessing but I’m like: ‘Wow, guys. It’s just me. ” Even though Netflix has upended the TV industry, that streaming service had never won in the best drama or comedy category at the Globes (and the Emmys, for that matter). That changed this year with “The Crown,”  which was named best drama. Claire Foy, who plays Queen Elizabeth, won for best actress in a drama. “The Crown” beat out “Stranger Things,” also from Netflix “Westworld,” the HBO series that practically requires a Ph. D. to understand it NBC’s   “This Is Us” and HBO’s “Game of Thrones. ” Another closely watched television race was for best comedic actress, where Ms. Ross beat out some stiff competition to become the first black woman to win in the category since Debbie Allen in 1983. Also nominated were the   Globe winner Sarah Jessica Parker, for her role as a   suburban mother in HBO’s “Divorce” Ms. Rae, nominated for her   performance in HBO’s “Insecure” Julia   from the network’s “Veep” and last year’s winner, Rachel Bloom (“Crazy  ”). Globe voters have ardently tried to leave behind their reputation for paying more attention to celebrity than honoring the year’s best performances. Once upon a time, Globe attendees also bellied up to the open bar in a boozy spectacle, but nominees  —   heeding the scolding eyes of their publicists  —   have largely started sticking to water. Despite moments of seriousness, however, the Globes lived up its raucous reputation. The “Modern Family” star Sofia Vergara made anus jokes from the stage. NBC censors bleeped expletives from Amy Schumer. Dinner guests in multiple instances chatted right through the speeches. As ever, the ballroom’s smoking patio was chockablock with stars at one moment, Sophie Turner from “Game of Thrones” lit her cigarette off one held by her   Maisie Williams. The young “Stranger Things” cast members ran around taking selfies. As ever, the ceremony’s success will be determined by the Nielsen ratings. About 18. 5 million people watched last year, down from 19. 3 million in 2015. Televised award shows in general have been suffering from viewer erosion, partly because there is a seemingly endless array of them, but NBC had high hopes for Mr. Fallon. He has a much wider fan base than Mr. Gervais and has been using his “Tonight Show” perch as a promotional platform for the gig.'"}, "time": 1742563138.043958}