{"duration": 0.06119418144226074, "input_args": {"text": "'I’ve long been a fan of shaggy white coconut layer cakes, filled and frosted with   meringue. But it was only recently that I encountered its more flamboyant cousin, the ambrosia cake. It’s got the white cake layers, billowing frosting and shredded coconut of the classic, crossed with the juicy citrus of ambrosia, the salad or dessert of oranges or mandarins, pineapple, strawberries and coconut embedded in whipped topping or sour cream. Sometimes a few marshmallows are thrown in for good measure. I didn’t grow up eating ambrosia. I didn’t even meet it in the flesh until college, when the cafeteria served it at the salad bar. One of my friends spooned up a hefty portion, explaining that it reminded her of her granny. It also came with a warning: “If your granny didn’t make it, it might not be your thing. ” My granny didn’t make it, and it isn’t my thing. But those same elements combined in a cake? That I can appreciate. Because there are so many ambrosia variations  —   almost as many as there are grannies  —   there are many versions of ambrosia cake. Some go all out in the fruit department, using oranges or mandarins, pineapple and bananas. Some add the likes of pecans, maraschino cherries and miniature marshmallows. All have some kind of white frosting and a liberal coating of shredded coconut. In my version, I opt for fewer elements and use them in several ways. I skip pineapple and bananas and stick with citrus, choosing seedless clementines over mandarins and oranges. Some are juiced and stirred into a tangy curd to slather between the layers. I cut others into sections to add a fresh burst of fruit. If you miss the pineapple and bananas, feel free to add some to the filling. Similarly, the coconut appears in the cake itself (as coconut milk, oil and, if you would like, coconut rum or extract) and again in a shredded form in the filling and as a garnish. You can use either sweetened or unsweetened shredded coconut. Sweetened is the more traditional choice. But with its abundance of marshmallowlike meringue frosting, this cake doesn’t need the extra sugar. But I go for sweetened coconut every time. I don’t love it as a salad garnish, but on a cake, it’s ambrosial. Recipe: Ambrosia Cake Follow NYT Food on Facebook, Instagram, Twitter and Pinterest. Get regular updates from NYT Cooking, with recipe suggestions, cooking tips and shopping advice.'"}, "time": 1742561806.903927}