{"duration": 0.042395830154418945, "input_args": {"text": "'Masoud Barzani Pledges That Kurdish Forces Won’t Enter Mosul Posted on Oct 29, 2016 \\nBy Juan Cole / Informed Comment \\nMasoud Barzani, the president of the Kurdistan Regional Government (a super-province of Iraq) said Thursday that the KRG paramilitary, the Peshmerga, will not enter Mosul. \\nHe also remarked that last week’s Daesh attack on Kirkuk was an attempt to divert attention from the terrorist organization’s failures in Mosul. \\nAt a news conference in Ninewah Province with Ammar al-Hakim, leader of the National Coalition (and of the Islamic Supreme Council of Iraq, a Shiite clerically led party), Barzani said, “Peshmerga forces will not enter the city. The counter-terrorism brigades will be the ones who go in . . .” He was referring to the Iraqi army special forces, 3 brigades under the Iraqi Counter Terrorism Service, which are crack troops who have been at the forefront of the liberation of Iraqi cities from Daesh (ISIS, ISIL). \\nBarzani presumably made this announcement to assuage fears of Iraqi Arabs that the KRG would take advantage of the campaign against Daesh to annex Mosul or parts of Mosul to Iraqi Kurdistan, as they annexed Kirkuk province in 2014. It is significant that he said this in the presence of al-Hakim, an important Shiite clerical and political leader who is supporting the government of prime minister Haydar al-Abadi. Barzani is underlining that the Mosul campaign is national and not ethno-sectarian. \\nMeanwhile, Central Command head, Gen. Joseph Vitel, estimated that in the week and a half of the Mosul campaign, some 900 Daesh fighters have already been killed. There were only an estimated 3500 to 5000 fighters in Mosul when the campaign began, with another 2000 in positions around the city. Presumably most of those killed belong to the latter group, meaning that the outskirts now have as few as 1100 fighters. \\nAdvertisement Square, Site wide \\nVitel admitted that because the Iraqi army left the western gate of the city open and did not completely encircle Mosul, small bands of Daesh fighters were slipping out of the city in civilian clothing. Letting them escape, he suggested, was preferable to having to fight them all hand-to-hand in Mosul’s back alleys. Moreover, civilians can escape by the same route, and some 10,000 have already fled. \\nHundreds of thousands of civilians could be displaced by the campaign, in a city of about 1 million (half its size before it fell to Daesh in 2014). TAGS:'"}, "time": 1742562981.9974296}