{"duration": 0.1666882038116455, "input_args": {"text": "'This week Congressman Steve King of Iowa made the following comment on his Twitter account about the outcome of the Dutch election contest between nationalist candidate Geert Wilders and the incumbent socialist Prime Minister:[Wilders understands that culture and demographics are our destiny. We can’t restore our civilization with somebody else’s babies. By the ensuing mud fight, you would think Congressman King had praised the beheading of children or “honor killings. ” But, no: King had only committed a crime against “diversity” by saying American culture is different and is worth saving.  Geert Wilders’ party did not win a majority in the Dutch national parliamentary elections on March 11  —   actually, no party did —   but he did increase his party’s share of the popular vote by about 30 percent. That means his views are attracting growing support, and to applaud that trend that arouses anger among progressives  —  and yes, hatred —  against Steve King. Wilders is a leader among Europeans seeking to halt unrestricted immigration by millions of Muslims fleeing the Middle East’s civil wars and terrorist violence. Steve King Is watching the slow collapse of European civilization and suggesting that the United States follow a different course. Perhaps if his Republican critics bothered to examine the demographic assault on Europe they would not be so quick to condemn his Paul   warning. Turkish President Erdogan tells Muslims in Europe to have “at least five children,” because, “You are the future of Europe. ”  Do you think Erdogan is planning to win the 2040 World Cup —  or something more “comprehensive. ”  If the Muslim Brotherhood has its way, it is the future of America as well. Congressman King was attacked mercilessly for “racist Twitter comments. ”  Really? “Racist”? Must every difference of opinion on important matters be reduced to a duel between white hat progressives and black hat “racists”?  What is going on here? First to attack Congressman King were the     like the Southern Policy Law Center, The New York Times, and the usual gang bangers. But the leftist watchtowers of political correctness were soon joined by mainstream media assassins, who painted a picture of a “white nationalist” politician who deserved to be pilloried as an enemy of diversity and civil rights. After the initial attacks, Rep. King went on CNN to defend his remarks. In an interview with CNN’s Chris Cuomo, King explained: [I] meant exactly what I said. You cannot rebuild your civilization with somebody else’s babies. You’ve got to keep your birth rate up, and you need to teach your children your values. That is shocking: Congressman King believes parents should teach their children their values. Wow. Now there’s a radical idea. The globalists at CNN evidently think parents should either not teach values at all or should teach someone else’s values. Whose values? Maybe the values of the UN Human Rights Commission? Or the values spewed out bilingually by   Jose Ramos at Univision? But, wait: something here does not add up. King wasn’t being attacked for advocating less immigration. He was attacked for saying our nation would be better off if we reproduced our own children and our own values —  which implies —  oh, my, God —  implies our values might be superior to imported values! Okay, not everyone agrees with that, but how is it “racist”? Are Catholics racist if they oppose abortion —  even if more black babies are aborted in New York City than are born there? We have entered an era of   when opposition to any progressive policy  —   such as unrestricted migration across open borders, or unrestricted access to public welfare benefits  —   is pilloried and slandered as “racist. ” This new   censorship is hailed as “progress,” when in reality, it is a hallmark of totalitarian repression. Steve King did not say that only white Americans should have more babies he wants more American babies, period. Yes, that’s an example of putting “America First,” and you can either agree or disagree with it. But to slander it as racist is, well, plainly  . Congressman King’s statements were not racist any more than people who want secure borders are “ . ” Immigrants are people who arrive legally after a long process that takes many years. Proposing that there be no restrictions on who enters our country  —   and that we must take in all migrants who appear on our borders  —   is not a “humanitarian” policy, it is an unforgivably destructive and dangerous one. The ongoing debate over how many and what kind of immigrants America needs should be a policy debate, not a   brawl, but that is what the globalists are doing —  dragging everyone into a brawl. We have seen it over and over again, this orchestrated orgy or character assassination aimed at silencing all dissent from the globalist, multicultural agenda. If America is already the world’s “melting pot,” then the sons and daughters born inside that caldron of intercultural assimilation will necessarily represent those same races and colors. So, exactly how is  it “racist” or “white nationalist” to suggest we need to pass on our values to the next generation of Americans  —   and not rely on young adults arriving from other cultures? How is Steve King’s statements any different than the values expressed in President Trump’s “American First” inaugural address? Of course, they are not, and indeed, attacking King is another way of attacking President Trump’s nationalism. Too many establishment Republicans run for the tall grass when an ounce of moral courage is needed.  Republican criticism of Congressman King came quickly from some of the media’s favorite “ ” sources when patriotic heretics are spotted on the horizon. Quick on the draw was a “  ” amnesty bill supporter, Florida congresswoman Ileana   who went to her Twitter tool to attack King, “Get a clue  …    . Diversity is our strength. ”  Oh, but, let’s not have too much diversity in Congress. Iowa has got to go! Other Republicans who joined the lynch mob were current House Speaker Paul Ryan. “The speaker clearly disagrees and believes America’s long history of inclusiveness is one of its great strengths,” spokesperson Ashlee Strong said. Representative King is simply the latest victim of the merchants of globalism. His language may have been a little crude, but his point was not only valid but a necessary caution against the bitter fruit of open borders anarchy. The attempt to slander and demonize Steve King is more than an attack on a   “border hawk. ” The vitriol hurled at Congressman King is more intense than normal not because he is criticizing other nations or other cultures  —   he did not do that —   but because he is praising our own culture and values —  American values —  and saying we must preserve those values. THAT is what is unforgivable in “  America. ” Congressman King has touched a raw nerve and the progressive globalist counterattack has been visceral.  To the American left, it is now racist to believe American values are worth defending, worth teaching to our children, worth preserving for future generations. Anyone who speaks out in praise of American values or suggests American values may be in danger of eclipse from massive immigration without cultural assimilation —  that person and those ideas must be rejected, then marginalized, and then destroyed. I am proud to call Congressman Steve King my friend. Americans who care about constitutional liberty and the independence of the American homeland should care equally about preserving the unique culture that undergirds those liberties and our national sovereignty. That uniquely American culture is not the one embodied in United Nations High Commission on Refugees, nor the one enforced by repression the People’s Republic of China, nor the culture enforced by religious persecution in Turkey and Saudi Arabia. And it is not the culture celebrated in Hollywood in Bill Maher’s condescending monologues.'"}, "time": 1742562074.2343094}