{"duration": 0.035930633544921875, "input_args": {"text": "'Actress Anne Hathaway called out what she described as Hollywood’s double standards for women in an interview for this month’s cover story of Elle magazine. [“Hollywood is not a place of equality. I don’t say that with anger or judgment it’s a statistical fact,” Hathaway said when asked what it’s like to star in Ocean’s Eight, the   spinoff of the 2001 casino heist caper Ocean’s Eleven. “And even though I’ve been in some   films, I’ve never been in a film like this. ”  The Academy   says filming a movie starring seven other   actresses forced her to come to grips with their shared struggled in the film industry in a way that male actors probably don’t think much about. “It just kind of makes you aware of the ways you sort of unconsciously change yourself to fit certain scenarios. It’s not better or worse or right or wrong, but there are certain things you understand about one another because of experiences you have in common  …    it’s probably easy for men to take that for granted,” Hathaway said. “Just being on a set where I’m the one who possesses that ease is really something,” she said of filming alongside Sandra Bullock, Cate Blanchett, Rihanna, Sarah Paulson, Mindy Kaling, Awkwafina, and Helena Bonham Carter. “It’s a nice alternative narrative. ” As U. N. Goodwill Ambassador for Women, Hathaway advocates for paid parental leave in the United States. In a speech last week before the United Nations, the    actress and mother championed the United States’ Family and Medical Leave Act, which would grant new parents 12 weeks of unpaid maternity leave. “I can’t believe we don’t already have it,” she told Elle. Hathaway is hardly the only actress to call out Hollywood and the film industry’s treatment of its female stars. Other actresses who have commented on the issue recently include Jennifer Garner, Kristen Stewart, Melissa McCarthy, Helen Mirren and Sienna Miller.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562730.424625}