{"duration": 0.1773052215576172, "input_args": {"text": "'Pat Buchanan, an adviser to Richard Nixon, presidential candidate, and original rallying point of the American   movement spoke with Breitbart News Wednesday to discuss the myriad Watergate comparisons making the rounds in Washington. [Since FBI Director James Comey’s ouster last week, the common Washington trope of Watergate comparisons has reached a fever pitch. Within hours of the announcement, a George W. Bush administration ethics attorney was telling Rolling Stone the Trump White House was now “worse than Watergate. ”  The trend continued, even among Republicans, into the next week as the   “Comey Memo” posited that Trump had told the   Director to “let it go” in regard to already fired National Security Advisor Michael Flynn. Sen. John McCain ( ) said Tuesday night that “I think it’s reaching the point where it’s of Watergate size and scale. ” Buchanan was known as a voice of the conservative base inside the Nixon White House, where he served as a senior adviser to the president throughout the more than    scandal that ended in the only presidential resignation in American history. As fate would have it, Buchanan released his second volume of political memoirs of the Nixon era, Nixon’s White House Wars: The Battles That Made and Broke a President and Divided America Forever, covering those very years, on the day of Comey’s dismissal. In conversation with Breitbart News, Buchanan rejected the idea we were at anything like the “smoking gun” moment of August 5, 1974: I think the comparison is grossly invalid for this reason, I don’t think there’s any crime in what I have read that Comey wrote. If Comey believed that the President of the United States had engaged in an obstruction of justice, he had a moral and a legal obligation to go to the Deputy Attorney General and tell him exactly what had transpired   …     He did nothing like that. He just put it in his files. Commentators, especially those on the left, rushed to invoke the “smoking gun tape” in explaining the Comey Memo Tuesday and Wednesday, a reference to the commonly used name for the   recording of a 1972 conversation between President Nixon and his chief of staff, H. R. Haldeman. President Nixon’s own voice ordering Haldeman to have the CIA prevent the FBI from following up on areas of their Watergate investigation was the “smoking gun” of presidential obstruction of justice. Its release in the summer of 1974, more than two years after the sensational   at the Democratic National Committee Headquarters in Washington, DC’s Watergate development, finally made defense of President Nixon untenable and led swiftly to his resignation. Convicted Nixon Attorney John Dean told CNN Tuesday that Comey’s Memo was a “direct parallel” to the smoking gun tape. Former Bill Clinton Speechwriter Bill Waldman argued roughly the same on the Daily Beast Wednesday. Buchanan found the comparisons “absurd,” explaining the context in which the smoking gun tapes became public: If you’re talking about the smoking gun tapes, that was revealed when I was at Camp David before Nixon’s resignation   …     That was 18 months into a Watergate crisis that had all manner of allegations of felonies and misdemeanors, and convictions, and trials. Since March of 1973 all the way through August of ’74. By the period described, over a dozen people had been indicted on serious charges relating to the initial   and subsequent   including several administration officials like Haldeman. Some, like G. Gordon Liddy, were already serving lengthy federal prison terms. Buchanan stressed that nothing of the sort occured to lend significance to Trump’s alleged comments to Comey. “So where is the crime?” Buchanan pondered. “There is no crime thus far. In this supposed hacking, there is no crime attributed to Donald Trump or his staff and no indictment in his alleged collusion with the Russians, because no collusion has been established. ” “To suggest that because Donald Trump said, ‘look, take it easy on General Flynn, he’s had a rough time’ that this is some crime, I think it’s absurd,” Buchanan argued. Even assuming the Comey Memo’s allegations are completely true, Buchanan was wary of comparing them to the deliberate interference in a fruitful criminal investigation by President Nixon: You’ve got a handful of words here. What exactly has [Trump] obstructed? What action did he take? He asks the FBI basically, “can you cut some slack for a guy who’s a good guy, and is in trouble, and has resigned from the White House. ” I don’t see any comparison at all. The comparison to the smoking gun tape was not the first attempt by some commentators to compare Comey’s dismissal to supposed Watergate equivalents. Comey’s ouster itself has been continually compared to the “Saturday Night Massacre” of 1973, where both Attorney General Elliot Richardson and Deputy Attorney General Bill Ruckelshaus resigned rather than obey Nixon’s direction to fire the special prosecutor appointed to investigate Watergate Archibald Cox, who eventually was fired by Solicitor General Robert Bork. Senator Ed Markey ( ) John Podesta, and newfound liberal hero former acting Attorney General Sally Yates have all publicly drawn the comparison to Trump’s decision to dismiss Comey  —   an act, unlike firing a special prosecutor like Cox, well within a president’s authority to take unilaterally. Buchanan himself wrote on the inevitable comparison on Monday. While he concluded that the media’s “hysteria” over a “constitutional crisis” from Comey’s firing did remind him of the Saturday Night Massacre, he explained Breitbart News Wednesday that the facts do not: I was in the Oval Office when Archibald Cox was fired. Here’s the comparison, when Archibald Cox was fired on the Saturday massacre, the Attorney General Resigned, the Deputy Attorney General resigned, the special prosecutor, Cox, was fired, the special prosecutor’s office was shut down, and we were already six months into the whole Watergate crisis. And there were resolutions of impeachment the next week, 20 of them on the floor of the House. We have here what? An FBI director has been fired, who says the president had a perfect right to fire him. And the investigation by the FBI into the   connection, which has produced zero fruit to date, continues on unimpeded. Deputy Attorney General Rod Rosenstein’s Wednesday decision to appoint a special counsel in the person of   Director Robert Mueller further isolates the Russia investigation from Trump’s dismissal of Comey. The probe will now be out of the normal FBI    which Trump’s nominee to replace Comey will head. Asked to compare the political climate in     Washington to that of the Watergate years, Buchanan explained: Because of the nature of media today, and the extraordinary contentiousness, virialence, and viciousness of the politics in the last four months, the mood in town and in the media   …     you’re getting to similar levels of heat and intensity and hostility that you had back then, but the substance is not there. “Most Americans weren’t even alive back in 1972, 73, 74. I can understand why some people rush and compare one thing to another,” Buchanan said, seeking to explain the prevalence of such comparisons. “There’s a gross exaggeration and something approaching a sense of insecurity and panic here in town when, again, it’s not justified by the reality. ” As for the likelihood of impeachment in the near future, as Rep. Al Green ( ) called for on the House floor Wednesday, Buchanan was skeptical. “The Republican Party that controls the House is not going to start House hearings on impeachment,” he said. Asked if he had any advice for the current generation of populist conservatives in the White House, Buchanan suggested unity and better information sharing among the president and his staff: The whole White House, they’ve got to get it together and organized   …     some of the staff has been pounded mercilessly and in most cases they’ve simply been left uninformed or been sent out uninformed of what the reality is and they awaken to new tweets. “It just is not working like a traditional White House and I think it really needs to be buttoned up,” Buchanan concluded.'"}, "time": 1742562719.1636713}