{"duration": 0.275632381439209, "input_args": {"text": "'  Dr. Eowyn | 2 Comments WARNING: \\nThis post may be the most important post you’ll read on not just the 2016 election, but the entire electoral system that legitimates the U.S. republic of representative democracy. The post is long, with multiple sections, so pace yourself accordingly. I suggest you bookmark this webpage so that you can return to read or re-read. † \\nJim Stone first posted about this two days ago on Nov. 1, 2016. \\nUnsure about Stone, who calls himself an “independent journalist” (based in Japan) and who writes in a less-than-clear or reader-friendly manner, I refrained from writing about his post. \\nThen InfoWars picked this issue up a day later on November 2. \\nWhat is claimed is that a hidden web site of NBC affiliate WRCBtv in Chattanooga, Tenn., shows pre-determined final vote counts for an election that hasn’t yet occurred — the 2016 presidential election scheduled for November 8. \\nBelow is a screenshot Jim Stone took of the election results on WRCBtv’s hidden webpage, showing Hillary Clinton winning with 343 electoral votes and 42% of the popular vote . As Stone puts it: “SCAM ELECTION ALREADY CONFIRMED. TRUMP LOSES.” \\nStone and InfoWars say the predetermined election results are provided by Worldnow.com. \\nSo what is WorldNow? \\nThis is what Wikipedia says, with a lot of jargon: \\n“WorldNow is a New York-based software company . . . [that] offers the only integrated media platform enabling broadcasters, operators and media companies to easily create, acquire, manage, analyze, monetize and distribute media assets (text, images and videos) across all digital platforms and on-air systems in a unified, end-to-end workflow . . . . Worldnow’s customers include CBS, COX, Dispatch, Fox Television, Meredith Corporation, Media General and Raycom Media . . . . On July 29, 2015, WorldNow announced its sale to Frankly, a San Francisco-based provider of white label social media services and mobile messaging apps . . . . In 2012, Fox Television Stations migrated its websites to WorldNow’s platform . . . becoming WorldNow’s second largest client (as of 2015, they have since switched to Lakana). In 2011, Meredith Corporation . . . began a four-year contract with WorldNow to operate its station websites. In January 2013, Media General reached a deal to move its eighteen stations to WorldNow, beginning with WFLA-TV.” \\nA “media platform” is a “platform,” medium or means of communicating news, such as a newspaper, TV station, Facebook , Twitter , or even a blog like FOTM . \\nI typed “worldnow.com” in the URL bar of my laptop, but was brought to the webpage of Frankly Inc. with this URL: http://franklyinc.com/ . \\nFrankly’s “About” page says: \\nWorldNow , the original broadcast arm of Frankly, was founded in 1999. We now serve over 200 stations across the United States as a true partner, offering customization services and strategic trainings on industry best practices for user engagement and monetization. \\nFrankly’s “Investors” page says: \\n“ Our customers include NBC, ABC, CBS and FOX affiliates , as well as top fashion brands, professional sports franchises and global organizations.” \\nIn other words, WorldNow is a media software company that provides real-time data – such as election results – to local TV news stations like WRCBtv . \\nYou can verify this for yourself by going on WRCBtv’s website: http://www.wrcbtv.com/ . Scroll down to the bottom of WRCBtv’s webpage, and you’ll see this in the bottom left of the webpage: \\nWRCBtv.com is “powered by frankly” and Frankly is the owner of WorldNow. In other words, WorldNow provides the content or the news for WRCBtv.com. \\nStone claims that for now, WRCBtv.com’s (predetermined) election results page is hidden, awaiting WorldNow to publicly post the (fake) election results sometime in the evening of November 8, Election Day. \\nI can verify that the webpage is currently hidden. Here’s what I did: I typed “ftpcontent2.worldnow.com/wrcb/elections/elections.html”in the URL bar, but was brought to a McAfee Web Advisor page warning of “Trouble ahead” and asking me”Are you sure you want to go there?” I then did a Yahoo search for “WRCBtv.com decision 2016”. My search’s results page has this at the top: \\nNote that it says “Decision 2016: Complete Election Results Posted”. I clicked the blue-colored “ DECISION 2016: Complete Election Results ” and was brought to this page of WRCBtv.com with the message: Our Apologies \\nThe page you requested is currently unavailable. Pages on this site are constantly being revised, updated, and occasionally removed. You may have followed an outdated link or have outdated pages in your browser cache. Here’s a screenshot I took: \\nSo how did WorldNow come up with its predetermined final vote counts for Hillary Clinton and Donald Trump ? \\nAnswer : A method called “ fractional vote “. \\nTo begin, a fractional vote feature is embedded in the GEMS election management system of electronic voting machines , which counts approximately 25% of all votes in the United States. \\nAs explained by Gun&Game , the fractional vote feature can be used to invisibly, yet radically, alter election outcomes by pre-setting desired vote percentages for the candidates. The tampering can be applied across large jurisdictions in less than 60 seconds; is not visible to election observers, even if they are standing in the room and watching the computer; and is unlikely to be detected by auditing or canvass procedures. \\nGEMS vote-counting systems operate under five trade names: Global Election Systems, Diebold Election Systems, Premier Election Systems, Dominion Voting Systems, and Election Systems & Software, in addition to a number of private regional subcontractors. GEMS is used statewide in Alaska, Connecticut, Georgia, Mississippi, New Hampshire, Utah and Vermont, and for counties in Arizona, California, Colorado, Florida, Illinois, Indiana, Iowa, Kansas, Kentucky, Massachusetts, Michigan, Missouri, Ohio, Pennsylvania, Tennessee, Texas, Virginia, Washington, Wisconsin and Wyoming. It is also used in Canada. \\nVote-rigging by electronic voting machines is real. \\nA 2006 Emmy-nominated HBO documentary, Hacking Democracy , investigates the flawed integrity of electronic voting machines, particularly those made by Diebold Election Systems (now Global Election Systems), and exposes previously unknown backdoors in the Diebold trade secret computer software. Hacking Democracy documents American citizens investigating anomalies and irregularities with electronic voting systems during the 2000 and 2004 elections, especially in Volusia County, Florida. The film culminates in the on-camera hacking of the Diebold election system in Leon County, Florida — the same computer voting system which has been used in elections across 39 states, and which still counts tens of millions of America’s votes today. \\nSo what is fractional or fractionalized vote? \\nFractional vote is a method to distort the results of an election by “weighting” the votes. Instead of the principle of “one person-one vote,” some votes are counted not as 1, but as a fraction of or less than 1 (e.g., ½ or ¼), or as more than 1 (e.g., 1½ or 1¾). The distortion of “one person-one vote” is in order to achieve a pre-assigned percentage of votes for each candidate. For example, Candidate A is pre-assigned 51% of the votes, Candidate B 44%, and Candidate C gets the rest — 5%. \\nAn algorithm is used to arrive at the pre-assigned percentages by changing the numbers automatically as the voting progresses. Although Candidate A in actuality received fewer number of votes than Candidate B, by “weighting” Candidate A’s votes, those votes are distorted in value, with one vote being counted, say, 25 times, so that Candidate A is the winner. And although Candidate B actually received more votes than Candidate A, Candidate B’s votes are “weighted” such that their values are less, with some votes converted to zero. The end result is that Candidate B loses. \\nAccording to Jim Stone, below are the numerical votes and percentages that are the pre-assigned presidential election results for the various states , which are already on the “Election Results” webpage of WMCtv.com, a local TV station in Memphis, TN. (But if you go onto that webpage — http://ftpcontent4.worldnow.com/wmctv/elections/wmc-electionresults.html — now, all the values are 0): \\nLine 119: US President Alabama Line 121: Donald Trump (R) 715,592 44% Line 122: Hillary Clinton (D) 634,275 39% Line 125: US President Alaska Line 127: Donald Trump (R) 115,252 44% Line 128: Hillary Clinton (D) 104,973 40% Line 133: US President Arizona Line 135: Donald Trump (R) 906,638 46% Line 136: Hillary Clinton (D) 867,218 44% Line 139: US President Arkansas Line 141: Hillary Clinton (D) 320,102 38% Line 142: Donald Trump (R) 289,862 34% Line 149: US President California Line 151: Hillary Clinton (D) 4,076,539 45% Line 152: Donald Trump (R) 3,643,970 40% Line 156: US President Colorado Line 158: Hillary Clinton (D) 452,857 23% Line 159: Donald Trump (R) 367,446 19% Line 180: US President Connecticut Line 182: Hillary Clinton (D) 508,013 45% Line 183: Donald Trump (R) 451,669 40% Line 186: US President Delaware Line 188: Donald Trump (R) 148,943 44% Line 189: Hillary Clinton (D) 132,602 40% Line 192: US President District of Columbia Line 194: Donald Trump (R) 111,157 45% Line 195: Hillary Clinton (D) 99,648 40% Line 198: US President Florida Line 200: Hillary Clinton (D) 2,758,845 44% Line 201: Donald Trump (R) 2,543,706 40% Line 206: US President Georgia Line 208: Donald Trump (R) 1,490,410 45% Line 209: Hillary Clinton (D) 1,324,808 40% Line 211: US President Hawaii Line 213: Hillary Clinton (D) 158,720 42% Line 214: Donald Trump (R) 152,232 41% Line 218: US President Idaho Line 220: Donald Trump (R) 198,675 44% Line 221: Hillary Clinton (D) 176,677 39% Line 228: US President Illinois Line 230: Hillary Clinton (D) 2,006,362 44% Line 231: Donald Trump (R) 1,807,369 40% Line 234: US President Indiana Line 236: Donald Trump (R) 1,077,142 45% Line 237: Hillary Clinton (D) 957,461 40% Line 239: US President Iowa Line 241: Donald Trump (R) 490,319 44% Line 242: Hillary Clinton (D) 436,740 39% Line 251: US President Kansas Line 253: Donald Trump (R) 392,701 44% Line 254: Hillary Clinton (D) 349,617 40% Line 257: US President Kentucky Line 259: Donald Trump (R) 721,167 44% Line 260: Hillary Clinton (D) 647,285 40% Line 265: US President Louisiana Line 267: Hillary Clinton (D) 565,941 38% Line 268: Donald Trump (R) 536,155 36% Line 280: US President Maine Line 282: Hillary Clinton (D) 223,591 43% Line 283: Donald Trump (R) 207,990 40% Line 286: US President Maryland Line 288: Hillary Clinton (D) 934,981 45% Line 289: Donald Trump (R) 831,655 40% Line 292: US President Massachusetts Line 294: Donald Trump (R) 960,930 44% Line 295: Hillary Clinton (D) 864,838 40% Line 298: US President Michigan Line 300: Hillary Clinton (D) 1,495,253 40% Line 301: Donald Trump (R) 1,420,490 38% Line 306: US President Minnesota Line 308: Hillary Clinton (D) 835,772 45% Line 309: Donald Trump (R) 643,190 34% Line 317: US President Mississippi Line 319: Donald Trump (R) 455,836 44% Line 320: Hillary Clinton (D) 404,169 39% Line 326: US President Missouri Line 328: Hillary Clinton (D) 919,407 44% Line 329: Donald Trump (R) 826,715 40% Line 333: US President Montana Line 335: Donald Trump (R) 124,285 35% Line 336: Hillary Clinton (D) 106,531 30% Line 340: US President Nebraska Line 342: Donald Trump (R) 266,304 44% Line 343: Hillary Clinton (D) 238,319 40% Line 346: US President Nevada Line 348: Hillary Clinton (D) 392,071 47% Line 349: Donald Trump (R) 349,756 42% Line 354: US President New Hampshire Line 356: Donald Trump (R) 233,389 44% Line 357: Hillary Clinton (D) 211,541 40% Line 361: US President New Jersey Line 363: Hillary Clinton (D) 1,225,655 43% Line 364: Donald Trump (R) 1,104,143 39% Line 372: US President New Mexico Line 374: Donald Trump (R) 257,643 41% Line 375: Hillary Clinton (D) 243,336 39% Line 382: US President New York Line 384: Hillary Clinton (D) 2,874,820 49% Line 385: Donald Trump (R) 2,464,969 42% Line 388: US President North Carolina Line 390: Hillary Clinton (D) 1,834,827 54% Line 391: Donald Trump (R) 1,427,089 42% Line 393: US President North Dakota Line 395: Hillary Clinton (D) 106,150 39% Line 396: Donald Trump (R) 81,170 30% Line 401: US President Ohio Line 403: Hillary Clinton (D) 1,768,330 45% Line 404: Donald Trump (R) 1,571,848 40% Line 408: US President Oklahoma Line 410: Donald Trump (R) 532,869 50% Line 411: Hillary Clinton (D) 479,581 45% Line 413: US President Oregon Line 415: Donald Trump (R) 437,729 35% Line 416: Hillary Clinton (D) 375,196 30% Line 419: US President Pennsylvania Line 421: Hillary Clinton (D) 1,892,527 44% Line 422: Donald Trump (R) 1,714,575 40% Line 426: US President Rhode Island Line 428: Hillary Clinton (D) 176,102 44% Line 429: Donald Trump (R) 158,149 39% Line 433: US President South Carolina Line 435: Hillary Clinton (D) 686,264 44% Line 436: Donald Trump (R) 610,431 39% Line 442: US President South Dakota Line 444: Donald Trump (R) 118,104 40% Line 445: Hillary Clinton (D) 88,577 30% Line 448: US President Tennessee Line 450: Donald Trump (R) 707,501 36% Line 451: Hillary Clinton (D) 699,358 35% Line 457: US President Texas Line 459: Hillary Clinton (D) 3,171,201 42% Line 460: Donald Trump (R) 3,020,193 40% Line 463: US President Utah Line 465: Donald Trump (R) 229,420 30% Line 466: Hillary Clinton (D) 191,184 25% Line 475: US President Vermont Line 477: Hillary Clinton (D) 102,409 44% Line 478: Donald Trump (R) 91,938 40% Line 483: US President Virginia Line 485: Hillary Clinton (D) 1,207,579 44% Line 486: Donald Trump (R) 1,087,068 40% Line 490: US President Washington Line 492: Hillary Clinton (D) 830,496 39% Line 493: Donald Trump (R) 679,285 32% Line 499: US President West Virginia Line 501: Hillary Clinton (D) 276,617 44% Line 502: Donald Trump (R) 248,391 40% Line 506: US President Wisconsin Line 508: Donald Trump (R) 795,047 40% Line 509: Hillary Clinton (D) 587,532 30% Line 515: US President Wyoming Line 517: Hillary Clinton (D) 41,824 30% Line 518: Donald Trump (R) 34,853 25% \\nAnticipating that skeptics or the vote-riggers would say that WRCBtv.com’s “hidden page” of election results is merely a “code test” for the TV station’s actual posting of election results on November 8, Jim Stone says that he’d “ripped the code out worldnow.com/kfvs12/elections.html” and can confirm “there is no active in it to need testing,\" i.e., \"the page has no code that will tabulate votes.\" The data on the hidden page are not codes, but are \"all just typed in.\" \\nThere is another way to demonstrate vote rigging of the 2016 election -- a webpage on election results of KFVS12 , a local TV station in Cape Girardeau, MO: http://82.221.129.208/ftpcontent4worldnowcomkfvs12elections.html . \\nThe webpage at present is a fakery in progress , with the final (fake) vote counts for some races already filled in, but blank for some other races. This afternoon, November 3, 2016, I took screenshots of every race with (fake) tabulations already filled in, but did not take screenshots of some blank races because I got tired of taking screenshots. The races with no (fake) vote counts are all minor races, such as those for city councils and local initiatives. \\nAsk yourself this question: \\nWhy would the website of KFVS12, a local TV station in Missouri, have the final vote counts for some races in the upcoming November 8 elections already filled in? \\nIf KFVS12\\'s election results webpage as it is now is merely a \"test-run\" to ensure that the webpage will be operative on November 8, why are the vote counts of some races -- all relatively unimportant local races -- blank? If the page is a \"test,\" there should be \"test\" vote counts for every race. \\nCan anyone offer another explanation for what\\'s been presented in this post? I\\'m open to alternative, non-election-fraud explanations. \\nIs our entire democratic polity an illusion? \\nH/t FOTM \\'s bongiornoc'"}, "time": 1742563979.7400873}