{"duration": 0.0347905158996582, "input_args": {"text": "'Members of the Yale College Republicans held a barbecue on Friday next to eight graduate student teachers on a hunger strike over the Yale University’s refusal to negotiate with its newly formed union. [While the eight protesters sat in a tent next to University President Peter Salovey’s home, having not eaten in three days, the college Republican group cooked up a meal of beef, baked beans, and corn on the cob for the local community.  Yale College Republicans barbecuing by union fast site pic. twitter.   —   gabrielwinant (@gabrielwinant) April 28, 2017,  The hunger strike concerned Yale’s unwillingness to negotiate a contract with its graduate teachers, who voted to unionize in February. The union, known as Local 33, is a subgroup of the international labor union UNITE HERE. The university’s refusal is currently being appealed to the National Labor Relations Board (NLRB) with the university reportedly hoping to hold out until Donald Trump appoints a new batch of   members to the NLRB. Asked about his reaction to the barbecue, Local 33 Chairman Aaron Greenberg told The New Haven Register, “I’m not really focused on that. I’m focused on making sure we have lots of water, make sure I’m healthy. We have a check in with our nurse this afternoon. We are focused on that. ” In fliers distributed before the strike, the organizers asked others to participate with them in solidarity, urging people to “sit with us and lift our spirits,” and “[join in] when one of us cannot continue. ” Greenberg also attacked the university for “siding with Donald Trump over members of their own community” by taking an   stance. “I think that is unacceptable. I think that is despicable. They say we have to wait, so we are waiting without eating,” he said. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742628417.7045567}