{"duration": 0.11992454528808594, "input_args": {"text": "'Of all forms of homage, attention to detail is perhaps the most loving. It requires not just knowledge and dedication, but also thoughtfulness. It prizes accuracy both out of respect to the historical record, but also to those who wrote it. It celebrates the vision of the original creators more than the disruptive instincts of reinterpreters. By that measurement, “The New Edition Story,” a vibrant, fiercely committed     that begins Tuesday on BET, is overflowing with love  —   a jubilant celebration of a group that was preternaturally talented and rivetingly tortured. Few groups in modern black pop are as deserving of this treatment as New Edition, which transported the elegance of the male vocal groups of the 1970s into the first wave of RB’s dance with   in the late 1980s. The act released four essential albums, a couple more good ones, and spun off careers for all its members  —   solo work by Bobby Brown, Johnny Gill and Ralph Tresvant, and a group, Bell Biv DeVoe, made up of the others. None of this happened without conflict. New Edition, which hailed largely from the Orchard Park projects in the Roxbury section of Boston, was a black act that was chided by its label for not being mainstream enough. The members squabbled with executives, management and among themselves. This was in many ways the archetype of the modern boy band  —   so much so that when New Edition left Maurice Starr, who produced the group’s early songs, he created New Kids on the Block, essentially a white copy. For all of its musical influence, the group is probably best known for its internal dramas, its contractual nightmares and for the troubled adulthood of Mr. Brown. “The New Edition Story” isn’t hagiography. Friction was integral to the group’s mystique, but the show spends a good deal of time on its earliest days as preteens trying to forge a style. (For this part of the series, the members are played by younger actors. Tyler Williams as Mr. Brown and Jahi Winston as Mr. Tresvant are particularly dynamic). New Edition’s ascent was rapid: “Candy Girl,” the group’s 1983 debut single, went to No. 1 on the Billboard hot black singles chart, and the group had successful hits until the end of the decade. But in this   that stretch of time is depicted as one of turmoil and dissatisfaction. Mr. Tresvant (Algee Smith, tender and limber) carries the disproportionate burdens of the lead singer, earning acclaim and resentment. And of course, there’s Mr. Brown (a combustible Woody McClain) who’s perpetually at war: with the other group members, with management, with law enforcement and, of course, with himself. “The New Edition Story” depicts a group of young men consistently slipping through the fingers of authority figures. That means their mothers (Sandi McCree as Carole Brown and Yvette Nicole Brown as Shirley Bivins are especially intense) their manager and choreographer Brooke Payne, played by Wood Harris, who conveys a   swagger with the tiniest cock of the head or extinguishing of a cigarette and their manager (in this case Gary Evans, a fictional   for the group’s manager in its late 1980s pop heyday) played by a manic Michael Rapaport. “The New Edition Story” is, by far, the best of the recent spate of black pop biopics, miles beyond the shoestring Lifetime entries about Toni Braxton and Aaliyah, films that have contributed to an air of lowered expectations for projects of this nature. Instead, “The New Edition Story”  —   written by Abdul Williams and directed by Chris Robinson  —   is more in keeping with the excellent “Unsung”   about black musicians on TV One. It tells the group’s story, warts and all. (But not all the warts: Many of the details of Mr. Brown’s tumult have been left aside, and certain incidents, such as the      quarrels with the RB group Guy that led to the shooting death of that group’s head of security, didn’t make the cut.) It undoubtedly helps the   that the whole group  —   the original members Mr. Brown, Michael Bivins, Mr. Tresvant, Ricky Bell and Ronnie DeVoe, as well as Mr. Gill, who joined after Mr. Brown’s departure  —   signed on as  . While that might mean some light sugarcoating, it also results in a historical narrative told with impressive detai l, particularly in regards to wardrobe and production design (kudos to the costume designer Rita McGhee). Album covers, dance routines and video shoots are remade down to the tiniest details (the remade videos for “If It Isn’t Love” and Mr. Brown’s “Every Little Step” are impressive). The clothing is a virtuosic symphony of sequined suits, flowing synthetic fabrics, graffitied overalls. And then there’s the music: “The New Edition Story” relies on effective rerecorded versions of the group’s many hits, sung by the actors (and mixed in places with original master recordings.) The music itself is handled by the duos of Babyface and Antonio Dixon, and Jimmy Jam and Terry Lewis, who’ve rebuilt the New Edition sound (much of which they originally created) with rigor and affection. Approval and faithfulness have limits, though. The group’s founding is streamlined, and some   slang slips into   scenes. Comparatively little time is spent on the group members’ solo efforts, especially given that so much of the final installment focuses on the members’ reconciliation in the   a reassurance that everyone ended up on the same page, putting their individual and collective troubles behind them. (The N. W. A biopic “Straight Outta Compton” took a similar, though more maudlin approach.) Here, some liberties have been taken with the timeline, placing an impromptu reunion at Mr. DeVoe’s wedding, in 2006, before the group’s participation at a BET 25th anniversary show, in 2005, so that the   can effectively end with a   performance and a BET infomercial. This is slick positioning and salesmanship, but also disingenuous. New Edition has been as fascinating for its valleys as its peaks. For this group, the most fitting tribute is always the truth.'"}, "time": 1742563878.5013847}