{"duration": 0.05723834037780762, "input_args": {"text": "'Comments \\nThe Libertarian vice-presidential nominee, Bill Weld, has accepted that his ticket’s longshot bid for the presidency is doomed, and has demanded that voters give their votes to Democratic nominee Hillary Clinton instead. He will remain on the ticket but will solely work towards stopping Trump for the remainder of the election cycle. \\nThe Libertarian ticket, usually popular with a small margin of voters with a particularly poor understanding of basic economics and the Constitution, were looking like they were going to put up a surprisingly strong performance as Republican nominee Donald Trump dragged the GOP brand into the mud, until a series of inexcusable gaffes by presidential nominee Gary Johnson destroyed what little credibility they had. \\nIn a statement today, Weld roundly tore into Trump for his unfitness to command and his moral deficiencies . \\n“I would like to address myself to all those in the electorate who remain torn between two so-called major party candidates whom they cannot enthusiastically support. I’m speaking particularly to those Republicans who feel that our President should exhibit commonly accepted standards of decency and discipline. \\nMr. Trump has some charisma and panache, and intellectual quickness. These qualities can be entertaining. Yet more than charisma, more even than intellectual ability, is required of a serious candidate for this country’s highest office. A serious candidate for the Presidency of the United States must be stable, and Donald Trump is not stable. \\n“Throughout this campaign, Mr. Trump has demonstrated an inability to handle criticism or blame well. His first instinct is to lash out at others. When challenged, he often responds as a child might. He makes a sour face, he calls people by insulting names, he waves his arms, he impatiently interrupts. Most families would not allow their children to remain at the dinner table if they behaved as Mr. Trump does. He has not exhibited the self-control, the discipline, or the emotional depth necessary to function credibly as a President of the United States. \\n“From the beginning of his campaign, Mr. Trump has conjured up enemies. First it was eleven million criminals in our midst, all bent on obtaining the benefits of citizenship, at our expense. Over time, the enemies became any trading partner of the United States. He says they are nothing but foreigners seeking to threaten our livelihoods. Now we have reached the point where his idea of America’s enemies includes almost anyone who talks or looks different from him. The goal of the Trump campaign, from the outset, has been to stir up envy, resentment, and group hatred. \\nThis is the worst of American politics. I fear for our cohesion as a nation, and for our place in the world, if this man who is unwilling to say he will abide by the result of our national election becomes our President. This is not the time to cast a jocular or feel-good vote for a man whom you may have briefly found entertaining. Donald Trump should not, cannot, and must not be elected President of the United States.” He’s absolutely right. While the inclusion of more political parties into our stagnant two-party system can only be healthy for our democracy, unfortunately this is not the right moment. Donald Trump is a clear and present danger to our nation as we know it, and stopping him must be our number one priority. This is not the time to throw away a vote on the Libertarian Party.'"}, "time": 1742561806.256642}