{"duration": 0.03920793533325195, "input_args": {"text": "'Previous The Only Coup Is a Stolen Election \\nWars and rumor of wars. There is no coup. What you are watching is a media distraction. The MSM is actually covering Hillary’s criminality for the very first time. Are you naive enough to believe the media has had a change of heart? Look at the timing. Most of the early balloting is done. The George Soros’ voting machines have been placed into 16 key states. Dead people have already early-voted. But the media would have you believe that Hillary cannot win. When the fake polls at ABC show Trump is now leading, you have to question your common sense if you think you are not being played. And getting the people to believe that Hillary cannot win because of the late exposure of her criminality, will keep the people from working hard to prevent it. \\nHow can America be so stupid as to believe that the main stream media has had a change of heart? Chris Matthews endorsing Trump along with other main stream media outlets? Really? Was Santa Claus standing in the background laughing? \\nThe criminal elite and their media pawns have spent the entire election campaign vilifying Trump and now we are to believe that they have found Jesus and are suddenly supporting Trump? For you farm boys, this is called playing possum. \\nIf you don’t want to live under the biggest criminal to ever run for President, you must block out the media and their minions because if you don’t and Hillary steals this election, I will be saying I told you so. The only way Trump wins the election, is if the people vote in overwhelming numbers for him and no amount of election fraud can overcome a super majority. For the record, voting machine fraud is designed to flip a percentage of the vote. An overwhelming victory cannot be negated without it being painfully obvious to everyone. So, don’t get lulled into complacency. Keep working for Trump!!!! \\nBelieve who you want America, but in 5 days, if you lose your focus in supporting Trump and start assuming a victory, you are going to hand the election to Soros and Clinton. \\nHere is the anti-dote to the MSM BS. which is contained in the following video.'"}, "time": 1742562440.746812}