{"duration": 0.0943136215209961, "input_args": {"text": "'Share on Facebook Share on Twitter There are articles floating around the internet suggesting that the Russian government has claimed that America never landed on the moon. This is absolutely ridiculous. Neither the Russian government nor any of its representatives have alluded to this. They are, however, calling for an international investigation regarding “murky details” that surround the U.S. moon landings between 1969 and 1972. ( source )   Why a mainstream news outlet like the Washington Post would title an article “Russian official wants to investigate whether U.S. moon landings actually happened ” is curious, to say the least ( source ) Vladimir Markin, a spokesman for Russia’s official government Investigative Committee, has argued that such an investigation could bring to light what’s been kept in the dark for a number of years with regards to these trips into outer space. Markin and the Russian government are referring to the disappearance of film footage from the original moon landing in 1969. They are also referring to the (approximately) 400 kilograms of lunar rock that was obtained during multiple missions between 1969 and 1972. “We are not contending that they did not fly (to the moon), and simply made a film about it. But all of these scientific – or perhaps cultural – artefacts are part of the legacy of humanity, and their disappearance without a trace is our common loss. An investigation will reveal what happened.”– Vladimir Markin ( source ) From the U.S. side, NASA did admit that the original recordings of the first moon landing had been completely erased. Despite this, they also said that they had managed to remaster the original television broadcast of the landing.   According to Bob Dean, United States Army Command Sargent Major, who also served at the Supreme Headquarters Allied Powers Europe (SHAPE) of NATO as an intelligence analyst, there is more footage that has been erased and hidden than we’ve not been told about: “Ladies and gentlemen, my government, NASA, which many of us in the United States say stands for Never A Straight Answer, proceeded to erase 40 rolls of film of the Apollo Program — the flight to the Moon, the flight around the Moon, the landings on the Moon, the walking guys here and there. They erased, for Christ’s sake, 40 rolls of film of those events. Now we’re talking about several thousand individual frames that were taken that the so-called authorities determined that you did not have a right to see. Oh, they were ‘disruptive,’‘socially unacceptable,’‘politically unacceptable.’ I’ve become furious. I’m a retired Command Sergeant Major. I was never famous for having a lot of patience.” (source) What Really Happened Out There? \\nFor anybody who has done any research regarding our trips to the moon, there is definitely no lack of mystery. A lot of this has been sparked by NASA astronauts themselves who have made some remarkable claims. There are so many statements from so many astronauts it’s really hard to pick the best ones. \\nYou may instantly place this topic in the conspiracy realm, but with all of the evidence that’s emerged within the past few years alone, nobody can rely have any sound rebuttal against it. Remember, a wise man once said that “condemnation without investigation is the height of ignorance.” \\n“I happen to be privileged enough to be in on the fact that we have been visited on this planet and the UFO phenomenon is real, although it’s been covered up by governments for quite a long time. Yes there have been crashed craft, and bodies recovered. We are not alone, they have been coming here for a long time.” – Dr. Edgar Mitchell, Lunar Module Pilot of Apollo 14, 6th man to walk on the moon. ( source )( source )( source )( source ) “There is abundant evidence that we are being contacted, that civilizations have been monitoring us for a very long time. That their appearance is bizarre from any type of traditional materialistic western point of view. That these visitors use the technologies of consciousness, they use toroids, they use co-rotating magnetic disks for their propulsion systems, that seems to be a common denominator of the UFO phenomenon.” ( source ) – Dr. Brian O’Leary, Former NASA Astronaut and Princeton Physics Professor “In my opinion I think they were worried that it would panic the public if they knew that someone had vehicles that had this kind of performance … so they started telling lies about it. And then I think they had to cover another lie, you know, tell another lie to cover their first lie, now they don’t know how to get out of it. Now it’s going to be so embarrassing to admit that all these administrations have told a lot of untruths…. [and that] there are a number of extraterrestrial vehicles out there cruising around.” ( source ) – Gordon Cooper, Former NASA Astronaut, Aeronautical Engineer, and test pilot; one of the seven original astronauts in Project Mercury, the first manned space program of the United States \\n“At no time when the astronauts were in space were they alone. They were under constant surveillance by UFOs.”– Maurice Chatelain, who worked at NASA. He holds 12 patents. His expertise was to invent radio equipment used to go to the moon. Here is an example of one of his patents. ( source ) \\nThere are many more examples to choose from, and the quotes coming from NASA personnel and the people who have been in outer space could fill pages. Think about that for a moment. \\nFor examples of declassified documents, and more verified quotes that go beyond NASA and into the military, political, and academic realms, you can click here . \\nYou can access all of our articles on this subject by visiting the exopolitics section of our website HERE . \\n\\nThe Sacred Science follows eight people from around the world, with varying physical and psychological illnesses, as they embark on a one-month healing journey into the heart of the Amazon jungle. \\nYou can watch this documentary film FREE for 10 days by clicking here. \\n\"If “Survivor” was actually real and had stakes worth caring about, it would be what happens here, and “The Sacred Science” hopefully is merely one in a long line of exciting endeavors from this group.\" - Billy Okeefe, McClatchy Tribune'"}, "time": 1742562111.5161476}