{"duration": 0.18387985229492188, "input_args": {"text": "'This is a town built on stories, the more salacious the better. So it comes as not much of a surprise that the twilight of Sumner M. Redstone’s epic career has become the stuff of   conversation, especially among those who knew the man when he was perhaps the most powerful figure in Hollywood. Peter Bart, a former producer and film executive who served as the editor of Variety from 1989 to 2009, was dining recently with friends at Off Vine, a quiet Hollywood restaurant housed in a     bungalow, when the inevitable came up. Others at the table included an   actress who knew Mr. Redstone well. “And they wondered, ‘How could Sumner get himself into this situation? ’” Mr. Bart said. “It is very sad. ” Details about the    tycoon’s private life surfaced during a   lawsuit, which fizzled in court last week. The story that emerged fell somewhere between film noir at its sleazy best and “King Lear. ” Mr. Bart said the billionaire’s plight was coming up a lot lately among   people. “In some cases, there were expressions of empathy,” he said. “But there is impatience with Sumner, too, that he couldn’t keep his private life private. ” The legal proceedings revealed an aging lion who craved sex and steak, although he was too ill to leave his Beverly Park mansion and took his meals through a feeding tube. Court papers described him as “a living ghost” and told of female escorts making visits to his bedside while a nurse sometimes looked on. As Mr. Redstone’s former lover and onetime   caretaker, Manuela Herzer, 51, battled his daughter, Shari Redstone, 62, for control of his daily care  —   not to mention what she saw as her rightful place in his will  —   this   melodrama had it all: wild shopping sprees,   excursions, whispers of a sex tape and, in a bit part, an angry   who seemed like a character out of a Coen brothers movie. Hollywood dynasties have long run into complications in the final reel. In the 1950s, a philandering Jack L. Warner undercut his brother Harry for control of the family’s Warner Bros. studio, and the two never spoke again. In the early 1970s, Darryl F. Zanuck was ousted from 20th Century Fox in a coup, which his wife orchestrated to avenge her husband’s treatment of their son. While those spectacles drew their share of press attention and loose talk, today’s corporate, almost bloodless entertainment industry seems less tolerant of executives who depart from the script. Sure, the stereotype of the hardhearted,   executive persists. But Mr. Redstone’s eccentricities  —   he once boasted that he shaved poolside in the nude  —   and the recent disclosure of his sexual exploits seem out of step with the airbrushed culture of   Los Angeles. “Sumner is caught in a time warp,” Mr. Bart said. The legal fracas has changed Mr. Redstone’s public image from a firebrand whose business acumen and ruthlessness won him control of Viacom, Paramount Pictures and CBS, a $40 billion empire, into something quite different. In the local parlance, he lost the plot. The hubris that precedes a fall was evident in 2009, when he told Larry King, “I have no intention of ever retiring or of dying,” and once again in 2014, when Mr. Redstone told The Hollywood Reporter, “I’m not going to die. ” Recent press attention has deflated such boasts. And secrets Mr. Redstone might have taken to the grave he reserved for himself in Massachusetts, where he was born in 1923, became the stuff of Internet chatter when Ms. Herzer  —   whom he banished from his Beverly Park home last year  —   filed suit. “This is all very Shakespearean, with the family, all the people taking over the kingdom,” said Michael Medavoy, a producer who knows Mr. Redstone. “It’s a tragedy. But my question is, is it a tragic comedy or is it a tragic drama?” After Judge David J. Cowan of Los Angeles County Superior Court tossed the case last Monday, Ms. Herzer filed a new lawsuit against Ms. Redstone. There is talk that Mr. Redstone’s lawyers may pursue a suit, too, meaning the situation could drag on. Mr. Redstone has long been known for his volatility. Across the decades, he has collected enemies the way residents in nearby Malibu pick up sea glass along Carbon Beach. The executives he has crossed include Tom Freston, David Geffen, Mel Karmazin and Barry Diller. In 2006, he split with Tom Cruise over the actor’s erratic behavior and stumping for Scientology, ending Mr. Cruise’s production deal at Paramount. (The star got some measure of revenge with his caustic,    portrayal of a character said to be based on Mr. Redstone in the Hollywood satire “Tropic Thunder. ”) “He was a   man,” Mr. Medavoy said. “But those guys can be difficult. You have to look at it all in context. The great scions of industry, the guys who made a zillion dollars, are tough guys. Those folks don’t make a lot of friends. ” On a recent evening, Christine Peters was nursing a Moscow mule in the Tower Bar at the Sunset Tower Hotel in West Hollywood, Calif. Ms. Peters, a movie producer, dated Mr. Redstone in the late 1990s and remained friends after he moved to the Beverly Park mansion in 2003. She said she had not seen the   tycoon in two years. Despite his position, Mr. Redstone was not a creature of the scene, she said. He avoided galas and opening nights, preferring intimate dinners at Dan Tana’s, the dimly lit,   Italian place on Santa Monica Boulevard with   booths, waiters in black bow ties and bartenders in red   jackets. If she arrived late for a meal, Ms. Peters said, she would find him alone and impatient, drumming his fingers on the table. Mr. Redstone, who was badly burned in a 1979 hotel fire in Boston, did not like to show weakness, Ms. Peters said, and his closest personal relationships seemed transactional, rooted in business. But his devotion to his empire seems to not have given him much protection against hits taken in the recent imbroglio. “He would rather be broke than humiliated and publicly embarrassed, his dignity lost,” Ms. Peters said. “Calling him a ‘living ghost’ is the most hurtful, saying he could not make lucid decisions. That’s where the knife hits hardest for him. ” She added that he regarded as his only worthy rival Rupert Murdoch, the    media king who recently married the former supermodel Jerry Hall. A small crowd gathered at the Vibrato Grill Jazz club here in the Bel Air neighborhood at 6 p. m. for Mr. Redstone’s 92nd birthday celebration a year ago. It was one of his last public appearances. The guests included top executives in his employ, including Leslie Moonves of CBS, Philippe Dauman of Viacom, as well as Brad Grey of Paramount. Tony Bennett serenaded him with his 1962 hit, “I Left My Heart in San Francisco. ” A figurine on the birthday cake was particularly telling. It depicted Mr. Redstone as a corporate titan in a suit and red tie, phone in one hand, television remote in the other. Next to the miniature Mr. Redstone on top of the cake was a tiny stock ticker that showed the prices of six major media companies, including Viacom and CBS. Mr. Redstone sat flanked by his caretaker at the time, Ms. Herzer, and his lover, Sydney Holland, who lived at his estate and has figured into his recent convoluted legal troubles. Mr. Redstone reportedly gave Ms. Holland some $70 million in cash and gifts before kicking her out of his house in the days before he turned on Ms. Herzer. At the party, both women wore evening dresses. The details of the tycoon’s private life probably would not have come to light if Mr. Redstone’s two paramours had not participated in a Vanity Fair profile of him in the June 2015 issue. Ms. Herzer was photographed for the article in a shimmering,   gown. Ms. Holland’s glamour shot showed her on a chaise lounge in Pasadena, Calif. Both gushed about the riches their benefactor had bestowed upon them, which did not sit well with Shari Redstone and a former convict named George Pilgrim, who was dating Ms. Holland at the time. Mr. Redstone’s hostile manner of conducting business and his tendency to go it alone may have also contributed to his   predicament. In a town where business relationships and genuine friendships are often one and the same, his story has become a cautionary tale. “More than one person has said to me, ‘I don’t want to end up alone, at home and angry,’” said Janice Min, who oversees content for Billboard and The Hollywood Reporter. “It’s almost a    approach. Now, executives drive their kids to school. ” On May 6, an   videotaped deposition of Mr. Redstone’s testimony, shot a day earlier, was played in the courtroom so that the judge could make a determination on whether the media tycoon was mentally fit. Despite his speech difficulties, the nonagenarian used foul language to express his contempt for Ms. Herzer. “I hate her,” he said, adding, “I want Manuela out of my life. ” For many who read the transcript, it was classic Sumner. “He was no more likable a person in old age,” Ms. Min said. “He hasn’t softened into a grandfatherly figure. ” Further, she added: “He doesn’t want a quiet goodbye. He is a ruthless negotiator to the end. ” At the Urth Caffé on Melrose Avenue in West Hollywood on yet another cloudless morning, the patio was crowded with   huddled over bowls of coffee and plates of coconut cake. They were buzzing about their new   or the latest Hulu series. For this generation, a   macher like Mr. Redstone seems as alien as the original Hollywood bosses who built the world’s most glamorous business on this   outpost. “He’s obviously very wealthy and influential,” said Eric Dahan, a    chief executive of InstaBrand, a   that connects brands with influencers on Instagram. “But I’m not too familiar with the case, and I don’t think a lot of my generation are. ” He called Mr. Redstone an “icon,” but confessed that he and others his age were focused on another businessman lately in the news. “People in my social circle care more about Donald Trump and whether he will become president,” he said.'"}, "time": 1742563184.6963022}