{"duration": 0.029699325561523438, "input_args": {"text": "'New Heavy-Duty Voting Machine Allows Americans To Take Out Frustration On It Before Casting Ballot WASHINGTON—Saying the circumstances of this year’s presidential race made the upgrade necessary, election commissions throughout the country were reportedly working to install new heavy-duty voting machines this week that will allow Americans to physically take out their frustrations on the devices before casting their votes. Man Grateful To Live In Society Where Mattress Disappears If Left On Sidewalk For A Couple Days COLUMBUS, OH—Emphasizing that such an impressive feat should not be taken for granted, local man Nathan Montgomery told reporters Wednesday he was incredibly grateful to live in a society where a mattress just disappears if it’s left outside on the sidewalk for a couple days. Clinton Staff Readies EMP Launch To Disable All Nation’s Electronic Devices NEW YORK—In an effort to prepare for any new revelations that might emerge about her emails during her tenure as secretary of state, Democratic presidential nominee Hillary Clinton reportedly told her staff Tuesday to ready the launch of several electromagnetic pulses to disable all of the nation’s electronic devices. Mom Produces Decorative Gift Bag Out Of Thin Air LEXINGTON, MA—Conjuring the item into existence along with several sheets of perfectly coordinated tissue paper, local mother Caroline Wolfson, 49, reportedly produced a decorative gift bag out of thin air Tuesday within a mere fraction of a second of her daughter mentioning she needed to wrap a present. Anthony Weiner Sends Apology Sext To Entire Clinton Campaign BROOKLYN, NY—In response to the FBI’s announcement that its investigation of him had produced new evidence that could pertain to its probe of the Democratic presidential nominee, Anthony Weiner reportedly sent an apology sext early Monday morning to the entire Hillary Clinton campaign. '"}, "time": 1742561859.099149}