{"duration": 0.09394168853759766, "input_args": {"text": "'Go to Article \\nCorruption – defined as: 1 a: impairment of integrity, virtue, or moral principle: DEPRAVITY b: DECAY,DECOMPISITION c: inducement to wrong by improper or unlawful means (as bribery) d: a departure from the original or from what is correct 2 archaic ; an agency or influence that corrupts. \\nNow that the FBI has decided to continue the Hillary Clinton emails investigation , Clinton has stated that she wants the FBI to show what they have; our guess is that if Comey did show what he had, Clinton would first laugh and then say they are of no importance. We tried to find another individual that made such a statement and could find none. What we did find was the way the Nazi Party told the Jews just before they killed them, “We will not hurt you; all that is just a lot of lies.” With the latest information coming out on Hillary Rodham Clinton , we have decided to just let it go because she buried herself by sending classified or secret emails to her dear friend Huma Abedin . Of course Clinton is going to downplay all this new investigation going on about her. \\nThe corruption in the rank and file of the Clinton Campaign, the Clinton Foundation, and all of what seems to be at her call for whatever she wants, is now being opened to the eyes of those whom Clinton has a distaste for but whose votes she still wants. In Rewriting History in 2005, Hillary stated to Dick Morris her clear ideas of what the Democratic voters were to her: \\n“Look, the average Democrat voter is just plain stupid. They’re easy to manipulate. That’s the easy part.” \\nThis alone should make the Democrats question why they should support an individual that calls them “stupid.” But the corruption does not end with this, and this corruption will follow Clinton to the White House, should she be elected to spew their corruption even deeper into the Washington, D.C., political machine she will have set up for her by her helpers. This CORRUPTION is nothing new to Hillary Rodham Clinton; she did it in the Watergate Scandal, where she was kicked out of the investigation due to her corruption. \\nWith the distribution of the wikileaks disclosures of the emails from and to her top campaign advisors, it seems that they are working overtime to drum the next scandal into the ground as the following one pops up. Yes, they are very good at deflecting the attention from the scandals that surround Hillary Clinton, but that is the normal approach using the tried and true Communist Saul Alinsky approach to disguise the wrong with a distraction of others. While people are looking at the distraction, Hillary’s scandals are swept under the rug until the next one pops up. All of the Clinton staff knows how to do this and Clinton has the best at distraction: John Podesta. \\nClinton seems to think that the FBI has nothing on her, and she laughs it off as nothing once again; but we heard that type of talk from none other than her idol, Saul Alinsky . \\nIn Living History , she describes her views during that time as far more pragmatic than leftwing. \\nShe “agreed with some of Alinsky’s ideas,” Clinton wrote in her first memoir, but the two had a “fundamental disagreement” over his anti-establishment tactics. \\nShe described how this disagreement led to her parting ways with Alinsky in the summer before law school in 1969. \\n“He offered me the chance to work with him when I graduated from college, and he was disappointed that I decided instead to go to law school,” she wrote. \\n“Alinsky said I would be wasting my time, but my decision was an expression of my belief that the system could be changed from within.” \\nHillary Clinton states rather clearly that she broke lines with Saul Alinsky because she felt that she could better do what he stated from within the “establishment.” She has not changed from that stance of change from within. \\nBut Hillary Clinton does not do this to help the poor or even the voters: no, she reaches out to voters to place her in the White House so she can cause much more corruption at higher levels, making sure the Clinton Foundation gets rich off her being president, and she only needs the people to win. \\nAnd how about a view in the Moroccan deal that gave her a chance to get 12 million dollars for her Clinton Foundation? Let us take a look at RT news: \\n“$12 Million Payoff from the King of Morocco to Hillary \\nIn a mail from February 2016, simply titled ‘speaking at the banks,’ Neera Tanden, the President and CEO of the Center for American Progress, suggests to John Podesta that Clinton “should just return the money” if she “lose[s] badly.” \\nAnother email from Clinton aide Huma Abedin to Mook and Podesta in January 2015 details how Moroccan authorities donated to the Clinton Foundation’s Clinton Global Initiative (CGI) to get access to Clinton. \\nAbedin says the “King has personally committed approx $12 million both for the endowment and to support the meeting” and that “the condition upon which the Moroccans agreed to host the meeting was her participation. If hrc was not part of it, meeting was a non-starter.” \\nCan you believe that Hillary Clinton can get away with this? If this had been any one of the people on any Republican ticket, they would be bared from being in any election, due to their corruption. Hillary Clinton, on the other hand, just continues on like none of this has happened, ignoring the poor people that wish they had just a tenth of what she got here. Take another look at a group that is bound to duty to destroy as much of the Constitution as they can, the Center for American Progress. That group is supported by the Nazi sympathizer George Soros, who worked with Hillary Clinton to develop another group that is called, the Shadow Party. We did discuss this in an earlier article . \\nThe idea that Hillary Clinton worked with a Nazi sympathizer like George Soros should make people stand up and ask serious questions, but our news media has their pockets lined by Soros, and they would never do anything to make him mad. It is kind of like what the Nazi Party did to the German people in 1932: control the news media and have them print and say only what Adolph Hitler said they could say, much like what they are doing today. We defeated the Nazi’s in 1945, but George Soros ran to the United States later to hide from those he allowed to suffer. Today, it would almost seem to indicate that maybe George Soros has his lady in place for his final battle on the free people of the United States. Think about that for a while and understand that Hillary Clinton gets a lot of support from George Soros. \\nWe asked if Hillary Rodham Clinton was maybe a Communist , but with George Soros pulling her strings, maybe she is an undercover Nazi? \\nBut with the emails coming out about John Podesta and Hillary Clinton, we have to wonder just what is going on here. Both Hillary and Podesta actually wish to destroy the Constitution. John Podesta is working to destroy the Constitution; we showed a part of that in the above referenced article. \\nTo close, we wish we would not have such a bad election as this one–one where voting Democratic is nearly like voting to eliminate the Constitution. Voting Republican, we get a man who has no need to run for president other than to, as he stated, “to clean the swamp.” We hear from the “Public” side of Hillary Clinton, while on the “Private” side of Hillary Clinton, she has a totally different idea for the United States. In one instance, Clinton said, “The Supreme Court is wrong on the Second Amendment.” Just what part of the Second Amendment was she talking about? \\nWe do hope that our nation wakes up very soon and sees that the Democratic Party has turned into a Socialist Party that borders upon a Communist ideology. The United States was never designed for such ill and vile ideas as both Socialists and Communists wish to impose upon the people of the United States. Our nation was designed to be a free nation, with the free entanglement of ideas, discussing how we can do better, not how we can dissolve the very Constitution that made our nation great. This election is down to what the people wish: Freedom, or a Socialist state where the poor remain poor and the rich (like the corrupt Hillary Clinton) keep getting rich. It is our time to decide what will go down in the history of the United States as the most important election of our nation. Vote for what is right for our nation, not for what we as individuals can get out of it. That is not what the United States is. Comment on this Article Via Your Facebook Account Comment on this Article Via Your Disqus Account Follow Us on Facebook!'"}, "time": 1742628470.5214932}