{"duration": 0.12164711952209473, "input_args": {"text": "'Here’s how against the Republican Establishment Trump is: → Gary Youree \\nIt is very clear to me that Sanders was replaced with Trump by the corporate media. I dont know what no one else can see this. We know who rigged this election, from primary to the predictable nomination, and then the turn on Trump, the pawn, in the general election. I just watched, and tried to share on social media the truth about what had happened, but everyone was lining up with the staus quo account of what was happening – Trump was an out of control idiot, well duh, but yes, be angry at Trump – but be truly angry about those who made him the only choice against Hillary. It is about the corruption and propaganda in the corporate media, the unwillingness to the public media, and the entertainment media to discuss the elephant in the room – and I sure dont mean the republican elephant – I am talking about the unmentionable oligarchy that is the root of everything that we, the people, find deplorable in our government. If you use only television to try and understand our world you will be lost in a matrix (urban dictionary) of misdirections, propaganda, and cheerleading for the direction they want us to think. I dont even know why they bother. Information like that which came from WiliLeaks is the last vestige, unless you are a fly on the wall, that will even get you close to being able to form an opinion from unbiased material. Other than that information it takes a talent to read between the lines, collect from what is omitted, a see just how far the public news media is willing to push the envelope. Beyond that you have to look at what is being censured by all forms of media; the A&E 9-11 Truth Movement, and from beyond the border, the works of Professor John McMurtry. I am beginning to see among those who have the intellect to see this massive misdirection, the obvious rigging of our 2016 election, the impending end out our species due to the dominate economic system; an unwillingness to do the work to deconstruct the truth. The best of us are giving up and would rather remain in denial of what is happening. When I have gone to the effort to try and explain on social media how all this created misdirection of anger towards Trump, who is an idiot, should actually be against the corporate media and the powers who control them. The destroyed our chance to elect a qualified actual anti status quo candidate by blacking out the coverage of Bernie Sanders while at the same time giving Trump, and unqualified idiot, unprecedented, unquestioned, airtime. This in effect replaced Sanders with Trump. To me it was so obvious. I knew and posted that the corporate media, after the nomination, would eviscerate Trump, using information they already had in the hole to counter what ever October surprise would be coming out against Hillary. Hillary needed to be pitted against an idiot pawn, like the predictable Trump, to ensure a win of another insider in the executive branch. I have watch as the Bill Mahers and the Michael Moores have become part of the subset of the 1%, who have crossed that line into the area of comfortability and security, which they are unwilling to sacrifice, this becoming part of those who are unwilling to truly push the envelope into any are resembling the truth of what is truly happening. Mahers and Moore have become part of the establishment propaganda machine. The same is happening of non profit news media, like DemocracyNow. While not so much helping the establishment push their agenda they have either been corrupted by the corporate powers, as with NPR and the Guardian, or they do not have the financial stability to risk telling us the full truth. Only as individuals in such online rags as the Washington Blog, and what pitifully little someone like me can contribute, do we see what a few of us are still willing to say what we think. There are many more I am afraid who are unorganized, in denial, or have just given up. The hopefulness of the Internet to keep the avenues of truth open, through the works of WikiLeaks and the social philosophers beyond the border, like Prof. John McMurtry, are we catching the last glimpse of the light of truth. The NSA is quickly surpassing this last exposure to the light. From the dark, the perception of light becomes brighter as the door dividing them begins to close. If the search for truth is difficult, the telling of truth, a crime, and the speaking of truth an insurrection, then we are correct in our assertion that a new truth is needed – or an old truth rediscovered. To find and reopen this door, to let back in the light, will be far more difficult once the darkness prevails. Lynn Walker \\nPolitics, as we knew it, is certainly dead, but politics has always been the realm of scumbags, so any pretention that what we knew was good is a fantasy of fools. Politics has always been the realm of the cheaters and the cheated and if you’re not a politician or his biggest sponsor, you’re cheated. Donate'"}, "time": 1742564299.4368873}