{"duration": 0.06464171409606934, "input_args": {"text": "'During Tuesday’s Senate Intelligence Committee hearing with Attorney General Jeff Sessions, Sen. Marco Rubio ( ) pushed the misleading Democratic Party talking point that the Republican Party platform was changed to “not provide defensive weapons to Ukraine. ”[Here is a transcript of the relevant section of the hearing:   RUBIO: My last question, you were on the foreign policy team and the Republican platform was changed to not provide defensive weapons to Ukraine. Were you involved in that decision and do you know how the change was made?  SESSIONS: I was not active in the platform committee and did not participate in that, and I don’t think I had direct involvement. RUBIO: Do you know who did or you have no recollection of a debate about that issue internally in the campaign? SESSIONS: I never watched the debate, if it occurred, on the platform committee. I think it did. So I don’t recall that, Senator. I’d have to think about that. Rubio was alluding to the conspiracy theory that Donald Trump’s 2016 presidential campaign had the Republican Party platform changed on the issue of Ukraine to allegedly aid Russian interests. The charge, which comes mostly from a Washington Post opinion piece, remains so unproven that even the   PolitiFact   fact checker failed to reach a judgement on the issue, allowing “it’s hard to use those news reports as evidence in this  . ” The entire issue revolved around one platform committee member, a Ted Cruz supporter, who wanted to use language calling for the U. S. to provide “lethal defensive weapons” to the Ukrainian military. Instead the platform eventually called for “appropriate assistance” to Ukraine  —   which leaves open the possibility of providing “lethal defensive weapons”  —   and called for “greater coordination with NATO defense planning. ” That was enough for the Washington Post’s Josh Rogin to pen an opinion piece titled “Trump campaign guts GOP’s   stance on Ukraine. ” MSNBC’s Rachel Maddow used the tidbit to claim on television that “something weird” happened regarding “that Ukraine and Russia thing” on the platform. She claimed the Trump campaign “jumped right up on that and they insisted that that plank only, that one, had to be taken out, that language could not stand. ” Writing at the Washington Examiner, media critic Byron York noted: Missing from all the talk is what the Republican platform actually said before it was allegedly “gutted” by Trump. What did the original draft of the platform say about Russia and Ukraine? Was it, in fact, changed? If so, how? As it turns out, a look at the original draft of the platform  —   which has never been released publicly  —   shows that it always had tough language on Russian aggression in Ukraine. And not only did that language stay in the final platform  —   nothing was taken out  —   it was actually strengthened, not weakened, as a result of events at the convention.   …     Not only that, the later, final platform contained a few additional words on Russia and Ukraine that weren’t in the original draft. To the first passage cited above, after “from the Baltic to the Caucasus,” the GOP platform committee added this: Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. With research by Joshua Klein.'"}, "time": 1742564291.597445}