{"duration": 1.6725122928619385, "input_args": {"text": "'ST. PETERSBURG, Russia  —   When a global governing body for sports barred Russia’s track and field team from the 2016 Summer Olympics on Friday over a   doping scandal, it was greeted in Russia, as is so often the case here these days, with a deep sense of victimhood. President Vladimir V. Putin of Russia called the decision “unjust, of course. ” Russia, Mr. Putin said, is strengthening antidoping controls and athletes should bear personal responsibility for using   drugs. But punishing the whole team, he said, “doesn’t fit any norms of civilized behavior. ” Outside Russia, sporting officials viewed the unanimous decision as a long overdue restoration of some fairness in competitions. After all, in some sporting events Russian athletes had been trouncing competitors for years before it turned out they were using   drugs. But here, the decision only added support for a narrative in Russia’s political culture of grievances that revolves around perceived slights and   conspiracies taking place in the outside world, particularly in Western countries. “Only people who are lazy don’t kick Russia in sports these days,” Dmitry Svishchev, the chairman of the parliamentary committee on sports, culture and youth affairs, told   a sporting news agency, in response to the ban. “Unfortunately, there is such a tendency now. ” The ban is the latest setback in Mr. Putin’s efforts to shed Russia’s pariah status on geopolitical issues like the Ukraine crisis and the war in Syria. When the news broke, Mr. Putin was seeking to win allies among European politicians Friday at an economic forum, where he recited in a speech a long list of grievances against Russia, including the expansion of the North Atlantic Treaty Organization after the breakup of the Soviet Union. Russia, he said, expected an “era of benevolence,” but was  . In 2014, the European Union and the United States imposed sanctions on Russia over the conflict in Ukraine. Russia annexed Crimea in March of that year and intervened in the war in the east of Ukraine, the bloodiest in Europe since the Balkan conflicts of the 1990s. The sense of   humiliation over the   period has been felt in sports, too, and the Olympic ban prompted some Russians to uncork their anger. The chairman of the Russian Parliament’s foreign affairs committee, Aleksei Pushkov, wrote on Twitter that “the Rio Games ban for our track and field team is an act of political revenge against Russia for its independent foreign policy. ” The decision caps a glum week for Russian sports, during which soccer hooligans rioted in Marseille, France, after Russia and England played to a draw. Videos showed fans streaming through the streets, wielding the weapons of choice of soccer hooligans  —   beer bottles and folding chairs  —   in running melees that left property smashed and dozens injured. “I don’t see anything scary in the fighting of fans,” Igor Lebedev, a member of Parliament who is also on the executive committee of the Russian Football Union, said in a post on Twitter. “On the contrary, good job boys. Stand strong!” Also on Twitter, the spokesman for the Investigative Committee, a powerful law enforcement agency, responded to the assertion of a Marseille prosecutor that the Russians were apparently trained fighters. “A normal man, as a man should be, surprises them,” wrote the spokesman, Vladimir Markin. “They are used to seeing ‘men’ at gay parades. ” Officials also found themselves on the defensive when it emerged that a prominent extreme rightist, Aleksandr Shprygin, who has been photographed raising his hand in a Nazi salute, led a formal Russian fan club, the Union of Supporters, to France. Groups that monitor hate speech regard Mr. Shprygin as someone who has played a leading role in introducing   ideals into Russia’s soccer hooligan culture. The global governing body for track and field, the International Association of Athletics Federations, announced the Olympics ban on Friday, ruling in a unanimous vote that Russia had not done enough to restore global confidence in its athletes’ integrity. Speaking before the announcement, Mr. Putin said the allegations of doping against his country’s athletes were part of a politically motivated “  policy” by the West. There should be “no collective punishment,” of athletes, Mr. Putin said of the allegations that Russia’s athletes engaged in the extensive use of   drugs. Sports doping is a global problem, he said, and Russia has been unfairly singled out. “Sports area cannot be politicized,” Mr. Putin said Friday. “This cannot be a foundation for building   policy. ” Mr. Putin denied   of doping, one of the pivotal accusations against Russia. “There have never been and cannot be any support for violations in sports, in particular, in the field of doping, at the state level in Russia,” he said. “We have cooperated and will cooperate with all international organizations that work in this field. ” After the announcement, Mr. Putin added “I hope that we find some solution here, but that certainly doesn’t mean we will become insulted and say we won’t fight against doping. It’s the other way around, we will strengthen the fight against doping. ” Russia’s sports ministry, which has alternatively stonewalled investigators and conceded that abuses had taken place but said they had been addressed, issued a statement saying it would appeal the decision and expressed disappointment. “The Russian side has done everything to restore trust of the international sports community in our athletes,” it said. A laboratory in Britain now tests the urine of Russian athletes. “Every Russian athlete undergoes three additional tests. ” A Russian champion   Yelena Isinbayeva, 34, said that she would sue the I. A. A. F. for “a breach of human rights” for barring her from the Olympics, and that the ban was particularly painful as the 2016 Games would be the last for her. Russian commentators said the sporting scandal could be seen as a microcosm of Russia’s broader struggles in the world today. “Officials share this view of Russian society, a society on the defensive,” Sergei Markov, a former lawmaker with the ruling United Russia party, said of the soccer riots in Marseille. “Why should we trust the French authorities that these Russian hooligans are more guilty than the British hooligans? No. If we believe we are under attack, then we believe that Russian soccer hooligans are under attack. They had a right to defend themselves. “Partly, they fought for Crimea on the Marseille streets,” Mr. Markov said.'"}, "time": 1742563407.3367755}