{"duration": 0.04735517501831055, "input_args": {"text": "'Mainstream media networks devoted 57 times more coverage to President Donald Trump’s temporary “ban” on travel from seven   countries than they did to President Barack Obama’s permanent ban on Cuban refugees to the U. S.[That’s according to a NewsBusters investigation, which also found that “[b]etween them, ABC, CBS and NBC only spent 68 seconds during their news coverage the following morning” after Obama ended the “wet foot, dry foot” policy for Cubans.  NewsBusters adds: Both actions severely limited immigration from certain regions, but CBS This Morning and NBC’s Today hyped the Castro regime “praising” Obama’s policy decision. In contrast, the coverage of Trump’s executive order has been overwhelmingly negative, with NBC’s Today even going so far as to suggest a link between Trump’s immigration ban and a mass shooting at a mosque in Quebec, despite a complete lack of evidence.   …     But this wasn’t the only instance of the networks ignoring one of President Obama’s bans on refugees. It wasn’t until 2013 that ABC News reported that “State Department stopped processing Iraq refugees for six months in 2011,” after the discovery that two   operatives had used the program to enter the U. S. and move to Bowling Green, Kentucky.   …       …     CBS and NBC never followed up on the story, and ABC dropped its coverage after that single day of attention. Coverage of Obama’s rapprochement and normalization of relations with Cuba has been generally laudatory, ignoring the Cuban regime’s complete failure to make progress on democracy and human rights, while praising the diplomatic commitment of the Obama administration to back down, unilaterally. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563788.7891195}