{"duration": 0.049367427825927734, "input_args": {"text": "'at 2:29 pm 1 Comment \\nI’m not one to shy away from Hillary Clinton related controversies, but this whole Spirit Cooking topic just seemed too far over the top to not have a good explanation. As such, I’ve avoided writing about it, hoping that someone from the Clinton team would come out and put all the craziness to rest. That has not happened. \\nIndeed, the topic was trending at #1 for much of the morning on Twitter, and continues to trend at #3 many hours later. All day, I’ve been trying as hard as possible to disassociate my confirmation bias about the Clintons, from this story. As such, I’ve been waiting for a good “debunking” piece to come out, but have yet to see one. \\nFor those of you who are interested in the topic, here’s a measured take from The Washington Times : \\nA new WikiLeaks release of stolen emails belonging to Hillary Clinton’s campaign chairman John Podesta reveal an invitation by his brother to a “Spirit Cooking dinner” at the home of artist Marina Abramovic. \\n“Spirit Cooking with Essential Aphrodisiac Recipes” was released by Ms. Abramovic in 1996, but the “ingredients” call for “fresh breast milk with fresh sperm milk” to be consumed “on earthquake nights.” \\nNew York’s Museum of Modern Art called it a “cookbook” for “evocative instructions for actions or thoughts.” Another recipe calls for “fresh morning urine.” \\n“Are you in NYC Thursday July 9 Marina wants you to come to dinner Mary?” Tony Podesta says in an email forwarded to his brother June 28, 2015. \\n“Dear Tony, I am so looking forward to the Spirit Cooking dinner at my place,” Ms. Abramovic says in a June 25 email sent at 2:35 a.m. GMT +2. “Do you think you will be able to let me know if your brother is joining? All my love, Marina.” \\nYou can see the source email through the following tweet by Wikileaks: Tony Podesta.'"}, "time": 1742562184.5548267}