{"duration": 0.07934689521789551, "input_args": {"text": "' Standing Rock and Imperialism Itself By Gary Leupp\\nNovember 09, 2016 \" Information Clearing House \" - \" Counterpunch \" - The Dakota Access Pipeline was originally scheduled to cross the state of North Dakota north of Bismarck, the state capital (pop. 70,000). But then the route was shifted 40 miles south, to the south, to pass by the Standing Rock Sioux reservation (pop. 8200). This is sovereign territory of the Sioux, whose reservation straddles North and South Dakota and whose members include Hunkpapa Lakota and Yaktonai Dakota.\\nThe Sioux are a nation of about 170,000 people, divided linguistically into the Lakotas, Dakotas and Nakotas concentrated in what are now North and South Dakota. We know that there were some in what is now either Wisconsin or Minnesota in 1660 because French traders met them and recorded the encounter. They may have advanced into the Dakotas only after that.\\n(I mention these details only to suggest that the Sioux have not \\x93always\\x94 been in their current zone. Native American tribes\\x97like Germanic, Celtic, Slavic, Turkish or Bantu tribes elsewhere\\x97migrated and settled over time, and sometimes reached a new territory simultaneous with the first Europeans\\x92 arrival.\\nFor example: the Apache may have migrated into what is now the U.S. Southwest some 500 years ago, just as the Spanish conquistadors were arriving. Since they spoke an Athabaskan language, it seems likely that they descended from people who had lived in Alaska 500 years earlier. They had wandered a long way from home.\\nThe Inuit, who originated in Siberia over 10,000 years ago, entered Alaska\\x92s North Slope around 3000 BCE and started spreading out throughout the islands of the Canadian Arctic Peninsula around 1000 CE reaching Greenland in a short time. They arrived on that large island around the same time that the Scandinavians did. Both had come a long way. We should always question the \\x93My people have always been here\\x94 allegation. The native/settler dichotomy is simplistic. We all come from somewhere else.)\\nThe Standing Rock Reservation\\x92s boundaries are defined by the Fort Laramie Treaty (or Horse Creek Treaty) of 1851, which exchanged Sioux recognition of \\x93the right of the United States Government to establish roads, military and other posts, within their respective territories\\x94 on their territory for a U.S. commitment \\x93to protect the aforesaid Indian nations against the commission of all depredations by the people of the said United States, after the ratification of this treaty.\\x94 They are confirmed by another treaty signed in 1868.\\nBack to the Dakota Access Pipeline. According to the Bismarck Tribune , the route was changed due to concern that the DAPL, built by Sunoco and projected to send 500,000 gallons of oil every day from North Dakota to Illinois, would endanger the water supply to the city\\x92s residents.\\n(These by the way are 92% white, 4% Native American, 4% other. Full disclosure: my father was born and grew up and was raised in North Dakota, as was his father before him. I visited Bismarck multiple times in my childhood. One of my mother\\x92s brothers worked in government there. It is a very white place.)\\nThe water issue is the first issue (of two) raised by those protesting the DAPL raise. The Missouri River that constitutes the reservation border is the people\\x92s only source of water. (Specifically, Lake Oahe, which is a large swelling within the river straddling the two Dakotas.) It is at present quite pure. The pipeline will flow beneath it. The Army Corps of Engineers has assessed that it will pose no threat to the water, but the people point to reports that pipelines leak. The Standing Rock Sioux are arguing in court that the pipeline directly violates the tribe\\x92s rights as a sovereign nation because it will hurt its drinking water resources.\\nQuick Google search: AP reports that from 1995 to the present, there have been over 2,000 significant accidents involving oil and petroleum pipelines in this country, producing billions of dollars in damage. Incidents rose from 2006 to 2015 by 60%. From 2013 to 2015, an average of 121 accidents happened every year. The Yellowstone River pipeline leak spilled 50,000 gallons of oil into the Glendale, Montana water supply in March 2015. 6000 residents were for a time instructed not to drink the water, like Flint residents were in 2014, although that involved a different poisoning issue.\\nJust check out Wikipedia\\x92s list of pipeline accidents in the U.S. in the 21st century .\\nIt includes this entry: In January [2005], a Mid-Valley owned and Sunoco operated pipeline ruptured, spilling 260,000 US gallons (980,000 L) of oil into the Kentucky and Ohio rivers. The U.S. Environmental Protection Agency fined the companies $2.5 million for the spill.\\nIn other words, the Standing Rock Sioux have good reason for concern about the quality of their environment and health at Sunoco\\x92s hands, and for outrage at the manner in which the Army Corps of Engineers conducted its environmental impact assessment. And the very fact that the route was shifted south from Bismarck to Indian Country precisely due to fears about water contamination\\x97what is this but unbridled racism?\\nThe second issue is that of sacred burial sites. This might seem less important, especially to the irreligious outsider. But the ongoing protest observances conducted by representatives of many tribes in North Dakota involve many religious practices related to identity: sacred songs and dancing, prayers, peace pipes, sweat lodge meetings, water protection rituals. They believe strongly in the appropriate handling of the burial grounds.\\nThis does not mean demanding respect for the boundaries of a discrete cemetery site but rather the recognition that a broad swathe of sovereign land long used for burial purposes is off-limits from (to Quote: the treaty again) \\x93depredations by the people of the United States\\x94 such as typically accompany these projects. It seems reasonable to demand that recognition for burial sites, especially some of the most infuriating and provocative actions of the U.S. in relation to native peoples have involved the treatment of the latter\\x92s remains.\\nThe National Park Service recently built a $ 3 million boardwalk over native sacred burial sites and spent tax dollars damaging 78 such sites. It built over 200 sacred mounds without doing any impact analysis and, according to a Congressional report \\x93know what they were doing was wrong.\\x94 And there\\x92s a long history of the theft and exploitation of Native Americans\\x92 remains. Doesn\\x92t Yale University\\x92s Skull and Bones Society still boast that it acquired Geronimo\\x92s skull in the 1910s?\\nThe Cheyenne River Sioux Tribe has accused pipeline goons of \\x93knowingly destroying sacred sites.\\x94 So this, too, is reason to oppose DAPL. But the main reason for opposition is not water purity, nor even respect for one\\x92s ancestors, but the Sioux tribes\\x92 aspirations for sovereignty, on land assigned them by violated treaties, as they come up against capitalist imperialism itself.\\nWhy are the treaties so violated, still? Isn\\x92t it all about private property, oil profits, indifference to the environment, inevitable state support to the biggest property-owners\\x97that is to say, isn\\x92t it all about the system itself? Which we all, in our different ways, oppose?\\nIt was beautiful to see in Cannon Ball, North Dakota, the largest gatherings in recent times of representatives of native peoples from many tribes, and many allies from many places and movements, in defense of their rights. As it happens, the movement to stop DAPL dovetails with the bourgeoning Black Lives Matter Movement and the networks formed out of Occupy Wall Street and the disillusioned Bernie campaign. Young people of all ethnic backgrounds are realizing that capitalism and imperialism suck, and that the shameful history of slavery and racism needs to be recognized and repudiated.\\nAdd to this the realization that Native Americans are rallying against Big Oil and in so doing benefiting all of us. And then imagine an anti-war, anti-Hillary movement that channels the energies of these several movements for economic justice, racial justice and native rights into a revolutionary movement focused on the real problem of imperialism itself, which the new president will likely personify. Gary Leupp is Professor of History at Tufts University, and holds a secondary appointment in the Department of Religion. He is the author of Servants, Shophands and Laborers in in the Cities of Tokugawa Japan ; Male Colors: The Construction of Homosexuality in Tokugawa Japan ; and Interracial Intimacy in Japan: Western Men and Japanese Women, 1543-1900 . He is a contributor to Hopeless: Barack Obama and the Politics of Illusion , (AK Press). He can be reached at: gleupp@tufts.edu'"}, "time": 1742628548.5446594}