{"duration": 0.031652212142944336, "input_args": {"text": "'Some of Hollywood’s biggest stars took to Twitter Tuesday to bash Republican Karen Handel and throw their support behind her Democratic opponent, Jon Ossoff, as voters head to the polls for Georgia’s Sixth District special election. [Comedian Sarah Silverman posted a plea for the voters of the   suburban Georgia district to vote for Ossoff, linking to an earlier tweet in which she wrote the state’s voters should “show Handel where she can stuff her bigotry. ”  #VoteOssoff #VoteYourOssoff https:  .   —   Sarah Silverman (@SarahKSilverman) June 20, 2017,  GEORGIA show Handel where she can stuff her bigotry #VoteOssoff ! !!! https:  .   —   Sarah Silverman (@SarahKSilverman) June 16, 2017,  Actress Debra Messing said Georgia voters “deserve better” than Handel, and urged voters to save the district “from this woman. ” #GA06 LISTEN TO THIS. You deserve better. #VoteYourOssoff @ossoff https:  .   —   Debra Messing (@DebraMessing) June 20, 2017,  🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥oh John Ossoff PLEASE save #GA06 from this woman. #VoteYourOssoff #VOTE https:  .   —   Debra Messing (@DebraMessing) June 19, 2017,  An April election between Handel and Ossoff, a    documentary    politician, forced Tuesday’s special runoff election. Ossoff had received a flood of celebrity support and cash for his campaign, which was seen as a   bid to steal a seat   by former Rep. Tom Price ( ) now the Secretary of Health and Human Services. Actress Alyssa Milano launched a campaign encouraging people to tweet photos of themselves on voting day. #flipthe5th TOO! SEND ME YOUR PICTURES WITH YOUR ”I voted” STICKER AND I WILL RT THEM. We love you @Archie4Congress! https:  .   —   Alyssa Milano (@Alyssa_Milano) June 20, 2017,  The Who’s The Boss and Charmed star is a vocal proponent of the Democratic candidate and personally drove voters to polling sites for Ossoff during the April election. A slew of stars also used their social media platforms to help encourage voters to pull the lever for Ossoff. Ga Voters, get out there  VOTE OSSOFF!! The Future is now, make a Change!! You’re our First Step on the Road to Recovery! !!  —   Samuel L. Jackson (@SamuelLJackson) June 20, 2017,  An America for all of us. #vote #FlipThe6th @ossoff https:  .   —   Mark Ruffalo (@MarkRuffalo) June 20, 2017,  Hey Georgia! Today is the day, grab a friend and get out and #flipthe6th and #VoteYourOssoff! https:  .   —   kerry washington (@kerrywashington) June 20, 2017,  People of Georgia: Today you have the chance to wipe this smirk off the Pig In Chief’s face. #VoteYourOssoff #FlipTheSixth pic. twitter.   —   Danny Zuker (@DannyZuker) June 20, 2017,  It starts today. Taking back the House. It starts in #GA06 with Jon @Ossoff#VoteYourOssoff Every fight. Every race. Every state. pic. twitter.   —   Beau Willimon (@BeauWillimon) June 20, 2017,  #Ossoff is a referendum on your illegitimate  failing presidency. #SendAMessage#FlipThe6th#VoteYourOssoff#GA06#TrumpRussiaLies..  👇👇👇👇 https:  .   —   Billy Baldwin (@BillyBaldwin) June 20, 2017,  Like Elizabeth Warren, I’m for Ossoff.  I hope he wins. I don’t want to make the perfect the enemy of the good.  —   Alex Gibney (@alexgibneyfilm) June 20, 2017,    Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628541.3576458}