{"duration": 0.04750967025756836, "input_args": {"text": "'Interviews US Democratic presidential nominee former Hillary Clinton boards her campaign plane at Westchester County Airport on October 27, 2016 in White Plains, New York. (Photo by AFP) \\nOne of the most important questions is will US Democratic presidential nominee Hillary Clinton rig the election to win the White House like she did in the primaries against Bernie Sanders, asks Myles Hoenig, an American political analyst and activist. \\nRecent polls show that Clinton’s national lead over Trump is shrinking as the Election Day is approaching. \\nThe former secretary of state has the support of 49 percent of likely voters, while the billionaire businessman has 44 percent support, according to the CNN/ORC survey released on Monday. \\nLibertarian candidate Gary Johnson has 3 percent support among likely voters, while Green Party nominee Jill Stein has 2 percent support. \\n“In every election the race tightens towards the end,” Hoenig told Press TV on Thursday. \\n“It’s really hard to imagine that there is any flux in this election as the supporters of both sides absolutely hate the other. With Obama and Romney, or even Gore and Bush, many of the issues were shared and the voting was often done on personalities or the historical nature of a first black president, regardless of who was pulling whose strings,” he said. \\n“This election is more polarized than ever. With the Podesta leaks showing Clinton’s overt racism (calling Donna Brazille a buffalo) as well as proving that President Obama lied to the public about when he learned of Clinton’s inappropriate use of her emails, and with the news of Trump’s ACCESS Hollywood tape receding into America’s short term memory span, it’s no wonder the polls are tightening,” the analyst stated. \\n“The question of the day is will Clinton rig the election like she did the primary, being the only way she could have won,” he asked. \\n“We’re also seeing both Johnson’s and Stein’s numbers dropping but so many are not polled that those numbers are harder to verify,” the commentator noted. \\n“This is the biggest crap shoot of an election in years!” he said in his concluding remarks. Loading ...'"}, "time": 1742563176.277291}