{"duration": 0.0835413932800293, "input_args": {"text": "'Vladimir Putin: Who will protect young boys from pedophiles and rapists in Europe? ‹ › Ian Greenhalgh is a photographer and historian with a particular interest in military history and the real causes of conflicts. His studies in history and background in the media industry have given him a keen insight into the use of mass media as a creator of conflict in the modern world. His favored areas of study include state sponsored terrorism, media manufactured reality and the role of intelligence services in manipulation of populations and the perception of events. Trump rape accuser skips press conference, citing threats By Ian Greenhalgh on November 4, 2016 Woman known only as ‘Jane Doe’ alleges Republican presidential nominee sexually assaulted her when she was 13 Attorney Lisa Bloom announces the cancellation of a press conference for Trump accuser ‘Jane Doe’ in Woodland Hills, California, November 2, 2016. Trump rape accuser skips press conference, citing threats \\nA woman who claims she was raped as a teenager by Republican presidential nominee Donald Trump failed to show up for a Wednesday press conference during which she was to reveal her identity, citing threats against her. \\nThe woman, known in the media by the pseudonym Jane Doe, alleges Trump sexually assaulted her four times in 1994, when she was just 13, during parties organized by disgraced financier Jeffrey Epstein. \\nIn 2008 Epstein was sentenced to 13 months in prison for soliciting sex with an underage girl. \\nReporters packed into the office of Doe’s lawyer in Woodland Hills, Los Angeles, where she was expected to speak publicly about her allegations for the first time. However, her lawyer Lisa Bloom appeared alone and explained that the media event was canceled because her client feared for her safety. \\n“Jane Doe has received numerous threats today as have all the Trump accusers that I have represented,” Bloom said. “She has decided she is too afraid to show her face. She has been here all day, ready to do it, but unfortunately she is in terrible fear. We’re going to have to reschedule. I apologize to all of you who came. I have nothing further.” \\nBloom, who has a court TV show and is a legal analyst for NBC News, is the daughter of Gloria Allred, a civil rights attorney representing three other women making claims against Trump. \\nAccording to court papers, the woman claims she was offered money to attend the parties and that Trump, who knew her age to be just 13, initiated the sex. \\nOn the fourth occasion, Trump allegedly tied her to a bed, exposed himself, and then raped her despite her loud protestations. Trump, she claims, hit her in the face and told her he could do whatever he wanted. He then warned her that if she revealed the abuse, she and her family would be “physically harmed if not killed.” She claims there are witnesses to the assaults and that Epstein also raped her. \\nTrump, who has faced a recent series of claims by women alleging sexual assaults, has categorically denied Jane Doe’s story as a fabrication, part of a smear campaign against him. \\nOn Wednesday Bloom tweeted that her firm’s website and emails had been hacked, saying the hacker group Anonymous had taken responsibility. \\nThe UK’s Guardian newspaper, which in recent months has been investigating the claims by Doe, reported that she first tried to file a complaint against Trump in April but the paperwork was dismissed due to filing errors. A second lawsuit was submitted in June in New York and California, and then apparently amended again in September. \\nThe newspaper noted that the claims have mostly been ignored by mainstream media because they “appeared to have been orchestrated by an eccentric anti-Trump campaigner with a record of making outlandish claims about celebrities,” referring to Norm Lubow, a former producer on the Jerry Springer television show. \\nThe Guardian said that in June it discovered a publicist known as “Al Taylor” who tried to sell a videotape of Doe talking about her allegations for $1 million. Taylor, the report said, was linked to Lubow. \\nHowever, when the Guardian contacted “Al Taylor” to uncover his identity, he replied, “Just be warned, we’ll sue you if we don’t like what you write. We’ll sue your ass, own your ass and own your newspaper’s ass as well, punk.” \\nAn initial status conference in Doe’s civil lawsuit against Trump has been scheduled for December 16 in a New York district court, just over a month after the November 8 US presidential elections. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by Ian Greenhalgh on November 4, 2016, With 6 Reads Filed under Politics . You can follow any responses to this entry through the RSS 2.0 . Both comments and pings are currently closed.'"}, "time": 1742628334.5532184}