{"duration": 0.020238161087036133, "input_args": {"text": "'Membership in the Democratic Socialists of America (DSA) has tripled since Donald Trump’s election in November to over 19, 000 paying members, a report from the Los Angeles Times reveals. [The group, founded in 1982, is now the largest socialist organization in the United States and recently published a “Resistance Rising” strategy to combat the Trump administration.  “On November 8, voters in the United States narrowly elected an openly racist, misogynist and nativist candidate for president,” the organization’s website reads. “We must understand ‘Trumpism’ as a   white nativist alliance the median family income of the 62 percent of white voters who supported Trump was higher than that of Hillary Clinton voters and wealthier than Bernie Sanders’ primary base. ” Recently, the group organized protests outside Los Angeles Mayor Eric Garcetti’s election party, calling on the new mayor to fight Donald Trump’s deportation plans. DSA also organized a march supporting the International Women’s Day strike. Protestors disrupt LA mayor Eric Garcetti speech at his election night victory party. pic. twitter.   —   Carlos Granda (@abc7carlos) March 8, 2017,  “People really felt that they had to do something to combat the incoming Trump administration,” the group’s deputy director David Duhalde told the Times. “We’re not only somebody you can resist Trump with, we’re somebody you can build a better world with. ” In last year’s Democratic primaries, the group vociferously endorsed Bernie Sanders’ candidacy, organizing thousands of grassroots activists to campaign for his ultimately unsuccessful presidential run. The DSA is not the only   organization to increase its membership since Trump’s victory. The American Civil Liberties Union (ACLU) claims to have gained hundreds of thousands of new members since November. Meanwhile, the “Indivisible” movement, reportedly backed by George Soros with links to Barack Obama’s “Organizing for Action”    group, now boasts over 4, 500 associated groups across the country tasked with challenging the Trump agenda. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com, Photo: file'"}, "time": 1742628427.8574414}