{"duration": 0.04436016082763672, "input_args": {"text": "'Breitbart London    Raheem Kassam ripped into “  ” Barack Obama’s “  final presidential address” on the Breitbart News Daily show on Sirius XM Patriot 125 on Wednesday morning. [Describing Obama’s final address to the nation as a “tepid farewell” Kassam slammed his “hour long,   snooze fest”:  “Unlike Reagan at 20 mins, Carter at 18 minutes, Clinton at 10 minutes, or Eisenhower at 15 minutes, President Obama decided to genuflect towards himself for almost an hour last night, weeping into his hanky while lauding other people’s achievements: the Navy Seal’s killing of Bin Laden, the worst economic recovery in seven decades, the Supreme Court’s decision on   marriage. “The    is a man desperate to end his presidency by being able to use the phrase ‘Yes we did’  …     More accurately, however, would have been his own phrase that he once levelled at the hard working people of this country: ‘You didn’t build that. ’” Campaigning his “legacy of mediocrity” in Chicago, Illinois, Obama was quoted as saying, “I’ve lived long enough to know that race relations are better than they were ten, or twenty, or thirty years ago”. Kassam hit back at the claim, pointing to the racial tensions happening concurrently to the outgoing president’s final days where “a U. S. Attorney General [was] being heckled during a confirmation process by Black Lives Matter activists, and while an infantile spat takes place in Congress over a painting depicting police officers as pigs”. The Breitbart London EIC then tore into Obama for invoking the Constitution as an outdated document, the president saying, “Our constitution is a remarkable, beautiful gift. But it’s really just a piece of parchment. It has no power on its own. We, the people, give it power  —   with our participation, and the choices we make. ” “The sneaky little message shone through,” said Kassam, “at least for me, is that the Consitution is ‘just a piece of parchment’. ” ”Our Constitution is just a piece of parchment” says Obama, finally admitting his disdain for it #ObamaFarewell,  —   Raheem Kassam (@RaheemKassam) January 11, 2017,  “It’s incredibly intentional. A piece of parchment. Not a piece of paper. Not a set of ideals. Not a guiding light that we should all act as defenders and protectors of. No. A piece of parchment. Something old  —   maybe even outdated? “Just like in December when he called the electoral college a ‘vestige’ of an earlier America, his aim here was clear to me. “A remarkable, beautiful gift  —   sure. But the conscious effort to highlight the age of the document in a speech that urged people to keep pushing for a radical overhaul of the makeup of this country was nothing short of almost brilliant rhetorical deception. ” Rather than closing his speech with best wishes or God’s blessings to his successor, Kassam remarked that “Obama did no such thing. Instead, he heaped praise on his staff, his wife and his Vice President and utterly predictably harkened back to the era of slavery and abolition. A subtle but sharp dig at the country he served so poorly. ” Kassam ended by saying that he, too, almost felt like crying  —   “I didn’t  —   because I’m a proper bloke”  —   emanating from a twinge of joy over the end of the Obama administration. “I almost shed a tear for him too, as a human being, having occupied the most powerful position in the entire world at a time where the field was most fertile for his radical agenda and standing up there knowing full well that on day one his successor would undo almost every  …     let’s use a word he likes so much vestige of his presidency. ”  Listen in full to Raheem Kassam on Breitbart News Daily below  …      '"}, "time": 1742628543.7425065}