{"duration": 0.11242270469665527, "input_args": {"text": "'We’ve all heard of or read about the many people who, it is said, were murdered on orders of Bill and Hillary Clinton. (See, for example, the website Arkancide .) \\nBut the deaths are the stuff of rumors — until now. \\nOn September 24, 2013, on the Pete Santilli radio show, a former longtime Clinton associate named Larry Nichols admitted that he had killed people as the Clintons’ hit man or murderer-for-hire. I took this screenshot of Larry Nichols from one of his videos uploaded to YouTube in 2009. \\nLarry Nichols (LN), a self-described former Green Beret, was a longtime associate of Bill Clinton (BC) and served as the marketing director of BC’s Arkansas Development Finance Authority (ADFA), “the best kept secret in Arkansas.” The two men first met in the late 1970s when BC was an up-and-coming politician. Wikipedia has no entry on Arkansas Development Finance Authority except for a brief reference to ADFA as one of the entities investigated by the United States Senate Whitewater Committee , but without identifying or describing what ADFA is. So I did an Internet search for ADFA and discovered that it is actually an agency of the Arkansas State government. The ADFA website describes itself as “ Arkansas’ largest source of low-cost financing for low-to-moderate income housing development, small industries, government, education, agricultural business enterprise & health care.” \\nOn September 24, 2013, Nichols was interviewed by the Pete Santilli radio show for GuerillaMediaNetwork.com. As introduced by Santilli, Nichols “has a lot of inside information on the Clinton crime family.” He published The Clinton Chronicles (a 1990 documentary subtitled “An Investigation Into the Alleged Criminal Activities of Bill Clinton”) on the Clintons’“child trafficking,” Bill’s “sexual escapades,” and how Hillary “spent 30 years covering up Bill Clinton’s sexual and criminal activities.” \\nHere’s the audio of Nichols’ interview with Santilli: \\nLarry Nichols’ interview begins at the 1:11:08 mark in the YouTube audio. Here’s my transcription of what Nichols said. LN is Larry Nichols; PS is Pete Santilli. \\nLN: “I have actually beat up women and beat up husbands to protect the Clintons…. Not only have I killed people for [Bill Clinton], I’ve [never been in] jail.” \\nPS: “You’ve always been protected by the Clintons.” \\nBeginning at the 1:11:49 mark, LN says: “But now let’s call a spade a spade. I’ve been all over the world killing people for this country, some deservedly, some not. Ain’t matter to me. Just what I was paid to do…. Ronald Reagan sent me to El Salvadore. I did it for God and country.” \\nPS asks if, at the time when LN killed for the Clintons, did he do it patriotically, for the common good? \\nLN: “I didn’t give a shit. Some of these people, like Wayne Damond (?), needed to be dealt with. So I went to the jail, cut his nuts off, put them in a jar, put formaldehyde in it and left it there.” \\nPS asks what motivated LN in killing for the Clintons. \\nLN: “Just money. One minute I was doing something for the government, next minute I was doing something for the Clintons. What difference was it?” \\nPS asks how the Clintons presented “these [murderous] tasks” to LN. \\nLN: “Whenever I got an F2 call, that meant go and kill. State police are not trained to kill in … the late ’70s, early ’80s. There were no SWAT teams…. I had an F2 call, that meant go in and kill a guy. I didn’t give a shit…. When it [the order to kill] came from the president [Reagan], it was for God and country. When it came from Clinton, hell, I didn’t give a damn. I just go kill somebody, cut his nuts off.” \\nPS asks if LN was paid to murder. \\nLN answers that if the Clintons did not pay him, “they’d piss me off and they didn’t want to piss me off.” \\nAt some point, however, the Clintons turned on LN and he had to defend himself. LN says: “I had to [defend myself] because I didn’t have a support group. The media weren’t going to cover it, so if I died, they’d just pour alcohol over me and say I was drunk and crashed on the side of the road.” \\nPS asks LN what kept him alive. \\nLN: “I’m a Green Beret. I’m trained … I’m skilled in staying alive. We have one rule: Kill back first. So if they send people to me, I’ll just kill them back first. I don’t ask questions. I deal with it.” \\nLarry Nichols was also asked about Hillary Clinton’s fitness to be president. His answer: “After the Benghazi debacle, No.” \\nNichols claims that Israeli Prime Minister Benjamin Netanyahu, a friend, told him what we already now know — that the Obama administration had been providing arms for Muslim terrorists in Syria (via Libya). When Netanyahu voiced his objection, the arms supply stopped, which enraged the al-Qaeda-connected terrorists to attack the U.S. consulate in Benghazi. \\nWhat Nichols doesn’t say (doesn’t know) is that the Obama regime has NOT stopped supplying arms to the Syrian “rebels,” but is actually expanding the CIA’s training of the terrorists . \\nH/t Dean Garrison and FOTM’s TnRick \\nSee also:'"}, "time": 1742562147.3564456}