{"duration": 0.07389497756958008, "input_args": {"text": "'Former Senator Barbara Boxer defended Meryl Streep’s controversial,   Golden Globes acceptance speech and urged Democratic politicians to follow her lead during CAA’s “Take Action Day” summit on Thursday. [Boxer  —   who just signed on as a client at CAA after leaving the Senate last year  —   was one of several politicians and progressive leaders taking part in what the Hollywood   billed a “ ” political summit for clients and staff.  “I don’t think she talks down to anybody,” Boxer said of Streep during a conversation with CAA agent Michael Kives, according to Deadline. “I don’t think it’s up to people to worry about how one segment of the country thinks. What did Meryl Streep say that should be offensive to the middle of the country, that Donald Trump imitated a disabled person? Believe me, people in Middle America didn’t like that one bit. ” During her acceptance speech at the Globes in January, Streep said that Hollywood belonged to the most “vilified” segment of American society in the wake of Trump’s election, and criticized what she called the president’s “instinct to humiliate,” his “disrespect” and his “violence. ” The speech was widely praised in Hollywood but sparked outrage among the president’s supporters. While she defended Streep’s speech, Boxer said it was important not to speak out politically just “for the sake of doing it. ” “I believe in freedom of speech for every single person, whether they work in Hollywood, don’t work at all, are old, young, whatever,” she said, according to the Wrap. “Don’t do it for the sake of doing it, but if it moves your heart and you have a stage, use it. ” “It’s not up to Meryl Streep to tailor our message to middle America, it’s up to candidates who are running for office to tailor a message that resonates,” Boxer added. CAA’s “Take Action Day” runs all day Thursday and was also expected to include appearances by Sen. Kamala Harris ( ) Rep. Kevin McCarthy ( ) Planned Parenthood president Cecile Richards and Muslim Public Affairs Council founder Salam  .   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563976.6574984}