{"duration": 0.10208725929260254, "input_args": {"text": "'Beverly Emers strode through campus with assurance, her    son, Jabari, a few paces behind, as she gave the history of each monument at Bronx Community College this fall. Although decades older than most students there, Ms. Emers, 43, cannot walk between the buildings without someone waving, calling her name or inviting her to a party. It was not always this way. About fourteen years ago, Ms. Emers was too consumed with getting high to even consider college. It was winter 2003, and she was with friends strung out on drugs, her mind in a crazed disorientation. They had a word for the feeling: monos, Spanish for monkeys. By this time, Ms. Emers, who had been dealing drugs since she was 13, had lost track of the number of times she had been arrested. She dropped out of high school in 9th grade and spent six years in jail, usually on charges of selling or possessing drugs, according to police records. Ms. Emers knew the consequences, serving nine stints at the Rikers Island jail complex under three different aliases, according to records from the Department of Correction. Every time she walked out of jail, Ms. Emers swore she would never return. But each time she went back to the streets, only to start dealing again. But high on drugs that winter night, with her friends appearing like ghosts all around her, she found clarity. “I thought, ‘What am I doing here? ’” she recalled. “I saw the ugliness of my lifestyle for what it was. I knew where I was going wasn’t where I was supposed to be. And I just walked out. ” For a year, she had eluded officers on a parole violation charge, but no more. She went to the parole office in Midtown Manhattan to turn herself in. The office was closed, but she still banged on the back door. “You’re late,” she recalled an officer as saying. She replied: “You’re right. I’m more than a year late. ” Ms. Emers spent the next few months at Rikers. In a court hearing, she requested treatment for her drug addiction. She sought help from the Dreitzer House for Women and Children in East Harlem, which offers drug treatment and affordable housing. Ms. Emers moved into a shelter, where she was pregnant with Jabari and lived for the next year and a half, she said. But she struggled to disconnect from the toxic yet accepting community that had taken her in after an unhappy childhood. After kicking her drug habit, Ms. Emers said, she spent years “in limbo. ” “Not doing what I’d been doing before,” she said, “but not doing anything else instead. ” She cloistered herself in her Bronx apartment to avoid the temptations outside, but was depressed that her criminal record limited her job prospects. And when Jabari started school, his homework became another stressor for her, prompting verbal abuse. “He bore the brunt of that,” she said. Ms. Emers said she realized she needed to end the abuse, so she turned to Community School 61, an elementary school in the Bronx that partners with the Children’s Aid Society, one of eight organizations supported by The New York Times Neediest Cases Fund. There she volunteered and joined the   association. She also signed up for parenting classes at the Children’s Aid Society’s East Harlem Center and became more engaged at home. School administrators suggested she enroll in college, but Ms. Emers dismissed the idea until shortly after Jabari’s fifth grade graduation, when the mother and son were discussing his future. Jabari asked her, “When are you graduating?” “It wasn’t planned,” Jabari recalled. “It just came out. ” “And that was an aha! moment for me,” Ms. Emers said. “Because here I was telling him to read and study, and I don’t even have a high school diploma. ” So Ms. Emers “surrendered,” took college prep classes and enrolled in Bronx Community College in spring 2015. Ms. Emers, who is majoring in human services, hopes to work with South Bronx Rising Together, a partner of the Children’s Aid Society, which provides opportunities and educational resources to impoverished children and youth in the South Bronx. She is now on the dean’s list, serves as the executive secretary in student government and has received leadership and service awards from the college. She was also awarded the Kalief Browder Memorial Scholarship, given to students who served time in jail it is named after a man who was sent to Rikers at 16 and spent three years there without trial. In 2015 at the age of 22, Mr. Browder, who had been a student at the college, committed suicide, after struggling to rebuild his life following incarceration. Ms. Emers is the first recipient of the scholarship  —   $5, 000 for this academic year  —   which covers most of her costs. But an invitation to the scholarship gala held at the   event space Tribeca Rooftop in June posed a problem. “I didn’t have a dress to go to a gala in,” she said. To help, the Children’s Aid Society withdrew $640 from the Neediest Cases Fund for gift cards to pay for Ms. Emers’s and Jabari’s attire for the event, as well as expenses for school uniforms and household items. The family also received $550 from the fund to help with clothing and household goods in 2012. The family receives $194 in cash assistance and $376 in food stamps each month. Dressed for the occasion, they arrived at the industrial penthouse with large windows overlooking Manhattan and the Hudson River. Feeling out of place, Ms. Emers found comfort in her son. “Jabari was the   guy in the room,” she said, smiling. “And I’m not just saying that because he’s my son. ” Waiters passed hors d’oeuvres, and she encouraged Jabari, who wants to become a chef, to try a little of everything. “Just getting exposed to certain things could motivate him to work hard, and maybe he won’t make the same choices I did,” she said. Now, Ms. Emers is helping to plan a discussion in the spring on the importance of mental health and suicide prevention at her college. She also wants to develop resources to ease the transition between jail and civilian life for other formerly incarcerated students. Ms. Emers has not forgotten how far she has come, she said. More than a decade after leaving the treatment center, she still attends monthly meetings and visits her caseworker. “It’s an act of gratitude,” she said. “I want people to know we’re doing well, because they invested in me before I was doing well. This is our victory. ”'"}, "time": 1742563696.9714143}