{"duration": 0.07009553909301758, "input_args": {"text": "'A   poll released Wednesday found that 83 percent of Trump voters believe the media is hostile towards them —  with 60 percent saying the media is “enemies to people like” them. [The Huffington Post reports that’s an uptick from February, when 51 percent of Trump voters thought the media is “an enemy to people like you. ”  Well over half, or 68 percent, of Hillary Clinton voters say media are an “ally” or friendly to people like them.  ( ) Men are more likely to see the press as hostile to them, with nearly half, or 49 percent, saying media is unfriendly or “enemies” to people like them, including 28 percent who agreed media outlets were “enemies to people like you. ” Forty percent of women also saw the media as biased against them. Over half, or 57 percent, of Americans aged 65 and older, said the media is “unfriendly to people like you” or “enemies to people like you,” as did 35 percent of respondents between 18 and 29. Black respondents had a more positive view of media: 45 percent believed the media were allies to or friendly to people like them, compared to 26 percent who said the media is “unfriendly to people like you” or “enemies to people like you. ” Half, or 50 percent, of white respondents thought the media was unfriendly or outright enemies of people like them, while 29 percent viewed media as friendly or allies. Only 18 percent of Hispanic respondents thought the media was positively inclined towards them, while 39 percent thought the opposite, and 43 percent were unsure. Only 12 percent of Republicans saw the media as friendly towards them, while 44 percent believed the press was an enemy and 68 percent said the press was opposed to them overall. Meanwhile, 60 percent of Democrats thought media was “friendly to people like you” or “allies to people like you. ” Only seven percent thought the press was an enemy. Overall, 25 percent of respondents said media were “enemies to people like” them, while another 19 percent said they were “unfriendly,” for a total of 44 percent who believed the media was hostile towards them. Only 30 percent said media were friendly to or allies of people like them.   ( )  Coverage of Trump’s brief time in office has been relentlessly hostile. A Media Research Center (MRC) study released in early March found 88 percent of Trump administration coverage from ABC, CBS, and NBC was negative, with “anchors and reporters often [injecting] their own   editorial tone into the coverage. ” A study released by by the Harvard Kennedy School’s Shorenstein Center in May found 93 percent of CNN and NBC’s coverage of the   president was negative, as well as 52 percent of Fox News’ coverage and 70 percent of the Wall Street Journal‘s: “Trump has received unsparing coverage for most weeks of his presidency, without a single major topic where Trump’s coverage, on balance, was more positive than negative, setting a new standard for unfavorable press coverage of a president. ” As Breitbart Senior   Large Joel Pollak reports: “The media, furious that Trump defied them by winning the election, denied him any semblance of a ‘honeymoon’ in office  …     Trump has never been given the same chance —  or any chance —  to carry out his agenda. And for months, Trump voters have watched the media fawning over the hysterical opposition, praising the ‘pussyhat’ protesters and downplaying the extremists in their ranks. ” Trump has frequently bashed the “fake news media” for attacking him and allegedly fabricating sources to damage his agenda on Twitter. I win an election easily, a great ”movement” is verified, and crooked opponents try to belittle our victory with FAKE NEWS. A sorry state!  —   Donald J. Trump (@realDonaldTrump) January 11, 2017,  Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting.  —   Donald J. Trump (@realDonaldTrump) February 6, 2017,  Don’t believe the main stream (fake news) media. The White House is running VERY WELL. I inherited a MESS and am in the process of fixing it.  —   Donald J. Trump (@realDonaldTrump) February 18, 2017,  Whenever you see the words ’sources say’ in the fake news media, and they don’t mention names  …    .  —   Donald J. Trump (@realDonaldTrump) May 28, 2017,    …    . it is very possible that those sources don’t exist but are made up by fake news writers. #FakeNews is the enemy!  —   Donald J. Trump (@realDonaldTrump) May 28, 2017,  It is my opinion that many of the leaks coming out of the White House are fabricated lies made up by the #FakeNews media.  —   Donald J. Trump (@realDonaldTrump) May 28, 2017,  The Fake News Media works hard at disparaging  demeaning my use of social media because they don’t want America to hear the real story!  —   Donald J. Trump (@realDonaldTrump) May 29, 2017,  Pollsters questioned 1, 000 U. S. citizens from May 26 to May 27. The poll has a margin of error of plus or minus 3. 9 percentage points.'"}, "time": 1742563840.8474405}