{"duration": 0.126967191696167, "input_args": {"text": "'“It sounded like a stampede of cattle,” Donna Melanson said  —   30 to 40 people fleeing, terrified, through Los Angeles International Airport on Sunday night. “Everyone is yelling, ‘Shooter, shooter, shooter,’ and they start diving under the seats to hide. ” Ms. Melanson, 53, a yoga instructor who was waiting to fly home to Miami, grabbed her bag and joined the stampede because, she said, “I couldn’t think of why people would be running unless there was a true emergency. ” There was not. A loud noise mistaken for gunfire led to rumors that spread at blazing speed in person and on social media, setting off a panic that shut down one of the nation’s busiest airports, as passengers fled terminals and burst through security cordons, and as the police struggled to figure out what was happening and to restore order. Far from being an isolated episode, it was essentially what had happened on Aug. 13 at a mall in Raleigh, N. C. on Aug. 14 at Kennedy International Airport in New York on Aug. 20 at a mall in Michigan and on Aug. 25 at a mall in Orlando, Fla. In the wake of terrorist attacks at airports in Brussels and Istanbul  —   and against other targets in Paris San Bernardino, Calif. Orlando Nice, France and elsewhere  —   Americans are primed, when they hear a loud bang or screams, or see a crowd break into a run, to think in terms of mass killings and active shooters. Yet crime statistics show that over all, violence in the United States is as low as it has ever been, and experts say the fear far exceeds the risk. “I would say that we are in the grip of a moral panic,” said John Horgan, a professor of global studies and psychology at Georgia State University who specializes in the study of terrorism. “The constant threat perception of being vulnerable to mass violence has seeped into our collective consciousness. ” Sam Macon, 36, a documentary filmmaker who was at the Los Angeles airport on Sunday, said: “People who were running had absolutely no idea why they were doing so. I don’t think it takes a social scientist to understand that the general tenor of American society right now is that we’re all wound up pretty tight. ” The recent   panics injured dozens of people, some of them seriously. Kokila Patel, 66, and her husband, Manu, 74, had just finished lunch at a Panera in the Crabtree Valley Mall in Raleigh on Aug. 13 when she heard a noise and turned to see panicked shoppers surging toward them. People had taken   sounds for gunshots, screamed, dived into stores and made a chaotic rush for the exits, paying little heed to what was in their way  —   including the Patels. The crowd knocked the couple down and trampled Ms. Patel, breaking her right femur and leaving her to wait in searing pain for two hours until police officers in tactical gear arrived and helped carry her out of the mall on a plastic display table. Surgeons braced her shattered leg with a steel rod, plate and screws, but the pain is still intense. Ms. Patel, who usually travels to India for three months each year with her husband, remains homebound. “People always think, ‘A gunman, a gunman,’” said Ms. Patel, who with her husband was earlier interviewed by The News and Observer. “People’s mentality are changing. People are always being afraid. ” Mr. Patel said he could see fear on the faces of the people who rushed over him and his wife. “They thought that somebody’s there to kill them,” he said. “Psychologically, we have been damaged. ” Social media feeds that kind of frenzy, said Roxane Cohen Silver, a professor of psychology and social behavior at the University of California, Irvine. “There’s rapid dissemination of information on social media that’s not being filtered by anybody,” she said. “This provides the unfortunate opportunity for rumors to be transmitted very quickly, without any ability to evaluate the veracity. ” Before there were television news reports about what was happening at the Los Angeles airport, she said, her son in Chicago had called to tell her, “I’m watching Twitter videos of people running at LAX. ” At the Florida Mall in Orlando, popping balloons were apparently mistaken for gunshots. At the Twelve Oaks Mall in Novi, Mich. it was a glass door toppling to the floor, knocked over by thieves who had smashed a glass display case in a jewelry store to grab two luxury watches. As the robbers ran, so did shoppers, and people posted videos of the chaotic scene on social media and said  —   falsely  —   that shots had been fired. That message spread fast, and calls to the Novi police overwhelmed the 911 system, shunting overflow callers to the state police. “It’s a wildfire you try to control,” said Detective Sgt. Scott Baetens of the Novi Police Department. “We try to put out timely and accurate information. But you can’t put it out fast enough to beat Twitter and Facebook. ” Once people start to flee, it is fairly normal for others to join in, experts say  —   even people who did not hear any suspicious sounds or rumors of terrorism. But people who study crowd psychology and the fear of terrorism say the steady stream of news reports of bloodshed has heightened anxieties out of proportion to the threat, making panic more likely to take hold. “This overexposure can cause increased fear, anxiety and helplessness, particularly in already psychologically vulnerable populations,” said Daniel Antonius, an assistant professor of psychiatry at the University at Buffalo. He described “a national anxiety” about mass attacks that did not reflect the real level of danger. Dr. Horgan stressed that in addition to physical violence, “terrorism is fundamentally a form of psychological warfare, and it’s one of the greatest ironies that we help give it its strength in our reactions to it. ”'"}, "time": 1742562340.5413022}