{"duration": 1.6230816841125488, "input_args": {"text": "'ANNOUNCEMENT \\nThe WRH server continues to be under INTENSE attack by Hillary\\'s \"Tantrum squad.\" \\nBut the site keeps bouncing back, so if during the day you cannot connect, wait a minute or two and try again. Thank you for your patience. It is obvious the \"bad guys\" are in a state of total panic to act like this! THOUGHT FOR THE DAY! \"We seek peace, knowing that peace is the climate of freedom.\" -Dwight D. Eisenhower YOUR RANDOM DHS MONITORED PHRASE OF THE DAY DERA \\nPaid advertising at What Really Happened may not represent the views and opinions of this website and its contributors. No endorsement of products and services advertised is either expressed or implied. \\nHILLARY THE SPY? - UPDATED INFO! \\nLet us start with an historical fact. Treason and betrayal by the highest levels is a common feature of history, whether it is Judas vs Jesus, Brutus vs Julius Caesar, Benedict Arnold, the Rosenbergs, Jonathan Pollard, Aldrich Ames, Robert Hanssen. It is just a fact of life. It does happen. \\nBack in 1996, when Bill Clinton was running for re-election, he authorized the transfer of highly sensitive technology to China. This technology had military applications and allowed China to close the gap in missile performance with the United States. The transfers were opposed and severely criticized by the Defense Department. \\nAt the same time Bill Clinton was transferring this technology to China, huge donations began to pour into his re-election campaign from the US companies allowed to sell the technology to China, and from American citizens of Chinese descent. The fact that they were US citizens allowed them to donate to political campaigns, but it later emerged that they were acting as conduits for cash coming in from Asian sources, including Chinese Intelligence Agencies! The scandal eventually became known as China-gate! \\nJohn Huang \\nA close associate of Indonesian industrialist James Riady, Huang initially was appointed deputy secretary of commerce in 1993. By 1995, however, he moved to the Democratic National Committee where he generated hundreds of thousands of dollars in illegal contributions from foreign sources. Huang later pleaded guilty to one felony count of campaign finance violations. \\nCharlie Trie \\nLike John Huang, Trie raised hundreds of thousands of dollars in illegal contributions from foreign sources to Democratic campaign entities. He was a regular White House visitor and arranged meetings of foreign operators with Clinton, including one who was a Chinese arms dealer. His $450,000 contribution to Clinton\\'s legal defense fund was returned after it was found to have been largely funded by Asian interests. Trie was convicted of violating campaign finance laws in 1998. \\nOne of Trie\\'s main sources of cash was Chinese billionaire Ng Lap Seng, according to a Senate Report. Ng Lap Seng had connections to the Chinese government. Seng was arrested in 2015 over an unrelated bribery case, but this gave investigators the opportunity to question Seng about the Chinagate scandal. Former United Nations General Assembly President John Ashe was also caught in the bribery case and was about to testify to the links between the Clintons and Seng when he was found dead that very morning. Initially reported as having died from a heart attack, John\\'s throat had obviously been crushed. At that point the official story changed to him accidentally dropping a barbell on his own throat. \\nNg Lap Seng with the Clintons. \\nJohnny Chung \\nGave more than $366,000 to the Democratic National Committee prior to the 1996 campaign, but it was returned after officials learned it came from illegal foreign sources. Chung later told a special Senate committee investigating 1996 Clinton campaign fund-raising that $35,000 of his contributions came from individuals in Chinese intelligence. Chung pleaded guilty to bank fraud, tax evasion and campaign finance violations. \\nChinagate, documented by Judicial Watch, was uncovered by Judicial Watch founder Larry Klayman. Technology companies allegedly made donations of millions of dollars to various Democratic Party entities, including President Bill Clinton\\'s 1996 re-election campaign, in return for permission to sell high-tech secrets to China. Bernard Schwartz and his Loral Space & Communication Ltd. later allegedly \"helped China to identify the cause of [a rocket failure], thereby advancing China\\'s missile program and threatening U.S. national security, according to records. \\nThis establishes a history of the Clintons treating US secrets as their own personal property, and selling them to raise money for campaigns! \\nIs history repeating itself? It appears so! \\nLet us consider a private email server with weak security, at least one known totally open access point, no encryption at all, and outside the control and monitoring systems of the US government, on which are parked many of the nation\\'s most closely guarded secrets (as well as those of the United Nations and other foreign governments)! It is already established that Hillary\\'s email was hacked. One hacker named Guccifer provided copies of emails to Russia Today, which published them.'"}, "time": 1742564404.9020612}