{"duration": 0.07028913497924805, "input_args": {"text": "'Speaker of the House Paul Ryan’s ( ) leadership was called into question by new voices Thursday night as hopes expire of passing a bill to repeal and replace Obamacare before President Donald Trump’s first 100 days end on Saturday. [At a meeting on the Hill late Thursday night, the speaker and his House Republican leadership team decided to further delay the vote. With what appeared to be the acquiescence of conservatives in the Freedom Caucus and   like Club for Growth and FreedomWorks, who took much of the blame for the failure of the first attempt to pass the American Health Care Act (AHCA) in March, hopes were buoyed that passage was imminent. Instead, according to Politico, House Majority Leader Kevin McCarthy ( ) told reporters as he left the meeting, “We are not voting on health care tomorrow. We’re still educating members. ”  Syndicated radio host Laura Ingraham joined Fox News’s Hannity to vent her frustration with House Republicans. “This is another loss for Paul Ryan,” she told host Sean Hannity: Paul Ryan was given this assignment to quarterback this legislation through the House. It wasn’t easy. It was going to be difficult. You have a lot of different factions, different people, different values, different personalities, but this is something you had to do. If you can’t get health care done, and done right, eight years after saying you were gonna do it   …     I don’t even know what to say about that. What does that say about your ability to lead at a critical time for our economy? Ingraham then hinted she may be at the end of her patience with Speaker Ryan’s leadership. “I’m not gonna sugarcoat this. This is an embarrassment that this couldn’t get done,” she fumed. “You’ve got to get better communications. You have to know your caucus. Otherwise, just give it to someone who can do it. That’s all I can say”: Hannity’s next guest, fellow Fox host Lou Dobbs, went even further in his condemnation of Ryan’s handling of healthcare legislation. “Laura, bless her heart, is trying to be nice to Paul Ryan,” he said. “I think the man is absolutely a disaster. He’s become nothing less than a caricature as House speaker. He’s inept, and the conference, if they don’t get rid of him, we’re going to watch this nonsense go on in perpetuity. ” Dobbs explained that, in his view, President Trump was doing all he could to move his political agenda along and that House GOP leadership had to be held responsible for the sluggish pace on legislative priorities. He then explicitly called for Speaker Ryan’s ouster and replacement by Rep. Mark Meadows ( ) chairman of the   Freedom Caucus, or his predecessor in that position, Rep. Jim Jordan ( ): Paul Ryan is not a conservative, never has been. His leadership team is a mixed bag of conservatives [and] moderates. The Freedom Caucus are traditional conservatives and great Americans, all of them.   …     You and I both know Mark [Meadows] and Jim Jordan   …     for the great Republicans they are. I think either one of those two would make such a terrific speaker. Dobbs’s suggestion would not be the first time Paul Ryan and the Freedom Caucus found themselves in contention. Members of the Freedom Caucus themselves have called Ryan’s continuation as speaker of the House into question. The entire Freedom Caucus leadership also refused to endorse Ryan in his 2016 primary challenge from the right by businessman Paul Nehlen, although they did assent to Ryan’s speakership the previous year. Ingraham and Dobbs’s comments add to a growing chorus of voices on the right of the Republican Party calling for Ryan to relinquish the speaker’s mace in the wake of the failure to see through the key GOP platform plank of repealing and replacing Obamacare.'"}, "time": 1742564326.9672606}