{"duration": 0.14170432090759277, "input_args": {"text": "'Leave a reply \\nMary O’Malley – A friend of mine was gifted a vacation on a river barge through France and Germany. She was really excited because she could never afford to do this on her own. Her itinerary included a flight from Seattle to New York and the next day, she and her cousin would fly to Europe together. \\nAs they were getting ready to go through the international security checkpoint, the TSA officer would not let my friend through because her passport had expired. At that moment, a feeling of panic came over her when she realized she had grabbed the wrong passport. As the panic began to intensify, she tuned into her body and used her breath to calm herself down and think rationally. \\nHaving done awakening work for some time, she realized that reacting to whatever Life is offering only creates suffering. She said, “Mary, I can’t believe it. If this happened years ago, I would have had a temper tantrum and been in tears all day. Instead, I calmly told my cousin to go on without me and I would have a friend in Seattle overnight my passport so I could take a flight the following day.” \\nThis is the power of accepting whatever Life brings. She added “I did not react or panic when I realized I would have to pay for a new ticket and stay in New York by myself. It all turned out so differently than what I thought, and it was all okay.” \\nWhenever we are faced with a challenge, whether it is a cut on our finger, a raging boss, or an expired passport, we all react in our own unique ways. One of the core ways we can heal ourselves is by getting to know our own patterns of reaction. Some of the standard modes of reaction are the stoic, the pleaser, the worrier, the rager, the freezer, the rescuer, the victim, the judger and the self-absorbed one. We put these reactive parts of ourselves together into our own particular style. \\nOur patterns of reaction can bring so much heartache into our lives. My primary mode of reaction was to freeze, and like all patterns of reaction, it would tighten me, isolate me and cut me off from the flow of love that is Life. It got stronger as I got older, and it became much more entrenched when I tried to make it stop. Then I learned how to see it and meet it with understanding and mercy. Only then was I able to free-up this frozen energy and learn how to respond to Life rather than always living in reaction. \\nThis process of seeing, loving and letting go of your patterns of reaction happens in three phases. \\nFirst phase: You are caught. You either can’t see your patterns or, if you do, you have little willingness to do anything about them. You also don’t recognize the consequences that come from living out of your repetitive reactions. When you decide you don’t want to live this way anymore, you usually declare war on the pattern, trying to wrestle it to the ground. This only works for a short period of time because you haven’t done the work needed to dissolve the pattern. \\nWhen the pattern comes back again, you then get caught in self-judgment (I did it again) and despair (I will never get out of this). You begin to move into the second phase when you see that the price you pay for taking care of yourself in your old ways isn’t worth it, and you understand that trying to wrestle it to the ground doesn’t work. \\nSecond phase: As you come to realize that living out of your old patterns isn’t how you want to live, and trying to get rid of them seems to only empower them, you begin to become curious about what is going on and feel the possibility of living another way. \\nAt the beginning of this phase, when your patterns of reaction are triggered, you will get lost in them most of the time. But slowly, you become more curious and more merciful with yourself. Even when you get completely lost, there comes a time when you can let go of judgment and despair, and simply notice how you are reacting. \\nThis may be right in the middle of the pattern, a few minutes afterwards, or a few days afterwards. You become more curious than controlling and more compassionate than judgmental. \\nYou finally come to the place where you can actually stand with the discomfort of not following your pattern. This almost feels like detox, and it is good to have the support of other people as you learn how to be with your experience rather than running away from it. The more you can be with yourself, the more it opens your heart. And that is really what you have been longing for all along – the ability to live from your own heart. \\nThird phase: As your ability to see and let go of your old patterns increases, you enter the third phase. This is where your primary relationship with yourself is one of compassion and curiosity. You still may get caught in your patterns, but only for short periods of time, and rather than bringing up judgment or despair, they become an invitation to open back into Life. \\nThe more you can meet yourself exactly as you are, the more you discover how to live from your own truth. You can now let go of the idea that a good life is one where everything is under control. Instead, you learn how to ride the ups and downs of your life, trusting yourself, trusting your life. You then become the awakened heart that heals not only yourself but also the world. \\nThere isn’t a clear delineation with these three phases. On any particular day, you may touch into all three phases. But the more you can be curious and merciful with yourself, the more you will naturally gravitate toward the third phase – the place of truly becoming yourself. This is the greatest gift you can give to yourself and to Life. SF Source Mary O’Malley  '"}, "time": 1742563764.70598}