{"duration": 0.06720328330993652, "input_args": {"text": "'BERLIN (AP)  —   Chancellor Angela Merkel’s conservatives won a state election Sunday in their   rivals’ traditional heartland, a stinging blow to the German leader’s challenger in September’s national election. [The western state of North   which includes Cologne, Duesseldorf and the Ruhr industrial region, is Germany’s most populous and has been led by the   Social Democrats for all but five years since 1966.  It is home to 17. 9 million people, nearly a quarter of Germany’s population. It is also the home state of Martin Schulz, the Social Democratic challenger seeking to deny Merkel a fourth term in the Sept. 24 national election —   though he wasn’t on the ballot Sunday. #BREAKING  —   Merkel’s CDU leads big after initial exit polls in a critical regional election#nrwltw17 #Germany #NRW pic. twitter.   —   dwnews (@dwnews) May 14, 2017,  Projections for ARD and ZDF public television, based on partial counting, showed Merkel’s Christian Democratic Union beating the Social Democrats by about 34 percent to a bit over 30. 5 percent. They gave the Greens, the junior coalition partners in the outgoing state government, only 6 percent. That means governor Hannelore Kraft’s coalition with the Greens lost its majority in the state legislature. And it puts conservative challenger Armin Laschet, a   deputy leader of Merkel’s party, in a position to replace her. Herzlichen Glückwunsch @ArminLaschet  @CDUNRW_de! Der SPD ist die Kraft ausgegangen. Tolle Stimmung in @ ! @BerlinGestalter   pic. twitter.   —   CDU Berlin (@cduberlin) May 14, 2017,  “The CDU has won the heartland of the Social Democrats,” said the conservatives’ general secretary, Peter Tauber, calling it a “great day” for the party. “This is a difficult day for the Social Democrats, a difficult day for me personally as well,” Schulz told reporters in Berlin. “I come from the state in which we took a really stinging defeat today. ” #SPD’s Schulz says his party suffered a crushing defeat (in state election in SPD’s homeland NRW). pic. twitter.   —   Holger Zschaepitz (@Schuldensuehner) May 14, 2017,  But he urged the party to concentrate now on the national election. He said that “we will sharpen our profile further  —   we have to as well. ” “We will continue fighting the result will come on Sept. 24,” Schulz said. The Social Democrats’ national ratings soared after Schulz, a former European Parliament president, was nominated in January as Merkel’s challenger. But defeats in two other state elections since then had already punctured the party’s euphoria over Schulz’s nomination, and its ratings have sagged. Sunday’s election was the last before the national vote. So sehen Sieger aus! @bodoloettgen @ArminLaschet #nrwgehtvor #ltwnrw17 #ltwnrw pic. twitter.   —     (@CDUNRW_de) May 14, 2017,  Kraft announced that she was stepping down as the Social Democrats’ regional leader. The projected result is the party’s worst in North   since World War II. The projections put support for the   Free Democrats, who are eyeing a return to the national parliament at September, at a strong 12 percent. The party  —   whose national leader, Christian Lindner, led its election effort in North    —   has tended to ally with Merkel’s conservatives over recent decades. The nationalist Alternative for Germany was seen winning 7. 5 percent, giving it seats in its 13th state legislature, and the opposition Left Party around 5 percent. A likely outcome appeared to be a “grand coalition” of the biggest parties under Laschet, though it was also possible that a slim   majority for the CDU and Free Democrats would emerge. A “grand coalition” would mirror Merkel’s national government, in which the Social Democrats are the junior partners. After a blaze of publicity earlier this year, Schulz  —   who chose not to join the government when he returned to Germany after being president of the European Parliament  —   has struggled to maintain a high profile. In the North   campaign, Merkel’s conservatives sought to portray Kraft’s government as slack on security, and also assailed what they said is regional authorities’ poor handling of education and infrastructure projects. Health Minister Hermann Groehe, a conservative, said his party had “tailwind” from the national level, but Sunday’s vote was “a decision about state politics. ” “There was no tailwind from Mr. Schulz that could have balanced that out,” he said. Merkel’s party seemed keen not to appear too euphoric. Asked about Germany’s government after September her chief of staff, Peter Altmaier, said that “we always have to keep a cool head   …     we shouldn’t talk about coalitions before the harvest is in. ” National polls show the Social Democrats trailing Merkel’s conservatives by up to 10 points after drawing level earlier this year.'"}, "time": 1742562121.4699278}