{"duration": 0.09292030334472656, "input_args": {"text": "'The only gap in Katinka Hosszu’s swimming résumé was an Olympic medal, but she rectified that in resplendent fashion on Saturday night, winning the   individual medley in 4 minutes 26. 36 seconds at the Olympic Aquatics Stadium. The time broke the world record of 4:28. 43 set at the London Games by China’s Ye Shiwen. Here’s what to look forward to on Sunday. Hosszu’s best finish in six individual events contested over three previous Olympics was a fourth in the 400 I. M. in 2012. Ye finished 27th in the heats in defense of her title in 4:45. 86. Hosszu of Hungary is known for having a contentious and intense relationship with her coach and husband, Shane Tusup. First Relay to Australia: Australia won the women’s   relay in a world record time of 3:30. 65. The American team had the lead after two legs, but swimming third, Bronte Campbell cruised past Dana Vollmer to give her sister, Cate, the lead. The American team had Katie Ledecky on anchor, but she is better at longer distances, and could not pass the   freestyle favorite, Campbell. Despite their freestyle sprint excellence over the years, the Americans have not won this race since 2000. Horton Beats Sun: Mack Horton of Australia defeated the defending champion, Sun Yang, in the men’s   freestyle. The two rivals started slowly and were only 6th and 7th after 150 meters behind Britain’s James Guy, who raced to the lead in world record pace. But the favorites moved methodically up to the lead, blowing past the fading Guy. Horton always led Sun and won in 3:41. 55. Gabriele Detti of Italy was third, and the American Conor Dwyer, who had the fastest qualifying time, was fourth. Sun and Horton had developed a sharp rivalry this week. Sun splashed and taunted Horton in the practice pool, and Horton responded by calling Yang a “drug cheat. ” Sun served a   doping suspension in 2014. • Adam Peaty of Britain, the only man to break 58 seconds in the   breaststroke, lowered his world record in the preliminaries at the Olympic Aquatics Center on Saturday. Swimming well ahead of the field in smooth water, Peaty clocked a 57. 55 to lower his   record of 57. 92. The first gold medalist was a    West Virginia University sophomore, Virginia Thrasher. With two shots to go in the women’s air rifle event, Thrasher, who is known as Ginny, led by 0. 7 points. She coolly squeezed off shots of 10. 5 and 10. 4 to take gold. Two Chinese shooters, Du Li and favored Yi Siling won silver and bronze. Another American, Sarah Scherer was eighth. Thrasher has only been shooting for five years, after she asked her father to take her deer hunting. She was N. C. A. A. champion as a freshman and surprisingly qualified for the U. S. team at the Olympic Trials. “For me, it has been a whirlwind of a summer,” she said. She will also compete in the   rifle, three positions, next Saturday, then head back to W. V. U. “I get home 20 hours before the first class,” she said. “So I’ll be in physics at 8:30 a. m. ”In the afternoon shooting event, history was made when Vinh Xuan Hoang won the men’s air pistol. It was the first gold medal in any sport for Vietnam. “Making this gold medal is a life memory, never forget this,” Hoang said. “Because first time making a gold medal for Vietnam. ” • The U. S. women’s soccer survived a tough early challenge from France to win by  . The U. S. men’s basketball team, fresh from their stay on a luxury yacht, faced absolutely no challenge from China in a   destruction. • Women’s rugby arrived at the Olympics for the first time, in the form of rugby sevens. The United States split its two games, losing to Fiji, but beating Colombia. The women’s volleyball and field hockey teams won. • Venus Williams, gold medalist in 2000, was eliminated in the first round of the women’s singles by Kirsten Flipkens of Belgium. There are   athletes, and then there are the world’s best athletes. What’s the thing that separates the two? That’s what we set out to discover when planning for these Summer Games. It didn’t take us long to focus on Simone Biles, a        whirlwind who absolutely dominates the world of gymnastics. Watch this interactive to find out how she does it.'"}, "time": 1742564040.3955564}