{"duration": 0.10951852798461914, "input_args": {"text": "'MEXICO CITY  —   One of President Enrique Peña Nieto’s top ministers and closest allies resigned on Wednesday, an apparent casualty of Mr. Peña Nieto’s wildly unpopular meeting last week with Donald J. Trump. The spectacle of the Mexican president standing next to the Republican candidate who has disparaged Mexicans prompted widespread dismay and anger here, and reportedly divided Mr. Peña Nieto’s cabinet. Luis Videgaray, the finance minister who stepped down on Wednesday, had championed the idea of inviting Mr. Trump to Mexico City over the objections of other ministers, according to several Mexican news media reports, though Mr. Peña Nieto insisted it was his own initiative. Mr. Peña Nieto announced Mr. Videgaray’s resignation at a news conference. He did not give a reason for Mr. Videgaray’s departure. But some analysts interpreted it as the latest, and most dramatic, effort by the president to regain the trust of the Mexican public following his meeting with Mr. Trump, the Republican presidential nominee, who has made criticism of Mexicans and Mexico an incendiary motif of his campaign. “It will help mitigate the anger,” said José Antonio Crespo Mendoza, a professor of politics at Centro de Investigación y Docencia Económicas, a Mexican research and higher education center. “President Peña Nieto realized things could not stay as they were, and that they could no longer insist that it had been a good call” to invite Mr. Trump. Mr. Trump cast his visit as a statesmanlike effort to reach out to a country he had alienated. But hours after his meeting with Mr. Peña Nieto, he gave a combative speech in Phoenix that struck many of the   themes that have defined his candidacy. The episode has left Mr. Peña Nieto and his government embarrassed at a time when his approval ratings were already at record lows over rising crime, poor economic growth and conflict of interest scandals. In the days after the meeting, the president scrambled to contain the fallout and to repair the damage  —   using a television interview, a newspaper column and a    meeting held to mark his annual “Informe de Gobierno,” Mexico’s equivalent of the State of the Union address. But these steps seemed to do little to mollify many Mexicans, who accused the president of humiliating the nation, first by inviting Mr. Trump and then by failing to use the opportunity to push back against the candidate’s criticism of Mexico and Mexicans. The discontent has continued to simmer on social media and in the news, and an   Nieto demonstration has been called for Sept. 15. On Tuesday, an opposition senator  —   seeking to provide the defense of Mexico that he said Mr. Peña Nieto had failed to offer  —   submitted a bill that would empower the government to fight several of Mr. Trump’s foreign policy proposals, including his promise to force Mexico to pay for the construction of a border wall and his threat to withdraw the United States from the North American Free Trade Agreement. “Of all the scandals Peña Nieto has faced, this is the most devastating,” said Alfonso Zárate, a political analyst and columnist in Mexico City. From Mr. Trump’s perspective, the trip was a risky move from the start, given the potential for embarrassment if the Mexican president were to criticize him publicly. It came together after Jared Kushner, the    and campaign adviser to Mr. Trump, began to lay the groundwork with Mexican officials in early August. Mr. Kushner dealt with Mr. Videgaray and other government officials in negotiating how the meeting would happen, according to a close ally of Mr. Trump who was involved in the arrangements. Mr. Trump’s visit was largely   and provided his campaign with pleasing visuals of the Republican nominee standing side by side with a head of state. But any positive effect was undone by Mr. Peña Nieto’s insistence afterward that he had told Mr. Trump that Mexico would not pay for a border wall, a claim that contradicted Mr. Trump’s account. Even so, the damage to Mr. Peña Nieto seems to have been far worse. While Mr. Videgaray’s resignation may have been intended to stanch the political bleeding in Mexico City and salvage the president’s standing, it also shifted the odds in the contest for future leadership of the governing Institutional Revolutionary Party, or P. R. I. In addition, it left Mr. Peña Nieto without one of his closest confidantes in his administration. Mr. Videgaray, who holds a doctorate in economics from the Massachusetts Institute of Technology, had been a rising star in the P. R. I. and his name was often mentioned as a possible presidential contender in 2018. He had worked for the president since 2005, when Mr. Peña Nieto was the governor of the State of Mexico, helping him restructure the state’s debt and coordinating Mr. Peña Nieto’s 2012 presidential bid. Mr. Videgaray became the president’s closest ally and adviser in the cabinet  —   “the power behind the throne,” Mr. Zárate said. His reputation was tarnished by reports he had bought a house at a golf club from a government contractor, though not enough to force him out of the cabinet or out of contention for 2018. The president, who is known for his loyalty to his inner circle, stuck by him. Indeed, Mr. Peña Nieto was accompanied by Mr. Videgaray when he made the announcement on Wednesday, and was warm and effusive toward his longtime adviser, thanking him for being “committed to Mexico and loyal to the president of Mexico. ” Mr. Zárate said the departure of Mr. Videgaray was “very painful for the president. ” He added, “we all know the enormous influence that he has. ’’ “It leaves the president orphaned,” Mr. Zárate said. As finance minister, Mr. Videgaray was at the center of the administration’s efforts to overhaul the country’s telecommunications and energy sectors. He successfully pushed to open the nation’s oil industry, which had been a   monopoly since the 1930s. He also championed a tax overhaul that increased tax revenue but earned him some enemies within the business community. During his tenure, however, Mexico saw slow economic growth and a weak peso, and the country’s standing with   agencies has suffered. Moody’s Investors Service and SP Global Ratings have each lowered their outlook from stable to negative in recent months. Economic performance has been so underwhelming that some analysts believe Mr. Videgaray’s departure was an inevitability discussed well before Mr. Trump’s visit. Furthermore, Mr. Videgaray is rumored to be a possible P. R. I. candidate for the governorship of the State of Mexico. “I see this as a clear electoral play,” said Genaro Lozano, a professor of United States government and society at the Universidad Iberoamericana in Mexico City. “The State of Mexico is what they are betting on, what they have their eye on. It is one of the largest states in terms of population, with a solid and powerful P. R. I. structure, electoral support base and political mobilization. Even if they would put Trump’s cousin as candidate for governor, P. R. I. would win. ” The cabinet shuffle occurred a day before the Mexican government was scheduled to present its 2017 budget, a job that now shifts to the new finance minister, José Antonio Meade, whose appointment was announced at the news conference. Mr. Meade, 47, who has a doctorate in economics from Yale University, has been a significant player in the last two administrations. He was finance minister under Mr. Peña Nieto’s predecessor, Felipe Calderón, and Mr. Peña Nieto made him the foreign minister in 2012. In that post, he broke from his reputation as an apolitical technocrat when he led an angry defense of the government against a United Nations report condemning Mexico for its use of torture on suspects in detention. Thirteen months ago, Mr. Peña Nieto appointed him to head the Social Development Ministry, a post that elevated Mr. Meade to the level of a possible presidential candidate as he traveled around the country promoting the government’s programs for the poor.'"}, "time": 1742563220.8961234}