{"duration": 0.06377887725830078, "input_args": {"text": "'On Wednesday’s Breitbart News Daily, SiriusXM host Raheem Kassam asked guest Frank Gaffney about a post he wrote on the Center for Security Policy blog, in which he endorsed a call by Jeanine Pirro of Fox News for House Speaker Paul Ryan to resign following the failure of the House Obamacare replacement bill. [As he wrote in the post, Gaffney stipulated that “health care is not my field, by any means,” so he did not mean to criticize the substance of the   House bill.   “I think what is of concern is that this was a doomed approach,” he said. “Paul Ryan, who is supposed to be helping President Trump get through his agenda in the House of Representatives and the congress more generally, should have known better. He either didn’t, which justifies removal on the grounds of incompetence, or did  —   in which case I think the argument is that he’s simply not a reliable partner for the president in getting this agenda done. ” “On either grounds, I think that it would be necessary for the country, not just for the Trump presidency but for the country, to have leaders in both the House and the Senate who want to ensure that the president’s projects, the president’s agenda, the president’s promises to the American people  —   which I think were momentous, not just for health care reform but in so many other respects, including the return to the prospect of peace through strength, which if course is near and dear to my heart, and I think yours Raheem  —   is going to be a necessary condition going forward,” he argued.  “From a layman’s perspective, from a person who understands as a layman the importance of health care, this seemed to be a statist  —   well, ‘Obamacare Lite’ it’s been called  —   approach, when a free market approach seems to be called for,” Gaffney said. “I think that’s what Donald Trump set out to do. That’s what he promised the voters. It’s what I think you could get a majority of the Congress behind, if it is clear that in the process, you’re not going to abandon people who genuinely need health care support. ” “It goes back to kind of the fatal flaws of Obamacare, and just making it a little better at the margins, which is I think, at best, what you could say Ryan was up to. It was clearly unsatisfactory and was, as I say, doomed to fail,” he pronounced. Gaffney added compliments to Rep. Mark Meadows ( ) and the House Freedom Caucus for “ensuring that it did fail. ” “I think they’ve done a great service, despite all the brickbats being thrown their way, for President Trump as well as for the country,” he said. Gaffney conceded that choosing a possible replacement for Rep. Ryan as Speaker of the House was a difficult task. “I think there are a number of people who could probably command the support of the majority of the House,” he said. “It wouldn’t be for me to pick them. Some have been willing to serve in the past. Daniel Webster comes to mind, he seems to be a very presentable guy. It would be obviously up to him or others in the House to stand for this, if in fact Paul Ryan were to create a vacancy  —   which I hope he will do. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742562323.6969838}