{"duration": 0.13924622535705566, "input_args": {"text": "\"Getty - Justin Sullivan The Wildfire is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nSurely, she can't be serious. No, this isn't a set-up to an Airplane! punchline, this appears to be life under an imminent Hillary Clinton regime. \\nIt turns out that Secretary of State is not really all about being the nation's chief diplomat and top foreign policy aide to the president, but is rather a cozy career path for Democratic politicians who want to pad their resumes. Who knew? \\nAs Secretary of State, Hillary Clinton was an indisputable disaster. Leaving aside the clear violations with her private email server, which transmitted classified information , was potentially hacked , and put the nation's security at risk for Clinton's “ convenience ” here are a few more of her lowlights: \\nCompletely misjudging the Arab Spring “democratic” movement \\nGravely miscalculating with her “reset” policy and encouraging Russian aggression \\nAssessing Bashar al-Assad as a “ reformer ,” overseeing a disastrous Syrian policy \\nFailing to support the Iranian people during their freedom demonstration \\nPushing to remove Gaddafi by force in Libya, only to leave it a failed state \\nOverseeing a Middle Eastern policy that culminated in the rise of ISIS \\nFailing to secure the Benghazi, Libya annex that was overrun by terrorists, leading to the death of four American servicement, then lying by blaming a Youtube video Image Credit: Jim Watson/AFP/Getty Images \\nIt goes on and on. But it gets worse. The reigns at the State Department were turned over to Senator John Kerry, whose testimony on the Vietnam war is notorious on the right. Kerry's tenure has been nothing short of feckless and laughable. No, seriously. \\nVladimir Putin, for example, is actually laughing at Kerry's useless protestations against Russia's backing of Assad. Kerry was also a vocal supporter of the Iranian nuclear deal, and he is satisfied that the deal will keep the mullahs on good behavior, despite their venomous hatred of the United States and lengthy track record of lying. \\nThe icing on the cake for this stretch of Democratic career politicians taking over the helm at State will culminate with Hillary Clinton's whispered preference for the job with current Vice President Joe Biden. Image Credit: Mark Wilson/Getty Images \\nAs reported by The Washington Examiner: \\nVice President Joe Biden is at the top of the list for secretary of state if Hillary Clinton pulls out a win on Nov. 8. \\nA source close to Clinton's transition team told Politico on Thursday evening that the Democratic nominee is already making serious considerations when it comes to who would be part of a Clinton 2.0 Cabinet. \\nThe hilarious part? Biden himself seems to be oblivious to the potential nod. \\nBiden himself is apparently unfamiliar with the news. Neither Clinton, a former secretary of state herself, nor her aides, have informed the former Senate Foreign Relations Committee chairman that he's most likely to oversee international affairs if she wins. \\n“He'd be great, and they are spending a lot of time figuring out the best way to try to persuade him to do it if she wins,” said the source familiar with the transition planning. \\nThough many are in disbelief about the report, there is one very plausible reason to believe that Biden very well could spend his sunset years at the State Department: And that's the reward for not running. https://t.co/10DepJ4x9B — Stephen Miller (@redsteeze) October 28, 2016 \\nThat's just the way that Democrats roll, nowadays. \""}, "time": 1742562825.9878113}