{"duration": 0.09453868865966797, "input_args": {"text": "'Venezuela: Will the army save the nation from chaos? 27.10.2016 Vladimir Padrino The Venezuelan Parliament stopping the procedure of the referendum about the resignation of President Nicolas Maduro and urged the people for \"rebellion.\" The Brazilian precedent has thus become a practice, which can be referred to as a \"legitimate illegal coup\". Why is so hard for Washington to topple Venezuelan President Maduro? Legitimate illegal coup Print version Font Size Not that long ago, Brazilian President Dilma Rousseff was removed from power in compliance with all constitutional procedures. Dilma was a leftist progressive president, who was accused of using loans of private banks to consolidate the budget, which played a crucial role in the formation of her positive image in the presidential race. This practice is frequently used in Brazil, but the opposition could not forgive Rousseff for winning the presidential campaign by a very small margin.The economic situation in Venezuela is even harder than that in Brazil. The country suffers from low profitability of the budget due to the fall in oil prices and wild inflation of 400 percent for the current year. The authorities of the country had to introduce cards to distribute foodstuffs. The current situation in Venezuela looks very much like the one that Russia experienced in 1992: empty stores, hospitals where you have to pay for everything and depression. In the parliamentary elections last year, Socialists suffered a defeat, and the opposition bloc won the absolute majority of 74 to 26 votes.The government of Hugo Chavez should have created reserve funds not to let all this happen. In addition, Chavez used to give oil, the nation\\'s treasure, away to assist \"fraternal peoples.\" The previous administration of Venezuela made a mistake when it decided to develop economic ties with China. Today, China decreases both investment and oil procurement. As a result, the parliament\\'s initiative to convene a referendum about Maduro\\'s resignation has collected a lot more signatures than was necessary. A survey conducted by Venebarómetro shows that 88 percent of Venezuelans want to vote, and 10.8 million of them want Maduro to step down, whereas 1.4 million are against such a move. However, the courts of five provinces of Venezuela canceled the results of the first phase of the referendum signature collection, making the second phase of the process, which was scheduled for 26-28 October, impossible. It was important for the opposition to hold the referendum in 2016. If the referendum is held after January 10, 2017, and even the majority of Venezuelans vote to remove Maduro from power, the powers of the head of state for the remaining two years will be handed over to the sitting vice-president. If the referendum is held earlier, new elections would have taken place - this was the prime goal of the Venezuelan opposition. Maduro wins in the legal field of Venezuela, but not the opposition. One can talk a lot about the corruption of Brazilian senators, who voted for the impeachment of Dilma, and the corruption of Venezuelan judges, who did not approve the collected signatures, but it is very difficult and nearly impossible to prove it. Therefore, the dispute between the executive and the legislative powers of Venezuela may take an illegitimate turn to repeat the events that took place in Russia in 1993 or in Ukraine in 2014. In both of these scenarios, the army will play the decisive role. MP Freddy Guevara has already urged the Bolivarian National Armed Forces (BNVS) not to obey the dictatorship and not to shoot at their own people.\" However, the army is loyal to Maduro. Vladimir Padrino is the future President of Venezuela? Venezuela\\'s Defense Minister and the commander of the Strategic Operational Command, Vladimir Padrino López, remains personally loyal to President Maduro. Padrino has recently been appointed the chief of the Sovereign Supply Mission (misión Abastecimiento Soberano) and the Second Vice-President, which will allow him to perform the duties of the president in the event Maduro is impeached after January 10, 2017. Secondly, Padrino successfully neutralizes certain divisions within the army, to ensure the continuity of \"Chavismo.\" There is a group of those, who do not want to see Maduro in power, but demand the \"return to the roots\" of the Bolivarian revolution. There are also those who consider themselves \"apostates from Chavismo\", whereas the third group is controlled by Chavistas, Member of Parliament, Chairman of the United Socialist Party of Venezuela Diosdado Cabello. His people believe that \"some things need to change, but not through the toppling of Maduro, because Cabello is his political ally.\"Vice-Admiral Rafael Huizi Clavier believes that Padrino holds absolute power in the army. He has his people both in the National Guards (internal troops) and in military districts (Regiones de Defensa Integral (REDI)), which is a crucial aspect. Thus, it is clear that Maduro will be able to retain power in the midst of a crisis with Padrino\\'s help. Lyuba Lulko'"}, "time": 1742562634.7501621}