{"duration": 0.20187878608703613, "input_args": {"text": "'  What Donald Trump Just Did Is Going To Have Social Conservatives In A State Of Complete Shock   14th, 2016 \\nThis is NOT what most social conservatives were expecting. Like millions of other Americans, I greatly celebrated when Donald Trump pulled off a miracle on election night. But within a week of his stunning election victory, many social conservatives already feel like they are being stabbed in the back. On Sunday, 60 Minutes aired a post-election interview with Trump in which he explained that his stance on gay marriage is that it is “settled” and that he has no plans to try to overturn the Supreme Court decision legalizing it. According to CNN , this answer “could leave conservatives worried”… \\nFor the first time since winning the election, Donald Trump has weighed in on two of the most controversial social issues the Supreme Court has taken on ever: gay marriage, and abortion. \\nHis answers could leave conservatives worried. \\nTrump indicated he’s “fine” with the high court’s opinion legalizing same-sex marriage and called it “settled,” but committed to appointing justices who want to change the 1973 Roe v. Wade ruling affirming abortion rights. \\nCNN’s article didn’t fully capture the flavor of what Trump actually said. A Mediaite article contained more extended quotes… \\n“It’s irrelevant because it was already settled. It’s law. It was settled in the Supreme Court,” Trump said bluntly on 60 Minutes . \\n“I mean, it’s done…” he continued. “These cases have gone to the Supreme Court. They’ve been settled, and I’m fine with that.” \\nYou can see Trump making these comments for yourself right here . It is simply not accurate for Trump to say that gay marriage is “settled” while Roe v. Wade is not. In the legal world, nothing is ever really “settled”. \\nJust like Roe v. Wade, Trump could publicly commit to appointing Supreme Court justices that would overturn the legalization of gay marriage. \\nAnd without a doubt, the people that elected him were counting on him to do something about it. \\nBut the truth is that he doesn’t want to do something about it. \\nDonald Trump is “fine” with gay marriage, and so that political battle is now officially over. \\nFor social conservatives, gay marriage is one of the Big Three. Abortion and Israel are the other two “red line issues”, and since the election Donald Trump has also had some extremely disturbing remarks about Israel. \\nIn fact, Trump just told the Wall Street Journal that a peace agreement that would permanently divide the land of Israel into two states would be “the ultimate deal” and that he is very interested in trying to make that happen “for humanity’s sake” . \\nCould it be possible that social conservatives have been betrayed again? \\nCould it be possible that Donald Trump was just another politician that was willing to say anything to get elected? \\nSo far Trump has not appointed any prominent evangelical Christians to any important posts, but it is being reported that Trump is considering “an openly gay man to represent the US at the United Nations”… \\n  is considering a woman to run the Republican Party and an openly gay man to represent the US at the United Nations, moves that would inject diversity into a Trump team. \\nThe incoming president is considering Richard Grenell as United States ambassador to the United Nations. If picked and ultimately confirmed by the Senate, he would be the first openly gay person to fill a Cabinet-level foreign policy post. Grenell previously served as US spokesman at the U.N. under former President George W. Bush’s administration. \\nAnd let us not forget that Trump has already publicly sided with the transgender community in the bathroom wars … \\nTrump, who has spent his life in liberal New York City, referred to LGBT Republicans at the Republican National Convention and said during his campaign that transgender people should use whatever bathroom they feel comfortable using. \\nSo did Trump just use social conservatives to get elected just like George W. Bush did? \\nNow that the election is over, Trump is even calling the Clintons “good people” … \\nClinton “did some bad things,” he said, but added that ultimately the Clintons are “good people.” \\n“I don’t want to hurt them, I don’t want to hurt them,” he said. “They’re, they’re good people. I don’t want to hurt them. And I will give you a very, very good and definitive answer the next time we do 60 Minutes together.” \\nIs he serious? \\nThat is like calling the Nazis “good people”. Hillary Clinton is the most corrupt politician that   seen, and no politician in America has done more to promote abortion than she has. \\nPerhaps he has a different definition of “good” than the rest of us do. \\nOf course a whole lot of social conservatives will get really upset when they read this article and at least a few will post comments staunchly defending Donald Trump and his positions on these issues. \\nI don’t care who it is – when our politicians come out in favor of gay marriage, men using women’s restrooms or permanently dividing the land of Israel, they deserve to be rebuked. \\nLet’s see if all of Donald Trump’s new evangelical friends are willing to challenge him on these things. \\nMy guess is that they will not be. \\nThis is yet another sign that “social conservatives” and evangelical Christians have fallen into great apostasy. These days people just believe whatever they want to believe, and they are doing whatever is right in their own eyes. \\nOn Monday, we learned that one of the most popular Christian bloggers in the entire country has come out as a lesbian. \\nDoyle Melton’s brand new book is an Oprah Book Club selection, and she separated from her husband not too long ago. And of course it turns out that there was a very good reason for separating from her husband. She has decided that she is no longer a heterosexual at all, and she has just announced that she is now dating female soccer star Abby Wambach … \\nA Christian mommy blogger has announced she is dating retired soccer star Abby Wambach. \\nGlennon Doyle Melton posted a smiling picture of herself and Wambach on Sunday, with the caption: ‘Oh my God, she is so good to me. She loves me for all the things I’ve always wanted to be loved for. She’s just my favorite. My person.’ \\nBoth are newly single. \\nBut of course Donald Trump is “fine” with that, and so is much of the evangelical Christian world. \\nIn my new book , I warned about the great apostasy that is coming, and the election of Donald Trump is not going to change that. In fact, there is no possible way that America will ever be “great again” until we turn from our evil ways . \\nIf we continue to murder millions of babies in our abortion mills, judgment will come to America. \\nIf two-thirds of all Christian men continue to look at pornography on a regular basis, judgment will come to America. \\nIf we continue to greatly celebrate things that God says are an abomination, judgment will come to America. \\nIf divorce rates in the church continue to be about the same as they are in the world, judgment will come to America. \\nIf we continue to have 20 million new cases of sexually-transmitted disease   every year, judgment will come to America. \\nThe name of God is blasphemed in almost all of our movies and television shows, and yet Christians still sit there and watch them every night. America is among the world leaders in adultery, drug addiction, alcoholism, registered sex offenders and teen pregnancy, and we produce more pornography than the rest of the planet combined. \\nAmerica is not great right now, and it never will be again unless we get our hearts right with God. \\nAnd at this moment, there are very serious doubts about whether Donald Trump is going to take us in the right direction as a nation.'"}, "time": 1742628442.1244643}