{"duration": 0.09053850173950195, "input_args": {"text": "'Cascotes de desidia en una jornada marrullera y fértil RESUMEN DE LA JORNADA 10 DE LA LIGA SANTANDER 2016-2017 Resumen de la jornada Las Palmas 3-3 Celta de Vigo \\nPartido jugado épicamente de tú a tú con momentos de usted, toques de vos y algún que otro “oye, mi amol”. Primero los celtíberos, eufóricos por la victoria de Mariano Rajoy en Madrid, se pusieron por delante en el marcador y a los 21 minutos de encuentro ya ganaban por tres goles a cero, gallegamente. Reacción de los canarios en la segunda mitad, en parte reacción alérgica (el portero y dos centrales de Las Palmas son celíacos) y en parte reacción de goles que permitía a los palmípedos empatar el encuentro trepidantemente. Betis 0-1 Espanyol \\nTarde complicada en Sevilla: el toro se encontró de salida con Pezzella, que lo esperó con el capote de rodillas y continuó con unas apasionadas verónicas en las que Diego Reyes embistió con nobleza y codicia. Diego López acudió con presteza a las banderillas mientras la delantera bética, cargada de ímpetu, embestía una y otra vez a las órdenes de su entrenador. Oreja merecida para los catalanes. Athletic 1-1 Osasuna \\nOsasunitas sorprendieron con una salida en tromba que dejó 40 litros por metro cuadrado. Partido de waterpolo intenso. Eibar 2-1 Villareal \\nTremendo disgusto el que se llevaron los hombres del Eibar cuando Bruno lograba adelantar al equipo rival gracias a un penalti. Lágrimas, golpes de pecho, dos jugadores guipuzcoanos ingresados con un ataque de nervios, amenazas de suicidio por parte del guardameta eibarieta… Por suerte, el entrenador del equipo vascuence, Iñaki Trankimacin, supo devolver la calma a los suyos y llevarles hasta la victoria. Alavés 1-4 Real Madrid \\nSe adelantaron los cistercienses gracias a Deyverson en el minuto 7, pero por suerte para el equipo albino Cristiano Ronaldo reencontró la senda del gol y lo hizo en tres ocasiones. Para ello fue fundamental que al portugués le dibujaran una enorme “X” en la red de la portería contraria. Barcelona 1-0 Granada \\nUn gol de Rafinha (se pronuncia Rafiña) dio al Barça (se pronuncia Barsa) los tres puntos en el Camp Nou (se pronuncia Can Barsa) en la visita del Granada (se pronuncia Charnego). Atético 4-2 Málaga \\nEl Atlético se mostró intratable en la primera parte. Los de Simeone tiraron de orgullo y ni siquiera miraban a la cara los jugadores malagitenses. La táctica de ignorar al equipo contrario, fingiendo que no existía, pasándose la pelota como si estuvieran en un entrenamiento, dio grandes resultados ante un Málaga desconcertado que no supo superar sus dudas de carácter ontológico: ¿Qué es la realidad? ¿Realmente existimos o sólo somos fantasmas en el sueño de un perro? Sporting 1-1 Sevilla \\nEl Sporting se encontró con un poderoso Sevilla con piernas bien torneadas y biceps trabajados en el gimnasio, a lo que los asturianos respondieron mostrando sus pectorales abrillantados con aceite. Empatadamente justo. Lluvia de “likes” en Instagram. Leganés 0-2 Real Sociedad \\nEl equipo euskáldiko se llevó del estadio de Butarque los tres puntos y las taquillas con la ropa de los leganitas. Veremos. Deportivo – Valencia \\nPor el cambio horario, el encuentro se jugará hoy lunes (domingo en A Coruña) a las 20:45.'"}, "time": 1742563809.1223867}