{"duration": 0.059416770935058594, "input_args": {"text": "'DOJ Agrees: North Carolina Counties Are Purging Black Voters From the Rolls Posted on Nov 2, 2016 \\nBy Nadia Prupis / Common Dreams Thousands gathered in Raleigh, North Carolina on Feb. 13, 2916 for the Moral March, which took up voting rights as one of the day’s key issues. The NAACP is now arguing that North Carolina counties cancelled or rejected approximately 4,500 registrations, primarily affecting eligible black voters. (Susan Melkisethian / Flickr)( CC BY-NC-ND 2.0 ) \\nThe U.S. Department of Justice (DOJ) this week issued a statement of interest agreeing with civil rights advocates in North Carolina that the massive Republican-led purging of voter rolls in the state counts as a violation of federal law. \\nThe statement, issued late Monday in response to the North Carolina NAACP’s emergency lawsuit filed earlier that day, agreed with the plaintiffs that thousands of registrations had been wrongfully challenged in violation of the National Voter Registration Act (NVRA), which states that voters may not be removed from the rolls unless they have been absent for two or more cycles or given written confirmation that they have moved. \\nA Winston-Salem court is hearing the NAACP’s case Wednesday. In issuing the statement, the DOJ could help provide the court with a framework for assessing the plaintiffs’ claims that at least three counties—Beaufort, Cumberland, and Moore—had cancelled or rejected approximately 4,500 registrations, primarily affecting eligible black voters. The department occasionally files statements of interest to express its views on cases where it is not a party. \\nAdvertisement Square, Site wide \\n“The purge program at issue here rested on a mass mailing and the silence of voters largely unaware of the potential injury to their voting rights. A perfunctory administrative proceeding to consider evidence produced by a mass mailing does not turn an otherwise prohibited systematic process into an ‘individualized’ removal,” the statement read. \\nThe suit is asking that wrongfully canceled registrations be restored and that no more names are removed from the lists. \\nNAACP president Rev. William Barber II said Monday, “This is our Selma and we will not back down and allow this suppression to continue.” \\n“The Tar Heel state is ground zero in the intentional, surgical efforts by Republicans to suppress the voice of voters,” he said. “We’re taking this emergency step to make sure not a single voters’ voice is unlawfully taken away.” TAGS:'"}, "time": 1742561794.265631}