{"duration": 0.05649971961975098, "input_args": {"text": "'Actor Chris Pratt, one of Hollywood’s biggest movie stars, has apologized for saying his industry does not represent “the average,   American. ”[In an interview with Men’s Fitness, the Parks and Recreation alum decried the disparity of roles that “resonate” with him.  “I don’t see personal stories that necessarily resonate with me, because they’re not my stories,” Pratt told the outlet. “I think there’s room for me to tell mine  —   and probably an audience that would be hungry for them. The voice of the average,   American isn’t necessarily represented in Hollywood. ” It did not take long before social media users pounced on Pratt’s comments, some suggesting that several films, including several Academy   movies, featured   characters and storylines: Recent movies about blue collar people: FencesManchester By the SeaMoonlightHidden FiguresHell or High Water, xo @prattprattpratt,  —   Scott Weinberg (@scottEweinberg) April 21, 2017,  @1followernodad There’s a fucking blue collar mark wahlberg movie every two months.  —   Brittany and Cory (@bpikecsmith) April 21, 2017,  Running away from my Chris Pratt crush like pic. twitter.   —   Russell (@RussellFalcon) April 21, 2017,  ”The average,   American worker isn’t represented in Hollywood” says Chris Pratt who played a shoe shiner on a popular sitcom pic. twitter.   —   Eric Francisco (@EricTheDragon) April 21, 2017,  Some   blogs also piled on: Jezebel: “Chris Pratt Is Kind of a  ” Marie Claire: While it’s nice that Chris wants to see more people like himself   he is a straight, white male. And Hollywood has an *actual* diversity problem at the moment —  both in terms of race and gender. So, actually, maybe it’s time for there to be less stories like Chris Pratt’s, and more stories about, oh, you know, literally any other marginalized community in this country. The Mary Sue: “I Miss Not Knowing What Chris Pratt Thinks About Things” Pratt hopped on Twitter on Friday and walked his   comments all the way back. “That was actually a pretty stupid thing to say,” the Virginia, Minnesota, native wrote to his four million followers. “I’ll own that. There’s a ton of movies about blue collar America”: That was actually a pretty stupid thing to say. I’ll own that. There’s a ton of movies about blue collar America. https:  .   —   chris pratt (@prattprattpratt) April 21, 2017,  Pratt, who stars in blockbuster franchise films, including Universal’s Jurassic World and Disney’s Guardians of the Galaxy, received a star on the Hollywood Walk of Fame Friday. Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742563877.6939044}