{"duration": 0.18343615531921387, "input_args": {"text": "'USA continues drive to plutocracy, dismantling of state By John Stanton Posted on November 8, 2016 by John Stanton \\nInterest groups and lobbyists have been busy peddling their client’s interests since 1816 when Delaware manufacturer Isaac Briggs teamed up with his colleagues in an attempt to convince federal lawmakers to impose tariffs on the import of foreign made manufactures. \\nAlexis de Tocqueville writing in his two volume set Democracy in America (1835, 1840) observed the unique American characteristic of banding together in civic and issue specific interest groups for the purpose of influencing lawmakers, regulators and public opinion at the local, state and national levels. \\nCongressional legislation to limit the influence of lobbyists in the US Congress and the federal government at large arguably did not being in earnest until the 20 th Century. The landmark Foreign Agents Registration Act of 1938, passed on the eve of World War II, “requires persons acting as agents of foreign principals in a political or quasi-political capacity to make periodic public disclosure of their relationship with the foreign principal, as well as activities, receipts and disbursements in support of those activities requiring foreign company or government.” \\nThat act remains in force today. \\nNice try \\nThe Federal Regulation of Lobbying Act of 1946, the Lobbying Disclosure Act of 1995 and the Honest Leadership and Open Government Act of 2007 are notable for their attempts to inform the public who was lobbying for what interest and for how much money. The Open Government Act of 2007 mandated a one year waiting period for federal public servants before they could make the move through the revolving door to lucrative for-profit opportunities. \\nPresident Barak Obama issued an Executive Order in 2009 known as the Ethics Commitments by Executive Branch Personnel. That decree sought to impose a two-year waiting period for executive branch appointees. \\nUS executive branch agencies can also write their own lobbying rules or modify those contained in legislative acts. Members of the US Congress can also play an active role above and beyond legislative actions. On December 18, 2008, then Senators John Kerry of Massachusetts and Richard Lugar of Indiana sent a memorandum of understanding (MOU) to the Clinton Foundation, and the soon to be confirmed US Secretary of State Hillary Clinton, limiting the Clinton Foundation’s interactions with foreign governments. \\nIn the MOU, the Clinton Foundation was instructed to spin off the Clinton Global Initiative placing strictures on Bill Clinton’s ability to accept contributions from foreign governments. It appears that the Clinton’s ignored the MOU with the recent revelations of Qatar’s $1 million gift which went unreported. \\nThanks to WikiLeaks, the DNC hack, Edward Snowden, Chelsea Manning and others, the internal workings of the US-Corporate State have been pried open to reveal a can of filthy worms entangled with each other in every which way. And not a damn thing will change no matter who runs the country. The American people, their constitution, Bill of Rights and ideals set forth in the Declaration of Independence are being tortured by opportunists. \\nBesides that, they were written by “white people” back in the 1700s and so they hold no weight with large segments of the American citizenry. That, of course, plays right into the hands of the ‘color of money’ tech and financial interests who seek to eliminate the US nation-state leaving only the military, intelligence and the dollar’s printing presses as backstops. \\nNo win situation \\nIn practice, all the well-intentioned federal legislation, tireless efforts of lobbyist watchdogs and anti-revolving door advocates had done little to inhibit much of the influence peddling undertaken by foreign agents and governments, US law firms, interest groups, trade associations, corporations and lobbying houses. \\nNor have their efforts slowed the speed of the revolving door though which officials who on one day are protecting and defending the Constitution of the United States emerge on the other side claiming fealty to a corporation’s shareholders. The rules, regulations and procedures governing the process are not worth the paper they are printed on. \\nThe United States Supreme Court ruled that influence peddling by individuals or non-profit organizations are protected by the free-speech First Amendment to the Constitution of the United States. In 2010 the court’s Citizens United v. Federal Election Commission extended that concept to for-profit associations, corporations and labor unions. \\nPredictably, organizations and wealthy individuals have flooded the federal government and the 2016 election cycle with money. \\nAccording to the public interest website Opensecrets.org—which tracks lobbying and revolving door activity—from 2008 to 2016 over $15 billion was spent by assorted organizations for US federal level influence peddling for all manner of issues ranging from defense and finance to sports and healthcare. The National Football League works hard at the local, state and federal levels for public funds to get their stadiums subsidized at the expense of taxpayers \\nIn 2016 alone, $1.6 billion was billed by lobbyists to their clients. In that same year 10,498 individuals and organizations registered as lobbyists. \\nBut even knowing how the system works, Americans see no alternative because they do not want to do the very difficult work of rebooting the system or holding their so-called leaders accountable. \\nA look at AT&T, Time Warner merger & influence \\nIn October, the world’s third largest telecommunications giant AT&T, a creature of the former Ma Bell System monopoly, offered cable and content provider Time Warner shareholders an $85 billion merger package. Both boards of directors gleefully approved the deal. Now that merger must receive the approval of the US Department of Justice and assorted state and federal regulatory bodies. If approved by regulators, the merger would create one the world’s largest media conglomerates with one side of the monster, AT&T, very tight with the US National Security Agency. \\nTo increase the likelihood of success, AT&T, for its part, has mobilized some 100 lobbyists in Washington, DC, and scores more across the nation to cajole public utility, state legislatures and governors into supporting the merger. The company is already on the march in the US Congress and at federal agencies like the Federal Communications Commission. Even the self-proclaimed titans in the US Congress who decry the influence of money in politics or swarms of lobbyists are on the dole. \\nIn 1999, Senator John McCain from the US state of Arizona and then chairman of the Senate Commerce, Science and Transportation Committee, that oversees the telecommunications industry, introduced a bill that cleared the hurdles for AT&T’s acquisition of MediaOne Group, making AT&T, at the time, the largest cable company in the United States, the Center for Public Integrity said in a report. “His efforts did not go unrewarded: Two weeks after he introduced his bill, AT&T employees and their spouses contributed $10,000 to his presidential campaign in addition to $3,000 they gave him three days after AT&T announced its merger plans.” \\nAT&T’s federal influencers include revolving door types like former Senators John Breaux of Louisiana and Trent Lott of Mississippi who now work for heavyweight Washington, DC, law-firm and influence house Squire, Patton and Boggs. AT&T will also apply pressure from its own board of directors, one of whom is former President Bill Clinton’s chief economic advisor Laura D’Andrea Tyson. Coincidently she once served as a board member for Ameritech Corporation, formerly part of the AT&T-Bell System and now owned by AT&T. And how about this? The board also includes the former chairman of the US Federal Communications Commission from 1997 to 200, William Kennard. \\nInches or sins? \\nAmerica is bankrupt and on the highway to hell. \\nThe outcome of the 2016 election will not halt that process unless the American people find a way out of the political, financial, cultural and military morass they and their leaders have created. There are two paths forward for Americans, it seems. \\nThe first is offered in dialogue from the movie Seven in which the serial killer John Doe (played by Kevin Spacey) innovatively murders seven people based on the Seven Deadly Sins. Sure, John’s methods are unsound but the ‘point’ he makes about the sickness and tolerance levels of society are spot on. \\nJohn Doe: “A woman . . . so ugly on the inside she couldn’t bear to go on living if she couldn’t be beautiful on the outside. A drug dealer, a drug dealing pederast, actually! And let’s not forget the disease-spreading whore! Only in a world this shitty could you even try to say these were innocent people and keep a straight face. But that’s the point. We see a deadly sin on every street corner, in every home, and we tolerate it. We tolerate it because it’s common, it’s trivial. We tolerate it morning, noon, and night. Well, not anymore. I’m setting the example. What I’ve done is going to be puzzled over and studied and followed . . . forever.” \\nThe second path and a better alternative to John Doe’s shock doctrine is from movie dialogue from Any Given Sunday in the famed inches speech by Coach D’Amato (played by Al Pacino). The football team has descended into the hell of cliques, internal clashes, off-field antics, and disagreements over play calling. No football team can be successful in such a situation. The team has to come together for some purpose. \\nAmericans face that challenge now. \\nCoach D’Amato : “Either we heal as a team or we’re ‘gonna’ crumble inch by inch, play by play until we’re finished. We’re in hell right now, gentlemen . . . we can stay here, get the shit kicked out of us, or we can fight our way back into the light. We can climb ‘outta’ hell . . . one inch at a time. You see life’s this game of inches, so is football. Because in either game—life or football—the margin for error is so small. I mean, one half a step too late or too early and you don’t quite make it. One half second too slow, too fast and you don’t quite catch it. I know if I’m ‘gonna’ have any life anymore it’s because I’m still willing to fight and die for that inch, because that’s what living is, the six inches in front of your face. The inches we need are everywhere around us. That’s a team, gentlemen, and either we heal, now, as a team, or we will die as individuals. That’s football guys, that’s all it is.” \\nJohn Stanton played US contact football from youth level through small college on the offensive line. He captained his youth and high school teams and contributed significantly to three conference championships in college. He coached the sport for 25 years. His most recent book is US Military’s Progressiveness Leaves Civil Society Behind . Email him at . Commentary . Bookmark the permalink .'"}, "time": 1742564602.1224518}