{"duration": 0.07640695571899414, "input_args": {"text": "'Richard Simmons, the reclusive fitness mogul whose sudden disappearance from public life spawned a hit podcast, might soon return to public life, thanks to a business deal. And in the latest odd twist in Mr. Simmons’s story, it may be a result of that podcast. Prominent Brand + Talent, a management company   by Mr. Simmons’s manager of three decades, announced on Wednesday that it had acquired exclusive rights to represent Mr. Simmons for merchandising, endorsements and licensing opportunities. The trade publication License first reported the deal. Michael Catalano, Mr. Simmons’s manager, said in an interview that Mr. Simmons might be willing to come out of his   exile to help promote products that result from the deal. If Mr. Simmons does appear in public, it would be the first time he has done so since February 2014, when he stopped showing up to teach his class at Slimmons, his gym in Beverly Hills, Calif. He abruptly became a recluse and has not been seen since, spurring concerns about his  . “All I can say, at least for now, is it is possible,” Mr. Catalano said of whether Mr. Simmons would get involved publicly. “But it is yet to be determined, I would say. ” Mr. Catalano added that Mr. Simmons was directly involved in pursuing the deal, and noted that   products would “be in keeping with Richard’s lifelong mission and messaging. ” “We’re talking about   products that will hopefully accomplish what Richard really set his life’s work to do, which is to help people take better care of themselves,” he said. “We’re not licensing tires and party hats. ” Dan Taberski, a former producer for “The Daily Show” and a friend of Mr. Simmons, set out to solve the mystery of what happened to the obstreperous crusader for exercise in a   podcast series, “Missing Richard Simmons. ” It quickly became the most downloaded podcast on iTunes but also attracted criticism, drawing complaints that it was violating Mr. Simmons’s privacy. Mr. Taberski never got to talk to Mr. Simmons but was able to interview Mr. Catalano, who said in the podcast’s last episode: “I can’t say Richard feels better as a result of the podcast. Perhaps you do. ” But the podcast did create new interest in Mr. Simmons, spurring this pursuit of new business deals. It put Mr. Simmons “front and center,” as Mr. Catalano said, which gave Mr. Taberski some solace. “Telling his story was a huge part of the podcast,” Mr. Taberski said in an interview. “He changed lives, and he’s a genius businessperson. If I had even the smallest part in reminding people of that, fantastic. ” Mr. Simmons’s representatives were critical of the podcast throughout its run, citing multiple welfare checks from the Los Angeles Police Department that showed Mr. Simmons to be in good health. “I’m very conflicted about the podcast,” Mr. Catalano said. “I was not happy with a lot of the mistruths that were represented there. It also didn’t really uncover or reveal anything new that hasn’t been reported previously. And I think in many ways that was difficult for Richard to have to live through again. ” But “Missing Richard Simmons” did have a silver lining for Mr. Catalano. “Certainly I would say, without a doubt, a younger demo is aware of Richard as a result,” Mr. Catalano said. “At the end of the day, if it helps deliver his message to people who were unaware of it previously, fantastic. That’s what Richard’s mission has always been. ” Mr. Simmons, through Mr. Catalano, declined a request for an interview.'"}, "time": 1742561976.4244218}