{"duration": 0.10405373573303223, "input_args": {"text": "'\\nThere’s no other way to put it.\\nThe system as we know it will collapse. This, argues Karl Denninger of the Market Ticker , is a mathematical certainty.\\nIn a recent interview with Future Money Trends Denninger touches on the various dire challenges facing America. From the Presidential election to the rampant corruption in our financial, political and healthcare systems, he pulls no punches and warns that the worst is yet to come unless real action is taken immediately. Failure to do so, says Denninger, will lead to a collapse of everything we consider to be a part of our current way of life.\\nIf we do not start locking people up our government, our way of life and every asset class… the price of all of them… is going to collapse. This is not a maybe. This is arithmetic. It’s not politics. The problem here is that nobody in the political sphere from either party is talking about this. This is where the problem lies.\\n…At the same time, this is what is bankrupting all of the public sector pensions… If you’re a policeman, a firefighter, a teacher in any of the states you’re not going to get your money . At best you’ll get half. I’ve run the numbers… the best systems in the country right now will be able to pay half of those benefits… many of them are worse than that. You’re going to also see the collapse of all the state budgets for the same reason because they’ve got those embedded liabilities. Law or no law, I don’t care what your state Constitution says you have. If you can’t collect the money you’re not going to get the check. \\n\\n( Watch at Youtube )\\nWhat’s worse is the fact that not only can we not stop what’s coming, Denninger says that there is really no way to prepare for it from a wealth preservation aspect because anything that doesn’t get wiped out in a crash will probably be stolen by the government. Thus, when we think preparedness, we’d better be thinking in terms of survival essentials:\\nYou can’t [protect your wealth]. You need to be looking at your wealth in terms of how many chickens are you going to be able to buy or how many gallons of gasoline… or how many kilowatt hours of electricity because the number of dollars you have or how many ounces of gold is utterly immaterial… The only thing that matters is what they buy. \\n… The problem is and the aspect that people take on this …. and I get these questions all the time whenever I post an article showing the math… The first thing that comes up in the comments is ‘ what do I do as an investor to protect myself from this? ‘…. The answer is there isn’t a way to do it… remember, the government will steal everything that’s not nailed down and not protected with your life… so, unless you’re willing to die, at which point you don’t care how much money you have because you’re dead, there is no personal protection method that works.\\nIf the picture Denninger paints of the future of America is accurate – and we can’t really argue with the mathematical evidence he has put forth at The Market Ticker over the last decade – then when this system does collapse it is going to lead to widespread chaos as every asset class out there is going to be worth significantly less than it is today.\\nIn such a scenario we need to consider what will have value and what will take the form of money when dollars are no longer a feasible mechanism for exchange.\\nAs Denninger points out, the only thing of importance will be how much the”assets” in your posession will be able to buy.\\nDollars may be worthless in this instance. Gold and silver may have fallen or risen in price, but their purchasing power is what will matter, and as Denninger notes, they may be illegal to own so trade would have to take place on black markets. Food, medicine, toilet paper, soap, and other essentials will sky rocket in value, as has been evidenced by the hyperinflationary collapse currently taking place in Venezuela.\\nSo when we look at protecting ourselves from the coming crash of our entire way of life, it’s the essential goods and services that people can’t live without that will become the assets of choice.\\nThe math is clear. It is coming. Prepare for it now.\\nKarl Denninger posts regular commentary and news at hsi web site The Market Ticker . He is the author of Leverage: How Cheap Money Will Destroy the World \\nWatch more interviews like this one at Future Money Trends . \\nRelated Reading: \\nThe Prepper’s Blueprint: A Step-By-Step Guide To Prepare For Any Disaster \\nWhat is Money When the System Collapses? \\nMark Levin: Government Is “Simulating the Collapse of Our Financial System, the Collapse of Our Society and the Potential for Widespread Violence” \\nVenezuelans Facing Severe Food Shortages and Malnutrition Turn to Urban Farming \\n'"}, "time": 1742561731.0792596}