{"duration": 0.06181526184082031, "input_args": {"text": "'With an Academy Award nomination for Best Original Song on Tuesday,   Miranda moved one step closer to a rare artistic sweep: the EGOT. Only 12 other performers have held the title, which they earned by winning an Emmy, a Grammy, an Oscar and a Tony. (According to Vanity Fair, the acronym was coined in the 1980s by the “Miami Vice” actor Philip Michael Thomas, who has won none of the awards. It was repopularized by Tracy Morgan’s character on the sitcom “30 Rock. ”) Mr. Miranda’s Oscar nomination, his first, is for the song “How Far I’ll Go” from “Moana. ” It will compete against two songs from “La La Land,” one from “Trolls” and one from “Jim: The James Foley Story. ” If he wins, Mr. Miranda would join such performers as Helen Hayes, Audrey Hepburn, Whoopi Goldberg, Mel Brooks and Mike Nichols. The Tony Awards have been a stumbling block for many entertainers: Kate Winslet, Martin Scorsese, Randy Newman and, somehow, Julie Andrews, lack only Broadway’s highest honor. At 37, Mr. Miranda would be the youngest person to have won all four awards. His song, “How Far I’ll Go,” is a tribute to ambition and adventure, celebrating themes similar to one of Justin Hurwitz’s nominated songs, “Audition (The Fools Who Dream),” from “La La Land. ” “How Far I’ll Go” has been adapted into 44 languages, including a version sung by the Canadian pop star, Alessia Cara, on the film’s soundtrack. In a statement on Tuesday, Mr. Miranda thanked the academy and his collaborators on the film and congratulated all the nominees. “Future congratulations to the kids watching the telecast this year, singing along with their favorite songs, performing epic private concerts for the mirror with a comb or a toothbrush microphone,” he said. “You’re next. ” Last fall, when Mr. Miranda was asked about the possibility of winning all four awards, he pointed out that there were brilliant artists who had not won a single award. “There are great works of art that won nothing. And Vincent Van Gogh died penniless,” he said. “Awards are not a maker of excellence. ” “But they’re really cool,” the interviewer, from the awards news site Gold Derby, said. “They’re cool,” Mr. Miranda said. Mr. Miranda has two Grammys, one for the cast recording to his 2008 Broadway musical “In the Heights” and another for his smash hit “Hamilton. ” He has personally won three Tony awards (and his musicals have collected many more). He won an Emmy for his work on the music and lyrics at the 2013 Tony award show. It is, of course, an honor to collect all four awards  —   or even one of them. But the ambition to do so was mocked memorably on the “30 Rock” episode “Dealbreakers Talk Show #001,” in which Tracy Jordan, the character played by Tracy Morgan, decides that it is his dearest ambition to win all four awards, transforming the acronym into a verb: to EGOT. “That’s a good goal for a talented crazy person,” Mr. Morgan says. If he wins, Mr. Miranda will join an even more rarefied group: EGOT performers who also have Pulitzer Prizes. The composers Richard Rodgers and Marvin Hamlisch have won all five. Mr. Miranda, uniquely, has also received a MacArthur Fellowship.'"}, "time": 1742562086.4012856}