{"duration": 0.07812380790710449, "input_args": {"text": "'November 8, 2016, is election day. On Tuesday, Americans will vote for who will represent them to the world. That would be the position of the most powerful person in the world; President of the United States (POTUS). It is up to every citizen, young and old, to remind people to get out and vote. Support the freedom afforded Americans.\\nAlso, there are state elections for senators and representative seats. In fact, there are 270 congressional positions available. Most states have significant measures on the ballots for voters to decide. Some measures include; Marijuana legalization, whether or not to raise taxes, fund bonds to fix the school system, build a stadium.\\nVote for POTUS As far as voting for the POTUS goes, the country has found itself more divided than ever before. There are four candidates,\\nHillary Clinton , the first female candidate from a major party, Democrat, former first lady, and former secretary of state; Gary Johnson , governor of New Mexico, Libertarian Party; Jill Stein, Green Party, a presidential candidate in 2012; Donald Trump , real estate mogul, reality star, and entrepreneur, Republican. Stein and Johnson are unlikely for two reasons;\\nNeither are members of the two primary parties. Neither have numbers in the polls that are in the double digits. Clinton has many good qualities that indicate she would be a strong leader. As the first lady, she understands the pressures of the presidency from watching her husband deal with the job. As the secretary of state, Clinton learned first hand the ins and outs of dealing with foreign affairs and American citizens. In this post, she worked closely with the president. When she was a senator, the Democratic candidate learned how difficult it could be to compromise across the aisle.\\nTrump has qualities that may help him should he win. His business acumen and his personality indicate he will be a force to with which to be reckoned. He knows the art of the deal making. The Republican candidate has no political experience short of lobbying for his causes, which could serve him well by understanding how the lobbyists think.\\nLesser of Two Evils? Both Clinton and Trump have red marks on their reputations, and they have attacked one another relentlessly since each won their primaries. Whereas, the former’s are over a decade old the latter’s are current.\\nHow does one decide which to choose? What happens if neither wins the majority of the vote? Would it be as simple as whoever garners the highest number?\\nStein and Johnson each proclaim they are the better choice for voters over choosing the better of two evils. Their positions are unique and intriguing. The Libertarian ticket may be strong as both the presidential and vice presidential candidates are former governors.\\nEarly Voting Numbers As of November 4, there have been at least 37 million ballots cast, according to Business Insider. There are approximately 219 million eligible voters in the U.S. in 2016. Polls indicate a drop in the number who are stated they are definitely casting their ballots; in 2012 the number was 76 percent, and in 2016 it was 69. That leaves 41 percent of registered voters who need to have people, adults, teenagers, and children alike, to push them to get to the polling sites and cast their ballots.\\nQuestions about what is on the ballot for individual states can be found on Ballotpedia. A person can choose the see what is on the federal, state, local ballots. Another option would be to go the website for the state’s registrar’s office. It is important to exercise the freedom to vote.\\nBy Cathy Milne\\nSources:\\nWebsites: Presidential Candidates; Hillary Clinton, Gary Johnson, Jill Stein, and Donald Trump\\nBusiness Insider: 37 million people have already voted — here’s what the data say\\nStatistic Brain: Voting Turnout Statistics\\nFeatured Image Courtesy of George Makris’ Flickr Page – Creative Commons License\\nTop Inset Image Courtesy of League of Women’s Voters’ Flickr Page – Creative Commons License\\nSecond Inset Image Courtesy of Marcia Cirillo’s Flickr Page – Creative Commons License\\nThird Inset Image Robert Palmer’s Flickr Page – Creative Commons License\\nFourth Inset Image Courtesy of Irish Labour Party’s Flickr Page – Creative Commons License\\nFifth Inset Image Courtesy of Julie Faith’s Flickr Page – Creative Commons License #CMJournalist , Donald Trump , Get Out the Vote , Hillary Clinton , spot , vote'"}, "time": 1742562285.7447195}