{"duration": 0.09365177154541016, "input_args": {"text": "'The general election effort to take down Donald J. Trump through television ads will begin on Wednesday, with the main “super PAC” supporting Hillary Clinton airing its first two attack ads on broadcast television in four swing states. The effort kicks off a   campaign that will flood screens in those states in the months to come. The super PAC, Priorities USA Action, had initially planned to wait until after the June 7 primary contests to introduce TV ads attacking Mr. Trump, the presumptive Republican nominee, but accelerated its effort against him. The group’s $6 million investment includes two ads that offer scathing critiques of Mr. Trump’s comments about women that will run for the next three weeks in Ohio, Florida, Virginia and Nevada. Mrs. Clinton’s most devoted donors have given roughly $80 million to Priorities USA Action to stop Mr. Trump, more than the group raised in the entire 2012 election to   President Obama. The ads are the beginning of the broader Democratic campaign against Mr. Trump, focused on convincing suburban and   women that he does not respect them. Priorities USA Action said it also planned to run ads that critiqued Mr. Trump’s business record and portrayed him as out of touch with the   Americans he says he represents, an approach similar to the one it used to depict the Republican nominee in 2012, Mitt Romney, as a cold corporate titan. Mrs. Clinton’s allies said Mr. Trump’s mocking of a New York Times reporter’s disability also effectively turned off swing voters, potentially providing fodder for future ads that depict Mr. Trump as insensitive and unprepared for the presidency. Mr. Trump’s Republican rivals criticized Mr. Trump similarly on his comments about women and on his business record during the party’s nominating contest, but the effort came too late to stop his momentum. One of the super PAC’s ads, called “Speak,” shows voters   some of Mr. Trump’s caustic remarks about women as they wear shirts with Mr. Trump’s visage   on them. The other, “Respect,” shows quick interviews with the candidate in which he outlines his positions on abortion and Planned Parenthood. The super PAC had initially invested $130 million to reserve time for broadcast and digital ads that would start running the day after the California and New Jersey primaries in June. But it decided to add an additional buy to accelerate the time line, aiming to sow early doubts about Mr. Trump, particularly among female voters who will have a disproportionate effect on the fall election and with whom Mr. Trump has shown a particular weakness in polls. Female voters favored Mrs. Clinton over Mr. Trump, 55 percent to 35 percent, in a New York   News poll released in March, twice the gender gap of the 2012 presidential election, when President Obama defeated Mr. Romney. Mrs. Clinton’s campaign, which cannot directly coordinate with the super PAC, has tried to raise money by showing Mr. Trump’s comments assailing the former secretary of state for playing the “woman’s card. ” Mrs. Clinton, though, has tried to avoid directly provoking Mr. Trump, relying instead on outside groups like the super PAC to carry out direct attacks. The campaign’s online videos against Mr. Trump have focused mostly on his policy positions and on criticism by his rivals in the Republican primaries. On Tuesday, Mr. Trump said the “Speak” ad had misrepresented one of his statements. “The pathetic new hit ad against me misrepresents the final line. ‘You can tell them to go BLANK themselves’  —   was about China, NOT WOMEN!” he wrote on Twitter. That drew a rebuke from the super PAC. “Sorry Donald, but the ad isn’t only about your overt sexism, it’s about your divisiveness and character being unsuitable for the office of the presidency,” Justin Barasky, a spokesman for the group, said in an email on Tuesday morning. In an interview, Mr. Barasky said the group thought it had to advertise earlier after seeing the Republican “stop Trump” effort fall short. “The decision was made recently to go up now because we learned from Washington Republicans that you can’t wait to go after Trump,” Mr. Barasky said. “What they did was too little, too late, and we weren’t going to make the same mistake. ” The new ads adhere to similar lines of attack taken by Our Principles PAC, the super PAC led by Republican operatives. It released an ad, “Quotes,” featuring female actors reciting Mr. Trump’s quotations about women. The ad tested highly in effectiveness, but came out only days before the Republican primary in Florida, which Mr. Trump won. “Speak” is slightly different in that the ad uses Mr. Trump’s voice rather than those of actors, along with the voices of voters. “Our research shows most people know very little about Donald Trump,” Guy Cecil, the executive director of the Priorities PAC, said on MSNBC on Monday night, adding, “When we tested a lot of the ‘Never Trump’ ads, we realized very quickly they really had no idea what Donald Trump had been saying on the stump and what his record had been in business or toward women, and so it’s our job to make sure they see it. ” He added that the group would also be focused on Mr. Trump’s business record, an issue that numerous Republican groups and campaigns highlighted during the nominating contest. Mr. Cecil specifically mentioned Mr. Trump’s record of “making ties in China and hiring people in Bangladesh. ”'"}, "time": 1742562908.2276697}