{"duration": 0.09063100814819336, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Floodwaters saturated southern Louisiana, forcing more desperate rescues and evacuations. The death toll rose to 11, and tens of thousands of people have been displaced. Some areas have received as much as 31 inches of rain (yes, 31) in the last week  —   a     phenomenon that some experts say foretells the disasters of climate change. _____ 2. At the Olympics, the spectacular American gymnast Simone Biles scooped up her fourth gold medal, soaring past the competition in the floor exercise. More of today’s highlights are here. Fans of the U. S. runner Allyson Felix raged over a dive across the finish line by the Bahamian Shaunae Miller to win the women’s 400 meters. And an Irish boxer, Michael Conlon, raged against judges after they ruled he lost to a Russian, Vladimir Nikitin, in a bout many observers believed he had won. Our full coverage of the Games is here, including the   battle for the 2024 Olympics and a meditation on the sometimes mystifying theatrics in synchronized swimming. _____ 3. Donald Trump spoke at a rally in a suburb of Milwaukee, steering clear of the area where unrest flared after a fatal police shooting. He accused Hillary Clinton of pushing an   “narrative” and said, “Law and order must be restored. ” His campaign focus has shifted to the theme of fighting terrorism, with a special focus on protecting women. He’s also portraying Hillary Clinton as weak and tired. _____ 4. Four sources told our political reporters that Roger Ailes, the Fox News chairman ousted last month over accusations of sexual harassment, is advising Donald Trump as he prepares for the coming presidential debates. A Trump spokeswoman issued a denial, saying the two are friends and “speak occasionally, which isn’t news. ” _____ 5. Hillary Clinton traveled to Philadelphia for a   drive, bolstered by new polls showing her lead strengthening in Florida. Her campaign is spending heavily to influence early voting, which is allowed in 35 states and the District of Columbia. The first, Minnesota, begins on Sept. 23. Almost   of voters cast early ballots in 2012. The F. B. I. under pressure from House Republicans, gave Congress classified documents related to its investigation of Mrs. Clinton’s private email server. _____ 6. Russia launched air attacks in Syria from an air base in Iran, becoming the first foreign military to operate from Iranian territory since at least World War II. The move could alter the political and military equation in the Middle East. The Russian military said its bombers destroyed ammunition dumps and other targets linked to the Islamic State and other groups. _____ 7. Turns out older people are pretty good life hackers. A professor of industrial design has been collecting examples: using the moldable putty Sugru to buffer furniture edges that can bruise or tear elderly skin, and snapping rubber bands around cups to increase grip. A    woman who put a lazy susan in her refrigerator to ease access said, “Designers think they can put themselves in the shoes of the aging, but you don’t really know until you’ve lived with the realities. ” _____ 8. Gawker will be getting a new owner. Univision’s bid of $135 million secured the muckraking gossip site at auction, according to two people with direct knowledge of the deal. Gawker declared bankruptcy after being hit with a $140 million judgment for publishing a sex tape involving the former professional wrestler Hulk Hogan. Above, Nick Denton, who founded Gawker in 2002. _____ 9. Google released Duo, a   app that can place video calls between Android and iPhone users. In a jab at Apple, whose FaceTime operates only with iOS, Google’s statement said users shouldn’t have to worry “if your friend is using the same type of device as you are. ” _____ 10. Wen Hair Care, created by a Los Angeles stylist to the stars, has drawn more than 21, 000 complaints, including hair loss in women and children. Its distributor is part of a trade association bitterly fighting proposed legislation that would empower the Food and Drug Administration to test and recall cosmetics. But the proposal has the backing of the bigger players in the beauty industry, who want to regain public trust. _____ 11. Finally, this Native American chef, Sean Sherman, is unearthing and revitalizing indigenous cooking traditions that have been lost or forgotten. An Oglala Lakota, he favors chokecherries, corn silk and even chaga, the fungus that blooms on birch trees, joking about his “  . ” He plans to open a restaurant in Minneapolis next year. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561631.8024848}