{"duration": 0.07982850074768066, "input_args": {"text": "'LONDON  —   As the shock of the brutal murder  of a young member of Parliament began to subside on Friday, there was a growing sense in Britain that something ominous had been unleashed in the country. The increasingly ugly   tone to the campaign over  next week’s referendum on Britain’s membership in the European Union, coupled with the violence of English fans at the European soccer championships and now the killing of a lawmaker on the streets of a small town, has left many here feeling that the boundaries of acceptable behavior are breaking down. “What we are just seeing generally is a very disturbing shift in British politics,” said Simon Tilford, the deputy director of the Center for European Reform, which favors British membership. “It is quite upsetting to me what is happening. ” With next Thursday’s vote on the referendum only days away, campaigning was suspended as a gesture of mourning and respect for the victim, Jo Cox, 41, a rising star in the opposition Labour Party who, not coincidentally, was a strong backer of Britain’s remaining inside the bloc. While it is still too early to say how the attack will change the dynamics of the campaign, it has unquestionably shifted the focus from the growing momentum of those in favor of leaving to the   tactics they have employed as the vote has drawn closer. The suspect arrested in the killing, Thomas Mair, 52, has a history of mental illness. But he was also reported to have been in contact with   groups in the United States and Britain, and to have said, “Britain first!” several times as he attacked Ms. Cox. Britain First, a   nationalist group, denied any links with Mr. Mair, but a United States civil rights group said he had been associated with an American   organization called the National Alliance. In a widely distributed piece written for the magazine The Spectator, which favors leaving the European Union, Alex Massie drew a connection between the “Leave” campaign, which has featured outlandish assertions, xenophobia and Islamophobia, to the death of Ms. Cox. “Sometimes rhetoric has consequences,” Mr. Massie wrote. “If you spend days, weeks, months, years telling people they are under threat, that their country has been stolen from them, that they have been betrayed and sold down the river, that their birthright has been pilfered, that their problem is they’re too slow to realize any of this is happening, that their problem is they’re not sufficiently mad as hell, then at some point, in some place, something or someone is going to snap. And then something terrible is going to happen. ” Mr. Massie cited a poster that had been issued earlier on Thursday by one of the campaigns for British exit led by Nigel Farage, the leader of the U. K. Independence Party, which has been strongly   and   from its inception and won 13 percent of the vote in the national election in May 2015. In the last stages, opponents say, the Leave campaign has essentially become a UKIP campaign on the putative dangers of immigration  —   given that membership in the bloc means freedom of travel and work for all its citizens  —   softened around the edges by Conservatives who say that as a great nation, Britain will be truly sovereign only away from Brussels. The poster showed a long line of Middle Eastern refugees waiting to cross a European border. The text said: “BREAKING POINT. The E. U. has failed us all. We must break free from the E. U. and take control of our borders. ” Never mind that the border in question was that between Croatia and Slovenia, and that Britain as an island nation is largely insulated from the immigration crisis that roiled the Continent last year. The message, Mr. Massie said, was not subtle: “Vote Leave, Britain, or be overrun by brown people. Take control. Take back our country. You know what I mean, don’t you: If you want a Turk  —   or a Syrian  —   for a neighbor, vote Remain. ” The official and unofficial Leave campaigns have suggested that Turkey and its 77 million Muslims are soon to join the European Union, which is untrue, and that despite Britain’s restrictions on free travel for European citizens, membership in the European Union has made Britain more vulnerable to waves of refugees and terrorism. While the claims may be unsubstantiated, pollsters suggest that the focus on Turkey and on regaining “control” over immigration was behind the movement toward a British exit, or Brexit, which is now narrowly leading most polls. “When you shout BREAKING POINT over and over again, you don’t get to be surprised when someone breaks,” Mr. Massie wrote. “When you present politics as a matter of life and death, as a question of national survival, don’t be surprised if someone takes you at your word. You didn’t make them do it, no, but you didn’t do much to stop it either. ” Some observers, like Mr. Tilford, say there is blame to be spread across the political spectrum. While the tenor of the Leave campaign “is pretty xenophobic,” he said, both of the major mainstream parties, Labour and the Conservatives, now regularly discuss the potential menace of foreigners. “That has made it socially acceptable to voice   or xenophobic sentiment in a way that it wasn’t 10 years ago,” he said. The more practical question is whether the murder of Ms. Cox will alter the trajectory of the campaign. Some analysts, like Mujtaba Rahman of the Eurasia Group, said it “will hurt the momentum of the ‘Leave’ campaign, which has been gaining steadily in recent polls. ” But others drew the opposite conclusion. “Until it’s clear who was responsible and what their motivation was or might have been,” said John Curtice, a political scientist from Strathclyde University, “all it does is stop the campaign when the Remain side probably would not want it to be stopped. ” Polly Toynbee, a columnist for the   Guardian newspaper, said that the murder of a public official could not be seen as an isolated episode. “It occurs against a backdrop of an ugly public mood in which we have been told to despise the political class, to distrust those who serve, to dehumanize those with whom we do not readily identify,” Ms. Toynbee wrote.  Of course, many who are campaigning to leave are honorable democrats, she said. “But there are others whose recklessness has been open and shocking. I believe they bear responsibility, not for the attack itself, but for the current mood: for the inflammatory language, for the   the dog whistling and the overt racism. ” Ms. Cox herself wrote a column in The Yorkshire Post, published just a few days before her death, in which she sympathetically discussed people’s concerns about immigration. “This doesn’t mean to say they are racist or xenophobic,” she said, but concerned about pressures on health and social services and competition for jobs. She added, “Most people recognize that there are positive sides of migration too. ” But the benefits of European Union membership are “huge” and far outweigh the costs, Ms. Cox wrote, explaining that “I strongly believe that concerns about immigration  —   as legitimate as they are  —   are not a reason to vote for Brexit,” in large part because leaving itself would not solve the problem. “Please don’t fall for the spin prior to June 23 that the only way to deal with concerns about immigration is by voting to leave  —   that simply is not the case,” she concluded. Her husband, Brendan Cox, issued a statement after her death, saying that his wife “would have wanted two things above all else to happen now  —   one, that our precious children are bathed in love and two, that we all unite to fight against the hatred that killed her. ”'"}, "time": 1742628502.8078413}