{"duration": 0.02307891845703125, "input_args": {"text": "'Rep. Thomas Massie ( ) is introducing legislation that would abolish the federal education department. [The bill, H. R. 899, is only one sentence and states: “The Department of Education Shall Terminate on December 31, 2018. ”  #HR899, my bill to abolish @usedgov, is pretty straightforward. #EndFedEd pic. twitter.   —   Thomas Massie (@RepThomasMassie) February 7, 2017,  Massie introduces the measure as Betsy DeVos is confirmed as the next secretary of the U. S. Education Department. Grassroots parent activists had urged that the federal department be dismantled. “Neither Congress nor the President, through his appointees, has the constitutional authority to dictate how and what our children must learn,” Massie said in a press release announcing the bill. Neither Congress nor the Pres, thru his appointees, has the const. auth. to dictate   our children must learn https:  .   —   Thomas Massie (@RepThomasMassie) February 7, 2017,  The congressman added: Unelected bureaucrats in Washington, D. C. should not be in charge of our children’s intellectual and moral development. States and local communities are best positioned to shape curricula that meet the needs of their students. Schools should be accountable. Parents have the right to choose the most appropriate educational opportunity for their children, including home school, public school, or private school. “For years, I have advocated returning education policy to where it belongs  —   the state and local level,” said Rep. Walter Jones ( ) an original   of the legislation. “D. C. bureaucrats cannot begin to understand the needs of schools and its students on an individual basis. It is time that we get the feds out of the classroom, and terminate the Department of Education. ” Massie’s office lists other original   of the bill, including Rep. Justin Amash ( ) Rep. Andy Biggs ( ) Rep. Jason Chaffetz ( ) Rep. Matt Gaetz ( ) Rep. Jody Hice ( ) and Rep. Raul Labrador ( ).'"}, "time": 1742562250.3621707}