{"duration": 0.019431352615356445, "input_args": {"text": "'Tuesday 1 November 2016 by Formelia Alberthine West Ham fans laud aerodynamic properties of new pound coin \\nWest Ham fans have thanked the Royal Mint for its efforts in improving the match-day experience at the London Stadium with the release of a new more aerodynamic pound coin. \\nMany season ticket holders claim its enhanced aerodynamic design, could see its distance and accuracy improve significantly. \\nA Royal Mint spokesperson explained, “There is a reason golf balls aren’t completely flat, these imperfections on the surface actually reward the more skilful throwers. You’re welcome.” \\nAfter a spate of crowd disturbances at the ground, Hammers fans had complained of a return to the dark days of the early eighties, where only ‘unpredictable’ circular coins could be deployed as missiles at games. \\nWest Ham fan Simon Williams congratulated the Royal Mint on the technological advances which have seen multiple ‘stabilising’ edges introduced. \\nHe told us, “I’m reasonably confident that with this new coin I could pick out the skull of an opposition player, or supporter for that matter, from way up in the gods. \\n“They’re quite weighty – I had become accustomed to launching 20p’s, but they only leave flesh wounds – these babies could do serious brain damage. \\n“Obviously it’s difficult to inflict brain damage upon Millwall fans, but it will be fun trying! \\nWest Ham vice-chair Karen Brady hoped the temptation to start launching whole pounds could see match day takings increase significantly. \\n“Listen, if they want to start targeting the directors’ seats then please, by all means, do so. \\n“In fact, I’d like to see all denominations of our fabled currency ‘go coin’. \\n“If someone could chuck us a £50 we’d happily throw Andy Carroll back at them in retaliation.” Get the best NewsThump stories in your mailbox every Friday, for FREE! There are currently '"}, "time": 1742563671.8238428}