{"duration": 0.07947969436645508, "input_args": {"text": "'  Recipient Email => \\nWord has reached me from Washington that the FBI has reopened the Hillary case of her violation of US National Security protocols, not because of the content of the new email releases, but because voter support for Trump seems to be overwhelming, while Hillary has cancelled appearances due to inability to muster a crowd. The popular vote leaves the FBI far out on the limb for its corrupt clearance of Hillary. The agency now has to redeem itself. \\nI myself do not know what precisely to think. Having been at the top of the Washington hierarchy for a quarter century, I have seen many mistaken judgments. At one time I had subpoena power over the CIA and was able to inform President Reagan that the CIA had misled him. He took note and proceeded with his policy of ending the Cold War with the Soviets. On other issues I have been mistaken, because I assumed that there was more integrity in government than actually exists. \\nHowever, FBI director Comey did not need to reopen the case against Hillary simply because some new incriminating emails appeared. Having dismissed the other incriminating evidence, these emails could have passed unremarked. \\nThe problem for the FBI, which once was a trusted American institution, but no longer is, is that there is no longer any doubt that Donald Trump will win the popular vote for president of the United States. His appearances are so heavily attended that thousands are turned away by local fire/occupancy regulations. In contrast, Hillary has curtailed her appearances, because she doesn’t draw more than 30 or 40 people. \\nAmericans are sick to death of the corrupt Clintons and the corrupt American media. The Clintons are so completely bought-and-paid-for by the Oligarchy that they were able to outspend Hollywood on their daughter’s wedding, dropping $3,000,000 on the event. \\nNevertheless, I don’t underestimate the power of the Oligarchy. As Assistant Secretary of the US Treasury I experienced the Oligarchy’s power. If I had not been backed by the President of the United States, I would have been destroyed. \\nIndeed, the Oligarchy is still trying to destroy me. \\nPossibly Trump, as his enemies allerge, is just another fake, like Obama who misled the electorate. However, Trump attacks the Oligarchy so strongly that it is hard to believe that Trump isn’t real. Trump is asking for a bullet like John F. Kennedy, like Robert Kennedy, like Martin Luther King, like George Wallace. \\nIn Amerika, dissidents are exterminated. \\nTrump is up against voting machines over which he has no control. If there are no INDEPENDENT exit polls, Trump can easily be robbed of the election, as the Texas early voting scandal indicates, with the electronic machines assigning Trump votes to Hillary. The “glitch” doesn’t assign any Hillary votes to Trump. \\nMy expectation is that, unless Trump’s popular vote is so overwhelming, the electoral collage vote will be stolen. Because of the absence of any valid reporting by the presstitutes, I don’t know what impact the orchestrated election of Hillary would have on the electorate. Possibly, Americans will break out of The Matrix and take to the streets. \\nI beleve that Hillary in the Oval Office would convince the Russians and the Chinese that their national survival requires a pre-emptive nuclear attack on the crazed, insane government of the United States, the complete narcisstic state that in the words of Hillary and Obama is “the exceptional, indispensible country,” empowered by History to impose its will on the world. This crazed American agenda is not something that Russia and China will accept. \\nHere is Donald Trump speaking to Americans in words Americans have been waiting to hear: \\nhttps://www.youtube.com/watch?v=D8prvxjW2wM \\nNotice that Trump doesn’t need teleprompters. \\nI do not agree with Trump on many issues, but the American people do. For me and for the world, the importance of Trump is the prospect of peace with Russia. Nuclear war makes every other problem irrelevant. \\nIf Hillary is installed by the Oligarchy—this is a word used by former Democratic President Jimmy Carter who said that the US is no longer a functioning democracy but is ruled by an Oligarchy—war with Russia and China will be upon us. \\nAfter 15 years the Taliban and ISIS still run wild in the Middle East despite the efforts of the American “superpower.” Unable to defeat a few lightly armied Taiban after 15 years, what prospects does the enfeebled US have of winning a conflict with Russia and China? \\nNone whatsoever. \\nThe United States has had an entire generation of people born into a war for which the purpose is inexplicable. Why these wars? Why this endless slaughter of women and children and endless columns of refugees overwhelming all of Europe desperately striving to escape Washington’s wars of world hegemony. Why do not the total dumbshits in Washington hear when the President of Russia says that “Russia can no longer tolerate the state of affairs that Washington has created in the world.” \\nThe unjustified arrogance of Washington, a washed up Third World State, is likely to destroy life on earth. No greater danger to life exists than Washington. We have to hope that Trump can clean out the Augean Stables. (Reprinted from PaulCraigRoberts.org  '"}, "time": 1742561973.6701725}