{"duration": 0.06306600570678711, "input_args": {"text": "'BIG PINE KEY, Fla.  —   The first signs seemed baffling: deer stumbling around in confusion, howling in pain, found with their heads hideously disfigured  —   as if eaten alive. What biologists discovered turned out to be even more frightening: the reappearance of a parasite known as the New World screwworm fly that had not been seen in the United States since the 1970s and had been considered eradicated. State and federal officials are hopeful that the infestation, which so far is restricted to Florida’s southernmost Monroe County, is being controlled. Symptoms were first reported in wild deer in July, and laboratory tests in late September confirmed the presence of the screwworm, which is the larva of the screwworm fly. The infestation has the potential to cause catastrophic damage to livestock and is being seen by some experts as a reminder of the challenges of controlling the spread of diseases and infestations in a world of limitless global travel and trade. “In the very big picture, this is just the latest example of our failure to adequately protect people, agriculture and the environment from consequences of a shrinking world, an interconnected world,” said Adam Putnam, Florida’s commissioner of agriculture. “Millions of cargo containers and millions of passengers arrive every year, entering and exiting Florida and bringing unwelcome pests and disease with them. ” In July, Florida Key deer, the smallest subspecies of the   deer, started turning up with grotesque wounds. The tiny deer are the last of their kind  —   only about 875 remain  —   and live in the wild at a federal refuge in the Florida Keys that was established to protect them in 1957. Eight deer died in July and August, and 11 more died during the September mating season. Refuge managers at first thought the injuries were abscesses caused by males puncturing one another with their antlers during the rut, when they fight for dominance. Employees at the refuge, many of whom were not even born the last time the screwworm was found in the United States, had never seen anything like it. In all, about 15 percent of the existing endangered Key deer herd  —   132 animals  —   have died since July. Infections were also found in two stray cats, a dog and a pet pig. Officials worry that if the screwworm spreads to ranches and farms, it could cause up to $1 billion in livestock losses. “We had no idea what this thing was,” said Kristie Killam, a ranger at the National Key Deer Refuge, the   center run by the United States Fish and Wildlife Service. “There was a few here and there in July and August, but it was September, when the rut started, that we started scratching our heads and saying, ‘This is a little bit out of the ordinary,’” she said, adding, “It looks like a horribly infected wound, an infected wound that never got treated, infected with mushy maggots. ” Lab test results in late September confirmed the presence of the screwworm. Native to South America, it first appeared in the United States in the 1800s. Screwworms are larvae laid by flies in the open wounds of an animal, where the larvae feed on flesh. The fly is a little bigger than a common housefly, with orange eyes and a metallic dark blue or gray body with three dark stripes down its back. An animal quarantine was imposed by officials in Florida in early October, and an agricultural emergency was declared to avoid the spread of the parasite. An infestation in the southeastern United States from the 1930s to the 1950s caused $20 million a year in livestock losses and took 20 years to eradicate, according to the United States Department of Agriculture. Since that infestation, the federal government has spent millions of dollars in the last century to keep the screwworm out of Mexico and Central America, lauding it as “one of the greatest success stories in the history of agriculture in the Americas”  —   only to see it reappear in South Florida. Some critics said the authorities should have reacted faster to the threat. They said the delay could cause the infestation to spread, imperiling the one million head of cattle in Florida. “If private veterinarians or government agencies were aware there was something going on in the pet and deer population and didn’t report it, that’s the example of the breakdown I’ve just been venting about,” Mr. Putnam, the state agriculture commissioner, said. Officials involved with the eradication program disagreed. “This had not been around since the ’50s and ’60s,” said Dan Clark, the manager of the refuge. “My staff wouldn’t have worked professionally with anything like that. Even a lot of veterinarians just had never seen it,” he said, adding, “Any reasonable person would have done what we did. ” To eradicate the screwworm, seven million fly pupae sterilized by radiation are being released each week in the Florida Keys. The female mates only once in her lifetime, so the idea is that if the female mates with a sterilized fly, the screwworm infestation should be over in about six months. For the first time since the outbreak began, no deer died in the past week, showing that those measures and antiparasitic medications fed to the deer are beginning to show signs of success, the Fish and Wildlife Service said in a statement on Thursday. The authorities have also set up a mandatory inspection station along the   highway leading to the Florida Keys, where anyone transporting an animal out of the county must stop to have it checked. Nearly 5, 000 animals  —   from chickens to cats, horses and even an ape  —   were inspected without any parasite findings. Brian McCluskey, the associate deputy administrator for veterinary services for the federal Agriculture Department, said it was unclear how the screwworm returned to the United States, but it could have come from someone traveling by boat from Cuba, where the screwworm is present. It is also present in Haiti and other countries, so lab tests will have to be used to determine the origin. The refuge is in a part of Florida that has been a common landing spot for smugglers dropping off Cuban migrants, who sometimes bring their pets. Dr. John H. Wyss, a retired veterinarian who ran the Agriculture Department’s eradication program in Central America for 12 years, said it took 50 years to eliminate the screwworm from the southern United States to Panama. A serious infestation could take two to three years to eliminate, he said. “The real economic threat would be to the livestock in Florida,” Dr. Wyss said. “It would be a tremendous cost. ”'"}, "time": 1742628472.4743693}