{"duration": 0.2650735378265381, "input_args": {"text": "'By Jonas E. Alexis on October 29, 2016 We witnessed the collapse of Iraq and Libya. Syria was supposed to be next, but the process was clearly stopped by Russia. Vladimir Golstein …by Jonas E. Alexis and Vladimir Golstein \\nVladimir Golstein holds his M.S. in computer science from the Moscow Institute of Management, his B.A. in Philosophy from Columbia University, and his Ph.D. in Slavic Languages and Literatures from Yale University. His scholarly interests embrace Russian culture, religion, philosophy, and poetry of the past two centuries, as well as the current foreign policy issues. He is currently Professor of Slavic Studies at Brown University. \\nGolstein is putting together two scholarly monographs: one on the conflict of generations in Russia and another on the use of musical communication in a literary text. His recent study is Lermontov’s Narratives of Heroism (Evanston, IL: Northwestern University Press, 2012). He is well-known in the scholarly world. [1] His articles have been featured on Forbes , The Nation , the Kyiv Post , Al Jazeera , and other news outlets. [2] \\nJEA : In your recent article, you write that the mass media and its “ newspaper titles sound like a commercial for the upcoming Invasion of the Body Snatchers sequel. The Washington Post announces: ‘Russia Is Now a Threat. The US Should Treat It Like One.’ Time magazine raises the stakes: “Russia Wants to Undermine Faith in the U.S. Election.” \\nWhy all this propaganda? Is it because Putin is obliterating ISIS in Syria? If the United States made a deal with the famous mass murderer in the twentieth century (Joseph Stalin), how is it that United States cannot come up with a reasonable solution with Russia? Unpack those issues for us. \\nVG : Unfortunately, the old and necessarily skills of diplomacy, along with the concrete knowledge of Russia and its capabilities, have been thrown out of the window during the last twenty years or so. The US, happy with its dominant position, has decided to deal with other countries in the form of dictates, orders, and directives. It was presumed that other countries, like Russia, were simply not in the position to resist or negotiate, so why bother. \\nConsequently, we have a bunch of rather ignorant ideologues in the State Department, and equally ignorant scriveners in the mass media, who simply act upon the latest policy paper received from the top floor and then spin it to the public. \\nWhen this policies encounter a setback, like in the situations with Georgia in 2008, or Ukraine in 2014, and now Syria, the only thing this crowd does is to throw a fit, in the manner of the US ambassador to the UN, Samantha Power . \\nWhat drives these histrionics is the real failure to access the situation properly and negotiate with Russia. There is a strong conviction among the policy makers in Washington that Russia lost the Cold War, and therefore should know its place. \\nRussia’s refusal to play along clearly throws a monkey wrench into the schemes cooked up by the State Department and its think-tanks. Yet, they cannot come up with any new viable policy, resorting to the same strategies and the same accusations that has already failed them. \\nSo the frustration associated with failure appears to be the main reason for the recent wave of Russophobia. However, one should add that once this wave has been raised, a lot of people want to ride it. \\nHillary wants to ride it into the White House, blaming her opponent on being on cozy terms with Russia; Pentagon and NATO want to ride it, in order to justify its expansion; newspapers want to ride it, because having enemy and decrying its faults is good for business; economists and politicians want to ride it, because it serves as a distraction from the failing economy. \\nJEA: You cite flaming Neocon Max Boot saying that “Our democracy is under attack by Russia, but almost no one is treating the situation with the gravity it deserves.” Boot is the Neocon hoodlum who admitted that the United States has been supporting the Syrian rebels/terrorists through Saudi Arabia, Qatar, Turkey and Jordan. [3] \\nElliott Abrams, another Neocon, conceded the point that the Jihadists in Syria have committed serious terrorist crimes. [4] But that again does not bother Boot at all. Why is that? Why do these people always want to spread bloodshed all over the Middle East? Haven’t enough people died already? \\nIt appears to me that what drives these people is the desire to weaken the Middle East, or at least, these parts of it, that don’t want to play along with Washington. Whatever it takes to weaken a government of such resisting country is fine for these policy makers: it might be terrorists, or religious fanatics, as long as they create tensions within the country, it is fine for these neocons. Consequently, we witnessed the collapse of Iraq and Libya. Syria was supposed to be next, but the process was clearly stopped by Russia. \\nRussia recognized what was in store for Syria, because it has already witnessed the same scenario being unfolded during the so-called Arab Spring. During the Arab Spring the legitimate grievances of an educated pro-western group of people were harnessed to the militancy of the religious zealots in order to overthrow the government and produce civil strife. \\nFurthermore, Russia witnessed the neocons’ modus operandi succeeding in Ukraine, when the fanatical nationalists from the Western Ukraine joined the naïve, English speaking youth, and orchestrated the putsch in Kiev, ousting the legally elected president, and installing the power willing to follow western “recommendations.” \\nFrustrated and insulted by this radical regime change on its own border, the regime change that resulted in thousands deaths and more than a million refugees from the Eastern Ukraine who refused to follow the orders from Kiev, Russia has decided that enough is enough. It just simply can’t afford to let US and its coalition to dismantle all Russia’s former allies and friends. \\nNeocons, it should be stressed, did not invent this strategy; they seem to follow the old maxim of Zbigniew Brzezinski, that any ally is good as long as it helps in weakening and defeating Russia. Thus, the ally was found: Osama Bin Laden and his group of radicals, ready to take on the Russians in Afghanistan. \\nWhat also is rather curious is that the US finds it difficult to deal with the civic governments, be it in Afghanistan, or Lybia, or Iraq. They prefer to enter into the contact with the religious fanatics, allowing them to pursue their religious dreams, while US companies introduce their materialist policies and controls over the natural resources. \\nThe division of labor so to speak: fanatics pray or chop heads, while US companies count their profits. The civilian government, on the other hand, might want to take control over resources, as they tried to do in Iran in 1953 , [5] or might try to have their independent foreign policy; both of these aspects seem to be unacceptable to the neocon policy makers. \\nJEA: Israel’s Defense Ministry Amos Gilad once made the claim in 2013 that there is a growing presence of al-Qaeda elements among the so-called Syrian rebels, and those jihadists are “waiting for the opportunity to take over the state.” \\nBut Gilad absolved himself from any moral responsibility by saying that this element is a very small price to pay, particularly “with the menace posed by the Iran-Syrian-Hezbollah axis before the Syrian civil war…” \\nGilad unapologetically said, “with all due respect to that threat, [the al-Qaeda element] is not the same threat as one posed by Iran, Syria and Hezbollah together, which is much more difficult.” [6] \\nWhy would these people prefer to sleep and commune with terrorists in the region as opposed to making a reasonable deal with Russia? Doesn’t that mean that these people are completely mad and are not acting on a rational point of view? And doesn’t it suggest that that Russophobia has no moral and political ground and is therefore imploding? \\nVG: I find Israel to be as obsessed with Iran as much as the US does. Frankly, I cannot understand this obsession and paranoid fear. Consequently, Israelis appear to be more afraid of Iran than of the violent and murderous fanatics that have already destroyed two countries and continue to terrorize several more. Israel’s rivalry with Syria is also dictated by this fear of “hostile” Iran taking over Syria, thus threatening Israel through the Golan Heights. \\nIran, historically, have been very friendly with the Jews, [7] so I don’t see any reasons for Israel not to try to negotiate with both Iran and Russia (and Turkey) for the lasting peace in the Middle East. \\nFurthermore, I am sure that there are a lot of people in Israel who understand that. But they also understand that the powerful alliance between Saudis and United States does not want that. These two countries, Saudis in particular, don’t want to see Iran succeed anywhere. And Israel, since it depends on the US for its giant military aid, is not in the position to challenge Washington. \\nSo to keep its military aid from the US flowing, Israel is forced to play the role of the attack dog against Iran. Consequently, I believe that the tensions and violence in Middle East will continue until Saudis and the US continue to treat Iran in the same manner as the EU and the US continue to treat Russia – as some sort of a rogue state, rather than a legitimate powerful country with its own proud history, culture, political system, and international interests. \\nJEA: Great assessment. With respect to Iran and the Jews, the entire Zionist media and the propaganda industry have it completely wrong. For example, Ciamak Morsadegh, a newly elected Iranian and Jewish parliamentarian in the country, debunked Benjamin Netanyahu and the Zionist Mafia by saying: \\n“Benjamin Netanyahu and the anti-Semites need each other: they supply each other with what they need – intolerance and hatred. It is an unspoken alliance which suits them, but it causes great harm to the rest of us.” [8] \\nNetanyahu himself has capitalized on this “unspoken alliance,” otherwise he would not have said the following right after the 9/11 attack: \\n“We are benefiting from one thing, and that is the attack on the Twin Towers and Pentagon, and the American struggle in Iraq.” [9] \\nAll those wars in the Middle East, added Netanyahu, “swung American public opinion in our favor.” [10] Back in 2001, the New York Times itself reported: “Asked tonight what the attack meant for relations between the United States and Israel, Benjamin Netanyahu, the former prime minister, replied, ‘It’s very good.’ Then he edited himself: ‘’Well, not very good, but it will generate immediate sympathy.’” [11] \\nIf that is not diabolical, then nothing is. As we have reported elsewhere, the war in Iraq alone will cost America at least six trillion dollars, [12] and that doesn’t even include innocent civilians and decent people who have lost their precious lives in the process. [13] \\nLike John Milton’s Satan in Paradise Lost , Netanyahu and indeed the entire New World Order system have adopted an essentially diabolical ideology which basically says, “Evil, be thou my good.” [14] What we are seeing again and again is that the Ayatollah Khomeini was right on target when he launched the “Great Satan” to describe the covert activities of the Zionist Mafia. [15] \\n[1] See Andrew Kahn, ed., The Cambridge Companion to Pushkin (Cambridge: Cambridge University Press, 2006), 87; Robin Feuer Miller, The Brothers Karamazov: Worlds of the Novel (New Haven: Yale University Press, 2008), xvi; Ilia Dorontchenkov, ed., Russian and Soviet Views of Modern Western Art, 1890s to Mid-1930s (Berkley: University of California Press, ), xiv; Irina Paert, Spiritual Elders: Charisma and Tradition in Russian Orthodoxy (Dekalb, IL: Northern Illinois University Press, 2010), 248; Olga Tabachnikova, Anton Chekhov Through the Eyes of Russian Thinkers: Vasilii Rozanov, Dmitrii Merezhkovskii and Lev Shestov (New York and London: Anthem Press, 2012), chapter 8. \\n[2] Vladimir Golstein, “Why Everything You’ve Read About Ukraine Is Wrong,” Forbes , May 19, 2014; “Western Media Coverage of the Ukraine Crisis Is as Distorted as Soviet Propaganda,” The Nation , May 22, 2014; “Why do they hate Russia?,” Al Jazeera , March 8, 2014. \\n[3] Max Boot, “The Missing Element in Western Aid to the Syrian Rebels,” Commentary , March 27, 2013. \\n[4] Elliott Abrams, “Syria’s European Jihadis,” National Review , March 28, 2013. \\n[5] See Stephen Kinzer, All the Shah’s Men: An American Coup and the Roots of Middle East Terror (Hoboken, NJ: John Wiley & Sons, 2003 and 2008); Ervand Abrahamian, The Coup: 1953, the CIA, and the Roots of Modern U.S.-Iranian Relations (New York: The New Press, 2015). \\n[6] Herb Keinon, “Gilad: Syria Poses New, ‘Difficult’ Challenges to Israel,” Jerusalem Post , April 2, 2013. \\n[7] See for example Kim Sengupta, “Iran’s Jews on life inside Israel’s ‘enemy state’: ‘We feel secure and happy,’” Independent , March 17, 2016; “Iran’s Hassan Rouhani Tweets ‘Shana Tova’ to Jews,” Jewish Daily Forward , September 14, 2015; Thomas Erdbrink, “Iran Delivers Surprise, Money, to Jewish Hospital,” NY Times , February 6, 2014; “Report: Rohani Gives $400,000 to Tehran’s Jewish Hospital,” Haaretz , February 6, 2014; see also “Iran’s Jews reject cash offer to move to Israel,” Guardian , July 12, 2007; “Iranian Jews Blast Offer of Cash for Immigrating to Israel,” Haaretz , July 14, 2007; \\n[8] Kim Sengupta, “Iran’s Jews on life inside Israel’s ‘enemy state’: ‘We feel secure and happy,’” Independent , March 17, 2016 \\n[9] “Report: Netanyahu Says 9/11 Terror Attacks Good for Israel,” Haaretz , April 16, 2008. \\n[10] Ibid. \\n[11] James Bennett, “A DAY OF TERROR: THE ISRAELIS; Spilled Blood Is Seen as Bond That Draws 2 Nations Closer,” NY Times , September 12, 2001. \\n[12] Ernesto Londono, “Study: Iraq, Afghan war costs to top $4 trillion,” Washington Post , March 28, 2013; Bob Dreyfuss, The $6 Trillion Wars,” The Nation , March 29, 2013; “Iraq War Cost U.S. More Than $2 Trillion, Could Grow to $6 Trillion, Says Watson Institute Study,” Huffington Post , May 14, 2013; Mark Thompson, “The $5 Trillion War on Terror,” Time , June 29, 2011; “Iraq war cost: $6 trillion. What else could have been done?,” LA Times , March 18, 2013. \\n[13] See for example Mark Kukis, Voices from Iraq: A People’s History, 2003-2009 (New York: Columbia University Press, 2011). \\n[14] John Milton, Paradise Lost (New York: Dover Publications, 2005), 71. \\n[15] E. Michael Jones, “The Great Satan and Me: Reflections on Iran and Postmodernism’s Faustian Pact,” Culture Wars , July/August, 2015. Related Posts:'"}, "time": 1742564266.8356266}