{"duration": 0.26926279067993164, "input_args": {"text": "'Failed Investigations of JFK’s Murder November 21, 2016 \\nMore than a half century later, John F. Kennedy’s assassination still resonates not only because of its historical importance but because the investigation was more a cover-up than a pursuit of truth, says researcher Gary Aguilar. \\nBy Gary Aguilar \\nNovember 22 marks the 53 rd anniversary of John F. Kennedy’s assassination. If history is any guide, it’s likely some mainstream outlet will commemorate that dark day with reassurances that the Warren Commission was right that Lee Harvey Oswald did it alone, and that most doubters, who have been in the majority since the mid-1960s, are randy conspiracy theorists. That is the essential message by one of the experts likely to be cited this year, attorney Howard Willens. President John F. Kennedy in the motorcade through Dallas shortly before his assassination on Nov. 22, 1963. (Photo credit: Walt Cisco, Dallas Morning News) \\nOne of the few still-living Warren Commission staffers, Willens followed up his 2013 book, History Will Prove Us Right, with a spirited defense of the Commission in the summer, 2016 issue of the journal, The American Scholar , which he co-wrote with another Commission staffer, attorney Richard Mosk. The piece , “The Truth About Dallas, ” is a celebration of the work and conclusions of the original investigation. \\nBut Willens’s and Mosk’s defense of the work of the Warren Commission they served on is more notable for what they omit from the official record than what they include. “What the critics often forget or ignore,” they write, “is that since 1964, several government agencies have also looked at aspects of our work,” (p. 59) as if the Church Committee and the House Select Committee on Assassinations (HSCA) had reviewed and applauded the Commission’s work. \\nIndeed, they did look at it. But rather than plaudits, they issued stinging rebukes, principally for the Commission’s having been rolled by FBI Director J. Edgar Hoover, and to a lesser extent, by the CIA and the Secret Service. \\n“It must be said that the FBI generally exhausted its resources in confirming its case against Oswald as the lone assassin,” the HSCA concluded, “a case that Director J. Edgar Hoover, at least, seemed determined to make within 24 hours of the of the assassination.” \\nIn essence, the experienced investigators concluded that Hoover had divined the solution to the crime before starting the inquiry, and then his agents confirmed the boss’s epiphany. The intimidated Warren Commission went right along. FBI Director J. Edgar Hoover \\nAnd with good reason, only part of which Willens and Mosk tell. They admit that the “FBI had originally opposed the creation of the Warren Commission” and that Hoover “ordered investigations of commission staff members.” But they don’t tell that Hoover deployed one of his favorite dirty tricks to deal not only with support staffers, such as Willens and Mosk, but also with the commissioners themselves. \\n“[D]erogatory information pertaining to both Commission members and staff was brought to Mr. Hoover’s attention,” the Church Committee reported . (emphasis added) \\nHoover’s Spy \\nWillens and Mosk also forgot to mention that Hoover had a personal spy on the Warren Commission, then Rep. Gerald Ford, who tattled on Commissioners who were (justifiably) skeptical of the Bureau’s work. \\n“Ford indicated he would keep me thoroughly advised as to the activities of the Commission,” FBI Agent Cartha DeLoach wrote in a once secret memo. “He stated this would have to be done on a confidential basis, however he thought it should be done.” Autopsy photo of President John F. Kennedy. \\nAt the bottom of the memo, Hoover scrawled , “Well handled.” The success of Hoover’s machinations was obvious to subsequent government investigators. (Ford, of course, later became President upon the resignation of Richard Nixon in 1974.) \\nThe HSCA’s chief counsel, Notre Dame Law Professor Robert Blakey, a criminal investigator and prosecutor with vastly better credentials than either Willens or Mosk, was impressed with neither the Commission’s vigor nor its independence. \\n“What was significant,” Blakey determined, “was the ability of the FBI to intimidate the Commission, in light of the Bureau’s predisposition on the questions of Oswald’s guilt and whether there had been a conspiracy. At a January 27 [1964] Commission meeting, there was another dialogue [among Warren Commissioners]: \\n“John McCloy: ‘… the time is almost overdue for us to have a better perspective of the FBI investigation than we now have … We are so dependent on them for our facts … .’ \\n“Commission counsel J. Lee Rankin: ‘Part of our difficulty in regard to it is that they have no problem. They have decided that no one else is involved … .’ \\n“Senator Richard Russell: ‘They have tried the case and reached a verdict on every aspect.’ \\n“Senator Hale Boggs: ‘You have put your finger on it.’ (Closed Warren Commission meeting.)” [Blakey & Billings, Fatal Hour– The Assassination of President . See also: North, Act of Treason ] \\nTestifying before the HSCA, the Warren Commission’s chief counsel J. Lee Rankin shamefully admitted , “Who could protest against what Mr. Hoover did back in those days?” Apparently not President Lyndon Johnson’s blue-ribbon commissioners. \\nThe HSCA’s Blakey also reported that “When asked if he was satisfied with the (Commission’s) investigation that led to the (no conspiracy) conclusion, Judge Burt Griffin (a Commission staff member) said he was not.” [Blakey & Billings, Ibid.] \\nAnd author Gus Russo reported that Judge Griffin also admitted, “We spent virtually no time investigating the possibility of conspiracy. I wish we had.” [Russo, Live by the Sword ] \\nClear Misgivings \\nThus, despite their clear misgivings, the Commissioners bowed to the imperious FBI chief rather than conduct a thorough investigation. Notably, the Commission never once employed a rudimentary investigative tool . “The Commission,” the HSCA reported, “failed to utilize the instruments of immunity from prosecution and prosecution for perjury with respect to witnesses whose veracity it doubted.” [US Cong. House of Reps. Report of Comm. on Assassinations, 1979] Lee Harvey Oswald, the accused assassin of President John F. Kennedy. \\nThis policy had serious repercussions when the Commission confronted two key issues: published claims that Lee Harvey Oswald had been an FBI informant, and the possibility that Jack Ruby was mobbed up. \\n“The Commission did not investigate Hoover or the FBI, and managed to avoid the appearance of doing so,” the HSCA determined . “It ended up doing what the members had agreed they would not do: Rely mainly on the FBI’s denial of the allegations (that Oswald had been a Bureau informant).” \\nHoover merely sent the Commission his signed affidavit declaring that Oswald was not an informant and also “sent over 10 additional affidavits from each FBI agent who had had contact with Oswald.” And with that, case closed. \\nRegarding Jack Ruby, the FBI had his phone records, yet failed to spot Ruby’s obvious, and atypical, pattern of calls to known Mafiosi in the weeks leading up to the assassination. After performing the simple, obvious task of actually analyzing those calls, the HSCA determined that, if not a sworn member of La Cosa Nostra, Ruby had ongoing, close links to numerous Mafiosi. \\nThus the HSCA roundly rejected the Warren Commission’s conclusion that, “the evidence does not establish a significant link between Ruby and organized crime.” \\nThe list of Warren Commission shortcomings that the HSCA assembled is not short. A brief summary of them runs some 47 pages in the Bantam Books version of the report (p. 289–336), which outlines what required much of the 500 pages of HSCA volume XI to cover ( available on-line ). \\n“The evidence indicates that facts which may have been relevant to, and would have substantially affected, the Warren Commission’s investigation were not provided by the agencies (FBI and the CIA). Hence, the Warren Commission’s findings may have been formulated without all of the relevant information.” \\nThe Church Committee said that the problem was that “the Commission was perceived as an adversary by both Hoover and senior FBI officials.” “Such a relationship,” the Committee dryly observed , “was not conductive to the cooperation necessary for a thorough and exhaustive investigation.” \\nBut the FBI did more than just withhold evidence from the Commission. Although they admit that the FBI destroyed a note Oswald wrote to Agent Hosty, and withheld that information from the Commission, Willens and Mosk don’t mention that Agent Hosty reported that his own personnel file, and other FBI files, had been falsified. [Hosty, Jr. Assignment: Oswald ] \\nNor that author Curt Gentry learned from assistant FBI director William Sullivan that there were other JFK documents at the Bureau that had been destroyed. [Gentry, J. Edgar Hoover– The Man and His Secrets ] \\nPerhaps one of the reasons the public has remained mistrustful of the government’s conclusions, and the mainstream media reassurances, is the sort of selective presentation of evidence by ax grinders like Willens and Mosk who get heralded by our “responsible” media. \\nGary Aguilar is one of the few physicians outside the government ever allowed to see the still-restricted JFK autopsy photos and X-rays. He has published and lectured on the topic of the JFK assassination for many years.'"}, "time": 1742562214.9508202}