{"duration": 0.0939326286315918, "input_args": {"text": "'Posted on November 6, 2016 How Hillary Courts the Black Vote Ethnomasochism reaches a new low. \\nThe Democratic presidential primary was one of unprecedented pandering for the non-white vote. As The Guardian summed up one of the debates: “Hillary Clinton and Bernie Sanders made a conspicuous play for Latino and African American voters.” Mrs. Clinton won the “conspicuous play” hands down, and with it, the nomination. The failure of Senator Sanders to win the necessary quotient of non-white votes was repeatedly pointed out by the chattering class up until the time he dropped out. \\nIn February one black commenter pointedly wrote that Sen. Sanders, “has many miles to go to convince black voters that he can fight for our interests.” By May, black commenter Steven Thrasher wrote a piece titled, “ Bernie Sanders isn’t winning minority votes – and it’s his own fault .” Mr. Thrasher identified Sen. Sanders’s problem as “failing to talk about racism at every turn.” \\nThis accusation may seem ludicrous, since Sen. Sanders surrendered his stage to Black Lives Matter activists several times. But in comparison to Mrs. Clinton, Mr. Thrasher was right about Sen. Sanders. No mainstream candidate in the history of the United States has more thoroughly debased himself in the quest for the black vote than Mrs. Clinton. Since this helped her win the Democratic nomination, she has continued the strategy. In the few days remaining before November 8th, let’s take a look at Hillary Clinton’s most ethnomasochistic moments. \\n1) In January of 2016, Mrs. Clinton was at something called the Iowa Brown and Black Forum (with none other than Jorge Ramos ), where she was asked “Can you tell us what the term ‘white privilege’ means to you? And can you give me an example from your life or career when you think you have benefitted from it?” This is how she began her answer: \\nWhere do I start? I think it is hard when you are swimming in the ocean to know exactly what is happening around you so much as it is when you’re standing on the shore perhaps watching . . . . I was born white, middle-class, in the middle of America. . . . \\n2) Early in the Democratic nomination, Mrs. Clinton’s campaign released a memo aimed at stifling the rising momentum of Bernie Sanders: \\n[W]hereas the electorates in Iowa and New Hampshire are largely rural/suburban and predominantly white, the March [primary] states better reflect the true diversity of the Democratic Party and the nation . . . . It will be very difficult, if not impossible, for a Democrat to win the nomination without strong levels of support among African American and Hispanic voters. We believe that’s how it should be. emphasis added \\n3) Shortly before the South Carolina primary, at Schomburg Center for Research in Black Culture in Harlem, Mrs. Clinton explained how to break down barriers for African Americans: \\nEnding systemic racism requires contributions from all of us—especially those of us who haven’t experienced it ourselves. White Americans need to do a better job of listening when African Americans talk about the seen and unseen barriers that you face every day. \\nWe need to recognize our privilege and practice humility, rather than assume that our experiences are everyone’s experiences. All of us need to bring our skills to bear—and especially young people coming up today, who have a passion for social justice and are helping to create new ways to solve intractable problems. \\n4) In April of 2016, while on a back radio show, Mrs. Clinton was asked what she always carries in her bag. She immediately answered, “hot sauce.” When one of the black hosts noted that she would be accused of pandering to black people for giving that answer, she asked hopeully, “Is it working?” \\n5) Just a few weeks after a Black Lives Matter supporter murdered five police officers , the Democratic National Convention that convened to nominate Mrs. Clinton passed a resolution, no doubt with her approval, supporting Black Lives Matter : \\n[T]he DNC joins with Americans across the country in affirming ‘Black lives matter’ and the ‘say her name’ efforts to make visible the pain of our fellow and sister Americans as they condemn extrajudicial killings of unarmed African American men, women and children. \\nWhite politicians have tried to win elections through public displays of ethnomasochism for decades, but this election has set a new low. And if Mrs. Clinton loses, her pandering could live on in another form. As the Black Lives Matter activist Tef Poe explained , if Mr. Trump wins, “young niggas such as myself are fully hell bent on inciting riots everywhere we go . . . ain’t no more rules. We’ve been too nice as is.”'"}, "time": 1742562995.2642758}