{"duration": 0.1152496337890625, "input_args": {"text": "'Anniversary of Great Reporter’s Death By Daily Bell Staff - November 23, 2016 \\nWe got the very sad news today, Nov. 22, 2015, that Dave McGowan passed away from cancer at 12:47 p.m. – Truth and Shadows \\nWe missed the anniversary of McGowan’s death, which was yesterday, but he was one helluva a writer, exposing in brief books the“directed history” of the modern era. So, we’ll remember him today. We’ve written about him before, here. \\nHe died of an extremely aggressive form of lung cancer, which made some of his fans speculate that he’d actually been assassinated. Unfortunately, much of Dave’s work is no long freely available on the ‘Net, though some is available here . \\nThe following is Dave’s last post here from his Blog Center for an Informed America (June 14, 2015). \\nJust nine weeks ago, on April 14, I presented a lengthy video deconstruction of the 2013 Boston Marathon incident through the Caravan to Midnight radio show/podcast. About a week later (on April 20, of all days), the nearly four-hour video presentation was uploaded to YouTube. \\nNot long after that, someone using the username Phoenix Archangel posted an interesting comment: “John [Wells, the host of the show] always signs off with some of the best advice ever. Speaking of advice: this David McGowan fella really ought to quit smoking. With all the elitist feathers he’s ruffling, he’s likely to come down with a spontaneous case of hitherto undiagnosed stage 4 inoperable Pancreatic cancer.” \\n… Mr./Ms Archangel … wasn’t too far off, though I’ve been told that it’s actually incurable small-cell lung cancer that has already spread to my liver and bones. And no, that’s unfortunately not a joke. It’s my new reality as of just a few short weeks ago, when my entire world was turned upside-down and I suddenly found myself being admitted to the oncology ward at Glendale Adventist Medical Center. Four days later, I was beginning my first round of chemotherapy infusions. The second round begins tomorrow, on Monday, June 15. \\nMore from Truth and Shadows: \\nThe first thing I read from McGowan was his series on the Apollo Moon missions called “Wagging the Moondoggie.” This amazing 14-part series is what finally convinced me that the Moon landings never took place. What struck me was not only his insight but his wit. Very dry, which is the best kind. \\nIn addition to what became a whole series on 9/11, I was also blown away by series on the Boston Marathon “bombing” and dark side of the music scene in Laurel Canyon in the 1960s (which became a book). Other books he has written include Programmed to Kill, Understanding the F-Word: American Fascism and the Politics of Illusion, and Derailing Democracy: The America the Media Don’t Want You to See. \\nWe ran into McGowan’s work very early in the 2000s when we were researching an article on the Peak Oil hoax. At the time, libertarian analysis was mostly theoretical, but we were trying to focus on a synthesis between free-market theory and “directed” history. \\nWe could hardly believe McGowan’s comments on Peak Oil. Without, apparently, a deep background in Austrian free-market economics, he nonetheless fully grasped the idiocy of asserting that the modern world was running out of oil, and that since alternatives were not going to be developed in a timely manner, the only solution was drastic, government action. He even mentioned abiotic oil, see here, as we recall. \\nWhen we read his short books, we were further impressed. McGowan moved far beyond simplistic assertions of “conspiracy” to show you clearly how modern history seemed to work. \\nFor us, the book on the mid-1960s Laurel Canyon music scene here was perhaps the most brilliant. Who knew that Jimi Hendrix was in the military, here, prior to becoming a rock star? Who knew that many of the musical stars of the early- to the mid-1960s were somehow gathered together in Laurel Canyon prior to their fame, here – and that many or most had military ties or came from military families. \\nMcGowan didn’t state everything. Some things he left up to you. But it was hard to come away from his books without understanding his main point, that society was directed purposefully from above and that before the Internet (and people like McGowan), you would live your entire life unknowingly according to someone else’s plan. \\nHis short book about Laurel Canyon not only shows how directed history operates, it makes the point, resonantly, that society and even culture can be shifted according to elite strategies. In other words, in not very many pages it SHOWS (not tells) how Western social manipulation actually works. Likely it has worked this way for thousands of years. \\nBefore McGowan, it was easy to believe that social manipulation must inevitably be a clumsy affair, imposed brutally as it was in the USSR. McGowan presents ways cultural reconfiguration can take place secretly and powerfully, without anyone but a handful knowing it is happening. \\nFor instance, the standard story of the 1960s is that young people got upset over the war and in the process of protesting, quickly created an entire counterculture that opposed much of what “corporate America” stood for. The trouble with the 1960s counterculture was that it never adequately defined the real problem, nor did it fully explain the solution. \\nThe hippie ethos blamed much of what was wrong with America on corporate greed and the like. This led to the conclusion that government itself could rectify what was wrong. But both modern corporations and today’s massive governments are the result of monopoly force wielded behind the scenes. \\nIn reality, as McGowan showed, the 1960s movement was likely painstakingly created to generate certain results, mostly by reinforcing social chaos. Thus, blaming problems on corporations and looking to government for solutions was only to be expected, though it was wrongheaded on numerous levels. \\nAs we know today from Internet information, government is seemingly supported by a handful of unfathomably rich individuals – those who likely control central banking – to provide “solutions” that inevitably generate more problems not less. \\nWe know from Austrian economics that almost every law and regulation is surely a price fix that must drain prosperity from society. We know, via “marginal utility” here that valid prices can only be generated via market competition itself. \\nThe 1960s hippie revolution explored little of this because – as McGowan suggested – it was created and sustained by the CIA. So many 1960s figures were apparently working with the CIA. \\nThese may have included singer Jim Morrison, whose father helped initiate the fake military incidents that Lyndon Johnson used to generate the full-on Vietnam war here – and many other musicians, promoters and business opportunists. And also those individuals who initially dispersed CIA-created LSD, here. \\nIn fact, one can speculate that the Vietnam War itself was created as part of a Hegelian dialectic that included the creation of a manipulated 1960s alternative “hippie” culture. Each Hegelian thesis demands an antithesis that leads to a synthesis. The war was the thesis, and the counterculture was the antithesis leading to the synthesis we have today. \\nThe goal is always globalism, apparently. And social chaos must be regularly induced in order to reinforce additional government actions. If one has the patience and the desire, it is relatively easy to discern the evolution of these modern manipulations and even to predict their future. \\nIt’s one reason, we continue to distrust narratives present in the mainstream media and even those being offered, sometimes, in the alternative media. We’re not sure that this presidential election, for instance, is what it seems. And we have written numerous articles suggesting that a good deal of purposeful propaganda surrounds nuclear weapons, to name one additional promotion, here . \\nConclusion: McGowan helped show the way, however, and we simply need to follow his lead to better our own comprehension. It’s not pleasant to pursue such information, nor come to additional conclusions, but the alternative is living in ignorance of the true influences on our life and times. Some people are content to live without embarking on such explorations. Others are not.'"}, "time": 1742564474.1469548}