{"duration": 0.0775139331817627, "input_args": {"text": "'WEST PALM BEACH, Fla.  —     Donald J. Trump edged away on Thursday from his dismissive stance on American assessments of Russian hacking, saying he would meet with intelligence officials next week “to be updated on the facts” after the Obama administration announced sanctions against Moscow. In a brief written statement, Mr. Trump’s first response to President Obama’s sweeping action against Russia, the   reiterated his call for “our country to move on to bigger and better things. ” But he said that, “in the interest of our country and its great people,” he would get the briefing “nevertheless. ” The statement to some extent echoed his remarks late Wednesday, when he was asked at his    estate about Mr. Obama’s plan to take action against Russia. In otherwise opaque comments, Mr. Trump appeared to concede the need to make computers more secure. “I think we ought to get on with our lives,” he said. “I think that computers have complicated lives very greatly. The whole age of computer has made it where nobody knows exactly what is going on. We have speed, we have a lot of other things, but I’m not sure we have the kind, the security we need. ” Mr. Trump took questions Wednesday from a handful of reporters as Don King, the sports promoter and a longtime friend, stood next to him. He has not held a formal news conference since July, though he promised on Wednesday to hold one in early January. The   has bucked the consensus of his own party in Congress in repeatedly expressing skepticism that Russia was behind hacking during the election. His isolation was underscored by other Republicans’ responses to the Obama administration’s actions. Speaker Paul D. Ryan said Thursday that the sanctions were “overdue,” but still blamed Mr. Obama for “eight years of failed policy with Russia. ” “Russia does not share America’s interests,” Mr. Ryan said in a statement. “In fact, it has consistently sought to undermine them, sowing dangerous instability around the world. ” Senators John McCain of Arizona and Lindsey Graham of South Carolina went further, saying they would push Congress for even stronger sanctions than Mr. Obama was seeking. That is a direct challenge to Mr. Trump and his advisers, who mocked intelligence agencies this month for their conclusion that Russia was responsible for the hacking. “I think it’s ridiculous. I think it’s just another excuse,” Mr. Trump said in an interview on “Fox News Sunday” on Dec. 11. “I don’t believe it. ” He linked the intelligence assessments on Russia to Democrats’ embarrassment over their loss to him. Mr. Trump has also voiced his doubts several times on Twitter. In one post, he asked, “If Russia, or some other entity, was hacking, why did the White House wait so long to act?” In another, he asserted that “unless you catch ‘hackers’ in the act, it is very hard to determine who was doing the hacking. ” In the posts, Mr. Trump wrongly asserted that the United States government had waited until after the election to accuse Russia. In fact, the administration announced in October that it believed Russia had been involved in the hacking of the Democratic National Committee and the leaking of the organization’s emails. Mr. Trump was asked on Wednesday about statements by Mr. Graham that the Russian president, Vladimir V. Putin, should be personally penalized for the hacking. The   said he was unaware of the comments by Mr. Graham, who was a Republican candidate for president before dropping out a year ago. “I don’t know what he’s doing,” Mr. Trump said, adding, “As you know, he ran against me. ”'"}, "time": 1742561826.7338457}