{"duration": 0.05570650100708008, "input_args": {"text": "'\\nWith everything online, nothing is safe from criminals.\\nEvery ATM and every device is potentially hackable, and now a string of banks in Asia is learning the hard way that many people will go to great lengths in order to hit jackpot.\\nGangs are now taking advantage of system exploits, and have hatched a scheme to infiltrate banks’ code and turn on the automatic ATM dispenser, letting the cash flow freely out of the machine – dramatic, and dangerous.\\nThe whole system open to fraud, manipulation and outright theft; and as thieves become more organized, sophisticated rings are targeting not just individual accounts, individual customers or individual supply sources, but rather they are opening up the gates to the bank vaults themselves – in a way that was never possible in the old days.\\nvia WSJ :\\nCybercriminals who once earned millions by breaking into individual online bank accounts are now targeting the banks’ own computers, with often-dramatic results. \\nIn Taiwan and Thailand earlier this year, the criminals programmed bank ATMs to spew cash. Gang members stood in front of the machines at the appointed hour and collected millions of dollars. \\nEarlier this month, the Federal Bureau of Investigation warned U.S. banks of the potential for similar attacks.\\nThe FBI said in a bulletin that it is “monitoring emerging reports indicating that well-resourced and organized malicious cyber actors have intentions to target the U.S. financial sector.” \\nThe FBI bulletin cited software used by a Russian gang known as Buhtrap. Sometimes the hackers break into the systems that process transactions on banking payment networks; other times they have hit ATM networks directly.\\n[…]\\n“These guys, who could have been in the past just going after consumers…are breaking into financial institutions,” said Eric Chien, technical director of Symantec Corp.’s Security Technology and Response division.\\nThe computer code to carry out the attacks was released earlier this year by a disgruntled Buhtrap member… \\nIt seems that ample evidence exists that the powers that be shouldn’t be wrapping everything up in the grid, and yet they are.\\nWhile they kinds of events reinforce the reasons that we shouldn’t invest everything in the banks, or trust the system to be there when we need it, but rather to hedge into cash, commodities, barter and as much self-reliance as one could muster.\\nThis is the clearest reason yet in the news cycle as to why you shouldn’t be keeping your money at the bank – certainly not more than you could bear to lost in a crisis.\\nWith every new crisis, the system will position for more control, selling cyber security, enhancing biometrics and security questions, but the same fatal flaws remain: too much centralized power over everyone’s finances… and too easy for people to take advantage of it all in one place.\\nGovernments can’t be trusted with all that power and data, and neither should the banks – if only because bad people can then get what they want.\\nWe’re walking on eggshells of a fragile system… and its illusion of strength is one of its most dangerous appeals, false security.\\nRead more: \\nThe Lock Down Has Begun: JP Morgan Restricts ATM Cash Withdrawals \\nIntelligence Insider: How To Protect Your Assets From Critical Infrastructure Failure: “Power Grid, Banking System, Cyber Financial Warfare” \\nThis is Why You Need Your Money Out of the Bank: Freeze Outs, Glitches and Holds Increasingly Locking Customers Out of Funds \\nHow to Hide Your Money Where the Bankers Won’t Find It \\nWhat Guns? What Gold? Prepper Tips On “Hiding Your Guns in Plain Sight” \\nFuture Money: Why The State Is Trying to Outlaw “Disruptive” Cryptocurrency \\n'"}, "time": 1742561973.7282913}