{"duration": 0.03579258918762207, "input_args": {"text": "'Iran announced on Thursday that another underground missile production facility is up and running, as it vowed to continue developing missile technology despite warnings from the United States and United Nations. [“Iran’s third underground factory has been built by the Guards in recent years  …     We will continue to further develop our missile capabilities forcefully,” said Iranian air forces commander Amirali Hajizadeh, as quoted by the UK Daily Mail.  “It is natural that our enemies America and the Zionist regime are angry with our missile programme because they want Iran to be in a weak position,” Hajizadeh added, referring to the United States and Israel. Reuters notes Hajizadeh stated the new facility would be Iran’s third underground missile factory. He said it was constructed over the course of “recent years,” but evidently did not specify exactly when it began producing weapons. “Along with improving our defense capabilities, we will continue our missile tests and missile production. The next missile to be produced is a    missile,” the Iranian commander said. The new missile series will be named “Dezful,” after the site of the largest tank battle in the   War. According to Hajizadeh, the name is meant to convey Iran’s commitment to avoiding ground wars by achieving missile superiority over its regional rivals. Iran’s Mehr news agency quotes Hajizadeh boasting of Iran’s   in missile production, and also its advances in drone technology and electronic warfare. “We will never forget the United States supported Saddam’s Baath regime in its war against Iran, shot down our passenger flight, backed MKO, created ISIL and fueled war in Syria, Iraq and Yemen,” he declared.  The passenger flight he referred to was Iran Air Flight 655, shot down by a U. S. Navy missile cruiser in 1988. “MKO” is the   Khalq Organization, an insurgent organization opposed to the government of Iran. A 2015 broadcast on Iranian television showed a network of tunnels with “   missiles on the back of trucks,” which was supposedly one of hundreds of underground bases supplied by Iran’s missile factories. Sky News notes the announcement of this new missile factory came only days after the White House called upon newly   Iranian President Hassan Rouhani to end Iran’s ballistic missile program.'"}, "time": 1742563900.7114012}