{"duration": 0.1563856601715088, "input_args": {"text": "'The appointment of Stephen K. Bannon as chief White House strategist for   Donald J. Trump has been condemned by civil rights groups, Democrats and some Republicans, because of Mr. Bannon’s record as chairman of Breitbart News, the   news and opinion site. Here, in his own words, are a selection of Mr. Bannon’s public statements about the country, the Republican Party and his own political philosophy. • “Fear is a good thing. Fear is going to lead you to take action,” he said in a 2010 interview. • Referring to Ann Coulter, Michele Bachmann and Sarah Palin in a 2011 radio interview on Political Vindication Radio, he said: “These women cut to the heart of the progressive narrative. That’s why there are some unintended consequences of the women’s liberation movement. That, in fact, the women that would lead this country would be   they would have husbands, they would love their children. They wouldn’t be a bunch of dykes that came from the Seven Sisters schools up in New England. That drives the left insane, and that’s why they hate these women. ” • Mr. Bannon made a movie in 2012 about the Occupy Wall Street protests. He told an interviewer: “After making the Occupy movie, when you finish watching the film, you want to take a hot shower. You want to go home and shower because you’ve just spent an hour and 15 minutes with the greasiest, dirtiest people you will ever see. ” • “I think anger is a good thing,” he told a gathering of conservatives in Washington in 2013, according to a profile in The Atlantic. “This country is in a crisis. And if you’re fighting to save this country, if you’re fighting to take this country back, it’s not going to be sunshine and patriots. It’s going to be people who want to fight. ” • “I’m a Leninist,” Mr. Bannon was quoted as saying by a writer for The Daily Beast who met him at a party in 2014. He later said he did not recall the conversation. “Lenin wanted to destroy the state, and that’s my goal, too,” the site quoted him as saying. “I want to bring everything crashing down, and destroy all of today’s establishment. ” • “What we need to do is   the Republican Party,” he said in a 2010 radio interview on Political Vindication Radio. • “We don’t believe there is a functional conservative party in this country, and we certainly don’t think the Republican Party is that,” he told the same gathering. “It’s going to be an insurgent,   populist movement that is virulently   and it’s going to continue to hammer this city, both the progressive left and the institutional Republican Party. ” • “There is a growing global   revolt against the permanent political class at home, and the global elites that influence them, which impacts everyone from Lubbock, Tex. to London, England,” he said in a 2014 interview in The New York Times. •“Let the grassroots turn on the hate because that’s the ONLY thing that will make them do their duty,” he wrote about Republican leaders in a 2014 email exchange with a Breitbart News editor. The emails were obtained by The Daily Beast. • “We call ourselves ‘the Fight Club.’ You don’t come to us for warm and fuzzy,” Mr. Bannon told The Washington Post this year. “We think of ourselves as virulently   particularly ‘ ’ the permanent political class. We say Paul Ryan was grown in a petri dish at the Heritage Foundation. ” Mr. Bannon  took over Breitbart News in 2012 after the death of its founder, Andrew Breitbart, and shifted it further to the right. Critics, including some conservatives formerly associated with it, have denounced Breitbart in its current incarnation as a hate site steeped in misogyny, homophobia, transphobia, white nationalism and  . Here is a sampling of some articles published during Mr. Bannon’s tenure that drew criticism: • “Birth Control Makes Women Unattractive and Crazy” A December 2015 article by Milo Yiannopoulos, who was later barred from Twitter when he was accused of inciting racist and sexist attacks on the actress Leslie Jones, told women that birth control “makes you fat,” “makes your voice unsexy,” “makes you jiggle wrong,” “makes you a slut” and “makes you unsexy all the time. ” • “Bill Kristol: Republican Spoiler, Renegade Jew” A May 2016 article by David Horowitz criticized Bill Kristol for his opposition to Mr. Trump as “a political miscalculation so great and a betrayal so profound as to not be easily forgiven. ” • “World Health Organization Report: Trannies 49 Xs Higher HIV Rate” A December 2015 article by Austin Ruse, using a slur for transgender people in the headline, argued that a public health study on sexual health in the transgender community was actually a warning about “how dangerous it is to become ‘transgender. ’” The site called it a rebuke to “the ‘transgender’ narrative that is sweeping American culture. ” • “Roger Stone: Huma Abedin ‘Most Likely a Saudi Spy’ With ‘Deep, Inarguable Connections’ to ‘Global Terrorist Entity’” A June 2016 article by Dan Riehl chronicled the belief of Mr. Stone, a Trump adviser, that Ms. Abedin, an aide to Hillary Clinton, was connected to a terrorist conspiracy. • “There’s No Hiring Bias Against Women in Tech, They Just Suck at Interviews” A July 2016 article by Mr. Yiannopoulos argued that it was women’s fault that tech firms hired so few of them. • “Lesbian Bridezillas Bully Bridal Shop Owner Over Religious Beliefs” An August 2014 article by Susan Berry criticized a lesbian couple who complained on Facebook about a Pennsylvania bridal shop that refused to sell them wedding dresses. • “The Solution to Online ‘Harassment’ Is Simple: Women Should Log Off” A July 2016 article by Mr. Yiannopoulos argued that women were “screwing up the internet for men by invading every space we have online and ruining it with   and a needy, demanding,   form of modern feminism. ”'"}, "time": 1742564073.5405061}