{"duration": 0.05800890922546387, "input_args": {"text": "'NTEB Ads Privacy Policy Crooked Hillary Campaign Chairman John Podesta Took Part In Satanic Blood Rituals And Black Magic The revelation that John Podesta, Hillary Clinton’s campaign chairman, is presumably interested in weird, gory occult ceremonies was too juicy for even Wikileaks to ignore. by Geoffrey Grider November 4, 2016 In what is undoubtedly the most bizarre Wikileaks revelation to date, Clinton campaign chairman John Podesta was invited to a “spirit cooking dinner” by performance artist Marina Abramovic, to take part in an occult ritual founded by Satanist Aleister Crowley. In an email dated June 28, 2015, Abramovic wrote, “I am so looking forward to the Spirit Cooking dinner at my place. Do you think you will be able to let me know if your brother is joining? All my love, Marina.” Tony Podesta then forwarded the email to his brother John Podesta (Hillary Clinton’s campaign chairman), asking him, “Are you in NYC Thursday July 9 Marina wants you to come to dinner.” What is “spirit cooking”? Spirit cooking refers to “a sacrament in the religion of Thelema which was founded by Aleister Crowley” and involves an occult performance during which menstrual blood, breast milk, urine and sperm are used to create a “painting”. The Podestas’“Spirit Cooking” dinner? It’s not what you think. It’s blood, sperm and breastmilk. \\n— WikiLeaks (@wikileaks) November 4, 2016 According to Marina Abramovic , if the ritual is performed in an art gallery, it is merely art, but if the ritual is performed privately, then it represents an intimate spiritual ceremony. The video embedded above depicts the bizarre nature of the ceremony. Abramovic mixes together thickly congealed blood as the “recipe” for the “painting,” which is comprised of the words, “With a sharp knife cut deeply into the middle finger of your left hand eat the pain.” The ceremony is, “meant to symbolize the union between the microcosm, Man, and the macrocosm, the Divine, which is a representation of one of the prime maxims in Hermeticism “As Above, So Below.” Marina Abramovic ‘Spirit Cooking’: “Abramovic is known for her often-gory art that confronts pain and ritual. Her first performance involved repeatedly, stabbing herself in her hands. The next performance featured her throwing her nails, toenails, and hair into a flaming five-point star — which she eventually jumped inside of, causing her to lose consciousness,” writes Cassandra Fairbanks. Another image shows Abramovic posing with a bloody goat’s head – a representation of the occult symbol Baphomet. Spirit cooking is also an “occult practice used during sex cult rituals, as explained in the book “Spirit cooking with essential aphrodisiac recipes,” notes Mike Cernovich. The revelation that John Podesta, Hillary Clinton’s campaign chairman, is presumably interested in weird, gory occult ceremonies was too juicy for even Wikileaks to ignore. “The Podestas’ “Spirit Cooking” dinner? It’s not what you think. It’s blood, sperm and breastmilk. But mostly blood,” the organization tweeted. Some are even linking the spirit cooking revelation to claims that the Podesta emails contain “code for child sex trafficking” that is hidden behind mentions of types of food. Others are connecting it to Laura Silsby , the missionary who was jailed for six months after her organization, New Life Children’s Refuge, attempted to smuggle 33 children out of Haiti into the Dominican Republic after the 2010 Haiti earthquake. Significant, if partisan, find showing how the Clintons supported child stealer Laura Silsby https://t.co/7nULjOgmzr pic.twitter.com/NCgsVWTF2W \\n— WikiLeaks (@wikileaks) November 3, 2016 Wikileaks emails reveal that Hillary’s top aide Huma Abedin forwarded numerous articles about New Life Children’s Refuge to Clinton. “Julian Assange claimed that the Wikileaks would send Hillary Clinton to prison,” writes Cernovich. “The releases initially disappointed many people, this reporter included, as the evidence of corruption was slim. Assange was right. The real story was hidden in view.” While the child trafficking and pedophile connections to Clinton remain unproven, the fact that her campaign chairman is apparently into spooky occult rituals involving menstrual blood and semen is easily one of the most disturbing Wikileaks revelations to date. source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742561903.203949}