{"duration": 0.023137331008911133, "input_args": {"text": "'Thu, 27 Oct 2016 14:20 UTC © Andrew Cullen / Reuters Fracking has been banned in Maryland since last year, but next year\\'s proposed regulations jeopardize the moratorium. While the planned regulations are strict, they would allow fracking - a practice which is opposed by the majority of voters. Maryland has a year until its moratorium on fracking expires, but voters are already being asked to consider new rules on the controversial practice. Those rules would introduce heavy regulations but leave room for the possibility to allow fracking. A statewide poll taken by OpinionWorks found that 56 percent of Maryland voters would support a complete, statewide ban on fracking. Fracking is the method of pumping water and various chemicals deep underground in order to extract natural gas. Only six percent of the voters in the Maryland poll believe fracking comes without any risks. The risks of fracking are still being studied and were part of the two-year moratorium issued in 2015. A study by the state\\'s Department of Environment is expected to show the potential impact of fracking, then use those factors to develop industry guidelines. The department has until the end of the month to finalize its proposed regulations. With only 28 percent of polled voters opposing a complete ban on the practice, some Maryland politicians are looking to pass laws that would make the ban on fracking permanent. In September, State Senator Robert Zirkin (D-Baltimore County) told The Washington Post that he would push for a complete ban, saying \"there is only one answer, and that is to ban fracking in the state.\" \"If at some point in the future it is absolutely foolproof safe, then we can have another discussion,\" Zirkin added. \"But as of 2016, multiple states have done this, and all of them have seen bad results.\" Other state lawmakers have kept their efforts local by trying to create small government regulations that would keep fracking out of their counties. Prince George\\'s County banned the practice explicitly last spring, while Montgomery County effectively banned it through a change in its zoning laws. Comment: The oil and gas industry is battling tooth and nail to continue fracking as more communities are taking steps to institute bans - and with good reasons:'"}, "time": 1742628607.6470716}