{"duration": 0.17713069915771484, "input_args": {"text": "'5 Secrets to Wu Wei, the Taoist Principle of Effortless Effort Nov 18, 2016 6 0 \\nAs we progress through the process of ascension, several stages occur. Among them is a shake-up which inspires an initial awakening, then the full realization of truth, followed by the development of discernment to ascertain a correct course of action. We wouldn’t try to ride a bicycle before building one, nor would we attempt to sail an ocean without a boat. When things get challenging in life, we can check to see if we are practicing Wu Wei in order to refine our actions. This is the art of effortless action as described in Taoist teachings. 1. No Action Doesn’t Mean ‘Nothing’ Happens \\n“ The Tao does nothing and yet nothing is left undone .” – Lao Tzu \\nWu Wei or 無為, translates from Chinese pinyin to mean “no-action” or “actionless action.” This is considered the ‘natural’ way to do things, as opposed to striving, opposing, and forcing, as well as lollygagging, or succumbing to complete inertia. When we are in alignment with the Source, or as Taoists call it, simply, the Tao, then we don’t have to ‘work’ at anything. This is not to be confused with doing nothing. The state of Wu Wei doesn’t give us an excuse to sit on the sidelines, observing life and critiquing others’ actions. Instead, it describes the inspired action of a person who is brimming with life energy, and that has dedicated their actions to a purpose which supports Oneness. This person does not waste energy, though, and moves only when the time is right, and then, with magnificent acumen, and seemingly magical support behind them. \\nThe ancient ideograms and symbols used in the Chinese language and culture offer the most simplistic way to describe wu wei. We can observe this is the simple yin yang symbol. One side is active, or masculine, representing the energy of extending oneself into the world, and the other side of the symbol is passive, or more accurately, receiving, or feminine energy that causes an inward journey. \\nAll Chinese medicine, martial, and internal arts from Tai Chi to acupuncture to meditation aim to help balance the masculine and feminine energies, the doing and ‘not-doing’ you might say, as a way to achieve wu wei. 2. The Cosmos is Not Working Against You \\nWe aren’t sandwiched between heaven and earth, we ARE heaven and earth. To practice wu wei, we must first realize that we are connected to the Oneness of all things. Though we should have clear boundaries, like children given free rein to run and play within the confines of a beautiful park, we also should remain open to vulnerability and the lessons this may teach. Once we are open and protected we can begin to observe nature and embrace universal energy as it ebbs and flows. From there, we learn when to move with that energy – ebbing and flowing with our own actions in accordance with the Oneness of all things. An immense sense of freedom comes from knowing we don’t have to fight against the Cosmos, and understanding that it is never working against us – only we can choose to work against it’s flow. 3. Physical Action Isn’t the Only Action \\nAnother principle of wu wei involves quieting the ever-busy mind. Even if we aren’t ‘doing’ anything physically, often our minds are busier than ever. Wu wei means that we not only quiet the body and its actions, but that we aim to quiet the mind. Otherwise, we will have no idea if we are in Universal flow, or simply acting ‘busy’ out of the needs of the ‘ego,’ we so obsessively align ourselves with. \\nEven with our meditation practice, we are encouraged not to ‘try too hard.’ Perhaps you’ve seen a mind game that has been installed at several museums around the U.S.. Two people sit across from one another, and attach headbands equipped with electrodes to themselves. Between the players are a group of balls that can only be moved with the brain’s waves, measured as electromagnetic currents through the headband. If a player maintains a state of relaxed calm, essentially a combination of alpha and theta waves produced by the brain when it’s relaxed, then a ball moves up a tube and is placed in a bin. The player with the most ‘balls,’ wins after a certain period of time commences. Those who try too hard, fail, as do those who don’t try hard enough. The combination of alpha and theta waves created by a wu wei mind is what wins the game every time. \\nLao Tzu advises that we must be quiet and watchful, learning to listen to both our own inner voices and to the voices of our environment in a non-interfering, receptive manner. This requires a calm, but astute mind. 4. Being at One with the Tao Means Accepting Change \\nA key principal in Taoism, and the practice of wu wei involves the realization that there is an unceasing flow of change in nature. This change is governed by laws which are unalterable, and rarely perceived except by the most consciously evolved individuals. Fighting these laws of change would be a sisyphean task. Would you try to to stop the changing of the season or the rise and fall of the sun to the horizon? Once you observe this flow of change in nature, you can apply principles of wu wei to your own transformation. Since you are a part and parcel of nature, you will change accordingly. Why not move with that change instead of fight against it – perhaps you can even welcome change the next time it arrives at your doorstep. 5. True Wu Wei Involves Purposeless Wandering \\nZhuangzi refers to a type of being in the world that many of us have never considered. He calls it flowing, or more poetically “ purposeless wandering .” Most of our cultural values frown upon this type of being. If we have ‘no purpose’ we are often deemed pathological in the context of modern day living. Yet, it would be difficult to maintain that our current values have promoted harmony and balance, either environmentally or for each individual. \\nIn Zhuangzi’s Basic Writings , he states , “you can use the analogy of an artist or craftsman. The skilled woodcarver, the skilled swimmer. . . does not ponder or ratiocinate on the course of action he should take; his skill has become so much a part of him that he merely acts instinctively and spontaneously, without knowing why, and achieves success.” He further describes an enlightened person as being one who wanders through creation enjoying its delights without ever becoming attached to any one part of it. Vote Up Christina Sarich Christina Sarich is a musician, yogi, humanitarian and freelance writer who channels many hours of studying Lao Tzu, Paramahansa Yogananda, Rob Brezny, Miles Davis, and Tom Robbins into interesting tidbits to help you Wake up Your Sleepy Little Head, and *See the Big Picture*. Her blog is Yoga for the New World . Her latest book is Pharma Sutra: Healing The Body And Mind Through The Art Of Yoga .'"}, "time": 1742561916.9697173}