{"duration": 0.09189510345458984, "input_args": {"text": "'NTEB Ads Privacy Policy THE SMOKING GUN: WikiLeaks Emails Show Proof Positive Of Vast Clinton Foundation Corruption It is astonishingly detailed proof that the Clintons do not draw any lines between their “charitable” work, their political activity, their government jobs or (and most important) their personal enrichment. Every other American is expected to keep these pursuits separate, as required by tax law, anticorruption law and campaign-finance law. For the Clintons, it is all one and the same—the rules be damned. by Geoffrey Grider October 28, 2016 Grifters-in-Chief: The Clintons don’t draw lines between their ‘charity’ and personal enrichment. \\nIn an election season that has been full of surprises , let’s hope the electorate understands that there is at least one thing of which it can be certain: A Hillary Clinton presidency will be built, from the ground up, on self-dealing, crony favors, and an utter disregard for the law. \\nThis isn’t a guess. It is spelled out, in black and white, in the latest bombshell revelation from WikiLeaks . It comes in the form of a memo written in 2011 by longtime Clinton errand boy Doug Band, who for years worked simultaneously at the Clinton Foundation and at the head of his lucrative consulting business, Teneo. \\nIt is astonishingly detailed proof that the Clintons do not draw any lines between their “charitable” work, their political activity, their government jobs or (and most important) their personal enrichment. Every other American is expected to keep these pursuits separate, as required by tax law, anticorruption law and campaign-finance law. For the Clintons, it is all one and the same—the rules be damned. Trump: WikiLeaks Shows Clinton Foundation Corruption \\nThe memo came near the end of a 2011 review by law firm Simpson Thacher & Bartlett into Clinton Foundation practices. Chelsea Clinton had grown concerned about the audacious mixing of public and private, and the review was designed to ensure that the foundation didn’t lose its charitable tax status. Mr. Band, Teneo boss and epicenter of what he calls “ Bill Clinton, Inc.,” clearly felt under assault and was eager to brag up the ways in which his business had concurrently benefited the foundation, Clinton political causes and the Clinton bank account. The memoed result is a remarkably candid look at the sleazy inner workings of the Clinton grifters-in-chief. Rep. Sessions: Clinton Foundation’s fundraising tactics are criminal \\nThe cross-pollination is flagrant , and Mr. Band gives example after example of how it works. He and his partner Declan Kelly (a Hillary Clinton fundraiser whom Mrs. Clinton rewarded by making him the State Department’s special envoy to Northern Ireland) buttered up their clients with special visits to Bill’s home and tête-à-tête golf rounds with the former president. They then “cultivated” these marks ( Coca-Cola , Dow Chemical , UBS) for foundation dollars, and then again for high-dollar Bill Clinton speeches and other business payouts. Morning Joe Destroys Corrupt Clinton Foundation “Total Corruption” \\nTeneo’s incestuous behavior also included Mrs. Clinton’s State Department. The Band memo boasts that Mr. Kelly (while he was Mrs. Clinton’s State envoy) introduced the then-head of UBS Wealth Management, Bob McCann, to Bill Clinton at an American Ireland Fund event in 2009. “Mr. Kelly subsequently asked Mr. Mccann [sic] to support the Foundation, which he did . . . Mr. Kelly also encouraged Mr. Mccann [sic] to invite President Clinton to give several paid speeches, which he has done,” reads Mr. Band’s memo. UBS ultimately paid Bill $2 million. \\nAmerican Ireland Fund meanwhile became a Teneo client, and made Mr. Kelly (of former State envoy fame) a trustee, where he “ensured that the AIF is a significant donor to the Foundation.” AIF then bestowed upon Mrs. Clinton a major award on her final trip to Northern Ireland in 2012, in an event partly sponsored by . . . Teneo. \\nNot that this is all one way. Mr. Band let slip just how useful all these arrangements were for Teneo, too, when he backhandedly apologized in the memo for hosting 15 client meetings in a hotel room rented by the Clinton Global Initiative. \\nThe memo removes any doubt that the foundation is little more than an unregistered super PAC working on the Clintons’ behalf. Donors to the charity are simultaneously tapped to give Bill speech requests and other business arrangements, including the $3.5 million he was paid annually to serve as “honorary chairman” of Laureate International Universities. Mr. Band’s memo also notes his success at getting donors to “support candidates running for office that President Clinton was supporting.” It’s now 2016 and Bill’s most favorite candidate is running for the presidency. There’s no question foundation donors are being “leveraged” for Mrs. Clinton. \\nMr. Band wants credit in the memo for prodding existing foundation donors to pony up more money, though the donation statistics he provides paint a different picture. By and large, donations to the foundation begin to spike dramatically in 2009 and 2010. Mr. Band didn’t form Teneo until 2011. What was happening in 2009? Mrs. Clinton was sworn in as one of the most powerful politicians on the planet. The Clinton Foundation takes money from countries that deny rights to women: \\nThe obvious question is where are the prosecutors? (For that matter, where is Lois Lernerwhen you need her?) Any nonprofit lawyer in America knows the ironclad rule of keeping private enrichment away from tax-exempt activity, for the simple reason that mixing the two involves ripping off taxpayers. Every election lawyer in the country lives in fear of stepping over the lines governing fundraising and election vehicles. The Clintons recognize no lines. \\nHere’s the lasting takeaway: The Clintons spent their White House years explaining endless sleazy financial deals, and even capping their exit with a scandal over whether Bill was paid to pardon financier Marc Rich. They know the risks. And yet they geared up the foundation and these seedy practices even as Mrs. Clinton was making her first bid for the presidency. They continued them as she sat as secretary of state. They continue them still, as she nears the White House. \\nThis is how the Clintons operate. They don’t change. Any one who pulls the lever for Crooked Hillary Clinton takes responsibility for setting up the nation for all the blatant corruption that will follow. source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742562289.1204786}