{"duration": 0.03179049491882324, "input_args": {"text": "'Unconfirmed reports of gunfire at Los Angeles International Airport on Sunday caused panic in the airport and on social media as passengers fled outside and the police raced to respond. About an hour after the first panicked reports appeared on social media, Andy Neiman, a spokesman for the Los Angeles Police Department, wrote on Twitter that the reports had been caused by “loud noises only. ” Terminals 1, 2, 3 and 5, as well as the Tom Bradley International Terminal, were evacuated by the police, the airport said. There was a “self evacuation” from Terminal 4, said Rob Pedregon, a spokesman for the airport police, who referred to those who fled as “panicked passengers. ” The airport said in a statement that it had closed several levels of its central terminal area, though it had not confirmed the reports of shooting. The episode was remarkably similar to one that occurred two weeks earlier, when unconfirmed reports of gunfire at Kennedy International Airport in New York led the police to evacuate two terminals there, causing hysteria among passengers whose fears were exacerbated by unconfirmed reports spread on social media. Video from the airport posted to social media from Los Angeles on Sunday showed travelers running outside the airport as police cruisers rushed by in the opposite direction. The interior of the terminal appeared to have been abandoned by civilians as the police searched for any sign of a shooter. Just as at Kennedy, the fear felt by travelers in Los Angeles was a reminder of recent attacks at airports in Istanbul and Brussels, and the way those episodes can prompt a panic response to the threat of violence in public spaces. Responding to the episode at Kennedy, Senator Charles E. Schumer of New York asked last week that the Department of Homeland Security conduct a formal investigation. “In the age of     terror attacks, it is a national priority to make sure targets, like our airports, are best prepared to recognize, diffuse and professionally handle the very real threats that confront us,” he said.'"}, "time": 1742628595.9504113}