{"duration": 0.07731986045837402, "input_args": {"text": "'10,300 10,300 likes \\nUnreal! We live in fascinating, exciting times, brothers! \\nOther such public actions of retribution have coincided with this(ie CNN actually firing Donna Brazile for being a despicable hack). These are remarkable turnarounds, but what could be behind this? If the democratic leadership is turning on Hillary, why would they do this? What’s their reasoning for doing so? What’s in it for them? Well, the answers would surprise many, but are logical if thought through. \\nSaving Face and Saving Brand \\nHillary Clinton is a sociopathic criminal, guilty of treason, mass murder for profit, and lining the pockets of globalists at our expense. We know that folks like us, in the Alt-media, and #AltRight etc all know that…but the “blue-pilled”, “normie” public, has, up until this point…not known that! \\nAll these O’Keefe, Wikileaks, and whistleblower revelations about Hillary and Washington DC are news to tens of millions of people. Some still haven’t heard this news, others still shockingly don’t care…but it doesn’t matter now. \\nToo many now know who she is and how the system works, and the FBI and others will find overwhelming evidence of criminal wrong-doing on Hillary now(yes, even with Podesta’s DOJ friend in charge of it). The woman would likely be impeached within months of being in office, which if this occurred, could even bring about a Constitutional crisis. The fallout of this would tarnish the brand of the Democratic party beyond recognition. \\nBill Mitchell, a pro-Trump pollster and commentator on Twitter(whom I recommend you follow @ mitchellvii ) has some thoughts on the matter which are close to my own. It is highly possible that Democrat leadership has largely decided that Trump winning would be a “lesser evil” for them, than a POTUS Hillary. If Hillary is entangled in this situation for most of her first term, the fallout from Obama, followed by a criminal like her would be the “One-two” punch that their party wouldn’t recover from. \\nIt could very well be that they believe Trump will be ineffective as POTUS, or could be rendered such by skillful opposition. In their minds, under a one-term, lame-duck Trump Presidency, with few promises being met to his constituency, and a worsening economy, their party would be set to counter-attack with a stronger candidate in 2020. \\nNot only would this put them on better footing to blame a candidate from the GOP side, for the mess the country is in, but it could actually save their party and their brand. It is highly likely many are considering “cutting their losses”, and settling for stopping President Trump in 4 years’ time. \\nRemember, VP Joe Biden himself, went from saying he’d “like to fight Trump behind the woodshed”, to actually saying he’d work with a President Trump if he wins. \\nHuge change in tone, folks. These people see the writing on the wall… \\nConclusion \\nElection 2016 has been absolutely incredible: the constant Assange whistle-blowing on DC corruption, the oppo dumps, the truth-telling about Hillary’s crimes, the candidates themselves, the enormous poll swings, the under-cover stings from O’Keefe, etc…. \\nNothing has ever been seen like it. \\nLet’s face it brothers: if this election was a movie, no one would believe it! Too many twists and turns! \\nAt this point however, there are signs that much of the Democratic leadership near the top may have decided that a Hillary Presidency may tarnish their brand too badly. They wrongly believe that a Trump administration could be effectively opposed, and put them on solid footing for a 2020 White House bid. They believe they could survive a Trump Presidency better than a Hillary one, at this point. \\nDemocratic (and even Republican) opposition have emptied every clip at anti-fragile Donald since he announced his Presidential bid, but it now appears though, that the Democratic opposition has run out of ammo! \\nNow they’re throwing their empty guns at him for the last 7 days, hoping for a miracle! \\nThis man, who Donald Trump has come out of nowhere, has wrecked the criminal Bush family, and is now inches away from wrecking the criminal Clintons as well. Forever. \\nHe’s done it while being pummeled by the MSM, and backstabbing traitors within his own party. He’s stalked and hunted them all relentlessly, and has turned the majority of the people against them, and against globalism…in just 18 short months. \\nNone have been able to stop him. It has been one of the most remarkable things I’ve ever witnessed, and gives me great hope that our foes, these globalist banksters, technocrats, International Zionists, and every foe of the West, is much weaker than we ever thought possible. \\nJust think: \\nIf CANDIDATE Trump has been able to do all this in just 18 months, what kind of utter, nightmarish carnage could PRESIDENT Trump bring down upon neo-liberal globalism? \\nI believe we’re all about to find that out!'"}, "time": 1742562981.0032558}