{"duration": 0.16543817520141602, "input_args": {"text": "'. Why Flu Shots Are the Greatest Medical Fraud in History As one of the very few independent voices willing to stand up against the scientific dogma of our mo... Print Email http://humansarefree.com/2016/10/why-flu-shots-are-greatest-medical.html As one of the very few independent voices willing to stand up against the scientific dogma of our modern medical regime, I\\'ve long felt a need to communicate the dangers of flu shots to the public so that people can have better information to prevent vaccine injuries and save lives. This doesn\\'t mean I\\'m opposed to the theory of vaccination, by the way. In fact, I\\'m the author of A Blueprint for Safer Vaccines , an audio guide to saving lives and preventing vaccine injuries and deaths. To my knowledge, I\\'m the only independent journalist in the world who is scientifically trained to run an atomic mass spectrometry laboratory, which I\\'ve been running for nearly a year now and testing the heavy metals content of organic superfoods like cacao , common vaccines as well as the ability of water filers to remove toxic heavy metals . I\\'m the creator of the Low Heavy Metals Verified standard and I\\'m the inventor of patent-pending nutritional formulas for capturing heavy metals during digestion and binding with the radioactive isotopes of cesium (such as Cesium-137) to eliminate them from the digestive tract.Both of these patents are on file with the U.S. patent office awaiting a decision. My independent atomic elemental analysis of flu vaccines, published in the summer of 2014, proved that flu vaccines contain over 50 ppm mercury, an extremely toxic heavy metal linked to kidney failure, birth defects, spontaneous abortions and neurological damage. This finding has never been refuted by anyone. In fact, it was affirmed by vaccine proponents who insisted that it is perfectly safe to inject pregnant women, young children and senior citizens with mercury even though the flu vaccine insert itself readily admits there is no scientific evidence whatsoever to support the safety and efficacy of the vaccine in such groups. Believe it or not, there are still millions of people, doctors, pharmacists and even journalists who do not yet realize there is a very high concentration of mercury in influenza vaccines given to pregnant women, children and senior citizens. Most people, you see, have been lied to by the media which has stated over and over again that mercury was removed from all vaccines. That\\'s simply not true. It\\'s still there. And toxic mercury is present in influenza vaccines at a level that\\'s literally 25,000 times higher than the EPA limit of mercury in drinking water. [7] It\\'s 100 times higher than the highest level of mercury contamination I\\'ve ever tested in ocean fish. See the evidence for yourself To prove the presence of mercury in influenza vaccines, I\\'m going to show you four irrefutable pieces of evidence: 1) Photographs of a 2013 / 2014 influenza vaccine box admitting, in very small print, to the addition of mercury to the vaccine as a preservative. 2) Photographs of the influenza vaccine insert once again repeating the admission that the vaccine contains mercury. 3) A screen shot from the Centers for Disease Control website which admits that vaccines still contain the following ingredients: Aluminum, Antibiotics, Egg Protein, Formaldehyde, Monosodium Glutamate (MSG) and Thimerosal, a mercury-containing chemical compound. 4) Lab results from the Natural News Forensic Food Lab which confirmed almost precisely the same level of mercury claimed by the manufacturer (GlaxoSmithKline). Before I show you the irrefutable evidence, there is some good news in all this testing. As part of this Natural News investigation, I tested several different vaccines, including an HPV vaccine. Mercury levels were extremely low in these other vaccines. Only the flu shot contained extremely high mercury levels. Influenza vaccine box admits safety never established for pregnant women As you can see below, the box for this Flulaval Influenza Virus Vaccine readily admits the use of thimerosal which contains mercury. (Of course, you have to use a magnifying glass to see this.) In microscopic text on the package insert, it says straight out, \"Register women who receive Flulaval while pregnant in the pregnancy registry by calling 1-888-452-9622.\" Yet, at the same time, the insert also admits that \"safety and efficacy have not been established in pregnant women.\" In other words, this vaccine containing mercury is being promoted for use in pregnant women even when no safety in pregnant women has ever been established. It\\'s also important to note that when people are being given flu shots, they are never handed the package or the insert, so they have no opportunity to read any of this information unless they specifically ask for it. It\\'s not like a food item with a \"Nutrition Facts\" label. Vaccines are sold in \"stealth\" mode where patients have no idea what\\'s in them and no opportunity to read possible warnings. As further proof of this point, consider the fact that this flu vaccine comes with only one insert, yet it\\'s a 10-dose vial intended to be injected into 10 different people. Clearly, if there\\'s only one insert but 10 people, then 9 out of 10 people can\\'t possibly be handed the insert. Unethical medicine administered without informed consent (a violation of medical ethics) In fact, from a legal perspective, vaccines are routinely injected into people without informed consent. Virtually no one administering vaccines ever explains the risks vs. benefits of vaccines as is required under medical ethics and state medical law. In nearly all cases, patients are simply hoodwinked and told there are no risks at all. The second piece of evidence to reveal here is the package insert for the influenza vaccine, a document printed in microscopic text that\\'s almost impossible to read without a magnifying glass. Of course, the intention is that no one ever read this document, because it contains shocking admissions of the total quackery and marketing deception behind flu shots. As you can see from this snapshot, the package insert readily admits that each vaccine dose \"contains 50 mcg thimerosal (<25 mcg=\"\" mercury=\"\" p=\"\"><25 br=\"\" mcg=\"\" mercury=\"\">In case you\\'re wondering, \"mcg\" means micrograms. A microgram is 1/1000th of a milligram. Mercury is toxic at any dose when injected into the body, even in micrograms. There is no such thing as a \"safe\" form of mercury when injected. In fact, the ethyl form of mercury used in vaccines is many times more toxic than methyl form once it enters human cells. Click here for a fascinating interview with mercury toxicity expert Dr. Chris Shade who explains this extremely important concept.The same paragraph shown above also admits the vaccine contains formaldehyde, a potent neurotoxic chemical. Vaccine insert admits safety and effectiveness have never been established <25 br=\"\" mcg=\"\" mercury=\"\">What\\'s even more astonishing about this insert is that it openly admits the flu shot is a complete medical hoax, backed by nothing but voodoo woo woo faith-based dogma (and clever marketing).Here are actual words from the insert (which is much more lengthy than the snapshot shown above):\"There have been no controlled trials adequately demonstrating a decrease in influenza disease after vaccination with Flulaval.\"\"Safety and effectiveness of Flulaval have not been established in pregnant women, nursing mothers or children.\"\"Safety and effectiveness of Flulaval in pediatric patients have not been established.\"\"Flulaval has not been evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.\"\"Do not administer Flulaval to anyone... following previous administration of any influenza vaccine.\"CDC admits use of mercury, MSG, formaldehydeFor those \"mercury denialists\" who still can\\'t believe flu shots given to pregnant women contain high concentrations of toxic mercury, even the CDC reluctantly admits this fact on its own website.Here\\'s a screen shot from the CDC\\'s vaccine additives page , which miraculously hasn\\'t yet been removed from their site:<25 br=\"\" mcg=\"\" mercury=\"\"> Laboratory results from the Natural News Forensic Food Lab The final piece of irrefutable evidence on all this comes from my own scientific laboratory , where I run ICP-MS instrumentation to test foods, beverages, dietary supplements and other items for heavy metals contamination.I was the first food researcher to document high levels of tungsten in brown rice protein , and I\\'ve exposed alarming levels of lead in pet treats . I\\'ve also exposed high lead in ginkgo biloba herbal supplements imported from China .When I finally got around to testing vaccines, I was shocked to find over 51,000 ppb mercury in the Influenza Virus Vaccine.Why was I shocked? Because I don\\'t recall ever seeing anything run through my ICP-MS instrument with that high a concentration of mercury. The mercury in this flu vaccine was the HIGHEST concentration of mercury I\\'ve ever seen in anything, period! And this is a product that\\'s injected directly into the bodies of pregnant women, where mercury goes right into the developing fetus.What\\'s even more interesting is that this finding once again confirms the accuracy of my lab instrumentation because it\\'s almost in perfect agreement with the level of mercury detailed on the vaccine package insert.Let\\'s do the math:* Each dose of an influenza vaccine is 0.5 mL in volume* My lab found just over 50 ppm of mercury in the vaccine liquid.* 50 ppm (concentration) x 0.5 mL (volume) equals 25 mcg of mercury.Guess what the package insert says? (Up to) 25 mcg of mercury per dose. Near-perfect agreement, in other words. My finding of 51 ppm rather than 50 ppm either means my own tests were off by about 2% (which is still considered very accurate for ICP-MS testing) or that GSK put 2% extra mercury into the vaccine.And just so you know I actually did the tests, here\\'s what else we found with other analytes:Aluminum: 0.4 ppmCadmium: zeroLead: zeroSo, I can confidently say that the flu vaccine won\\'t poison you with lead, cadmium or arsenic because it contains none of those things. Even the aluminum level is quite low and not a concern at this very low level. The real problem is just the mercury, at least as far as elements go. Why won\\'t vaccine makers remove the mercury? Good question. Everybody knows mercury is toxic to inject into the human body. That\\'s not debated except by irrational anti-science denialists who refuse to acknowledge the Table of Elements.You have to wonder: why choose mercury as a preservative? And why do both the CDC and FDA continue to look the other way as an entire branch of modern medicine poisons our women and children with a neurotoxic heavy metal?And if vaccine promoters, propagandists and patent holders want the world to accept all their vaccines, why don\\'t they just remove the mercury and be done with it? If they take out all the toxic elements, resistance to vaccines would all but evaporate.Why vaccines are the \"anti-science\" medical voodoo of the modern worldEver wonder why they don\\'t conduct legitimate clinical trials on flu vaccine efficacy? Probably because they know the results would have to be faked to show any efficacy at all. That\\'s what Merck did with its mumps vaccines, according to two former virologists who worked there. They spiked human blood samples with animal antibodies to fabricate positive results. Yep, vaccines work so poorly that even the manufacturers have to fake their own results to show any efficacy.Vaccines are the one medicine where no scientific evidence of safety or efficacy is required by anyone: not the FDA, not the CDC and not the media. Congress even passed a law protecting the vaccine industry with absolute legal immunity, even when they manufacture and sell defective products that injure and kill people . How\\'s that for medicine we can all trust? Think about it: this is a product that contains multiple neurotoxins in very high concentrations; a product backed by no safety trials or efficacy data; a product linked to numerous serious adverse reactions; and yet a product that enjoys absolute legal immunity thanks to the U.S. government.If that\\'s not outright medical quackery, I don\\'t know what is.For the record, I\\'m not an opponent of all vaccines. But I do believe -- as do a rapidly increasing number of other clear-thinking people -- that medicine should not poison our women and children . It\\'s time for mercury to be removed from all vaccines, once and for all. Anything less is medical negligence. New video interview about flu shot failures Ultimately, We the People will be victorious in the removal of mercury from all vaccines -- an idea that\\'s already well accepted across much of Europe. And when that day comes, it will be yet another victory for the Natural News fan base, an amazing community of millions of remarkable people working together for the protection of our children, our health and our world.See my recent video interview with Next News Network\\'s Gary Franchi on why flu shots are failures: By Mike Adams , author of Food Forensics   Related'"}, "time": 1742628339.2668054}