{"duration": 0.06740140914916992, "input_args": {"text": "'Chicago Mayor Rahm Emanuel has moved forward with plans for a   identification card specifically designed to ensure illegal aliens in the city can receive welfare benefits with minimal risk of repatriation. [The new program was unveiled at a Chicago City Council meeting on Wednesday, and it protects illegal aliens from federal oversight by not collecting any copies of identification documents presented when illegals apply for the identification card.  “Applicants bring in the documents to prove someone’s identity. They hand them over to specially trained individual who can review the documents and then hand them back   …     It’s going to capture just the name and the date of birth. It’s not going to capture an address,” a source close to those officials told the Chicago  . Emanuel, once President Barack Obama’s Chief of Staff, has been one of the loudest voices decrying Attorney General Jeff Sessions’s efforts to cut off federal funding for sanctuary cities like Chicago that refuse to cooperate in the enforcement of immigration laws. The “Municipal ID” plan is Emanuel’s latest bid to resist the effort of the Justice Department and remain what he has called a “welcoming city. ” Emanuel’s new City Clerk Anna Valencia’s website describes the Municipal ID as “an optional, valid,   ID that they can then use to access a range of services from both the private and public sectors. ” In addition to ensuring access for illegals to government programs, the Clerk’s Office also claims to be “working with cultural institutions, sports teams, pharmacies, local chambers of commerce and community organizations to explore potential discounts and partnerships. ” The scheme is specifically designed not only to allow illegals to obtain the cards, but to avoid collecting data that could be used by U. S. Immigration and Customs Enforcement to discover aliens in the country illegally. Chicago is apparently looking to a model pioneered in San Francisco to frustrate ICE efforts. “Applicants bring in the documents to prove someone’s identity. They hand them over to specially trained individual who can review the documents and then hand them back   …     It’s going to capture just the name and the date of birth. It’s not going to capture an address,” a source close to those officials told the Chicago  . While city officials will make no effort to ascertain if recipients of the new ID are committing a crime by being in the United States, they will ensure that the gender with which they most strongly identify will be properly documented. “Applicants will also be able to   their gender, which will be huge to the transgender and LGBTQ community. And it’s not just for undocumented individuals,” the same source said. The   also reported that the Municipal ID program itself will cost Chicago taxpayers $1 million in its first year of implementation.'"}, "time": 1742564016.4238172}