{"duration": 0.23044991493225098, "input_args": {"text": "\"Media skeptic If Russia Wanted to Fight the West, It Would Have Invested More in Arms \\nDespite the screaching over Russia's old cold war-era Kuznetsov putting to sea, it really just shows Moscow never planned for a conflict with the west   New Eastern Outlook \\nHysterics are the western leadership’s most effective weapons against imaginary Russian foes. Or are imaginary Russian foes the cause of idiotic hysterics by western leaders? Whatever the case, it’s easy to get confused these days. Black is white, truth is a lie, Russia a friend or a foe, today the only certainty is more uncertainties and warmongering. Russia’s sailing a rusty aircraft carrier to Syrian waters is sure to cause an international arms race now. Is Putin’s Russia bent on attacking Europe by Sea, or is NATO fomenting another blood ritual? \\nI often chuckle at the stupidity of “so-called” experts, especially reporters. However silly and uninformed western media parrots may be though, the idiocy of NATO member countries’ leadership is more ridiculous by far. Take the example of Russia sending a small task force of its Northern Fleet to stand-off Syria in the eastern Mediterranean. The media in Britain, for instance, reports on a naval buildup akin to the Spanish Armada, while Brit citizens line the cliffs of Dover to photograph the elegant (if aged) profile of a gray lady Russian aircraft carrier sliding by. Just looking at the imagery brings to mind seafaring lore attached to a once indomitable Soviet naval presence. On the other hand, naval warfare aficionados could be sad, watching what’s left of Russia’s mighty surface fleet lumber onward to assist in killing terror. I cannot decide which element of this latest development is more pitiful, the European hysteria over Russian navy pieces on the move, or the fact a remnant of Cold War days is rusting to pieces. \\nWhen elements of a naval group headed by Admiral Kuznetsov, Russia’s only aircraft carrier, left the port of Severomorsk at 3:00 p.m. Moscow time (12 noon GMT) on October 15 for the eastern Mediterranean, scant news of the departure could be found. Then when Russia’s lone carrier and the the battle cruiser Peter the Great neared England, all media hell broke loose. Frothy waves of reporters employed by BBC, Rupert Murdoch’s ilk, and the propaganda nests of NATO went collectively bonkers over 8 ships sailing by Dover like old ducks in a shooting gallery. The Swedes and Norwegians were the first to sound “General Quarters” over the aging fleet’s passing. Norwegian media outlet VG.no called the Russian naval group’s cruise “the biggest demonstration of Russian military power” in recent years. And Sweden shadowed the vessels like yapping little terriers on the scent of some dying old bear. The hype and bullshit turned razor sharp idiotic once the small flotilla neared the English Channel, and nobody, nobody portrayed the story as it was. No one told viewers or readers the Kuznetsov has been in seawater 31 years now, and having spent 20 of those at the tail end of military funding. More importantly, the NATO-EU media failed to tell us this is the ship’s fourth deployment to the Med, or that she had previously laid off Scotland for refueling and replenishment during another deployment. No, this sailing is being built up into a Russian armada and a Putin provocation instead of what it really is. \\nRussia’s military might is not contingent on its navy, it never was. While projecting power from mother Russia was a necessity in the Cold War, the world’s biggest country has always been defensive. This is unarguable, and a matter of historic fact. Secondly, Russian naval prowess was never focused on surface warfare, but on ballistic submarine counter-deterrent. This is another reason her lone carrier stands a better chance of springing a leak and sinking, than being torpedoed by a British submarine. Putin has sent this group to Syria for more practical reasons than any media is telling us, the ships are part of the most economical way to finish off ISIL, even in a rusty bucket state of repair, they serve as anti-air and ground attack platforms, as well as amphibious warfare elements if the need arises. But let’s get down to brass tacks here. \\nWhile the United States does possess a couple of so-called “Supercarriers” as old as the Admiral Kuznetsov, the availability of paint and varnish in the US Navy is supported by 1000 times the budget of the Russian Navy’s long counterweight. This US Navy budget (PDF) for FY 2016 details a navy with 11 super-carriers and a maintenance budget in excess of $9.4 billion for a baseline, this does not address refurbishments. On the other hand Russia’s entire military budget ($68.2 billion 2013) is less than one third that of the US Navy alone. While the hysterical whining from NATO generals grows loud, this is only to create a bigger festering wound in between NATO members and Russia. \\nFinally, despite the Kuznetsov’s unseaworthy and arthritic existence, the larger strategy from Putin is what’s more interesting here. A paid troll of a western media reporter named Michael Weiss, writes for the Daily Beast and for ousted Russian oligarch (slash mobster) Mikhail Khodorkovsky. I mention him because he has a penchant for mixing an ounce of truth with a pound of anti-Putin bullshit, and because he recently commented on “Russia’s sinking fleets”. As lacking as the Russian navy is though, sending a battle group to Tarsus and Syria is the correct strategy. And it is THIS that has NATO peeing its pants. Not many realize that a big objective of the Ukraine-EU ascension was to eliminate Russia’s only warm weather port in the south, at Crimea. Russian naval power, in open waters in the southern regions of Europe, it’s a strategic nightmare for the NATO alliance. So rust bucket or not, the Kuznetsov group are valuable chess pieces Putin had to commit to this operation. Make no mistake though; the movements were not intended as a provocation or saber rattling, but rather a move of necessity. \\nThe sailing of the Admiral Kuznetsov and these other ships proves once and for all Russia’s defensive posture historically, and with regard to recent events. Please understand, Russia has never been, is not, and probably never will be a major naval threat to the United States. With the exception of her ballistic missile submarine deterrent, Russia’s sole military objective has always been defending the motherland – period. The US and allies have surface and submarine fleets that quite simply dwarf Russian and Chinese naval power, but here’s the thing. The Admiral Kuznetsov, and in particular the “battlecruiser” aspects of her design, are fuel for an unnecessary alarmist view from the likes of NATO’s Secretary General Jens Stoltenberg. Even the capability of the accompanying nuclear powered battlecruiser Pyotr Velikiy, and the two Udaloy Class Destroyers can only be considered defensive by nature. Mr. Putin is only defending his country’s servicemen already engaged in the air war in Syria, and his country’s southern borders in the event of a wider NATO aggressiveness. With talk of a Hillary Clinton White House seeking a “no fly” zone over Syria, the Russians would be stupid not to sail these ships to serve as a first line of defense. \\nNATO, the White House, the houses of leadership in Europe have now seized upon a situation they caused in the first place. Russia as the aggressor, given all that we have seen since the fall of the Berlin Wall, it’s just a comedy. The United States and her allies (satraps) have invaded, or outright overthrown governments around the world, and now Russia is aggressive for protecting her closest interests? An aircraft carrier from the Reagan era sent out alone to conquer the world? Nobody in their right mind could believe this. CNN is calling the move “Heavy Metal”, and The Mail calls the vessels “Nuclear Battleships” to garner readership, while another article speaks of “Putin’s Satan II” killer missile with it’s 40 megaton payload. But no media outlet depicts the real situation. No news reflects who has really been building up arsenals for a potential war. The United States has increased in multiplicity systems aimed not at conflicts with Arab lands, not in defense against global terror, but for engaging more powerful foes. When the sole Russian aircraft carrier Admiral Kuznetsov was sitting in port collecting barnacles and rust the last 15 years, American companies planned and cranked out devastating new weapons. The trillion dollar F-35 can’t fly well yet, but sooner or later it will. The Gerald R. Ford super-carriers may have design flaws, but they were planned long before Russia reemerged as any advertised threat back in 2005. There are 100 examples of an ongoing US military buildup meant aimed at Russia and China, but Congress makes no secret of the US mission with regard to armed superiority, as this Congressional Research Service paper from September, 2016 shows: \\n“The U.S. goal of preventing the emergence of a regional hegemon in one part of Eurasia or another is a major reason why the U.S. military is structured with force elements that enable it to cross broad expanses of ocean and air space and then conduct sustained, large-scale military operations upon arrival. Force elements associated with this goal include, among other things, an Air Force with significant numbers of long-range bombers, long-range surveillance aircraft, longrange airlift aircraft, and aerial refueling tankers, and a Navy with significant numbers aircraft carriers, nuclear-powered attack submarines, large surface combatants, large amphibious ships, and underway replenishment ships.” \\nNow my point seems well made. Had Vladimir Putin and Russia been intent on taking over the world, Military developments beyond the new Armata T 14 tanks, fifth generations fighters and some missiles would have been ramped up long before now. It’s crystal clear to the keen observer that Putin’s Russia was in infrastructure and economy building mode up until Senator John McCain played cheerleader for the Ukraine revolution in Kiev. Today, with NATO posturing on every Russian frontier, Vladimir Putin is making the best use of what his nation has in order to defend against the unthinkable. This is the truth of these matters. \\nAnd still the blood ritual is drummed out before the campfires of Europe – the big bad wolf, or a giant Russian nemesis is out to take over a bunch of poverty-refugee-economic stricken countries for what? So that Russia can once again prop up Eastern Europe? So Vladmir Putin can reign supreme over a rusty Eiffel Tower? What is there in Europe the Russians need so desperately, after all? Shopping malls and Christmas markets must be the coveted lure, for there’s certainly no natural resources left to squander. \\nMaybe the people in the west should consider all this?\""}, "time": 1742563587.0581353}