{"duration": 0.05780625343322754, "input_args": {"text": "'The United Arab Emirates warned its citizens on Sunday to avoid wearing traditional clothing when traveling abroad, apparently in response to an episode in Ohio last week in which a businessman from Abu Dhabi, dressed in robes and a head scarf, was confronted by the police at gunpoint because a hotel clerk thought he might be a terrorist. The businessman was identified as Ahmed   41, by the Cleveland chapter of the Council on   Relations. Relatives of a front desk clerk at the Fairfield Inn and Suites in Avon, Ohio, called 911 on Wednesday to report that the clerk had panicked after seeing a man in robes and “full head dress” in the hotel lobby, speaking on a phone and “pledging his allegiance or something to ISIS. ” Officers rushed Mr. Menhali outside the hotel with guns drawn, pinned him to the ground, handcuffed him, searched his clothes and wallet, and took off his shoes to check his feet. Police   video of the encounter shows Mr. Menhali, who appeared to speak limited English, saying: “What is this?” “I’m tourist,” and “Not good,” while he was on the ground. The Avon Police Department released audio and video of the episode to the news media, and the recordings were uploaded to YouTube. About 10 minutes into the encounter, as the likelihood of any arrest appeared to dissipate and Mr. Menhali was allowed to stand up, he collapsed on the pavement. An ambulance took him to St. John’s Medical Center, the police said local news reports said he had been treated for minor injuries and released. The warning from the Emirates government coincided with heightened security alerts in cities around the world after deadly terrorist attacks in Iraq, Bangladesh and Turkey further raised fears about the global reach of terrorism. The Ohio episode, however, raised questions about the intense police response to a report of a man in Middle Eastern dress standing in a hotel lobby, speaking on a cellphone. The Avon Police Department said in a statement that no weapon was found on Mr. Menhali. The police said after officers interviewed the hotel clerk, they concluded there had been a “clear miscommunication” with her relatives, and that Mr. Menhali had not made “any statements related to ISIS. ” The police said the episode was being investigated, and the findings would be forwarded to the prosecutor’s office for review. Julia A. Shearson, the executive director of the Cleveland chapter of the Council on   Relations, said in an interview Sunday: “It is shocking this happened. The bottom line is we understand the American people are on edge, and there’s definitely violence in the world, but we’ve come to this brute level of giving in to our fears. ” Ms. Shearson also told The Independent that the way the police referred to Mr. Menhali’s clothing in their report  —   “as a criminal indicator”  —   was “very concerning. ” In a statement Monday, Marriott International, which owns the Fairfield Inn and Suites, said that it “deeply regret” what happened to Mr. Menhali. The company said it planned to discuss with the hotel “diversity and inclusion training designed to help prevent this type of situation. ” Avon officials apologized to Mr. Menhali Saturday night at the council’s Cleveland office. The mayor, Bryan K. Jensen, told Mr. Menhali, “There were some false accusations made against you, and those are regrettable. ” The chief of the Avon police, Richard Bosley, said, “You should not have been put in that situation like you were. ” The United Arab Emirates ambassador to the United States, Yousef Al Otaiba, said in a statement on Tuesday that he had met with Mr. Jensen and had received his personal apology. In a phone interview on Sunday, Mr. Jensen described the episode as “frustrating on our end” because “it could’ve been tragic. ” “Guns were drawn,” the mayor said. “When you make a false accusation, you put that person’s life in danger. ” Mr. Menhali, he added, “was 100 percent innocent. ” Mr. Jensen said he had no problem issuing the apology because he was reminded of being teased as a child because his father, Niels, who immigrated from Denmark, spoke little English. But his father worked hard, he said  —   just like the 20 to 30 Arabic families who live in Avon, which is about 20 miles west of Cleveland with a population of about 21, 000. “I think it’s important to the Muslim community and the rest of the world to know that we care and it’s not something that we take lightly,” he said. Mr. Menhali, speaking through an interpreter by phone Sunday, said that the apology from city officials was a “good first step,” but that he still had questions about why something like this could happen. He said he was in Ohio because he was visiting the Cleveland Clinic for a medical procedure. He had been looking for a hotel room because the owner of the apartment where he was staying in Cleveland wanted to rent it out for the Republican National Convention. Mr. Menhali said he had ended up in Avon because hotel rooms in the city area were scarce. At first, when the police approached outside the hotel, he thought it was a training exercise. Then he became afraid, he said. Since the encounter, he said, he has been having bad dreams. The travel warning issued by the Emirates’ Ministry of Foreign Affairs told citizens to avoid wearing the national dress during their travel, especially in public areas, to ensure their safety. On its website, the ministry also told residents to abide by the dress codes of nations they visited, and to take note of the ban on wearing   veils in countries like France and Belgium. The ministry’s messages did not mention the episode in Ohio specifically. But Ibrahim Hooper, a national spokesman for the Council on   Relations, said on Sunday, “As far as I know, it came out as a result of this incident. ” The ministry said on its website that it had summoned Ethan Goldrich, the deputy chief of mission at the United States Embassy, over the “ill treatment” of Mr. Menhali. According to the police audio and video, the hotel clerk sent text messages to her sister saying she had seen a “suspicious male” in the lobby with “multiple disposable phones” and was feeling panicky about it. The sister then called the police. The clerk’s father apparently also phoned the police, saying she was “terrified” and had locked herself in a bathroom. Police videos showed officers arriving at the hotel, drawing and cocking rifles. One officer could be heard saying, “There he is!” Another officer shouted, “Get on the ground!” A man in a white robe could be seen kneeling on the pavement in front of the hotel. Officers performed a   search and went through his wallet, allowing paper to blow away in the wind. When Mr. Menhali complained about a possibly broken phone, an officer can be heard saying: “Yeah? Well you’ve broken my nail. ” But an officer searched for and retrieved one of Mr. Menhali’s cellphones, which had been tossed into the bushes. Mayor Jensen said of the police’s treatment of Mr. Menhali, “I think there were things we can probably learn from this. ” Asked if there would be repercussions for the false accusations against Mr. Menhali, the mayor said: “Something will come out of this. I don’t think it’ll be just a warning. ”'"}, "time": 1742628468.7217052}