{"duration": 0.05103278160095215, "input_args": {"text": "'Tom Cahill | November 11, 2016 \\nA brilliant guide showing bystanders what to do when seeing Islamophobia in public is spreading on social media. \\nThe guide instructs friendly bystanders to do four things in succession: Converse with the victim while ignoring the attacker, focus on a random subject of conversation that doesn’t involve anything the attacker is talking about, maintain eye contact with the victim while refusing to engage with the attacker, and continue friendly conversation until the attacker leaves, while offering to escort the victim to a safe space. \\nThe illustrated guide, made by artist Maeril , is a 4-step guide that simultaneously shows how a bystander can make an Islamophobic attacker irrelevant while at the same time providing the victim with a safe space. Maeril, who lives in France, originally designed it for bystanders wanting to make Muslim citizens feel welcome after the terror attacks in Paris and Nice, said on her Tumblr that the guide can actually be used to help those being targeted by various forms of hatred and racism. Maeril asked those planning on following the guide to make sure to do two things: \\n1) Do not, in any way, interact with the attacker. You must absolutely ignore them and focus entirely on the person being attacked! \\n2) Please make sure to always respect the wishes of the person you’re helping: whether they want you to leave quickly afterwards, or not! If you’re in a hurry escort them to a place where someone else can take over — call one of their friends, or one of yours, of if they want to, the police. It all depends on how they feel! \\nIn an interview with BuzzFeed News, Maeril said the guide is based on a psychological technique called “Non-complementary behavior,” in which a person adopts the polar opposite behavior of someone else. In this instance, non-complementary behavior means acting in a warm and friendly way toward someone who is experiencing hostile behavior from someone else. \\nThis guide will likely become essential over the next four years as hate crimes are already being reported across the country in the wake of Donald Trump’s election to the presidency. Follow Maeril on Tumblr here . \\n\\nTom Cahill is a writer for US Uncut based in the Pacific Northwest. He specializes in coverage of political, economic, and environmental news. You can contact him via email at [email protected] '"}, "time": 1742561859.5375626}