{"duration": 0.17039871215820312, "input_args": {"text": "'YORK, Pa.  —   Senator Patrick J. Toomey, Republican of Pennsylvania, has never met Charles Kress, but he desperately needs him. Mr. Kress, 62, will vote for a Democrat this November for the White House, he said, no matter what. He is also planning to vote for Mr. Toomey’s  . “Sometimes you have to keep in office the ones who make the deals,” Mr. Kress said as he watered the flowers in front of York’s Unitarian church. Republican senators like Mr. Toomey who are running in swing states  —   about six, and enough to tip the balance of power in the Senate  —   need voters who would reject Donald J. Trump to nonetheless pull the levers for the party’s other candidates in November. In some districts, House Republicans will need them, too. Mr. Trump’s convincing sweep of the primaries in Connecticut, Delaware, Maryland, Pennsylvania and Rhode Island on Tuesday did little to assuage concerns about his standing with swing voters in November. His victory speech included a bracing broadside against Hillary Clinton’s playing the “woman card. ” And he continues to trail his opponents, Senator Ted Cruz of Texas and Gov. John Kasich of Ohio, among Republican women. But   voters in federal races have become increasingly rare over the last two decades, hitting a low in 2012, when only 10 percent of them divided their votes between parties. That was down sharply from 1972. The ranks of   voters have expanded along with the rise in partisanship and its attendant rancor in Congress. “There is no doubt that, over all, the era of polarization and   above and beyond idiosyncratic factors  —   that has to lead to a drop in ticket splitting,” said Richard Born, a professor of political science at Vassar College and an expert on congressional elections. “Democrats and Republicans alike, as part of the polarization phenomenon, are more consistently liberal or conservative across issues,” Mr. Born said, “as are the candidates themselves, meaning less likelihood of ticket splitting. ” Even in Pennsylvania, a state that has elected a senator from a different party than the presidential candidate it chose seven times since World War II, ticket splitting has decreased drastically in recent elections. “That is probably Toomey’s worst problem,” said G. Terry Madonna, the director of the Center for Politics and Public Affairs at Franklin and Marshall College. It is also a problem for the Republican senators Kelly Ayotte of New Hampshire, Ron Johnson of Wisconsin, Mark S. Kirk of Illinois and Rob Portman of Ohio. Republicans in Washington are increasingly worried for them. Senator Mitch McConnell of Kentucky, the majority leader, and other Republicans are openly urging elected officials in their party to focus largely on local issues and their role in bipartisan legislation, and to refrain from tying themselves to the top of the ticket should the nominee be Mr. Trump. “I think we have to go out and make a case,” said Representative Scott Perry, a Republican who represents the York area. “People don’t split their tickets because they don’t have a choice. It’s because they do. I think those people are going to need to be convinced. ” While a polarizing presidential candidate is considered very difficult for Republican senators to overcome in swing states, there may be a silver lining for them. Some Republican donors are quietly plotting to dismiss Mr. Trump and instead pour their money into Senate races where they believe Republicans can be saved, as a check and balance to a Democrat sitting in the White House for the next four years. “The prospect of Trump at the top of the ticket could create an exodus of donors away from the presidential and toward Senate and House races,” said Kevin Madden, a Republican strategist. “The potential is there for a concentration of effort and resources geared toward Senate races that Chuck Schumer and his Senate Democrats may not have been counting on. ” Mr. Schumer, a New Yorker who is poised to become the next leader of the Senate Democrats, says good luck with that. “If there was ever a national election, this is it,” he said. “They can run from their nominee, but they can’t hide. ” Ticket splitting over the last five decades has occurred most often among moderate Democrats who have supported a Republican for president but voted for Democrats for Congress. Some voters have viewed this as a recipe for compromise and balance, while others have been repelled by the Democratic candidates running for the top job. The three strongest years of ticket splitting between presidential and House voting in the last five decades, according to American National Election Studies survey data, were 1972, when 30 percent of voters did it 1980 (28 percent) and 1984 (26 percent). Similar studies show the same trend for Senate races. In all three of those elections, a Republican won the White House by a landslide at a time when registered Democrats significantly outnumbered Republicans in the overall population, and when considerably more incumbent House members were Democrats. The 1928 election provides a history lesson in what can happen when a candidate, rather than the political mood, drives ticket splitting. That year, Al Smith, the governor of New York, became the Democratic nominee. It was not extreme rhetoric like Mr. Trump engages in, which has repelled some Republicans, that held Mr. Smith back with voters. Mr. Smith was a Roman Catholic, opposed Prohibition and was a symbol of modern urbanism. And that combination drove off rural and moderate Southern Democrats, who outnumbered Republicans significantly, contributing to his loss to the Republican Herbert Hoover. While Republicans made a net gain of eight seats in the Senate that year, demonstrating that ticket splitting does not help all senators attached to the party of a wildly unpopular candidate, many Democrats still voted along party lines for the House and Senate. In 1996, when it was clear that Bill Clinton would trounce Bob Dole, Republicans encouraged voters to stick with their party in the down ballot, and Newt Gingrich, then speaker of the House, cautioned his members to distance themselves from Mr. Dole. Mr. Gingrich came up with a parallel House agenda much as Speaker Paul D. Ryan is now doing, and he told members to run on it. “It saved the House and the Senate for them,” said Mr. Born, the Vassar professor. “Trying to localize the campaigns paid off. ” But Republican ticket splitters may make an alternative choice that is equally damaging to Mr. Toomey’s prospects. “I might just skip the whole thing,” said Kristi Peyton, 46, a Toomey fan who offered her views of Mr. Trump  —   “disaster,” “bully” and “unattractive”  —   over crabs at Captain Bob’s in Railroad, a small town near York. “Where Republicans can really get hurt is not so much that people vote Democrat for Congress but that they don’t show up at all,” Mr. Born said. “This is where the Republicans are scared to death. ”'"}, "time": 1742562753.8048098}