{"duration": 0.04781961441040039, "input_args": {"text": "'Immigration activists in Los Angeles are enraged after the mother of a prominent open borders activist is expected to be deported. [Following a massive drug raid by the Customs and Border Protection (CBP) agency at an apartment complex, Teresa   an illegal immigrant, was detained and now is facing deportation, according to the L. A. Times.    has been living in the U. S. since 2001 and her husband, Hugo Rueda, was arrested for drug possession by officials in the raid, where Rueda’s car allegedly had 33 pounds of cocaine in it, and the couple’s apartment had $600, 000 cash inside, along with an ounce of crystal methamphetamine. Federal officials believe Rueda is involved with the   U. S.  drug trade.   is the mother of Los Angeles immigration activist Claudia Rueda, who claims her mother was detained by authorities illegally, despite her mother’s illegal immigrant status. A small   rally was held at the Border Patrol station in San Ysidro near San Diego, with “Free Teresa now” chants from protesters. An organizer of the protest told the L. A. Times that not only should   not have been detained, but she also claimed federal authorities arrested the woman because her daughter is an activist against immigration enforcement. “We think it is retaliation against her mother for her daughter’s activism,” Marcela Hernandez said. In a statement to the L. A. Times, Claudia Rueda said authorities should let her mother out of federal custody. “Despite being told she would not be detained as long she cooperated, my mother was apprehended during an illegally conducted raid at my apartment,” Rueda said. “I know my mother is innocent, and both [the Sheriff’s Department and Border Patrol] know that, which is why they were supposed to let her go,” Rueda continued.   is awaiting a deportation hearing before an immigration judge and is expected to be deported. John Binder is a reporter for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742564500.416637}