{"duration": 0.06859064102172852, "input_args": {"text": "'WASHINGTON, D. C.  —   Office of Management and Budget Director Mick Mulvaney told the White House Press Corps that while a government shutdown is “not desirable” it could become a reality come September if the appropriations process is not repaired. [Mulvaney also said a government shutdown could be “good” if it “fixes Washington, D. C. permanently. ”  President Trump tweeted out on Tuesday, “either elect more Republican Senators in 2010 or change the rules now to 51%. Our country needs a good “shutdown” in September to fix mess!” either elect more Republican Senators in 2018 or change the rules now to 51%. Our country needs a good ”shutdown” in September to fix mess!  —   Donald J. Trump (@realDonaldTrump) May 2, 2017,  Asked to respond to President Trump’s tweet about how a shutdown is “good,” Mulvaney said, “It’s not desirable   …     But you asked me what a good one would look like, and a good one would be something that fixes Washington, D. C. permanently. ” Mulvaney said the reason there is a discussion about a shutdown every few months “is because the appropriations process is broken. ” He said the “the way it’s supposed to work, and it used to work” is when the House passes an appropriations bill on a topic, the Senate then passes a bill on the same issue, before it goes to the conference committee, before that bill is placed on the president’s desk. ” Mulvaney said that, since he has worked in the government, this process has “never worked” the way it’s supposed to. He added: I don’t think it has functioned for the last decade. I’ve been here since 2011 and it has never worked. We want to get back to that process. But the reason we can’t get back to that process is because the Senate is requiring 60 votes on every single appropriations bill and that is forcing this discussion on continuing resolutions  —   which is a bad way to run the government  —   and forcing a discussion on shutdowns which is simply not productive. Later in the press conference, Mulvaney said, “The president wants to see Washington better, get better, get fixed, change the way it does business. ” He said the Democrats are saying, “They won and we lost is not a bipartisan way to approach things. ” Drawn back to the topic of Trump’s early morning tweet by a member of the White House Press Corps once again, Mulvaney said, “I think what he’s foreshadowing is, ‘look, this place has to change.’ The way we run the town has to be fixed. We have to do something. We cannot simply muddle along using models the previous administration has used. ” Mulvaney said Trump is a president that will usher in change. “And he’s going to change Washington, D. C. And if it takes a shutdown, then that’s what it takes. But again, that’s several months away from that discussion. We have a lot to do between now and then. ” Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742563673.7934387}