{"duration": 0.19411039352416992, "input_args": {"text": "'Former Alaska Gov. Sarah Palin, the 2008 Republican vice presidential nominee and the first major GOP figure to endorse President Donald Trump, is calling out House Speaker Paul Ryan for what she says is “ . ”[Ryan introduced what he calls the “American Health Care Act,” a bill that does not repeal Obamacare but only amends it. For the last several days, senior Republicans ranging from members of the House Freedom Caucus to other House Republicans to Sens. Tom Cotton ( ) Rand Paul ( ) Mike Lee ( ) and more have raised serious concerns with the bill. Some call it Obamacare 2. 0, others call it Obamacare Lite or   and now Palin —  in her first interview on the topic, coming on Breitbart News Saturday on SiriusXM 125 the Patriot Channel this weekend —  calls it “ . ”  “I do want to speak about this, but I am tempted to say not another word from our fearless leaders about this new form of Obamacare that I’m going to call   —  not another word from them until we are definitively told that there is no provision whatsoever allowing Congress to exempt itself whatsoever with this law,” Palin said. “As with anything else mandated by Congress, every single dotted I and crossed T better apply to them, too, and not just the people who they are lording this thing over because remember this is   health care, the system that requires enrollment in an unaffordable, unsustainable, unwanted, unconstitutional continuation of   medicine, and even in this new   proposal, there is still an aspect of socialism. That’s the whole premise here. ” Palin expressed serious concern with the fact that Ryan’s healthcare bill does not eliminate Obamacare’s individual mandate. It just shifts the mandate —  which requires all Americans to purchase a health insurance plan even if they do not want one. Under Obamacare, those who do not comply, pay a tax to the federal government. Under Ryan’s plan, those who not comply, pay a fee to the insurance companies. “This 30 percent additional fee will be collected by some in the private sector, which will mean politicians are allowed again to pick the winners and losers, and it makes you wonder who’s lobbying hardest for aspects of this new bill because obviously there are special interests involved. Otherwise, certain private sector segments of our economy wouldn’t be rewarded as they will be with this fee, instead of going to the IRS going to private companies,” Palin said. “It would be really helpful if every single one of these politicians would do like the NASCAR drivers do —  and it’s been said before —  but let them wear their sponsors plastered all over their   suits when they show up so we know what side they’re on and who they’re actually doing their bidding for. ” At this time, House GOP leadership officials are refusing to answer which lobbyists specifically were involved in writing the bill and which lobbyists wrote which parts of the legislation. Palin told Breitbart News that it’s a “great question” for leadership officials that they should answer because the public deserves to know. “That’s a great question. That’s a great question,” Palin said when informed of the fact that House GOP leaders have refused to answer which lobbyists were involved in writing the legislation. “The people want to know with this   we know that it helps Big pharma and big lobbyists who need big government to stay in business. We want to and have the right to know who’s actually putting pen to paper and writing this because we know the politicians don’t write the laws. ” Palin also praised Cotton and Paul and Rep. Dave Brat ( ) among others, who are standing up and pushing back on this rush from leadership on this bill. She says that they are “right” in pushing to make sure the process is not rushed in the way that Ryan has been rushing it through the House so far. In fact, this past week, the House Energy and Commerce and Ways and Means Committees stayed in session all night to ram the bill down to the next stages, rather than taking input from the American people and slowly deliberating the process of healthcare reform. “Cotton is right. Dr. Rand Paul is right. Dave Brat is right. Some of these public servants are right in saying, ‘Let’s do it right this time’ because, remember, the rush job under Obamacare gave us what we’re having to deal with today, which is the devastating system that is again lorded over us,” Palin said. “They passed it with their   process of theirs. It’s very important that the people are allowed to see what’s in the bill before its first draft so we know what their thinking is, so we know what the difference is between Obamacare and  . ” “But we can’t lose sight of the entire premise between the whole   and the    arguments,” she continued. “It’s so wrong because it’s still so unconstitutional. It’s still taxation without representation. It still picks winners and losers because some corporations get to opt out of the requirements that hit everyone else. It still infringes on states’ rights, and it still weaponizes the IRS against Americans who just simply seek freedom and choices and sensibility in their families’ health care. The IRS will be taxing aspects of this without representation because we have no choice. We’re shackled to politicians’ whims and special interests’ bullying interests, which does violate the Constitution, and it actually allows government to have a lien on our health. ” “People need to know it’s the foundation, it’s the premise,” Palin said. “I don’t know why we’re still even giving an inch on aspects of socialized medicine via this new   proposal. Is that okay with conservatives, with Republicans in office? They say they want the patient first. They say they want freedom. They say they want a free market to drive the insurance system that we have in America. But no, government is still in control. Government actually has a lien on our health because they lord over us penalties if we want to opt out of a big government mandate. ” When asked what she would say to Ryan if he were on Breitbart News Saturday with her this weekend —  Ryan has refused to come on the program to discuss these matters and will not answer Breitbart News’s questions about the bill  —  Palin said she has lots for Ryan to explain here. But she also noted that Republicans   agree that Obamacare is awful and needs to be repealed. “There is much that we agree on,” Palin said. “Thank the Lord, we all agree that Obamacare is devastating   of our economy. That’s what health care encompasses. Once the government took it over —  it obviously is unaffordable, unsustainable and unwanted. So, from the   thank the Lord we all have that in common, and we want to do away with Obamacare. I would ask Paul Ryan’s forgiveness if I come across sounding like I’m just whining and complaining about a problem without proposing a solution. Like Teddy Roosevelt said, that is the definition of whining. So I want to propose solutions, and I want Paul Ryan to listen to the people who are suggesting that, okay, if government is going to be this involved in our healthcare system and choices, then allow the states to take this over. Get it out of big government’s hands. The most responsive level of government is that which is closest to the people. If you’re not going to allow individuals to have the freedoms and the autonomy and the choices provided in their health care, at least let it be a states’ rights issue. So that’s one. ” “And then let’s talk about the tort reform that I still don’t see in the new proposal,” Palin continued. “I’d like Paul Ryan to address that more clearly. I’d like him to really talk about how he proposes to tackle the waste and the fraud in the healthcare system. I’d really like him to talk about the interstate commerce allowance now because we know that that has caused a lack of competition, and I really want him to address just that good old American freedom of choice. How can he convince the American people that this isn’t just still big government in bed with big pharma and big Wall Street and sticking it to the people with all its globaloney that was part of Obamacare. How is this   any different?” Palin concluded the interview by noting that she has the utmost confidence that President Trump will move to scrap Ryan’s bill and fix this whole process before this gets out of hand. “He will step in and fix it,” Palin said. “I have great faith that President Trump is one who will fulfill campaign promises. He already has a track record of doing so well in these first months, I’m just really proud to have been part of the constituency that wanted him in there and worked hard to get him in there. So, yeah, I’m sure that President Trump is going to do the right thing and listen to all sides, of course, but understand, especially, that as a businessman, he’s going to understand whether this makes sense in his vision of how to grow businesses and how to get government off our back and back on our side. How will we create a smaller, smarter government with a proposal like this that basically allows for the continuation of a growth of government? That’s what any aspect of Obamacare or   does. So asking President Trump specifically about how running a business, not a Wall Street business, but    main street business, how does   help their business get to grow and drive and survive in this economy?” LISTEN TO FORMER ALASKA GOV. SARAH PALIN ON BREITBART NEWS SATURDAY: '"}, "time": 1742561742.673728}