{"duration": 0.11313581466674805, "input_args": {"text": "'Ned Ryun, founder and CEO of American Majority, discussed with Sirius XM host Raheem Kassam on Thursday’s Breitbart News Daily what Kassam called “palace intrigue. ”[“Is Stephen K. Bannon marginalized? Is Jared Kushner leading the president into strange and unusual places? Is Reince, and is Sean Spicer, influential? Are they on their way out? In your opinion, what is going on here, what do we need to be wary of, what are we looking out for, who are the players, and how do they align with each other?” Kassam asked.  “Since inauguration, it was really about four camps,” Ryun replied. “It was the Kushner camp, it was the Bannon camp, it was the Reince camp, and it was the Pence camp. But I’m starting to think, based off what I was hearing from yesterday and then reading reports this morning, that this is becoming actually more of two camps  —   that it really is the national populists, really led by Bannon, versus, quite frankly  —   there’s no other way to describe them  —   the liberal New York City set that have come in. ” Ryun said the latter camp included “Gary Cohn, Dina Powell,” and others he described as Democrats, along with Jared Kushner and Ivanka Trump. “God bless them, they’re part of the Trump family, but let’s not kid ourselves: they are part of the Manhattan liberal set,” he said of the latter duo.  “The question that I have as I’m reading these reports  —   and I think we should start asking questions  —   who are they really? What has been their experience? What is their worldview? Because I’m starting to suspect their worldview does not line up with the campaign promises that Trump was making,” Ryun said. “The people that voted for Donald Trump voted for very specific things,” he noted. “They do want to see a wall. They want to see immigration dealt with. They want to see healthcare reform. They want to see tax reform. They want to see all of these things. ” “Watching what’s taking place, I’m growing more and more concerned that some of the dynamics, some of the voices in Trump’s ear, some of the influences  —   we should start asking questions. Are they starting to steer him in the wrong direction, away from what got him into one of the most stunning victories in presidential history, got him into the White House?” Ryun asked. Kassam returned to Ryun’s description of the “liberal New York City set” and asked him to explain the importance of Dina Powell. Ryun noted Powell is a fellow veteran of the Bush White House. “I was at the White House before she was, but she came in she was head of presidential personnel. In fact, I think she was the   head of presidential personnel,” he said. He continued that after Powell left the Bush White House, she worked for Goldman Sachs in New York “and now has come back, really gotten involved with Ivanka Trump   Day. ” “I have real concerns, not only about the New York liberal set that has come into the White House.   …     I am more and more concerned about the Goldman Sachs people that have come into the administration,” Ryun professed.  He said they have a “different worldview than the American people that voted Trump in. ” “You’ve got that worldview, you’ve got the New York Goldman Sachs liberal set worldview, and the real question here is which one is going to win out, influencing the future direction of Trump,” he predicted. “I thought really yesterday, at first, initially, it was a reorganization by McMaster of some of these things,” Ryun said of the news that Steve Bannon has been removed from the principals committee of the National Security Council. “I’m a little more concerned that there is a serious power struggle going on. ” “I’ve got to tell you, my hope is that Trump will say, ‘I know what got me in. I know what brought me to the White House. Steve Bannon is really the lead cheerleader on that front. Keep Steve close. Listen to Steve. Keep pushing down this path,” Ryun advised. “If he does, there will be victory this year in regards to policy,” he anticipated. “He’s already going to have it this week with Gorsuch. I really do think we’re going to get something done with health care. There’s going to be a massive step in the right direction. I do think we’ve got a real shot at tax reform. ” “You get a couple of these victories under your belt. You keep going down this path. Then we’re going to start talking about what the second Trump term looks like,” he said. “But if he starts to stray, I’m concerned. ” Kassam asked where the Republican National Committee, its former chairman Reince Priebus, and Sean Spicer fit into this picture. “You know, I think they’re starting to realize that the New York set, they’re not their friends,” Ryun replied. “I think in a weird strange alliance that the RNC folks are realizing they’re basically going to become allies with Bannon. ” “This is all on the fly. This is all really the last 24 hours,” he added. “If the other guys win, I guarantee you Bannon’s out, Reince is out, Spicer’s out, the corporate New York set is in. ” “I think you’re going to see, internally, really kind of what I think are strange alliances. But in the short term, I think they’re going to be working together to push back on this New York set. Quite frankly, even though it pains me somewhat to say this, I hope that Bannon and the RNC guys, that alliance is successful,” Ryun said. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742564152.1808844}