{"duration": 0.11193299293518066, "input_args": {"text": "'During the 1986 race for governor of Vermont, Bernie Sanders bristled at the popularity of the Democratic incumbent, Madeleine Kunin. Mr. Sanders, who was running against her as an independent, saw himself as a leader, and viewed Ms. Kunin as a lightweight. “She does very well on television,” he told one interviewer. “She has an excellent press secretary. ” But really, he said another time, the governor’s appeal came down to one trait. “Many people are excited because she’s the first woman governor,” he said. “But after that, there ain’t much. ” Mr. Sanders has long presented himself as an     politician from rural New England, now seeking the presidency with promise of a political revolution. But his combative side has now emerged as the Democratic race has tightened and Hillary Clinton has sharpened her own rhetoric. The result is a far harsher tone in the Democratic campaign and a transformed Senator Sanders, who is now making the kinds of   attacks that some of his advisers regretted he did not deploy sooner. But his aggressiveness also worries some supporters who were powerfully drawn to his positive persona that forswore politics as usual. The senator’s assertiveness was on vivid display in Thursday’s debate with Mrs. Clinton ahead of the   New York primary on Tuesday, which Mr. Sanders must win big to dent Mrs. Clinton’s strong lead in the delegates needed for the nomination. But he is also seeking to match the vigorous jabs from her aides and allies, who ignored Mr. Sanders for much of last year and are now assailing his policy ideas and leadership abilities on a   basis. His advisers say he is reacting to the New York political environment as well. “Political combat is more restrained in places like Iowa and New Hampshire, but it’s completely different in New York, and Bernie has no problem defending his ideas in a tough way against Secretary Clinton’s,” said Tad Devine, a senior adviser for the Sanders campaign. Mrs. Clinton is now trying to hold off Mr. Sanders while not alienating his supporters, whom she would need in the general election. But she is also refusing to back down, and their spiky clashes are suddenly making for a more explosive and unpredictable race. More than anything, the recent Sanders broadsides reflect a political strategy he has carried out in previous campaigns: the use of blunt criticisms, sarcastic asides and a thundering style against his opponents. In the 1986 race, Mr. Sanders argued that he would be a strong feminist and do more for women than Ms. Kunin had. While granting that Ms. Kunin was “not corrupt,” he questioned if she had the same “courage” that he had. He repeatedly challenged her credentials as a fellow progressive, using some of the same language he aims at Mrs. Clinton. In the end, he damaged Ms. Kunin politically, as some Clinton supporters and political analysts think he may do in the current race. “In a tough fight, Bernie is hardly the     guy that he claims to be,” said Garrison Nelson, a longtime political science professor at the University of Vermont. Ms. Kunin was not the only foe that Mr. Sanders attacked with insinuations, as opposed to the more overtly negative television ads that Mr. Sanders has forsworn. In his 1990 race for Congress, he frequently laid political bait for his Republican opponent and relished watching him stumble. And in his 2006 Senate campaign, Mr. Sanders relentlessly linked his moderate Republican opponent with George W. Bush and Dick Cheney, and accused him of running “the most negative, dishonest campaign in the history of the state of Vermont. ” While such tactics are not unusual in many campaigns, Mr. Sanders has long tried to claim the high road. Yet if his past opponents remember anything about him, it’s Bernie the brawler. “The way he kept tagging me as a typical rich guy who only cared about rich Republicans  —   it was very tough, and very effective,” said Richard Tarrant, a software executive who was the Republican Senate nominee in 2006 and ran many aggressive television ads. “Bernie knew that I earned my money myself, that my wealth was  . But that didn’t matter. ” In the current race, after days of needling by the Clinton camp about his policies and ability to answer tough questions, Mr. Sanders hit back this month by saying Mrs. Clinton was “not qualified” for the presidency because she had taken money from wealthy donors and supported the war in Iraq and some   agreements. Some Sanders supporters expressed dismay that their candidate was resorting to such sharp exchanges  —   a Guardian columnist wrote on Tuesday that she felt “betrayed”  —   while the leading Republican candidate, Donald J. Trump, picked up the line of attack. “Bernie Sanders says that Hillary Clinton is unqualified to be president,” Mr. Trump wrote on Twitter. “Based on her decision making ability, I can go along with that!” Mr. Sanders has started running commercials in New York criticizing Mrs. Clinton for accepting   speaking fees from Wall Street banks but not supporting a federal $15 minimum wage. And in Thursday’s debate, he suggested that Mrs. Clinton’s speaking fees had influenced her to be soft on Wall Street regulation. She quickly dismissed that, saying that she had called out bankers over business practices  —   drawing a sarcastic response from Mr. Sanders. “Secretary Clinton called them out  —   oh my goodness, they must have been really crushed by this,” he said. “And was that before or after you received huge sums of money by giving speaking engagements? So they must have been very, very upset by what you did. ” While Mr. Sanders has not run   and highly personal ads against Mrs. Clinton  —   the sort that traditionally characterize a negative campaign  —   Mrs. Clinton’s advisers accused Mr. Sanders of breaking his word. “At times he does it deftly, but make no mistake, every day Senator Sanders is launching another attack, and that’s not how he said he would run his campaign,” said Joel Benenson, Mr. Clinton’s campaign strategist. Mr. Devine, a longtime strategist for Mr. Sanders, said his candidate’s quips and tone were a far cry from the   vitriol in the Republican race. He insisted that Mr. Sanders was seeking to reveal substantive differences with Mrs. Clinton, and denied that his candidate fears the Democratic nomination is slipping away. “I think the race is just increasingly engaged,” Mr. Devine said. In Vermont, however, Mr. Sanders was known for belittling opponents at times, rather than merely challenging their ideas. During one debate in the 1986 governor’s race, Mr. Sanders was asked if he viewed Governor Kunin as “the lesser of two evils,” given his descriptions of the Democratic and Republican parties as “Tweedledum” and “Tweedledee,” and if he thought he might contribute to her political “demise. ” Mr. Sanders chuckled and then looked at Ms. Kunin, seated a few feet away. “Governor, how does it feel to be the lesser of two evils?” he asked. “I think that really is what this campaign is about. ” Ms. Kunin was  . Toward the end of that campaign, Ms. Kunin said, Mr. Sanders argued at a rally in Burlington, Vt. that he would do far more for women than Ms. Kunin. “Bernie thought I was an empty suit, and insisted that he was the better feminist because he would solve income inequality and that would help women,” Ms. Kunin said in the interview. “He could be sarcastic, but also very subtle. ” A supporter of Mrs. Clinton’s presidential bid, Ms. Kunin said she saw similarities between his treatment of the two women. “He’s not going to say, ‘She’s a woman, she’s not qualified,’” said Ms. Kunin, who was   with 47 percent of the vote after Mr. Sanders siphoned off some support. “But he can paint a very subtle illusion talking about qualifications and judgment. ” Mr. Devine, the adviser to Mr. Sanders, said the senator would never make   attacks, in the 1980s or today. “His focus is on issues,” he said. Peter Smith, the Republican candidate for governor in 1986 and the congressman Mr. Sanders ousted in 1990, said that Mr. Sanders used passion to create “a contrast between him and his opponent that may not, in fact, exist. ” Mr. Sanders’s aides in the 1990 campaign said they would regularly taunt Mr. Smith about his positions on issues like the minimum wage, which the congressman would dispute, and then Mr. Sanders would come forward and accuse Mr. Smith of dishonesty. As a result, a running theme of that campaign was that Mr. Sanders had integrity and Mr. Smith lacked it. “The tool he uses is his intensity and his belief that, on the major issues he cares about, there is only one right answer,” Mr. Smith said. “And it is his. ”'"}, "time": 1742562036.5274408}