{"duration": 0.08673739433288574, "input_args": {"text": "'Dr. Joy Browne, the syndicated radio and television psychologist who dispensed advice and earnest inspiration over the air for nearly four decades, died on Saturday in Manhattan. She was 71 and still hosting her daily   radio program. Her death was confirmed by her brother David Oppenheim, who did not give a cause. Beginning in 1978  —   when she was suddenly thrust onto the air because a hockey game had been canceled  —   Dr. Browne reached millions of radio listeners, many of whom revealed their concerns to her in cathartic   segments or emailed her their problems, which she read and responded to over the air. “She was the   psychologist on   radio at the time of her death,” Michael Harrison, the publisher of Talkers magazine, said in an email on Wednesday. “More importantly,” he added, “she kept the presence of the radio   show alive on terrestrial   radio at a time when the genre had all but dried up in favor of mostly conservative, political programming. ” On television, versions of her program appeared on CBS, with a studio audience, and on the Discovery Health cable channel. In contrast to other   psychologists, some of whom could come across as scolds, Dr. Browne was unflaggingly buoyant as she delivered   advice and gentle goading. “I’m in the business of helping make lives better,” she once said, “not by bashing but by teaching people how to take responsibility for their behavior. ” On a recent program she asked: “If we can figure out a way to get to the moon, wipe out disease, double life expectancy, don’t you think we can be a little nicer to each other? Maybe. I know, I believe in the Easter bunny and the Tooth Fairy as well. ” With her advice came rules to live by, like these for couples: ¶If you’re married, go on dates together (to keep the romance alive). ¶If you’ve gone through a divorce or a breakup, no dating for a year (to let you experience life on your own). ¶If you’re both in love and either of you has children, get married (an unmarried state can be disruptive for younger children, who tend to become attached, and for teenagers, who are dealing with their own sexuality). The psychologist Dr. Joyce Brothers, who became a fixture in American homes, made her television debut in the 1950s, but the roots of radio therapy are usually traced to Toni Grant, who started broadcasting on   in Los Angeles in 1975. (Dr. Grant died this year.) Dr. Browne was among those who followed in her footsteps, in her case on   (now WMEX) in Boston. “When I first started, the A. P. A. tried to take my license away,” Dr. Browne told The New York Times in 1996, referring to the American Psychological Association. In 1998, the group gave her an award under the rubric “outstanding contribution by a psychologist in the media. ” Dr. Browne found her niche in the 1970s, at a time when seeking professional help was still stigmatized and family and community support networks had weakened. Radio gave people wrestling with emotional issues the safety of anonymity. She said she was as much concerned with moral and ethical issues as she was with mental health. “It’s Problem Solving 101,” she said in 1996 (while acknowledging that some listeners might consider it “Voyeurism 102”). Indeed, Dr. Frank Farley, a former president of the psychological association and a professor at Temple University, said in a phone interview on Wednesday that   programs like Dr. Browne’s were more successful at offering practical advice on ethical issues than at providing actual therapy in public. “You can’t give therapy to people you haven’t seen,” he said. He added: “Joy Browne was certainly among the best of the media psychologists. She was very solid,   in psychology, and wasn’t going to be shooting from the lip. ” She was born Joy Oppenheim on Oct. 24, 1944, in New Orleans, the daughter of Nelson Oppenheim, a life insurance salesman, and the former Ruth Strauss, a teacher. She was raised in Pennsylvania and Denver and graduated from Rice University in Houston with a degree in behavioral science. After earning a master’s degree and a doctorate from Northeastern University in Boston, she began practicing psychology and attending Tufts University School of Medicine. That was when she was recruited by WITS. “I found something in my life I was good at and could help more people in one hour than I could in one year,” Dr. Browne told Talkers magazine last year. (She took her husband’s name when she married Carter Browne.) WITS had scheduled her to begin broadcasting in October 1978, but weeks earlier she was summoned one night without warning to fill in when a scheduled broadcast of a Bruins hockey game was abruptly canceled the ice had melted at Boston Garden. Her mission, she said, was to persuade depressed listeners that they could change only their   not those of the people who might be causing them stress. “They want to know how to kill the person who is making them feel that way and not be held responsible,” she told Talkers. “The only behavior I can help change is yours, but that isn’t what a caller wants to hear. They want me to tell them that the other person is to blame. ” She also learned, she said, that “one secret to doing a great interview is listening,” a skill she had already developed as a therapist. Certain topics were taboo, she said, including abortion, “because you will never change anyone’s mind,” and horoscopes, “because it will get phone calls  —   but no listeners. ” Partisan politics was also off limits. After another radio stint in California, Dr. Browne joined the WOR Radio Network in New York, which in the early 1990s sent her program into national syndication. She remained at WOR until it was sold in 2012. She then shifted to Radio America and finally to Genesis Communications Network, where her midday program was still being broadcast on more than 100 stations at her death. Dr. Browne was also an author. Among her titles are “The Nine Fantasies That Will Ruin Your Life” (1998) “It’s a Jungle Out There, Jane” (1999) “Getting Unstuck” (2002) “Dating Disasters” (2005) and “Dating for Dummies” (2006) which includes this   tip: “If you have fingernail marks on the palms of your hands, you’re a little too tense. ” Her marriage to Mr. Browne ended in divorce. In addition to her brother David, she is survived by a daughter, Patience three sisters, Jane Russo, Judy Hawkins and Alannah Sinclaire and another brother, Daniel Oppenheim. Embracing the    philosophy, Dr. Browne imposed one rule on herself: No chocolate during Lent. “That keeps me humble,” she said. “I’m always telling people to do things to change. This is my yearly reminder to myself that change is really hard. ”'"}, "time": 1742564218.7697947}