{"duration": 1.1768290996551514, "input_args": {"text": "'Russian scientists to track sea lions from space October 28, 2016 TASS kamchatka , animals , space , russian far east Steller sea lions are found everywhere near the coast of the Kamchatka peninsula, but the largest reproductive rookery is located on the Aleutian and Kuril Islands. Source: Lori Images \\nResearchers at the Kamchatka branch of the Pacific Institute of Geography of Russia’s Science Academy’s Far East Department now have the opportunity to monitor Steller sea lions that are on Russia’s Red List of Threatened Species, from space, the Komandorsky Nature Reserve’s Spokesman Alexei Veledinsky told TASS on Oct. 28. The researchers succeeded in installing five GPS tags on two full-grown sea lionesses and three cubs on the national park’s territory. \\n\"It was not an easy task as these animals are very timid. They had to be knocked out using tranquillizers so that they could be tagged,\" Veledinsky said. \\nHowever, right after the animals woke up, scientists started receiving the data on their movement. In one case, a few days after being tagged, a sea lionesses and her cub travelled several hundred kilometers from the Commander Islands through the Pacific Ocean to Russia’s Kamchatka Peninsula. All of the sea lions’ movements are depicted on a map via a computer program. \\n\"Researchers will be able to follow the sea lions for approximately one year. The tags placed on the animals’ heads will fall off when they begin to shed their fur. That said, the tags are glued to their fur with a specific paste,\" Veledinsky explained. 10 UNESCO treasures in Russia on one map \\nOne of the main goals of this research is to garner scientific data on the winter habitats of the sea lions populating the Commander Islands as their number has been falling. In the 1960s and 1970s up to 12,000 sea lions used to spend the winter on the islands, while in summer there were 2,000 to 5,000 animals there. Now there are no more than 600 sea lions. The new data will enable the creation of more safe conditions in the sea lions’ rookeries. There are four rookeries where sea lionesses bear cubs on the Commander Islands, which is encompassed by the national park. Besides that, there are also three rookeries where cubs are not born. \\nThe Komandorsky Nature Reserve, founded in 1993, is the largest marine sanctuary in Russia with a territory of more than 3 mln hectares.'"}, "time": 1742564326.1289327}