{"duration": 0.04656577110290527, "input_args": {"text": "'0 comments \\nAll the suspense is building up with Hillary and the FBI, as the election is literally right around the corner. What will happen to her? Who knows since the Justice Department is blocking the investigation . Obviously there’s something fishy! \\nGood morning Hillary Clinton! We already hit you today with FBI: Clinton Foundation Case ‘Likely’ Moving Toward an Indictment. What else could possibly go wrong? How about everything? \\nLike audio recordings of the FBI wanting to investigate the Clinton Foundation, but the DOJ getting in the way? Yes, the same DOJ headed up by Loretta Lynch (see Nothing to Hide? AG Loretta Lynch ‘Pleads Fifth’ On Iran Ransom Investigation)… \\nThe FBI had secretly recorded conversations of a suspect in a public-corruption case. The suspect was talking about alleged deals the Clintons made, these people said. The agents listening to the recordings couldn’t tell from the conversations if what the suspect was describing was accurate. But it was, they thought, worth checking out. Prosecutors thought the talk was hearsay and a weak basis to warrant aggressive tactics, like presenting evidence to a grand jury, because the person who was secretly recorded wasn’t inside the Clinton Foundation. FBI investigators grew increasingly frustrated with resistance from the corruption prosecutors. Some executives at the bureau itself, to keep pursuing the case. \\nLet me break this down for you real simple for any errant leftist who found this site while searching for Gender Queer styling tips. As a general rule, people who join the FBI respect the law. Some may even love the law. These FBI agents go through intense study and training with dreams of taking down baddies. Sometimes with a gun, sometimes with a pen. FBI agents, as a general rule, are in the FBI so they can be good guys. Okay? Okay. \\nSo when agents discovered Hillary Clinton, a politician sitting at the tippity-top of our government, was possibly engaging in criminality, which may have endangered the security of the United States, these FBI agents wanted to pursue. Good guys vs. Bad Lady with Cankles. \\nBUT, the higher-ups (like Loretta Lynch) at the Justice Department, essentially told the FBI agents to look the other way. Hillary was being protected (or so it appears) so she could run for and become president. The first lady president. Priorities. \\nKind of runs counter to everything these FBI agents stand for, yes? It appears they were unwilling to stand down and ignore justice. This isn’t so much of a surprise to us: read also CORRUPTION: FBI, DOJ Wanted to Investigate Hillary. Comey and Lynch Intervened. \\nWith five days to go, who knew Hillary’s closing argument would be “But I don’t think I’m getting arrested?” \\nI hope Hillary is feeling very scared right about now. Does she think she can just get away with all of her lies?! Apparently the entire democratic party thinks the same. These people are despicable. America, do yourself a favor and KEEP HER OUT OF OFFICE. Related Items'"}, "time": 1742564417.403846}