{"duration": 0.17531085014343262, "input_args": {"text": "'Via Alternet \\nToday’s militarized crackdown on water protectors in Cannonball, North Dakota stems from high levels of coordination between the extractive industry, state officials and police departments. It was waged against a frontline camp seeking to block the Dakota Access Pipeline (DAPL), which would cross beneath the Standing Rock Sioux reservation’s main drinking water source and bisect the community’s burial grounds. The attack took place under cover of a media blackout, with reports emerging that police were disrupting cellular phone reception. \\nWater protectors have already endured dog attacks, military-style checkpoints, low-flying surveillance planes, invasive strip searches, national guard deployments, and mass arrests. “What’s happening today is a travesty on the human rights of Indigenous people,” Tom Goldtooth, the executive director of the Indigenous Environmental Network, told AlterNet. “I see this as glaring evidence that the law enforcement of this county and state is more concerned about protecting corporate rights of the extractive industry than tribal nations.” \\nThere is evidence of close coordination between the companies backing the $3.8 billion crude-oil Dakota Access Pipeline and police departments. Energy Transfer Partners, the parent company for Dakota Access LLC, said Tuesday it intends to work with police to forcibly clear a frontlines water protectors’ camp. Energy Transfer Partners threatened that “in coordination with local law enforcement and county/state officials, all trespassers will be prosecuted to the fullest extent of the law and removed from the land.” \\nChallenging the company’s charges of trespassing, the frontline Sacred Stone Camp says it is taking back “unceded territory affirmed in the 1851 Treaty of Ft. Laramie as sovereign land under the control of the Oceti Sakowin.” \\n“We have never ceded this land,” Joye Braun, an organizer with the Indigenous Environmental Network, said in a press statement. “If DAPL can go through and claim eminent domain on landowners and Native peoples on their own land, then we as sovereign nations can then declare eminent domain on our own aboriginal homeland.” \\nToday’s events indicate that Energy Transfer Partners is not bluffing when it says police are siding with the company. In fact, law enforcement has vocally rallied behind the pipeline, which is backed by Enbridge. “At some point the rule of law has to be enforced,” Cass County Sheriff Paul Laney said Wednesday, according to the Associated Press. “We could go down there at any time. We’re trying not to.” \\nThe companies backing the pipeline already have private security under their employ. Dakota Access LLC confirmed to AlterNet in September that it had hired the notorious multinational security firm G4S during a period that overlapped with the protests, but would not state where its forces were located. Attorneys representing the Standing Rock encampments identified the companies behind the Dakota Access company’s brutal dog attacks, captured on video, as private security firm 10-Code Security, LLC and attack dog contractor Frost Kennels. \\nBut according to Peter Kraska, professor and author of Militarizing The American Criminal Justice System: The Changing Roles of the Armed Forces and Police , the extractive industry also has taxpayer-funded security, in the form of police. \\n“We have romantic notions of the relationships between government and the private sector and tend to think the old days of police supporting owners of capital—the railroad companies instead of the workers—are from a bygone era,” Kraska told AlterNet. “Situations like these show that corporations and energy interests are exercising a monopoly on violence to continue the fossil fuel industry unabated.” \\nSteven Salaita, professor and author of the forthcoming book Inter/Nationalism: Decolonizing Native America and Palestine , put it this way: “The current buildup of tremendous force at Standing Rock should be understood as a military invasion of a sovereign nation on behalf of a foreign oil company.” \\nThe heavy-handed response does not stem from local coordination alone. The Morton County Sheriff’s Department said in a press statement released Sunday that, “Due to escalated unlawful tactics by individuals protesting the construction of the Dakota Access Pipeline, Morton County has requested additional law enforcement assistance from other states. The state of North Dakota made an Emergency Management Assistance Compact (EMAC) request to states for assistance on October 7th.” \\nRemarkably, the EMAC program is supposed to be used to allow “states to send personnel, equipment, and commodities to help disaster relief efforts in other states.” \\nAccording to the Morton County Sheriff’s Department, “Several states have responded and have arrived or will be arriving to support Morton County. States that are currently assisting Morton County are: Wisconsin, South Dakota, Minnesota, Wyoming, Indiana and Nebraska.” AlterNet could not immediately reach Morton County for comment. \\nIn Minneapolis, news that local law enforcement officers were being sent to Standing Rock sparked protests on Wednesday. The Hennepin County Sheriff’s Office confirmed that, “At the request of the State of North Dakota, and as approved by the State of Minnesota, on Sunday, Minnesota Sheriff’s Deputies from the Hennepin, Anoka, and Washington Counties’ Sheriff’s Offices were deployed to assist in Morton County, North Dakota.” \\nThose counties cover the bulk of the Twin Cities area, where local police been accused of placing protesters in danger, through a far-reaching culture of incitement against the Black Lives Matter movement. In one incident, St. Paul police officer Jeff Rothecker was forced to resign in February after he was caught encouraging drivers to run over Black Lives Matter protesters slated to gather for a Martin Luther King Day mobilization. Lt. Bob Kroll, the head of the Minneapolis Police Officer’s Federation who has ties to a white-power-linked biker gang, has repeatedly referred to protesters as “terrorists.” \\nAs police departments around the country send reinforcements to North Dakota, the appeals of the Standing Rock Sioux tribe for federal protection from law enforcement violence appear to have had no effect. In a letter sent to Attorney General Loretta Lynch earlier this week, the water protectors asked the Department of Justice to intervene. \\n“To many people, the military tactics being used in North Dakota are reminiscent of the tactics used against protesters during the civil rights movement some 50 years ago,” the letter states. “But to us, there is an additional collective memory that comes to mind. This country has a long and sad history of using military force against indigenous people—including the Sioux Nation.” \\nSarah Lazare is a staff writer for AlterNet. A former staff writer for Common Dreams, she coedited the book About Face: Military Resisters Turn Against War . Follow her on Twitter at @sarahlazare . About Lara Starr '"}, "time": 1742562270.3546572}