{"duration": 0.0779581069946289, "input_args": {"text": "'Citizen journalism with a punch How Siberia Became Part of Russia \\nThe conquest of Siberia by Russia took place in a relatively short period of time. How did it happen? Originally appeared at RBTH \\nSiberia became a part of Russia with incredible speed. In 1585, the first Russian expedition attempting to cross the Eurasian continent perished beyond the Urals; only 54 years later, however, Russians reached the Pacific Ocean. \\nThe history of Russians in Siberia \\nRussia\\'s contact with Siberia\\'s indigenous populations began long before the ill-fated military expedition to the Urals. The 14th-century Laurentian Codex, which is the oldest record of the history of Northern Russia, mentions Gurat Rogovich from Novgorod who went on an expedition to the \"Ugra lands” in the 11th century. According to Russian historian Sergei Solovyov, the \"great mountains and copper gaits\" mentioned in the Codex are the Urals. In a subsequent period, the Ushkuiniks — pirate warriors from Novgorod who traveled along the rivers in flat-bottomed boats — would often raid those territories. \\nIn 1483, Muscovite warriors went on a military campaign to the Urals, and in 1555, the Khanate of Sibir, an ethnically diverse Muslim state made up of indigenous Siberian tribes, became a vassal of the Russian tsar. However, in 1563, a new leader, Kuchum, became khan and reasserted the independence of the Khanate. ostrog.jpg The first full-fledged Russian colonization expedition to Siberia was Cossack Yermak\\'s campaign against Kuchum in 1581. By that time, the khan had begun raiding bordering Russian lands. Yermak, who began his expedition with 540 Cossacks, gathered more tro \\nThe first full-fledged Russian colonization expedition to Siberia was Cossack Yermak\\'s campaign against Kuchum in 1581. By that time, the khan had begun raiding bordering Russian lands. Yermak, who began his expedition with 540 Cossacks, gathered more troops as he moved further into Siberia, fighting local tribes and the khan’s forces along the way. In 1585, Kuchum’s men led a raid on Yermak’s camp and killed the Cossack leader and most of his soldiers. But it was too late to stop the colonization of Siberia. \\nNew Russian expeditions built forts in Siberia, which later evolved into large cities. In 1586, the city of Tyumen (current population 720,000) was founded; in 1604 — Tomsk (population: 570,000) and in 1628 — Krasnoyarsk, home to more than one million people today. \\nNot a colony \\nUnlike the British territories in North America, Siberia was not a colony. Russia did not divide its territories along such lines. The region just became a part of the expanding Russian Empire. The local elites were integrated into the Russian administrative systems. For example, Kuchum\\'s son eventually signed a peace agreement, and his grandson became head of the Qasim Khanate, a Tatar vassal state of Russia. \\nExperts believe that before the arrival of the Russians, 240,000-300,000 indigenous people lived in Siberia on a territory of 5 million square miles. The Siberian tribes fought fiercely against one another, and many of them accepted Russian rule as a way to avoid further bloodshed. However, the further east the Cossack explorers went, the more resistance they faced from those groups who wanted to preserve their independence. \\nThe Russian government used forts and garrisons to spread its power, but indigenous tribes attacked and burn the forts, which led to retaliatory strikes by the Cossacks. Folklorist Georgy Ergis says that in the legends of the Yakut people, Russians are described as \"people of battles and massacres.\" \\nThe last holdouts \\nThe Chukchi were one of the most defiant indigenous people of Siberia. They fiercely fought the Cossacks and often even defeated them on occasion. The scale of the battles between the Chukchi and the Cossacks were not great — in one serious defeat on the Orlova River, the Russian forces lost 51 men — but eventually the imperial government had enough. In 1742, the tsar issued a decree: \"Attack the restless Chukchi with an armed hand; eradicate them completely.\" surikov_1300.jpg Yermak\\'s conquest of Siberia. Vasily Surikov. / Source: Wikipedia.org \\nLike native groups in other parts of the world, the indigenous people of Siberia were vulnerable to diseases brought by Russian explorers. \"The new illnesses weakened and demoralized the indigenous population,\" historian John Richards wrote. \"They destroyed 80 percent of the Tungusic people and 44 percent of the Yukaghir people.\" \\nNevertheless, the aim of Russia\\'s expansion was not genocide or the enslavement of the Siberian peoples but to impose a tribute on them and include the new lands in the Russian Empire. Usually, Russians would resort to weapons only if their diplomatic efforts failed. Today approximately 10 percent of the population of Siberia is made up of native peoples. In the Republic of Sakha-Yakutia, for example, there are more ethnic Yakuts than Russians.'"}, "time": 1742561895.5278919}