{"duration": 0.09787178039550781, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name Recipient Email => \\nDear Mexican: ¿ Por que no hay un pinche líder entre nosotros o de nosotros los mexicanos? Para que tuviera los tanates bien puestos y hablara frente al congreso y les dijera sus verdades a los hipócritas políticos. ¿Será que “nuestros lideres” son unos miedosos o vendidos? No hay uno solo (solo el Chapulín Colorado) que nos defienda, tanta humillación que han tenido los negros, siempre de sirvientes o mozos, pandilleros y drogadictos (en Hollywood) y nadie protesta y salen con que Memín Penguin es ofensivo, otra de esas y nos subimos el cierre, ¿eh? En serio , “Ask a Mexican” , ¿Como podría yo hablar delante del congreso, local, estatal o federal? ¿Sería mucho pedir? \\nPónganse las Pilas, Putos \\nDear Readers: For those of you who still don’t habla —and if you don’t habla , ¿ que chingado estas esperando ?— the writer asked where’s the Mexican leader who’ll take us into the Promised Land of American acceptance, then couldn’t help but to attack blacks while he had my attention. Ya cállate con los “pinche negros,” pendejo . And Mexicans did have a messiah who saved us all—his name was Juan Gabriel, and he recently died. \\nAre there any states in which Mexicans are not yet a majority? \\nGabacho Really Wants to Know \\nDear Gabacho: Bruh, the Reconquista ain’t that advanced—yet. New Mexico has the highest percentage of Latinos at 47 percent of its total population, but most of them don’t even consider themselves Mexican. The next-highest states are California and Texas, with 38.2 percent of their respective populations Latino per the U.S. Census, although Texas has the higher percentage of Mexicans in that group because of all the South Americans and Central Americans in California. And the state with the lowest Latino percentage of its people? West Virgina, at 1.3 percent. Raza : don’t be scared, and move to the Mountain State. Don’t forget that hillbillies are just brothers from a different madre . \\n\\nForgive me for not using neat-sounding Spanish words in this email; my Spanish is rusty, and it’s late. While I plan to learn it again, I’m getting ahead of myself. Reading through the archives of your column, it seems that you have forgotten, or chosen to ignore, those gabachos who actually do not hate the Mexicans. Take me for example. While this email is relatively devoid of Spanish phrases, I love the Spanish language. I studied it in high school, and wholly intend to learn it again, probably next semester. I love Mexican food, and I mean the real stuff (although I do enjoy Taco Bell as well). My high school was relatively small, and we had a lady come in to tutor the few of us who cared to learn Spanish. While she had lived here quite awhile, she had not assimilated into America . She cooked for us one day, and that started my love for authentic Mexican food. She also instilled in me a fascination for Mexican culture. I even would go so far as to say that I would support an amnesty program: Mexicans will always be here, so why not make them legal? If they’re not gonna do it the legal way, then we might as well throw in the towel. I wrote all this to simply remind you that not all Americans hate Mexicans: quite the contrary. Some of us love them! \\nToo Tired to Think Up an Interesting Pen Name, or Any Interesting Questions \\nDear Gabachos: While I appreciate you and other gabachos who stand by Mexicans, be careful with your words: Trump just might deport you to if he wins. Oh, and #fucktrump \\nAsk the Mexican at themexican@askamexican.net, be his fan on Facebook, follow him on Twitter @gustavoarellano or follow him on Instagram @gustavo_arellano!\""}, "time": 1742563006.2071054}