{"duration": 0.02987217903137207, "input_args": {"text": "'100 Million Marine Mammals Are Mistaking Ocean Trash for Food But Boyan Slat Has a Solution Nov 16, 2016 0 0 \\nOceanographers recently went ‘fishing,’ but not for what you might think. They were on a reconnaissance mission to find out just how bad the Pacific Garbage Patch – an enormous gyre of ocean liter – had become. When they pulled up their nets recently, they found they were “choked with plastic bits and pieces.” \\nAside from the viewable plastic trash, researchers have found 750,000 microplastic pieces per square kilometer in the Garbage Patch, and the marine life which must live in these waters, is riddled with them. \\nEstimations are that more than 5 trillion pieces of plastic weighing more than a quarter of a million tons currently float at sea globally. Most of this plastic debris comes from sources on land and ends up in oceans and bays due to poor waste management, and over-consumption. \\nIt takes between 450 and 1000 years for plastic to biodegrade, and in the meantime, it simply breaks into smaller and smaller pieces which animals mistake for food. Tube-nosed seabirds, like this Tristram’s storm petrel, eat plastic particles in the ocean, mistaking them for food. Sarah Youngren / Hawaii Pacific University/ USFWS \\nThe number of creatures that are affected is mind-boggling. Sadly, dolphins, sea birds, sea lions, tortoises, whales, and over 700 different marine species are likely to go extinct because of the plastic garbage choking our oceans. Millions of sea-dwelling creatures are literally ingesting their death, by mistaking plastic ocean trash for food. \\nAccording to EcoWatch , just one species, a type of sea-bird can hunt for many fish in the sea, but areas that reliably contain food are very patchy. In other words, tube-nosed seabirds are searching for a “needle in a haystack” when they forage. They may be searching for fish, squid, krill or other items, and it is possible that plastic debris visually resembles these prey. Scientists believe that this specific example tells only part of a more complex story. \\nFor some marine life, the plastic particles are so small, that even algae consume them, so they don’t even know that they are ingesting human waste which is detrimental to their health. Pioneering research another reason that some marine life like birds might be eating plastic trash – they are likely confusing bits of plastic bottles and bags for small fish. \\nDr. Gabrielle Nevitt and his associates have found that certain species of tube-nosed seabirds are attracted to dimethyl sulfide (DMS) , a natural scented sulfur compound. DMS comes from marine algae , which produce a related chemical called DMSP within their cells. Once those cells are damaged—for example, when algae die, or when marine grazers like krill eat it—DMSP breaks down, producing DMS. The smell of DMS is how seabirds know that food is nearby—not by the algae, but because of the krill that eat the algae. \\nSeabirds are likely being tricked into eating marine plastic garbage because of the way it smells. Tests comparing the feeding habits of over 20,000 birds from more than 70 species showed that species of birds that use DMS as a foraging cue eat plastic nearly six times as frequently as species that are not attracted to the smell of DMS while foraging. In short, plastic is effecting the entire eco-system and even interfering with physiological signaling in birds . \\nThis research is likely just revealing the tip of the iceberg when it comes to the Great Garbage Patch and the ramifications of continuing to allow our ocean’s to be devastated with plastic trash. \\nThere is a bright side to learning about the true depths of this issue. Organizations like the Ocean Clean Up Project just revealed their prototype to address the problem:'"}, "time": 1742628569.8969777}