{"duration": 0.4947235584259033, "input_args": {"text": "'The last time Steve Kerr was in Beirut, his birthplace, with the bombs pounding the runway and the assassination of his father six months away, he left by car. The airport was closed. There was talk of taking a cruise ship to Cyprus, or accompanying an ambassador on a helicopter to Tel Aviv or even crossing into Israel on a bus. A military plane headed to Cairo had an empty seat, but it went to someone else. Finally, a hired driver took Kerr over the Lebanon Mountains and across the Syrian border to Damascus, then on to Amman, Jordan. It felt like an escape. “I’m fearful that all this uncertainty and inconvenience, not to mention even a sense of physical danger, has not done Steve’s image of Beirut much good, and in his present mood he wonders what any of us are doing here,” his father, Malcolm H. Kerr, the president of the American University of Beirut, wrote to other family members that day in August 1983. A few months later, Malcolm Kerr was shot twice in the back of the head outside his university office. Steve Kerr was 18 then, quiet and  . He was a lightly recruited freshman at the University of Arizona, before it was a basketball power. It took a vivid imagination to see him becoming an N. B. A. champion as a player and a coach, now leading the Golden State Warriors. But perhaps it should be no surprise that, at 51, Kerr has found his voice in public discourse, talking about much more than basketball: heavy topics like gun control,   protests, presidential politics and Middle East policy. With an educated and evenhanded approach, he steps into discussions that most others in his position purposely avoid or know little about, chewing through the gray areas in a world that increasingly paints itself in bold contrasts. In many ways, he has grown into an echo of his father. “The truly civilized man is marked by empathy,” Malcolm Kerr wrote in a foreword to a collection of essays called “The   Confrontation of June 1967: An Arab Perspective. ” “By his recognition that the thought and understanding of men of other cultures may differ sharply from his own, that what seems natural to him may appear grotesque to others. ” In a rare and sometimes emotional interview this fall, Kerr spoke about the death of his father and his family’s deep roots in Lebanon and the Middle East. Some of the words sounded familiar. “Put yourself in someone else’s shoes and look at it from a bigger perspective,” he said. “We live in this complex world of gray areas. Life is so much easier if it could be black and white, good and evil. ” Providing commentary on the state of today’s politics and culture is not a prerequisite for Kerr’s job. There are sports fans, maybe the majority of them, who wish athletes and coaches would keep their nonsports opinions to themselves  —   stand for the anthem, be thankful for your good fortune, express only humility, and provide little but smiles and autographs. Kerr understands that. Sports are a diversion for most who follow them, “only meaningful to us and our fans,” he said. In a sports world that takes itself too seriously, that perspective is part of the appeal of Kerr and the Warriors. They won the 2015 N. B. A. championship, were   last season and remain a top team this season. They seem to be having more fun than anyone else. But Kerr also knows that sports are an active ingredient of American culture. He knows, as well as anyone, that players are complicated, molded by background, race, religion and circumstance. And Kerr is, too: a man whose grandparents left the United States to work in the Middle East, whose father was raised there, whose mother adopted it, whose family has a different and broader perspective than most. The Kerrs are a family touched by terrorism in the most personal way. Malcolm Kerr was not a random victim. He was a target. That gives Steve Kerr a voice. His job gives him a platform. You will excuse him if he has a few things to say. “It’s really simple to demonize Muslims because of our anger over   but it’s obviously so much more complex than that,” he said. “The vast majority of Muslims are   people, just like the vast majority of Christians and Buddhists and Jews and any other religion. People are people. ” He delved into modern Middle East history, about World War II and the Holocaust and the 1948 creation of Israel, about the   War in 1967, about peace accords and the   conflict and the Iraq War and the United States’ scattered chase for whatever shifting   it has at any particular time. “My dad would have been able to explain it all to me,” Kerr said. Instead, he absorbed it as a boy and applies it as an adult. “He at least gave me the understanding that it’s complex. And as easy as it is to demonize people, there’s a lot of different factors involved in creating this culture that we’re in now. ” Malcolm Kerr was a professor at U. C. L. A. for 20 years, and the sprawling ranch house where the family lived in Pacific Palisades, Calif. has a flat driveway and a basketball hoop bolted to the roof above the garage. Steve Kerr spent countless hours in the driveway practicing the shot that would give him the N. B. A. record for career   percentage that still stands. But not all memories in the driveway are about basketball. “I remember when the Camp David accords happened,” Kerr said, recalling the 1978 peace talks between Menachem Begin of Israel and Anwar   of Egypt, shepherded by President Jimmy Carter. Kerr had just entered his teens. “One of my best friends was a guy named David Zuckerman, a Jewish guy, and his father was an English professor,” Kerr said. “Mr. Zuckerman and David drove me home from baseball practice or something, and we pull up in the driveway and my dad sees us and comes running out. Mr. Zuckerman’s name was Marvin, and my dad said: ‘Marvin, Marvin! Did you see the picture today of Begin and Sadat?’ It was the biggest thing. It would have been the equivalent of the Dodgers winning the World Series. He was so excited for that moment because that is what he really hoped for: Middle East peace. That was his dream. That day, I’ll never forget it. ” Kerr paused. “And then it was only a short time later that Sadat was killed,” he said. The Sadat assassination was in October 1981, just 27 months before Malcolm Kerr was killed. Malcolm Kerr’s parents, Stanley and Elsa Kerr, were American missionaries who met in the Middle East after World War I. He worked for American Near East Relief in Turkey during the slaughter of countless Armenians (detailed later in his memoir, “The Lions of Marash”). She had traveled to Istanbul to study Turkish and to teach. They married in 1921 and moved to Lebanon to run orphanages. They went on to teach at the American University of Beirut for 40 years. Malcolm was one of their four children. He went to the United States for prep school and graduated from Princeton before he returned to A. U. B. for graduate school. It was there that he met Ann Zwicker, an Occidental College student from California spending a year studying abroad. Beirut was a cosmopolitan,   city on the Mediterranean, a mix of Christians and Muslims seemingly in balance, if not harmony. A. U. B. was founded in 1866 (it celebrated its 150th anniversary on Dec. 3) as a bastion of free thought and diversity, welcoming all races and religions. As wars and crises suffocated the Middle East in recent decades, it has often felt like an island, protected by prestige and  . Malcolm and Ann married and raised four children: Susan, John, Steve and Andrew. The first three were born in Beirut. Malcolm Kerr took a teaching job at A. U. B. but the Kerrs settled in California when Steve was a toddler. Malcolm Kerr’s tenure at U. C. L. A. was sprinkled with sojourns and sabbaticals that persistently pulled the family back to the Middle East. Steve Kerr spent two separate school years in Cairo. There were summers in Beirut and Tunisia, another year in France, and road trips circling the Mediterranean in a Volkswagen van. Steve “was not always thrilled,” he admitted, to leave friends and the comfort of California. He hated to miss sports camps and football and basketball games at U. C. L. A. where the Kerrs had season tickets. In hindsight, though, his family’s long history in the Middle East, beginning nearly 100 years ago, shaped him in ways that he only now realizes. “It’s an American story, something I’m very proud of, the work that my grandparents did,” Kerr said. “It just seemed like a time when Americans were really helping around the world, and one of the reasons we were beloved was the amount of help we provided, whether it was after World War I, like my grandparents, or World War II. I’m sort of nostalgic for that sort of perception. We were the good guys. I felt it growing up, when I was living in Egypt, when I was overseas. Americans were revered in much of the Middle East. And it’s just so sad what has happened to us the last few decades. ” Kerr was in high school when his father was named president of A. U. B. in 1982. It was Malcolm Kerr’s dream job. But the appointment came as Lebanon was embroiled in civil war. Yasir Arafat’s Palestine Liberation Organization, expelled from Syria, had its headquarters in Beirut. Iranian Shiites, followers of Ayatollah Ruhollah Khomeini, had moved into Lebanon and given voice to the impoverished Shiite minority there. The Christian population was shrinking, and Lebanon was in the middle of a tug of war between Israel and Syria. “I bet there’s a   chance I’ll get bumped off early on,” Malcolm Kerr told his daughter, Susan, in March 1982, she recalled in her memoir, “One Family’s Response to Terrorism. ” He accepted the job the next morning. The Israeli invasion of Lebanon, and the countermove by the Iranians to send its Iranian Revolutionary Guards there through Syria, began in June 1982, weeks before Malcolm Kerr was to start the new job. In the chaos,   militants were organizing and would eventually become Hezbollah. Malcolm Kerr was kept in New York until things settled, but A. U. B. ’s acting president, David Dodge, was kidnapped in July, and A. U. B. was in need of leadership. Malcolm Kerr arrived in August, expressing hope that the destruction and death closing in on the campus could be kept outside its walls. (Dodge, who was released by his captors after a year, died in 2009.) Back in California, Steve began his senior year and starred on the basketball team. “I wanted him to be at games, but I knew that he was doing what he loved,” Kerr said. “And when you’re 16 or 17, you’re so  . You just want to play and do your thing. ” Malcolm Kerr wrote letters home almost daily. They detailed tense meetings with political leaders, the latest assaults on Beirut, the assassination in September 1982 of the Lebanese   Bashir Gemayel, the interviews with foreign journalists. Most were filled with optimism and good humor. “The thought of being in Pacific Palisades for Christmas is more appealing than I can say, and I wouldn’t miss the chance for anything,” he wrote in one. “Hopefully I’ll get there in time to catch a few of Steve’s basketball games and watch Andrew wash the cars. ” That December, the Kerrs posed at their California house wearing matching A. U. B. sweatshirts. Steve Kerr went with his mother and brother Andrew to Beirut in the summer of 1983, before he went to play at Arizona for   coach Lute Olson. A few months before, militants had bombed the United States embassy in Beirut, killing 63, including 17 Americans. But the visit fell during what felt like a lull in the war. “We went hiking in the mountains above Beirut and swimming in the Mediterranean,” Kerr said. “The house where they lived was on campus  —   the presidential house, the Marquand House. It was beautiful. It was surreal. There was a butler. We didn’t have that back home. But now he was living the life of the president. We had a great time during the day, and then we played cards after dinner outside. ” The trick was leaving. Ann Kerr went with Steve to the airport in August. “There was some question about whether flights would be going out because of everything that was happening,” Kerr said. “We were in the terminal, and all of a sudden there was a blast. It wasn’t in the terminal but on the runways. The whole place just froze. Everybody just froze. People started gathering, saying, ‘We’ve got to get the hell out of here.’ My mom grabbed me, and I remember running out of the terminal and through the parking lot. It was really scary. I remember thinking, ‘This is real. ’” The Kerrs pondered options for getting Steve out. They learned that a private plane of diplomats was going to the United States Marine base and there might be an available seat on the flight back out. Steve spent hours waiting, talking to Marines. In the end, there were no seats. The Kerrs eventually made arrangements for a university driver to take Steve over the mountains, through Syria to Jordan. (The driver, a longtime friend of the family, was killed by a sniper in Beirut in 1985.) On an early morning in October 1983, a truck bomb destroyed the   Marine barracks. Among the dead were 220 Marines and 21 other service members. “I remember looking at all the photos afterward,” Kerr said. He started to cry. “I see all these, the nicest people, who I met and they were showing us around the base and just trying to do their jobs and keep the peace. And a truck bomb?” Kerr said he recognized some of the faces of the dead. “There is a chaplain who had come over and kind of taken us under his wing,” he said. “The nicest guy. And I saw his face. . .. ” Kerr wiped his eyes and took a deep breath. “What has it been, 30 years? And it still brings me to tears. ” In December, John visited his parents in Beirut. They had a videotape of Steve’s first game for Arizona a couple of weeks before. The picture was fuzzy, shot without sound from a camera high in the gym, and they could not always tell which player was Steve. It did not matter. “I think he scored three baskets, and we must have watched each of them 10 times, rewinding the tape over and over again just to relish every detail,” John wrote in an entry for a family scrapbook made on an anniversary of Malcolm Kerr’s death. He called it “Dad’s and my high point as sports fans. ” In the middle of a night in January 1984, Kerr got a call in his dorm room from Vahe Simonian, a family friend and a vice president at A. U. B. who was based in New York. Simonian told Kerr that his father had been killed. The assassination on Jan. 18, 1984, was international news, including on the front page of The New York Times. Malcolm Kerr, 52, had stepped off the elevator toward his office in College Hall and was shot in the back of the head. The two unknown assailants escaped. A group calling itself Islamic Holy War took responsibility later that day. “Dr. Kerr was a modest and extremely popular figure among his 4, 800 students and faculty, according to his colleagues here,” Times reporter Thomas L. Friedman wrote from Beirut that day. “He was killed, his friends insist, not for being who he was, but because now that the Marines and the American Embassy in Beirut are smothered in security, he was the most vulnerable prominent American in Lebanon and a choice target for militants trying to intimidate Americans into leaving. ” Andrew Kerr, who was 15 at the time, heard about his father’s death on a radio in a shop near A. U. B. ’s campus. Ann Kerr learned about it while waiting at a campus guardhouse, out of the rain, for a friend. She ran to College Hall, to the second floor, where she found her husband “lying on the floor, face down, his briefcase and umbrella in front of him,” she wrote in her memoir, “Come With Me From Lebanon. ” A memorial service was held a few days later. John came from Cairo and Susan came from Taiwan. Steve was the only one of the children who did not attend. He missed another one at Princeton, but attended a third in Los Angeles. “It sounds bad,” he said. “Obviously, the basketball wasn’t more important. But the logistics were really tricky. And it was cathartic for me to just play. ” He had a breakout game in a victory over rival Arizona State two nights after his father’s death. The Wildcats had been   but won eight of their final 14 games. The next year, they reached the N. C. A. A. tournament on their way to becoming a lasting national power. Four years later, Kerr was the target of pregame taunts at Arizona State. A group of students shouted, “P. L. O. P. L. O. ,” “Your father’s history,” and “Why don’t you join the Marines and go back to Beirut?” “When I heard it, I just dropped the ball and started shaking,” Kerr said at the time. “I sat down for a minute. I’ll admit they got to me. I had tears in my eyes. For one thing, it brought back memories of my dad. But, for another thing, it was just sad that people would do something like that. ” Ann   is 82, wears Keds and keeps her hair in a   bob. She is the longtime coordinator of the Fulbright program at U. C. L. A. and oversees a class called “Perceptions of the United States Abroad. ” She is also an emeritus trustee at A. U. B. and usually goes back to Beirut once a year for meetings. She remarried in 2008. She and Ken Adams share the California house that she and Malcolm bought in 1969. The stately living room, with a grand piano and views of the Pacific Ocean, is neatly decorated with treasures of a   life, like etchings of Cairo and Ann’s framed watercolors of Tunisia. The mantel has an   photograph of Steve and Andrew in a field of flowers in Morocco. “I would say Steve’s intellectual interests really blossomed in the last 10 years,” she said. “But I don’t think of Steve being like Malcolm. ” They shared a passion for sports (the children’s    limit for television did not apply to sports) and an irreverent sense of humor. But Steve is more diplomatic than his father, she said. A nearby guest room was where the three Kerr boys slept. The bunk beds that Steve and Andrew shared are gone, but there is a painting that Steve did as a boy  —   a   of him in a U. C. L. A. shirt and a Dodgers cap, his blond hair hanging past his ears. The bathroom has a painting of poinsettias he did when he was 9, and a closet contains his screen prints of boats in Cairo. “Here’s a picture of Steve, the ornery teenager,”   said on a recent Sunday afternoon, stopping in a hallway lined with family photographs. “He was always snarling in pictures. Now he has to smile for photos. The irony of it all. ” Across the hall is the room that Malcolm used as an office. His children harbor happy memories of the sound of his typewriter clacking and the smell of the popcorn that he liked as a snack. The backyard, with wide ocean views that test the flexibility of the human neck  —   from Los Angeles on the left, to the Santa Monica Mountains on the right  —   features a broad patio. On Sunday afternoons, it was frequently filled with professors, neighbors, visiting dignitaries and friends from around the world. It was the family’s connection to the Middle East that made his childhood unique. “It would be totally different without that,” Kerr said. “Totally different. I wouldn’t be exposed to not only the travel and the interaction with people, but I wouldn’t be exposed to the political conversations at the table and at barbecues about what was going on in the world. ” But talk around the house was more likely to involve the Dodgers or Bruins. Malcolm was a good athlete, a basketball player growing up and an avid tennis player until the end. He and Steve spent a lot of time at the high school hitting and fielding, and Malcolm sometimes joined Steve in the driveway. “He was a lefty and had a nice hook shot,” Kerr said with a laugh. Kerr credits his father for his demeanor on the sideline as an N. B. A. coach: calm and quiet, mostly, and never one to berate a player. Kerr was not always that way. “When I was 8, 9, 10 years old, I had a horrible temper,” Kerr said. “I couldn’t control it. Everything I did, if I missed a shot, if I made an out, I got so angry. It was embarrassing. It really was. Baseball was the worst. If I was pitching and I walked somebody, I would throw my glove on the ground. I was such a brat. He and my mom would be in the stands watching, and he never really said anything until we got home. He had the sense that I needed to learn on my own, and anything he would say would mean more after I calmed down. ” His father, Kerr said, was what every Little League parent should be. The talks would come later, casual and nonchalant, conversations instead of lectures. “He was an observer,” he said. “And he let me learn and experience. I try to give our guys a lot of space and speak at the right time. Looking back on it, I think my dad was a huge influence on me, on my coaching. ” Kerr played for some of the best basketball coaches in history  —   Olson at Arizona, Phil Jackson with the Chicago Bulls and Gregg Popovich with the San Antonio Spurs among them. By the standards of basketball coaches, they were worldly men with interests far beyond the court. “I remember Phil talking to the team about gun control, and asking the players: ‘How many of you have guns? How many of you know that if you have a gun in your house you’re more likely to have a fatality in your house? ’” Kerr said. “It was a real discussion, with guys saying that we need to have some level of protection, because we are vulnerable in many ways, too. “And I remember one presidential election, it was probably 2000, I was with the Spurs and we did two teams shooting  —   the silver team against the black team or whatever,” he said, referring to a drill run by Popovich. “Pop was like, ‘O. K. Democrats down there, Republicans down here.’ I think it was about 12 against two at that point, so he had to even up the teams a little bit. He would just make it interesting. ” Kerr  —   who has three children, all young adults, with his wife, Margot  —   has never talked about his father in front of the team, and Warriors players have only a vague notion of Kerr’s family history. It is context, mostly, an unstated part of his background. “I really realized from Pop and Phil that I could use my experience as a kid and growing up to my advantage as a coach,” Kerr said. “And connect with players and try to keep that healthy perspective. Keep it fun, and don’t take it too seriously. ” It was during Kerr’s tenure with San Antonio that the family, after years of reflection following the 1996 passage of the Antiterrorism and Effective Death Penalty Act, decided to sue Iran. The Kerrs came to believe that   Hezbollah had targeted Malcolm. “I didn’t need revenge, I didn’t need closure,” Steve Kerr said. “So I was indifferent to the lawsuit. But then I recognized that it was important to a couple of members of my family, my sister and my younger brother, in particular. ” When it came time to testify in United States District Court in Washington in December 2002, Kerr was with the Spurs, in the last of his 15 seasons in the N. B. A. He did not want to miss games. “There’s nobody better than Pop to talk about something like this,” Kerr said. “I told him, ‘I don’t really want people knowing what it is.’ I didn’t want the attention. But I also don’t want people thinking I’m injured. So Pop said: ‘You missed two games for personal reasons. Big deal. Your reputation precedes you. Nobody is going to question what’s going on with you.’ And he was right. I told my teammates and nothing ever really came of it. ” He testified in a nearly empty courtroom, missing two Spurs’ road games on the West Coast. The Kerrs learned two months later that they had won the suit  —   millions of dollars that they may never see. But money was never the point. “It provides a structure to enable people to channel their feelings through justice and the rules of law, rather than become vigilantes,” his sister, who is now known as Susan van de Ven, said in a phone interview from England, where she is involved in politics as a county councillor. “It gives a very focused approach to people who are rightly and insanely aggrieved. That’s the kind of culture we should have. We shouldn’t be responding with violence. I’m sure that’s why Steve talked about guns. It’s all related, isn’t it?” Her book detailed the family’s experience with the lawsuit. The night before the Warriors visited President Obama to celebrate their 2015 N. B. A. championship, Steve had dinner with Andrew, who works for an architectural design and residential builder in Washington. They discussed what Steve might say to the president. Andrew recommended complimenting him on his efforts toward gun control. Kerr did. In June, at the end of a podcast with Bay Area sports columnist Tim Kawakami, Kerr asked if he could raise one more topic. Our government is “insane,” he said, not to adopt stronger background checks on guns that most Americans agree upon. “As somebody who has had a family member shot and killed, it just devastates me every time I read about this stuff, like what happened in Orlando,” Kerr said, referring to the June massacre at a Florida nightclub. “And then it’s even more devastating to see the government just cowing to the N. R. A. and going to this totally outdated Bill of Rights, right to bear arms. If you want to own a musket, fine. But come on. ” Since then, Kerr has become a   voice in sports for matters of bigger meaning. It surprises his family in some ways, knowing that he was probably the quietest of the siblings as a child. “He’s carrying around the family business in another discipline,” said John Kerr, a professor of community sustainability at Michigan State. “There was no way he would do anything for a living that didn’t involve sports. No way. And now that he’s at the pro level, he has the opportunity to speak out. He’s smart enough to realize he can do it. ” N. B. A. training camps began just as debate swirled over the decision by Colin Kaepernick, the San Francisco 49ers quarterback, not to stand for the national anthem, a protest over the killing of unarmed black men by police officers. Amid the divisiveness, Kerr was a nuanced voice in the middle. “Doesn’t matter what side you’re on on the Kaepernick stuff, you better be disgusted with the things that are happening,” Kerr said. He added: “I understand people who are offended by his stance. Maybe they have a military family member or maybe they lost someone in a war and maybe that anthem means a lot more to them than someone else. But then you flip it around, and what about nonviolent protests? That’s America. This is what our country is about. ” In November, after the presidential election, Kerr was among the N. B. A. coaches, including Popovich, who criticized the state of political discourse in the age of Donald J. Trump. “People are getting paid millions of dollars to go on TV and scream at each other, whether it’s in sports or politics or entertainment, and I guess it was only a matter of time before it spilled into politics,” Kerr said. “But then all of a sudden you’re faced with the reality that the man who’s going to lead you has routinely used racist, misogynist, insulting words. ” It is no surprise, then, that Kerr also has opinions on the Middle East. Like his father decades ago, Kerr said he believes that American policies have muddied the region. The heart of the problem, he said, stems from the lack of a   solution for Israel and Palestine. The Iraq War made things worse. “To use Colin Powell’s line, ‘If you break it, you own it,’ and now we own it,” Kerr said. “And it’s, like, ‘Oh, my God, wait, it’s so much more complicated than we thought.’ Everybody looks back and thinks we would have been way better off not going to war. That was really dumb. But history repeats itself all the time. We didn’t need to go into Vietnam, but circumstances, patriotism, anger, fear  —   all these things lead into war. It’s a history of the world. It just so happens that now is probably the scariest time since I’ve been alive. ” In Beirut, A. U. B. still thrives. On its campus overlooking the Mediterranean is a new College Hall, a virtual replica of the one where Malcolm Kerr was killed, the building destroyed by bombs in 1991. There is the dignified Marquand House, where Malcolm Kerr lived when he was a young professor and returned to when he became president. In an oval garden between College Hall and the chapel, there is a banyan tree that Malcolm Kerr climbed as a boy and carved with his initials, now high out of sight. Under the tree is a Corinthian column that the family chose in the days after his death to mark the spot where his ashes were buried. “In memory of Malcolm H. Kerr, ” the engraving reads. “He lived life abundantly. ” Those were the words that Susan wrote on a piece of paper that marked the site until the stone was etched. The paper is still there, on a plaque that also features an excerpt from  ’s book. “We are proud that our dad and husband came to A. U. B. ,” Susan wrote, in words that are now faded with time. Steve Kerr has never seen it. He has not been back since his father was killed. But, more and more, he hears the echoes.'"}, "time": 1742563592.9693456}