{"duration": 0.05095314979553223, "input_args": {"text": "\"Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nIt’s been a weird 24 hours if you happen to live inside the head of Sean Hannity. The Fox News pundit and Trump propagandist has been live tweeting some sort of mental breakdown and it’s entirely unclear what the endgame is. \\nIt started like this: For reasons unknown, on his radio show Hannity told listeners that he would be asking Donald Trump for help in shipping the Obama family – all of whom are Americans – to Kenya after the election. \\nIf you’re saying to yourself “Wow, that sounds pretty racist” the answer is yes, yes it is . There is no universe in which a person telling America’s first black president to go back to Africa cannot be construed as a racist statement. That is, unless you happen to reside in the fantasy world that Sean Hannity currently lives in. \\nAfter getting rightfully hammered for the comments, Hannity either got very drunk or had a psychotic break and tweeted out a profoundlymisspelled defense of what he said. The tweets wouldn’t pass a breathalyzer. \\nTweet #1 (now deleted): \\nLiberal media. It’s was Josh Ernest who refuse to amswee teh ? Will Obama stay in the US if DT wins. I mentioned I’d pay a charter to … \\n“amswee teh ?” Really? \\nTweet #2 (now deleted): \\nLiberal media 2 Any country they choose. 1- Canada where the satire piece was written Kenya where he visited \\nThe second tweet also linked to the website of infamous conservative provocateur Chuck Johnson, a racist white nationalist who once proposed the theory that Obama was a gay prostitute. Johnson is so morally repugnant that he was officially permanently banned from ever holding an account on Twitter. \\nAfter waking up, Hannity got back on Twitter to do damage control. According to him, these incoherent cries for help weren’t what they looked like, he just didn’t have his glasses on… Half asleep and didn't put my glasses on. Lol. I wish I had a better excuse. https://t.co/GUvw7ef2AV \\n— Sean Hannity (@seanhannity) October 27, 2016 \\nHe also doubled down on his defense of telling Obama to go to Africa. I said I'll send him anywhere he wants to go. I mentioned Canada first, Kenya where part of his family is today, Jakarta where he once lived https://t.co/wvNxCMTXYu \\n— Sean Hannity (@seanhannity) October 27, 2016 \\nNone of which “answee teh ?” of why the Obama family should be exiled to another country in the first place. Glasses or not, that’s a level of fascist thinking that has been relatively unthinkable in American democracy. Only since the rise of Trump, and his avowed policy of going after his political and personal enemies after he’s elected, would the idea of banning a former president from the country even be imagined. Now it’s being normalized by a Fox News pundit with an audience of millions. \\nSean Hannity has been a hack for many years, but Donald Trump finally completely severed his grip on reality. We’re witnessing what happens when a man with major delusions gets to indulge them in front of an audience of millions each night on a major network – and it isn’t pretty. \\nFeatured image via Fox News Share this Article!\""}, "time": 1742562193.6426408}