{"duration": 0.055619001388549805, "input_args": {"text": "'ROME (AP)  —   Jim Harbaugh didn’t have a great answer, believe it or not. [Speaking with a    Nigerian refugee who now lives in Rome, Michigan’s coach was presented Sunday with the basic, fundamental question of why American football is called “football,” given that players barely use their feet.  At a loss for words, Harbaugh summoned his father, Jack, to help give a quick lesson. All in a day’s work. All part of the Roman experience. All part of Michigan football’s   blitz of Rome. “The smiles on everybody’s faces here,” Jack Harbaugh said, “it’s just so fantastic. ” The Wolverines landed in Italy around 9 a. m. Sunday. The entire group has yet to arrive  —   more will be on the way Monday. But the first group of travelers exited their   flight and headed straight toward Rome’s Villa Borghese, a spacious park in the center of the city. There, they spent some time with refugees from the Joel Nafuma Refugee Center, which is located at St. Paul’s Within The Walls Episcopal Church. St. Paul’s, built in 1873, was the first Roman   church to be built inside Rome’s city walls. Michigan handed out more than 50 Jordan Brand backpacks, filled with Michigan gear, to the refugees in the park. The Harbaughs  —   father and son  —   gave a quick lesson to the refugees about how football is played. “These are precious gifts,” said    Ade Dagi, a Nigerian refugee who came to Italy in 2015. “It’s beautiful. ” The Wolverines will spend the first four days of the trip touring Rome  —   an excursion that will see them visit the Colosseum, the Pantheon, the Spanish Steps, the Vatican and more. Harbaugh, his wife and two players (Grant Newsome and Salim Makki) will have a chance to sit near Pope Francis on Wednesday during his weekly Mass. The rest of the team will also be in attendance before touring St. Peter’s Square. Michigan is the first Football Bowl Subdivision team to take a spring trip abroad, and it’s already seeing the benefits. “(A refugee) I met said he came here with one shirt on his back, a pair of shorts and some shoes that didn’t fit,” Michigan quarterback Wilton Speight said. “A lot of us take that for granted. We’re here in Jordan jumpsuits with an American and Italy flag on them. It kind of puts all this in perspective a little bit. ”'"}, "time": 1742562282.4853897}