{"duration": 1.257101058959961, "input_args": {"text": "'Theresa Crouse November 13, 2016 Survival Pharmacy: 9 Ways To Use Ginger For Your Health \\nGinger has been used for centuries for medicinal and culinary purposes. Though we don’t use it commonly in much American cooking, you’re likely familiar with pickled ginger when you eat sushi and it’s also becoming a popular dried and candied product. \\nThe medicinal properties and ease of growth make ginger a plant that you should definitely be growing for your survival garden! \\nI’ve been growing ginger in a potted plant inside, which is the best way to grow it if you live in a small space or a region that gets cold. It doesn’t like the cold, so if you live in a cooler area, you need to grow it indoors or outdoors in pots so that you can bring it inside before the frost. \\nThe actual growing part is easy but first, let’s clarify something. Ginger isn’t a root; it’s a rhizome. It does have roots, which are the long, hairy-looking parts that draw in moisture just like roots do for any other plant. Rhizomes are actually underground parts of the stem. They grow horizontally under the ground, with roots on the bottom. New stems grow from the top to the surface. \\nIt’s the rhizome part that we eat, but most people refer to it as ginger root, so we’ll still do the same. Ginger rhizomes grow buds, or eyes, similar to potatoes. Those are the parts that will grow. \\nWhat Part do you Plant? \\nPlanting ginger is similar to planting potatoes; you plant the buds that grow off of the rhizome. On a potato, we call them eyes. You can buy the rhizome at your local garden store or order from a seed store. Another option is to just allow a ginger root that you buy from the grocery store to bud, then plant it. \\nOne problem with using one from a grocery store is that they’re often sprayed with growth inhibitors to keep them from budding while they’re on the shelf. You can soak the ginger to get as much of this off as possible, but you still may have problems getting it to bud. If you can, then go for it! \\nAnother problem with using a store-bought one is that it may have pesticides or herbicides on it. To resolve both problems you could buy organic. It’s a bit more expensive but if you can’t find anything at your local stores, then this is a good option. \\nPerfect Growing Conditions \\nGinger likes rich, moist soil, partial or full shade, humidity, and warm weather. The soil needs to drain well in order for the rhizomes to develop. They grow horizontally, so they’re one of the few plants that flourish in shallow containers. I live in Florida, so my soil is sandy and the weather is, of course, temperate so I could plant outside if I wanted to. \\nI just scoop soil right out of the ground for my dirt, then mix it half and half with compost . Since I use a pot (actually a rectangular box) and rich soil I don’t add any type of fertilizer. The plant will only grow 2-3 feet tall and it smells great. \\nIf you plant it outside in soil that’s less than ideal, or if you get a lot of rain, give it a drink of the fertilizer or compost tea of your choice every couple of weeks or so. The reason for this is that when it rains, the water washes all the nutrients out of the soil. \\nPut mulch around it too. That helps keep the moisture in and it nourishes the plant as the mulch decomposes. It also helps keep out weeds because ginger is pretty delicate and other plants will plow it right over. It doesn’t like wind, either. \\nSo … to recount, no wind, no cold, no full sun, and not too much water. Instead, it likes rich, well-draining soil, moderate moisture, and partial sun or shade. \\nPreparing and Planting \\nIf your rhizome has more than one bud, you can cut it into pieces, leaving a bud on each piece, then plant them. You can also just plant the entire thing. Let the rhizomes soak overnight, then bury them 3-6 inches deep and water sparingly, just enough to moisten the soil. Some people prefer to let them sit in water until the grow roots before they plant them, but I haven’t found that to be necessary. \\nBest time to plant is late winter/early spring as long as you’re not planting outside in a cold zone. If you live in a tropical zone, plant it at the end of the dry season/beginning of rainy season. \\nYou don’t need much space to plant enough ginger to get you through the year. Each rhizome will only produce a few leaves the first year and they don’t mind living in close quarters. Plant them 6-8 inches apart and they’ll be fine. Video first seen on DIY Home and Garden . \\nHarvesting Ginger \\nThis is the best part! Once your ginger has been growing for three or four months, you can trim pieces of the rhizome off of it simply by digging through the soil to the side of the plant and just nipping a piece off the end, then covering it back up. This green ginger won’t be quite as flavorful as ripe ginger, but it’s still good. \\nYou can also wait until the end of the season and harvest the ginger when the plant starts to die off. This takes about ten months to happen. If the temperature allows (or if you’re growing inside), you can replant right away. Harvest all of the ginger, break the rhizomes apart, and separate out a few that have good buds. \\nToss those back in the ground or pot and use the rest. Ginger freezes well. You can also store it for several months in a root cellar, slice it thinly and dehydrate it, candy it, or pickle it. If you dry it, you can grind it into ginger powder that is great for baking or medicinal use. \\nMedicinal Uses for Ginger \\nNow we’re down the heart of the matter – why growing ginger is a good thing for a prepper to do. The active ingredient in ginger – gingerol – is an antibiotic, anti-viral, anti-inflammatory, and antioxidant. It’s also an anti-coagulant. There’s a reason ginger is considered a superfood! \\n1. Heart Disease and Stroke \\nSince it’s an anti-coagulant, which means it prevents your blood from clotting, it can help you avoid heart attacks and strokes. Its antioxidant properties also help fight free radicals that cause heart disease, so it’s a double whammy. \\n2. Stomach Upset, Heartburn, and other GI problems \\nGinger has been used in holistic medicine for centuries to treat all sorts of upper gastrointestinal problems. It’s good for stomach upset, heartburn, constipation, bloating, and even morning sickness during pregnancy. That’s because it helps induce the stomach to release its contents into the small intestine. \\nIt’s also effective at treating ulcers. \\nThis is now officially backed by science. I actually use it to get rid of heartburn by eating a slice or two of candied ginger. You can also drink it in a tea for quick relief. \\n3. Motion Sickness \\nThough this is going to be a short section, it’s well warranted because ginger has actually been shown in at least one study to treat motion sickness, especially seasickness, more effectively than Dramamine! Ginger doesn’t just ease the nausea; it treats ALL of the symptoms: nausea, cold sweats, and dizziness. \\n4. Strengthens Immune System \\nInterestingly enough, ginger’s beneficial effect on digestion also helps your immune system because, in addition to the antioxidants, a healthy digestive tract is required for proper nutrient absorption. \\nNot only that, gingerol has the effect of boosting your body temperature – maybe that’s why gingerbread is so great in the winter! –which may help remove toxins that prevent your immune system from functioning properly. \\n5. Arthritis, Muscle Soreness, and Joint Pain \\nSince gingerol is an anti-inflammatory, it’s extremely effective at relieving the pain and swelling of arthritis. People with rheumatoid arthritis and osteoarthritis report noticeable relief of pain as well as increased mobility when they consume ginger regularly. \\nHave you had a rough workout? Eat some ginger or drink ginger tea. You’ll feel better shortly! \\nThis isn’t just something that “people say”. It’s been quantitatively measured in studies where arthritic inflammation was measurably decreased. In other words – it works!! \\n6. Fight Staph and Strep \\nAgain, science prevails. Recent studies have shown that ginger essential oil was more effective than traditional antibiotics at treating staph and strep infections. If nothing else, it won’t hurt to take it if you’re going to be in a hospital or round somebody who’s sick. \\nAnd if you’re sick, ginger doesn’t interact with other medications so you can’t do any harm! Oh, and other studies have shown that it’s just as effective on other types of bacteria. \\n7. Diabetes \\nThis is extremely new research, but it’s big, especially since we, as preppers, don’t have any way to prepare for life without access to many life-saving medications. Insulin is one of those drugs that are absolutely critical for survival but doesn’t have an effective natural alternative – at least until (hopefully) now. \\nTwo grams of ginger powder per day was shown to decrease resting blood sugar by 12 percent. Instead of getting really scientific here, I’m just going to give you a link to the research findings so that you can see the details and additional results. \\n8. Menstrual Pain \\nOne gram of ginger powder per day works as well for many women to relieve menstrual cramps and pain as ibuprofen. \\n9. Enhance Brain Function and Prevent Alzheimer’s \\nBecause of the anti-inflammatory properties of ginger, studies have shown that it can help prevent cognitive decline. It can also help prevent disorders such as Alzheimer’s, which wasn’t’ actually a surprise to me once I read the results of the diabetes study – Alzheimer’s has actually been commonly referred to in many circles in recent years as Type 3 diabetes. \\nYou can reap any of these benefits by eating ginger raw, candied, or by making a tea with it. You can also juice it, but I’ve found that to be ineffective in a manual juicer. Even in an electric juicer, you don’t get much juice from ginger and it requires a high-power juicer because it’s so hard. \\nThere’s also the option of making an essential oil, which isn’t as difficult as you may think. \\nGinger is an amazing food that’s easy to grow, doesn’t take up much space, and has medicinal properties that could very well save lives if SHTF. \\nI hope that this information has helped. I seriously drink this particular Kool-Aid so I know for a fact that it works, at least for stomach problems and joint pain, so I’m happy to vouch for it from a personal standpoint. There are many other benefits – I just touched on a few of the most important ones here. \\nI’ve discussed the health benefits of garlic and other plants for the same reason – grow them, too! \\nIf you’ve grown ginger or have any health benefits or personal success (or report of a tall-tale), please share it with us in the comments section below. \\nKnowledge is the most important survival skill. Discover how our ancestors grew, harvested and used survival plants during harsh times. \\n  Theresa Crouse for Survivopedia. 3 total views, 1 views today'"}, "time": 1742564273.5890017}