{"duration": 0.07629871368408203, "input_args": {"text": "'With sexual assault cases up more than 60 per cent in just one year, and ‘unaccompanied minors’ mugging pensioners to pay for hard drugs, police in Uppsala admit crime in the city has reached new levels. [“These are challenges like we’ve never seen before” said Uppsala police commissioner Daniel Larsson, quoted in a press release on the force’s website which states the city has “a brand new street scene [  …    ] today compared to just a few years ago. ”  Between summer 2015 and summer 2016 the city also saw a 60 per cent rise in muggings, and police reported that officers feel they are facing a “harsher climate and reduced respect for their profession” while out on patrol. Drugs are one of the key factors driving the crime wave in Uppsala, according to the city’s police, with sales of illicit substances including heroin taking place out in the open. At the end of February, Uppsalatidningen reported a huge uptick over previous weeks in the number of young people addicted to drugs who are committing robberies to fund their addiction. Recent cases noted by the newspaper include that of a    man and a    man who were attacked in muggings where the criminals seized, or attempted to wrest, jewellery from their victims’ person. Mr Larsson said the robberies are linked to rocketing use of heroin  —   a problem he says was previously unknown in the city  —   and that “at least 90 unaccompanied minors” are using the drug at the Travel Centre. Noting that people from Afghanistan are “ ” among the abusers, the police commissioner suggested that this is down to the country’s history of opium production as well as “well known problems of segregation”. Another type of theft the police say is on the rise due to drug abuse is where large groups of young people will enter retail shops and draw the staff’s attention while thefts are carried out in other parts of the store. Workers in Uppsala are feeling increasingly insecure too, due to groups of youths congregating after dark, according to area police officer Magnus Sundberg. On Friday, Moderate party MP Marta Obminska wrote to Sweden’s interior minister about crime plaguing the city, where she said “people, not just girls” now find it uncomfortable to go outside. “And this doesn’t just apply during the night. People avoid the Travel Centre and some parts of town. They are attacked with a knife or gun from behind. This is not the Uppsala we desire. “According to the police, there are ninety unaccompanied refugees in Uppsala who abuse heroin. Muggings are also carried out by the Moroccan street children. They are suspected to be a big part of personal robberies  —   performed to fund addiction  —   but also other criminal acts” wrote the MP. Describing the situation as “serious” and noting there was even a shooting in the city this weekend, Ms Obminska told 24Uppsala. se that “muggings take place regularly, from early evening to morning. ” The Swedish establishment has been keen to discredit claims that its open border policy has led to trouble. U. S. President Donald J. Trump drew attention to the Nordic nation recently, stating at a rally that the country is “having problems like they never thought possible” as a result of mass migration. Slamming the President’s speech as having been designed “to send a message that large scale migration harms a country” Sweden’s former Prime Minister Fredrik Reinfeldt insisted that mass migration had made the country safer. But Integration Minister lva Johansson was forced into an embarrassing   on Saturday after she falsely told BBC the number of reported rapes in the country was falling. Having drawn sharp criticism from MPs, economists, and criminologists, the liberal minister had to correct herself after being told that reported rapes had risen 13 per cent from the previous year.'"}, "time": 1742563558.1763937}