{"duration": 0.10773611068725586, "input_args": {"text": "' Deplorables 1, Empire 0 By Paul Edwards\\nNovember 11, 2016 \" Information Clearing House \" - It\\x92s done. The foolish, arrogant propaganda excreted by the captive press of the Imperial Establishment is flushed, and they and their owners are eating their hubris, choking down the bitter, toxic medicine they inflicted on themselves. The nightmare they swore could never win is the Chosen One.\\nWhat this may mean to them, to all of us, and to The Empire, no one can guess. The origin, though, of what Michael Moore called the greatest \\x93Fuck You\\x94 in our political history, is clear behind the shock and awe of the elite.\\nBetween them, Trump and Clinton diligently stripped away the last shreds of the rent and ragged camouflage that disguised our zombie body politic.\\nBehind the mantra of Exceptionalism, the American Empire has behaved with exactly the same solipsistic arrogance all empires have embraced.\\nInternationally it has raged, as imperial China did, as if with a \\x93Mandate of Heaven\\x94, flaunting self-interest with no regard for other nations or the laws of war. It has inflicted misery, chaos, and death on many millions of the poor and helpless for a Full Spectrum Dominance it could never impose. America\\x92s Capitalist War Machine has raped and destroyed many countries for its profit, and destablized the entire world in its megalomania.\\nSchumpeter said it best, of Imperial Germany\\x92s military industry: \\x93Created by the wars that required it, the Machine now creates the wars it requires.\\x94\\nAmerica has been transformed over time from a civil democracy with imperial economics to a militarist empire with vaudeville democracy. This was accomplished by binding both wings of the duopoly to the exclusive interest of Predatory Capitalism with corrupting money. A corporate state imposed via political and military power is the essence of Fascism.\\nFor generations, Americans have been dosed with the ultra-nationalist poison of Exceptionalism, with its implicit racist subtext, and its sexism buried in a hoo-rah masculinity cult, but it has always been flavored with the sweetening agent that We, The People, were both masters and beneficiaries of our benign, patristic system. The last several decades have painfully taught any conscious observer that this is a cynical fiction.\\nIn this election, the threadbare mythology of the duopoly was ripped away in a manner that left no doubt, in even the least informed, most credulous minds, that the American political system was a dead, stinking fraud. Each party, with its purblind lack of understanding of, and connection with, the mass of American people, suffered uniquely humiliating public pantsings.\\nHaving stealthily, assiduously cultivated and nurtured the most regressive, dim, and hateful elements in its Redneck Wing for decades, the CEO Wing gaped impotently as Dogpatch was appropriated by a vulgarian who spoke to peckerwoods directly, not in code. He jettisoned the few Silverspooners and Coupon Clipper Bosses, stole their ground troops and mobilized their outrage. He only succeeded then due to the universal rage of the working class that has been dealt out and bankrupted, its jobs and prospects stolen and its lives sunk, for the benefit of a tiny clique of professional criminals.\\nThe Republican Party is done, killed because Trump grabbed its posse.\\nDemocrats, confident of being lesser evils, opted for selbstmord. After Occupy\\x92s warning, exposes of record financial inequality and the rapid unravelling of democracy, one might have thought a show of fight against those evils would be mandatory, but no: they pre-selected the candidate who embodied them instead. As the long, impassioned cry went up across the country, from the young, working people, the ill and poor, disabled and elderly, for an old man who would be their champion, Party commissars chose to freeze out Bernie\\x92s burn and go geriatrically into that good night. Then, when caught out in their shoddy chicanery, they Hitlered Putin.\\nThe Democratic Party is done, dead of peritonitis from undigested hubris.\\nThe failure of faction, the implosion of coherent parties, means more, not less division and acrimony. America faces now the same degree of crisis that has blown the senile Parties in pieces. The time ahead is fraught with tremendous and unknown perils and challenges with no precedent. Our Republic stands a good chance of becoming ungovernable.\\nFranklin said, with the tough days in Philadelphia over and the Constitution signed, that we had a Republic, if we could keep it. We\\x92re about to find out.'"}, "time": 1742564107.3376286}