{"duration": 0.09532690048217773, "input_args": {"text": "'A Russian technology executive who was named in a dossier containing unverified allegations about connections between President Trump and the Russian government has sued BuzzFeed News, which published the information. The defamation suit was filed in court on Friday in Broward County, Fla. according to lawyers for the executive, Aleksej Gubarev, the chief of XBT, a technology company based in Luxembourg. The suit focuses on allegations, made near the end of the dossier, that Mr. Gubarev and his company were involved in hacking operations against the leadership of the Democratic Party. In the complaint, Mr. Gubarev’s lawyers say that BuzzFeed acted recklessly that none of the statements have any basis in fact and that Mr. Gubarev’s association with the dossier has left his reputation “in tatters,” compromised his family’s security and damaged his company’s business prospects. It called BuzzFeed’s decision “perhaps one of the most reckless and irresponsible moments in modern ‘journalism. ’” The publishing of the dossier was one of the most startling moments of the weeks before Mr. Trump’s inauguration. Compiled by a former British intelligence operative who was hired by Mr. Trump’s Republican rivals and later by supporters of Hillary Clinton, the document had circulated for months among   government officials and journalists. The veracity of its claims had been investigated but never proved. But after CNN reported last month that intelligence officials had presented a summary of the allegations to Mr. Trump and President Barack Obama, BuzzFeed decided to publish the document in full, saying that “Americans can make up their own minds about allegations about the   that have circulated at the highest levels of the U. S. government. ” When it published the dossier, BuzzFeed noted that it contained errors and that its claims had not been verified. The publication’s editor in chief, Ben Smith, later wrote that its reporters in the United States and Europe spent weeks investigating the report. BuzzFeed ignited a debate over both the claims in the report as well as the outlet’s decision to break from typical journalistic practices in publishing it. Mr. Trump denounced the unproven claims as a   smear, and called BuzzFeed a “failing pile of garbage” during a heated news conference on Jan. 11. Mr. Gubarev’s lawsuit claims that while more than 30 publications tried to contact him after the dossier’s publication, he was not contacted by BuzzFeed for his response to the allegations. Mr. Gubarev, 36, lives in Cyprus with his wife and three children. He founded the site Webzilla  —   which is also identified in the report, the complaint notes  —   and built it into an international business, XBT, with more than 300 employees around the world. The lawsuit was filed in Florida, where Webzilla is registered. A federal lawsuit over the publishing of a sex tape featuring the wrestler Hulk Hogan that led the website Gawker to file for bankruptcy and eventually shut down was also filed in the state. That case, over invasion of privacy, remains a cautionary tale in the media world. After learning of the lawsuit on Friday, BuzzFeed removed the names of Mr. Gubarev and his company from the dossier. “We have redacted Mr. Gubarev’s name from the published dossier, and apologize for including it,” the company said in an emailed statement to The New York Times. A spokesman for BuzzFeed said it had redacted other names in the document and should have redacted Mr. Gubarev’s, but the spokesman defended the company’s decision to publish the dossier. Mr. Gubarev’s lawyers have also filed a lawsuit in Britain against the former intelligence agent who compiled the report and his consulting company. The lawsuit against BuzzFeed comes at a tense moment for the news media. Mr. Trump’s administration has castigated journalists for challenging unverified or false claims presented by the White House as fact, and the president’s chief strategist, Stephen K. Bannon, has labeled the news media “the opposition party. ” Floyd Abrams, a First Amendment scholar and lawyer, said the lawsuit was a “difficult situation for BuzzFeed to be confronted with. ” “It seems inevitable that BuzzFeed will say in some fashion that subjecting it to crippling damages for publishing the dossier would, in the end, imperil the public’s right to know just what misconduct an American president” is suspected of, he said. He added that he could foresee lawyers arguing to move the case to federal court or to a court outside Florida. In the complaint, Mr. Gubarev’s lawyers argue that he is not a public figure. But if the court disagrees, Mr. Gubarev’s lawyers would have to prove that BuzzFeed acted not only negligently, but also maliciously. One potential argument for defense lawyers is a principle called neutral reportage, which defends the publishing of some defamatory material if it is a matter of public interest and “does it in a fair and disinterested manner, without endorsing a defamatory charge,” Mr. Abrams said. The principle has been rejected by some courts, however, and has not been tested widely, he added. “I would think that wherever this case is heard, an absolutely central issue will be whether a court would adopt the neutral reportage principle and say basically precisely what the editor of BuzzFeed has been saying  —   that this is an enormous matter of public interest, we reported it fairly, we did not endorse it, we made very clear that these were simply charges that were well known to everyone but the American public,” he said.'"}, "time": 1742561899.10897}