{"duration": 0.12623095512390137, "input_args": {"text": "'Have you ever noticed that, sometimes, a certain celebrity seems ever so slightly off? Maybe its an errant beauty mark or the fact that their eyelids have begun to blink sideways. You can feel in your heart that something’s just not right. That’s because your darling idol is dead. \\nVia GizModo \\n\\nYet they’re afraid that this stuff will get out, which is why they must use MIND CONTROL and MK-Ultra in order to keep their “victims” (who are majority celebrities) silenced.\\nNow of course you’re going to have media-controlled sites like BET refer to his TRUTH as a “conspiracy” (which it isn’t), and make it seem like cloning doesn’t exist (which it does!) And the only time they call it something a ”conspiracy” is when they’re hiding something… When they’re hiding TRUTH.\\nKinda like how they refer to as the “911 Inside Job” story a “conspiracy,” when really it’s TRUTH… and THEY KNOW it’s TRUTH. But they have to keep it going as long as they can! They have to keep you under subliminal mind control so that you won’t know what’s REALLY going on, and the REAL agenda behind all this!\\nTupac may be alive as well, take a look at his hologram being used at Coachella, California.\\nBut don’t take my word for it (because many of you won’t). Here is proof from an actual celebrity who fills you in on the whole cloning biz, and exposes the Hollywood-entertainment demonic-Satanic agenda.\\n(By the way, in case you don’t know who that is on the picture above, that is rapper-singer-songwriter B.O.B.)\\nNow, B.O.B. is actually in the industry. He knows the ins-and-outs of the entertainment business, the music business, and all the demonic initiations one has to adhere to in order to even become a household name! So if I’m going to believe anyone, it’s not going to be mainstream media… it’s going to be TRUTH.\\nHere I will leave links of what he says about cloning, and getting the TRUTH out to all those people who are sleeping, and don’t think such a thing is even real. (HINT: If they can clone a sheep like they did in 1997, don’t you think they can clone humans as well?)\\nDon’t worry, though, because before they were killed, your favorite celebrity was cloned. Which means that unlike Paul McCartney (who was simply replaced with a lookalike), countless incarnations of your dearly departed could be walking among us for centuries to come.\\nBut how do we know this? Why would anyone let this happen? And am I okay? As far as the first two are concerned, a man named Donald Marshall has the answers. The latter is anyone’s guess.\\nAs he revealed on Facebook in 2011, Donald Marshall, a clone himself, is an otherwise normal guy who had the bad luck of finding himself in a so-called “cloning station” run by Queen Elizabeth. When Marshall was born, his family was already living in the cloning center. Yet in all his writings and interviews, he never specifies exactly why his family lived in this clandestine Illuminati palace in the first place. Details, details.\\nStill, Marshall’s discussions on the matter have been extensive . A Google search for “Donald Marshall cloning” brings up about 230,000 different results, many of which weren’t even written by Marshall himself. Nearly every clone-related conspiracy blog out there has discussed him or his tale, and it’s hard to find a video that makes mention of celebrity cloning without alluding to some aspect of the Donald Marshall canon.\\nThe basics of his story (which do occasionally shift) go something like this: During his time at the cloning station, Marshall discovered that the entire operation is run by a collective consisting of the Freemasons, a group called “The Vril Society,” and of course, Scientologists. This secret society super-group is what we know today as the ever-elusive Illuminati.\\nMembers of the Illuminati (which naturally include all the G20 world leaders) typically meet in subterranean bunkers. The very same bunkers that, according to Marshall, house what has become a highly lucrative network of celebrity cloning farms.\\nThe cloning part of the operation didn’t actually start until some time after World War II, at which point, and as Marshall explains in his Facebook post, “The political people started bringing movie stars and musicians there to hang around with them, they can control who remembers the cloning facility and who will remain oblivious even though not remembering still damages you.”\\nSome of these clones are used for mere entertainment value (gladiator-style wrestling bouts, sexual perversions, Illuminati ritual sacrifices, what have you). Others are kept as precautionary measures should the clone’s original ever need a new liver. If you saw 2005 sci-fi flick The Island , you already know exactly what I’m talking about—because in a fit of hubris, The Island was produced by none other than the Illuminati themselves.\\nOrgan harvesting is the least of your worries as a clone, though. In his original tell-all Facebook post from 2011, Marshall explained:\\nThe royal family of England,… yes Queen Elizabeth, Phillip Duke of Edinburgh and Prince Charles are the worst of them, unbelievable depraved perverts all showing off for the celebrities that go there, Elizabeth has the children there call her “lillibet” and does ungodly things to them, some she fakes being nice to, some she is terrible to, cutting them with swords while they scream, the decent people that are there against their will are afraid to say anything against them, most have their children there as a kind of hostage, to be torn apart if they even think of informing anyone, but as they have been torturing me terribly anyway I will tell all, Vladimir Putin loves to put the fear of torture and death into people but is essentially a cowardly pervert himself.\\nMost of the famous people are ashamed to speak or be seen by me there very much,as they’re ashamed of the perverse and disgusting gatherings, I am a decent person and will not participate in these acts, so they use me as an example and torture me for my being a good person.\\nJust like with twins or Real Dolls, if you torture a person’s clone, the original will feel it and might even undergo physical damage. Each new clone decreases your mental capacity, as well, so the more clones made, the easier that person is to hurt or subdue. Two of Queen Elizabeth’s favorite pastimes.\\nAnd as all the pros know, if you really want to keep someone under your thumb, all you have to do is kill the original copy. Clones are notoriously obedient, which apparently comes in handy when you need them to churn out hit single after hit single. Don’t take my word for it, just ask Avril‘s clone—or any of the other high profile clones below.\\nBritney Spears Britney Spears is dead. That is, assuming the now-defunct (but accessible here) website BritneyIsDead.com isn’t lying to us.\\nBecause back in 1998, right before dropping the now-classic rock opera Baby One More Time , Britney and Justin Timberlake got into a particularly nasty car accident that resulted in severe burns on Justin’s part and an unfortunate case of decapitation on Britney’s. (Justin is still in a coma; his clone roams free.)\\nBecause pop stars must have heads, the label was forced to find a Britney Spears stand-in. This is where the stories begin to diverge. BritneyIsDead.com claims that the label’s producers went to the mall and found a young look-a-like named Britney Shears. This seems unlikely and leaves us with only one possibility: Donald Marshall was right.\\nIt was time to clone Britney.\\nImage: YouTube Over the years, plenty of Britney clones have come and gone, which would explain her many emotional ups and downs. According to Marshall, though, at any given time there are at least two to five backup clones waiting underground for their turn in the spotlight.\\nLike any clone, the Britney copies are not at all happy with their lot in life. So in 2009’s “Break the Ice,” one of the songs written for Britney by Donald Marshall during his time as a pop clone lyricist, she managed to sneak in some hints at the reality of her situation. This included an accompanying animated video that depicts her blowing up an actual cloning center.\\nAnd according to Marshall, the tubes detailed in the video look “exactly” like the real tubes in the cloning center.\\nImage: YouTube Why Queen Elizabeth and the rest of her Illuminati cohorts would allow a menial clone to expose the secrets of their arcane operation, however, remains a mystery.\\nEminem There have long been rumors that Eminem checked himself into rehab after a drug overdose in 2005. He even said a few years ago that he “nearly died” at one point. He used the word “nearly,” of course, because when one is survived by innumerable copies of one’s former self, one can never really be dead.\\nWhen Slim Shady reached worldwide phenom status in the late 90s, the Illuminati approached him (as they do with all up and coming superstars) to see how willing he would be to join their gang of ultra-powerful miscreants. Shady foolishly declined, and was thus sent off to meet his demise in a fatal car crash. Or as far as the rest of the world was concerned, Eminem went to “rehab.”\\nOf course, no clone is perfect. The video below, which is available for download here, goes so far as to point out the vocal disparities between the original Eminem and his counterpart.\\nAnd if that doesn’t have you convinced, this shirting hairline surely will.\\nImage: YouTube Or perhaps this little yellow circle:\\nImage: YouTube And like noted clone Al Roker, Eminem’s clone once suffered a glitch on live television and nearly gave himself away in the process.\\nNo doubt that clone was killed immediately after the interview aired. Embarrassing!\\nMiley Cyrus Image: Imgur Back in 2010, as with all incurably rebellious teen sensations, Disney had Miley Cyrus killed and dumped her remains in the California desert.\\nThere are two different possible reasons for this. One theory states that in the months before her “accident,” Miley leaked nudes, smoked salvia, and wrote in a song that she was “hot.” Which is to say, Miley Cyrus had become a national disgrace. To save its brand, Disney’s was left with only one option: Murder.\\nThe other theory (and the one outlined in the image above) alleges that Miley Cyrus refused the sexual advances of various Disney executives (her father included). After realizing that Miley intended to remain steadfast in her decision not to partake in their blood orgies, a Disney higher-up beat her up, left her for dead, and brought in the clones.\\nThe Miley Cyrus conspiracies actually go even deeper than the rest. This YouTube video claims to contain proof that Miley Cyrus is “a confirmed Draco Reptilian Shapeshifter Hybrid.” Note the eyelids.\\nEither way, whatever did replace end up replacing Miley is far more malicious than your typical clone. This Miley is mean.\\nSo does that mean that every celebrity we see is actually a clone suffering under Queen Elizabeth’s barbarous rule? Of course not. Not even the Queen Mother has the capacity to make that many celebrity doubles. But are most celebrities Illuminati clones? Almost certainly, yes.\\nHonorable mentions [ Those who have not yet been killed and replaced by clones but it’s only a matter of time ]\\nChloë Grace Moretz Stephen Curry James Franco Oprah’s boyfriend Steadman Steve Harvey Dr. Oz Gizmodo editor-in-chief Katie Drummond Bono Everyone you love  \\n \\n \\n \\n'"}, "time": 1742628453.4645464}