{"duration": 0.07376837730407715, "input_args": {"text": "'Email \\nWho will be the winners and the losers in the coming U.S. presidential election? Trump or Clinton, Clinton or Trump? The mainstream media is consumed with personality politics. Who could hold their nerve in a time of crisis? Whose integrity is purer (or less damaged)? If you were forced to choose, who would you trust your house keys with? It’s entertainment for the masses. \\nThere will only be one group of winners: the interlocking oligarchy of financial, oil, military, agribusiness and pharmaceuticals interests than run the U.S. Whether it’s Trump or Clinton, policy nuances aside, Washington’s empire will stumble on. And it will do so not because of its inherent dynamism but because of its lies, manipulations, militarism and ability to crush any tendencies that exist towards a multi-polar world. \\nThe U.S. as a nation is bankrupt. It was in dire straits in the 1960s as a result of the Vietnam war and the emergence of economic rivals, such as France and Germany. Shifting off the gold standard and moving towards petrodollar recycling and treasury bond imperialism allowed the empire to remain on course and the dollar to remain as the world’s reserve currency. Oil, not gold, became the mainstay of the empire. As long as the (oil-backed) dollar remains the global currency, the U.S. can continue to secure a free lunch courtesy of the rest of the world. \\nToday, more than 60 per cent of all foreign currency reserves in the world are in U.S. dollars, and the U.S. will attempt to prevent countries moving off the dollar by any means possible, not least military. \\nWashington’s economic infrastructure is too weak to mount an economic recovery of note and U.S. corporate cartels will do anything to prevent policies that eat into their profits. They serve their own interests, not any notional ‘national interest’, and offshoring large parts of the US economy has served them well. \\nIndeed, Paul Craig Roberts, former Assistant Secretary to the U.S. Treasury, notes that much of the most productive part of the economy has been moved offshore to increase corporate profits. By doing so, the U.S. has lost critical supply chains, industrial infrastructure and the knowledge of skilled workers. The U.S. could bring its corporations back home by taxing their profits abroad and could also resort to protective tariffs, but such moves would be contrary to the material interests of the ruling oligarchy of private interests, which hold sway over U.S. politics. \\nVoid of a suitable industrial manufacturing base or the will to invest in productive infrastructure, the U.S. continues with its speculative finance-related bubbles, its non-productive rentier economy and its predatory hold over the institutions of global capitalism (WTO, IMF, World Bank), while its drags its European vassal states into imperialist wars to help maintain global hegemony and ensure allegiance to the U.S. dollar. And this is exactly what we are seeing today as the strategy for global supremacy is played out. \\nOver the past two decades, the U.S. has extended its influence throughout Eastern Europe and, among other places, in the Libya, Iraq, Yemen, Afghanistan, Syria and Pakistan (with Washington’s presence in neighbouring Afghanistan to all intents and purposes being a proxy war against Pakistan and Chinese influence there). With each passing year and each new conflict, the US has been drawing closer to direct confrontation with Russia and China. \\nRussia is holding firm over Syria, which is vital to wider U.S. geopolitical goals that involve the weakening of the Russian energy-dependent economy and ousting Russia from its only naval base outside of the former USSR. A global US strategy is already in force to undermine China’s growth and influence, part of which was the main reason for setting up AFRICOM: US Africa Command with responsibility for military operations and relations across Africa. But China is not without influence, and its actions are serving to weaken the hegemony of the U.S. dollar, thereby striking at a key nerve of U.S. power. \\nChina has been implementing bilateral trade agreements with a number of countries, whereby trade is no longer conducted in dollars but in local currencies. Over the past few years, China and other powers such as Russia have been making agreements to move away from the U.S. dollar in international trade. The BRICS (Brazil, Russia, India, China, South Africa) also plan to start using their own currencies when trading with each other. Russia and China have been using their own national currencies when trading with each other for more two years. \\nA report from Africa’s largest bank, Standard Bank, stated a few years back: \\n“We expect at least $100 billion in Sino-African trade – more than the total bilateral trade between China and Africa in 2010 – to be settled in the renminbi by 2015.” \\nUnder Saddam, Iraq was not using the dollar as the base currency for oil transactions, neither is Iran. Libya’s Muammar Gadhaffi was talking about using a gold-backed dinar as the reserve currency for parts of Africa. U.S.-backed destabilisation and war followed. In 2000, Iraq converted all its oil transactions to euros. When U.S. invaded Iraq in 2003, it returned oil sales from the euro to the dollar. Little surprise then that we have over the years seen on on-going saga by the U.S. to remove the Iranian regime via sanctions, destabilization, intimidation or the threat of all-out war. \\nIran has looked east to China, Pakistan and central Asia to counteract the effects of U.S. sanctions and develop its economy and boost trade. To sustain its empire, the US has effectively pushed the world into different camps and a new cold war: one not based on competing/alternative political or economic systems but a simmering conflict based on competing capitalist elites or ruling oligarchies who require control over their regional spheres of influence. \\nImperialism still reigns and neither side – whether the U.S., Russia or China – is particularly appealing, not least to those who believe that democratic (green) socialism is the best hope for humanity. In the absence of such a solution, a world not hurtling towards nuclear conflict would serve us well for the time being. \\nThe U.S. economy appears to be in terminal decline. The only way to prop it up is by corrupt, secretive, lop-sided trade agreements or by waging war to plunder resources and to ensure the print-as-you-go dollar remains the world reserve currency. An empire in decline armed to the teeth with nuclear weapons and trapped in a cycle of endless war to stave off ruin is a frightening scenario. Even more alarming is the talk of pre-emptive nuclear strikes against other nuclear powers such as Russia and China. \\nThis is the reality that faces the world. This is the reality that the corporate media will not inform the U.S. electorate about. The empire demands a sufficiently ignorant, misinformed public courtesy of a Fox News/CNN made-for-TV election stupor. An electorate that is sufficiently convinced to believe that millionaire-billionaire politicians who climb into bed with Wall Street banks and the rest of the ruling oligarchy have their interests at heart. \\nA public for whom the term ‘class consciousness’ or ‘class interest’ figures little if anywhere in their political lexicon. The class that appears to be highly conscious of its interests is the one in control: the one that does its level best in ensuring that any such consciousness emerging within the ruled over is shut down at birth – or suffocated within the mind-manipulating control mechanism that is the 2016 U.S. presidential campaign. \\nThey sold your jobs to the lowest bidder abroad under the lie of ‘efficiency’ to make every greater profit, and they get you to blame your plight on immigrants. They use your taxes to kill and destroy countries under the lie of ‘humanitarianism/fighting terror’ to secure ever more mineral riches, and they get you to fear the latest bogeyman. And they sell you a vision of democracy that much of the rest of the world regards as shambolic. America, it’s time to wake up.'"}, "time": 1742628488.1769779}