{"duration": 0.06482100486755371, "input_args": {"text": "'WASHINGTON  —   On April 3, 1962, President John F. Kennedy nominated Byron R. White to the Supreme Court. The Senate confirmed him by a voice vote less than two weeks later, after a perfunctory   hearing during which the nominee smoked cigarettes and doodled while senators praised his legal skills. On Monday, one of White’s former law clerks, Judge Neil M. Gorsuch, will appear at his own Supreme Court confirmation hearing. It will last for days and reflect the brutal politics of a polarized era. In 2002, as a lawyer in private practice, Judge Gorsuch recalled his old boss’s smooth ride and rued the modern judicial confirmation process, which he described in an article as “an ideological food fight. ” Fifteen years later, the atmosphere has grown even more rancorous and sour. In particular, Senate Republicans’ refusal to consider President Barack Obama’s nomination of Judge Merrick B. Garland to the Supreme Court last year was a shock to the system, said Nathaniel Persily, a law professor at Stanford. “The Senate confirmation process for Supreme Court justices has always been cabined by norms of behavior and unwritten rules,” Professor Persily said. “With the failure even to have a hearing on Garland, the norms have all gone out the window. The Democrats now feel emboldened to try anything. ” Senate Democrats have indeed pledged to probe every aspect of Judge Gorsuch’s background and views. They say he has failed to distance himself from President Trump’s attacks on judges, that he cannot be trusted to rein in executive power and that his jurisprudence is skewed toward business interests. It is not clear whether those critiques will resonate with the public or matter in the end. Republicans hold 52 seats in the Senate, and they say they are committed to confirming Judge Gorsuch even if that requires revisions to rules requiring a   majority. Supreme Court appointments are committed to the political branches of the government, meaning they are to some extent political by constitutional design. But politics were not always in the foreground to the extent they are today. In his 2002 article, Judge Gorsuch seemed to trace the change in tone to the lingering aftermath of the Senate’s 1987 rejection of President Ronald Reagan’s nomination of Judge Robert H. Bork. “When a favored candidate is voted down for lack of sufficient political sympathy to those in control,” Judge Gorsuch wrote, “grudges are held for years, and retaliation is guaranteed. ” Whatever its origins, the modern confirmation process is doing harm to the Supreme Court’s authority, Chief Justice John G. Roberts Jr. said in February last year. “When you have a sharply political, divisive hearing process, it increases the danger that whoever comes out of it will be viewed in those terms,” Chief Justice Roberts said. “If the Democrats and Republicans have been fighting so fiercely about whether you’re going to be confirmed, it’s natural for some member of the public to think, well, you must be identified in a particular way as a result of that process. ” “We don’t work as Democrats or Republicans,” he said, “and I think it’s a very unfortunate impression the public might get from the confirmation process. ” Chief Justice Roberts spoke just weeks before the death of Justice Antonin Scalia. Justice Scalia, who was confirmed in 1986, the year before Judge Bork was voted down, was the product of a different era. “I was confirmed 98 to 0,” Justice Scalia told a bar group in 2007. “I was known as a conservative then, but I was perceived to be an honest person. I couldn’t get 60 votes today. I guess the name of the game’s changed. ” In 1991, Justice Clarence Thomas, facing accusations of sexual harassment, barely squeaked through by a    vote. Last year, he said confirmation battles had turned into total war. “This city is broken in some ways,” Justice Thomas said. “We have decided that rather than confront the disagreements and the differences of opinion, we’ll simply annihilate the person who disagrees with us. ” Things were different in 1962, Judge Gorsuch wrote, when White sailed through based on “his integrity, accomplishment and life experience. ” “Excellence plainly is no longer the dispositive virtue, as it was to President Kennedy,” Judge Gorsuch wrote in 2002. Though White was nominated by the Democratic president, he was widely seen as a staunch pragmatist  —   and later grew comfortable as a jurist in the court of conservative Chief Justice William H. Rehnquist. Instead, Judge Gorsuch wrote, “some of the most impressive judicial nominees are grossly mistreated. ” He named two, calling them “among the finest lawyers of their generation. ” One was John Roberts, who was then waiting to be confirmed to a seat on the United States Court of Appeals for the District of Columbia Circuit. The other was Judge Garland, who had waited 18 months before his confirmation to the D. C. Circuit. In January, just after Mr. Trump announced his nomination, Judge Gorsuch called Judge Garland. It was, some said, a welcome gesture of grace and respect. Others called it empty and calculated political theater. Given Republican control of the Senate, Judge Gorsuch is likely to be confirmed, though perhaps only after a momentous revision to Senate practices to eliminate the filibuster against Supreme Court nominees. But justices and others worry about the cost to the Supreme Court’s authority when its members are portrayed in starkly political terms. “I am sad that the public has lost confidence in the judiciary,” Justice Sonia Sotomayor told law students at the University of California, Berkeley, this month. “That so many people believe we are politicized is also saddening to me. ” The truth, she said, is “not that the court has become politicized, but that the society has. ” These days, Chief Justice Roberts said last year of Supreme Court confirmations, “the process is not functioning very well. ” “Look at my more recent colleagues, all extremely well qualified for the court,” Chief Justice Roberts said, “and the votes were, I think, strictly on party lines for the last three of them, or close to it, and that doesn’t make any sense. That suggests to me that the process is being used for something other than ensuring the qualifications of the nominees. ”   senators voted against Justice Samuel A. Alito Jr. who was nominated by President George W. Bush.   senators voted against Justice Sotomayor, and 37 against Justice Elena Kagan, both nominated by Mr. Obama. “The court is increasingly being perceived as a political institution,” Professor Persily said. That means, he said, that the justices “are less likely to be able to rely on the reservoir of good will that they have built up over time because attitudes toward the court are now swaying with the political winds as well. ” But there is reason to think that Judge Gorsuch’s confirmation hearings will shift public opinion away from a purely political conception of the Supreme Court, said Lori A. Ringhand, a law professor at the University of Georgia and an author of “Supreme Court Confirmation Hearings and Constitutional Change. ” “One of the values of confirmation hearings is the public discussion of constitutional issues in the language of constitutional law,” Professor Ringhand said. “I don’t think hearings, over all, hurt the legitimacy of the court. Whether this particular situation hurts the legitimacy of the court will depend a lot on how it plays out. ” Justin Driver, a law professor at the University of Chicago, also said there was some reason for optimism. “Confirmation hearings can matter a great deal,” Professor Driver said. “Some people say they are a boring ritual. I agree with the ‘ritual’ part but not the ‘boring’ part. What is said at the confirmation hearings indicates a lot about the shape of our constitutional conversation. ”'"}, "time": 1742628458.7255294}