{"duration": 0.09467577934265137, "input_args": {"text": "'We Are Change \\nNEW: US military hackers have penetrated Russia’s electric grid, telecom network, Kremlin command systems, and are ready to hit back if the Russians try to disrupt Election Day, sources and top secret documents show. According to NBC News Corp. \\nWASHINGTON (Sputnik) — NBC News disclosed the penetration in a series of reports, explaining that US efforts parallel claims, also by US officials, that Russia, China and other nations have placed hidden malware on parts of US critical infrastructure.\\nThe U.S. use of cyber attacks in the military context — or for covert action — is not without precedent.\\nDuring the 2003 Iraq invasion, U.S spies penetrated Iraqi networks and sent tailored messages to Iraqi generals, urging them to surrender, and temporarily cut electronic power in Baghdad.\\nIn 2009 and 2010, the U.S., working with Israel, is believed to have helped deploy what became known as Stuxnet, a cyber weapon designed to destroy Iranian nuclear centrifuges.\\nToday, U.S. Cyber Command is engaged in cyber operations against the Islamic State, including using social media to expose the location of militants and sending spoof orders to sow confusion, current and former officials tell NBC News.\\nOne problem, officials say, is that the doctrine around cyber conflict — what is espionage, what is theft, what is war — is not well developed.\\nThe penetration by all sides appears to be in preparation for an all-out war in cyberspace, according to NBC News, which said it was briefed by a US intelligence official and given an opportunity to review highly classified documents. At the same time, the network downplayed the prospect of a cyber war, making it appear as if the leak was intended as a warning to US adversaries. NBC News then attempted to link its explosive report to Tuesday’s US presidential election, citing concerns of mischief by Russian hackers that would fall far short of the Armageddon-like scenario that the report implied. Instead, the network explained US election-related concerns as “cyber mischief,” which could involve releasing fake documents or creating bogus social media accounts to spread misinformation. The Obama administration has created a public, but unconfirmed narrative, that hackers controlled by the Russian government have stolen emails from the Democratic Party headquarters, a private computer used by presidential candidate Hillary Clinton while serving as secretary of State and computers used by Clinton campaign Chairman John Podesta. According to the narrative, Russia stole the emails and gave the messages to WikiLeaks, which has flooded the internet with the material on a daily basis leading up to Tuesday’s election. Russia has denied any responsibility for the Clinton-related hacks and links between WikiLeaks and Russian intelligence have never been substantiated. Moreover, recent media reports in the United States indicate that Clinton’s private server she used for official business during her tenure as secretary of state had been penetrated by at least five foreign intelligence services. The emails have proved especially embarrassing for the Clinton campaign by disclosing decisions in the Clinton State Department that favored large donors to the Clinton Foundation in what appear to be “pay-for-play” schemes of selling access and influence. Moreover, the activity appears to coincide with lucrative speaking engagements for former President Bill Clinton. Earlier this week, Fox News cited two unnamed sources claiming that the US Federal Bureau of Investigation (FBI) is close to recommending that Hillary Clinton be indicted for corruption while she served as secretary of state from 2009 to 2013.\\nThe FBI has never publicly confirmed an investigation of Clinton Foundation fundraising links to the State Department.\\nInstead, the FBI has limited its comments to a separate probe of whether Clinton mishandled classified information by using a private server. FBI Director James Comey closed the latter investigation without an indictment of Clinton, only to reopen it last Friday, claiming agents had discovered new emails on a computer used by the estranged husband of top Clinton aide Huma Abedin. Former federal prosecutor and New York City Mayor Rudi Giuliani has said publicly that FBI agents are in open rebellion against the US Department of Justice for attempting to quash both Clinton criminal investigations.\\nRead more: https://sputniknews.com/us/201611051047089422-usa-penetration-russian-infrastructure/ \\nFollow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post U.S. military Hackers Report Having Penetrated Russia’s Electric Grid & Communications Networks ‘Encase’ appeared first on We Are Change .\\n'"}, "time": 1742561761.296093}