{"duration": 0.12899303436279297, "input_args": {"text": "'The Danger Zone: Why Israel Greatly Fears Barack Obama’s Last Few Months In Office Michael’s Latest Video America Is Falling: More Men Than Ever Want To Watch Their Wives And Girlfriends Have Sex With Other Men By Michael Snyder, on November 21st, 2016 \\nVirtually every great society throughout history has descended into a state of utter sexual depravity before completely falling, and it looks like the United States is not going to be any exception. Whatever sick and twisted perversion you can dream up, there is probably a “thriving community” for it on the Internet. Right at the beginning of this article, I want to make it clear that what I am about to talk about is extremely disturbing and so this article should not be read by anyone that is not an adult. So why discuss this type of stuff at all? Well, the truth is that we are under a mass delusion in this country today. We like to think that we are so moral that we are an “example” to the rest of the world, but the truth is that America has become an overflowing cesspool of wickedness and filth. Just about every form of evil that you could possibly name is absolutely exploding in our society, and if we hope to have any hope for our future we have got to take a good, long look in the mirror and be honest with ourselves about how far we have fallen. \\nWhat I am going to write about today is just one example of how far we have declined morally. We have become a nation that is completely and totally addicted to watching other people have sex. I often quote the studies that show that approximately two-thirds of all Christian men look at pornography on a regular basis, and there is one kind of this filth in particular that is becoming extremely popular. \\nJust a few days ago, I came across an article in the Independent that discussed the fact that the number of men that want to watch their wives or girlfriends have sex with other men is absolutely soaring… \\nOnline communities dedicated to the topic are booming, with Google searches for the fetish peaking this week, having more than doubled in the past 12 years . \\nOne man explained how he’d been married to his wife for two years before confessing that he fantasised about watching her with another man. \\nMeanwhile a married woman detailed how her husband even texted her messages of encouragement when she was trying to seduce the man they’d agreed on. \\nThis practice is known as “cuckolding”, and there apparently is a tremendous demand for material related to this practice. According to Psychology Today , “even a cursory search on Amazon will turn up hundreds of books on such erotica and that the Internet, too, resoundingly echoes this ‘huge demand’ for graphic depictions of such sex.” \\nTalk about sick. \\nAccording to Wikipedia , the phrase “cuckold” originally comes “from the cuckoo bird, alluding to its habit of laying its eggs in other birds’ nests.” \\nIn our society everything is being turned upside down. Good is being called evil and evil is being called good. Once upon a time, the practice of adultery was greatly condemned in this nation, but now we have turned it into a spectator sport. \\nAnd at this point even the most trusted members of our society are doing things that were once considered to be unthinkable. For example, just check out what police in New York have been doing … \\nSgt. Jonathan E. Moore , 35, was at a Colonie auto dealership last month when his boyfriend, Anthony Aubin , 27, was arrested on felony charges as they tried to use a fraudulent check to purchase a $92,000 2016 Jaguar coupe, according to arrest records. \\nBut the arrest of Aubin, who has a lengthy criminal record and was recently on parole, has triggered a much broader, multi-agency police investigation into allegations that gay officers may have hosted or taken part in sex parties — called “breeding parties” — that allegedly were attended by teenagers who were not of legal age to drink alcohol or consent to having sex with adults . \\nWhen people run around having sex with whoever they feel like, it is inevitable that sexually-transmitted diseases will start to spread like wildfire, and a new report that was just released found that is precisely what is happening … \\nThe number of reported cases of sexually transmitted diseases reached a record high in the US last year , figures show, as officials warned that stretched services meant people were slipping through the “public health safety net”. \\nIn its latest report, the Centres for Disease Control and Prevention said the sharp rise in syphilis was of particular concern. \\n“We have reached a decisive moment for the nation,” Dr Jonathan Mermin, a director at the CDC, said. \\nOverall, the CDC says that there are approximately 20 million new STD cases in the United States every single year. \\nJust let that sink in for a moment. \\n20 million new cases a year. \\nAnd somehow we have come to the conclusion that we are good people? \\nSomehow we have come to the conclusion that we deserve to be blessed? \\nAnd of course it isn’t just sexual sin that is exploding either. Violent crime is way up in 2016, and this is particularly true in big cities such as Chicago … \\nWith 78 homicides, October was the second deadliest month of 2016, and Chicago surpassed 600 homicides for the first time in more than a decade. \\nThe last time Chicago had at least 600 homicides in a single year was 2003. \\nHomicides and non-fatal shootings have skyrocketed in 2016, with 605 homicides and more than 3,600 shooting victims through the end of October. \\nIn October, there were 78 homicides and 427 shooting victims. Only August had more homicides, when 90 people were slain in Chicago. It was the bloodiest month in the city in 20 years. \\nLet me be very clear – America is never “going to be great again” until we change what is in our own hearts . \\nOur biggest problem has not been that we have had the wrong political party in control of the White House. \\nRather, our biggest problem has been our own behavior. \\nIf we want to have any sort of a future as a nation, we need to turn from our wicked ways. But even in most churches you will not hear this kind of message these days. \\nSadly, the truth is that the vast majority of Americans don’t want to hear about how evil they are, and they certainly don’t have any intention of changing their behavior. \\nBut unless we start making major changes immediately, there is not going to be any hope for us no matter who we send to Washington.'"}, "time": 1742563202.9463527}