{"duration": 0.09063410758972168, "input_args": {"text": "'Hillary Is 70 Days Away From Controlling All Food and Water \\n\\nIf Clinton is elected, Obama will hand her the power of a dictator. \\nUpon Inauguration Day, Clinton will have the power to to the following: \\nAs President, Hillary Clinton Would Have the Power to Enact Slave Labor \\nAccording to EO 13603, the President, or the head of any federal agency that he shall designate, can conscript “persons of outstanding experience and ability without compensation,” in both “peacetime and times of national emergency.” I can hear the Obama supporters now as they will write to me and say, “Obama would never do that, you are drinking from the Kool-Aid”. Well, here it is, you can read it for yourself. \\nSec. 502. Consultants. The head of each agency otherwise delegated functions under this order is delegated the authority of the President under sections 710(b) and (c) of the Act, 50 U.S.C. App. 2160(b), (c), to employ persons of outstanding experience and ability without compensation and to employ experts, consultants, or organizations. The authority delegated by this section may not be redelegated. Hillary Will Have the Power to Nationalize All American Food and Food Production \\nThrough Executive Order 13603, Obama has granted himself the authority control all food and now has the unique ability to starve America into submission as it relates to his handing the country off to the bankers in the name of perpetuating the New World Order and ridding the planet of the weak and those who will not willingly go along with the intentional destruction of America. Here are some of the key provisions of EO 13603 and its impact on the control of the American food supply. \\nWith the stroke of his pen, Obama has total and absolute control over all food where his EO 13603 states: e) “Food resources” means all commodities and products, (simple, mixed, or compound), or complements to such commodities or products, that are capable of being ingested by either human beings or animals, irrespective of other uses to which such commodities or products may be put, at all stages of processing from the raw commodity to the products thereof in vendible form for human or animal consumption. “Food resources” also means potable water packaged in commercially marketable containers, all starches, sugars, vegetable and animal or marine fats and oils, seed, cotton, hemp, and flax fiber, but does not mean any such material after it loses its identity as an agricultural commodity or agricultural product. \\n(f) “Food resource facilities” means plants, machinery, vehicles (including on farm), and other facilities required for the production, processing, distribution, and storage (including cold storage) of food resources, and for the domestic distribution of farm equipment and fertilizer…” \\nThis unconstitutional EO is particularly disturbing in that it clearly states that the government has control over anything that is “capable of being ingested by either human beings or animals…” If you thought that you and Fido were going to get through the coming food crisis by storing and consuming dog food, think again. \\nIt is important to assess how devastating this Executive Order could prove to be to the American people though a brief assessment of America’s food vulnerability. \\nThis is only the tip of the iceberg. Listen to Dave Hodges describe just how dangerous Clinton could be if elected.'"}, "time": 1742562332.312453}