{"duration": 0.06152462959289551, "input_args": {"text": "'Freitag, 11. November 2016 Musik statt Lärm: Erster Laubbläser mit eingebauter Trompete vorgestellt [mit Video] Bochum (dpo) - Laubbläser sind nicht gerade für ihr angenehmes Betriebsgeräusch bekannt und sorgen so immer wieder für Frust und Nachbarschaftsstreit. Doch derartige Probleme dürften bald der Vergangenheit angehören: Ein Hersteller aus Bochum hat mit dem \"Miles Davis 3000\" ein neuartiges Modell vorgestellt, bei dem eine Trompete so in das Gerät verbaut ist, dass statt lästigem Surren und Rauschen fröhliche Musik ertönt. Chefentwickler Roger Fähnrich erklärt, wie es zu dieser Erfindung kam: \"Alle Versuche, leisere Laubbläser zu konstruieren scheiterten, weil es technisch unmöglich ist, den durch Blasgeschwindigkeiten von bis zu 300 Stundenkilometern erzeugten Lärm zu dämpfen.\" Daher habe man sich nach Wegen umgesehen, das Geräusch \"umzuleiten\". \"Ein Kollege, der privat in einer Jazz-Big-Band spielt, hatte dann die zündende Idee\", so Fähnrich. \"Er brachte eine alte Trompete mit und baute sie in den Blasschlauch ein.\" Der Prototyp des \\'Miles Davis 3000\\' war geschaffen. Statt nervtötendem Laubbläserlärm erzeugt das Gerät nun eine fröhliche Melodie. Im Einsatz klingt das dann so: Erste Kunden sind begeistert: \"Mein Nachbar hat mich für meinen Laubbläser gehasst. Wenn ich den \\'Miles Davis 3000\\' anwerfe, macht er das Fenster auf und wippt fröhlich mit. Mittlerweile sind wir die besten Freunde\", berichtet Friedrich Geffner (51). Die Euphorie ist so groß, dass sich inzwischen bereits erste Laubblasorchester bilden. Kein Wunder, dass den Bochumer Gartenmaschinenhersteller immer mehr Anfragen erreichen, ob es auch möglich wäre, andere Blasinstrumente wie Saxophon, Tuba und Blockflöte einzubauen. Ein australischer Kunde habe gar den Einbau eines Didgeridoos angefragt. \"Wir arbeiten daran\", so Fähnrich. Auch wenn erste Tests mit der Tuba sich im Alltagsbetrieb als wenig praktikabel erwiesen, da aufgrund der erzeugten Vibrationen mehr Blätter von den umliegenden Bäumen fielen, als weggeblasen werden konnten. ssi, dan; Idee: ari ; Bildmaterial: Shutterstock Artikel teilen:'"}, "time": 1742628422.8429108}