{"duration": 0.03147578239440918, "input_args": {"text": "'“Why I Won’t Vote for Hillary Clinton | Evan Edinger” (but then he changes his mind on that) TO CLOSE: Evan Edlinger will vote for Hillary against Trump because he thinks that whereas Hillary’s actual track-record of policies (not mere statements) in public office have been horrific, Trump’s bad statements and lack of any track-record in public office at all, make Trump even worse. That’s what he thinks. I think it makes Trump better — the better choice — as opposed to the proven evil and catastrophically harmful public official, Hillary Clinton. Edlinger is preferring an evil record as a public official, to no record as a public official. Edlinger fails to make two crucial distinctions: One is that he fails to distinguish between mere political statements, versus actual political policies carried out as a public official (which show Hillary to be a proven neocon and tool of Wall Street); and the other is his failing to distinguish between a bad record in a person’s private or business affairs, versus a bad record as an actual public official. Only the bad record as a public official should be absolutely disqualifying — and that’s Clinton, not Trump, who has a horrific record as a public official. Trump has no record at all as a public official. Edlinger at 1:30 in his video says that when he contemplates voting for Hillary,”There’s always one thing that comes in the way, and that’s trust.” He says he doesn’t trust her — but what he doesn’t actually “trust” is her words; when he says he’ll vote for her, he’s simply ignoring her actions, he’s ignoring the real person-as-a-public-official, the person who is shown and displayed beyond any reasonable doubt whatsoever. Proven selfishness in one’s private life is bad, but proven selfishness and evil in one’s public-office policies (such as “We came, we saw, he died. Ha, ha!” ) is utterly disqualifying. I argued in my “I’m a Bernie Sanders Voter: Here’s Why I’ll Vote Trump” , that Trump could possibly turn out to be a progressive President; but, even if he turns out to be a bad President, he won’t, on balance, be as horrific as will a President Hillary Clinton. With Trump, there is reason to have some hope for the future of the world; with Clinton, there is reason to expect unprecedented horrors .'"}, "time": 1742628507.3192523}