{"duration": 0.05737471580505371, "input_args": {"text": "'Preguntar por el sueldo será motivo de despido ATOSIGAR AL JEFE PIDIÉNDOLE UN CONTRATO O DÍAS DE VACACIONES SE CONSIDERARÁ ACOSO LABORAL trabajo \\nEmbrutecer la relación laboral mostrando interés por asuntos meramente económicos será motivo suficiente para echar a un empleado, según una nueva normativa laboral anunciada por el Gobierno esta mañana. “Insistir en temas económicos da a entender que el trabajador podría no estar interesado en el trabajo sino sólo en el dinero”, explicaba esta mañana Fátima Báñez, ministra de Empleo y Seguridad Social. \\nSegún la normativa, la cantidad monetaria que todos los trabajadores perciben a fin de mes a cambio del trabajo realizado debería ser un tema “que al menos se finja secundario” para poder mantener “la ilusión” de que se trabaja en vistas a mejorar la productividad de la empresda y de España “y no por intereses personales y exclusivamente pecuniarios”. \\n“Preguntar por nóminas atrasadas deja en evidencia que existía un interés oculto cuando se aceptó el trabajo”, explica la ministra. \\nLos empresarios, a través de la patronal, no han tardado en aplaudir una medida que llevaban años solicitando. “Cuando estás haciendo una entrevista, preguntas por los sueños y las aspiraciones de una persona, por cosas importantes, y al final siempre rompen ese clima de confidencia preguntando cuánto van a cobrar y es una pena”, explica Carmen Sartoña, directora de Recursos Humanos de la multinacional Jenkins&Co. “El trabajo bien hecho debería ser su propia recompensa, nos gusta que el sueldo sea una sorpresa inesperada, un plus”, insiste. \\n“Que mis subordinados trabajen por una motivación ajena al trabajo me parece feo y en esas condiciones prefiero poder despedirlos”, ha declarado otro empresario de Madrid, aplaudiendo la medida. Confía en que la nueva normativa favorezca la dedicación apasionada y desinteresada por el trabajo. \\nAsimismo, los trabajadores que atosiguen al jefe pidiéndole un contrato o días de vacaciones podrán ser acusados de acoso laboral.'"}, "time": 1742564173.0585933}