{"duration": 0.08157992362976074, "input_args": {"text": "'Sex workers reject ‘biased’ BBC prostitution documentary Sex workers reject ‘biased’ BBC prostitution documentary By 0 47 \\nSex workers say the BBC’s ‘Sex, Drugs & Murder: Life in the Red Light Zone’ documentary, which portrays the lives of women in the Holbeck area of Leeds, Britain’s first legal red light district, is “biased” and unrepresentative. \\nThey argue the program buys into stereotypes and general ignorance, including the view that women are driven into prostitution by drug habits rather than economic pressures brought on by austerity. \\nRead more \\nThe show follows the daily lives of Sammi Jo, Stacey, Debi and Kayleigh, who sell sex to pay for their addictions. They work in an area also known as Red Light Zone, where women can sell sex between 7pm and 7am without being arrested. \\nSammi Jo, who had to be taken from her parents as a child due to abuse, said she turned to drugs and drink “as a comfort.” \\nMother-of-three Kayleigh recounted how despite her family’s attempts to help her get clean she would quickly relapse. \\n“I came off of it and within two days I robbed my brother’s PlayStation games to go sell for money, and that just led into a routine of, I’d have heroin, go work, and I’d have heroin to forget about working,” she told the program. \\n“It’s just a total vicious cycle.” \\nBut sex workers union English Collective of Prostitutes (ECP) believes the show is “biased” and shows only the darker side of the industry. \\n“This BBC3 film is yet another biased piece on the sex industry,” a spokeswoman for the group told RT. \\n“Most street-based sex workers are not drug users yet the film chooses to focuses only on women on drugs. It ignores the truth that in many areas around the UK the majority of sex workers are on the streets because of benefit cuts and sanctions. \\n“If the press ignore that they are colluding with the government in hiding the devastating consequences of their austerity policies, 80 percent of which have targeted women.” \\nThe group said the Red Light Zone provides Leeds sex workers with a safe environment to operate. \\nAccording to local police, prostitutes have been three times more likely to report violent incidents since decriminalization came into place in Holbeck. In the first year, between 2014 and 2015, 61 violent incidents were reported to the police. The previous year only 49 cases of assault were reported. \\n“Some women were glad to work in the Leeds ‘no arrest zone’ because it meant they weren’t being constantly harassed by the police,” the ECP spokeswoman added. Immigration raids \\nThe ECP said it is the police themselves who are endangering the lives of sex workers. \\n“Since the immigration crackdown everyone is on edge and hiding from officials. Women feel that once again the police are prioritizing criminalization over protection and this is deterring them from reporting violence,” the group complained. \\nLast week the London Metropolitan Police raided six massage parlors in Soho and Chinatown, arresting 24 people – 17 of whom were seized on “suspicion of immigration offenses.” \\nThe Met released a statement saying the operation was “aimed at bringing to justice those who seek to profit from the exploitation of vulnerable people.” \\nThe ECP, however, claims the swoops are “part of a racist witch-hunt against migrant sex workers, which has got worse since Brexit, even though women have the right to be here under EU law.” \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742563091.812872}