{"duration": 0.0731208324432373, "input_args": {"text": "'  U.S. Economy Clinton Foundation , new world order , Trump admin Tyranny is defined as that which is legal for the Government but illegal for the citizenry – Thomas Jefferson \\nThe mainstream media tried it’s hardest to persuade the public that Hillary was a lock to win the election. Even the nefarious George Soros asserted confidently that Trump might win the popular election but Hillary would win the Electoral College. \\nBut apparently the voters just weren’t ready for a tyrannical President yet. The perception of the two candidates shaped by the mainstream media led the unsuspecting – if not comatose – public to believe that Hillary Clinton was some liberal angel who would save the country from reality and that Trump is some kind of fascist monster who is going to force everyone with slightly tinted skin to leave the country. \\nOf course, nothing could be farther from the truth. Lost in the shuffle is the fact that the Dragon Lady, reincarnated, hid behind the veil of the tax-free status of the Clinton Foundation to steal $100’s of millions from the taxpayers and the Saudi royal family (the Huma Abedin connection, which is why she is Hillary’s “Igor”) and move it into the bank accounts of the Clinton family and friends of the Clinton family. The taxpayers got nothing in return – the Saudi family got use of the U.S. military to attack Syria. \\nPhony polls are just another form of insidious propaganda – it’s a tool designed to persuade the masses to go the direction of the poll and discourage the other side from voting. It worked for Hitlery and the DNC against Bernie in California. But the people woke up enough to see through the ruse in the big election. \\nThe election results on Tuesday were not about giving Trump or the Republican Party a political and economic policy mandate. The only mandate issued on Tuesday – quite loud and clear – was this: “Someone please stop Washington DC and Wall Street from date-raping us in the bodily area where waste exits.” That was it. Obama had the same mandate in 2008 and completely betrayed his supporters. \\nJudging from the early indications from the Trump camp regarding Trump’s likely cabinet and advisor appointments, it’s going to be out with the old and in with the old. Currently it appears as if the new Attorney General will be Rudy Guiliani, who is a blatant Establishment hack; Larry Kudlow as an advisor, who is the worst economist in modern era; and Jamie Dimon, CEO, JP Morgan/Chase – who should be in jail – and Goldman Sachs alumnus Steven Mnuchin as Treasury Secretary. More of the same. Neocon elitists, Establishment apologists and Wall Street thieves. \\nThe Shadow of Truth hosted special guest, Eric Dubin of The News Doctors to review and dissect what happened on Tuesday evening. Unfortunately, it’s not difficult to conclude that not much will change when Obama hands the Oval Office wand to Trump: Share this:'"}, "time": 1742564224.0898628}