{"duration": 0.09630107879638672, "input_args": {"text": "'Alec Baldwin’s mocking parody of President Donald Trump on Saturday Night Live has helped propel the show to its strongest ratings in years  —   but the actor denies that the   impression helped Trump win the White House in November. [In an interview with the Sunday Telegraph to promote his latest animated film, The Boss Baby, the    actor said that people had approached him after the election to tell him that his impression helped smooth out Trump’s edges and had helped “humanize” him.  “There were people who came to me after the election and said, ‘Well, how do you feel that you are, to some degree, responsible for Trump winning the election? ’” he told the outlet. “I thought they were kidding, but they said, ‘You humanised him. You took the edges off and made him more personable. ’” “I don’t agree with that,” he added. Baldwin debuted as Trump during the 42nd season premiere of SNL in October last year. The show’s skits initially mocked the debates between Trump and former Democratic candidate Hillary Clinton, and after Trump won, they took aim at the president’s penchant for tweeting and for his confrontation with the 9th Circuit Court over his executive orders on immigration. Baldwin has previously said that playing Trump is “not always fun,” and recently said he planned to retire the impression in the near future. “As an actor who studies other people, I was completely convinced that when Trump won, he would completely transform himself,” the actor told the Telegraph. “Like in sports, when you beat the hell out of somebody and you win, you shake hands, maybe have a beer together, and you’re a more polite, obliging person. But with Trump, there was none of that. ” “He was as bitter and miserable after he won as he was before. That is a complete mystery to me,” he added. Offscreen, Baldwin has been a fierce critic of the president. On the eve of Trump’s inauguration, the actor appeared at a rally outside Trump Tower in Manhattan alongside other   celebrities including Michael Moore, Robert De Niro and Mark Ruffalo. Baldwin has also teased Trump on Twitter. But the actor says that despite his skewering of the president, he does not see his impression as being part of a larger “resistance” against Trump. “People thank me for ‘the resistance’ that I’m participating in, but I don’t see it that way,” he told the Telegraph. “I don’t mind if people do, but I don’t do it for that reason. I do it to entertain people. It’s purely about entertainment. ”   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628382.2369719}