{"duration": 0.06467151641845703, "input_args": {"text": "'AT&T, Time Warner and the Death of Privacy   \\nBy Amy Goodman and Denis Moynihan AT&T plans to buy Time Warner for $85.4 billion. ( Mark Lennihan / AP ) \\nIt has been 140 years since Alexander Graham Bell uttered the first words through his experimental telephone, to his lab assistant: “Mr. Watson—come here—I want to see you.” His invention transformed human communication, and the world. The company he started grew into a massive monopoly, AT&T. The federal government eventually deemed it too powerful, and broke up the telecom giant in 1982. Well, AT&T is back and some would say on track to become bigger and more powerful than before, announcing plans to acquire Time Warner, the media company, to create one of the largest entertainment and communications conglomerates on the planet. Beyond the threat to competition, the proposed merger—which still must pass regulatory scrutiny—poses significant threats to privacy and the basic freedom to communicate. AT&T is currently No. 10 on the Forbes 500 list of the U.S.‘s highest-grossing companies. If it is allowed to buy Time Warner, No. 99 on the list, it will form an enormous, “vertically integrated” company that controls a vast pool of content and how people access that content. Free Press, the national media policy and activism group, is mobilizing the public to oppose the deal. “This merger would create a media powerhouse unlike anything we’ve ever seen before. AT&T would control mobile and wired internet access, cable channels, movie franchises, a film studio and more,” Candace Clement of Free Press wrote. “That means AT&T would control internet access for hundreds of millions of people and the content they view, enabling it to prioritize its own offerings and use sneaky tricks to undermine net neutrality.” Net neutrality is that essential quality of the internet that makes it so powerful. Columbia University law professor Tim Wu coined the term “net neutrality.” After the Federal Communications Commission approved strong net neutrality rules last year, Wu told us on the Democracy Now! News hour, “There need to be basic rules of the road for the internet, and we’re not going to trust cable and telephone companies to respect freedom of speech or respect new innovators, because of their poor track record.” Millions of citizens weighed in with public comments to the FCC in support of net neutrality, along with groups like Free Press and The Electronic Frontier Foundation. They were joined by titans of the internet like Google, Amazon and Microsoft. Arrayed against this coalition were the telecom and cable companies, the oligopoly of internet service providers that sell internet access to hundreds of millions of Americans. It remains to be seen if AT&T doesn’t in practice break net neutrality rules and create a fast lane for its content and slow down content from its competitors, including the noncommercial sector. Another problem that AT&T presents, that would only be exacerbated by the merger, is the potential to invade the privacy of its millions of customers. In 2006, AT&T whistleblower Mark Klein revealed that the company was secretly sharing all of its customers’ metadata with the National Security Agency. Klein, who installed the fiber-splitting hardware in a secret room at the main AT&T facility in San Francisco, had his whistleblowing allegations confirmed several years later by Edward Snowden’s NSA leaks. While that dragnet surveillance program was supposedly shut down in 2011, a similar surveillance program still exists. It’s called “Project Hemisphere.” It was exposed by The New York Times in 2013, with substantiating documents just revealed this week in The Daily Beast. In “Project Hemisphere,” AT&T sells metadata to law enforcement, under the aegis of the so-called war on drugs. A police agency sends in a request for all the data related to a particular person or telephone number, and, for a major fee and without a subpoena, AT&T delivers a sophisticated data set, that can, according to The Daily Beast, “determine where a target is located, with whom he speaks, and potentially why.” Where you go, what you watch, text and share, with whom you speak, all your internet searches and preferences, all gathered and “vertically integrated,” sold to police and perhaps, in the future, to any number of AT&T’s corporate customers. We can’t know if Alexander Graham Bell envisioned this brave new digital world when he invented the telephone. But this is the future that is fast approaching, unless people rise up and stop this merger. \\nAdvertisement'"}, "time": 1742562657.9912145}