{"duration": 0.045508623123168945, "input_args": {"text": "'An   play that paints an ominous picture of a   Trump America is shutting down in New York City after struggling to build an audience in the liberal city. [Building the Wall, written by Tony   playwright Robert Schenkkan, is closing a month early, the play’s producer Jeffrey Richards told the New York Times.   Schenkkan took to Twitter Friday to announce the play’s “final performances this weekend,” ahead of its original July 9 end date: Final performances this weekend for @BLDGtheWallNYC   at New @newworldstages! Come see @TheRealTTunie and @JamesBadgeDale burn it up!  —   ROBERT SCHENKKAN (@ROBERTSCHENKKAN) June 2, 2017,  The political thriller, according to the Times, follows a history professor named Gloria (Tamara Tunie) who interviews a former security officer named Rick (James Badge Gale). It’s 2019, and President Donald Trump has been removed from office after a terrorist attack in Times Square forces him to declare martial law and place Muslims and Mexicans in containment camps  —   which eventually turn into killing chambers. Gloria visits Rick in prison, where he explains his hand in the deadly terror. The play received a series of negative reviews, which Richards said contributed to its early shutdown. “Our author built a powerful play however, during this Tony Awards season and during a season which has not been kind to straight plays, we were unable to build an audience,” he said. “It is especially difficult to do so when you are Off Broadway. ” One Times review said the “hastily” written play “hobbles” along, crippled by “familiar ideas” like a prison interview. Schenkkan, who has been openly critical of President Trump, says the   play took him just one week to write in what he described as a “  fury” after the election. “We no longer live in a world that is business as usual —  Trump has made that very clear —  and if theater is going to remain relevant, we must become faster to respond,” Schenkkan told the Times. “We cannot hope to be useful if we can’t respond until 18 months after the fact. ” Despite its early closing, Richards said the play has been extended in Los Angeles, and there are new production rehearsals underway in Chicago, Miami, and Santa Fe. Other productions have been scheduled for Austria, Canada, Iran, and Mexico. Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742563701.7449467}