{"duration": 0.18320679664611816, "input_args": {"text": "'The most important issue for the United States economy in 2017 and beyond is whether it’s near its speed limit. It has taken eight years of glacial expansion, but the nation is closing in on what economists believe to be its full productive capacity. It’s nearing that level of activity in which nearly everybody who wants a job has one, and factories and offices are cranking at full speed. If the economy grows just 2. 5 percent this year, gross domestic product will reach the Congressional Budget Office’s estimate of the nation’s economic potential by the end of the year. If the Trump administration succeeds at achieving the 4 percent growth the president has said he seeks, we’ll be there by the Fourth of July. If there is in fact more room to grow beyond the budget office’s estimate of “potential G. D. P. ,” an economic boom remains possible. If there isn’t, higher growth will translate into inflation, not higher output and incomes. The question for the Trump administration, the Federal Reserve and every American who wants a higher paycheck is how much slack there really is in the economy. Economic slack takes the form of empty warehouses and office parks of machines that run eight hours a day when they were built to run for 12 and, most important, millions of Americans who might be coaxed to work in a booming economy but who aren’t even looking for a job now. If there is a lot of slack, then the Trump administration’s ambitious growth targets look more plausible, and the Fed should move slowly on raising interest rates so as not to choke off the expansion just as it’s getting going. If there’s not very much  —   if this is about the best the nation can expect to do  —   then either the Fed will raise rates more quickly to choke off growth or inflation will burst higher, or both. Astronomers can’t observe a black hole directly they can determine where one is only by measuring how it affects nearby matter. Potential output is similar. For all the apparent precision of reports from government agencies, potential G. D. P. isn’t something that can be directly measured. It’s a judgment based on other evidence. How big is the population of prime   people, and how many of them would be expected to seek work? How low in the past has unemployment gone before inflation became a problem? What is the recent record of productivity growth? In assessing how close we are (or aren’t) to full capacity, it helps to look at America’s industrial parks and office complexes. The Federal Reserve watches the industrial sector by measuring what is called factory capacity utilization. American companies were operating factories at 75. 7 percent of their potential in January. That’s roughly the rate they’ve been at for the last five years. Experience suggests it could go higher. In the spring of 2007, the rate was 79. 5 percent. It was above 80 percent for the better part of the 1990s. In other words, the manufacturing sector would seem to have room to produce more stuff even without expanding factory floors or adding equipment. At Caterpillar, the giant maker of heavy equipment based in Peoria, Ill. Jim Umpleby, the chief executive, told analysts last month that, even as it closely managed costs, “we’re also preserving capacity for a potential increase in business whenever that comes. ” Economic slack is trickier to measure in the service sector good luck judging whether, say, an insurance company is operating below or at its full potential. But one window into it is the office vacancy rate. Nationwide, 15. 8 percent of office space was vacant in the final months of 2016, according to the real estate information firm Reis. That was down from a recent high of 17. 6 percent in 2011  —   but could still have room to fall. In the last expansion, it fell as low as 12. 5 percent, implying that millions of square feet of offices are sitting idle, ready for   workers to fill them. “Vacancy has fallen, but there are still some large blocks of space out there,” said John Ferguson, president of the Southeast division of the commercial real estate firm CBRE. “A tenant can typically find a   solution if they need to, even if it’s not perfect for the long term. ” One thing to keep an eye on: Development of new office space has been relatively depressed since the 2008 recession, which raises the possibility that the remaining vacant space could be filled up quickly with little new supply arriving to fulfill the demand. Mr. Ferguson sees it in Atlanta, where he is based, and in other Southern cities like Nashville and Charlotte, N. C. “In the last cycle 10 years ago, there were six new office towers added in Buckhead,” Mr. Ferguson said, referring to an affluent Atlanta neighborhood. “In this cycle, there’s one. ” The biggest factor that will determine how much room the United States economy has to grow is the supply of workers. The unemployment rate is the most common measure of slack in the labor market, and it suggests that full employment has very nearly arrived: The 4. 8 percent unemployment rate is roughly what Fed officials believe is the   rate that won’t provoke inflation, and not far from the 4. 4 percent low in the last expansion. But there are important wrinkles. Millions of Americans left the labor force entirely in the aftermath of the last recession. And there are “missing” workers, people who do not count as unemployed because they are not looking for a job but might be available to work  —   and contribute to G. D. P.  —   if things were rosier. To people who work on employment issues, there is both good news and bad. “A third to a half of the people on the sidelines, it wouldn’t take much to employ tomorrow,” said Stefani Pashman, chief executive of Partner4Work, a work force development group in the Pittsburgh area. “The other half are much tougher to employ,” often facing challenges from drug use, criminal records and transience. That would seem to support the idea that there are meaningful numbers of   workers out there  —   but not an unlimited number. The Economic Policy Institute calculates that there are 1. 85 million missing workers. In all these areas, the evidence points to an economy not being quite on the verge of overheating, but also not offering huge potential for growth. Perhaps the best argument for policy makers to be cautious about putting the brakes on economic growth with rapid Fed interest rate increases is how much we don’t know about why growth has been so disappointing over the past several years. Here’s a weighty fact: In 2007, the Congressional Budget Office published   projections of potential G. D. P. that assumed the United States would grow around 2. 7 percent a year for the ensuing decade. It didn’t. Growth in both the labor force and worker productivity underperformed those projections. So the reality we’re living in underperforms that theoretical potential by $2. 2 trillion, or 14 percent. One possibility of what went wrong is that the damage of the deep 2008 recession had lasting effects, both pulling some Americans out of the work force and causing businesses to underinvest in innovations. Weak demand for goods and services damaged the capacity of the economy, producing a vicious cycle. If officials at the Fed and in the Trump administration try to run the economy a little hot  —   to keep pursuing faster growth even as the economy gets close to or above potential G. D. P.  —   it would be a chance to do the reverse, to create a virtuous cycle. Trying it carries risks of its own  —   of inflation, and perhaps new financial bubbles. The alternative is to take the   world we’ve been living in as an immutable fact of life, and get used to it.'"}, "time": 1742564281.588093}