{"duration": 0.07952046394348145, "input_args": {"text": "'WATCH: ‘Damn!’ Liberal Hosts Flustered Over NEW Proof Clintons Are Dirty   Shae Weatherall in Politics Share This \\nOn Thursday, the panel on MSNBC’s “Morning Joe” reacted to recently leaked documents, proving the Clintons’ involvement in dirty financial dealings while Hillary Clinton was Secretary of State. They were so flustered by the damning evidence, one of the liberal hosts even used the words “Damn” and “Yuck” while describing the information as another said this could be the big story that ends it for Hillary. \\nFox News reports that among the new WikiLeaks release of John Podesta’s emails was one containing an attachment to a twelve-page memo written in 2011 by Doug Band, a long-time aide to former President Bill Clinton. Within the text, Band talks about the “circle of enrichment” which financially benefits the Clinton Foundation as well as the Clintons personally. Band used the contacts of his company, Teneo, to solicit donations to the Foundation from major corporations and to set up “for profit” engagements for Bill Clinton. Band referred to the paid appearances as “Bill Clinton Inc.” \\nWithin the memo, Doug Band described his role in helping to make the Clintons rich by leveraging their political influences. “ This memorandum strives to set forth how I have endeavored to support the Clinton Foundation and President Clinton personally ,” Band wrote. \\nUnder a section titled “For-Profit Activity of President Clinton (i.e., Bill Clinton, Inc. ),” Band wrote that he and Clinton aide Justin Cooper “found, developed and brought” to Clinton all four of his advisory arrangements at the time – arrangements that “ yielded more than $30 million for him personally, with $66 million to be paid out over the next nine years should he choose to continue with the current engagements .” The memo also included a footnote explaining how Clinton’s speaking agent estimated that during a 10-year period, “ $20 million in speeches for the President have derived … from Justin and my efforts.” [via FOX News ] \\nThis leaked memo consumed a large portion of Thursday’s “Morning Joe” on MSNBC , however, it’s clear in the first two minutes of the five-minute clip below that the show’s panel is shocked and flustered over the Clintons’ dirty financial dealings that have been exposed. Mika Brzezinski even suggested that the only word that can be added to the discussion of the new scandal is “ Damn! ” \\nJoe Scarborough commented with some derision about how he views the Clintons’ use of their political leverage and their “charitable” Foundation as bait to fatten their own personal bank accounts. “ Maybe they’re using the State Department, but using relief work in Haiti? ‘Hey can you help those suffering in Haiti? It’s really important. Thanks, listen, could you also give Bill Clinton $500,000 to give a speech? In your corporate luxury box?’ ” At the end of Joe’s impression of the unethical dealings, Mika added a disgusted, “ Yuck .” \\nYuck, indeed. Also during the panel discussion, it was asked what the perception would be if a Bush had been engaged in this type of scandal. Incredibly, several of the participants, including Joe, admitted that the Bush family “would never do this.” \\nFinally, the magnitude of the collective proof of the Clintons’ unethical and illegal activities appear to have put seeds of doubt in the minds of some of their loyalists, but is it enough? Is it too late? Even though a few of the liberal news outlets have chosen to do the right thing, for once, in reporting on this “Bill Clinton Inc.” scandal, it’s unlikely it will last long in the spotlight of the national media. \\nIt’s up to us, We the People , to make sure this kind of information reaches every corner of social media in the hopes that it will help to influence those voters who are still undecided. We only have ten days left to share the truth and make sure Hillary Clinton stays far away from our White House.'"}, "time": 1742562080.1232584}