{"duration": 0.14121747016906738, "input_args": {"text": "\". Mainstream Media Crashed — The Scapegoat is 'Fake News' They kept telling the American people Hillary Clinton was going to win the election; and in every wa... Print Email http://humansarefree.com/2016/11/mainstream-media-crashed-scapegoat-is.html They kept telling the American people Hillary Clinton was going to win the election; and in every way they could think of, they told the American people this was a good idea. Then, on election night, they, the media, crashed. The results came in. The media went into deep shock. As protests and riots then spread across America, the media neglected to mention: a) they’d been bashing Trump because he said he might not accept the outcome of the vote, and b) here were large numbers of people on the Democrat side who weren’t accepting the outcome of the vote.A new campaign had to be launched. Suddenly, on cue, it was: Hillary Clinton lost because “fake news” about her had been spread around during the campaign. Fake news sites. That was the reason. These “fake sites” had to be punished. Somehow. They had to be defamed. Blocked. Censored. Here is an excerpt from a list of “fake news” sites suggested by one professor. The list is circulating widely on the Web: Project Veritas; Obama put in his two cents : “Because in an age where there’s so much active misinformation and it’s packaged very well and it looks the same when you see it on a Facebook page or you turn on your television… If everything seems to be the same and no distinctions are made, then we won’t know what to protect.” Excuse me. “We won’t know what to protect?” Meaning what to favor, what to promote, what to lie about? Meaning only some speech is free? Obama is way, way behind the curve. Thousands of websites and blogs have been exposing major media as fake for years. I started nomorefakenews.com in 2001. If Google, Facebook, and Twitter keep expanding their censorship of “disfavored messages,” they’re going to pay a price. More and more users will go elsewhere. The facade of the major media is getting thinner. You can see a glow of rage and resentment behind it. They’re desperately looking for revenge on the millions and millions of people who are deserting them and laughing at them. They presumed too much. They presumed they had us in the palm of their hand. We were their property. We were transfixed by their authority. All that is going away. Bye, bye. The big shift is accelerating. Independent media are in the ascendance. Understand that. Recognize it. The impossible is happening. Fake news sites? Please. The major media are the biggest fakes the world has ever seen. Their anchors and star reporters are bloviating cranks. They’re dinner-theater actors. The Mainstream Media has been caught faking news countless times, which had serious consequences worldwide: 9. BBC Journalist Comes Clean: 'Believe Nothing You Read Or Watch' Over the years, I’ve talked to some of them. I’ve warned them of their coming troubles. They were miles away from believing me. Now, they’re starting to sweat blood. Major media news for America is still basically manufactured in New York and Washington — plus occasional outbursts from Hollywood creatures who bemoan the decline of inclusive liberalism, as they expand their gun-toting security staffs and dig deeper bunkers. The New York-Washington axis exists in a self-serving bubble, which has now taken serious punctures. The delusional attacks against “fake sites” underlines how out of touch these elites are with the rest of the country. Independent media outlets are winning. They won’t be stopped. When the people who now head the tech giants were growing up, they were heralding the Internet as a new era of free information-exchange. But now that they find themselves working with the government in the Surveillance State, they’re fronting for censorship. In fact, they’re showing they were never for freedom. That was a pose all along. They were, from the beginning, agents of repression. They can try to stop independent media now, but they will fail. Fake web sites? What about fake companies? What about Google, Facebook, Twitter? Behind their happy-happy messages, they were built to propagandize, profile, and control. Understand this: major media have a rock-bottom article of faith. It is: “We own the news.” They can’t give it up. They’ll never give it up. It fuels everything they do. It’s the substance and core of their attitude. As their ship goes down below the waves, they’ll be chanting it. “We own the news.” But they don’t. In truth, they never did. For a time, they managed to sell that delusion to the people. That time is drawing to a close. The elite political class and their media minions fear more than independent news countering their own news. For obvious reasons, every civilization down through history has had its own monopolistic media, its central “broadcasting system.” Its controlled outlet. But now, The One has become Many. That is the threat. The rapid proliferation of The Many is an unpredictable X-factor. The population is waking up to decentralized media. Instead of the hypnotic attachment to one basic information source — the habit of a lifetime — the public is learning to handle multiple sources. Therefore, the hypnotic spell is being broken and dissolved. This is the basic problem for the elites. How can they reinstate the trance? By trying to censor the Internet? By creating a sudden war or other disaster, briefly “unifying” the country? These are not permanent solutions, particularly since more and more people understand such maneuvers and their true aims. Awake is awake. Putting the genie back in the bottle — particularly when major media denizens aren’t very bright, as evidenced by their latest “fake news” scam — is on the order of trying to perform a piece of stage magic after the audience has already learned how it’s done. Of course, the media clowns will try. And in the process, they’ll further expose themselves and actually assist in the awakening. Boom. By Jon Rappoport Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742561822.5957766}