{"duration": 0.10140299797058105, "input_args": {"text": "'It happens every spring. It’s time to play ball, so publishers fill out a new lineup card of biographies, team histories and other baseball scholarship. This season must begin by acknowledging the surreality that after 108 years, the Chicago Cubs are again World Series champions. “The Plan” (Triumph, $24. 95) by David Kaplan, is a chronicle of the project to turn “one of the worst organizations in baseball” into “a dynasty in the making. ” Kaplan starts with the 2009 purchase of the franchise by Tom Ricketts, and the subsequent wooing of Theo Epstein, the general manager behind two titles for the formerly cursed Boston Red Sox. Chicago’s farm system is stocked and Joe Maddon, the Tampa Bay Rays manager, is signed ahead of the 2015 season. Add youngsters like Kris Bryant and Kyle Schwarber, and free agents like Jon Lester, and a   club is finally No. 1. There’s too much   esoterica  —   one appendix lists clauses from   contracts for buildings around Wrigley Field  —   but Cubs fans won’t mind. As for New York teams, “Casey Stengel” (Doubleday, $27. 95) by Marty Appel, is the ultimate biography: Stengel not only played for the Brooklyn Dodgers and New York Giants, he managed the Dodgers before steering the New York Yankees to their greatest run of dominance and became the first manager of the New York Mets. Paul Dickson’s “Leo Durocher” (Bloomsbury, $28) chronicles the adventures of Leo the Lip, the colorful player (briefly for the Yankees, later the Dodgers) and manager (for the Dodgers, Giants and other clubs) who stayed in the sports pages for more than 40 years. Steve Steinberg’s “Urban Shocker” (University of Nebraska, $32. 95) recalls a Yankees pitcher who should be better known for his name alone. A spitballer who was traded to the St. Louis Browns, Shocker had four   seasons before returning to New York in time to be part of the 1927 championship team. “Piazza” (Sports Publishing, $24. 99) by Greg W. Prince, revels in a more recent and beloved player. The   catcher of all time, Mike Piazza was already a Los Angeles Dodgers star when he was traded twice in 1998, first to the Florida Marlins, then to the Mets. After all Piazza did for the team (and the team for him) Prince’s book explains why it meant so much to New York fans that Piazza went into the Hall of Fame last year as a Met. Around the league, former players telling stories include Rick Ankiel, the St. Louis Cardinal who lost his ability to pitch. In “The Phenomenon” (PublicAffairs, $27) written with Tim Brown, Ankiel speaks of succumbing to the anxiety disorder commonly called the yips, then reclaiming his career as an outfielder. Ankiel has company. Dennis Snelling’s compelling biography, “Lefty O’Doul” (University of Nebraska, $27. 95) tells of the pitcher who, after a sore arm, became one of baseball’s greatest hitters and hitting coaches before helping to establish the game in Japan. “Ballplayer” (Dutton, $27) is a confessional memoir from Chipper Jones (with Carroll Rogers Walton) the likely Hall of Famer who spent his entire   career with the Atlanta Braves. Mets fans know he enjoyed beating their team so much that he named one son Shea, after Shea Stadium they may not recall that Jones hit his first   homer there. He details that moment and many others, including   behavior that led to two divorces. “One Nation Under Baseball,” by John Florio and Ouisie Shapiro (University of Nebraska, $29. 95) looks at how the turmoil of the 1960s sowed the seeds for today’s game. A recurrent theme is ballplayers’ fight for higher wages, and when the labor lawyer Marvin Miller was hired in 1966 to lead the players’ union, it was all over but the court filing: The Curt Flood case taking on baseball’s reserve clause would eventually lead to free agency. This excellent read also covers race relations and other social issues, as well as the decade’s most memorable teams, players and events. Free agency would eventually disrupt all clubs, but its earliest victims may have been the Oakland A’s. “Dynastic, Bombastic, Fantastic” (Houghton Mifflin Harcourt, $26) by Jason Turbow, recounts the team’s   dominance, when it won three straight World Series with a lineup that included Reggie Jackson, Joe Rudi and Sal Bando and a pitching staff anchored by Catfish Hunter, Vida Blue and Rollie Fingers. By 1976, free agency broke up the squad, and the club’s owner, a sympathetically drawn Charlie Finley, would sell it a few years later. “Off Speed” (Pantheon, $23. 95) by Terry McDermott, tracks the evolution of pitching from its earliest days, when the ball was thrown underhanded, to the modern science of hurling one at virtually superhuman speeds. McDermott describes nine pitches, weaving player and coach interviews into an absorbing examination of this arcane art. (Along the way he discloses secrets of the game: How have I never heard of Lena Blackburne Baseball Rubbing Mud?) As Jane Leavy did in “Sandy Koufax,” McDermott frames his book around the nine innings of a perfect game here it’s the one Felix Hernandez of the Seattle Mariners threw in 2012. An ideal counterpart is “Almost Perfect” (Lyons, $26. 95) by Joe Cox. As that baseball fanatic Tolstoy almost wrote, “All perfect games resemble one another each imperfect game is imperfect in its own way. ” Cox analyzes the 16 games between 1908 and 2015 in which pitchers retired at least the first 26 batters they faced, only to see perfection elude them. The    books will bring us safely home. Two fresh collections hail from north of the border. In “Baseball Life Advice” (McClelland  Stewart, paperback, $18) the Canadian novelist Stacey May Fowles, an avid Toronto Blue Jays fan, raises topics not often discussed, starting with an affecting account of how, during periods of intense depression, the game kept her going when nothing else would. And her analysis of everything from Jose Bautista’s epic bat flip (she favors it) to Jose Reyes’s public rehabilitation after his suspension for domestic abuse (she’s opposed, mostly) brings a perspective that’s all too rare. “Fail Better” (Biblioasis, paperback, $16. 95) by Mark Kingwell, a University of Toronto philosophy professor, is a ballpark ramble of memoir, lore and nostalgia. Its north star is baseball’s     its leisurely Zen gaps between actions. In one brief detour, he draws a line from Chicago’s championship to the election, days later, of Donald J. Trump. Kingwell doesn’t quite say it, but the implication is clear: This is what happens when the Cubs win the Series.'"}, "time": 1742563758.7558231}