{"duration": 0.11762356758117676, "input_args": {"text": "'More people are coming to the truthful conclusion that globalism is a failure and nationalism, where a country’s people and interests are valued above that of non-citizens, is the way forward. A problem is that the globalism-nationalism framework is exactly the type of dialectic elites can use to usher in a global war or crackdown to further increase their power.\\nImagine there is a wife who is tired of her husband going out every night with his friends to drink. Instead of nagging at him every evening, which would have the effect of motivating him to leave the house even sooner, she will wait until he gets into a drunk driving accident or serious bar fight so she could “draw the line” and make the reasonable ultimatum for him to never drink again. The husband is more likely to listen to her after something wrong takes place than after he had a safe night out.\\nRight now the nationalist movement is being allowed to gain strength so that a future event can act as a trigger for globalists to “draw the line” on the movement by imprisoning or killing its strongest members. In other words, globalists plan to use nationalism as a trap, a device they transform into to their advantage. As of right now, the budding nationalist movement is extremely useful in allowing them to identify all “resisters” before easily crushing them when the time is right.\\nElites cannot advance their plans without a dialectic \\nThe way the elites move an agenda forward is through a dialectic , meaning that two opposing ideologies rub against each other, create friction, and from that comes a desired result (i.e. “order from chaos”). Those in power either control or monitor the existence of both sides to guide and bend the dialectic to serve their ends.\\nThe recent rise in nationalism, I speculate, has been allowed because previous dialectics such as capitalism vs communism and democracy vs terrorism are no longer useful in advancing the desired agenda. Soviet Communism is dead and increased terrorism did not allow planned wars in Syria and Iran to proceed like 9/11 did with Iraq and Afghanistan. In addition, the white vs black race war is years late, stubbornly resistant to the gasoline that Obama pours onto the fire. A new dialectic must be nurtured, and so nationalism may just do the trick. Hillary’s recent alt right speech officially debuted American nationalism as the new “enemy.”\\nWhile your conclusion that nationalism is logical and beneficial to a nation is true, and I’m sure to agree with it, you were guided onto those beliefs. How did you arrive at nationalist thought? Through decades of free trade, feminism, and open-door immigration that have worn you and your country down. Your arrival at nationalist conclusions is the direct result of globalism, which means that nationalist thoughts exist in your mind only because of the likes of George Soros, who pulled out a million Muslims from his hat and placed them in Europe while sponsoring a multitude of social justice organizations in the United States. His actions and behavior, along with other powerful globalists like him, have essentially created your very ideology, because you are entrenched in a dialectic where opposing forces must exist and be in combat with each other.\\nThe growth of nationalism is “useful” Nationalism must continue to grow in power right before the moment it can threaten globalist banking and geopolitical interests, and when it does, the globalists will clamp down severely on it. As if replaying World War 2, they will identify a nationalist country as the big bad bully, and then use that country as an excuse to start a war that will simultaneously weed out nationalists throughout the world by sending them to die or having them arrested at home for “subversion” or “treason.” Russia is the evil nationalist country that neocons and others have been poking, and even Poland is being puffed up into an “undemocratic” country in order to hedge their bets.\\n\\nA hint that this may already be taking place is that France recently called upon “patriots” to serve in their National Guard to “protect citizens.” Since when does France care about patriots? They have committed no consistent actions in the past decade that suggest they do care, so we must reasonably conclude that this new army is a trap to attract nationalists into a game where the end result is their death. I wouldn’t be surprised if France’s beefed-up army is used to start a war in a place like Poland, which will be painted as an aggressor that caused “economic attacks” upon the saintly Western Europeans.\\nAs long as you’re in the dialectic, which I see as a sort of Twilight Zone creation of the mega rich, you’re fighting on their terms. They need the nationalist “grassroots” uprising to create violent events that allow them to re-assert control and power. Even though nationalism may be the most sane movement of the day, it still plays into their hands as long as we insist on having only two sides of the debate, good and evil, as if we were living in a Hollywood-style storyline. Instead of this two-dimensional arrangement, the solution may be to go 3D, where you can move front and back and around in a spectrum of ideas, instead of just left and right where you’re a pawn of the game no matter what side you pick.\\nJust because a nationalist “resistance” is growing, doesn’t mean that that the globalists in power are being hurt. Without being able to effectively control the Western population through the Cold War, terrorism, racial divide-and-conquer, or modern Russian aggression, they are hoping that the nationalist movement grows enough to create the conflict that moves their chess pieces forward. While I’m not urging you to throw away your nationalist beliefs, as I surely won’t throw away mine, it is clear to me that a trap is waiting to be sprung, and we will all suffer when it’s finally launched.\\nThis article was originally published on Roosh V . \\nDon’t Miss: Patriarchal Nationalism: What Is National Identity? \\n'"}, "time": 1742564099.4612775}