{"duration": 0.06344008445739746, "input_args": {"text": "'FRESNO, Calif.  —   The wrinkled leading ladies of the Ringling Bros. and Barnum  Bailey circus, wearing sequined headpieces and holding each other’s tails, performed their last routine in May. It was the end of an era:   laws had finally made elephants, the   symbol of the American circus, economically unviable as traveling entertainment. Traditionalists were sad. Activists were happy. And Feld Entertainment, which owns Ringling, was left to reinvent one of the hoariest forms of family amusement  —   a corporate   act if there ever was one, as the Feld family learned the hard way in a disastrous 2006 modernization attempt. The new Ringling show, “Out of This World,” produced by Alana Feld, 36, will have its premiere on Thursday in Los Angeles. But it first stopped in this dusty Central Valley city for a test run. Would new elements  —   an ice floor, an elaborate narrative, a smartphone app  —   make audiences forget to miss the elephants? Or would the Greatest Show on Earth prove a little less grand without its prancing pachyderms? Judging from the zealous applause during a   performance on Saturday and interviews with patrons afterward, Ms. Feld’s vision has its fans. “It didn’t feel like the same old circus that comes every year, and we really liked that,” Amber Ford, 28, said as she left the Selland Arena with her    son, Braden, and her mother, Esther Adams. A reporter baited her: Did she find anything missing  —   something strongly associated with the circus experience, perhaps? “Yes,” Ms. Ford said, emphatically. “There were no acrobats on trampolines. ” The show does, indeed, go on. Work on “Out of This World” began roughly two years ago, long before Feld Entertainment announced in March 2015 that it would phase out elephants nationwide because so many cities (Los Angeles among them) had banned the use of related training equipment. “We saw this as an opportunity to evolve the Ringling Brothers brand,” Ms. Feld said in an interview. “We have always changed our show, adding new themes and bringing in new performers. But this was about doing something drastic. ” She quickly added that the company paid attention “to the tradition of circus, which is about seeing these incredible humans and animals coming together to show audiences what’s possible. ” Modernization efforts are never easy, especially when the product being updated relies on nostalgia for a great deal of its appeal. Ringling’s customers tend to be parents wanting to pass along a rite from their own childhoods  —   the smell of the sawdust, the drippy snow cone, the booming voice of the ringmaster. Too much change too fast could upend a form of live entertainment that remains an enormous draw, particularly among   families. About 10 million people go to a Ringling circus each year. Feld Entertainment, which also produces Disney on Ice, Disney Live and Monster Jam arena shows, knows this tightrope all too well. In 2006, Ms. Feld’s older sister tried a circus update that eliminated the   model, added giant video screens and vanquished the tiger tamer and other classic acts. Audiences and critics recoiled, and Ringling quickly backtracked. Perhaps learning from that mistake, “Out of This World” relies on    circus acts (clowns having a snowball fight, a trainer kissing a leopard on the lips) while layering on a story line, adding the element of ice and speeding up the pacing. The show begins quietly. There is no ringmaster shouting “Ladies and gentlemen! Children of all ages!” Instead, the darkened arena is made to look like outer space using video of stars and constellations that is projected on the ice and the arena walls. An eerie   soundtrack plays as fake fog envelops a contraption in the center ring that slowly spins like a satellite. Aerialists dressed as astronauts (white suits, bubble helmets) soon perform a series of   balancing tricks on it. Then comes a     opening that sets up the tale: Tatiana, an evil galactic queen, has kidnapped the circus stars and hidden them on fictional planets, requiring the ringmaster and others to race against time to find them. Fireworks pop and comets streak across video screens. Out race nine clowns, 16 ice skaters, 12 stunt riders on horseback, 10 unicyclists and a   motorcycle   among other performers, including a dwarf. And that’s just the humans. “Out of This World” includes about 80 animals, such as lions, tigers, dogs, pigs and a kangaroo. (Some acts were stronger than others in the Fresno trial run. While the snarling tigers held the audience rapt, a performance by donkeys  —   they hopped over sedentary llamas  —   lacked a     ? theatricality.) The show, which requires 56 railroad cars to transport, incorporates technology in new ways. A free app has features like push notifications designed to engage the audience before the show and during intermission. Toy swords, telescopes and blasters sold in the arena aisles and corridors before show time change colors during the performance, based on the story line. (Everything turns green, for instance, when Queen Tatiana emerges.) Sensors that create computerized spotlight effects are sewn into costumes, in particular those worn by stunt skaters from China, who zoom across the ice on stilts. “Nothing can replace the elephants,” Ms. Feld said. “This wasn’t about trying. This was about creating a new genre of circus, with acts seamlessly transitioning from floor to air to ice. ” And if anyone misses the elephants, which first joined the circus in 1882 when P. T. Barnum added one named Jumbo to his lineup, there is always the concession stand. Feld sells $16 snow cones in plastic cups shaped like elephants. They sit on yellow, red and blue drums with their trunks and front feet held gamely in the air. The hinged head tilts back to reveal pineapple, cherry and   ice. Slurp.'"}, "time": 1742628528.8940582}