{"duration": 0.0664663314819336, "input_args": {"text": "'European Media Jihad Against Geert Wilders As they lose their grip, the political and media elites are getting desperate. November 4, 2016 Robert Spencer \\nThe mainstream media in Western Europe and North America isn’t even pretending to be an objective news source anymore; instead, “journalists” are working openly to quell what looks increasingly, on both sides of the Atlantic, like a popular revolution against the hegemony of the self-appointed political and media aristocracy that seems hell-bent on driving Western civilization over the cliff. And so it’s time for another round of their Two-Minutes Hate against Dutch politician and freedom fighter Geert Wilders. \\nWilders has yet again gone on trial in the Netherlands for “hate speech,” and this time the case against him is especially flimsy: as Europe is roiled by the criminal activity of Muslim migrants, he is being accused of “hate speech” for saying that the massive influx of immigrants from Morocco (from which most of the Muslim migrants in the Netherlands come) has to be stopped. \\nThis trial could very easily backfire on the Dutch inquisitors, and make Wilders more popular than ever with the people of the Netherlands and Europe in general, as they are increasingly fed up with the political and media elites’ forcing them to accept a massive influx of Muslim migrants that ensures a future only of civil strife, bloodshed, and Sharia oppression. \\nConsequently, those elites are trying desperately to shore up their position. Wilders chanted “No more Moroccans” at a rally. The horror! To any sane person, this means “Stop the influx of Moroccan immigrants who only inflate crime rates and welfare rolls.” To the media, which at this point is quite insane, insofar as insanity means an inability or refusal to accept reality, this means “Genocide!” \\nAnd so, in this Deutsche Welle (DW) piece by freelance “journalist” Teri Schultz, we’re told that European Parliament lawmaker Cecile Kyenge, who was born in Congo, had “numerous racial slurs - not to mention, bananas, literally - thrown at her, along with suggestions she go back to ‘her country.’” Does this have anything to do with the crime and civil strife that are the foundations for Wilders’ position? Of course not, but Wilders, Schultz tells us, is (of course) “far-right,” that all-purpose and meaningless semaphore that serves only to signal to right-thinking Deutsche Welle readers that Wilders is, as far as the media elites are concerned, unsavory, and must be opposed and shunned, his positions left unexamined. \\nSchultz contacted me to serve as the villain of her piece, being sure to tell her hapless readers that I am “known for extreme anti-Islam views,” to make sure that if any of them are foolish enough to find themselves agreeing with me, they will immediately reverse themselves and get their minds right. The term “extreme” also, since the Western governing class unanimously refers to jihad terrorists as “extremists,” also implies that I am a terrorist. \\nAfter the article came out, I challenged Schultz on this; she replied: “I don’t think even you would consider your views ‘mainstream’, do you?” I responded: “Absolutely yes. My views were the broad mainstream in the Western world from 632 AD until the 1960s. What changed? Not Islamic teaching.” To that she said: “Okay. You’d have to argue it with another expert, which I am not. But thanks again for contributing.” Indeed, she is just a mouthpiece for the views the political and media elites want us to hold. \\nIn any case, Schultz’s article merely reveals the desperation of the ruling class and the self-appointed opinion-shapers. They can call those of us who wish to defend the people and culture of Europe and North America “far-right” and “extreme” every day (and they do), but the public can see with their eyes what is happening. Wilders’ popularity isn’t growing because he is a charming fellow (which is, of course, not to say that he isn’t). It’s growing because he speaks the truths that the political and media elites are in a frenzy to obscure. \\nAnd it’s only going to get worse for them: the Brexit vote and the Trump candidacy (whether he wins or loses) shows that their hegemony is beginning to be challenged. Those challenges will continue, and grow. They will before too long be decisively voted out and repudiated.'"}, "time": 1742628407.0445225}