{"duration": 0.05059480667114258, "input_args": {"text": "'Share on Twitter \\nAfter less than two seasons on “The View,” co-host Raven-Symoné has officially announced she is leaving the daytime talk show: A photo posted by Raven-Symoné (@ravensymone) on Oct 19, 2016 at 12:30pm PDT \\nThis may not come as a major surprise to viewers, since rumors of her departure have been swirling since last year—not to mention the fact that she only appeared on the show around once a week this past season. \\nHowever, what the star has planned next might be more of a shock. \\nAccording to reports, Symoné is leaving the show so that she can focus all her efforts on her next project: a spinoff of her childhood show, “That\\'s So Raven.” \\nFor those unfamiliar with the show, it was about a high school girl who was able to see into the future: A video posted by Raven-Symoné (@ravensymone) on Sep 30, 2016 at 1:22pm PDT \\nDuring an interview, the actress said of her departure: \\n“I\\'m excited and sad, but mostly excited. I have an announcement to make: No, I\\'m not pregnant.” \\nSymoné then broke the news about her Disney Channel follow-up series: \\n\"There\\'s no title yet, but I\\'m calling it That\\'s So Raven 2. It\\'s Raven Baxter. It\\'s still me. \\nBut I am a mother this time. I\\'m going to be a single mother raising two kids, and one of them learns that she has visions.\" A photo posted by Raven-Symoné (@ravensymone) on May 27, 2016 at 12:35pm PDT \\nThe host stated that her last day on “The View” will be this December. But an official date has yet to be determined. \\nAs for her departure from “The View,” she said: \\n“I\\'ve had such a great time...I\\'ve learned so much, and I\\'ve been saying, my experience has been multidimensional.” A photo posted by Raven-Symoné (@ravensymone) on Jul 6, 2016 at 1:01pm PDT \\nThe 30-year-old will reportedly be moving from NYC to L.A. so that she can start filming the show. \\nFor those who have never seen the show, here is the opening of the original, which first aired in 2003: \\nThat\\'s so Raven. '"}, "time": 1742561958.7432146}