{"duration": 0.13057637214660645, "input_args": {"text": "'Bill White November 17, 2016 Product Review: Power Whisperer Pro Version \\nThe folks at Independent Living have done it again. They’ve taken their popular Power Whisperer emergency power generator and done a second upgrade, making it even better than before. \\nThis new upgrade essentially doubles the capacity of the original unit, meaning that it will provide power to meet even more of a family’s needs, for an even longer period of time. \\nI’ll tell you more about this update so keep reading the article below! \\nOne of the biggest risks we face today is that of an EMP attack. As a nation, we have enemies who are working hard to develop the technology necessary to allow them to hit the United States with such an attack. If they ever get to that point, a successful attack will set this country back over 100 years. Most electronic devices will be destroyed, but worse than that, the electrical power grid that we all depend on will be out of commission; probably for the rest of our lives. \\nThe only electronics which will survive such an attack are those which are shielded from EMP. Outside of the military, there is little that is made, which is shielded in such a manner. Yet the Power Whisperer has been designed with this possibility in mind, and is encased in 5052 aluminum. That’s more than enough to stop the EMP from touching the unit, ensuring that you’ll have electrical power, when everyone else’s lights are out. \\nI was impressed with the quality of the original Power Whisperer and the M model. These are well-built, rugged units, designed to, as Timex says, “Take a licking and keep on ticking.” But I don’t think even the designer of the Power Whisperer realized how rugged a unit he built. \\nSee below a video of a Power Whisperer M (Classic Model) that had a disagreement with a truck. Apparently the unit was being shipped when this happened. I don’t know if the truck was trying to take the unit to the wrong address and it refused to be shipped there or the two of them got into a political argument. \\nAll I know is that the truck and the Power Whisperer tried to break a law of physics and occupy the same place at the same time. To be fair, the Power Whisperer was there first, and I really can’t say that the truck had any excuse, like not seeing the unit, after all, it hit it head on. \\nWell, the results of that altercation left the Power Whisperer looking like a pile of scrap. In the video, someone in the Independent Living warehouse decided to unwrap the pile of scrap and test it out. Amazingly enough, it still provided power. That’s after being hit by a truck, all but torn limb from limb and then sitting in the warehouse, being ignored for a couple of months. \\nI hope my Power Whisperer never has to be tried by fire like that, but it’s nice to know that the one that was survived its trial. Granted, it doesn’t look too good now, but at least it works. In an emergency situation, that’s what’s important. \\nSo now they’ve decided to go ahead and upgrade this rugged beast. That intrigued me when I heard about it, because I really wasn’t sure what they’d upgrade. But I’ll have to say, they did it right. They didn’t add whistles and bells that you don’t need, they increased the capacity. \\nLet’s Upgrade! \\nAs far as I’m concerned, electrical power in a grid-down situation is like memory in a computer… you’ve never got enough. While the Power Whisperer M (Classic Model) had enough power to make it through an emergency caused by a power outage, the new one – PowerWhisperer PRO , has double that capacity but also some other features that I’m going to address in seconds. \\nThe Power Whisperer M (Classic Model) comes with a 100 amp-hour capacity. That means that it can run an electronic device that requires 100 amps of 12 volt power for 1 hour or that it can run a device that requires 1 amp of 12 volt power for 100 hours, or anything in between. There’s also a Power Whisperer M-Plus model that comes with an extra solar panel and battery that literally double your power, while all the specifications are the same. \\nThe Power Whisperer PRO model comes with the same voltage inverter, so you still have 2000 watts of 120 volt power available at any one time. In addition, there is a 12 volt outlet, so that you can power devices which are intended to run off of 12 volts. \\nDo you have any camping equipment, tools or electronics which are intended for running off your car’s cigarette lighter/accessory connector? They’ll all plug into either the M model or the new Pro model as well. \\nTo help with recharging the larger storage capacity, Lee Bellinger, the designer of the Power Whisperer has also added a second, 100 watt solar panel, increasing the charge capacity as well. You can either recharge the Model M in half the time or recharge both the M model and the extra power pack at the same time. With this extra solar panel, you can charge both in the time that it used to take to charge the Model M alone. \\nAnd the unit is expandable beyond that as well. The M model generator has enough connectors to attach up to four solar panels, increasing the recharge rate and total power available from the unit. You can also add another auxiliary power pack if you desire, increasing the overall power you have available in an emergency situation even more. \\nThese units are totally safe, using proven battery and battery charging technology which avoids “thermal runaway.” I’m sure you’ve heard of the problems that people have been having with the Samsung phones, well the charge technology used in the Power Whisperer prevent the possibility of that happening. The unit is not only safe from being hit by a truck, but from exploding as well. \\nSeeing as the Power Whisperer was inspired by military technology and intended for survival use, it even comes complete with a camouflage net system, so that you can keep your unit away from prying eyes, whether you are using it for a bug in or you’re providing power to your survival retreat in a bug out. \\nThis is a well thought out unit, which will provide the electrical power your family needs, when you are faced by the next disaster. Built in America and built to withstand whatever is thrown at it, the Power Whisperer Pro gives your family a level of security you won’t find just anywhere. Now is the moment to get your power generator and solve your energy problem for years. You’ll also get 3 exclusive Survivopedia bonuses worth $150 when you invest in your Power Whisperer. Click the banner below and grab the opportunity of paying in monthly installments instead of paying for it all at once! \\nThis article has been written by Bill White for Survivopedia. 1 total views, 1 views today'"}, "time": 1742562207.880491}