{"duration": 0.048636436462402344, "input_args": {"text": "'On March 27, Breitbart News reported that “Footy McFoot Face” was leading all other possible names for San Diego’s Major League Soccer team by a wide margin. [On April 1, KGTV reported the name’s surging popularity was the result of Los Angeles FC fans who had trolled the poll to decide what to name the new team.  KGTV previously reported that other possible names for the team included “San Diego Bad Hombres,” “San Diego Surf,” “Mission San Diego FC,” “San Diego Football Club (SDFC),” and “San Diego Armada. ” Votes for the various names were being cast and tallied on SoccerCity SD’s Facebook page. On April 1 —  after voting had ended —  SoccerCity SD posted a video announcing “Footy McFooty Face” as the winner, only to follow the announcement by admitting it was an April Fool’s joke.  SoccerCity SD’s Landon Donovan said, “Alright guys, calm down, ‘Footy McFooty Face’ is not going to be our team name. ” FS investors’ Nick Stone explained that LA soccer fans found the San Diego poll “and voted thousands of thousands of times for Footy. ” Donovan said, “We appreciate your voting, even if you’re trolling us. Fortunately for us and San Diego, our fans here are much classier than that, so Footy will unfortunately not be the team name. ” The actual name for the team has not been decided. SoccerCity SD social media coordinator Andy Altman said the top 10   names will be submitted to MLS for approval and “Footy” will be included because it leads the pack. The Washington Post announced the mournful news: “RIP Footy McFooty Face: San Diego soccer team will be called something less awesome. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.  '"}, "time": 1742562215.3728337}