{"duration": 0.04359316825866699, "input_args": {"text": "'The nationwide effort to disrupt town hall meetings of members of Congress continued earlier this week when Rep. Tim Walberg ( ) attempted to conduct a Q and A with his constituents in Jackson, Mich. [Walberg was continually interrupted when he tried to answer questions, with people shouting slogans in unison, many of those reflecting the sentiment expressed on townhallproject. com, a website sponsored by moveon. org, the Center for American Progress, and Indivisible.  The website includes instructions for sign making and provides specific questions that should be asked at the town halls, all of them opposing the policies of President Donald Trump and the   Congress. Many of the people at Walberg’s town hall stood for much of the   meeting, even after they were asked to remain seated, and held up signs that read “24 million,” the Democrats’ talking point on how many people will lose their insurance if the American Health Care Act replaces the Affordable Care Act, or Obamacare. People chanted “single payer,” “tell the truth,” “shame” and “people will die” and asked Walberg questions promoted by the left, including questions about President Donald Trump’s tax returns and whether Walberg supports calling for a special prosecutor to investigate Trump’s alleged ties to the Russians and the firing of James Comey as FBI director. Walberg attempted to answer all of the questions posed, even after it became clear that, as Walberg put it, “community organizers” had infiltrated the town hall. The media covering Walberg’s town hall offered a different perspective, including the Detroit Metro News, which ran a story with the headline “U. S. Rep. Tim Walberg’s town hall meeting in Jackson was a hot mess. ” “This isn’t the first time a Republicans’ town hall meeting did not go smoothly, and it most certainly won’t be the last,” the article said. “At the end of the video you can hear the crowd shouting “shame” over and over and many boos as well,” the article said.  “Walberg did tell MLive that he feels optimistic about the town halls, though, and has done one in every county he represents in 2017. ” VIDEO: 50:30  —   58:00  —   relevant chants, '"}, "time": 1742561785.7289326}