{"duration": 0.04368090629577637, "input_args": {"text": "'Share: \\nTulsi Gabbard for Secretary of State! An example of the need for political realignment \\nBy Dr. Patrick Slattery — On Monday Donald Trump met with Hawaii Congresswoman Tulsi Gabbard. She has been mentioned as a possible Secretary of State, or even Secretary of Defense (she is an Iraq War combat veteran and Major in the Hawaii National Guard). It’s not just that she would be preferable in these jobs to John Bolton, Rudi Giuliani, or Mitt Romney, but is probably the very best candidate from the ranks of the Washington establishment. \\nIn particular, she is unique in being a strong and principled opponent of any intervention in Syria. She wants the United States to stop supporting ISIS and other “rebel” groups and let the Russians, Iranians, and Hezbollah help President Assad defeat the jihadists and end the Syrian Civil War (which is more an armed invasion than a real civil war). This is exactly the right approach. \\nAnd it’s not just that she is on the right side of this issue. It is her signature issue. She is on the Armed Services and Foreign Affairs Committees, so this is what she has spent her time on. \\nIt’s not that she’s perfect. It has been noted that she at the very least pays lip-service to Israel. Everyone on Capital Hill does. Let’s face it, Zionism is the established religion in America, and there IS a religious test for office. But her fault goes further than that. She condemned the government of then-Ukrainian President Victor Yanukovich in February 2014, just as Hillary Clinton’s erstwhile Secretary of State Victoria Nuland was organizing his overthrow. Gabbard, like everyone else in Congress, then supported arming the Jewish-dominated government that Nuland put in place in Kiev. \\nEven so, her Congressional website does not carry any mention of Ukraine since 2014, and her vocal opposition to starting World War III with Russia over Syria seems to indicate that her view towards Russia have become more realistic. This, as has been noted elsewhere, is in line with Trump’s view. \\nBut there is one more significant benefit of appointing Gabbard as Secretary of State. It could help trigger a badly needed realignment of American politics. As people like Ralph Nader have long been telling us, there is no significant difference between Democrats and Republicans. That is because the most divisive issues in politics are not the existential issues that face our society and the world. \\nIf there has been one litmus test in politics during my lifetime it has been abortion. It may engender strong emotions, but it hardly ranks with nuclear war as a threat to humanity. Yet I cannot tell you how many staunchly anti-war people in 2004 voted for pro-war Democrat John Kerry because they were worried about Bush appointing pro-life judges to the Supreme Court. Talk about getting your priorities backwards! \\nThis year, despite senior statesmen like Mikhail Gorbachev warning us that the threat of a nuclear World War III has never been higher, foreign policy was all but absent from the campaign. Only non-mainstream elements like the paleo-conservatives, the Alt-Right, Greens, and stray individuals from the old left like Stephen F. Cohen managed to finally get it injected into the campaign just in the nick of time. In such a close election, one could certainly make the case that this made the difference. \\nAt this point in time, war has to be the top priority. As important as immigration may be, what difference will it make in a post-apocalyptic Mad Max world? (Of course, if we could organize around opposing Jewish power, it would take care of war, but far too few people are awake enough to make this possible. In fact, Israel currently has no role as an organizing feature in America’s political alignment as both parties so unanimously support it blindly.) But as the realignment proceeds along an America First non-interventionist foreign policy, an America First immigration policy is a natural outcome. \\nIf Trump embraces Gabbard and rejects the neocons and their goy toys like Mitt Romney, it would really help clarify the sides in this struggle. Party labels mean nothing. Romney and Ryan and the like already revealed themselves by opposing Trump. There are tons of people outside of the Republican Party who could conceivably rally around Trump’s foreign and other policies, and it is imperative that The Donald make a point of bringing in some of these people into high profile positions while visibly snubbing his true enemies from within the Republican Party.'"}, "time": 1742628560.7383552}