{"duration": 0.0751800537109375, "input_args": {"text": "'Protesters at last Saturday’s March for Science faced a continual downpour of rain when they gathered on the National Mall to protest President Donald Trump and his policies. This Saturday’s People’s Climate March may take place in record temperatures, as forecasters say the mercury could reach the   degree mark. [Actor Leonardo DiCaprio, Virgin Airlines founder Richard Branson, and former vice president Al Gore are expected to attend, according to the Washington Post.  Tomorrow, we’re marching for a better world. March with us and #BeInconvenient https:  .  #ClimateMarch pic. twitter.   —   Al Gore (@algore) April 28, 2017,  The people backing the march range from the Communist Party USA, the Sierra Club, CODEPINK, and the Barack   Organizing for Action. But the man funding many of the organizations listed on the march’s website as members of the steering committee have received millions of dollars from George Soros, the   billionaire who has deep roots in the U. S. environmental movement and other liberal causes. “The ‘People’s Climate March,’ scheduled for the 100th day of Donald Trump’s presidency, claims to be a movement of the people. But is it really?” Newsbusters reported on Friday. “It turns out   of the steering committee organizations have one thing in common  —   donations from George Soros,” Newsbusters reported. “The liberal billionaire gave them more than $36 million combined. ” “Between 2000 and 2014, Soros gave $36, 018, 461 million to 18 of the 55 steering committee members of the People’s Climate March,” Newsbusters reported. “Donations to six of those groups were more $1 million each: Center for Community Change, the NAACP, the Natural Resources Defense Council (NRDC) People’s Action, Public Citizen and Union of Concerned Scientists. ” Newsbusters noted that only three of these six organizations  —   NRDC, Public Citizen and Union of Concerned Scientists  —   have climate as all or part of their mission, calling into question why so many   focused groups are taking part in the march. “The presence of many   related organizations leading the march indicated that this climate march (just like the March for Science and the Women’s March) is not about a single issue, but about attacking the new administration,” Newsbusters reported. The People’s Climate Change website states: Everything we have struggled to move forward in the United States is in peril. Our loved ones feel under siege, and those in power in Washington are advancing a dark and dangerous vision of America that we know is untrue. To change everything, we need everyone. On the 100th Day of the Trump Administration, we will be in the streets of Washington D. C. to show the world and our leaders that we will resist attacks on our people, our communities and our planet. We will come together from across the United States to strengthen our movement. We will demonstrate our power and resistance at the gates of the White House. We will bring our solutions to the climate crisis, the problems that affect our communities and the threats to peace to our leaders in Congress to demand action. Meanwhile, the Washington Post reports, “Environmentalists will once again rally in the nation’s capital this weekend, this time for the People’s Climate March,” noting that the march “will be more political and aimed at specific Trump administration policies. ” The Post said it’s “unclear” just how many people will show up, but “organizers are prepared to accommodate 50, 000 to 100, 000 people. ”'"}, "time": 1742561691.0256798}