{"duration": 0.08870458602905273, "input_args": {"text": "'Laughter saved Linda Ragoo’s face. That is what a doctor told her after she had a stroke in 2003. It happened on a Sunday, at the end of an exhausting weekend of chores, errands and obligations. Ms. Ragoo felt part of her body go numb. “I sat down by the bed and I felt my leg, like it was sleeping,” Ms. Ragoo recalled. “It’s sleeping too long. ” She was able to call one of her sisters, who rushed to Ms. Ragoo’s Brooklyn apartment and found her on the floor, unable to move, the left side of her body paralyzed. While they waited for an ambulance, Ms. Ragoo asked to use the bathroom. Her sister fetched a long stick, presumably to prod her across the floor. Ms. Ragoo cracked up at the absurdity of the moment. “My sister said, ‘Stop this nonsense, stop this nonsense,’” she said. “And I keep laughing. ” She spent the next month in a hospital. Ms. Ragoo’s mobility is still restricted by partial paralysis. But her facial muscles, built up by years of laughter, are as they have always been. Ms. Ragoo, 78, credits her jocular spirit and easygoing sense of humor in part to her upbringing in Trinidad, with its tropical weather,   way of life, and holiday and carnival celebrations. In the 1970s, Ms. Ragoo went to New York in search of an even better life. She settled in Brooklyn and found work as a nurse’s aide. Though hardships and tragedy have marked her life, “I can make a joke out of nothing,” she said. Just recently, she dozed off in her recliner and somehow managed to slide off it, flopping to the floor. For her, it was a rude, yet hilarious, awakening. “I laugh at my own self when I do stupid things,” she said. “I laugh at myself many times. ” Levity not only carried Ms. Ragoo through the setbacks after her stroke, but it also helped her cope with a more painful loss. Her son Satinus, 58, had a heart attack and died in 2014. He was a nurse’s aide, like his mother. “I’m telling you, things can’t put you down,” Ms. Ragoo said of staying positive through trying times. She lives alone in a   apartment in Crown Heights, which is how she likes it. There is plenty of space just for her. And she does not need much of it to flourish. When it was time to get a new mattress, she willingly downgraded from a queen to a full. As much as she relishes independence, health problems drove her to seek outside help. Ms. Ragoo has arthritis, diabetes, high blood pressure and osteoporosis, as well as mobility issues caused by the stroke. Ms. Ragoo sought help from Heights and Hills, which offers support services for older adults, and has a home attendant. Each month, Ms. Ragoo receives $811 from Social Security and $612 from a pension. Because of her tight income, Ms. Ragoo could not afford an   last summer. Usually a fan had been sufficient to keep her cool, but not last year. “When that heat took me, I couldn’t stand it,” she said. She mentioned her concerns to her social worker and made clear the severity of the problem. “I told her, ‘This is not funny. ’” Ms. Ragoo said. Her caseworker reached out to FPWA, formerly the Federation of Protestant Welfare Agencies, one of the eight organizations supported by The New York Times Neediest Cases Fund, and applied for a $600 grant in Neediest funds, which allowed Ms. Ragoo to buy an  . Ms. Ragoo fondly recalls more youthful pleasures, like traveling, especially cruises, and taking trips to the casino. Ms. Ragoo has not done either in some time. But it is hard to keep her from a dance floor pulsating with salsa or calypso. Her coordination and energy are not what they once were, but she still has rhythm. “I dance with my cane,” she said. “I hold my cane and I move from side to side. Because they say if you don’t use it, you lose it. ” But she is quick to joke with people about her age. On a recent December afternoon, Ms. Ragoo declared she was just 16, despite the cane clutched to her side and dark glasses shielding her eyes after cataract surgery. “It’s the best therapy, to laugh,” she said. “You have to keep on laughing. ”'"}, "time": 1742561665.641921}