{"duration": 0.03623223304748535, "input_args": {"text": "'Few really believe former Secretary of State Hillary Clinton has changed her mind about the virtues of free trade or the Trans-Pacific Partnership (TPP). Part of the reason is because, despite Clinton’s rhetoric, some of her closest allies say she is firmly in the corporate camp and a true free trader who supports NAFTA and TPP.\\nIn 2012, Clinton called TPP “ the gold standard in trade agreements to open free, transparent, fair trade, the kind of environment that has the rule of law and a level playing field.”\\nOn October 8, 2015, Clinton reversed her position and said she no longer supported TPP.\\nClinton and her staff pushed back on claims that her reversal was political, but a recently released email from Wikileaks shows Clinton Campaign Manager Robby Mook uncertain about Clinton’s position as recently as March 1, 2015, not even a year before the reversal.\\nWhen informed on February 28 by White House Director of the Office of Political Strategy and Outreach David Simas that a bipartisan letter was being drafted by former cabinet officials in support of free trade, Mook responded:\\nI can’t recall where we landed exactly on trade. Is she going to say she supports it? Regardless of her position, signing a letter feels like poking the bear with labor to me.\\nEven Clinton’s staff didn’t now what her position was on trade in 2015? How could someone who had been in public life so long not know their own views?\\nThe answer, of course, is that Clinton was likely waiting to see where the polling came out on TPP—a deal that largely resembles the one she helped negotiate as secretary of state. TPP does not poll well, especially among progressive Democrats, whom she was going to have to deal with in the then-future presidential primaries.\\nThe problem for those opposing TPP is not Clinton’s current position, it is whether, as her friends say, she is going to reverse herself again if she becomes president and sign TPP into law.\\nThe post TPP: Leaked Emails Show Clinton Staff Unsure of Trade Positions In 2015 appeared first on Shadowproof .\\n'"}, "time": 1742564410.7148583}