{"duration": 0.1578996181488037, "input_args": {"text": "'MELBOURNE, Australia  —   The sibling rivalry, at least on the tennis tour, started right here at the Australian Open for the Williams sisters. It was 1998, and older sister Venus beat younger sister Serena,   (4)   in a   match that  —   as intrusive as it felt to watch  —   surely drew more attention than any   match in history between a pair of Australian Open debutantes. The fascination in their dynamic and their futures was there from the start in Melbourne Park, known then as Flinders Park when it had only one stadium with a retractable roof instead of three. A picture of Venus consoling Serena after the match was on the front page of The New York Times. Though it would be tempting to label their Australian Open final on Saturday as a   moment and to speculate that it might be their last meeting at this late a stage of a Grand Slam tournament, it seems best to resist the temptation. The Williams sisters have taught us a lot about the limits of conventional tennis wisdom through the years. And so, even if 19 years have passed and Serena is now 35 and Venus 36, it is wise to avoid fencing them in again after they have run roughshod over so many other preconceptions. “I watched Venus today celebrating after she won the semifinal like she was a    girl, and it made you want to cry for joy just watching her,” said Marion Bartoli, a former Wimbledon champion. “Such a powerful image, and it makes you think about all those questions she was getting: ‘When are you retiring? Have you thought about retiring? How much longer?’ “You must let the champions decide when the right moment comes. ” The Williamses are both great champions, even if Serena is clearly the greater player with her 22 Grand Slam singles titles and her long run at No. 1, a spot she can reclaim from Angelique Kerber with a win Saturday. Serena has been the most prolific Grand Slam winner after age 30 in tennis history, and she is back in rare form again after another extended break at the end of 2016. She disconnected completely from the game and physical training initially and had to push hard to get back in shape in November and December. It worked. She has not dropped a set here despite a challenging draw, nor has she even been pushed to a tiebreaker. Newly engaged to the American technology entrepreneur Alexis Ohanian, who has watched her matches from the players box, and seemingly refreshed, Serena deserves to be the favorite to win her 23rd major singles title and break her tie with Steffi Graf for the highest total in the Open era. In this tournament, Serena has beaten two former members of the top 10  —   Belinda Bencic and Lucie Safarova  —   and one current member, the   No. 9 seed Johanna Konta. Venus’s draw has been soft by comparison, devoid of top 10 players  —   past or present  —   and including only one seeded player: No. 24 Anastasia Pavlyuchenkova. On Thursday, she had to scrap and come back to win,   (3)     against the powerful unseeded American CoCo Vandeweghe, while Serena cruised past the unseeded Croat Mirjana      . Serena, who already holds a   edge over her sister, could be the fresher player, too, on Saturday. But the psychology remains complex and the fallout unpredictable, even after all these years. “When I’m playing on the court with her, I think I’m playing the best competitor in the game,” Venus said. “I don’t think I’m chump change either, you know. I can compete against any odds. No matter what, I can get out there, and I compete. ” They have not played since the 2015 United States Open, when Serena won,       in a quarterfinal in which Venus attacked, often successfully, from the start but had no answer in the end for Serena’s ultimate weapon: her first serve. It was an intense match in which the big crowd in Arthur Ashe Stadium seemed more reflective than fully engaged one in which Serena’s celebration was understandably subdued with her sister across the net, even if their matches are no longer the awkward, constricted affairs of their early years. Saturday’s final in Melbourne could be intriguing on multiple levels, in part because of the Australian public. Venus is viewed here, as elsewhere, as a sympathetic figure: the older sister who has handled the younger’s greater tennis success unselfishly and with dignity. And though both sisters have had to cope with major health problems and family tragedy, with the murder of their half sister Yetunde Price in 2003, Venus is the one whose tennis fortunes dipped more dramatically. A   Grand Slam singles champion and a former No. 1, she did not advance past the third round in any major event in singles from late 2011 to the end of the 2014 season. She was a major star reduced to a minor role, largely because of an autoimmune disorder  —   Sjogren’s syndrome, diagnosed in 2011  —   that sapped her strength and endurance. When Russian hackers breached the World   Agency’s databases last fall, it was revealed that Venus had needed 13   exemptions for drugs in recent years. The retirement questions to which Bartoli referred started during that period. But Venus’s ability to cope with her condition has improved, and after rejoining the top 10 in 2015, she reached the semifinals at Wimbledon last year and then the final here. “She never even thought of the word retire,” said David Witt, her coach and hitting partner of 10 years. “I just think when she got diagnosed, it was a step back, a shock. She’s learned a lot about how to deal with it and her body, how to eat, how to manage it. “There are days she can’t work as hard as she wants to work. Some days it’s maybe not smart to do it because it will then hurt you for two or three more days. Where she is now in her career, she has to listen to her body, and I don’t think she really needs to go out and hit balls for two hours. ” Witt said there were no more    sessions in the   or in time off tour: just one session in the morning and then gym work, primarily sprints, core strengthening and flexibility. “It took her years and years to realize that stretching is important and can keep you healthier,” he said. “The more flexible you are, you’re not going to strain or pull anything. I’ve been with her 10 years, and I think it took seven years to get her to stretch. She likes to do a lot of dancing, and that consists of a lot of stretching and being flexible, so I think that’s helped. ” Her dance skills were in evidence Thursday as she pirouetted after beating Vandeweghe, but what will linger longest in memory were her screams of delight at having conquered an inspired young opponent in a semifinal. It was a moment she described as “just joy. ” “You could really see the happiness on her face,” Serena said. “I’ve been there when she was down and out of it, and back and in it. I’ve been there for all those moments, so I just really was oh so happy. ” As visceral as her reaction on court was, she was nothing but considered in the interview room. “I think why people love sport so much is because you see everything in a line,” Venus said. “In that moment, there is no  . There’s no retake. There is no  . It’s triumph and disaster witnessed in real time. “This is why people live and die for sport, because you can’t fake it. You can’t. It’s either you do it or you don’t. People relate to the champion. They also relate to the person who didn’t win, because we all have those moments in our life. ” This will be Venus’s first major singles final since she lost to Serena in straight sets in the 2009 Wimbledon final, and her first match against Serena in Melbourne since the 2003 final when Serena won her fourth Grand Slam title in a row, having defeated Venus in all four finals. “It’s just amazing,” said Rennae Stubbs, the Australian star who first met the sisters before they joined the tour. “They came onto the scene at age 15 and 16 with the beads and the hair and the exuberance, and here they are: mature, remarkable young women at 35 and 36. No matter what anyone says to me, their story from start to finish is the greatest sports story ever. ” And if the Williamses have taught us anything along the way, it is that the story is not finished until they say it is.'"}, "time": 1742561944.2230978}