{"duration": 0.03190755844116211, "input_args": {"text": "'Shockwaves are reverberating around the Kremlin today as word spreads regarding an extraordinary meeting called by Vladimir Putin yesterday where, according to sources, the Russian president said that “95% of the world’s ruling class are not even human,” but are “cold-blooded hybrids” who are “members of an ancient cult.” \\n\\n\\nDid Putin just out the world’s political and financial elite as cold-blooded hybrid human reptilians? Did he really just go there?\\n\\nSpeaking at a behind closed doors forum for the highest echelons of government and staff in his home city of St. Petersburg, Putin responded to questions about the Panama Papers leak by pointing out who was behind the plot: the U.S. government, their spy agencies, and George Soros’s OCCRP.\\n\\nPutin slammed his fist on the table and exclaimed, “George Soros, you sly dragon, this is war,” according to sources close to the President. Putin then vowed to ramp up sanctions against Soros’s Open Society even further.\\n\\nWhen questioned by a top aide as to what he meant by “dragon” (an unusual word in Russian), Putin sighed heavily and fixed the assembled group with his trademark stare before explaining that all is not what it seems in regards to how the world is run.\\n\\nResisting gentle attempts by close aides to stop the President ‘going there,’ Putin said that the evidence was everywhere, and that he personally had intimate knowledge of their dealings. He said that he was not one of them, but they are afraid of him and have attempted to lure him into their “ancient Babylonian cult.” \\n\\n“The evidence, ancient and modern, is enormous,” he said. \\n\\nPutin said that mankind has been manipulated to become “unconscious” through the use of programming by media and politics, the perfect example of which was the recent Panama Papers leak. The world’s ruling class have tyrannical control over our food, water, and air supply, and they are actively dumbing down the masses.\\n\\nYour News Wire  \\nSOURCE '"}, "time": 1742628593.2464502}