{"duration": 0.1312110424041748, "input_args": {"text": "'Johnny Nicholson, whose tiny Midtown Manhattan restaurant, the Café Nicholson, served as a gathering place for the artists and celebrities known as “the New Bohemians” in the 1950s and ’60s, died on Thursday at his home in Manhattan. He was 99. His death was confirmed by Phyllis Eckhaus, a friend and executor. Mr. Nicholson, an antiques dealer and interior designer, opened the first Café Nicholson in 1948 on 58th Street near Third Avenue, near where he and his romantic partner, the photographer Karl Bissinger, ran an antiques store. At the time, it was a neighborhood of cheap brownstones and photographers’ studios. Inspired by the Caffè Greco in Rome, he planned to offer coffee and pastries, but the chef Edna Lewis, a   cook from Virginia and a close friend, convinced him that a   restaurant was a better idea. He offered her a place behind the stove and a   partnership in the business, giving her her first exposure in New York. She would go on to write cookbooks that made her one of America’s foremost exponents of traditional Southern cuisine. Mr. Nicholson decorated the interior in a spirit of mad eclecticism, combining   chic with florid romanticism, a look he once described as “fin de siècle Caribbean of Cuba style. ” “Oh, it was fun,” Ms. Lewis told Vanity Fair in 1999. “We shopped on the Bowery, going into basement after basement. Before we opened we put sheets over all the walls and called them curtains. ” Ms. Lewis devised a simple, unchanging menu, with dishes like roast chicken with herbs, and a chocolate soufflé described by Clementine Paddleford in The New York Herald Tribune as “light as a dandelion seed in a high wind. ” A parrot named Lolita screamed “Hello” and “I’m a parrot. ” The combination of fantasy setting and superb food did the trick. In no time the restaurant became “a canteen for the creative class,” the food writer John T. Edge wrote in The Oxford American in 2013  —   a magnet for artists, writers, actors, photographers, designers and fashion editors. In a 1949 photograph accompanying a Flair magazine article titled “The New Bohemians,” Mr. Bissinger captured the moment and the tone. It showed, seated at a table in the restaurant’s back garden: Gore Vidal, Tennessee Williams, the Balanchine ballerina Tanaquil Le Clercq, the novelist Donald Windham and the artist Buffie Johnson. They were served by the waitress Virginia Reed. “Until Café Nicholson, there were only two kinds of restaurants in New York: checked tablecloth places serving spaghetti and meatballs or   places like Le Pavillon,” the Vogue and Harper’s Bazaar editor Babs Simpson told Vanity Fair in 1999. “In a way, Johnny created the first theme park. ” Mr. Nicholson was born John Bulica on Sept. 5, 1916, in St. Louis to immigrant parents from Romania. He later adopted the surname of a favorite uncle. His father, Nicholas, ran a small restaurant, the Cafe Lafayette. His mother, the former Constance Cordista, was a homemaker. He had a troubled childhood. A constant truant, he dropped out of high school and went to work as an errand boy at the Stix, Baer  Fuller department store, picking up decorating knowledge that he applied when he opened his own design and furniture store. From time to time he visited relatives in Manhattan, where he worked during Christmastime at Lord  Taylor. He was drafted in 1941 but was exempted from military service when an Army psychiatrist recognized him as the chronic truant he had treated at a children’s psychiatric hospital. Mr. Nicholson moved to New York, hoping to break into fashion design. After a brief period as a cafeteria busboy, he was hired by Lord  Taylor as a window dresser. The antiques store, which did most of its business renting props to photographers, served as a useful training ground for decorating the cafe. Mr. Nicholson was a born scavenger, ferreting out unusual items in unusual places, like the marble countertop he bought from a sanitation worker off the truck, or the marble goddesses he chanced upon in a warehouse in Puerto Rico. The mad surroundings, the intimate scale, and forever and always, the roast chicken, attracted a parade of notables. The gathering immortalized by Mr. Bissinger  —   “pretty good for a summer’s day in the garden of a New York City brownstone,” Mr. Vidal told Smithsonian magazine in 2007  —   was not unusual. Over the years, in its several locations, the Café Nicholson hosted the cartoonist Charles Addams, and, on one enchanted evening, Gloria Vanderbilt with Frank Sinatra. For a time, Mr. Nicholson arranged for guests with theater tickets to be chauffeured in a   Silver Cloud. By the end of the 1970s, Mr. Nicholson’s attention had waned. He began traveling frequently, closing the restaurant for months at a time. By this time it had been on East 58th Street for about a decade, in the former sculpture studio of Jo Davidson, just off the entry ramp to the upper level of the Queensboro Bridge. The cafe took a bow in the Woody Allen film “Bullets Over Broadway” in 1994. But five years later, Mr. Nicholson, who leaves no immediate survivors, closed it, putting the final punctuation mark on a vanished age. “You went to my restaurant because it was extraordinary, beautiful, with very good food and a very different experience,” Mr. Nicholson said in 2013 in “The Luminous Years: Karl Bissinger and the New Bohemians,” an    documentary by Catherine Johnson. “You went there to be with your friends. ”'"}, "time": 1742563958.734268}