{"duration": 0.03182840347290039, "input_args": {"text": "'\\nA NEW SHOCKING VIDEO is now leaving everyone stunned. Watch and see for yourself! Barack Obama is now openly calling on illegal aliens to vote in Tuesday’s election so they can help Hillary Clinton.\\nNo one in the media is making a big scandal of out this! Let’s say the vast majority of those illegal immigrants would vote for Trump, would the media create a big scandal out of it then? Of course they would! What’s even more shocking is that this interview was conducted on November 4th, 2 days ago so we only learned about it now. The media is trying to hide this damning interview where Obama is openly calling on people to break the law!\\nObama said when you vote you become a citizen! What the hell is wrong this guy?\\nReporter: Many dreamers and undocumented are scared to vote, can they vote?\\nObama: When you vote you become a citizen and no one will investigate you!\\nImagine yourself going to Japan or South Africa to vote in their elections, what the hell is this a banana republic?\\nIt is over folks this just shows how desperate the establishment is. Its either Trump or revolution. The American people can not accept the results of a stolen election where millions of illegals were allowed to vote.\\nThis whole lawless administration is lies at every turn, Obamacare, Benghazi, Hillary’s private server and emails and now they are calling on illegal aliens to vote. This is the last chance the American people have to save their country and frankly the entire world. If Hillary wins now, Republicans would never stand a chance because she will bring tens of millions of more illegals who would always vote for Democrats.\\nObama even has a website for illegals where he is teaching them how to vote: iwillvote.com\\nGina Rodriguez asked Obama: \\n“Many of the millennials, dreamers, undocumented, uhhh ‘citizens’ and I call them ‘citizens’ cause they contribute to this country are fearful of voting, so if I vote, will immigration know where I live, will they come for my family and deport us?”\\nBarack Obama then answered: \\n“Not true! And the reason is, first of all when you vote, you are a citizen yourself and there is not a situation where the voting rolls are somehow transferred over and people start investigating, etc. The sanctity of the vote is strictly confidential in terms of who you voted for. If you have a family member who maybe is undocumented, then you have an even greater reason to vote.”\\nNeil Cavuto of Fox Business was first to bring this video to the public on a major TV station, so we are eternally grateful about it because without him we wouldn’t have known that the Obama regime is planning to allow and not go after illegals voting in these elections!\\nThere is no way in hell they can freaking spin this one out \\n'"}, "time": 1742628538.6081002}