{"duration": 0.09301471710205078, "input_args": {"text": "\"The Art of the Deal: Trump's phone calls provoke hysteria in Kiev and panic in Brussels November 16, 2016 - Fort Russ - Ruslan Ostashko, PolitRussia - translated by J. Arnoldski - Until recently it was believed that Donald Trump’s main media weapon is his Twitter account, through which the president-elect of the US fights his political opponents, beats the media, and “trolls” foreign politicians. But this was true only until Trump won the elections. Since his victory, the American billionaire now uses his phone as his main weapon of mass (information) destruction. For example, just recently we learned it was enough for Trump to simply talk with Putin on the phone to drive all top European officials to hysterics and panic. Only one conversation, and the British media is already talking about nervous breakdowns among Brussels politicians who simply don’t understand how to live in this terrifying new reality in which the US president-elect easily finds opportunities to reach understanding with Putin. This means that many European politicians who built their careers on selling Russophobia might be left without a job, career, and money. The Financial Times writes that British diplomats are preparing for a “diplomatic crisis” caused by a possible rapprochement between the US and Russia. Between the lines, it can be read that London has simply no ready-made solutions for this problem. The reactions of American and European media are suddenly creating some kind of aura of a miracle around Trump and Putin’s conversation, or a universal catastrophe from the perspective of Clinton’s supporters and ISIS fans. For example, the popular American newspaper USA Today has released a thoughtful article entitled “After Trump chat, Putin's airstrikes pound Syria” which hints that it is Trump’s fault that Russian aircraft have stepped up bombardments against the Syrian terrorists so near and dear to the heart of every true American liberal. It seems like American journalists are telling us that “this wouldn’t happen under Clinton” which, of course, is a shameless lie. Everything would be the same, the only difference being that Syrian militants would die from Russian bombs only after receiving their paychecks from the CIA or Pentagon. And now they are completely terrified, as the Americans aren't paying out and the Russians are bombing them. Let them at least feel comforted by the fact that they have sincere sympathy from Clinton’s pool of American journalists. In fairness, it should be noted that Trump’s phone conversations are provoking not only unhappiness, but are also a real treat. Kiev’s political club is now filled with euphoria over the fact that Poroshenko managed to get through to talk to the US president-elect. This really is a great achievement. That Poroshenko didn’t get told off after what official Kiev did during the American election campaigns is a real success. It is a pity that the only description of the conversation is on Poroshenko’s website. Trump’s official website doesn’t say a word about it. Trump’s website features the news of his conversation with Putin, while nothing is said of the chat with Poroshenko. Nothing at all. Poroshenko’s website doesn’t deserve much confidence as a source. After all, Poroshenko has already been caught in prank conversations, but even if we can assume that the two really did talk, then Kiev’s euphoria is still not quite logical. Sure, official Ukrainian propaganda says that the two presidents agreed to meet, but no specifics in terms of dates were given. Does anyone really believe that Poroshenko is such a genius in psychological maneuvers and such a titan in political negotiations that he will be capable of changing the opinion of the US president-elect on Crimea, Ukraine, and the need to cooperate with Russia? It will be interesting to see how this looks. On the one hand, Trump is a billionaire, businessman, and a man with a very difficult character. On the other hand, so is Poroshenko, who quickly needs to convince Trump to pour money into the geopolitical project known as “Ukraine.” It’s a pity that they won’t sell tickets to see this show. I would pay to see such with my own eyes even though I think that the conversation will not be very long. Most likely, it will end with Trump’s famous catchphrase: “You’re fired!” Bloomberg has published an article headlined “Trump, Putin and Sluggish Reforms Push Ukraine Toward Russia.” In this piece, American journalists gathered the opinions of Western politicians and experts on Ukraine’s future, among which it is difficult to find anything optimistic. Overall, the interviewed experts agree that Ukraine is out of luck. For example, the ardent Russophobe and Vladimir Putin critic Ian Bremmer articulated his vision of Ukraine’s future in the following words: “Trump will want to put points on the board and I think it is highly likely the U.S. under Trump will move quickly to re-establish the relationship with Russia, on Syria in particular. That clearly throws Ukraine under a bus.” This time, I don’t even want to argue with this American political scientist. Only one thing interests me: will Trump put all of Ukraine up for sale or only parts of it? Follow us on Facebook!\""}, "time": 1742563695.149309}