{"duration": 0.04470658302307129, "input_args": {"text": "'November 17, 2016 - Fort Russ -  Antifashist - translated by J. Arnoldski - \\n\\n\\nThe international community could recognize the international legal status of the Donetsk People’s Republic if Kiev finally discredits itself in the negotiation process on settling the conflict in Donbass. This was stated by the acting foreign minister of the DPR and representative of the republic to the political subgroup of the Contact Group, Natalya Nikonorova. \\nNikoronova is sure that sooner or later the conditions will be created for the people’s republics to be recognized as participants in international relations with full rights. \\n“If we consider the precedent set by Kosovo, which was immediately recognized by several member states of the UN, then the DPR could became a full subject of international relations after a very short period of time given favorable geopolitical factors,” Nikonorova stated. \\nAccording to her, these conditions will be met if Kiev “finally discredits itself in the negotiation process” on resolving the conflict in Donbass. \\nAt the present moment, the DPR and LPR are not recognized by a single UN member state. The authorities of the people’s republics of Donetsk and Lugansk unilaterally declared independence from Ukraine on May 12th and April 28th, 2014 respectively. The independence of the DPR and LPR is recognized only by South Ossetia, which does not have the status of a recognized state and is not part of the UN. \\nFor a long time already, the settlement of the situation in Donbass has been complicated largely by Kiev. Even according to Ukraine’s representative to the humanitarian subgroup of the Contact Group, Viktor Medvedchuk, Kiev is purposefully delaying the realization of the Minsk Agreements.  \\n\\nRecently, Ukrainian Foreign Minister Pavel Klimkin bragged that Kiev is discussing the formulation of a “road map” for implementing the Minsk Agreements only with Berlin and Paris, but Moscow is equally a guarantor of the document.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742564423.4240413}