{"duration": 0.02223491668701172, "input_args": {"text": "'Progressive Nomad: Bernie Sanders Pens CRUCIAL Letter To The President (IMAGES) By Stephanie Kuklish on October 29, 2016 Subscribe \\nOn the heels of Thursday’s brutal attack on Native Americans peacefully protesting the Dakota Access Pipeline by local and state police officers, Senator Bernie Sanders has written an open letter to President Obama asking for him to stand up against this atrocity. \\nIn a message posted on Sander’s official U.S. Senate website, he asked for President Obama to halt construction of the pipeline until cultural and environmental reviews were done by trusted sources. Sanders wrote : “It is deeply distressing to me that the federal government is putting the profits of the oil industry ahead of the treaty and sovereign rights of Native American communities. Mr. President, you took a bold and principled stand against the Keystone pipeline – I ask you to take a similar stand against the Dakota Access Pipeline. To my mind, the [U.S. Army Corps of Engineers] should have never approved this project on an expedited process in the first place.” \\nSanders continued the letter by urging the President to send non-partial monitors to the camp in order to ensure that the water protector’s civil rights were being protected. He then reminded President Obama just how dangerous this pipeline, and others like it, can be for the environment. Sanders stated : “According to one report, burning the oil transported through the pipeline would produce carbon emissions equivalent to 21 million cars or 30 coal plants. If we have any hope of avoiding the worst consequences of climate change, we should not be building new oil pipelines that lock us into burning fossil fuels for generations to come.” \\nIt has been incredibly difficult to get media coverage on this event, and even when there is; everyone seems to turn a blind eye to what is going on in North Dakota. Police are once again lying about the protestors and taking very violent and forceful tactics against them, even though they are not armed and are showing little to no signs of violent actions. \\nAt some point this has got to end and either the President can make a stand or he may be addressing the nation apologizing for wasteful human deaths at the hands of our own police force.'"}, "time": 1742562102.750922}