{"duration": 0.06475353240966797, "input_args": {"text": "'They have to flee the poverty, goyim. Being poor is an international war crime. \\nThe game, faggots: you just lost it. \\nPolitico : \\nTheo Francken, Belgiumâ\\x80\\x99s secretary of state for migration, said he will appeal a court ruling that the country must grant a visa to a Syrian family wanting to apply for asylum in Belgium, according to local broadcaster VRT. \\nThe Belgian Court of First Instance ruled the state must pay a penalty of â\\x82Ź4,000 for each day the visa is delayed. \\nThe Syrian family of four is seeking an official visa to come to Belgium without traveling by sea. They claim they will apply for asylum as soon as they are in the country. \\nSecretary of State Theo Francken called the decision â\\x80\\x9cinsaneâ\\x80\\x9d and said he will appeal. Currently, people can only apply for asylum in a country if they are actually on its territory. \\nâ\\x80\\x9cIt will open the door to thousands of people,â\\x80\\x9d Francken said. â\\x80\\x9cIf we allow people to come to Belgium with a visa to apply for asylum, the whole system will collapse.â\\x80\\x9d \\nroflmao and he’ll be called a racist for this. Theo Francken be all like “damn, dawg.” \\nAnd I don’t think an EU court could possibly disagree with this decision. \\nBecause of course, if unlimited millions of people are allowed to take boats into Europe, why should they not be allowed to fly-in on airplanes? \\nNo idea why Francken says “thousands” though. This is several billion people that it opens the door to. The EU has treated as valid asylum claims from every country in Africa, the Middle East and West Asia. Of course, not all of them are eventually approved, but no one is ever deported (except Albanians lel). They can just keep appealing the decision, and even when the appeals fail and they’re issued a deportation order, they are still allowed to loaf around on welfare because there is no mechanism to go find them, arrest them, and ship them out. \\nSo basically, anyone from any African or Moslem country who can afford a plane ticket will be issued an EU visa which will effectively allow them to come live in Europe on welfare forever. \\nIt is obviously insane, but it was insane for Merkel to invite these billions to take boats to Greece and walk across Europe. Everything that happens anymore is insane, so “this is insane” is no longer a valid argument for anything. The only accepted argument is “this is racist”– there is no accepted counterargument. \\nSo basically: it’s time to spread your legs wider, Europe, because this gang-bang just got a lot more crowded. Note that that metaphor applies in a literal sense to your daughters.'"}, "time": 1742563428.8414478}