{"duration": 0.07389283180236816, "input_args": {"text": "'In a rare interview, Red Bull boss and Austria’s richest man Dietrich Mateschitz has slammed mass migration and political correctness, warning they threaten to destroy Europe’s true cultural diversity. [Speaking to Kleine Zeitung, the Formula 1 investor called the decision of key politicians to open the borders  —   which resulted in Europe’s migration crisis  —   “unpardonable” noting that “if a company were to make mistakes on the same scale, it would have gone broke”. Highlighting the “hypocrisies” of what he called the “refugees welcome brigade” with regards to migration, Mateschitz said: “I am talking about the fact that none of the people shouting ‘refugees welcome’ or [Chancellor Angela Merkel’s famous phrase] ‘we can do it’ were preparing their own guest rooms or tents in their gardens to accommodate half a dozen migrants. “Even then it was clear to everyone that most of the people [arriving in the continent] did not correspond to the definition of the refugee. In any case, not the Geneva Convention”. In the interview, Mateschitz took a stand against the “destabilisation of Europe” which he said threatens the “uniqueness of [the continent’s] diversity and individuality with its different cultures and languages”. “I hope I’m not the only one who’s worried that one of the highest officials in Brussels said that countries which aren’t multicultural should be wiped off the map” Mateschitz told the newspaper, possibly alluding to comments made by European Commission   Frans Timmermans in 2015. “Any society, anywhere in the world, will be diverse in the future  —   that’s the future of the world,” Timmermans said, demanding that Eastern and Central EU nations undergo similar demographic transitions to Western Europe. Of political correctness, Mateschitz said: “It seems that no one dares to tell the truth, even if everyone knows what the truth is. ”“The elites want citizens to be frightened, and easily manipulated,” he added.  The Red Bull founder said he sees numerous problems plaguing the European Union (EU) the architects of whom he fingered as belonging to a “  intellectual elite” with nothing to contribute to the continent. “Policies which are steeped in political correctness have been imposed in the name of a     intellectual elite who have nothing to contribute to our country neither economically nor culturally despite their best intentions,” he said. Mateschitz also poured scorn on how Russia has been framed as the EU’s nemesis by large parts of the media and Western liberal establishment, telling Kleine Zeitung: “I do not need anyone to tell me who my enemies are. ”Criticising attempts to destroy the former Soviet superpower through economic sanctions, the Formula 1 investor pointed out that “for Europe as a whole [this policy] results in losing billions of Euros”. Challenged by the Austrian newspaper with the assertion that he too is an ‘elite’ Mateschitz hit back, describing himself as a “humanist” but “someone who basically opposes any dogma”. Speaking about banning the Islamic veil, a talking point in Austria currently, the Red Bull boss said: “I can’t bring myself to think that this is really a matter of any importance   …     It’s silly to make a political issue out of something like this when there are far more pressing matters. ”'"}, "time": 1742563676.5779269}