{"duration": 0.131697416305542, "input_args": {"text": "'“Café Society,” Woody Allen’s new movie, comes wrapped in a double layer of nostalgia. Set in the 1930s, partly in Los Angeles, its script compulsively mentions Hollywood stars of the era. Joan Blondell! Robert Taylor! Barbara Stanwyck! Cagney and Crawford! Astaire and Rogers! Their names ring out like answers to trivia questions nobody had thought to ask. At a recent New York critics’ screening, one fellow a few rows behind me chuckled at every name. I don’t think because the allusions were especially funny  —   the sentence “Adolphe Menjou is threatening to walk off the set” is not exactly a   even in context  —   but because they signified a cultural awareness that the laugher in the dark wanted the rest of us to know he shared. And also perhaps because the dropped names stood in for jokes that the modern audience is too ignorant to get and that Mr. Allen has grown too lazy to make. He can gaze back fondly at the   golden age of   popular culture, and the rest of us can wistfully recall a time when he was able to spin those memories into better films than this one. There’s no point in growing  . “Café Society” is not “Radio Days” or “Bullets Over Broadway. ” We can live with that. I’m happy to report that it’s not “The Curse of the Jade Scorpion” or “Magic in the Moonlight,” either. Which is to say that it’s neither another example of bad, late Woody Allen nor much in the way of a return to form. It is, overall, an amusing little picture, with some inspired moments and some sour notes, a handful of interesting performances and the hint, now and then, of an idea. Like most of Mr. Allen’s recent work, this movie takes place within the hermetically enclosed universe of its maker’s   preoccupations. Rather than find fresh themes or problems, he likes to rearrange the old ones into a newish pattern, emphasizing some elements and letting others drift into the background. Here the dominant conceit is Mr. Allen’s   ambivalence about California and the industry that has often seemed ambivalent about him. He loves movies, but Hollywood, with its shallowness and gossip, has always repelled him. But with the help of his gifted collaborators, the production designer Santo Loquasto and the cinematographer Vittorio Storaro, he bathes “the film colony” in golden light and swathes its denizens in lovely period clothes. He sends an ambitious Bronx boy, Bobby Dorfman (Jesse Eisenberg) out West to seek his fortune. At first   by his Uncle Phil (Steve Carell) a powerful agent, Bobby is eventually taken under Phil’s wing and plunged into a swirl of parties and power lunches. He’s suitably intoxicated by his new surroundings. “I’ve never mixed Champagne with bagels and lox,” he says. “Welcome to Hollywood,” someone replies. That’s not a bad line, and there are some other pretty good ones sprinkled throughout the sprawling script. Bobby’s bickering parents, played by Jeannie Berlin and Ken Stott, supply a few   laughs, as well as the requisite touch of metaphysical fatalism. (“I accept death, but under protest,” Dad says. “Protest to who?” Mom responds. Also not a bad line.) The ensemble is larger and the story looser than in Mr. Allen’s last few movies, making room for Corey Stoll’s relaxed turn as Bobby’s charismatic gangster brother and Parker Posey and Paul Schneider’s intriguing double act as a cynical and apparently happily married pair of bicoastal sophisticates. The axis on which everything turns is an   love triangle that includes, of course, the passion of an older man for a younger woman. It turns out that Bobby and Phil are both in love with a transplanted Nebraskan called Vonnie (short for Veronica) who is Phil’s secretary. Kristen Stewart’s performance in the role, which blends gravity and lightness, glamour and its opposite, is certainly the best part of “Café Society,” but it also exposes just how thin and tired the rest of the movie is. Mr. Allen’s literal voice, which supplies narration, sounds unusually sluggish and weary. The same is true of his voice as a writer and director. For every snappy scene or exchange there are three or four that feel baggy and  . We are treated to one survey of the clientele at the swanky Manhattan nightclub that is Bobby’s   professional perch and then, a while later, to another. We wander into jazz clubs and dining rooms and seem unsure of why we’ve come. Blake Lively, wandering into the movie’s second half as a second Veronica, seems to feel the same way. The movie seems much longer than its 96 minutes. Every once in a while we hear or see something that makes us cringe a little: a harsh, unfunny encounter between Bobby and a prostitute shortly after his arrival in Los Angeles an anecdote about Errol Flynn’s sexual interest in underage girls. It’s hard to say if Mr. Allen is testing the audience’s tolerance or trolling our sensitivities, or for that matter if he’s just blithely carrying on as he always has, oblivious to changing mores or the vicissitudes of his own reputation. It doesn’t really matter because “Café Society” ultimately poses no interesting questions about its maker or its characters. The movie most closely resembles the kind of Hollywood product for which its deepest nostalgia is reserved. It’s a   throwaway, a charming bit of trivia, the punch line to a   joke. “Café Society” is rated   (Parents strongly cautioned). Surprisingly bloody murders and surprisingly bloodless romance. Running time: 1 hour 36 minutes. '"}, "time": 1742561941.1843288}