{"duration": 0.0467066764831543, "input_args": {"text": "'Elections 2016 , U.S. \\nApproximately two million bikers are planning to arrive in Washington, D.C. by January 20, 2017. The patriotic bikers are volunteering to attend President-Elect Donald Trump’s inauguration to enhance safety during the event. \\nThe bikers have stated they want to thwart efforts by “libtards” to ruin the Donald Trump’s inauguration , Right Alerts Polls reports. Do you support their efforts to prevent the ceremony from erupting into chaos? \\nAs previously reported, liberal activists have launched the “DisruptJ20” to hamper Trump’s swearing in by virtually any means possible. The Bikers for Trump Guardians of Our Republic group is willing to step in and offer protection to the millions of proud Americans planning to come to the capital to watch the 45th president of the United States be sworn into office. \\n“These libtards need to be shut the hell up. This is not only a biker event, but it is a Trump supporters event. We are many and varied, but we unite as one,” a statement from the bikers boldly states. \\n“Christian, Veterans, Bikers, Truckers, Steelworkers, Coal worker’s, Preachers, Fast food workers, all Colors on [sic] the human race,” began the notice from the bikers, who clearly wanted to be inclusive to all. \\n“If you are a working class American and you support Mr. President Donald Trump, then we would love to see you there. Our main objective is to show our love for our new president and unite as one in a collective effort in Solidarity Brotherhood and Unity. God Bless America,” the notice from the bikers continued. \\nMultiple anti-Trump protesters and related groups are planning to converge on the capital and coordinate their efforts to disrupt the swearing in ceremony. Approximately 30,000 protesters are expected to be in town on inauguration day. \\nPlans for the security and public safety efforts by the Bikers 4 Trump group are still evolving, according to the group’s Facebook page. The host of the event is the “2 Million Bikers 2 DC,” group – a part of the Bikers For Trump, Guardians of our Republic. Approximately Two Million Bikers Will Be DEFENDING Trump’s Inauguration Share this: '"}, "time": 1742563818.9006655}