{"duration": 0.05269813537597656, "input_args": {"text": "'Connecticut Gov. Dannel Malloy ( ) issued an executive order Thursday instructing the state department of education to develop policies with local school districts that allow gender confused children to use the school bathrooms and locker rooms of whichever gender they identify with at any given time. [According to a press release from Malloy’s office, the governor and state department of education Commissioner Dianna R. Wentzell issued a memo to all Connecticut public school superintendents, referring them to former President Barack Obama’s 2016 transgender bathroom policy for guidance until more “formal guidance” is developed within the state.  Malloy’s executive order is in response to President Donald Trump’s decision to abandon Obama’s May 2016 directive, which effectively asserts that children can change their sex by simply announcing they have the “gender identity” of the other sex. Trump essentially returned the issue of school bathrooms to the states. Obama’s transgender bathroom policy was actually halted in August of 2016 by a U. S. district judge who said the former president had overstepped his authority in issuing the directive. The order comes “in light of an action yesterday by the Trump Administration to roll back federal guidelines that protected transgender students in public school,” states the press release from the governor’s office. The governor said in a statement: Discrimination, harassment, and bullying have no place in our classrooms or at our schools. Despite the actions taken by the federal government yesterday, the State of Connecticut remains committed to ensuring that every student has access to a   education in a safe, supportive and welcoming school environment. Every child, no matter their gender identity or expression, should be treated equally and fairly in a safe, supportive environment. Connecticut will remain a state of inclusiveness because we strongly believe that diversity makes us stronger. Malloy, who served as a surrogate for Hillary Clinton during the 2016 presidential race, signed legislation in 2011 that added yet another category of a special protected class  —   gender identity and expression  —   into Connecticut’s   statutes. Less than   of Americans support the “ ” ideology pushed by gay activists and by Obama. Policies associated with the ideology would allow transgender activists to sue   institutions  —   such as sports leagues, public   and women’s shelters   —   until both biological sexes are viewed as interchangeable. Since the presidential election, Obama has twice admitted that his unpopular transgender policy helped to defeat Trump’s rival, Hillary Clinton. In an email statement, Family Institute of Connecticut (FIC) says, “[T]he governor’s statement of opposition is a farce, just the typical grandstanding to his base for which he is prone. ” FIC continues: As White House spokesman Sean Spicer explained in his daily briefing, President Trump rescinded President Obama’s transgender imposition on the nation’s schools because “He just believes this is a state issue that needs to be addressed by the states. ” In other words, President Trump could care less whether Gov. Malloy reaffirms transgender impositions on Connecticut’s schools. Trump rescinded Obama’s “guidelines” for reasons of states’ rights, the very idea Malloy appeals to in resisting Trump’s immigration policies. On Wednesday, the Connecticut governor also ordered his state’s law enforcement officers to refuse to comply with Trump’s immigration orders and policies, urging them to bar federal immigration officials from having access to illegal immigrants. Additionally, Malloy’s order encouraged schools to develop their own plans to bar access to schools by federal immigration officials. In June of 2016, Quinnipiac University released a survey that found Malloy’s approval ratings had plummeted to 24 percent  —   his lowest since taking office in 2011, and “one of the lowest approval ratings ever recorded for a governor in any of the nine states surveyed by the Quinnipiac University Poll,” reports the school. In the same month, a study from George Mason University’s Mercatus Center found that Connecticut ranked as the state in the worst fiscal condition  —   second only to Puerto Rico.'"}, "time": 1742563539.7815545}