{"duration": 0.1028742790222168, "input_args": {"text": "'Hundreds of Turkish migrants and dual nationals turned out onto the streets of Rotterdam to riot in support of their home country’s Islamist president last night, forcing Dutch police to take robust action to disperse them.[  People wave Turkish national flags during a demonstration near the Turkish consulate in Rotterdam on March 11, 2017. Photo: MARTEN VAN    Images,  Turkish residents of the Netherlands gather for a protest in Rotterdam on March 11, 2017. Photo: EMMANUEL    Images, Geert Wilders, leader of the Party for Freedom (PVV) released a message in response to the unrest, telling rioters, “You are no Europeans, and you will never be. ” 🇳🇱🇹🇷 Geert Wilders’s message to Turks: ”You are not welcome here!”    #Turkey #Rotterdam pic. twitter.   —   Keith Walker (@KeithWalkerNews) March 12, 2017,  “An Islamic state like Turkey does not belong to Europe. All the values Europe stands for  —   freedom, democracy, human rights  —   are incompatible with Islam,” he said. “Turkey voted for Erdoğan, a dangerous Islamist who raises the flag of Islam. We do not want more, but less Islam. So Turkey, stay away from us. You are not welcome here. ” Aggressive crowds have gathered outside the Dutch embassy in Ankara and the consulate in Istanbul in response, calling for retaliation and chanting “Allahu Akbar!” Nu voor Nederlands consulaat in Istanbul pic. twitter.   —   Lucas Waagmeester (@NOSWaagmeester) March 11, 2017,  The riots are in response to the Dutch government’s refusal to allow the Turkish foreign minister to land in the Netherlands to attend a rally supporting the expansion of President Recep Tayyip Erdoğan’s powers.  According to Prime Minister Mark Rutte, the refusal was made in response to being threatened with sanctions. “We can never do business under this kind of blackmail,” said Rutte, expressing amazement that family affairs minster Fatma Betul Sayan Kaya attempted to circumvent the Dutch ban on Turkish politicians campaigning in the Netherlands by bringing a fleet of ministerial cars across the German border, which the European Union’s borderless Schengen Area leaves unprotected. “We drew a red line,” he said, explaining why Kaya was escorted back to the German border  —   a move which prompted Erdoğan to denounce the Dutch as “fascists” and “Nazi remnants”. Turkish Prime Minister Binali Yildirim vowed there would be “a stronger reprisal against the unacceptable treatment toward Turkey and ministers who have diplomatic immunity” on Sunday afternoon. “Our   European friends who speak of democracy, freedom of expression and human rights have failed their class,” he declared. It is not yet clear what form Turkish reprisals will take, but foreign minister Mevlüt Çavuşoğlu has hinted the country may open its borders and allow illegal migrants to flood into Europe. [Video] Dutch police with dogs harshly disperse Turkish protesters in Rotterdam pic. twitter.   —   ANADOLU AGENCY (ENG) (@anadoluagency) March 12, 2017,  Erdoğan’s party, Justice and Development (AKP) has, like the Muslim Brotherhood in Egypt, been described as “Moderately Islamist”  —   but it has grown increasingly authoritarian as it unpicks the secular settlement laid down by Mustafa Kemal Atatürk, the founder of modern Turkey. “We are a Muslim country [and] we must have a religious constitution,” demanded parliamentary speaker Ismail Kahraman in 2016. “Secularism cannot feature in the new constitution. ” Atatürk introduced sweeping reforms which sought to confine Islam to the private sphere when Turkey was first esablished, abolishing the Ottoman Caliphate, severely curtailing Islam’s role in politics and discouraging religious dress. “My people are going to learn the principles of democracy, the dictates of truth and the teachings of science,” he said, according to a biography by Andrew Mango. “Superstition must go. ”'"}, "time": 1742564349.1107337}