{"duration": 0.06407856941223145, "input_args": {"text": "'27444 SHARES \\nThe Standing Rock Sioux’s camp, set up to physically stop construction of the Dakota Access Pipeline, just got solar power thanks to Mark Ruffalo. \\nThe actor and director delivered trailers full of solar panels alongside Wahleah Johns, founder of Native Renewables, to the Standing Rock camp. As cold weather begins to set in for the indigenous tribes facing off with oil companies in North Dakota, the solar panels will help generate electricity to provide the camp with life-sustaining heat and medical treatment. \\nEcoWatch reported that Ruffalo and Johns touted the necessity of switching to renewable energy in the wake of drastic climate change. Ruffalo also emphasized the right of Native Americans to protect their land from predatory fossil fuel companies. \\n“Around the world, more than 80 percent of the forests and lands with protected waterways and rich biodiversity are held by indigenous tribes. This is no coincidence,” Ruffalo said. “As so many of us suffer from polluted water, air and land in our rural and urban communities, the water defenders at Standing Rock are showing us another way.” \\nHowever, Ruffalo was quick to note that he was merely “trying to be of service” in using his platform to bring awareness to the Dakota Access Pipeline protest. \\n“It was really Wahleah Johns responsible for the delivery. I was there to draw the spotlight,” Ruffalo told US Uncut in an email. \\nJohns, whose company’s goal is to provide low-cost, renewable energy sources and green energy jobs for indigenous communities, praised the Standing Rock Sioux’s fight against Energy Transfer Partners’ pipeline, calling it necessary for the sake of the planet’s survival. \\n“Water is life,” said Johns , who is a leader in the Navajo nation. “By leading a transition to energy that is powered by the sun, the wind, and water, we ensure a better future for all of our people and for future generations.” \\nThe Dakota Access Pipeline, if constructed, would carry highly toxic tar sands oil through North Dakota, South Dakota, Iowa, and Illinois , where it would then be transported by train to ports on the Gulf of Mexico. Sacred land belonging to indigenous communities in North Dakota was destroyed for the pipeline route, with Native American leaders saying they were never consulted about the pipeline before construction began. The Standing Rock Sioux, who call themselves “water protectors,” say the pipeline would endanger drinking water for millions of people along the pipeline route. \\n\\nTom Cahill is a writer for US Uncut based in the Pacific Northwest. He specializes in coverage of political, economic, and environmental news. You can contact him via email at [email protected] '"}, "time": 1742564577.1129756}