{"duration": 0.10553526878356934, "input_args": {"text": "'Donald Trump won’t officially become president until January 2017, but within hours of his victory the world has already begun to change. \\nVia Independent \\n\\n1) A top Israeli government minister declared the idea of Palestinian state “over”. \\nIsrael’s Education Minister Naftali Bennett, a key figure on the right wing of the Israeli governing coalition, said that Trump’s victory “is an opportunity for Israel to immediately retract the notion of a Palestinian state”. Citing Mr.Trump’s election manifesto, the minister added: “The era of a Palestinian state is over.”\\n2) American Muslim women who wear the hijab agonized over whether its still safe to wear one. “Seeing my mom cry because she’s even more scared of the racism she’ll face because of her hijab absolutely broke me…” “My mom literally just texted me “don’t wear the Hijab please” and she’s the most religious person in our family….” “My 8 year old sister just told me she’s scared to be Muslim. That broke my heart. I’m crying. Don’t tell me his words don’t matter.”\\n3) Demonstrators set fires and overturned cars in major cities across America. \\nProtests across America after Trump victory\\nThousands of people took to the streets across the US’s western seabord to protest against Mr Trump’s victory over Hillary Clinton. Cities in California, Oregon and Washington all witnessed angry demonstrations, with objects being set alight, windows smashed, and effigies burned. Protests are also planned outside US embassies across the world.\\n4) Global financial markets went haywire. \\nInvestors piled into safe assets like gold while currency markets and stock markets reacted with volatility to Mr Trump’s win.\\nThe Mexican peso plumetted, with stock markets including the Japanese Nikkei and FTSE all down. Stock market futures plunged in US markets, a sign that investors believe long-term volatility is ahead.\\n5) Sarah Palin said Britain and America are “hooking up” in light of Brexit and Trump. Sarah Palin, the former Alaskan govenor tipped for a position in Mr Trump’s cabinet, told reporters that Britan and America were “hooking up” following the election. “Well, see, Great Britain and America, see how we’re hooking up now?” she said at a Trump rally as the results rolled in. “We’re going rogue and saying, you know, the people are going to take back control of our governance.”\\n6) Former KKK leader David Duke declared tonight “one of the most exciting nights of my life”. \\nDavid Duke, who formerly led the KKK as its “Grand Wizard”, celebrated Mr Trumps election: “This is one of the most exciting nights of my life,” Mr Duke wrote. “Make no mistake about it, our people have played a huge role in electing Trump!”\\n7) Shares in renewable energy companies tanked… \\nShares of renewable energy companies that operate in the US tanked on the news that Mr.Trump would be the next president.\\nThe Republican president has previously claimed climate changed is a hoax perpetuated by the Chinese to cripple American industry. Vestas, a major maker of US wind turbines that gets about 40 per cent of its business from America, saw a maximum fall of 14 per cent.\\n8) …while shares in arms companies surged to a record high \\n9) Russia’s political establishment celebrated. Russian parliament bursts into applause upon announcement of US election result.\\nJubilant parliamentarians burst into applause in Russia’s legislature at the next of Mr.Trump being elected. Clapping drowned out the announcement. Vladimir Putin, the country’s president, sent Mr.Trump a welcome telegraph, while his allies expressed satisfaction as the Republican candidate beating Hillary Clinton.\\n10) Canada’s immigration website crashed under the demand of American visitors. \\nCanadian Prime Minister Justin Trudeau (Rex Features)\\nThe official website for ‘Citizenship and Immigration Canada’ stopped working overnight, apparently because of the sheer number of Americans looking to emigrate north. Service was later restored, with the Canadian citizenship and immigration service tweeting dryly that in Canada “immigrants are encouraged to bring their cultural traditions with them and share them with their fellow citizens”.\\n11) Jihadi leaders welcomed the new US president. \\n“Trump’s victory is a hard slap to those promoting the efficiency of democratic systems,” Hamza al-Karibi, a spokesperson for the al-Qaeda affiliated Syrian jihadist group Jabhat Fatah al-Sham wrote to his Twitter followers. “Starting today, we won’t need media releases clarifying the West’s machinations. All we need to do is retweet what Trump says,” he added.\\nMeanwhile, prominent Egyptian-born jihadi cleric Dr.Tariq Abdel Haleem said: “Trumps [sic] winning might be bad for us in the short run. However, it is better for Muslims in the long run as he’ll ruin the US.”\\n12) Mexico’s foreign minister made it clear they wouldn’t be paying for that wall. \\nA mock-up of what such a wall might have to look like in scale (Agustin Avalos/Estudio 314)\\nMr Trump’s signature policy of building a huge wall across America’s southern border with Mexico to stop immigrants seemed less likely than ever. “Paying for a wall is not part of our vision,” Claudia Ruiz Massieu, Mexico’s foreign minister, told a local television station on Wednesday in the aftermath of Mr Trump’s triumph.\\nSource: Independent \\n'"}, "time": 1742563125.2228494}