{"duration": 0.20742392539978027, "input_args": {"text": "'Please learn something about steroids before making such comments. You’re merely repeating unproven assertions. anarchyst \\n…look at the medical literature…changes in behavior ARE attributed to steroid use. You must be a cop… S J \\nThat’s so stupid. They get tested and random tested all the time. Steroids now?? troll hunter \\nWhat State do you live in were cops get random drug tested ? I’ve never heard of one in the United States that does that even after an officer involved shooting. They have to have probable cause to test the officer or their union will shut it down immediately Peter Jameson \\nCops, accountable only to each other and guided by policy established by political appointees. The guy is right! Storm Troopers they are but from a more current time. And the good men do nothing. Mark “SEADOG” Warren \\nI am not PC – Now that I got that out of the way – All of those so call police need to be prosecuted to the fullest extent of the law. Everything they own needs to be transferred to this individual and they should live in the deepest hole of no return. Tase them 10,000 times see if they survive. Donald B Pearce \\nHe should never been given a Badge,,,Screw him,,Go after the Chief!!!! He knows what kind of a cop he is Paschn \\nExactly! Thank you. Rather than focusing on the anal pimple’s called cops, go after the huge festering BOILS (dual citizens?), put in “appointed” positions of power within the body politic who seek out this filth nurture it and PROTECT it. Rev. Walking Turtle \\nHear hear! Let’s start with the traitors in Congress and work our way outward and downward from there, shall we? VERY good (though doubtless dangerous) idea! \\nDangerous as in: Witness the treatment of LaVoy Finnicum and friends at the hands and arms of Federalized though privately-owned and decidedly hostile foreign-agency hands – and all the standard-issue lies+video-fakery that followed that criminally arranged and executed ambush/murder like stink on poop. \\nNonetheless imvho it IS the Right Idea. In furtherance of which, kindly note: You and your friends ‘n’ neighbors here in Lawful America simply MUST Lawfully arrest, try, convict ‘n’ sentence ’em Lawful as can be, first. Then YT’ll gladly quick-drop hang ’em ar a truly bargain rate per capita. \\nSave a ton on hard-to-buy pentobarbitol AND (unlike what the perps have always done), NEVER spill ANY blood. All over within five minutes from cell-entry to trap-drop when Done Right! Full and gentle dignity throughout the proceediure (struggling condemned ones CAN and MUST be NON-violenty subdued, thank you!) or double your Hangman’s Fee cheerfully refunded! \\nThen: Let’s just see, in the century that follows, whether a LAWFULLY IMPOSED and TRULY DESERVED Humane Death Penalty has any deterrent effect on the Infandous ‘L33t, shall we? Mere Social Science Done Right! And that is all. 0{:-|o[ Jamie Hall \\nAmerica definitely is ripe for a second Revolutionary War. And the “enemies” may be very much “domestic”. But the enemy is not the people. It’s the Government, which is as hell-bent on tyrrany as any Monarch deserving of defeat at the hands of the citizenry. Paschn \\nGood point imo. But we still have a treasonous military led by walking feces of dual citizen Wesley Clark’s ilk, (WACO “fame”, and his wish to put all those who disagree with his fellow tribals running this government in to concentration camps), and LEO’s who actually enjoy killing their fellows for great pay, idiot culture’s admiration a pat on the ass from the boss and benefits we’ll never see again. If the “rabid dog” cannot be put down by secession and it boils into a REAL civil war then when, (after their toadies have killed millions of us), we gain the upper hand, we must chase all those who brought this global horror about to the ends of the earth if necessary as well as the elitist families who have been screwing/slaughtering us for literally generations and completely remove them to the 5th generation from the gene pool. In this way we can insure justice, honor/ decency for at least as many generations. CTOH \\nI HATE it when someone doesn’t say WHERE in the film it is. I don’t want to watch 20 minutes of it. \\njust play it in fast motion Prince \\nHe should’ve called him a Jack-Booted Gestapo Donut Nazi! max tague \\nFat pigs give LEO’s a bad name morsextenebris \\nWOW, he was really endangering himself & the [email protected] by skateboarding in the wrong direction…WTF is going through these guys heads, real tough guys eh? Richard Winchester \\nThis has been brewing since 1980… It’s now out of hand and needs to be dealt with by the government or the people. Quite frankly I prefer the people take direct action. \\nthis has been brewing since the formation of police posses as slave catchers S J \\nOk, he was fighting with the police from the beginning and spit on them. That’s an assault James Michael \\nActually asshole, the sworn servant had no cause of action, he was aggravated assaulting and battering and kidnapped the guy not to mention his treason of the 4th and 5th amendments. Try again ignoramus. S J \\nClearly you’re the ignoramus and apparently has anger issues. James Michael \\nI just explained the facts to you and that is all you can say? Go lick your masters crack and get all the turds off slave…. Anger issues? You are damned right I have anger issues when I see ignorant retards like you bowing to felon ass treasonous thugs on the land of the free…MORON. You are helping to piss away what I served 2 decades to protect…Pound sand retard…. JdL \\nThat cop deserved to be shot on the spot by some patriotic citizen who is fed up with this nation’s descent into a police-state hellhole. Greg Geitner \\nbecause the various departments who are responsible for these[ expletive of your choice] refuse to make a concerted effort to correct these crimes, it is up to citizens with a conscience and a backbone to stop this madness BY ANY MEANS NECESSARY. Ibcamn \\nno fitness program in this department either,are all cops just fat nasty donut eaters now days,kinda like the southern cops when i was growing up….fat loud mouths assholes that hide behind their badges.cops are just criminals,why did it take a dozen cops to arrest a skateboarder skating the wrong way on a street…really.what a bunch of losers. Centrist Force \\nthugs. unprofessional thugs. they disgrace the uniform and the badge. its been reduced to a badge of state of criminals. Arishia \\n“Nearly all men can stand adversity, but if you want to test a man’s character, give him power.” Abe Lincoln These cops have more power than they can handle, given the characters they demonstrate. Patty Parfait \\nWow, tough guy has to kick a citizen, he’s so fat he had to go after kid on skateboard than he brags to other thugs how citizen threw something and flipped him off so he had to go after him. Then what, he arrested him for resisting, what did he do that he had to “get him” According to supreme court flipping cops off is NOT illegal. Jamie Hall \\nCould it be that, subconsiously or otherwise, what this cop really took offense to was the thought that the fascist pig regime posing as law enforcement could suffer the same fate as the Empire? If not, he’s about to experience such a downfall firsthand. okiejoe100 \\nSometimes the “worm” turns. Also known as karma. anarchyst \\n“And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say goodbye to his family? Or if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling in terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand. The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin’s thirst; the cursed machine would have ground to a halt . . .” – Aleksandr Solzhenitsyn, The Gulag Archipelago Social'"}, "time": 1742562702.8128126}