{"duration": 0.10091805458068848, "input_args": {"text": "'Jared Kushner and his wife Ivanka Trump enlisted the services of Risa Heller, a New York City public relations figure known for her work with Democrats  —   including former Rep. Anthony Weiner ( ) Sen. Chuck Schumer ( ) and Gov. David Paterson ( )  —   when they came to Washington to take up their official posts in the Trump White House, according to a report in Buzzfeed. [The revelation came amid reports that a New York City set with a history of friendly ties to the Democratic party is gaining traction in President Donald Trump’s White House, much to the chagrin of conservative commentators.  Members of the Kushner family itself donated large sums to Democratic causes until a few years ago, and Jared has reportedly been accused of being “a Democrat” by more nationalist and populist factions within the White House. Another   member of this   is the Director of Trump’s National Economic Council, registered Democrat and former Goldman Sachs executive Gary Cohn. Asked by Buzzfeed about her choice, Ivanka responded in a statement, “Risa is incredibly talented, driven and passionate. She is a formidable advocate and respected by all as a trustworthy and honest broker of facts. ” Her husband Jared echoed her sentiments. “She’s the best fighter in the business, is universally respected, and most importantly has always told me what she really thinks, good or bad,” he said. Heller began her career in Schumer’s press office before expanding her horizons in and beyond the political field. She served as communications director for David Paterson as the New York governor who replaced   Gov. Eliot Spitzer and then found himself in crises of his own. In addition to allegations of witness tampering by his appointees, Heller managed Paterson’s image through the emergence of the sex and drug scandals that ultimately sunk his reelection hopes. Anthony Weiner, perpetrator of perhaps politics’   most embarrassing litany of   also sought Heller’s help as he tried to weather the media storm of the century that surrounded his multiple “sexting” scandals. Now banished from the political realm, Weiner sung Heller’s praises. “If I had taken her advice at critical junctures even 5% of the time, I would have been infinitely better off,” he told Buzzfeed. “This may sound ironic coming from me, but she never advocates for not telling the truth. I repeatedly didn’t take that kind of advice where I should have. ” For her own part, Buzzfeed reports Heller continued to argue Weiner was a “good person,” even as the worst details of his improprieties were emblazoned on front pages around the world. Jared and Ivanka, until recently, haunted the same New York circles in which these Democratic politicians are hounded by the city’s notorious tabloid press. Kushner himself has used Ms. Heller, sending her to handle the New York Times earlier this year when that paper raised questions about a deal of his in China. Anthony Weiner, for one, seemed to think she was a natural pick to help Jared and his wife in DC. “It doesn’t surprise me that people like the Kushners would gravitate toward her,” he told Buzzfeed. At the beginning of April, paparazzi supplied the Daily Mail with photos of Ms. Heller heading into Jared and Ivanka’s new home in Washington, DC. Some think Heller is an odd choice to bring so close to Ivanka’s father’s Republican administration. At least one of her own former Democrat colleagues in New York expressed horror at the move. “I think there’s a big difference between representing business interests and essentially helping to advance an agenda that is completely antithetical to everything that Democrats stand for,” the Democratic operative told Buzzfeed. Heller was reportedly dismayed to be the subject of a Buzzfeed article, but offered a defense of her decision to work for the Kushners: “I fight tirelessly for my clients, period. That’s what I am in business to do. I am proud of what I do and who I do it for. ” Heller is not the first publicity figure the Kushners have brought in from sources Republicans traditionally might not consider. Jared hired   Josh Raffel right out of Hollywood earlier this month.'"}, "time": 1742561739.2744906}