{"duration": 0.0337069034576416, "input_args": {"text": "'I have to give the jews their brilliance on this one. People have been \"slutty\" \"sleazy\" and horny forever. But they were discrete about it. There was early marriage around 18-20 years old so most people were sexually inexperienced. Now people don\\'t get married until POSSIBLY later and this gives ample time to work on the self-esteem of women to worry about their self-worth via their physical looks. Jews capitalize on this and the newest generation of Western women have been horribly manipulated into giving all the wrong signals in order to attract men. Tattoos? Slutty clothes? Have sex right away? White girls honestly think that is what white men like. Thanks jews!\\nThe final result is that white men are not attracted to white women and so the social fabric and therefore power of white culture is destroyed. It is sad that white women have been duped into repulsing white men.\\nAs a parallel story, my grandma knew my grandpa since childhood. She was a Roaring Twenties \"IT\" girl and partied it up My grandpa always cared about her and \"saved\" her from partying too much and married her. They had a wonderful, long, exciting marriage. I doubt my grandpa would have traded my grandma for a quiet and nun-like girl to save his life. He considered it a badge of honor to try and \"tame\" her Irish spirit. In the end their graves were right next to each other.\\nGuys, don\\'t be too freaked out about by these amateur white girl sluts. You can still save them and make them settle down. A 40 year old burnt out slut, that\\'s different.... Otherwise you will be (((deceived))) into a life of living alone with your computer [white genocide] or mating with an Asian. And well there are billions of chinks, they aren\\'t exactly disappearing from the face of the earth....\\nConsider the \"slut\" act a desperate cry for help, white girls instinctively know they are being rejected/genocided and are acting out.\\nForgive them, they know not what they do.'"}, "time": 1742563915.4088356}