{"duration": 0.07935428619384766, "input_args": {"text": "'Donald J. Trump was emphatic in the second presidential debate: Yes, he had boasted about kissing women without permission and grabbing their genitals. But he had never actually done those things, he said. “No,” he declared under questioning on Sunday evening, “I have not. ” At that moment, sitting at home in Manhattan, Jessica Leeds, 74, felt he was lying to her face. “I wanted to punch the screen,” she said in an interview in her apartment. More than three decades ago, when she was a traveling businesswoman at a paper company, Ms. Leeds said, she sat beside Mr. Trump in the   cabin of a flight to New York. They had never met before. About 45 minutes after takeoff, she recalled, Mr. Trump lifted the armrest and began to touch her. According to Ms. Leeds, Mr. Trump grabbed her breasts and tried to put his hand up her skirt. “He was like an octopus,” she said. “His hands were everywhere. ” She fled to the back of the plane. “It was an assault,” she said. Ms. Leeds has told the story to at least four people close to her, who also spoke with The New York Times. Mr. Trump’s claim that his crude words had never turned into actions was similarly infuriating to a woman watching on Sunday night in Ohio: Rachel Crooks. Ms. Crooks was a    receptionist at Bayrock Group, a real estate investment and development company in Trump Tower in Manhattan, when she encountered Mr. Trump outside an elevator in the building one morning in 2005. Aware that her company did business with Mr. Trump, she turned and introduced herself. They shook hands, but Mr. Trump would not let go, she said. Instead, he began kissing her cheeks. Then, she said, he “kissed me directly on the mouth. ” It didn’t feel like an accident, she said. It felt like a violation. “It was so inappropriate,” Ms. Crooks recalled in an interview. “I was so upset that he thought I was so insignificant that he could do that. ” Shaken, Ms. Crooks returned to her desk and immediately called her sister, Brianne Webb, in the small town in Ohio where they grew up, and told her what had happened. “She was very worked up about it,” said Ms. Webb, who recalled pressing her sister for details. “Being from a town of 1, 600 people, being naïve, I was like ‘Are you sure he didn’t just miss trying to kiss you on the cheek?’ She said, ‘No, he kissed me on the mouth.’ I was like, ‘That is not normal. ’” In the days since Mr. Trump’s campaign was jolted by a 2005 recording that caught him bragging about pushing himself on women, he has insisted, as have his aides, that it was simply macho bluster. “It’s just words,” he has said repeatedly. And his hope for salvaging his candidacy rests heavily on whether voters believe that claim. They should not, say Ms. Leeds and Ms. Crooks, whose stories have never been made public before. And their accounts echo those of other women who have previously come forward, like Temple Taggart, a former Miss Utah, who said that Mr. Trump kissed her on the mouth more than once when she was a    pageant contestant. In a phone interview on Tuesday night, a highly agitated Mr. Trump denied every one of the women’s claims. “None of this ever took place,” said Mr. Trump, who began shouting at the Times reporter who was questioning him. He said that The Times was making up the allegations to hurt him and that he would sue the news organization if it reported them. “You are a disgusting human being,” he told the reporter as she questioned him about the women’s claims. Asked whether he had ever done any of the kissing or groping that he had described on the recording, Mr. Trump was once again insistent: “I don’t do it. I don’t do it. It was locker room talk. ” But for the women who shared their stories with The Times, the recording was more than that: As upsetting as it was, it offered them a kind of affirmation, they said. That was the case for Ms. Taggart. Mr. Trump’s description of how he kisses beautiful women without invitation described precisely what he did to her, she said. “I just start kissing them,” Mr. Trump said on the tape. “It’s like a magnet. Just kiss. I don’t even wait. ” Ms. Crooks and Ms. Leeds never reported their accounts to the authorities, but they both shared what happened to them with friends and family. Ms. Crooks did so immediately afterward Ms. Leeds described the events to those close to her more recently, as Mr. Trump became more visible politically and ran for president. Ms. Leeds was 38 at the time and living in Connecticut. She had been seated in coach. But a flight attendant invited her to take an empty seat in first class, she said. That seat was beside Mr. Trump, who did not yet own a fleet of private aircraft, records show. He introduced himself and shook her hand. They exchanged pleasantries, and Mr. Trump asked her if she was married. She was divorced, and told him so. Later, after their dinner trays were cleared, she said, Mr. Trump raised the armrest, moved toward her and began to grope her. Ms. Leeds said she recoiled. She quickly left the   cabin and returned to coach, she said. “I was angry and shook up,” she recalled, as she sat on a couch in her New York City apartment on Tuesday. She did not complain to the airline staff at the time, Ms. Leeds said, because such unwanted advances from men occurred throughout her time in business in the 1970s and early 1980s. “We accepted it for years,” she said of the conduct. “We were taught it was our fault. ” She recalled bumping into Mr. Trump at a charity event in New York about two years later, and said he seemed to recall her, insulting her with a crude remark. She had largely put the encounter on the plane out of her mind until last year, when Mr. Trump’s presidential campaign became more serious. Since then, she has told a widening circle of people, including her son, a nephew and two friends, all of whom were contacted by The Times. They said they were sickened by what they heard. “It made me shake,” said Linda Ross, a neighbor and friend who spoke with Ms. Leeds about the interaction about six months ago. Like several of Ms. Leeds’s friends, Ms. Ross encouraged her to tell her story to the news media. Ms. Leeds had resisted until Sunday’s debate, which she watched with Ms. Ross. When Mr. Trump denied having ever sexually assaulted women, in response to a question from Anderson Cooper of CNN, Ms. Ross said she immediately looked at Ms. Leeds in disbelief. “Now we know he lied straight up,” Ms. Ross recalled saying. In the days after the debate, Ms. Leeds recounted her experience in an email to The Times and a series of interviews. “His behavior is deep seated in his character,” Ms. Leeds wrote in the message. “To those who would vote for him,” she added, “I would wish for them to reflect on this. ” For Ms. Crooks, the encounter with Mr. Trump was further complicated by the fact that she worked in his building and risked running into him again. A few hours after Mr. Trump kissed her, Ms. Crooks returned to her apartment in the Bay Ridge section of Brooklyn and broke down to her boyfriend at the time, Clint Hackenburg. “I asked, ‘How was your day? ’” Mr. Hackenburg recalled. “She paused for a second, and then started hysterically crying. ” After Ms. Crooks described her experience with Mr. Trump, she and Mr. Hackenburg discussed what to do. “I think that what was more upsetting than him kissing her was that she felt like she couldn’t do anything to him because of his position,” he said. “She was 22. She was a secretary. It was her first job out of college. I remember her saying, ‘I can’t do anything to this guy, because he’s Donald Trump. ’” Days later, Ms. Crooks said, Mr. Trump, who had recently married Melania, came into the Bayrock office and requested her phone number. When she asked why he needed it, Mr. Trump told her he intended to pass it along to his modeling agency. Ms. Crooks was skeptical, but relented because of Mr. Trump’s influence over her company. She never heard from the modeling agency. During the rest of her year working at Bayrock, she made a point of ducking out of sight every time Mr. Trump came into view. When Bayrock employees were invited to the Trump Organization Christmas party, she declined, wanting to avoid any other encounters with him. But the episode stuck with her even after she returned to Ohio, where she now works for a university. When she read a Times article in May about the Republican nominee’s treatment of women, she was struck by Ms. Taggart’s recollection of being kissed on the mouth by Mr. Trump. “I was upset that it had happened to other people, but also took some comfort in knowing I wasn’t the only one he had done it to,” said Ms. Crooks, who reached out to The Times to share her story. Both Ms. Leeds and Ms. Crooks say they support Hillary Clinton’s campaign for president, and Ms. Crooks has made contributions of less than $200 to President Obama and Mrs. Clinton. Ms. Crooks was initially reluctant to go public with her story, but felt compelled to talk about her experience. “People should know,” she said of Mr. Trump, “this behavior is pervasive and it is real. ”'"}, "time": 1742628491.5033479}