{"duration": 0.12405776977539062, "input_args": {"text": "'A new proposal by a Republican lawmaker would sell United States citizenship to foreign nationals to fund the building of a wall along the U. S.  Border. [In a new plan by Rep. Dana Rohrabacher ( ) current legal immigration policy would be changed to fund President Donald Trump’s proposed border wall construction plans.  Rather than eliminating the diversity lottery altogether, as immigration hawks have requested, Rohrabacher’s plan changes which foreign nationals are given the 55, 000 visas every year under the current system. Under Rohrabacher’s proposal, the 55, 000 Green Cards awarded to   foreign nationals would be replaced by a system for those able to pay a $1 million fee. The only requirement for essentially buying the Green Card would be “good character,” Rohrabacher told the Washington Examiner. Once the foreign national is in the U. S. for two years, the plan guarantees a pathway to citizenship. Center for Immigration Studies Director Mark Krikorian told Breitbart Texas the plan was “absurd,” as it did not lower any legal immigration levels, thus not dealing with the concerns of Trump’s base when it comes to the immigration issue. “Just because you have money, does not mean you’re going to become a better American,” Krikorian said in an interview. “Yes, you’re less likely to use welfare  …     but that’s not what this is all about though. That’s part of the issue, but not all of it. ” “They figure this is a compromise,” Krikorian continued. “But we don’t get any reduction in [immigration] numbers with this. [Republicans] don’t realize that reducing the numbers is the entire point. ” The plan by Rohrabacher is similar to a visa system that already exists and has been panned by immigration hawks, known as the   visa. With the   visa program, 10, 000 foreign nationals can come to the U. S.  —   and bring their entire family with them  —   so long as they claim to invest at least $500, 000 and create 10 American jobs. Eventually, those foreign nationals on   visas can apply for U. S. citizenship. Immigration expert John Miano, told Breitbart Texas that Rohrabacher’s plan, like the   visa, creates a special pathway for wealthy foreigners without any requirement that they commit to the U. S. “There’s something not right about grabbing the world’s rich people and bringing them to America,” Miano said. “They have no commitment to the country. ” “If you’re going to buy people off, you have to have people who are going to pick up the guns and defend the nation, not people who are trying to find the most secure place to keep their money,” Miano continued. Krikorian said he supports a border wall funding plan being pushed by Rep. Mike Rodgers ( ) where illegal immigrants’ remittances are taxed. “There are any number of ways to fund the borders,” Krikorian said. Rohrabacher’s visa plan is not the only GOP immigration proposal opposed by immigration hawks. Sen. John Cornyn’s ( ) proposal to potentially triple the number of foreign nationals who enter the U. S. under the   visa every year similarly received pushback, as Breitbart Texas reported. “It’s remarkable that these guys just don’t get it,” Krikorian said. John Binder is a reporter for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742563498.8114228}