{"duration": 0.06641411781311035, "input_args": {"text": "'The forgotten political debate that led to America’s worldwide interventionism By Jim Miles \\nThe True Flag: Theodore Roosevelt, Mark Twain, and the Birth of the American Empire By Stephen Kinzer Henry Holt and Company, New York. 2017 \\nThe American empire is usually not spoken of as such within today’s current mainstream media discussions, but is generally recognized as such during infrequent candid moments, and within discussions in much of the alternate media. The discussion is not new, and the factors within the discussion, while changing somewhat with the times, tend to have remained the same. Stephen Kinzer’s illustrative new history, The True Flag, takes the reader back to the turn of the Twentieth Century when the first acts of overseas empire were argued and acted on. \\nIt can be argued that ‘empire’ starts with the first movement across the continent by the new United States, incorporating, by various means, Florida, the Louisiana Purchase, the northern half of Mexican territory, and the lands of the native population. Kinzer acknowledges all that indirectly, as do some of the characters in the history, but his focus is on the pivotal years of 1898 to 1901 when the arguments concerning overseas territories focused on the Spanish empire in Cuba, Guam, Puerto Rico, the Philippines, and the then sovereign state of Hawaii. \\nThe writing is history at its best. Kinzer writes an interesting history with a casual anecdotal style of reading rather than the more common dry textbook style. While doing so the reader receives a sense of the actual personality and characteristics of each person within the narrative. As the story unwinds, these personality traits become as important as the actual facts of what happened, the latter having devolved form each individual’s interests and intentions. \\nThe title highlights Roosevelt and Mark Twain as the prime protagonist/antagonist pair. The history itself presents a significant group on either side: McKinley, Hearst, Lodge, and Roosevelt promoting empire; Hoar, Carnegie, Bryan, and Twain opposing the annexation/conquest of overseas territories. Many other characters come into play, but his group displays the personal characteristics that helped shape the overall argument. \\nThe themes of the arguments are surprisingly familiar to contemporary empire critics. \\nThe racist nature of U.S. endeavours runs throughout the discussion, ranging from the idea of “benevolent assimilation” allowing the “blessings of good and stable government . . . under the free flag of the United States [McKinley],” to “the misguided Filipino [McKinley],” but more strongly worded in the sanctimonious terms of “savage tribes [Roosevelt]” and from the military commander in the Philippines, a people “in the childhood stage of race development.” \\nSound familiar to today’s rhetoric? So do the underlying rationalizations and apologetics for empire. The Filipinos “shall for ages hence bless the American republic,” for their “emancipation” not just from another empire but from the “arrogant rule of a native dictator.” On the other hand, when the fighting became bloody and fierce, the insurrection fighters were attacked as “They assailed our sovereignty [McKinley—again],” while the anti-imperialists at home became “complicit in the killing of U.S. soldiers [Roosevelt].” Rally ‘round the flag boys. \\nOther current themes run through the works. The ideas of the U.S. as a moral nation collided with the now consistent idea that “it was foolish to dwell on constitutional niceties when vital interests were concerned.” The concept of forceful morality came into play as it does today. Mckinley argued, Forcible intervention of the United States as a neutral to stop the war [would be] in the cause of humanity.” The imperialists in general “considered war purifying,” and “In their imagined future, humanity would be guided by a virtuous United States and disciplined by American military power.” Sounds like something out of our contemporary Thomas Friedman and his “hidden fist.” \\nThe reality underlying most of the rhetoric was markets, resources, and profits, much as it is today with the U.S. concern for maintaining its petrodollar hegemony. With the U.S. in an economic downturn, and millions unemployed (still familiar?) the imperialists argued that “commerce would have to be protected, or imposed on unwilling nations by naval power . . . [fusing] America’s commercial and strategic interests into a global strategy.” Empire would create “outlets for the surplus” and guarantee America’s “commercial supremacy.” Cuba was already mostly owned by fruit and sugar farmers, and the Philippines represented a market of 10 million citizens who would be educated to the U.S. manner of consumption and also would serve as a stepping stone into Asian markets. \\nThe anti-empire people obviously lost the argument—perhaps not the argument, but certainly the reality. Their central focus was the adverse effects overseas acquisitions would have on the very nature of the Republic that would eventually lead to its decline and its dislike and distrust by much of the world. In that sense, yes, they won the argument, but not the reality. \\nSimilar to his other works, Stephen Kinzer presents an easily readable, entertaining, and informative history of these important years. The True Flag is an important addition to not only understanding this particular time of imperial expansion, but also as a basis for understanding most of the subsequent events leading up to today’s aggrandizing imperial rhetoric—it is not new. \\nJim Miles is a Canadian educator and a regular contributor/columnist of opinion pieces and book reviews for The Palestine Chronicle. Miles’ work is also presented globally through other alternative websites and news publications. Reviews . Bookmark the permalink .'"}, "time": 1742628370.8906474}