{"duration": 1.8620481491088867, "input_args": {"text": "'Videos Human Rights Watch: Nigerian Officials Raping Women, Girls Displaced By Boko Haram “It is bad enough that these women and girls are not getting much-needed support for the horrific trauma they suffered at the hands of Boko Haram,” said Mausi Segun, senior Nigeria researcher at Human Rights Watch. “It is disgraceful and outrageous that people who should protect these women and girls are attacking and abusing them.” | October 31, 2016 Be Sociable, Share! In this photo taken with an iPad on Friday, Jan. 31, 2014, women and children who survived attacks by Boko haram sits outside a compound at St. Paul’s Roman Catholic Church, in Wada Chakawa, Yola, Nigeria.. (AP Photo/ Ibrahim Abdulaziz) \\nABUJA – Government officials and other authorities in Nigeria have raped and sexually exploited women and girls displaced by the conflict with Boko Haram. The government is not doing enough to protect displaced women and girls and ensure that they have access to basic rights and services or to sanction the abusers, who include camp leaders, vigilante groups, policemen, and soldiers. \\nIn late July, 2016, Human Rights Watch documented sexual abuse, including rape and exploitation, of 43 women and girls living in seven internally displaced persons (IDP) camps in Maiduguri, the Borno State capital. The victims had been displaced from several Borno towns and villages, including Abadam, Bama, Baga, Damasak, Dikwa, Gamboru Ngala, Gwoza, Kukawa, and Walassa. In some cases, the victims had arrived in the under-served Maiduguri camps, where their movement is severely restricted after spending months in military screening camps. \\n“It is bad enough that these women and girls are not getting much-needed support for the horrific trauma they suffered at the hands of Boko Haram,” said Mausi Segun , senior Nigeria researcher at Human Rights Watch. “It is disgraceful and outrageous that people who should protect these women and girls are attacking and abusing them.” \\nFour of the victims told Human Rights Watch that they were drugged and raped, while 37 were coerced into sex through false marriage promises and material and financial assistance. Many of those coerced into sex said they were abandoned if they became pregnant. They and their children have suffered discrimination, abuse, and stigmatization from other camp residents. Eight of the victims said they were previously abducted by Boko Haram fighters and forced into marriage before they escaped to Maiduguri. \\nA situational assessment of IDPs in the northeast in July 2016 by NOI Polls, a Nigerian research organization, reported that 66 percent of 400 displaced people in Adamawa, Borno, and Yobe states said that camp officials sexually abuse the displaced women and girls. \\nWomen and girls abused by members of the security forces and vigilante groups – civilian self-defense groups working with government forces in their fight against Boko Haram – told Human Rights Watch they feel powerless and fear retaliation if they report the abuse. A 17-year-old girl said that just over a year after she fled the frequent Boko Haram attacks in Dikwa, a town 56 miles west of Maiduguri, a policeman approached her for “friendship” in the camp, and then he raped her. \\n“One day he demanded to have sex with me,” she said. “I refused but he forced me. It happened just that one time, but soon I realized I was pregnant. When I informed him about my condition, he threatened to shoot and kill me if I told anyone else. So I was too afraid to report him.” \\nThe Boko Haram conflict has led to more than 10,000 civilian deaths since 2009; the abductions of at least 2,000 people, mostly women and children and large groups of students, including from Chibok and Damasak; the forced recruitment of hundreds of men; and the displacement of about 2.5 million people in northeast Nigeria. \\nWomen and children queue on September 15, 2016 to enter a nutrition clinic at an informal settlement in the outskirts of Maiduguri, the capital of Borno State, in northeastern Nigeria. © 2016 Getty Images \\nIrregular supplies of food, clothing, medicine, and other essentials, along with restricted movement in the IDP camps in Maiduguri, compounds the vulnerability of victims – many of them widowed women and unaccompanied orphaned girls – to rape and sexual exploitation by camp officials, soldiers, police, members of civilian vigilante groups, and other Maiduguri residents. Residents of the Arabic Teachers Village camp, Pompomari, told Human Rights Watch in July that the camp had not received any food or medicines since late May, just before the start of the month-long Muslim fast of Ramadan. \\nRestricted movement in the camps is contrary to Principle 14.2 of the United Nations Guiding Principles on Internal Displacement , which provides that internally displaced people have “the right to move freely in and out of camps and other settlements.” \\nIn some cases, men used their positions of authority and gifts of desperately needed food or other items to have sex with women. A woman in a Dalori camp said residents get only one meal a day. She said she accepted the advances of a soldier who proposed marriage because she needed help in feeding her four children. He disappeared five months later when she told him she was pregnant. \\nVictims of rape and sexual exploitation may be less likely to seek health care, including psychological counselling, due to the shame they feel. Fewer than five of the 43 women and girls interviewed said they had received any formal counseling after they were raped or sexually exploited. A medical health worker in one of the camps, which has 10,000 residents, said that the number of people requiring treatment for HIV and other sexually transmitted infections has risen sharply, from about 200 cases when the camp clinic was established in 2014 to more than 500 in July 2016. The health worker said she believed that many more women could be infected but were ashamed to go to the clinic, and are likely to be suffering in silence without treatment. \\nThe Borno State Emergency Management Agency (SEMA) has direct responsibility for distributing aid, including food, medicine, clothes, and bedding, as well as managing the camps. Its national counterpart, the National Emergency Management Agency (NEMA), supplies raw food and other materials for internally displaced people to the state agency under a memorandum of understanding. \\nAid workers have warned since early 2016 that displaced women have been forced to exchange sex for basic necessities and that various elements, including members of the security forces in northeast Nigeria, have been subjecting some of them to sexual and gender-based violence. A Rapid Protection Assessment Report published in May by the Borno State Protection Sector Working Group, made up of national and international aid providers, identified sexual exploitation, rape, and other sexual abuse as major concerns in nearly all 13 camps and several local communities hosting displaced people in and around Maiduguri. \\nFollowing his visit to Nigeria in August, the United Nations special rapporteur on the human rights of internally displaced persons, Chaloka Beyani , said Nigeria’s government had “a tendency to downplay the problem of sexual violence and abuse” of internally displaced people. He expressed concern that this tendency “constitutes a hidden crisis of abuse with fear, stigma and cultural factors as well as impunity for perpetrators leading to under-reporting of abuse to the relevant authorities.” \\nHuman Rights Watch wrote to several Nigerian authorities in August requesting comment on the research findings. The minister of women affairs and social development, Senator Aisha Jumai Alhassan, promised in a meeting with Human Rights Watch on September 5 to investigate the allegations and then respond. Her response has not yet been received at time of writing. \\n“Failure to respond to these widely reported abuses amounts to severe negligence or worse by Nigerian authorities,” Segun said. “Authorities should provide adequate aid in the camps, ensure freedom of movement for all displaced people, safe and confidential health care for survivors, and punish the abusers.” \\nVictims’ Accounts \\nMovement Restrictions, Food Shortages Fuel Sexual Abuse Most of the victims interviewed lived in camps for displaced people. While victims living at the Arabic Teachers’ Village camp said they were allowed to leave the camp for about eight hours daily, victims from other camps said that their movement was severely restricted. The women and girls became victims of rape and sexual exploitation when they accepted offers of friendship or marriage from men in positions of authority. \\nRape A 16-year-old girl who fled a brutal Boko Haram attack on Baga, near the shores of Lake Chad, northern Borno in January 2015, said she was drugged and raped in May 2015 by a vigilante group member in charge of distributing aid in the camp: \\nHe knew my parents were dead, because he is also from Baga. He would bring me food items like rice and spaghetti so I believed he really wanted to marry me. But he was also asking me for sex. I always told him I was too small [young]. The day he raped me, he offered me a drink in a cup. As soon as I drank it, I slept off. It was in his camp room. \\nI knew something was wrong when I woke up. I was in pain, and blood was coming out of my private part. I felt weak and could not walk well. I did not tell anyone because I was afraid. When my menstrual period did not come, I knew I was pregnant and just wanted to die to join my dead mother. I was too ashamed to even go to the clinic for pregnancy care. I am so young! The man ran away from the camp when he heard I delivered a baby six months ago. I just feel sorry for the baby because I have no food or love to give him. I think he might die. \\nAn 18-year-old girl from Kukawa, a Borno town 112 miles from Maiduguri, the state capital, said that a member of Civilian Joint Task Force – a self-defense vigilante group working with government forces in their fight against Boko Haram – initially gave her privileges, including passes that allowed her to leave the camp, but then raped her: \\nThe man started with preaching, telling me to be a good Muslim girl and not to join bad groups in the camp. He then sent his mother to propose to me, which convinced me that he was serious. He allowed me to go outside the camp when necessary. When he asked me to visit his newly allocated room in the camp, I didn’t see any reason not to go because I felt safe with him. He gave me a bottle of Zobo [locally brewed non-alcoholic drink] and I immediately felt dizzy and slept off. I don’t know what happened thereafter but when I woke up he was gone and I was in pain and felt wet between my legs. For three days I could not walk properly. \\nSome weeks later I fell very ill, and was told at the hospital that I was pregnant. Then everyone turned away from me: [He] refused to help me, and my step-mother who I lived with in camp pushed me out, saying I was a disgrace. I reported [him] to the police in camp several times but they have not done anything to him because they work together. Whenever I see him, I wish something terrible will happen to him. It is because of him that I have lost everything. I don’t even think the baby will last because she is always crying and I can’t cope. I pray that God will forgive me for neglecting the baby but I am helpless. \\nSexual Exploitation A 30-year-old woman from Walassa, near Bama, about 43 miles west of Maiduguri, said that she fled into a nearby wooded area after Boko Haram fighters killed her husband and abducted her daughters, ages 12 and 9. She stayed there for three months, hoping to find a way to rescue her daughters, until Nigerian government soldiers arrived in the area and the fighters escaped with their captives: \\nA few weeks after soldiers transported us to the camp, near Maiduguri, one of the soldiers guarding us approached me for marriage. He used to bring food and clothes for me and my remaining four children, so I allowed him to have sex with me. He is a Hausa man from Gwoza. That is all I know about him. Two months later he just stopped coming. Then I realized I was pregnant. I feel so angry with him for deceiving me. When he was pretending to woo me he used to provide for me, but as soon as I agreed and we began having sex, his gifts began to reduce until he abandoned me. Now my situation is worse as the pregnancy makes me sick, and I have no one to help me care for my children. \\nA woman from Bama living at the same camp said: \\nThe soldier showed his interest by bringing me food and clothes. He used to wear the green army uniform and carried a gun. I accepted him because I needed help to take care of me and my four children. Feeding in the camp is only once a day so you have to accept any help that comes. We started having sex in my camp tent – my sister who was sharing it with me left – or at night in the open field where soldiers stay in the camp. Five months later when I realized I was pregnant and told him, he stopped coming. I have not seen him since then. I feel so ashamed because my neighbors talk and stare at me. I cry whenever I think about him. I delivered the baby two months ago but he is also suffering – I eat once a day so [am] not producing enough milk to breast feed him well. Things are so bad in the camp, there is not enough water or food. \\nAn 18-year old girl from Baga said when she met a member of the Civilian Joint Task Force in the camp, she felt she could trust him because he is also from Baga: \\nHe took me from the camp to a house on Baga Road so we could meet freely. I stayed with him in that house for about one month. Then I fell ill, and went to a clinic. The people at the clinic asked for the person I was living with, and invited him. That was when they told him I was pregnant, and he accepted the pregnancy. But immediately [when] we came out of the clinic he took me to a man to abort the pregnancy. I refused and he said if I would not abort we should separate. Then I moved to the camp. I gave birth almost a year ago but the man has refused to take responsibility. Some months ago he followed the military to catch Boko Haram far from Maiduguri. Even when he visits his two wives in the camp he never asks for me and my baby. I go outside the camp to beg so that we can survive. \\nA 25-year-old woman at from Dikwa said that when she fled Boko Haram’s attack on the town, she lived with her brother in a rented apartment in Maiduguri. When he was no longer able to feed her and her three children, he took her to the camp where he handed her over to camp elders. One of these elders, a local government employee – who are often financially better off than most displaced people because they receive salaries – proposed marriage and regularly brought her food and money. But the marriage did not materialize, and he began to shun her when she became pregnant. He continued to ignore her when she delivered twins and asked him for money to pay for her midwife. The woman said: \\nIf I have a gun, I will shoot him. It is because of him that people call me and my babies names. I am so ashamed that I cannot participate in camp activities and keep to myself because of the jeers. \\nA 17-year-old girl said that a young man she knew took her home to his grandmother when she arrived Maiduguri from Dikwa in mid-2014: \\nHe told me he wanted to marry me, and his grandmother referred to me as her grandson’s wife. I lived with them, cooking and cleaning the house, until a month later when he disappeared for weeks. The grandmother asked me to leave, promising to come to the wedding… It was a lie. I did not know it but I was already pregnant. Maybe she already saw the pregnancy signs and I was too young to understand. I heard the grandson fled the town because he heard I have given birth. Now I have been left alone to fend for the baby. I don’t know if any other member of my family survived the Boko Haram attack on Dikwa. \\nRestricted Movement A 32-year-old woman from the Damasak said: \\nLife is terrible here in this camp. For the past three days we have not eaten because there is no firewood to cook the food. To make it worse, they will not even allow us to go out to fend for ourselves. Most times you have to beg the camp officials to intervene with the guards before they will give you the pass to go out. Why will you refuse if any of those people ask you for marriage? You have to survive. \\nAnother camp resident, a 47-year-old mother of eight from Abadam, a northern Borno town, said: \\nWe used to get food at least twice a day when I first arrived at the camp in 2014. But now, sometimes we get nothing at all. We can’t even buy food ourselves because they will not let us go out. My relatives in the town have to plead with camp officials for hours before the officials will agree to let them give us some money or foodstuff from the little they have. \\nA 20-year-old widowed mother of one at a camp for displaced people said: \\nI have been refusing marriage proposals from the men in camp because I see how they are deceiving others. I am just not sure how long I can remain in this situation. The last time I ate was four days ago when the one cup of maize I was given finished. I am suffering because I have no husband or anyone else to assist me. \\nA 16-year-old single mother of one in the same camp said: \\nLife is difficult in the camp, hardly enough to eat. There is food but whoever gets it, gets it. We are not allowed to go out to find work or get extra food. Sometimes I go to the kitchen to scrape pots to get something to eat. They distribute tickets, some get tickets and some don’t get. If you don’t get a ticket you get no food. The IDP elders distribute the tickets, so they distribute amongst themselves, they make sure their families get first. Usually distribution of tickets take place at odd times such as at midnight. \\nIf you are not married, you hardly get anything that comes in. Women who have husbands insult us: “If you want to eat in [this camp], you should get married in [the camp] so husbands can get food for you.” \\nMilitary Screening Centers Displaced women from several communities re-captured from Boko Haram by the Nigerian army, including Baga, Bama, and Gwoza, told Human Rights Watch in Maiduguri that the Nigerian military operated screening centers where they interrogated local people to determine how much involvement they had with militants. While some women are screened in a few days, others are interrogated daily for months before being released to a camp. Witnesses said the interviewees were separated by gender, but that male soldiers interrogated everyone. \\nA woman who escaped her Boko Haram abductors in Sambisa with her three children while four months pregnant described their reception after an eight-hour trek back to her home town of Bama, then under government control: \\nSoldiers were already back in Bama when we arrived. They took us to a primary healthcare center near the entrance into Bama to search and question us. We thought they would soon let us go, but they locked us with other women (about 20 people) for more than three months. They bring us out one by one every day to ask whether we joined Boko Haram freely or they forced us. Many of us were naked or in rags until about one month later soldiers took us to town to search for clothes among the burnt ruins of houses in the town. I was very ill because of the pregnancy. After the third month passed they drove us in lorries to Maiduguri, and dropped off sick ones like me in the hospital. \\nA 20-year-old woman who was abducted in Gwoza by Boko Haram, and then escaped, said: \\nI was three months pregnant from the Boko Haram fighter that raped me when I escaped Gwoza with my three children. Our relief on arriving at Maiduguri after a two-day trek was crushed when soldiers arrested us. They took us to Giwa barracks, where we saw up to 300 other women and children. Soldiers used to question us every day until my children and I were released four months later. \\nThere appears to be at least one other screening center around Maiduguri, Human Rights Watch found. A 17-year-old girl from Dikwa was held in a place she described as “a compound with about five buildings just before you enter Maiduguri proper.” She was allowed to receive visitors for the month she was there before being cleared by the military to enter Maiduguri. \\nLack of Mental Health Support for Victims Many of the women and girls interviewed said that their experiences affected their psychological well-being. Some said they had difficulty sleeping, and deliberately isolated themselves to avoid insults and slurs. Many also said they felt constantly angry with their abusers, wishing they could harm them in retaliation. None said they had professional counselling. \\nA 30-year-old woman from Gwoza said: \\nI feel sad all the time. I am always thinking about all the bad things that have happened to me. Sometimes I cry; at other times I try to resign to my fate. But it is hard. My neighbors in the camp encourage me to pray. That is all I can do, pray. \\nA 16-year-old rape survivor said she was always thinking about death, and wished she had the courage to kill herself: \\nNobody comes to this camp to talk to us. We IDPs only have one another, but even that is hard because you do not know who to trust. If you tell them your secret pain or shame, they can use it to mock you later. \\nA 28-year-old woman who survived rape and became pregnant by a Boko Haram insurgent said she developed hypertension from constantly thinking about her ordeal and imagining ways she could take revenge on him. Doctors have told her during hospital visits outside the camp to stop thinking about the past so she can get better. She was not referred to a counselor. \\nThis report was released by Human Rights Watch. Be Sociable, Share!'"}, "time": 1742562653.5071383}