{"duration": 0.15291094779968262, "input_args": {"text": "'\\nLook at what is happening now across the European continent! Europe is being occupied by invading hoards of millions of Muslims as we speak, demanding more mosques to be built with state money (tax payer money), chanting Allahu Akbar in the streets, teaching Muslim prayers in schools, banning Christmas street lights and more!\\nSome of these migrants even took it to a step further, now posing as “children”. Some stupid Europeans actually believe them and adopted them as their own children. 20-30 even up to 40 year old men! Imagine adopting a 30 year old man as your “child”…\\nDespite having nationalist political parties surging across the continent, there has been no major victory!!! The nationalists do NOT own a single country in Europe! France is still under socialist Hollande, Austria, Netherlands, Italy, Greece everyone is still under socialist/liberal leadership.\\nDespite having the UK historically exiting the EU with their famous Brexit vote, the UK is still under “principled conservative” leadership, you know that conservatism similar to Paul Ryan (open borders). The country fell on Theresa May’s hands after Boris Johnson who helped Nigel Farage make Brexit happen cucked-out and refused to take the leadership. Theresa May is super similar to David Cameron, the former Prime Minister who resigned after Brexit. Both David and Theresa are like Jeb! Bush or Paul Ryan clones. Same “principled conservative” rhetoric but with open borders.\\nEurope is basically lost and no one can do anything about it at this point. Even a classic revolution is impossible at this point. There’s no spirit, we don’t have a strong leader here in Europe like they do in America, with Donald Trump, our European nationalist leaders are all weak, soft cucks. The people are too materialistic, they chase money, music, movies, games like nothing else matters.\\nHere’s the average European daily conversation in BOTH West AND East Europe: “Look at my new car! Do you like it?? You wanker, who cares about Muslim immigration, check out my new Iphone 7! And have you heard that new Beyonce song which tells whites to fuck themselves? Wow its so awesome! By the way I’m going to Ibiza next week! Bloody hell mate, let’s play my new FIFA 17 PS4 game before you go, it has awesome graphics mate! It’s better than PES 17!!!” This is no exaggeration and this is exactly how European people behave these days. All Europeans, UK, France, Spain, Sweden, Germany, Denmark, Poland, Italy, Austria, Ukraine, Romania, Bulgaria, Greece, Hungary, even Russia, EVERYONE! Total cuckoldry!\\nSome people like to think that East Europe is somewhat purer and holier than the West but it’s not anymore. Especially Americans have this idea that Eastern Europe is not as tainted as the West. Its the same thing, the eternal chase of entertainment.\\nThe question is what’s next? How would Christians survive as minorities among these peaceful people? Perhaps we should pack our bags and start a new white flight to Russia. As long as Putin is in power we know he is gonna protect the rights of European Christian people and ensure their survival. Lets hope and pray he would allow us to invade his country. While Russia is no different in those terms, at least they have a leader who watches over them and protects them while they have fun. Another option would be to pack our bags and move to America if Trump wins and IF Trump would allow us to go there…. because we do know he’s very anti-immigration. Should Hillary “win” (steal the election) may God help us all because WW3 is upon us.\\nSo here’s a bunch of new Muslim challenges Europe is now facing:\\nGERMANY – Children Forced to learn Muslim prayers and shout Allahu Akbar \\n\\nPupils at a primary school were forced to chant “Allahu Akhbar” and “there is no God but Allah”, an appalled father has claimed.\\nThe father of the pupil at the girl’s primary school in German ski resort Garmisch-Partenkirchen discovered that his daughter had been forced to learn the Islamic prayer when he discovered a handout she had been given.\\nHe claimed she had been “forced” by teachers to memorise the Islamic chants and forwarded the handout to Austrian news service unsertirol24.\\nThe handout read: “Oh Allah, how perfect you are and praise be to you. Blessed is your name, and exalted is your majesty. There is no God but you.”\\nIt had been given to the girl during a lesson in “ethics” at the Bavarian school.\\nITALY – Thousands of Muslims Pray in the Streets of Rome near Colosseum, Shout Allahu Akbar, Demand more Mosques \\n\\nThousands of Muslims gathered in protest outside Rome’s Colosseum Friday after Italian authorities shut down a number of so-called “garage mosques” to avoid young people becoming radicalized.\\nThe Muslim community of Rome chose the iconic Colosseum, a worldwide symbol of Christian persecution and martyrdom, to stage their demonstration against the alleged shutting down by police of illegal places of Muslim worship in the city.\\nMany Roman citizens were visibly disturbed by the protest, noting that in its propaganda videos, the Islamic State has repeatedly employed images of the Colosseum when threatening to conquer Rome and the “Crusaders.”\\nTwo months ago, Italian police set up a high-security perimeter around the Colosseum, after the Islamic State issued a new threat to “conquer” Rome in its latest video.\\nUNITED KINGDOM – British press wants more 40-year-old migrant “children” posing as 16-year-old \\n\\nWon’t you take pity on this poor, innocent little child?\\nThis image of a “16-year-old” migrant crying – which is currently plastered on the front page of The Guardian – is nothing short of laughable.\\n“A 16-year-old from Ethiopia cries while he awaits registration at a processing centre in the makeshift refugee camp near Calais,” the photo’s caption reads. The image is placed under a headline reading: “Councils resist pressure to take children from Calais.”\\nThe “child migrant” is clearly in his 40’s, yet their editors evidently believe their readers are so incredibly stupid they’ll actually believe they’re looking at a 16-year-old boy.\\nThis comes amid a recent report where grown men pose as children in the UK , get adopted by British families then threaten to “love” them in exchange for their care. Some were even caught drawing ISIS flags on 1st grade coloring books.\\nSWEDEN – Christmas Street Lights BANNED to Avoid Offending Muslim Migrants \\n\\nTowns across Sweden have banned Christmas street lights in the name of “security,” but the real reason is almost certainly because the country has completely capitulated to Islam after importing countless Muslim migrants over the last two years.\\nAccording to an SVT report, The Swedish Transport Administration (Trafikverket) will not allow municipalities to erect Christmas street lights on light poles that the authority manages, meaning that many towns will have no festival lights at all on major streets.\\nDespite there being no safety issue with the street lights for decades, this new rule has been instituted right after record numbers of Muslim migrants flooded into the country – just a coincidence I’m sure.\\nIn reality, the Christmas lights ban is almost certainly an effort to avoid offending Muslim migrants who are causing chaos in cities like Malmo, where the firebombing of cars and businesses in or near Muslim ghetto ‘no-go areas’ is becoming a routine occurrence.\\n'"}, "time": 1742561753.9283316}