{"duration": 0.08478116989135742, "input_args": {"text": "'Muere un informático al caerse de la nube POR SUERTE, EN LA NUBE HAY UNA COPIA DE SEGURIDAD DEL FALLECIDO ordenadores \\nUn informático ha muerto tras precipitarse de la nube. La tragedia se produjo esta mañana mientras la víctima se encontraba navegando por el ciberespacio. Según los testigos, el informático se tropezó con un archivo mal adjuntado y, aunque trató de agarrarse a una barra de herramientas, acabó dándose en el suelo con todo el disco duro. \\nLos expertos en seguridad cibernética advierten de los peligros del WiFi a la hora de subir a hacer trabajos de mantenimiento. “Es importante subir con cable, el operario perdió el dominio de la situación y en un nanosegundo la nube ya lo estaba descargando”, declaran. A pesar de los intentos que se hicieron para reiniciarlo, su sistema operativo ya había dejado de funcionar. “Le hicieron un escáner pero había perdido al menos 50 gigas de memoria”, continúan los especialistas. “Tenía toda la base de datos esparcida por el suelo”, añaden. \\nLos familiares del fallecido todavía no sé explican qué ha podido pasar: “Tenía mucha caché, no sabemos cómo se ha podido caer”, lamentan. La autopsia ha descartado que la víctima consumiera LCD o cualquier otra sustancia que le restara reflejos. Afortunadamente, los parientes tenían guardada una copia de seguridad y confían en poder recuperarlo. “Con el golpe se quedó comprimido como un zip, pero creemos que se podrá extraer entero”, aseguran. \\nLa lluvia de informáticos que caen de la nube preocupa mucho a las autoridades y los gobiernos ya trabajan juntos para acabar con esta lacra. “Pondremos otra red debajo de la nube, esta vez más grande y consistente. Así reforzaremos la seguridad y evitaremos muchas muertes”, explicaron en el último Mobile World Congress.'"}, "time": 1742563307.869475}