{"duration": 0.14278936386108398, "input_args": {"text": "'It’s an understatement to say Tesla Motors’ proposed $2. 6 billion takeover of SolarCity has been the most reviled deal of the year. Corporate governance experts are up in arms, because Tesla’s visionary founder, the entrepreneur Elon Musk, also founded SolarCity and is the largest shareholder in both companies. SolarCity’s chief executive is Mr. Musk’s cousin. There are overlapping directors. Critics called it blatant   and accused Mr. Musk of using valuable Tesla shares to bail out a struggling SolarCity. James S. Chanos  —   an investor who, it should be noted, is betting against both stocks  —   called it a “shameful example of corporate governance at its worst. ” But what if the critics are wrong? Many auto industry experts also said the idea of combining Tesla, an   manufacturer, with SolarCity, which makes solar energy panels, makes no strategic sense. Even if energy generation, storage and an auto powertrain are a seamless product,   vertical integration, in which one manufacturer makes all the components, was the old Henry Ford model and later, General Motors’. That approach has gone down in automotive history as a colossal failure. Adam Jonas, the influential auto industry analyst at Morgan Stanley, slashed his price target for Tesla and wrote in a note to clients that potential rewards would not adequately compensate investors for the greater risks and cash flow drain. Expanding into a   business like solar energy exposes Tesla to “untested cost, competitive and regulatory forces,” he warned. Perhaps the harshest verdict came from the market itself: Tesla shares dropped more than 10 percent the day the deal was announced. It did not help Tesla’s cause that a driver using its autopilot feature was killed in May, the first fatality of its kind. That news surfaced just after Mr. Musk made his offer. Mr. Musk “went overnight from being a genius to an idiot,” said Joseph Dennison, portfolio manager at Zevenbergen Capital Investments, a large Tesla shareholder. Largely overlooked in the din, however, is that few, if any, of Tesla’s harshest critics are Tesla’s current shareholders. And they are the only ones who truly matter, because they’ll have a vote on the deal and it’s their money on the line. Tesla’s four biggest shareholders after Mr. Musk are mutual fund managers, including the industry giants Fidelity, Vanguard and T. Rowe Price. None have announced how they’ll vote, but they have a history of supporting management generally, and specifically Mr. Musk. Even before the deal was announced, a Fidelity portfolio manager, Gavin Baker, told investors, “We are fans not just of Tesla products but of the concepts underpinning the firm and potential future partnerships ahead of it. ” Ronald Baron, founder of Baron Capital, which owns 1. 5 million Tesla shares, said his initial reaction was, “Why on earth would anyone want to do this? Can’t you buy these panels much cheaper in China?” He said he had looked into investing in SolarCity several times, and each time decided to pass (a wise decision considering that SolarCity shares have fallen more than 50 percent this year.) But after further research and discussions with Tesla management, Mr. Baron told me his concerns had been largely assuaged. “Until I read the proxy, I can’t tell you how I’m going to vote,” he said. “But the more we researched this, the more sense it made to combine Tesla with solar panels. We believe they can make better products, make them more efficiently, and realize tremendous savings by selling the two products together. ” Other investors have also been reconsidering the merits of the deal. Tesla shares have more than recovered what they lost after the deal was announced. And investors brushed off an announcement on Wednesday of    quarterly losses, focusing instead on higher vehicle production and new orders. Tesla tried to do its best to allay concerns about Mr. Musk’s conflict of interest. Mr. Musk will not vote, nor will other insiders who own shares in both companies, a step that was not mandated by law. Tesla maintains that various committees of directors that it says are independent vigorously negotiated terms of the deal, and that Mr. Musk did not know the price before it was agreed on. When the deal became final on Monday, the price was slightly lower than that announced in June, suggesting some genuine haggling went on. But realistically, Mr. Musk’s dominant role in both companies means that “it’s an intractable problem,” said Charles M. Elson, an expert in corporate governance at the University of Delaware. “There’s no way to resolve this. The only way would be not to do it. ” Tesla says that would elevate corporate governance purity at the expense of common sense. “We’ve tried to take every appropriate step” to minimize the conflict issues, Todd A. Maron, Tesla’s general counsel, told me this week. “But if there are synergies, which there are, and we can make the best product under one company’s ownership, and we can persuade the independent shareholders to support the deal, there shouldn’t be a strict prohibition just because someone is on both sides. ” Mr. Dennison of Zevenbergen Capital said that focusing on conflicts “is missing the bigger picture. ” “To make these future products as good, integrated and efficient as possible,” he added, “you need the two companies working together. ” He said his firm had not announced how it would vote, but he has typically sided with management. As for making its own batteries and solar panels and being vertically integrated, Tesla maintains it had little choice. “Tesla does not believe in vertical integration as an objective in and of itself,” Mr. Maron said, but “goes down that path because there’s no better option. ” Tesla has said its planned auto production volume would consume “today’s entire worldwide production of lithium ion batteries. ” Given Tesla’s   vision and strategy, the deal should not have come as any great surprise. Mr. Musk talked about solar power in his “master plan” 10 years ago, and last month he elaborated in his “master plan, part deux. ” “Create a smoothly integrated and beautiful     product that just works, empowering the individual as their own utility, and then scale that throughout the world,” he said. “We can’t do this well if Tesla and SolarCity are different companies, which is why we need to combine and break down the barriers inherent to being separate companies. ” Admittedly, that’s a   vision that has little to do with the latest quarterly earnings. If Tesla owners were plugging their cars into outlets with electricity from   power plants, there would not be much sustainability to get excited about. “Musk’s vision from Day 1 10 years ago was to accelerate sustainable energy, “ said Mr. Dennison. “That’s a much bigger vision than building cars. ” And vision is what Tesla’s shareholders are buying into, just as Amazon investors put their faith in Jeff Bezos. That’s why, for all the controversy, the SolarCity deal will almost surely be approved by Tesla shareholders. “If you’re investing in a Musk business, you’re investing in something that hasn’t happened yet, so it’s risky,” said Mr. Baron. “But I love the guy. He’s totally focused. He’s already accomplished what people said could never be done. ” Mr. Dennison agreed. “You’re investing in the people who make and execute decisions,” he said. “This is obviously tied to a bigger picture and a   road map than most. But Tesla management has executed on all the goals they’ve laid out. I’d say this is an investment based on faith, but not blind faith. ”'"}, "time": 1742562239.9387376}