{"duration": 0.02625751495361328, "input_args": {"text": "'Former Alaska Gov. Sarah Palin condemned comedian Kathy Griffin for photographing herself holding up President Donald Trump’s severed head on Tuesday, saying Griffin is “sick. ”[“No one should be shocked at the sick audacity of sick characters. Kathy is a hurting individual. She needs help,” Palin told Breitbart News. “Can you imagine if the subject of such an outrageous visual was a liberal? Obviously, media would be unhinged and uncontained in response. ”  Griffin told a   blogger she had herself photographed holding the president’s   and severed head because she was upset about comments he made during the GOP primary season. “She said they were putting together a Trump mask and that led her to think of Trump’s infamous statement early on in the primary,” blogger Yashar Ali tweeted Tuesday. “The ‘blood coming out of her eyes, blood coming out of her ears, blood coming out of her wherever’ statement. ” After the attempted assassination of Arizona Democratic Rep. Gabrielle Giffords in 2011 in a shooting that left six dead, the Left launched a   assault on Palin, trying to blame her for “inspiring” the severely   shooter’s actions.  A political action committee supporting Palin had released a Facebook graphic displaying crosshairs on congressional districts where Tea Party candidates could compete in the 2010 midterm elections. “We never imagined, it never occurred to us that anybody would consider it violent. We never ever, ever intended it to be gun sights,” SarahPac spokeswoman Rebecca Mansour, now senior West Coast editor at Breitbart News, told ABC News at the time. Palin blasted the media and the Left for trying to smear her as an enabler of a  . “If you don’t like a person’s vision for the country, you’re free to debate that vision. If you don’t like their ideas, you’re free to propose better ideas. But, especially within hours of a tragedy unfolding, journalists and pundits should not manufacture a blood libel that serves only to incite the very hatred and violence they purport to condemn. That is reprehensible,” Palin said. Despite further Democratic backlash against Palin’s use of the term “blood libel,”   Law Professor Alan Dershowitz said Palin’s comments were not at all “improper. ” “There is nothing improper and certainly nothing   in Sarah Palin using the term [blood libel] to characterize what she reasonably believes are false accusations that her words or images may have caused a mentally disturbed individual to kill and maim,” Dershowitz told Breitbart News’ Big Government. “The fact that two of the victims are Jewish is utterly irrelevant to the propriety of using this   term. ” Griffin said she does “not condone” violence Tuesday while joking about displaying the president’s severed, bloodied head. “I caption this ‘there was blood coming out of his eyes, blood coming out of his  …     wherever’ Also @tylershields great   maker,” Griffin tweeted Tuesday.'"}, "time": 1742628545.693105}