{"duration": 0.04822087287902832, "input_args": {"text": "'Posted on October 27, 2016 by Baxter Dmitry in News , US // 0 Comments \\nMalik Obama has had enough of his younger brother Barack’s presidency and is terrified of the prospect of Hillary Clinton succeeding him in the White House. \\nBorn and raised in Kenya, Malik Obama moved to the Washington D.C. area in the 1980s and became a naturalized U.S. citizen. He is enrolled to vote in Maryland and he will be casting his ballot for Trump. \\n“Now that my brother’s term is ending I can be open about it: I support Donald J. Trump for President. #MAGA #MAGA3X #Africans4Trump,” he says on his Twitter page. \\nA Muslim who spends a lot of time in Africa, Malik has between 3 and 12 wives – he won’t say how many exactly – and clearly doesn’t adhere to traditional American values, however you define them. But even he is disappointed with the job his brother has done leading the country. \\nPhotographs exist of Malik celebrating wildly after his brother won the 2008 election, but since then his views have changed. Malik dreads the thought of Hillary Clinton succeeding his brother in the Oval Office, and describes Trump’s proposed shut down on Muslims entering the United States as “ common sense .” Trump is for the people. Hillary is for the money \\n— Malik Obama (@ObamaMalik) October 26, 2016 \\nMalik Obama says he is voting Trump because he has learned that career politicians cannot be trusted to enrich anybody but themselves, and he respects the Republican nominee’s honesty. He also blames his brother and Hillary Clinton for the death of Libya’s Moammar Gaddafi, who Malik describes as “ one of my best friends .” \\nMalik blasted Clinton’s performance as secretary of state for creating chaos and violence in the Mideast. “ Check out the situation in Libya now ,” he said. Malik Obama, older half brother of the US President pictured with the late Colonel Gaddafi of Libya. \\nMalik Obama might not receive regular phone calls from his younger brother anymore, but Trump called him and invited him to attend the third presidential debate in Las Vegas. \\n“ I’m excited to be at the debate. Trump can make America great again ,” Malik told The Post. \\n“ I look very much forward to meeting and being with Malik ,” Trump said in return. “ He gets it far better than his brother. ” \\nMalik agrees with Trump that the mainstream media is corrupt and biased, and he dismisses the women who claim Trump kissed or groped them against their wishes. \\n“ I don’t believe them ,” Malik said. “ Why didn’t they come forward before? ” \\nThe Obama surname means “ bent over ” or “ limping ” in the Kenyan Luo language of their tribe – fittingly, as Malik believes his brother’s presidency got off to a good start but is now limping over the line. And in his opinion, if America is to become great again, the baton must not be passed to Hillary Clinton.'"}, "time": 1742562690.7467353}