{"duration": 0.10543966293334961, "input_args": {"text": "'PESCARA DEL TRONTO, Italy  —   Mostly there was silence, virtually the only sound being that of a river flowing peacefully down the mountain that swallowed this tiny hamlet when an earthquake struck early Wednesday. On Thursday, some of the nearly 130 people who once lived here returned, accompanied by firefighters, to try to retrieve a few belongings and mementos of a life that was obliterated in a few violent seconds of shaking. “Where was your bedroom?” a young fireman asked a couple from under his yellow helmet. “It was where you see that white closet,” the woman answered, indicating a few shelves without doors hanging open, over the hill. The sidewall of their   house collapsed down the slope, offering a glimpse of the intimacy of their lives. Italian officials now say that at least 267 people were killed in the mountain towns along the fault that erupted. But for the smallest of those places, like this one, the damage will be tallied not only in terms of the lost lives of family, friends and neighbors, but quite possibly the elimination of the towns themselves. Pescara del Tronto is gone. Perhaps five houses are left standing. And whether the place can ever be restored to the map seems an open question. The village is administratively part of the only slightly larger town of Arquata del Tronto, where 46 people are so far counted among the dead. For these largely isolated, hilltop towns in a rural region where the economy was already in decline, and where most of the permanent residents were already aging, the earthquake may be a coup de grâce, its own death knell. “It will be difficult for people to move back into Pescara del Tronto,” Michele Franchi, vice mayor of Arquata del Tronto, said, speaking from the camp near the main town, where half the tower pinnacles collapsed. “We should even wonder whether it’s wise to rebuild it right there, considering that it almost entirely came down. ” “But we need to move people out of tents quickly,” he added. “They need to see a chance for life here to restart, where possible. ” Of the 300 who were in the village when the quake struck, many were people who kept weekend houses to take a break from Rome, about 95 miles away. “I spent my life here,” said Enza, 52, an employee from Rome whose family home has been here for decades. “We are lucky because our house did not collapse. My mom, dad and brother left safely. But our entire lives are gone  —   so many friends, so many neighbors are no longer. How can we go back?” Enza was in no spirit to provide her full name. Residents do not feel like talking in Pescara del Tronto. The police and rescue officials escorted the few residents who had the courage to come back the day after the tragedy, in silence. Enza came back to recover her elderly parents’ medical devices and some clothes, so that they could feel somewhat less lost, she said. She was in Pescara del Tronto last weekend and went back to her work in Rome on Monday. Her brother took their parents safely into the street on Wednesday morning after the quake. The villages hit by the quake in the Marche region are along the ancient Roman road, the Via Salaria, that leads from Rome to the Adriatic Sea. Along this stretch of road, surrounded by green woods and high rocks, are now only cranes, tents and firefighters’ jeeps and trucks. Officers assigned to different points of the road discouraged travelers from taking it. Pescara del Tronto has been a summer or weekend destination, but many travelers were not strictly tourists. “This place was home to me and to so many others,” Enza said, breaking up in tears. “Not just the physical place  —   we all knew each other, so we all lost many, many members of our extended family. ” Enza said that, beyond the pain for lost friends and acquaintances, the worst part now was already the creeping nostalgia for a place that may have died with so many of its residents. “There used to be a stone step where we always sat down,” she said, pointing to a spot now buried under collapsed beams, roofs and stone bricks. “Our memories are completely erased. ” An ambulance passed by at full speed, sirens on, in the only narrow street leading into the town. Maybe one of her friends will become famous for being the last survivor taken out of the rubbles in Pescara del Tronto, Enza hoped. “You know, the worst is that this quake did not only take our future, but also took our past,” she said.'"}, "time": 1742563696.7229226}