{"duration": 0.010359525680541992, "input_args": {"text": "'Topics: Hillary Clinton , Donald Trump , 2016 Presidential Election , Brexit , FBI Director Comey Sunday, 13 November 2016 \\nDespite the continuing wailing and tears and gnashing of teeth from angry Hillary supporters, the Trump Party is officially the winner of the 2016 presidential election. \\nForemost now in all the post-election sound and fury is the new United States of Amurkier, according to analyst Dmitri Globulus, of the website Times Die Hard. \\nHillary and the Clintonistas are lining up all the culprits for the defeat--since that obviously had nothing to do with Hillary Clinton herself--starting with FBI Director James Comey. \\nIt wasn\\'t her politics of more of the same, including beefing up wars in the middle east, continuing the policies of Obama, and renewing hostility with Russia. \\nNo, it was Comey. \\nComey was very nasty in announcing new emails had been discovered in Anthony Weiner\\'s computer, which tipped the balance. \\nIf only he had kept his mouth shut, according to the Clinton DieHards, she would have prevailed. \\nHer failure to talk Amurexit had nothing to do with it, whereas Trump continually signaled \"The System is Rigged!\" \\nBut Dmitri Globulus says Trump was on target, not Clinton. \\n\"It\\'s basically a grapes of wrath syndrome. Too much imbalance in wealth distribution, severe economic depression, and Government Pretense of a \\'recovery\\' that fooled nobody.\" \\nAdd in free trade ideas and shipping jobs to the cheapest labor markets in the world leaving ordinary citizens out of work and you\\'ve got a lot of anger. \\nAdd in Obamacare with its premiums going up and the Pharmaceutical Industry leaping up its profit margins--more anger. \\nAdd in stupid wars with the only logic behind them making money for the munitions people and The War Establishment--more anger. \\nAdd in refugees fleeing somewhere, anywhere, with their countries either blasted economically or from continuing, monstrous war--more anger. \\nAdd in Washington-As-Usual with its talking heads and scoffing and labeling its opposition ignorant and stupid--more anger. \\nThe Brexit people across the Atlantic are calling out: \"Welcome to the Club! We\\'re done with the Plutocrat Trans-nationalists!\" \\nMany Amurkier people have responded: \"So are we! Time to change it!\" \\nThe Clintonistas meanwhile continue to enjoy their outrage. Make joseph k winter\\'s day - give this story five thumbs-up (there\\'s no need to register , the thumbs are just down there!)'"}, "time": 1742628527.8531263}