{"duration": 0.08224081993103027, "input_args": {"text": "\"Subscribe \\nSee that wedge of people cheering behind the podium at political rallies? The ones who just so happen to sit nicely within the camera frame? They are always something of a fantasy construct. If a candidate has a problem with women voters, then the podium behind will be packed tightly with women. If some number cruncher decides that Black men would rather vote for someone else, then they too get press-ganged into the formation of a human canvas. A little bit of demographic sleight of hand if you will. \\nIt’s no big deal. They all do it. It’s a talking point, a visual cue for the doubters and a psychological nudge for the undecided. Any Color You Want So Long As It’s White \\nOf course, Republican presidential nominee Donald Trump has a problem with pretty much every non-white male demographic you can think of. And when it comes to Black voters, his poll numbers are so low that misrepresenting his demographic base is all but impossible. No matter how large your crowd is, a statistical zero still leaves you with a chronic shortage of Black people. And that means they cannot be used as props that detract from the massively racist campaign he’s been running. Which must make him sad. \\nTime for plan B. \\nAnd no, that’s not a racially insensitive name or a typo. That’s his name, or at least, that’s the one he is using right now. The Cultist Formerly Known As… \\nYou might have seen Michael before. Back in 2012, during the Republican primary race, Rick Santorum asked him to front his campaign rally. Attendants were treated to an excruciatingly awful jazz set , followed by rabid claims that Democrats are all closet Nazis. He told the crowd : “The Democrats, they’re the worst thing that ever happened to the Black man. They’re the slave masters.” \\nSo, right off the bat, we know we’re dealing with someone who has some legitimate political arguments to make. That’s good to know. \\nThe “Blacks for Trump” placards that wafted in the torrid zephyr sliding past Trump’s rally in Sanford, Florida last Tuesday were hard to miss. The inane grin of a middle-aged white woman, holding one of the signs at arm’s length as if afraid the word ‘black’ might come and get her, was particularly memorable. \\nThe man stood next to her, wearing a T-shirt that read “Republicans Aren’t Racist” was less conspicuous but keen-eyed observers recognized his familiar brand of crazy from past GOP events. It was none other than our man Michael. \\nYou know, the Black Man. Trump’s Cult Following \\nHe wasn’t born with that name of course. Previous names include Maurice Woodside and Michael Symonette while his website lists it as Michel Nicholson. Go figure. \\nAs a former high-ranking member of the Nation of Yahweh — a violent black supremacist organization — he has good reason to keep his true name secret. The cult disintegrated in the 1980s shortly after its leader, Yahweh ben Yahweh , was arrested on conspiracy charges relating to 14 murders committed in Miami. Yahweh was convicted and eventually served 11 years of an 18-year sentence before his death in 2007. \\nMichael has had his share of legal problems too. \\nImplicated, but never convicted of two separate murders, he has since been charged with — though again, never convicted — of four separate felonies since the cult crashed and burned. \\nAnd according to the New Miami Times , Michael still cuts something of a radical figure. They describes him as being : “An anti-gay, anti-liberal preacher with a golden instinct for getting on TV at GOP events.” \\nAnd just like that, all of a sudden, his support for Trump begins to make a lot of sense. \\nWatch Michael’s enthusiasm for fellow nut-job Donald J. Trump: \\nFeatured Image via screenshot from YouTube video \\nAbout Grownmangrumbles \\nI'm a full- time, somewhat unwilling resident of the planet Earth. I studied journalism at Murdoch University in West Australia and moved back to the UK where I taught politics and studied for a PhD. I've written a number of books on political philosophy that are mostly of interest to scholars. I'm also a seasoned travel writer so I get to stay in fancy hotels for free. I have a pet Lizard called Rousseau. We have only the most cursory of respect for one another. Connect\""}, "time": 1742562122.0199866}