{"duration": 0.07935118675231934, "input_args": {"text": "'\\nIf you are an illegal immigrant in America with a criminal record your days are numbered, according to President-elect Donald Trump.\\nFollowing up on his campaign promise to build a security wall on the southern border and deport any undocumented immigrants with criminal records immediately upon taking office, Trump sat down with 60 Minutes on Sunday to reiterate his plans.\\nPresident-elect Donald Trump has said he plans to deport two to three million undocumented immigrants with criminal records from the country immediately – and has insisted that he will build his wall.\\nIn his first extensive interview since he won the White House, Trump is reassuring his supporters that he will deport or incarcerate up to three million ‘gang members’ and ‘drug dealers.’ \\n…\\n‘What we are going to do is get the people that are criminal and have criminal records, gang members, drug dealers, where a lot of these people, probably two million, it could be even three million, we are getting them out of our country or we are going to incarcerate,’ Trump said.\\n‘But we’re getting them out of our country, they’re here illegally.’\\nAs the Commander-In-Chief Trump will have the power to enforce existing immigration laws, which among other things call for the deportation of individuals entering the country illegally. Under the Obama administration millions of immigrants were allowed to enter the country without recourse and Border Patrol agents from Texas to California were told to stand down and do nothing.\\nTrump and others have said that undocumented workers pose a direct threat to the national security of the United States because with current immigration policies, which require no documentation whatsoever, it is impossible to know who is entering our country and from which country they originate. It’s been reported that numerous individuals with ties to terrorism have been apprehended on the border , and that potentially scores of others have already been smuggled into the United States by Mexican drug cartels.\\nThough the President-Elect has promised to either deport or incarcerate millions of illegal immigrants with criminal records, he stopped short of claiming that all undocumented immigrants living in the United States would be deported:\\n‘After the border is secure and after everything gets normalized, we’re going to make a determination on the people that they’re talking about who are terrific people, they’re terrific people but we are gonna make a determination at that ,’ Trump said.\\n‘But before we make that determination…it’s very important, we are going to secure our border.’\\nWatch Trump make his promise to deport criminals in a September 1, 2016 Immigration Speech:\\nDay one, my first hour in office, those people are gone. You can call it ‘deported’ if you want… the press doesn’t like that term… you can call it whatever you want… they’re gone. \\nTheir days have run out in this country… the crime will stop… they’re going to be gone. It will be over. \\n\\nIf you think Anti-Trump protestors have gone off the rails following Hillary’s loss, just wait until Trump starts nationwide mass deportations. \\nWe encourage you to consider the implications of this policy and prepare for widespread violence now , because this could quickly escalate to open warfare on the street of America.\\nRelated: \\nA Step-By-Step Guide To Prepare For Any Disaster \\nIllegal Immigration And Gangs: Someday Our Cities Will Burn Because We Didn’t Protect Our Borders \\nWatch: How Liberals React When Asked to House An Illegal Immigrant Child In Their Homes \\nThis Stunning Chart Shows How Trump’s Border Wall Will Stop Illegal Immigration \\n“This Quickly Escalates Into Open Warfare” – Why The Government Is Preparing For Post-Election Chaos '"}, "time": 1742561787.5191123}