{"duration": 0.047292232513427734, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Hillary Clinton accepted the Democratic presidential nomination tonight, taking American women to a new political peak. She offered a vision of unity, saying, “When any barrier falls in America, for anyone, it clears the way for everyone. When there are no ceilings, the sky’s the limit. ” Her speech directly challenged Donald Trump’s ability to lead. “A man you can bait with a tweet is not a man we can trust with nuclear weapons,” Mrs. Clinton said. Mrs. Clinton was introduced by Chelsea Clinton, who may play a White House role if her mother wins. “I’m voting for a fighter who never, ever gives up,” Ms. Clinton said. _____ 2. Mr. Trump said his call for Russia to hack into Mrs. Clinton’s email was meant as sarcasm. But he also added to his previous praise for Vladimir Putin, saying the Russian president was “a better leader than Obama. ” Above, a short video looking at the history of the   relationship. Mr. Trump’s comments have been criticized by former government officials of both major parties, as well as many foreign policy experts. Some say the security briefings he is now entitled to should be curtailed, while he counters that Mrs. Clinton’s email troubles prove she should not be trusted with the briefings. _____ 3. How is Fox News getting along without its creator, Roger Ailes? Mr. Ailes left under a cloud after a lawsuit accused him of sexual harassment, which then drew corroborating accounts. Nothing looks all that different onscreen in the convention coverage. But when the cameras are off, two people with direct knowledge said, an icy silence descends over the anchor Megyn Kelly, who cooperated with the investigation into Mr. Ailes, and the   Bret Baier and Brit Hume. _____ 4. The   purge being carried out by Turkey’s president, Recep Tayyip Erdogan, has sidelined or jailed half of the country’s top generals and admirals. Some analysts warned of dangerous consequences. “With its main pillar, the military, broken, the Turkish state will no longer be able to check a divided society or effectively counter security threats,” one said. Above, the army’s remaining top officers gathered in Ankara, the capital. _____ 5. U. S. officials say they have new hope against the Islamic State. A trove of more than 10, 000 documents and 4. 5 terabytes of digital data recently seized in northern Syria traces the movements of militants. The information, which is being shared with allies, could help direct battlefield operations and keep plotters from entering Europe. Above, ISIS fighters in 2014. _____ 6. Pope Francis addressed a vast crowd of young people gathered for the Catholic Church’s World Youth Day in Krakow, Poland. Earlier, saying Mass at a revered monastery to commemorate the 1, 050th anniversary of the country’s conversion to Christianity, Francis stumbled and fell, to the consternation of thousands of assembled pilgrims. He rose unharmed. _____ 7. Opposing marches are being held in a mostly white Boston suburb divided by concerns over police shootings and police safety. The galvanizing issue is a “Black Lives Matter” sign hung at City Hall in Somerville, Mass. almost a year ago. The local police are rallying to demand that the mayor, the son of Italian immigrants, put up one saying “All Lives Matter” instead, while counterdemonstrators plan to urge him to keep it. _____ 8. Officials at the Bank of Japan, above, meet Friday to come up with more ways to try to end its country’s long bout with deflation. One option on the table is something economists call helicopter money: dropping money from the sky, to be freely spent. Sadly, that’s just a metaphor. In reality, it means printing more money to pay for government spending on public works, mass distribution of funds to citizens or tax cuts. _____ 9. The weekend is almost here. Got plans? Our movie reviewer says “Jason Bourne,” the fifth installment of the   franchise, may have rote aspects. But he says that tone befits a film that is less a thriller than “a somber meditation on the crisis of the   professional in the throes of middle age. ” And there’s “Bad Moms,” featuring six overachieving female characters summed up by the lines: “We’re killing ourselves to be perfect and it’s making us insane. Screw it. ” Also, check out our Book Review’s roundup of summer thrillers. _____ 10. And maybe exercise a bit. A new study found that being out of shape may be second only to smoking as a risk factor for premature death. “Even small amounts of physical activity may have positive effects on fitness,” the lead researcher said. _____ 11. Finally, we leave you with a great dessert for summer: thick, strained yogurt, sweetened and enhanced with pistachios or almonds, cardamom and saffron. Called shrikhand in India, it suits spoons everywhere. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742628573.4848}