{"duration": 0.09092855453491211, "input_args": {"text": "'We Are Change \\nWikileaks emails have shaken the very fabric of the political spectrum to the core. We have seen Clinton campaign collusion between the media, DNC, DOJ, DOS, etc. But now everyone’s fears that Sanders was potentially a plant or threatened may have been confirmed in an email from 2015.\\n\\nIn an email exchange from Robby Mook (re47@hillaryclinton.com) to John Podesta ( john.podesta@gmail.com ) on May,26,2015 Mook forwards an email from Christina Reynolds to the rest of the Clinton camp. In which she says that Senator Sanders went after HRC and WJC on wealth including using the word hustle. She then goes on to say that she followed up with Brad (potentially DNC CFO Brad Marshall who resigned ) and “the only thing that they’ve pushed is from the attached docs trying to get reporters to write that HRC and Bernie are actually in the same place.” Likely Referring to political stances now exposed to be a lie by Wikileaks because of Hillary’s private and public opinion. \\nFollowing up on our call on Friday, just wanted to give some updates and flag that Bernie went after HRC and WJC on wealth (including using the word “hustle.) I followed up with Brad. The only thing they’ve pushed is from the attached docs—trying to get reporters to write that HRC and Bernie are actually in the same place. They are happy for any suggestions, but were not planning on making any big attacks around the announcement.\\nMook then writes, “This isn’t in keeping w the agreement. Since we clearly have some leverage, would be good to flag this for him. I could send a signal via Welch–or did you establish a direct line w him?”\\nWhat agreement is Robby Mook talking about? What does he mean by “send a signal via Welch.” Is Robby Mook referring to Vermont representative Peter Welch?\\nEven if Mook was talking about Brad Marshall DNC CFO when he said “This isn’t in keeping w the agreement” that would expose that not only the Clinton campaign but the DNC was feeding reporters to write stories. However this possibility quickly falls apart since earlier this year Guccifer 2 revealed the DNC rigged the primary against Sanders. So Mook wouldn’t need to send a signal to the DNC CFO they were already well connected from the beginning.\\nThe alternative is that it’s a different Welch and different Brad and that Mook wasn’t talking about Sanders but was talking about Brad. However the email chain would suggest that it’s Sanders who Mook is referring to because deeper down the string of emails are two links forwarded from Colin Campbell (Business Insider Journalist) to Clinton staffer Josh Schwerin . One to a story that is criticized by the Clinton campaign in which Sanders bashes Hillary and the other to a story about Hillary Clinton’s campaign selling pants suits. \\nBut it doesn’t end there, in the attachments that Christina Reynolds remarked in the email under a section in the document called “Personal Comments Praise” are positive comments by Senator Sanders about Hillary Clinton.\\nSo I then decided to do some digging through CNBC’s reporter list and contributor list from 2015 and found no one named Brad worked there in July 2015. I looked at July, 2015 because no earlier date was available from archive.org.\\nI then did the same for Business insider looking for a reporter named Brad seeing as Wikileaks has already previously exposed the close connection between the media and Clinton campaign. Thinking that I could debunk the claim that Bernie Sanders was a potential plant and Robbie Mook was talking about Brad at business insider since CNBC didn’t have anyone named Brad who worked there.In which I found that business insider did not have an entry at all for 2015 either available on archive.org.\\nAgain alternatively Mook might have been referring to another reporter not apart of CNBC or Business Insider named Brad. However the next comment “I could send a signal via Welch” doesn’t make sense. Seeing as how connected the campaign was to the media why would Mook need to send a signal?\\nIt’s also worth noting that earlier in the year it was revealed that the Sanders campaign sold out to the Hillary Clinton’s campaign for a private jet towards the end of the campaign run.\\nWhatever the case may be this email is deeply disturbing and connecting the dots if the two people mentioned are Peter Welch and DNC CFO Brad Marshall things just got a lot more crazier if that’s even at all possible with recent Wikileaks emails revealing Podesta talking about satanic spirit cooking. What did Robby Mafia Mook mean by “since we clearly have some leverage?” Was the “leverage” Blackmail? threats? Maybe that explains Bernie’s cut on his face later on during the DNC. With such a wild election cycle absolutely nothing would surprise me anymore. Do you feel the Bern?\\n“The mafia never separates.”\\n~Robby Mook\\n \\n \\n \\n \\nThe post WIKILEAKS: Suggest Sanders Was A Possible Plant Or Threatened By Mook appeared first on We Are Change .\\n'"}, "time": 1742562062.6925757}