{"duration": 0.05581974983215332, "input_args": {"text": "'‘Hillary Won Popular Vote’ Is Powerful Elite Meme, Though Apparently Untrue   16, 2016 \\nHillary Clinton’s Popular Vote Lead Expands to Over 1 Million … Hillary Clinton currently has 61,964,263 votes compared with Trump’s 60,961,967 As Americans’ votes continue to be counted, Hillary Clinton‘s lead over Donald Trump in the popular vote has grown to more than 1 million people. -TIME \\nThis is a meme that is powerfully growing in popularity. The idea that Hillary swept the popular vote while Donald Trump eked out a win in the electoral college definitely provides a narrative that bolsters Hillary as the legitimate winner of the US presidential election. \\nTrump response to this particular propaganda is to say that he would have recast his campaign if he was aiming for the popular vote and thus would have “won even bigger and more easily.” \\nThis is actually not a very effective answer because it doesn’t rebut the central point, which is that Hillary is proving to be a far more popular candidate than Trump. \\nDemocrat Senator Sen. Harry Reid last week called Trump a “sexual predator who lost the popular vote and fueled his campaign with bigotry and hate.” \\nThere are ways for Trump to rebut this attacks. Infowars just today posted an article entitled “Three Million in Presidential Election Cast by Illegal Aliens.” \\nThis is the obvious response to the narrative now being proposed by Hillary. \\nMore: \\nTrump may have won popular vote … Three million votes in the U.S. presidential election were cast by illegal aliens, according to Greg Phillips of the VoteFraud.org organization. \\nIf true, this would mean that Donald Trump still won the contest despite widespread vote fraud and almost certainly won the popular vote. \\n“We have verified more than three million votes cast by non-citizens,” tweeted Phillips after reporting that the group had completed an analysis of a database of 180 million voter registrations. \\nThe idea behind “Hillary won the popular vote” is to delegitimize Trump and his victory as much as possible.This also allows the Clinton campaign to put tremendous pressure on electors of the Electoral College itself to change their votes. \\nConclusion: Despite all of his projects and preoccupations as the president-elect, Trump might do well to combat the growing perception that he lost badly and only the presidency due to a kind of fluke in the American political process.'"}, "time": 1742563203.5024884}