{"duration": 0.04029107093811035, "input_args": {"text": "'posted by Eddie You know the Dakota Access Pipeline protests are working when oil interests start resorting to underhanded tricks to paint water protectors in a negative light. As the fight against the pipeline grows in North Dakota and around the country, dirty tricks are being deployed in an apparent attempt to delegitimize the opposition. Dakota Access Employee Tries to Incite Violence, Sheriff’s Department Makes False Report That He Was Shot by Protesters Mother Jones journalist Wes Enzinna, who was at the protests, says he witnessed a Dakota Access LLC employee try to infiltrate the Dakota Access Pipeline protests: “An armed security agent employed by the company behind the controversial Dakota Access Pipeline was arrested Thursday after he was caught entering the camp of activists protesting near the Standing Rock Indian Reservation in southern North Dakota. After a car chase and a standoff during which he allegedly pointed his assault rifle at a local Sioux teenager, the man, whose ID indicated he was an employee of Dakota Access LLC, was arrested and handed over to the FBI.” According to an official statement from the tribe, the man fired several shots from his gun before being peacefully apprehended by tribal police. Witnesses at the scene say he pointed his gun at several protesters. The man was clearly trying to provoke violence that could later be used to demonize protesters who have so far remained peaceful. The Morton County Sheriff’s Department circulated a false report claiming the man was shot, presumably by protesters. As you can see in the images above, the man was not harmed. The Sheriff’s Department has since retracted that report. Anti-Media ’s attempts to obtain clarifying comments from Morton County Sheriff’s were ignored. \\nFake Internet Trolls Slam Dakota Access Pipeline Protests, Promote Pipeline on Twitter \\nWith very little organic support for the Dakota Access Pipeline remaining, groups allied with the pipeline builders now seem to be creating paid Internet trolls or bots to slam protesters while praising the pipeline. DESMOG , an environmental blog, conducted an investigation and found what it says are “sock puppet” accounts tied to an oil industry lobby operating on Twitter: “A DeSmog investigation has revealed the possibility that a front group supporting the controversial Dakota Access Pipeline (DAPL) — the Midwest Alliance for Infrastructure Now (MAIN) — may have created fake Twitter profiles, known by some as ‘sock puppets,’ to convey a pro-pipeline message over social media. And MAIN may be employing the PR services of the firm DCI Group, which has connections to the Republican Party, in order to do so. “DeSmog tracked down at least 16 different questionable Twitter accounts which used the #NoDAPL hashtag employed by protesters, in order to claim that opposition to the pipeline kills jobs, that those protesting the pipeline at the Standing Rock Sioux Tribe’s encampment use violence, and that the pipeline does not pose a risk to water sources or cross over tribal land. “On September 13, people began to suspect these accounts were fake, calling them out on Twitter , and by September 14, most of the accounts no longer existed.” \\nWith the Dakota Access Pipeline builders resorting to backhanded trickery, it’s clear the tide is turning against the pipeline following law enforcement’s overwhelming militarized crackdown of the protests. source:'"}, "time": 1742564221.445978}