{"duration": 0.042977333068847656, "input_args": {"text": "'A German journalist is appealing for money to found a new website that he claims will counter the growing popularity of Breitbart News in Germany, ahead of the federal election later this year. [Christoph Knappes’s has christened his proposed site “Schmalbart” a   words reffering to the German origins of the surname ‘Breitbart’. While ‘Breitbart’ translated, refers to one in possession of a ‘broad beard’ Schmalbart describes the opposite  —   ‘Smallbeard’.  So far, Mr. Kappes has raised just over €700 (£600, $750) in monthly subscriptions for the project, including from Social Democratic MP Saskia Esker who has recently taken to tweeting at German companies while claiming that Breitbart News is a “  site”. According to the fundraising page, Mr. Kappes’s project is designed to “combat populism” and the site will “fight incitement, racism,   and any other kind of human hostility”. He says the site will not just be limited to articles but will be active on social media, saying “We will be at the places where the discussions are”. The manifesto for the proposed   site was released in November on Mr. Kappes’s website. According to the post, Breitbart News follows an “extreme right wing ideology of social Darwinism”. He claims that a German language Breitbart bureau could garner an audience of up to “six million” in Germany, and complains that the German middle class “lack civil courage”. Writers should “avoid arrogance” when dealing with the public, Mr Kappes goes on to opine, saying: “Schmalbart must avoid condescension”. He added: “simple language is mandatory”. The project is set to employ several authors, editorial staff, web designers, and others to manage fundraising campaigns. It is not known how the site intends to maintain such a large paid staff given that it is presently is raising just €740 per month. As the German federal election approaches later this year, the German establishment media, along with their counterparts in the U. S. have targeted Breitbart News. Accusations of “fake news” have abounded and some, like The New York Times, have encouraged readers to hound advertisers on social media. American left wing political operative David Brock announced a similar project to Schmalbart last month and like his German counterpart is seeking cash. German Chancellor Angela Merkel has also taken steps toward a free speech crackdown by accusing Russia and others of trying to influence the federal election through news and cyber attacks. The German Interior Ministry has also proposed a “defence centre” be created to combat news and information the German government deems to be “fake news”.'"}, "time": 1742628411.36988}