{"duration": 0.14656519889831543, "input_args": {"text": "'Search form Search From Bad to Worse : Obama’s Ransom Payment to Iran is Just the Tip of the Iceberg In his bid to pursue a legacy, Obama charts disastrous course with reckless abandon. November 2, 2016 Ari Lieberman \\nMost of us, including several democratic lawmakers, cringed when Obama inked the Iran deal but those of us who are familiar with the malevolent nature of the Iranian regime, recoiled in horror when we learned that Obama transferred $400 million to the Iranians in exchange for four American citizens held captive by the mullahs on trumped up charges. The $400 million was part of a larger installment totaling $1.7 billion, ostensibly to settle claims Iran had against the United States stemming from aborted Iranian arms purchases dating back to the Shah. Obama claimed that this was money that was “owed” to Iran and the settlement, which included $1.3 billion in interest, saved the U.S. taxpayer “billions” because the Iranians were demanding even more at the Hague tribunal, where the claim was being adjudicated. \\nThe timing and method of the cash transfers were disquieting to say the least and raised serious questions of legality as well as broader geo-political concerns. The Americans were freed only after Iran received its $400 million. The payment, which was airlifted in the dead of night in an unmarked cargo plane, was made in untraceable cash, stacked on wooden pallets. The Iranians demanded Swiss Francs and Euros rather than Dollars and a pliant Obama agreed to the Islamic Republic’s dictates. Gleeful Iranian leaders were quick to announce victory and claimed that the payment was indeed a ransom, contradicting the administration’s adamant denials. \\nEven within the administration there was confusion about whether the payment was in fact a ransom. State Department spokesman Mark Toner came very close to acknowledging this fact when he noted that the $400 million was used as “leverage” to ensure the Americans’ safe return. The White House however, quickly repudiated the State Department’s characterization. \\nEven if one were to believe the story peddled by the administration, the mere appearance of a quid pro quo payment potentially exposes the U.S. to extortion and hostage-taking. The Iranians certainly believed it was a ransom payment and more likely than not, every two-bit dictator on the planet saw it that way as well. \\nBut there are deeper more troubling aspects to this convoluted story. In his January 17, 2016 address to the American people, Obama tried to put a positive spin on his dealings with the Islamic Republic but as noted by Rick Richman in an excellent article featured in Mosaic , the deal struck with the Iranians was rotten to its core and the administration deliberately kept the American people in the dark about various aspects of the shady arrangement. \\nThe $400 million that the U.S. transferred to Iran came from Iran’s Foreign Military Sales (FMS) account with the Pentagon. The balance of 1.3 billion ostensibly represented interest accrued since 1979. But Obama neglected to note that when Iran filed its lawsuit, the U.S. filed counterclaim against Iran for $817 million for Iranian breaches of its obligations under the FMS program. The U.S. could have conceivably won that counterclaim which would have meant wooden pallets of cash for the American treasury, courtesy of the Islamic Republic. \\nMoreover, American plaintiffs maintained sixteen U.S. court judgments against the Islamic Republic stemming from that regime’s involvement in terrorist activities. Those judgments totaled $3.9 billion in compensatory and punitive damages. \\nSome plaintiffs sought to recover their Judgments directly from Iran’s FMS account but their efforts were stymied by the Clinton administration. Instead, under a convoluted deal struck between Congress and the Clinton administration in 2,000, the U.S. treasury was to pay the holders of the judgments against Iran for the amount of their compensatory damages and 10 percent of their punitive damages up to the amount in the FMS fund. The judgments would then be subrogated to the United States, which meant that judgments became direct U.S claims against the Iranian government. \\nIran ignored the Judgments and never paid any of the plaintiffs. Under U.S. law, the $400 million sitting in the FMS account should have gone back to the U.S. treasury, which had already paid the judgment holders. But the U.S. treasury never collected a dime on the subrogated claims since Obama shipped the money off on wooden pallets to Iran. Essentially, the U.S. taxpayer ended up footing the bill for Iran’s terrorism while the Iranians were never held accountable for their maleficence. \\nObama’s actions represented blatant disregard for the law, for the victims of terrorism and for the American taxpayer. His claim of saving the taxpayer “billions” represents the zenith of mendacity. \\nObama claimed that the payments had to be made in cash because existing sanctions prohibited normal banking procedures. But as noted by Richman, the sanctions regimen expressly permits payments made to settle Iranian claims instituted at The Hague, exposing yet another lie by the Obama administration. \\nThere was one, and only one reason why the Iranians requested cash and all but the most disingenuous know what that reason is. The Iranians are the world’s foremost state-sponsors of international terrorism. They finance terrorist groups and proxy militias throughout the region and internationally but can only do so through illicit means that circumvent normal methods of financing. Hence, they demanded untraceable cash. The misery that we are currently witnessing in Syria, Yemen and elsewhere is due in no small part to the Obama administration which provided the Iranians with the cash necessary to keep operations flowing. \\nIn addition to the $1.7 billion in cash, Obama also authorized the release of seven convicted Iranian felons and expunged warrants on 14 others. But this aspect of the transaction seems almost trivial when considering the sheer mendacity and illegality of nearly every other aspect of the deal. \\nLastly, the transfer of such a large sum to Iran in “settlement” of an alleged legal claim required the attorney general’s approval but the administration has yet to produce any document bearing Loretta Lynch’s signature authorizing such payment. On October 7, Sen. Marco Rubio (R., Fla.) and Rep. Mike Pompeo (R., Kan.) presented Lynch with a series of questions seeking clarification of various aspects of the deal. Lynch, whose tenure as attorney general is proving to be as corrupt and partisan as her predecessor, has inexplicably refused to answer the lawmakers’ queries. \\nIn a desperate attempt to establish a legacy, Obama pursued the Iran deal with reckless abandon, forfeiting positions previously regarded as red lines and signing the worst deal in U.S. diplomatic history. The ancillary deal struck with the Iranians concerning American hostages was laced with outright lies and enabled the Iranians to continue their reign or regional terror. More importantly, it may also have been in violation of existing U.S. law and Lynch’s stonewalling only lends credence to that notion.'"}, "time": 1742561818.3985734}