{"duration": 0.08046293258666992, "input_args": {"text": "'Prime Minister Justin Trudeau of Canada, who has championed the arts and welcomed refugees while in office, said on Saturday that he would visit Broadway to see a new musical that highlights Canadian generosity toward stranded airline passengers after the Sept. 11 terrorist attacks. The show, “Come From Away,” is the rare Broadway musical by and about Canadians, and has been greeted enthusiastically by audiences in that country. It is now in previews on Broadway and is set to open March 12. Mr. Trudeau said he and his wife, Sophie, would attend the show on March 15, joining a group of about 600 people attending with the Consulate General of Canada in New York. “Come From Away,” with music, lyrics and book by a married Canadian couple, Irene Sankoff and David Hein, is about the encounter between the residents of Gander, Newfoundland, and thousands of international air travelers who were diverted there on the day of the attacks. The show was nurtured by the Canadian Music Theater Project at Sheridan College near Toronto, which is trying to cultivate more musical theater by Canadian writers. The founder of the project, Michael Rubinoff, said the show was only the fifth musical with a Canadian writing team to reach Broadway, after “Rockabye Hamlet” in 1976, “Billy Bishop Goes to War” in 1980, “The Drowsy Chaperone” in 2006 and “The Story of My Life” in 2009. All but “The Drowsy Chaperone” were considered flops. “This is extremely culturally significant, having a Canadian musical, written by Canadians about Canadians, on Broadway  —   that’s historic,” Mr. Rubinoff said. He said the show would probably appeal to Mr. Trudeau because of his interest in the arts  —   he once taught high school drama  —   and because of his political agenda. “The show speaks to his values,” Mr. Rubinoff said. “Welcoming refugees, kindness  —   these are issues he’s been championing since he’s been prime minister, and those themes speak to him now more than ever, given the international political climate. ” Mr. Trudeau’s spokesman, Cameron Ahmad, said Sunday that the prime minister is coming in part to “support the success of a great Canadian cultural production. ” But he made clear that the show’s themes are also a consideration. “Both our countries share a deep   relationship, that extends far beyond our economic ties, and is made stronger by cultural connections and shared values,” Mr. Ahmad said. “And we embrace the opportunity to highlight how we are there for each other in times of need. ” The show has had multiple   productions  —   at the La Jolla Playhouse, Seattle Repertory Theater, Ford’s Theater in Washington and the Royal Alexandra Theater in Toronto. The Toronto production was a particular success, and the show’s producers have announced that they will begin a second production of the show in Toronto next February. Several Canadian politicians have already seen the show. Last fall, when the cast performed a concert version of the show in Gander, the audience included Dwight Ball, the premier of Newfoundland and Labrador, as well as Frank F. Fagan, the province’s lieutenant governor. Mayor John Tory of Toronto saw the show in his city. The mayor of Calgary, Alberta, Naheed Nenshi, attended a Broadway preview, and then declared it the “best musical I’ve ever seen. ” The show has also prompted quite a bit of interest among American government officials. Among those who saw the production in Washington were Justice Elena Kagan of the Supreme Court Laura Bush, the former first lady members of Congress and some   military officials. Several members of the Obama administration also attended a performance, including Samantha Power, the former United States ambassador to the United Nations, and Susan E. Rice, the former national security adviser.'"}, "time": 1742562491.9318578}