{"duration": 0.12467765808105469, "input_args": {"text": "'WASHINGTON  —   Republican congressional aides have set their iPhones to flutter every time President Trump hurls a thunderbolt on Twitter. Senators nod politely at his false claims of mass voter fraud during private White House meetings. The congressional morning briefing literature now includes a rundown of overnight and   social media missives from the commander in chief. “It doesn’t take that long to read ’em,” said Senator Bob Corker, Republican of Tennessee. After three weeks in the White House, Mr. Trump has made clear that he is going to continue promulgating conspiracy theories, flinging personal insults and saying things that are plainly untrue. And the   House and Senate seem to have made a collective decision: They will accommodate  —   not confront  —   his conduct as long as he signs their   conservative proposals on taxes, regulations and health care into law. “There’s a widely held view among our members that, yes, he’s going to say things on a daily basis that we’re not going to like,” said Senator John Thune of South Dakota, the   Senate Republican, “but that the broad legislative agenda and goals that we have  —   if we can stay focused on those and try and get that stuff enacted  —   those would be big wins. ” Such accommodation is coming at a price, attracting incredulous or angry constituents to town hall meetings, leaving members   when presented with the latest presidential provocation and testing the capacity of now perpetually clogged phone lines on Capitol Hill. Some of this would have happened under any Republican president  —   lawmakers were quick to note the ferocity of protests under President George W. Bush. But much of it is unique to Mr. Trump, whose rampaging presidency has spurred uncommon civic engagement even in   districts. “What is your line in the sand?” a retired Utah teacher demanded last week of Representative Jason Chaffetz, the Republican chairman of the House Oversight and Government Reform Committee, who slogged through a   forum back home. But at least for now, that is a price Republicans seem willing to pay. In effect, congressional Republicans have sought to compartmentalize Mr. Trump’s presidency, adopting a   approach. They reach for the more appealing offerings, such as the Supreme Court nominee, Judge Neil M. Gorsuch, and avert their gaze from less appetizing or, to some, downright indefensible elements (America is not so different from Vladimir V. Putin’s Russia) which would have surely drawn relentless rebukes if uttered by President Barack Obama. Some lawmakers take comfort knowing that the president’s behavior last year didn’t hurt their campaigns, and they have used the electoral result as a justification unto itself, suggesting  —   as Mr. Trump has constantly  —   that his campaign success validates his approach. “He’s a unique personality, to be sure,” acknowledged Senator John Cornyn of Texas, the Republican whip. “But he’s gotten this far the way he is, and I think that probably leads him to think, well, it’s working for him so far, so why change?” And Republican lawmakers do not mind? “As long as we’re able to get things done,” Mr. Cornyn said. Individual Republican senators have criticized the president in mostly isolated cases, none more vocally than Senator John McCain of Arizona, who blasted the president’s comparison between Mr. Putin’s extrajudicial killings and American conduct, and recently expressed concerns about a military raid in Yemen that resulted in the death of an American commando and multiple civilians. Often, the president has taken note  —   in brushback pitches that serve as warnings, if not to Mr. McCain, then to lawmakers who might emulate him. “He’s been losing so long he doesn’t know how to win anymore,” Mr. Trump wrote of Mr. McCain on Twitter on Thursday morning, calling to mind Mr. Trump’s suggestion during the campaign that Mr. McCain was not a war hero because he had been captured in combat. Hours later, Senator Chuck Schumer of New York, the Democratic leader, went to the Senate floor and lamented the attacks on Mr. McCain and other Republicans. Senator Orrin G. Hatch, Republican of Utah, then followed  —   and seemed far less bothered. “I personally wish he would choose his words a little more carefully,” Mr. Hatch said of the president. “On the other hand, I kind of find him refreshing, that he doesn’t take any guff from anybody. ” Privately, lawmakers and members of their staffs have pleaded with Mr. Trump’s inner circle for more discipline from the president and his White House. “We might talk to the vice president, but certainly not for public attribution,” Mr. Cornyn said of Vice President Mike Pence, who joins Senate Republicans once a week at their regular luncheons in the Capitol. By and large, though, Republicans in Congress are treating Mr. Trump as an individual to be worked around in his own administration. “I think we can get a lot done with the people around him,” Mr. McCain said, dismissing policy pronouncements from Mr. Trump that often differ from “the day before. ” Practically patting Mr. Trump on the head, Senator Lamar Alexander, Republican of Tennessee, said, “If he pays attention to people like General Kelly when he’s doing a travel restriction and if he appoints people like Neil Gorsuch when he’s making appointments, he’ll be rewarded for that by all the praise, and maybe he’ll do more of it. ” (Former Gen. John F. Kelly is the Homeland Security secretary.) In hopes of repairing their relationship with Congress after the botched rollout of the travel ban, Mr. Trump’s aides have aggressively courted congressional Republicans. In addition to Mr. Pence with his weekly visits, Marc Short, Mr. Trump’s chief legislative liaison, has already become ubiquitous in the Capitol. And powerful senators are enjoying significant attention: Mr. McCain, the Armed Services Committee chairman, said he had already had three conversations with Michael T. Flynn, the national security adviser, and a breakfast with Jim Mattis, the defense secretary. Mr. Hatch, who is chairman of the Finance Committee, had a   meeting with Mr. Trump in the White House. And Mr. Alexander, the chairman of the health and education panel, was invited to the White House last Thursday for lunch with Mr. Trump. Senator Mitch McConnell of Kentucky, the majority leader, said there was “a high level of satisfaction” with the new White House, insisting that members cared little about “the daily tweets. ” The deflection is bicameral. When a reporter recently noted that the House speaker, Paul D. Ryan, had often declined to weigh in on the “tweet of the day,” Mr. Ryan lit up. “You got my talking points down already!” he said, before gently fielding a question about Mr. Trump’s attacks on the federal judge who halted his travel ban. “Look, he’s not the first president to get frustrated with a ruling from a court,” Mr. Ryan said with a shrug. While the détente between an   president and its   leaders on Capitol Hill may seem wholly transactional, some Republicans say the fury on the left toward Mr. Trump along with the denunciations from many news outlets has helped forge his bond with the voters that he and congressional Republicans share, particularly in the   House. When the president addressed congressional Republicans at their retreat in Philadelphia last month, Mr. Trump’s aside about news coverage  —   “nothing fair about the media,” he said with a sneer  —   earned perhaps the most enthusiastic applause. “While it may upset The New York Times, Hollywood, the cast of ‘Hamilton’ and the groups marching in the streets, it is not upsetting to the constituents that elected these members and senators,” Sam Geduldig, a Republican lobbyist, said of Mr. Trump’s behavior. “There is a feeling that if those groups are against you, you’re doing the right thing. ” More skeptical Republicans believe that lawmakers are deluding themselves if they treat Mr. Trump as a normal president  —   quirky but tolerable, like a colorful uncle at Thanksgiving dinner. “They’re mostly ignoring him, humoring him occasionally while the rest of the family gets along fine, enjoys the turkey and watches the game,” said William Kristol, the former editor of The Weekly Standard. “But he’s not just a bit player or a guest. He’s the president. ” And in the Capitol, he can never be ignored for long. Strolling to a meeting last week, Mr. Corker was asked about the latest Trump controversy: The president had just attacked the retailer Nordstrom for dropping his daughter Ivanka’s accessories and clothing line. The senator flashed a broad smile. “Did he really?” he asked.'"}, "time": 1742562098.379179}