{"duration": 1.394674301147461, "input_args": {"text": "'Senator Bernie Sanders of Vermont, his presidential campaign behind him, looked to advance the movement he built during the Democratic primary race, with the public unveiling on Wednesday of a political organization focused on addressing economic inequality and taking on special interests. But while the establishment of the new group, Our Revolution, had been eagerly awaited by many of his most ardent supporters, it has been met with criticism and controversy over its financing and management. A principal concern among backers of Mr. Sanders, whose condemnation of the campaign finance system was a pillar of his presidential bid, is that the group can draw from the pool of “dark money” that Mr. Sanders condemned for lacking transparency. The announcement of the group, which was live streamed on Wednesday night, also came as a majority of its staff resigned after the appointment last Monday of Jeff Weaver, Mr. Sanders’s former campaign manager, to lead the organization. Several people familiar with the organization said eight core staff members had stepped down. The group’s entire organizing department quit this week, along with people working in digital and data positions. After the resignations, Mr. Sanders spoke to some who had quit and asked them to reconsider, but the staff members refused. At the heart of the issue, according to several people who left, was deep distrust of and frustration with Mr. Weaver, whom they accused of wasting money on television advertising during Mr. Sanders’s campaign mismanaging campaign funds by failing to hire staff members or effectively target voters and creating a hostile work environment by threatening to criticize staff members if they quit. Claire Sandberg, who was the organizing director at Our Revolution and had worked on Mr. Sanders’s campaign, said she and others were also concerned about the group’s tax status  —   as a 501( c)(4) organization it can collect large donations from anonymous sources  —   and that a focus by Mr. Weaver on television advertising meant that it would fail to reach many of the young voters who powered Mr. Sanders’s campaign and are best reached online. “I left and others left because we were alarmed that Jeff would mismanage this organization as he mismanaged the campaign,” she said, expressing concern that Mr. Weaver would “betray its core purpose by accepting money from billionaires and not remaining    and plowing that billionaire cash into TV instead of investing it in building a genuine movement. ” Kenneth Pennington, who was the digital director of Our Revolution, declined to go into detail about his reasons for leaving but confirmed that he was no longer with the organization. The staff members who quit also said that they feared that the 501( c)(4) designation meant that the group would not be able to work directly with Mr. Sanders or the people that he had encouraged to run for office because such organizations are not allowed to coordinate directly with candidates. Mr. Weaver did not respond to requests for comment. In an email sent to Sanders supporters on Tuesday night encouraging them to participate, Mr. Weaver said that the new group would work together to “empower a wave of progressive candidates this November and win the major upcoming fights for the values we share. ” Mr. Sanders has been using his vast list of supporters to raise money for local lawmakers like Chris Pearson, a state representative in Vermont. He is also supporting Tim Canova, a liberal Democrat who is trying to unseat Representative Debbie Wasserman Schultz of Florida, whom Mr. Sanders accused of favoring Hillary Clinton’s campaign during the primary race. In his   announcement, Mr. Sanders sounded nostalgic about his presidential campaign as he repeatedly said his candidacy had changed the Democratic Party and pulled Hillary Clinton toward his progressive ideas. “We changed the conversation regarding the possibilities of our country. That is what we changed,” he said. “We redefined what the vision and the future of our country should be, and that is no small thing. ” Mr. Sanders also said Our Revolution would focus on seven specific initiatives across the country, including a California proposition aimed at lowering the cost of prescription drugs and a Colorado initiative aimed at creating a   health care system. But Mr. Sanders also made it clear that he did not plan to run the organization himself, saying, “As a United States senator, I will not be directing or controlling Our Revolution. ” Mr. Sanders praised Mr. Weaver as someone who had worked with him for 30 years and who has “very, very good qualifications. ” Mr. Sanders added that Shannon Jackson, his former assistant, would be the executive director of Our Revolution. “I expect big things from them and all of you who join with them to carry the political revolution forward,” Mr. Sanders said. The creation of the group comes as Mr. Sanders faces lingering disappointment from some of his supporters for his endorsement of Mrs. Clinton and questions about his finances that have arisen since he left the race. During the primary race, Mr. Sanders repeatedly delayed releasing his financial disclosure information, and ultimately never did. This month, he spent nearly $600, 000 on a vacation home in Vermont near Lake Champlain. Paul S. Ryan, a campaign finance expert at the Campaign Legal Center, a nonprofit political finance group, said that it was unusual for a federal lawmaker to set up such a   organization and that Mr. Sanders should have had to follow Federal Election Commission donation limits and disclosure requirements. “There are definitely some red flags with respect to the formation of this group,” Mr. Ryan said. “We’re in a murky area. ”'"}, "time": 1742562391.5641572}