{"duration": 0.12294340133666992, "input_args": {"text": "'Judicial Watch President Tom Fitton talked on Friday’s Breitbart News Daily about the various hacking and wiretapping allegations to emerge from the 2016 presidential campaign. [Fitton agreed with SiriusXM host Alex Marlow’s contention that Trump “changed the debate” when he alleged surveillance resources were improperly used against him by the Obama administration.  “Many of us have been concerned not so much about the ‘unicorn theory’ of the election that the Left has been running, but about the fact that there was surveillance done of the Trump team, and then that surveillance  —   which was classified in part  —   was illegally leaked in an effort to destroy them,” Fitton said. “If suspicions are correct that it was Obama administration officials, former officials who leaked that information, then those individuals could go to jail,” he noted. “That’s how serious the leaks were. ” “By President Trump’s highlighting the fact that he was surveilled, allegedly personally  —   whether he’s right in the specifics or not, I don’t know, but I think he’s right generally in the sense that he was targeted with some type of surveillance, he and his team. Whether the surveillance was for other reasons and his team were picked up incidentally or not, that’s to be found out. But we do know that surveillance was misused, and in my view, if it was misused, maybe it was done for improper purposes, as well,” he said. Marlow noted that while mainstream media coverage strongly suggested an intensive investigation of Trump’s campaign was in progress throughout the 2016 election, with plenty of surveillance, officials and congressional committees are now saying no “wiretapping” was conducted. “Who’s right on this thing?” he asked. “I don’t even know what ‘wiretapping’ means,” Fitton replied, comparing loose use of the term with former President Bill Clinton’s notorious argument about the precise meaning of the word “is. ”  “Was there surveillance? Was there intelligence being gathered, and did it pick up either the Trump organization in terms of their internal communications or external communications, or his associates, either on the campaign or people close to him? That’s what the media had been telling us for months and months and months,” he pointed out.  “And now, the media wants to have their cake and eat it too, in the sense that once Trump said, ‘Hey, why was I being surveilled here?’ they said, ‘Oh, no, you weren’t being surveilled.’ Well, they had been reporting that people around him had been surveilled for months, and it, therefore, suggested collusion between the Trump people and Russia on the campaign. And now, we’re told, well, that’s not necessarily the case,” he said. “That’s why we’ve got, frankly, independent FOIAs and two lawsuits designed to figure out what was going on directly,” Fitton said of Judicial Watch’s perspective on the controversy. “I don’t trust Congress to get at it directly because I think the intelligence committees, generally speaking, aren’t going to really hold the intelligence agencies to account in any significant way. That’s why you need an independent third party like Judicial Watch asking these questions. ” Marlow turned to a flurry of recent court decisions by activist judges, including a block on President Trump’s executive order to suspend visas for six   nations and even a possible judicial order to double the number of refugees accepted into the United States. He noted Fitton has warned about a “judicial war” against Trump. “I think some judges are letting their concerns about Donald Trump get in the way of their judicial ” Fitton said. “A lot of these decisions seem more   than a traditional judicial decision that carefully applies the law. The analysis, for instance, in the Hawaii court about Trump’s concern about Islamic terrorism  —   it’s just one judge substituting his political judgment and policy disagreements with President Trump and mistaking that for the real law. ”  “This is something that judges aren’t supposed to do,” he noted. “You had five judges in the Ninth Circuit essentially call out their fellow colleagues on this, saying, ‘We’ve got to be careful here. We can’t let our policy disagreements or our concerns one way or another for President Trump color our  .’ That’s pretty extraordinary to say. ” “There’s this Deep State approach in the administration, the executive agencies, and the bureaucracies. That way of thinking is infecting too many judicial decisions related to the president’s executive orders,” he charged. Marlow said the Deep State has been   on Breitbart News Daily in recent days. He asked Fitton for his conception of the Deep State and how much of a threat it poses to President Trump’s agenda. “It’s the permanent bureaucracy. It’s the recent hires of President Obama, obviously. But we should recognize that individuals who are in government for 10, 20, 30 years aren’t in government because they’re tea partiers. They’re there because they like the idea of the government, generally speaking, any more than someone’s working at McDonald’s for 30 years because they hate McDonald’s,” Fitton replied. He said these lifetime bureaucrats “tend to have contempt for political appointees,” especially Republican political appointees. “With Trump, there’s a particular animus because they don’t think Trump deserves to be president, and so they’re going to fight him, and organize against him, and quote ‘resist’ him. ”  “You see it in this unholy alliance in the Hawaiian decision, where you have the DHS, you may recall, issues some sort of sketchy staff report undermining the president’s executive orders by suggesting we don’t have to worry about terrorism from these foreign countries that he’s concerned about, these six or seven countries. It wasn’t a final product. It wasn’t approved by anyone they just leaked it, and that report is being cited by the District Court judge in Hawaii as a reason to suggest Mr. Trump’s order was not valid. Isn’t that convenient?” Fitton said sarcastically. He said Judicial Watch was still working to resolve pending lawsuits for documents related to Hillary Clinton’s email server and various Obama administration controversies. “We had about 60 pending against the Obama administration on Inauguration Day, and when the president raised his hand, President Trump raised his hand and took the oath, they became against the Trump administration,” Fitton said.  “We’re still waiting for the Trump administration to come to power in many respects because currently on FOIA, nothing’s changed. They’re defending the Clinton emails as if Obama was running the show  —   a further example of the   in place,” he said. In addition to those   suits, Fitton said Judicial Watch is trying to monitor “lawlessness in the bureaucracies” and challenge bureaucratic mischief related to immigration, such as San Francisco’s “sanctuary city” policy and “the University of California’s illicit   tuition policy for illegal aliens. ” “On top of that, we’ve got the election fraud crisis, the voter fraud crisis that the president aptly highlighted. Those battles continue in states across the nation,” he said.  “The crisis caused by the Left’s attack on the rule of law has not abated in significant ways, and it frankly continues,” Fitton declared. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563284.0385559}