{"duration": 0.043343544006347656, "input_args": {"text": "'Appearing in an interview with Fox News host Tucker Carlson, President Donald Trump said he would not be where he was if it wasn’t for his ability to speak directly to Americans through Twitter. [“Well, let me tell you about Twitter,” Trump said to Carlson. “I think that maybe I wouldn’t be here if it wasn’t for Twitter, because I get such a fake press, such a dishonest press. ”  The president also stated that he utilizes his “own form of media” and noted his massive following on the social network. “The news is not honest,” said President Trump. “Much of the news. It’s not honest. And when I have close to 100 million people watching me on Twitter, including Facebook, including all of the Instagram, including POTUS, including lots of things  —   but we have  —   I guess pretty close to 100 million people. I have my own form of media. ” President Trump also clarified his opinion of reporters in the media, saying, “Some of the press  —   by the way, some of the finest people I know are reporters. Reporters are wonderful. I’m talking about the fake media, the fake news. And there’s a lot of fake news. So if I’m not going to  —   if they’re not going to do me the honor and the public the honor of spreading my word accurately as it was meant, and you know exactly what I’m talking about, because there’s been nobody in history that got more dishonest media than I’ve gotten. ” “You look at some of the stories in The New York Times,” said Trump, “You look at some of the stories in The Washington Post. Take a look at what’s going on with CBS and NBC in particular and ABC  —   take a look at CNN. It’s a complete hit job. No matter what you do, no matter how good  —   no matter how great it is, they don’t report it in a positive fashion. ” Researchers at the University of Massachusetts published a study in December that examined how through Trump’s use of social media, “Twitter became news”: “He knew that he would get attention and it would go beyond Twitter  —   it would be reported on the news and in   comedy [shows],” said Professor Gross. Those   messages, which could be pulled up on screen by news programmes, served as “a mini press release” he added. The medium “made it easier to spread whatever he was thinking very quickly”. “In some sense Twitter made it easier to digest these and push them through the bloodstream of the American public,” said University of Massachusetts Assistant Professor of Political Science Justin Gross. Bloomberg also noted following the presidential election Trump’s successful use of Twitter in spreading his message, allowing him to “reach American voters constantly and without an editor. ” Watch President Trump’s full interview on Fox News below: Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742561924.1695826}