{"duration": 0.07313847541809082, "input_args": {"text": "'An international collaboration of astronomers, led by a group at the Swiss Federal Institute of Technology (ETH) in Zurich, Switzerland, has used the unrivalled observing power of MUSE on the Very Large Telescope (VLT) at ESO’s Paranal Observatory to study gas around distant active galaxies, less than two billion years after the Big Bang. These active galaxies, called quasars, contain supermassive black holes in their centers, which consume stars, gas, and other material at an extremely high rate. This, in turn, causes the galaxy center to emit huge amounts of radiation, making quasars the most luminous and active objects in the Universe.\\nThe study involved 19 quasars, selected from among the brightest that are observable with MUSE. Previous studies have shown that around 10% of all quasars examined were surrounded by halos, made from gas known as the intergalactic medium. These halos extend up to 300 000 light-years away from the centres of the quasars.This new study, however, has thrown up a surprise, with the detection of large halos around all 19 quasars observed — far more than the two halos that were expected statistically. The team suspects this is due to the vast increase in the observing power of MUSE over previous similar instruments, but further observations are needed to determine whether this is the case. “It is still too early to say if this is due to our new observational technique or if there is something peculiar about the quasars in our sample. So there is still a lot to learn; we are just at the beginning of a new era of discoveries”, says Elena Borisova, from ETH.\\nThe original goal of the study was to analyse the gaseous components of the Universe on the largest scales; a structure sometimes referred to as the cosmic web, in which quasars form bright nodes. The gaseous components of this web are normally extremely difficult to detect, so the illuminated halos of gas surrounding the quasars deliver an almost unique opportunity to study the gas within this large-scale cosmic structure.\\nThe cosmic web (shown at top of the page) is the structure of the Universe at the largest scale. It is comprised of spindly [filaments]– of primordial material (mostly hydrogen and helium gas) and [dark matter]– which connect galaxies and span the chasms between them. The material in this web can feed along the filaments into galaxies and drive their growth and evolution.\\nThe 19 newly-detected halos also revealed another surprise: they consist of relatively cold intergalactic gas — approximately 10 000 degrees Celsius. This revelation is in strong disagreement with currently accepted models of the structure and formation of galaxies, which suggest that gas in such close proximity to galaxies should have temperatures upwards of a million degrees.\\nIt is the first time that MUSE and its unique observing capabilities have been used for a survey of this kind. The discovery shows the potential of the instrument for observing this type of object [2]. Co-author Sebastiano Cantalupo is very excited about the new instrument and the opportunities it provides: “We have exploited the unique capabilities of MUSE in this study, which will pave the way for future surveys. Combined with a new generation of theoretical and numerical models, this approach will continue to provide a new window on cosmic structure formation and galaxy evolution.”\\nImage credit: With thanks to Illustris Collaboration \\nThe Daily Galaxy via ETH\\n'"}, "time": 1742564444.4026845}