{"duration": 0.06338739395141602, "input_args": {"text": "'Jenice Armstrong, Philly, October 26, 2016 \\nThe Temple attacks were about troublemaking teens–not race. \\nThe youngsters who jumped those college students as they walked to campus Friday night are delinquents who need to be put in check before it’s too late. \\nThey were nothing but miscreants who took out their aggression and misdirected rage on random passersby. Why? Because they felt like wilding out that night. They were out to create chaos, so they did. \\nSo, don’t talk to me about gentrification in North Philly. \\nDon’t talk to me about poverty. \\nDon’t talk to me about race relations. \\nThose are whole other conversations and not what these attacks were about. \\nNo one was safe from these teens that night. Not the six Temple students who were injured. Not the Temple police officer knocked from her bicycle by a 15-year-old. Not even a police horse. Anyone could have gotten caught up in that madness. \\nAccording to news reports, a crowd of 150 youngsters started gathering after an Instagram advertised an 8 p.m. meet-up at the AMC North Broad Street 7 (formerly the Pearl Theater at Avenue North), on Broad Street near Oxford at the southern end of the campus. \\n{snip} \\nMost of the high schoolers who responded to the online posting were good kids looking to socialize. But then the delinquents did what they often do and ruined it for everybody. \\nAccording to police, a group of 20 to 30 boys and girls in their early to late teens randomly attacked Temple students as they returned from a football game at Lincoln Financial Field. \\n{snip} \\nPeople keep trying to make this a racial thing because at least two of the victims were white and all of the assailants were African American. They make that assumption even though we don’t know the race of the other injured students. (Lots of African Americans go to Temple.) Nor do we know the race of the injured officers. \\nStreet violence is street violence. It knows no skin color. {snip} \\n{snip} \\nAnother student, a junior environmental science major who didn’t give her name, told a website called theTab.com, “My boyfriend ran and got away but the second I tried to run, they grabbed me by my hair and started beating my head and back. \\n“I remember shoes coming for my face and after that I heard other kids from the group saying, ‘Yo chill, yo chill, it’s just a girl,’ and they pulled my attackers off me.” \\n{snip} \\nTemple has promised increased security, but when it comes to random street violence, anything can happen to anyone–black or white.'"}, "time": 1742562079.0353825}