{"duration": 0.10690879821777344, "input_args": {"text": "' Evil Russian Propaganda From The Evil Russian Invaders By Craig Murray\\n \" TruePublica \" - If you would like to listen to some evil Russian propaganda, here is my new interview on Sputnik News .\\nThe BBC World Service was founded by the Foreign and Commonwealth Office and funded by them directly for six decades, until a cosmetic change last year. Its specific purpose is to spread British values and the British view of the world abroad. It specifically, on its dozens of different national services, gives an opportunity to dissident voices who cannot get on their mainstream media. The Americans spend hundreds of millions annually on outfits like RFE/RL to do the same. Yet when the Russians do precisely the same thing on a much smaller scale, for example by enabling you to listen to me, this is portrayed as evil propaganda.\\nFortunately we have the Henry Jackson Society to defend you from it. The Henry Jackson Society, supported by Liam Fox, Jim Murphy and pretty well every other right wing enthusiast you can name, is of course a great believer in free markets. And its sense of the market has detected that its old product of a constant stream of Islamophobia is becoming dated, and currently buyers want Russophobia. Whatever your phobia, the Henry Jackson Society will have some to sell you, so here we have their new Manual of Russophobia .\\nWritten by Dr Andrew Foxall, Director of the Henry Jackson Society\\x92s so-called Centre for Russian Studies, has by brilliant research exposed the fact that Jeremy Corbyn, Seumas Milne, Tommy Sheridan and Colin Fox have all appeared on Russia Today television. And that a tiny group of left wingers I have never heard of once met in a pub with some Russian nationalists from the Ukraine. Funniest of all is the contention that CND is funded by the Russians.\\nGiven that the Henry Jackson Society is, and always has been, financed by CIA money laundered through American New World Order supporting private foundations, this is rather amusing. This pathetically thin hate manual is now on the desk of every Conservative and New Labour Progress Group MP.\\nIt is of course no coincidence that the overt security service operations operate in close co-ordination with the supposedly covert ones. The same day that the Henry Jackson Society paper was released, the head of MI5 gave an interview to the Guardian about the Russian threat. The Russians are not just coming, they are here! You can\\x92t see them because they are inside your laptop, where the Russian government apparently want to steal all your secrets. Our security services don\\x92t like the competition. That is their job.\\nApparently the Russians are out to steal Britain\\x92s industrial secrets, like how the Nissan Qasghqai is built or how the Chinese and French build Hinkley Point. I hope they don\\x92t get the blueprints of the new Dyson. Andrew Parker has of course to work hard as MI5 to find a new enemy. While he has yet again repeated the ludicrous claim that there are 3,000 Islamic terrorists in the UK, he must realise people will query the low productivity of these terrorists when it comes to killing anybody.\\nRussophobia has of course peaked in the US with Clinton\\x92s claims that it is Russia which is revealing her gross corruption and all her opponents are servants of Russia. She wants to face down Russia in Syria, in order to give it to the Islamic terrorists of whom Andrew Parker worries we have 3,000 in the UK. Clinton\\x92s claims of Russian involvement in hacking her entourage are totally unfounded, hence the lack of evidence. I am however surprised there have been no serious attempts to fabricate some.\\nWho benefits from this ratcheting up of anti-Russian rhetoric to hotter than cold war levels? Why the armaments and security industries, of course. Expect more donations to politicians and their foundations, and more pesky corruption investigations to be dropped by prosecuting authorities.\\nThe truth is that Russia is not our enemy. There is no chance that Russia will attack the UK or US. It has never happened and it never will. Nor is it remotely likely that Russia will attack any EU member state. The only thing that can make such a contingency even a 0.1% possibility, is the continuing gross anti-Russian rhetoric and propaganda and continued forward stationing of NATO assets. History from WWI to the Gulf shows that military build-up can in itself cause conflict.\\nThe danger to the world is us.\\nCraig Murray is an author, broadcaster and human rights activist. He was a British Ambassador from August 2002 to October 2004. Murray complained to the Foreign and Commonwealth Office in November 2002, 2003 and in June 2004 that intelligence linking the Islamic Movement of Uzbekistan to al-Qaeda was unreliable, immoral and illegal, as it was thought to have been obtained through torture. For that the British government sacked him.'"}, "time": 1742563246.3533888}