{"duration": 0.045671701431274414, "input_args": {"text": "'While speaking with the Washington Post’s “Cape Up” podcast, Representative Maxine Waters ( ) stated, “I believe that this president has colluded with the Russians,” and vowed to “keep working until he’s impeached. ” Later in the interview, she admitted that she hasn’t seen any evidence to back up the collusion charge.  Waters said, [relevant remarks begin around 4:00] “I believe that this president has colluded with the Russians, with the Kremlin, with the oligarchs —  perhaps —  of Russia to undermine our election system, and thus undermine our democracy. I do realize that you can’t just speculate about this. You’ve got to connect the dots. You’ve got to get the facts. ” She added that she would “keep working until he’s impeached. ” Later on, [relevant exchange begins around 19:15] Waters repeated her charge, saying, “I think that he absolutely colluded. ” Host Jonathan Capehart then asked Waters if she had seen anything to back any of the accusations she’s made up. Waters pointed to intelligence agencies’ documentation that Russia was behind the hacks of the DNC. Capehart followed up by asking Waters if she had seen evidence to back up the collusion charges. Waters answered, “No, we have not. And that’s why investigations are so important, to drill down and to connect those dots and to get the facts. What we have is a lot of smoke, that causes us to want to know more about what has happened. Why is it there are so many people around him [who] are connected to oil? Why is it that Michael Flynn, who, evidently has a great relationship with Putin, who has received payments for   speeches, and who’s spent a lot of time in Russia, and was accused of talking about sanctions, he lied about it and he got caught?” (  Grabien) Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742562650.6572626}