{"duration": 0.26163697242736816, "input_args": {"text": "'Inside The Dark Mind Of A White Mississippi Criminal Court Judge (VIDEO) By Joe Clark on October 21, 2015 Subscribe \\nMississippi Circuit Court Judge Marcus D. Gordon recently sat down with Fault Lines correspondent Anjali Kamat with the Aljazeera America network. Judge Gordon preceded to explain how the criminal justice system worked in Mississippi. His answers were sobering to say the least. Here are a few questions and answers from the interview . You can read the entire interview here . The bold text is Kamat the non-bold text is Gordon. Circuit Court Judge Marcus D. Gordon (C-SPAN) via Raw Story Question: “A number of recent studies have shown that having state public defenders can be more cost effective and provide better representation for defendants. So I’m curious why you wouldn’t petition for a state system. Judge Gordon’s response: Because I don’t have the authority. That’s above me. I have a responsibility of civil and criminal cases all over four counties. Lady, I work from Monday to Friday night. Question: The inmates we spoke to said they spent maybe 10 minutes with their public defender, and they met their public defender for the first time a few days before trial. Judge Gordon’s response: Are you believing the statements of the defendants? They will tell you anything you want to hear. Question: We spoke to a number of inmates who say they have been waiting to speak to an attorney for nearly a year. Judge Gordon’s response: Well, that’s not right. I know that’s not right. But I don’t know that happens. I never know who is in jail. The sheriff doesn’t come and tell me. The prosecutors don’t tell me. And the defense attorneys don’t tell me. I might read it in the newspaper, but that’s usually the way I find out about it. Question: They said they had asked for public defenders and that investigators told them it’s your policy to wait until after they are indicted. Judge Gordon’s response: When they prove that they are indigent, they cannot afford to hire a lawyer. Question: At what point do they have to prove that they are indigent? Judge Gordon’s response: At the time of the indictment—at which point, I will appoint them an attorney. Question: But what if months pass between the arrest and the time of indictment? Judge Gordon’s response: Lady, people charged with crimes, they are criminals. And they say what meets their purpose. Now they told you they had requested an attorney. They had not requested an attorney in 98 percent of the cases. You never hear of that. I never hear of that. I don’t know whether they have requested an attorney or not. They would not be entitled to an attorney until indictment, as a policy of this district by myself and the other circuit judge. It would be an additional burden on trial attorneys to go out there and investigate every single case. Question: But these people are spending months before speaking to counsel. Judge Gordon’s response: Well, that may be true. That’s the hardship of the criminal system. Question: Are their rights being violated? Judge Gordon’s response: Lady, the criminal system is a system of criminals. Sure, their rights are violated. But not all rights are violated that you’re calling violation. Question: You do acknowledge that because of this policy, some prisoners’ rights are being violated? Judge Gordon’s response: I do not acknowledge that. I do know that there are innocent people, who are charged and go through the system who are not guilty, in the penitentiary. But there is nothing I can do about that. Question: Do you think it’s unfair that if a person has enough money and can hire a private attorney, they get access to a better system of justice than an indigent defendant? Judge Gordon’s response: I do not think that. \\nI’m just going to end it right here. It’s clear that we can see a pattern emerging from Judge Gordon’s mindset. If you are arrested for a crime, you are a criminal. \\nThe dismissive contempt he has for his fellow citizens is astounding; however, his attitude is not unusual for most authority figures in America’s criminal justice system. From police officers to judges, and even down to parole officers, too many share the same mentality. Too many of these authority figures are just punching a clock, viewing the people whose lives they affect on a day-to-day basis as being nothing more than faceless numbers to be processed before they clock out for the day. \\nThis is the true poison which infects our legal system: pure apathy. In the minds of men like Judge Gordon, the people standing before him are nothing but criminals and deserve nothing but his contempt. If some of their rights are violated, oh well. \\nIt’s time America woke up to the truth and started to realize that the people we send through the system rarely have a fighting chance unless they have money. \\nThe enormous disconnect between those in power and the average citizen may seem like a bottomless gulf. However, I believe that as more Americans wake up, they will be able to slowly build a bridge. There will always be a gulf between those with authority and those without. It’s up to the people to maintain a functioning bridge in order to keep the system in check. It starts with insisting that the entire criminal justice system’s culture change. We do this by promoting those who think differently than men like Judge Gordon. \\nHere’s a video of this judge in action.'"}, "time": 1742563612.1136513}