{"duration": 0.07311201095581055, "input_args": {"text": "'This Is The Best Picture In Human History By: November 10, 2016 \\nThis is the best picture in human history. \\nIt is the best picture in human history because it tells the entire tale of both parties, the republic, and why we are where we are. \\nOn the left side of this picture, we have Donald Trump – a reality television star and lifelong vulgarian, the new president-elect of the United States. He points his fingers and smiles that Apprentice smile as he makes a point. \\nOn the right side of this picture, we have Barack Obama – a man who considered himself a paragon of dignity and rectitude, who thought of himself as a transformative figure and an intellectual giant. He sits next to the man who maintained for years that his birth certificate was a fraud, the man who has the opportunity to undo virtually his entire agenda within the first month of his assumption of office. And Obama, rightly, looks like a man with a pole shoved so far up his rectum that the glint of steel is visible behind his eyes. \\nBehind Obama sits a bust of Abraham Lincoln, his eyes downcast, mourning for his country. \\nYep. \\nGreatest picture ever. \\nThis is a picture of justice done and karma ascendant. Barack Obama’s image of himself is not accurate – to Americans, Obama is a reality TV show star. He transformed the presidency from a dignified office into a selfie-stick, celebrity-ridden sinkhole of Hollywood glitterati, hobnobbing with Glozell and Macklemore, cracking wise about the presidency with Jimmy Kimmel before saying that a reality star like Trump could never be president. \\nThis picture looks like the chickens coming home to roost, as Obama’s former pastor might put it. \\nAnd then there’s Lincoln. \\nLincoln, who gave his life and spent his presidency building the groundwork for racial toleration, mourning behind Barack Obama, who has spent his presidency polarizing for electoral gain. \\nLincoln, who represented wisdom, mourning behind a clown as the clown gestures to the assembled crowd. Given Republicans’ domination of the Senate and the Congress, I have hopes for Trump’s presidency – I hope he keeps his promises and that he becomes a better man and a wonderful president, and believe he has every obligation to fulfill his conservative campaign promises – but Trump occupying Lincoln’s office is, at best, a jarring visual. \\nThat’s the picture. '"}, "time": 1742564616.6989439}