{"duration": 0.1382143497467041, "input_args": {"text": "'A Trump presidency will have implications for NATO Donald Trump could reassess America’s foreign policy priorities, and that would almost certainly lead to a new strategic role for NATO – including a greater emphasis on fighting terrorism abroad Donald Trump could reassess America’s foreign policy priorities, and that would almost certainly lead to a new strategic role for NATO – including a greater emphasis on fighting terrorism abroad. \\n\\nNATO Secretary General Jens Stoltenberg responds to a question about the U.S. elections at NATO headquarters in Brussels on Nov. 9. Photo: AP \\nShortly before the 2016 presidential election in the U.S. , when most European and American politicians expected the victory of Democratic candidate Hillary Clinton , NATO Secretary General Jens Stoltenberg announced his plans to increase the combat readiness of the Alliance’s troops in Europe.\\nIn addition, he said that NATO should respond to the policy of its key opponent, Russia. However after the victory of Republican candidate Donald Trump in the American presidential race, Stoltenberg changed his priorities and called on NATO to fight with terrorism first and foremost, relegating the containment of Russia to the secondary agenda. ;\\nWith Trump coming to the White House, Washington is likely to reassess its foreign policy priorities, which also could lead to changes in NATO’s military strategy. Will the North Atlantic Treaty Organization deploy rapid deployment troops? Most importantly, who will pay for this under Trump?\\nRead the Q&amp;A with Dmitri Trenin: \" Trump\\'s presidency and the future of US-Russia relations \" Anyway, there are some controversial ideas in the pre-election statements of the U.S. President-elect on the country’s national security and the necessity to reassess its military doctrine. Specifically, the new American leader admitted the possibility of using torture in the cases of those suspected of terrorism. Moreover, he said that using nuclear weapons against the Islamic State of Iraq and the Greater Syria (ISIS) would be a potential option. At the same time, he criticized Obama’s policy toward Iran and North Korea , two states that could pose nuclear challenges to the world.\\nAmidst this rhetoric, Trump’s statements about security look very disjointed. According to his logic, security is never free and every country should pay for it by itself. At the same time, he believes that America should not impose its universal values on those who don’t agree with them.\\nSo, Trump is an outsider, a populist and a contrarian. He is alien to the American establishment. That’s why he can afford to violate the rules of the current political system – but only up to a point. Such a wanton approach is more difficult when it comes to foreign policy. However, the U.S.-President-elect identified himself as a pragmatist. He has not ruled out that he will be driven by pragmatic calculations in his defense politics. And establishing a European defense system will test his pragmatism.\\nIf Europeans seek an American-led defense, they will have to pay for it. If the European Union believes that Moscow poses a threat to Eastern Europe, it is Brussels that should create the necessary infrastructure for the deployment of American forces. According to Trump’s logic, NATO itself should be more self-reliant in fostering European security.\\nSo, Trump looks like a typical and cynical realist. He repeatedly criticized the Obama administration’s policy in Syria and Iraq: The U.S. campaign against ISIS failed, and now the prospects for the Mosul military operation against the terrorists are in limbo. Most importantly, American troops are fighting in Iraq.\\nProbably, Trump expects the EU to play a greater role in the international coalition against ISIS and more rigorously shoulder the burden of the war in the Middle East . It is not ruled out that the new American president will fight with Islamic terrorism with greater tenacity and will try to involve other stakeholders, including Russia. Such an approach will allow him to boost his rankings amidst the failures of the previous administration to tackle terrorism. After all, it could be interpreted as his decisiveness in defending the American national interest.\\nIt is quite likely that Trump will agree on constructive and large-scale cooperation with the Kremlin in Syria and will try to bring NATO\\'s forces to the operation. In this context, the prompt creation of additional forces of rapid deployment, which would be ready to take part in clashes in the Middle East by spring 2017, would surely benefit Trump.\\nNotwithstanding the paradox, the force structure proposed by Stoltenberg cannot seriously threaten Russia. It is likely that both NATO\\'s Secretary General and the Head of the European Commission, Jean-Claude Juncker, understand this. While the latter recently called once again for the creation of a European army , it will also be incapable of changing the situation and influencing the balance of power in the region.\\nIn case of Russia\\'s intervention in Eastern Europe or NATO\\'s attack on Russia, the war will be rapid and mobile with nuclear deterrence weapons playing the key role. According to the forecasts of Western military experts, the Baltic capitals might fall in two-three days while Prague and Warsaw could fall in 7-10 days after the beginning of the conflict.\\nIt is also seems unlikely that NATO would deploy thousands of its military on Russian borders to pressure the Kremlin or threaten it in case of escalation in Ukraine or the Baltic States . The countries of Eastern Europe simply do not have an infrastructure to accommodate such a large number of forces. Not more than 100,000 people took part in the largest NATO military drills in Eastern Europe over the last 25 years. And they were located in different countries.\\nRecommended: \" Why Russia has no reason to celebrate a Trump presidency yet \" Creating such infrastructure, which would be vulnerable to tactical nuclear weapons due to the close proximity to Russian borders, might take more than a year. Although Lithuania and Estonia are already financing the bases in Sauliai and Ämari, the number of airplanes located there is not high.\\nThus, the new American leader might carry out a very pragmatic policy regardless of his populist rhetoric. He is likely to attempt a reset in Washington\\'s relations with Moscow and might change the U.S. policy in Ukraine.\\nAt the same time it is not correct to consider Trump a \"friend of the Kremlin\" as some Russian politicians do. Trump is protecting U.S. national interests, not Russia\\'s and is following the principles of Realpolitik .\\nHe seeks to extricate his country from unnecessary expenditures, the threat of terrorism and boost the U.S. economy. If Russia can partly contribute to these efforts, the cooperation will be possible. If American national interests clash with those of Russia, then cooperation will not be possible.\\nTrump will not forget about Europe, which the U.S. has guarded since 1945. He will act pragmatically because cooperation with Brussels in the Middle East is important for fighting terrorism. In addition, Brussels will remain an irreplaceable partner for the U.S. in case of escalation of tensions with Russia over Ukraine.\\nThat\\'s why the creation of new rapid deployment contingents and system of European forces coordination, as well as increasing their mobilization capability, will be beneficial for Trump. Of course, if it will be Brussels that funds these initiatives, not Washington.\\nThe ;opinion ;of the author may not necessarily reflect the position of Russia Direct or its staff. '"}, "time": 1742563494.634205}