{"duration": 0.08074069023132324, "input_args": {"text": "'Kanye West likened himself to Donald J. Trump at a concert on Saturday in California before tumbling into a     speech addressing radio programmers, MTV, his friends and collaborators Jay Z and Beyoncé, Hillary Clinton, Mark Zuckerberg and more. After getting an array of grievances off his chest  —   from   politics to   politics  —   Mr. West ended the performance with a microphone drop, having played only three songs, leaving fans bitter and upset, according to reactions on social media. “It’s a new world, Hillary Clinton, it’s a new world,” Mr. West said from his floating platform stage above the crowd. “Feelings matter. Because guess what? Everybody in Middle America felt a way and they showed you how they felt. ” The brief concert, at the Golden 1 Center in Sacramento, came two nights after Mr. West shocked his audience by announcing at a show in San Jose, Calif. that he had not voted, but would have cast a ballot for Mr. Trump if he had. Though the rapper affirmed his belief in the importance of issues like Black Lives Matter and women’s rights, he praised Mr. Trump’s “method of communication” as “very futuristic. ” On Saturday night, in a trademark polemic the likes of which had been mostly absent from his current Saint Pablo tour, Mr. West doubled down on his embrace of   political incorrectness and opined on the state of the media. “Yeah, I’m taking his lead,” Mr. West said of the  . “A lot of people here tonight felt like they lost,” the rapper began. “You know why? Because y’all been lied to. Google lied to you. Facebook lied to you. Radio lied to you. ” Turning his focus on the music industry, Mr. West questioned gatekeepers for promoting songs by Drake but not Frank Ocean, and wondered once again why he is often overlooked at awards shows. Referring to this year’s MTV Video Music Awards, Mr. West pulled back the curtain on what he said was the political    dealings that go into booking celebrities for such events. “Beyoncé, I was hurt because I heard that you said you wouldn’t perform unless you won Video of the Year over me and over ‘Hotline Bling,’” he said. “Sometimes we be playing the politics too much and forget who we are just to win,” he continued. “I’ve been sitting here to give y’all my truth even at the risk of my own life  —   even at the risk of my own success, my own career. ” However, Mr. West said, such   was necessary for real progress. “Obama couldn’t make America great because he couldn’t be him to be who he was,” he said. “Black men have been slaves. Obama wasn’t allowed to do this”  —   the rapper screamed  —   “and still win. He had to be perfect. But being perfect don’t always change” things. When more music failed to follow the impromptu stump speech, disappointed fans turned to social media to demand refunds. On Sunday, the Golden 1 Center announced that ticketholders would be paid back in full, including Ticketmaster fees. On Monday, a representative for Mr. West said that remaining dates on the second leg of the “Saint Pablo” tour have been canceled. Even amid his raw, spontaneous and sometimes rambling monologue, Mr. West seemed to know he was courting controversy. “I’m not always going to say things the perfect way, the right way,” he said. “But I’m going to say how I feel. ” He added, “Get ready to have a field day, press. Get ready, get ready. Because the show’s over. ”'"}, "time": 1742564298.6833568}