{"duration": 0.05195951461791992, "input_args": {"text": "'License DMCA I would never vote for either Donald Trump or Hillary Clinton, and therefore have no dog in this fight. That said, I am an interested spectator, and clearly see that Ms. Clinton is playing a very dangerous game by using the Russians as an election issue and blaming them for everything. When asked about her leaked e-mails in the last debate, she skillfully avoided the damaging content of the e-mails, and turned the table on the Russians, claiming they are the danger. She argued we should all be alarmed at the attempt by Russia to manipulate our election, a charge which is totally untrue, and without any evidence. The leaked DNC e-mails clearly show that she and the DNC, not Russia, were successful in manipulating the election to defraud Sanders. Ms. Clinton lied about US intelligence agencies. She lectured Trump, saying 17 intelligence agencies said the Russians were behind the Wikileaks release of DNC emails. That is a lie on several counts. First, 15 agencies never said a word about leaked e-mails. Only two said anything, and this is what they said: The hacks \"are consistent with the methods and motivations of Russian-directed efforts. These thefts and disclosures are intended to interfere with the US election process. Such activity is not new to Moscow -- the Russians have used similar tactics and techniques across Europa and Eurasia, for example, to influence public opinion there. We believe, based on the scope and sensitivity of these efforts, that only Russia\\'s senior-most officials could have authorized these activities.\" Read it again. That\\'s a far cry from saying the Russians did it, and here is the proof. To this day no one knows who leaked the e-mails to Wikileaks. No one. Clinton\\'s using Russia as a political scapegoat is very dangerous. At a time when there is bad blood between the two thermonuclear powers, it is irresponsible, and demonstrates a callous lack of judgement to falsely accuse Russia of such a deed without the slightest bit of proof for purely political reasons. Provoking the Russians for political reasons speaks volumes about Ms. Clinton. Perhaps the moderator should have asked Ms. Clinton: Has the US ever attempted to influence another nations election, or have you Ms. Clinton, in your capacity, ever tried to influence another nations election? Trump, not a quick thinker, should have attacked Clinton, asking: Are these the same intelligence agencies that lied about WMD in Iraq resulting in over one million useless deaths? Another well founded accusation against her candidacy is her eagerness to make war. She supported the illegal war on Iraq which killed millions of innocents. She pushed and continues to push for the 15-year war in Afghanistan. She supported \"the surge\" in Afghanistan, a total failure. She assisted the overthrow of the democratically elected government of Honduras by supporting the military and a dictator. - Advertisement - She was the one of the primary architects of the Libyan debacle, which led to the bombing and total disintegration of Libya. It is now the leading terrorist breeding ground in Africa. It was Clinton who took on Cabinet members who argued against military intervention in Libya. She had her way. Result; utter disaster! Ms. Clinton never saw a war she did not want to avoid. But now she is playing with fire. Russia has made it clear that they will not tolerate another Iraq in Syria. They will support the Assad regime and not allow the US to overthrow yet another Middle Eastern government. Russia insists the US is intentionally trying to promote anarchy in Syria by destroying the country, maintaining brutal sanctions that only harm innocents, and giving \"moderates\" heavy weapons to help bring down Assad. Russia has drawn a line in the sand, and Ms. Clinton is showing a severe lack of judgment in provoking and blaming them for all that ails the world. She has even compared Putin to Hitler, which historically, is tantamount to declaring war. Manuel Noriega was called Hitler, Saddam Hussein was called Hitler, Muammar Gaddafi was called Hitler. The pattern is clear. Vilify the enemy and attack. Ms. Clinton, we are told, is intelligent. Her actions indicate she is either stupid, or she has no sense of sane judgment, or both. She has called for a No-Fly Zone in Syria, which General Dunford, Chairman of the Joint Chiefs of Staff said, would mean war with Russia and Syria. As Secretary of State Ms. Clinton\\'s job was to maintain peace, not start a war. She was not interested in peace as Secretary of State, but did start wars, and added fuel to the many we are currently fighting. She compared Putin to Hilter. No respectable Secretary of State, the nation\\'s chief diplomat, would call another world leader Hitler. Nor does the Chief Diplomat look for and argue for war, by shouting down all who wished to avoid war in Libya. What is even more alarming is that mainstream media has followed their leader, Ms. Clinton, in demonizing Russia. The press has lost its way and is merely an echo chamber for Ms. Clinton and her neocon supporters who are vengeful, militaristic, and bombastic. - Advertisement - In conclusion, take note of those who have rallied to her cause. Numerous war mongers from the past. They smell war, and like the smell of death. They want to escalate the conflict with Russia. Over 50 of those who brought you the War in Iraq, have pledged their fealty to the Warrior Queen. Her past war record, combined with a complete lack of judgment, and surrounding herself with war crazy neocons, make a recipe for thermonuclear war. Of course, MSM has kept the public totally in the dark about the impending day of doom, and most don\\'t even see it coming. As a spectator, and one who would like to avoid a nuclear confrontation with Russia, I now maintain Clinton is far more dangerous to the world\\'s future than Trump, even though he is woefully unfit. Thankfully there is a sane alternative candidate.'"}, "time": 1742628556.9805214}