{"duration": 0.1463930606842041, "input_args": {"text": "'After some considerable anticipation, it seemed that the much awaited October Surprise had arrived with the revelation that John Podesta, HRC’s right hand man, had a bona fide email addiction after having been publicly identified by Wikileaks as the author of a massive quantity of damaging emails.\\nAs scandal-weary voters are threatened with serious cerebral overload, the continuing array of titillating revelations spanned from naming the MSM names in collusion with the Democrats to an otherwise obscure reporter suggesting that Podesta link Russia to Trump to a multitude of documents identifying the Clinton Foundation as a vehicle for nefarious dealings – and a host of unethical examples of how to steal democracy, the rank-and-file continues to look the other way, clinging to the illusion that Democrats are the good guys, the white hats for social change.\\nBeginning with the DNC scandal in July which revealed a host of pre-meditated efforts to undermine the Bernie Sanders campaign and steal the nomination, the question remains whether a candidate nominated as a result of a flawed, if not legally flawed, Democratic primary process could be considered a politically legitimate candidate for the general election and the office of US President. The Clinton campaign apparently never felt the need to resolve that question.\\nSince the Wikileaks emails were not a total surprise, it would now appear that the real October Surprise is FBI Director James B. Comey’s dramatic turn-around announcement on October 28th that the Clinton email investigation was being re-opened due to new information as a result of its investigation into Carlos Danger.\\nComey, who reportedly had been privately criticized by disgruntled agents in his department for the dismissal of felony charges against Clinton, informed pertinent Congressional Committee Chairs and ranking Democrats of the renewed investigation in an unusual letter on Friday. Acknowledging that the agency had previously “completed its investigation,” Comey said that “due to recent developments” the FBI had “learned of the existence of emails that appear to be pertinent to the investigation.” Comey continued that after having been briefed by the FBI’s investigative team, he “agreed that the FBI should take proper investigative steps” to “determine whether they (the emails) contain classified information .”\\nTo put the current crisis in context, several days after the FBI’s original announcement in July, Rep. Curt Gowdy’s (R-SC) conducted a vigorous cross examination of Comey that was devastating to the FBI’s “no charge” determination and its no proof of intent determination that was, in turn, irreparably damaging to Secretary Clinton’s credibility. In other words, backed into a corner by Gowdy, Comey confirmed that Clinton had misrepresented the facts. Comey’s responses should have been front page headlines but received barely a ripple from the MSM which Wikileaks confirmed takes its marching orders from the DNC.\\nIn response to the newest FBI investigation that surfaced on Friday, Secretary Clinton has demanded , contrary to standard procedure, that the FBI “release all of the information that it has” and “needs to share whatever facts they have with the American people” and “it is deeply troubling because voters deserve to get full and complete facts” without any recognition of the irony.\\nSecretary Clinton is, of course, a subject of interest of the renewed investigation and understands that the purpose of a reopened investigation is to ferret out the facts. Rather than shoot from the hip to conform with candidate Clinton’s demands, Comey has the responsibility to conduct a thorough investigation free from political intimidation as should have occurred in July. While the public can only speculate on the real backstory, if there is one, prompting the FBI to initiate this current investigation, surely Comey understands what is on the line here. For the FBI to come back at some future time with another ‘no charges’ determination, everyone go home folks, there’s nothing more to see, would irredeemably and irretrievably doom the FBI, which is already on thin ice, and further drive a once-Constitutional democracy into the ditch.\\nAs the Democrats continue to circle the wagons, counting on some mindless Democrat to continue its nonsensical anti-Russian agenda, Rep. Tim Ryan (D-Oh) stepped forward to link the FBI with Putin as the true source of the new stash of emails which were found on the home computer of former Rep. Anthony Weiner (D-NY), estranged husband of HRC’s long-time confidante Huma Abedin. FBI officials first estimated ‘ tens of thousands of emails’ belonging to Ms. Abedin but have since revised its estimate to 650,000 emails which may include some of the missing 33,000 emails previously erased and may have been sent to and from Secretary Clinton’s private email server.\\nFollowing the thread, if we assume that a percentage of Ms. Abedin’s emails were ‘classified’ or ‘top secret’ (which is a reasonable assumption) and that her husband, who has repeatedly exhibited gross lapses of judgment, had free and open access to his own computer, the question that terrifies the Democrats is not knowing the content of Abedin emails contained in Weiner’s laptop.\\nAs if to throw oil on a bonfire, it was reported over the weekend that Comey’s decision to reopen the Clinton investigation was done against Attorney General Loretta Lynch’s recommendation. You may recall in July, Lynch participated in a highly controversial tarmac meeting with former President Bill Clinton – just days prior to Comey’s announcement that there would be no criminal charges against Hilary Clinton.\\nLooking back on the July announcement may factor into Comey’s role in the current controversy. It is, of course, FBI Director’s job to conduct an investigation and it is the Attorney General’s decision whether or not to pursue prosecution. Given that the Lynch – Clinton tarmac meeting was widely publicized, a good guess is that the political players decided it more appropriate for Comey to do the ‘no charges’ announcement rather than Lynch – who was already being publicly castigated for favoring Clinton by meeting with Big Bill. Lynch took the easy way with Comey being sent to face the public ire and take the heat.\\nAccording to Jane Mayer of The New Yorker , Lynch was opposed to Comey’s letter to Congress and opposed to not following DOJ practice of no comment or involvement regarding any political campaign as it could be interpreted as attempting to ‘influence’ a campaign – which has become a frequent refrain this season as the Clinton campaign continues to flail with a frantic desperation, a willingness to discredit anyone whose presence threatens their path to the White House – Russian President Vladimir Putin, Republican candidate Donald Trump, Wikileaks’ Julian Assange and now FBI Director James Comey.\\nAgainst that background, on Friday Comey was in the position of sitting on potentially explosive new information and taking the risk he would be publicly slammed for favoring Clinton and attempting to influence the election. According to Mayer’s sources, Comey felt ‘compelled’ to go forward with the letter and reopen the Clinton case against the DOJ recommendation.\\nThe Democratic Coalition Against Trump (DCAT) has filed a formal Complaint with the Department of Justice, Office of Professional Responsibility against Comey for ‘interfering in the Presidential election” citing the Hatch Act which prohibits federal employees from participating in politically partisan acts.\\nIn an imprudent display of anguish from the Clinton campaign, Scott Dworkin, senior advisor to the DCAT, said “it is absolutely absurd that FBI Director Comey would support Trump like this with only eleven days to go before the election.” And as if anticipating special entitlement for his candidate, Dworkin continued that “Comey needs to focus on stopping terrorists and protecting America, not investigating our soon to be President Elect Hillary Clinton.”\\nImmediately after the July announcement when Clinton drew the Home Free card, Comey was the object of much Democratic adulation and praise for his exemplary record and trustworthiness. However, over the weekend, the Clinton campaign launched a ferocious attack giving its media benefactors and Democratic bigwigs the green light to dump on Comey with an arsenal of steamrollers. In keeping with the Democratic strategy of irrational verbal assaults, Senator Harry Reid (D-Nv) wrote asserting Comey’s violation of the Hatch Act which “bars FBI officials from using their official authority to influence an election” while former DNC Chair Howard Dean declared that “Comey put himself on the same side as Putin.”\\nWhile US law bans foreign government interference in our elections, where is the outrage for Israel’s heavy hand manipulation of American electoral and policy decisions over the last twenty years?\\nInexplicably there has been no hint by Democrats that Anthony Weiner may be responsible for providing the FBI with the latest batch of emails, late breaking news is that Weiner, who is looking at a possible fifteen years in the slammer, is ‘cooperating’ with the FBI and might have traded his wife’s emails for a deal.\\n Renee Parsons has been a member of the ACLU’s Florida State Board of Directors and president of the ACLU Treasure Coast Chapter. She has been an elected public official in Colorado, an environmental lobbyist and staff member of the US House of Representatives in Washington DC. She can be found on Twitter @reneedove31'"}, "time": 1742562363.3721972}