{"duration": 0.10383772850036621, "input_args": {"text": "'Putin tells the West of its own problems 28.10.2016 Source: Kremlin.ru On October 17, President Vladimir Putin , when visiting Sochi, delivered a speech at the plenary session of Valdai International Discussion Club. Most of his speech was dedicated to Russia\\'s foreign policy and r elations with Western countries . America is not a banana country, but a great superpower Print version Font Size All the talks about Russia\\'s alleged interference in the US election process are nothing but hysteria, he said. \"The list of mythical and concocted problems includes the ongoing hysteria - I can not call it otherwise - about Russia\\'s influence on the course of the current election of the American president,\" Putin said, TASS reports. According to Putin, the United States is currently facing a plethora of problems - from the enormous public debt to police violence. \"Yet, it appears that the US elites have nothing to say to their people, to calm down the society. It is much easier to divert people\\'s attention to so-called Russian hackers, spies, agents of influence, and so on.\" \"Does anyone really think that Russia can somehow influence the choice of the American people? Is America a banana country or what? America is a great superpower, correct me, if I\\'m wrong,\" Putin said. Putin regrets Russia can not maintain a powerful propaganda machine comparable to Western media. \"I\\'ll tell you, dear colleagues, I\\'d like to have such a propaganda machine in Russia. But it is, unfortunately, not the case. We have no such global media outlets like CNN, the BBC and others. We have no such opportunities yet,\" RIA Novosti quoted President Putin as saying. Vladimir Putin said that US presidential candidate Donald Trump represents the interests of ordinary Americans who are tired of the elites that have been in power in the United States for decades. \"As for Mr. Trump, he chose, apparently, his own way to reach out to voters\\' hearts. What kind of a way is it? Of course, he behaves extravagantly, we all see it, but I think that all that is not so pointless,\" Putin said. \"He represents the interests of ordinary people, who criticize those who have been in power for decades,\" he said adding that Trump represents the interests of \"those who do not like the transfer of power by inheritance.\"One of the participants of the meeting said, making references to reports in Western mass media, that Russia supports Donald Trump in the American presidential election.In Putin\\'s view, such an opinion has been formed by those who defend Hillary Clinton\\'s interests in the presidential race. \"How do they do it? First off, they create an image of the enemy in the form of Russia, and then announce that Trump is our favorite. This is absolute nonsense and a way of political struggle, a way to manipulate public opinion on the eve of the presidential election in the United States,\" said Putin. Russia can attack NATO countries? Speculations about Russia being a military threat to NATO are ridiculous, the Russian president said. \"In the West, they constantly invent fictional mythical threats like Russia\\'s military threat. But the fact is, Russia is not going to attack anyone, this is ridiculous. I have read your analytical materials - not only the materials of those present in this room, but the materials by analysts from the United States, from Europe - this is impossible, simply silly and unrealistic. In Europe alone, there are 300 million, all are members of NATO, the United States is a 600-million-strong nation, and Russia has about 146 million people. This is simply funny to just talk about it,\" Putin said. According to him, the true leadership in the modern world is not about the efforts to invent ephemeral threats and then use them to subjugate others. A true leader needs to see real problems and take efforts to solve them. \"This is how Russia understands her role today in world affairs,\" said Putin.Putin also criticized NATO for not adapting the alliance to the new conditions that have emerged in the world since the Cold War. \"The structures created during the Cold War have apparently outlived themselves. NATO is not adapting itself to the new conditions, even though they talk about it all the time,\" the president said. NATO strengthens defenses in the countries located along the border with Russia, amid growing concerns about the strengthening of Moscow\\'s military potential . The decision on the deployment of NATO\\'s four additional battalions in Eastern Europe and the Baltic countries (Poland, Estonia, Latvia and Lithuania) was adopted at the NATO summit on July 8, 2016, in response to Russia\\'s actions in Ukraine. Terrorists are always smarter and stronger Using terrorists in one\\'s political interests is \"a very dangerous game,\" the Russian leader said in his speech. \"Once again, I want to address to such players: in this case, extremists are smarter, wiser and stronger than you, and when you play with them, you will always lose,\" Putin said. \"The terrorist attacks of recent years in Boston and other American cities, in Paris, Brussels, Nice, in German cities, and, unfortunately, in our country, have shown that terrorists no longer need either cells or organizational structures - they can act alone, independently, it is enough to only motivate them ideologically and set them against their enemy - against us all,\" the Russian president said. Aleppo and Mosul Putin rejected the criticism of Russia for the bombings of Aleppo and reminded of civilian casualties in Iraq, Afghanistan and Yemen. The president compared the siege of Aleppo with the offensive on Mosul, which the Iraqi army has been conducting with the participation of the United States. According to Putin, terrorists shot about 200 people there while trying to stop the advance of the Iraqi army. \"Let\\'s not forget it,\" the Russian president said.As Putin said, in Aleppo one needs to destroy the nest of the terrorists, while doing everything possible to avoid civilian casualties. \"If you do not want to touch anything, then one should not attack Mosul either, let\\'s just leave everything as it is,\" Putin said. Putin also said that civilians are killed not only in Aleppo, but also in Yemen and Afghanistan, where they kill people right at their wedding parties. \"I think bells should be tolling for all of those innocent victims,\" he said. Putin stated that it will not be possible to stop the bloodshed and start a political process in Syria. \"It would seem that after long negotiations, enormous efforts and complex trade-offs, the united front against terrorism has finally started forming, but that did not happen. Our personal agreements with the President of the United States did not work,\" Interfax quoted Putin as saying. Today, if some countries benefit from certain standards or rules, they force other countries and everyone else to obey them too. However, if these standards subsequently become an obstacle, \"they throw them in a bin, say that they have become obsolete and then set new rules.\" This strategy was used to attack Belgrade, Iraq, then in Afghanistan and Libya. The operation was launched without the appropriate resolution from the UN Security Council. Some superpowers, Putin said, in an attempt to take advantage of the international situation, have broken the international legal regime that prohibited the deployment of new missile defense systems. They have also created international terrorist groups and supplied weapons to them, even though the brutality of those groups makes millions of people leave their homes and migrate, plunging other countries into chaos. \"We can see the freedom of trade being sacrificed and so-called sanctions being used to put political pressure. Bypassing the World Trade Organization, they are trying to form closed economic alliances with rigid rules and barriers, where main beneficiaries are their own transnational corporations,\" Putin said. \"It is obvious that economic cooperation should be mutually beneficial and based on common universal principles, so that each state could become a full-fledged participant in global economic life, - said Putin. - In the medium term, the trend for the regionalization of world economy will continue, but regional trade agreements should complement and develop, rather than substitute universal norms and rules.\" Pravda.Ru'"}, "time": 1742563267.2781615}