{"duration": 0.15029120445251465, "input_args": {"text": "'kazajistán , bielorrusia , armenia , kirguistán , economía , unión económica euroasiática Serzh Sargsyan, presidente de Armenia, Alexander Lukashenko, presidente de Bielorrusia, Vladimir Putin, presidente de Rusia Nursultan Nazarbayev, presidente de Kazajistán. Fuente:Reuters \\nEn un principio, tras la caída de la Unión Soviética en 1991, surgió una nueva unificación de las antiguas repúblicas soviéticas: la Comunidad de Estados Independientes (CEI). Sin embargo sus funciones fueron meramente representativas. En 2009 se hizo un intento por sustituirla por la Unión Aduanera, y en 2010 esta empezó comenzó con Rusia y Kazajistán. Al año siguiente se unió también Bielorrusia y los controles aduaneros entre los tres se eliminaron. Posteriormente, en 2015, Armenia y Kirguistán se sumaron a este grupo. La CEI, ¿qué es y para qué se creó esta organización tras el colapso de la URSS? \\n“La UEE es necesaria para conservar y fortalecer los lazos económicos entre unos países que una vez formaron parte de la misma nación: la URSS, y que después de cuya caída se alejaron considerablemente unos de otros en el plano económico”, afirma Evgueni Guschin, investigador del Laboratorio Internacional de Investigaciones Económicas Internacionales de la Academia Presidencial Rusa de Economía Nacional y Administración Pública. \\nEl experto afirma que la UEE debe convertirse en un escenario para la integración de la economía de sus miembros en el sistema mundial. “Actualmente la tendencia es que en el mundo se forman varios grandes bloques comerciales de integración”, añade Guschin. Se podría afirmar que la UEE es más efectiva que la CEI, especialmente en lo que se refiere a la implementación de sus decisiones. \\nEvgueni Guschin cree que son tres los motivos principales para el éxito de la UEE. Primero, los lazos históricos y culturales de los países de la URSS; al fin y al cabo, países que un día formaron parte de una misma nación lo tienen más fácil para integrarse. Segundo, la voluntad política de los miembros, que determina la dirección estratégica de la integración económica de Eurasia. Tercero, el órgano de administración: la Comisión Económica Euroasiática, cuyo funcionamiento altamente profesional facilita el diálogo y la resolución de conflictos entre los países de la Unión. Fundamentos del funcionamiento \\n“Como asociación supranacional, la UEE supone una integración bastante más exhaustiva de los países miembro que la CEI, comparable en grado con la de la UE”, afirma el analista financiero de Finan, Timur Nigmatullin. La UEE permite que se reduzcan drásticamente los límites comerciales de diverso tipo entre los países y facilita el movimiento de capital y de mano de obra. \\nDe continuar como hasta ahora, el efecto multiplicador de la asociación a largo plazo aportará a Rusia hasta un 0,5% en PIB al año, y para los participantes de menor tamaño, hasta un 1%, según cálculos de Nigmatullin. \\n“La UEE ha formado en gran medida un mercado común para los países que la conformaron”, explica Serguéi Jestanov, consejero de macroeconomía del director general de Otkrytie Bróker. Según el experto, el papel principal de esta organización es la eliminación de las barreras comerciales para la mayoría de los productos. \\nDurante la primera etapa se realizó un trabajo de integración aduanera, comercial y de regulación. \\nLos miembros de la asociación tenían una misión importante: elaborar de un marco jurídico único de las esferas principales de trabajo y crear las condiciones necesarias para la armonización de las legislaciones nacionales. \\nEn 2010 entró en vigor el Código de Aduanas y en Rusia, Bielorrusia y Kazajistán se puso en funcionamiento un sistema único de regulación. Se aprobaron documentos normativos de administración de aduanas, incluidas las normas generales de declaración de mercaderías. Gracias a ello, se redujo considerablemente la cantidad de documentos necesarios para el registro de declaraciones de mercancías y desapareció el control aduanero de las fronteras de los países participantes del acuerdo. \\nPosteriormente, en 2012, surgió un órgano reglamentario único para la unión: la Comisión Euroasiática. En enero de ese año se adoptaron 17 acuerdos base internacionales que conformaban el Espacio Económico Euroasiático. Su formación supuso la garantía de las llamadas cuatro libertades: circulación de bienes, servicios, capital y fuerza de trabajo. \\nLa labor para fortalecer la integración entre los participantes del proyecto euroasiático económico, realizada durante la etapa de formación del Espacio Económico Euroasiático, permitió que las naciones prepararan las condiciones para la creación de la Unión Económica Euroasiática , la cual entró en funcionamiento a partir del 1 de enero de 2015. \\nEl nuevo contrato definía el marco jurídico de los servicios del mercado único. Se establecieron los principios generales de regulación técnica. Para octubre de 2016 la lista de reglamentos técnicos adoptados por la Unión Económica Euroasiática contaba ya con 36 documentos, 34 de los cuales ya han entrado en vigor. \\n“La UEE ha conseguido crear la condiciones para fortalecer y desarrollar la cooperación comercial y económica entre los estados miembro”, señala Evgueni Guschin. Según el experto, prueba de ello es la estadística del volumen de comercio exterior de Rusia en 2015, que en condiciones de regresión general del volumen de exportación e importación, no se vio tan reducido dentro de la UEE como con respecto a otros países del mundo. \\nEn 2015 se unieron las repúblicas de Armenia y Kirguistán y Unión Económica Euroasiática ostenta el segundo puesto en lo que se refiere al nivel de integración de las asociaciones económicas, detrás de de la Unión Europea. ¿Una segunda Unión Europea? \\nSegún Evgueni Guschin, al comparar la UEE con la Unión Europea, es necesario tener en cuenta primeramente lo joven que es la primera. \\n“La UE tiene a sus espaldas un largo recorrido sobre desarrollo de integración,que va desde la Comunidad Europea del Carbón y del Acero surgida tras la Segunda Guerra Mundial. De momento la UEE no puede presumir del nivel de integración alcanzado en esta Europa cohesionada”, comenta Guschin. Sin embargo, según afirma, la experiencia de la UE, tanto positiva como negativa, se ha tenido en cuenta al crear la UEE. \\n“En general no se puede hablar de un proceso exitoso o fallido al hablar de un proyecto de tal envergadura internacional como es la UEE. En una primera unión se trazaron los intereses económicos y políticos concernientes a las esferas de influencia”, explica Alexander Yegórov, principal analista de TeleTrade. \\nSegún el experto, en comparación con la CEI, la Unión Económica Euroasiática es una organización más viable, pues en la base de la alianza yacen los intereses económicos de los participantes. \\n“A diferencia de la CEI, la UEE no es, primeramente, una unión política sino económica. Sin una integración sólida con otros bloques económicos se desarrollará bastante despacio pues ya que, a excepción de Rusia, la economía de las demás naciones es excesivamente pequeña”, afirma Gueorgui Vaschenko, de la compañía inversora Freedom Finance. \\nEste mismo mes comienzan las negociaciones sobre la creación de zonas de libre comercio entre la Unión Económica Euroasiática y China en un formato de “cinco más uno”. Sobre esa base se puede hablar de la formación de una colaboración euroasiática especial en el amplio sentido de la palabra.'"}, "time": 1742564607.1396556}