{"duration": 0.14317703247070312, "input_args": {"text": "' Russian Spies and America\\x92s Reality TV Election By Finian Cunningham\\nNovember 14, \" Sputnik \" - After months of mudslinging and vitriol, US President-elect Donald Trump was greeted this week by a chummy President Obama with a cozy fireside seat at the White House.\\nSome media outlets sniped at Trump\\x92s surprise election calling him the \\x93first reality TV star to become president\\x94. In truth, the whole US political system seems to be a reality TV show.\\nIn the weeks up to polling day on November 8, Democrat candidate Hillary Clinton and large sections of the US media were denouncing Trump as a \\x93Russian stooge\\x94. Trump\\x92s alleged friendliness towards Russian President Vladimir Putin was said to be proof that the Republican candidate was a \\x93Kremlin agent\\x94. The Kremlin rejected the accusations as fatuous, pointing out that there was not a scintilla of evidence.\\nThe claims, however, were not merely electioneering rhetoric to smear Trump. The Obama administration officially weighed in to accuse Russia of state-sponsored hacking of computer systems and \\x93interfering in the US election\\x94 to get Trump elected. The White House based its provocative allegations on an assessment made by the Director of National Intelligence and Department of Homeland Security. In other words, US accusations of Russian subversion could not have been leveled in a more serious way.\\nThat means, if you follow this logic, that Trump is now heading to occupy the White House thanks to Russian espionage and propaganda influencing the vote in his favor. So, what then was outgoing President Obama doing holding photo ops with \\x93Comrade Trump\\x94 in the Oval Office, smiling and exchanging pleasantries? At one point, the incumbent Commander-in-Chief said he was \\x93rooting for Trump\\x92s presidency to succeed because if it does then America will succeed\\x94. Hold on a moment. Only days before this avuncular tete-a-tete marking the \\x93peaceful transition of power\\x94, Obama\\x92s administration and the mainstream media were labelling Trump as a Russian fifth columnist. Obama had also mocked Trump as being \\x93uniquely unqualified\\x94 to be president with access to the nuclear keys.\\nIt is notable how US media claims of Russian spying and interference suddenly ceased the day after Trump was elected. Granted, there have since been lame attempts to make something sinister out of the news that Russian diplomats were admittedly in touch with Trump and Clinton campaign aides before the election. Apart from that damp-squib story that the New York Times and Washington Post tried to enliven, for the most part the \\x93Russian hacker\\x94 hue and cry before the election has strangely disappeared from the public arena. In the light of Trump\\x92s cordial reception at the White House and the general acceptance by the Washington establishment including President Obama, defeated candidate Hillary Clinton and the mainstream media, that is stunning evidence that the whole anti-Russia bashing prior to the election was completely concocted and disingenuous. Think about it. How could Trump be painted one day as a beneficiary of Russian espionage, and then the next day literally, he is being feted as the \\x9345th president of the USA\\x94 \\x96 whom, as Obama says, \\x93we are rooting for\\x94? This demonstrates how degraded US statecraft has become. The government, its intelligence services and the country\\x92s supposed quality news media are all prepared to fabricate and propagate lies against a foreign state \\x96 Russia. Obviously, because how could serious concerns one day be so easily jettisoned the next?\\nEvidently, the demonization of Russia as a hostile, interfering foreign power trying to upend US internal politics is a gross falsehood. Otherwise why would Trump be officially accepted? And why have all the grave media claims just vanished? But a much more serious aspect to this official US propaganda is that it illustrates how Russia is being set up more generally as an \\x93enemy state\\x94. Recall that US intelligence agencies were reportedly preparing to launch cyber attacks on Russian infrastructure all on the back of claims that Russia was hacking into the American presidential elections. If somehow US cyber attacks were carried out to cripple Russian industries and public utilities that would have constituted an act of war. Russia would have been obliged to respond, and the whole dangerous dynamic could have escalated to an all-out war.\\nIf US government and its intelligence agencies, as well as supposedly independent news media, are seen to be so disingenuous, then that destroys their credibility on other matters. Can you believe anything they say about Russia with regard to allegedly threatening European security or committing war crimes in Syria? For his part, Donald Trump also plays a starring role in the US democracy charade. During their fireside meeting in the White House, the billionaire property tycoon called Obama a \\x93very good man\\x94 and said that he would seek his counsel in the future. This is the same \\x93very good man\\x94 whom Trump had earlier accused of being the \\x93creator of the ISIS [Daesh] terror group\\x94. Along with Clinton, Trump had rallied his supporters to view Obama as a treasonous criminal for waging illegal wars in the Middle East.\\nWell, that\\x92s a spectacular U-turn by the fiery, big-mouth anti-politician Trump. If he can so quickly accommodate himself to such apparently hated political enemies and effectively drop all charges then one wonders what else Trump will renege on? Will he really \\x93drain the swamp\\x94 of Washington\\x92s oligarchic establishment? Will he deliver on \\x93making America great again\\x94 by investing in the \\x93forgotten people\\x94 who elected him? Will he really de-escalate American overseas militarism and NATO aggression towards Russia? It was surely a good thing that Hillary Clinton was not elected as president. Her warmongering record as former Secretary of State speaks for itself, as does her overt Russophobia.\\nBut we should not be under illusions that a Trump presidency represents a new contrite and cooperative America. An American president is only ever a figurehead for a system and structure of power. That system relies on militarism and war to project US hegemony in the world. Without hegemonic relationships and imperialist conduct, US capitalism as we know it would collapse. And Trump is a raw-toothed capitalist. His early selections show a preference for further neoliberal deregulation of capital, as well as surrounding himself with his family and business cronies. Trump may be a pragmatic businessman inclined to form relations free from ideology. Potentially, that is a good thing for improving US relations with Russia and other foreign powers. Nevertheless, it would be naive to expect one individual to radically change a political system. It is not hard to imagine that when Trump enters the White House formally in 1o weeks that the military-intelligence-corporate apparatus of American capitalism will impress on him how the system works. And he will oblige. Trump\\x92s polite deference to Obama this week, and vice versa, shows in an unintended way what Obama meant when he said \\x93we are all on one team\\x94. That \\x93team\\x94 is the American oligarchy. It is not the American nation. Disenfranchised working-class Americans may simply have gotten Trump into the \\x93team\\x94 \\x96 against their genuine aspirations for radical democratic change. The rapid disappearance of Russian hacker allegations as well as Trump\\x92s anti-establishment bombast suggest that American \\x93democracy\\x94 is all just one giant reality TV show.'"}, "time": 1742563182.978527}