{"duration": 0.07955718040466309, "input_args": {"text": "'Iraq’s lawmakers have voted in favor of a reciprocal travel ban on U. S. citizens if President Donald Trump’s administration does not rescind its decision to prohibit the entry of Iraqis. [When Barack Obama blocked Iraqi refugees from entering the United States for six months in 2011, the   parliament took no action.  On Monday, Iraqi lawmakers voted to call on the   Baghdad government to “respond in kind to the American decision in the event that the American side does not to withdraw its decision,” reports Agence   (AFP) citing Iraqi member of parliament (MP) Hakim   who quoted the text of the decision that was read during the parliamentary session. “Parliament voted by majority on calling on the Iraqi government and the foreign ministry to respond in kind,” declared MP Zamili. Iraqi MP Sadiq   reportedly confirmed that “the vote was for a call on the government” to enact a reciprocal ban. Al Jazeera points out, “The [Iraqi parliament] vote on Monday is not thought to be binding on the government of Prime Minister Haider   whose government has made no official comment on the order. ” Haider’s foreign ministry has urged the Trump administration to review the ban. The recent vote by Iraqi lawmakers came in response to President Trump’s executive order to ban citizens traveling on passports from seven   nations  —   Iraq, Iran, Syria, Sudan, Somalia, Libya, and Yemen  —   from entering the United States for at least 90 days in an effort to strengthen America’s refugee vetting process. “Importantly, however, Lawful Permanent Residents of the United States [green card holders]  …     will be allowed to board U. S. bound aircraft and will be assessed for exceptions at arrival ports of entry, as appropriate. The entry of these individuals, subject to national security checks, is in the national interest,” notes the U. S. Department of Homeland Security (DHS) in explaining the executive order, which President Trump signed on Friday. The executive order also allows the U. S. government to “prioritize refugee claims” from members of persecuted religious minorities in the predominantly Muslim countries covered under the ban, such as Christians and Yazidis. In 2011,   Obama instituted a similar ban, although it is unclear if it included the religious minority exception. There were neither protests nor backlash from the mainstream media in response to Obama’s measure. A 2013 article by ABC News, titled “Exclusive: US May Have Let ‘Dozens’ of Terrorists Into Country As Refugees,” revealed: As a result of the Kentucky case, the [Obama] State Department stopped processing Iraq refugees for six months in 2011, federal officials told ABC News  —   even for many who had heroically helped U. S. forces as interpreters and intelligence assets. One Iraqi who had aided American troops was assassinated before his refugee application could be processed, because of the immigration delays, two U. S. officials said. In 2011, fewer than 10, 000 Iraqis were resettled as refugees in the U. S. half the number from the year before, State Department statistics show. The Kentucky case refers to the discovery in 2009 of two   Iraqi terrorists living as refugees in Bowling Green who ultimately admitted in court that they had attacked U. S. soldiers in Iraq. One of those terrorists, Waad Ramadan Alwan, entered the United States through Syria. Moreover, the seven nations covered by the order, including Iraq, had been previously identified as “countries of concern” under the Obama administration. “These seven countries were designated by Congress and the Obama Administration as posing a significant enough security risk to warrant additional scrutiny in the visa waiver context,” notes DHS. Unlike President Trump, Obama failed to announce his temporary ban on Iraqi refugees, which the leftist mainstream media has interpreted as meaning that it was not the former president’s policy to temporarily halt the entry of Iraqi refugees because he never took ownership of the measure. The recent Iraqi parliament vote echoes calls from Iran for a reciprocal travel ban on American citizens. According to the Independent, the   Shiite militia coalition dubbed the Popular Mobilization Units (PMU) also known as the Popular Mobilization Forces (PMF) and Hashd   has also been critical of Trump’s national security policy, “calling for a ban on issuing visas to Americans visiting the country and for those already in Iraq to be expelled. ” Shiite powerhouse Iran has also vowed to implement legal, political, and reciprocal measures in response to the U. S. policy, announced the Islamic Republic’s Foreign Affairs Ministry on Saturday. The   Baghdad government is close to Iran. “We are against this stance from the new administration,” said Iraqi MP Laban, referring to Trump’s national security order, adding, “We hope that the American administration will rethink  …     this decision. ”'"}, "time": 1742561919.1457112}