{"duration": 0.046062469482421875, "input_args": {"text": "'The Cal Poly Students for Quality Education (SQE) club are partnering with The Satanic Temple and San Luis Obispo   Action to sponsor a   “Demonic  ” Satanist event on campus. [“In celebration of free speech and satanism on the left, SQE is partnering with other progressive orgs to claim space!” declared Cal Poly SQE in a flyer posted to their Facebook page. “One night only! #ReclaimCSU #DumpTrump #FreeSpeechNotHateSpeech #MILO. ”  The headline of the flier also reads “GOD COULDN’T SAVE AMERICA IN 2016  …     TIME TO GIVE THE OTHER GUY A CHANCE! One Night Only at the Cal Poly University Union A DEMONIC DOUBLE FEATURE,” and the event will feature two films with satanic themes: Invocation of My Demon Brother (1969) and ReGoreGitated Sacrifice (2008). Cal Poly SQE, along with other progressive activist clubs on campus, have fought tirelessly against MILO’s appearance at Cal Poly, and on Friday heralded UC Davis’ cancellation of MILO’s event. “When we organize, we WIN!” wrote the group in a Facebook post. “#ShutITDOWN! Unbelievably happy for this win —  solidarity with UC Davis students! !! #PowerToTheStudents #DemocratizeUC #ReclaimCSU. ” In  for its own general meetings, Cal Poly SQE claims to fight for “free tuition, housing, food and healthcare for all students,” “women’s rights,” “immigrants,” “queer and trans folks,” and “racial, economic and social justice. ” Cal Poly SQE can now officially add “Satanism” to their laundry list of progressive causes. CORRECTION: The previous description for this article mistakenly claimed that Cal Poly SQE had partnered with The Satanic Temple to host their event. The Satanic Temple have since reached out to clarify that they have nothing to do with the event, and reject Cal Poly SQE’s celebration of the shutdown of MILO at UC Davis. Their full comments, which emphasize The Satanic Temple’s robust commitment to free speech, can be read in a   article here.'"}, "time": 1742561934.0968926}