{"duration": 0.3486461639404297, "input_args": {"text": "\"Vitamin D Deficiency, Dirty Air Doubles Your Risk of Dementia 1 in 4 Americans will struggle with Alzheimer's by 2050 Image Credits: geralt/Pixabay . \\nDementia is one of the most common and debilitating illnesses that older Americans face today. \\nHowever, recent studies have suggested that air pollution may be one of the top causes for the contribution of the disease’s growth. \\nBy 2050, 1 in 4 Americans will suffer from Alzheimer’s. Alzheimer’s is the most potent form of dementia, and often ends in the patient unable to remember how to do daily and necessary tasks like eating or using the restroom. This will rival the current diabetes and obesity crises seen today. \\nRecent studies have confirmed that a variety of environmental factors are at play when it comes to dementia. \\nDoctors have noted that those who are deficient in vitamin D are 125% more likely to develop dementia than those who get in the necessary amount. \\nA vitamin D deficiency can also be associated with brittle or soft bones as well as depression. It is recommended that everyone gets at least 10 minutes of sunlight per day in order to ensure they have enough vitamin D, as well as eat fortified dairy products or salmon, liver and red meat. Vitamin D can also be obtained through supplementation or fish oil. \\nHowever, doctors have found that the biggest environmental risk for dementia lies in air pollution. \\nIn fact, the problem is so great that those who live in a city with high pollution can double their risk of develop dementia within 1 or 2 months living there. \\nRecent studies have also shown that post-mortem examinations of the brains of those who have lived in highly polluted areas contain traces of magnetite. This chemical compound may be partially responsible for the memory impairments associated with dementia. \\nThe risk of developing dementia if you are exposed to air pollution increases exponentially if you are obese. \\nResearchers say that those concerned about the epidemic can combat it by living somewhere with as little pollution as possible, maintaining a health intake of vitamin D and exercising. \\nAccording to research, exercise is imperitive when it comes to staving off the illness. Dr. Laura Baker, who ran a study on dementia and exercise stated: \\n“These findings are important because they strongly suggest a potent lifestyle intervention such as aerobic exercise can impact Alzheimer’s-related changes in the brain. No currently approved medication can rival these effects.” NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles\""}, "time": 1742562227.0755403}