{"duration": 0.05481100082397461, "input_args": {"text": "'  Why You Should Become a Minimalist Why You Should Become a Minimalist February 21, 2013 55 Comments Lifestyle \\nThe most abused word in the English language is “need.” If you’re reading this post, I contend there is little that you actually “need” beyond what you currently possess. You have ample electricity to power your computer in a climate-controlled environment, with running water and food in your well-stocked refrigerator. Why, then, do you always hear people talking about how they “need” more stuff? \\nHumans have a deeply-rooted drive to compete with each other, and advertisers capitalize on this impulse. Take a moment to picture the average person that you meet. What do they have to take pride in? Buying the newest thing allows them to join the club of consumers, and for a fleeting moment to be measured on an equal playing field despite their personal shortcomings. The internal pain of their life’s problems dissipates for the split second they can boast superiority over everyone who doesn’t have the same shiny widget. \\nThis conspicuous consumption creates a self-fulfilling ego-investment in the broken system. Although borrowing money for useless luxury purchases subjugates people into debt slavery, the mentality is “If I paid $30,000 for this hunk of metal and I’m working overtime to pay it off, it MUST be worth it — and so are other things that the commercials are telling me to buy.” Quite literally, we are working jobs we hate so we can buy shit we don’t need . \\nIf you’re reading this blog, you are likely a male aged 25-35 who wants to do one or more of the following: quit your job, travel, explore a location-independent income, get yourself in shape, take charge of a relationship, and learn valuable life skills. A minimalist mentality helps you do all of these things. \\nHaving fewer possessions forces you to properly place a higher value on experiences. This will make it safer and more fulfilling to travel because you are in touch with what truly makes you happy. If you’re working on a side hustle or starting a business, the desire for needless possessions drains your disposable income levels and prevents you from taking risks. “If my business fails, will I have to give up my car lease?” Preempt this loss aversion by having less to lose. \\nIf you want to move to a better city with a higher cost of living, having excess stuff sets a floor on how much rent you’ll pay to house your crap, and in turn how much you can spend on leisure activities. If you’re a distractable person like me, removing visual “noise” from your area makes you more likely to create things with your mind, and less likely to fixate on your environment . \\nThrowing or giving useless things away is a good first step, since possessions have a psychic weight that you may not realize until you rid yourself of them. To fully embrace this mindset, you must also kill the desires that have been inculcated in you since birth. Cut down on your “consumer impressions” by watching less TV and trying to rationally dissect the techniques used in the few advertisements you encounter. Find fulfillment in hobbies and work, rather than chasing the rush and eventual hedonic adaptation from consuming. Much like a drug, successive bouts of consumerism create a higher baseline where your overall happiness is no different, but you end up having a bunch of useless crap that ties you down. \\nGirls can also be troublesome in this endeavor. Ever notice that when a girl spends extended time in your living space, she beings to tell you that you “need” a new this, or a replacement that? A good friend once told me “All human beings have an innate desire to create — most women can’t, so they redecorate.” Limit your exposure to women who attempt to thwart a separation from consumerism. Ironically, men likely to lead a minimalist/nomadic lifestyle are simply more attractive to prime-SMV women. Think about whether the starving artist or the bottle service guy throwing money around ends up getting more ass. As always, watch how women behave rather than listening to what they say when they are protesting your lifestyle change. \\nAsk yourself this: If your house burned down and you had nothing but the clothes on your back, what would you be worth to society and to yourself? How would you feel about losing all of the possessions you own? Most people plugged into the matrix would rather die than think about replacing Aunt Gladys’s vase or baby pictures they haven’t looked at in a decade. This is an illusion. Once you begin to divorce yourself from this emotional investment to “stuff” you will implicitly place more value on your skills and past experiences. \\nMinimalism is not a synonym for frugality or cheapness. I don’t wear a potato sack while pedaling a used tricycle to work every day — I simply choose to allocate my money to experiences (and a few possessions) that will fulfill me and advance my life’s purpose, rather than enslave myself into debt for trinkets that will collect dust somewhere. \\nTaking the red pill is about learning to separate your priorities and desires from those that society forces upon you. I don’t promise that adopting this mindset will make everybody happy, but it will certainly help to clarify what contributes to your individual sense of self, and will allow you to focus on the internal and external traits that exemplify a man of value.'"}, "time": 1742628434.6466742}