{"duration": 0.016164302825927734, "input_args": {"text": "'Donnerstag, 3. November 2016 Betrügt Ritter Sport? Fleisch in \"Einhorn-Schokolade\" offenbar nur vom Pegasus Waldenbuch (dpo) - Droht uns der nächste große Lebensmittelskandal? Offenbar enthält die derzeit euphorisch bejubelte \"Einhorn-Schokolade\" von Ritter Sport statt echtem Einhorn lediglich billiges Pegasus-Fleisch. Das fand ein Labor für Lebensmittelanalyse in Hamburg heraus. \"Ich war sofort skeptisch, als ich hörte, dass die Firma Ritter Sport Einhorn-Schokolade anbietet\", erklärt Lebensmittelchemiker Udo Wörne. \"Jeder weiß doch, dass Einhörner unglaublich selten sind und Schokolade mit Einhornfleisch wohl kaum für 1,99 Euro pro Tafel angeboten werden kann.\" Und tatsächlich: Laboranalysen ergaben, dass in der vermeintlichen Einhorn-Schokolade noch nicht einmal Spuren von Einhorn enthalten sind. Stattdessen besteht das Produkt aus Milchschokolade und mit Lebensmittelfarbe bunt eingefärbtem Pegasusfleisch. Bis auf Kopf, Schweif und Hufe werden fast alle Teile eines Pegasusses verarbeitet. Udo Wörne wundert das wenig: \"Weil Einhorn mit Preisen von bis zu 5.000 Euro pro Kilogramm kaum bezahlbar ist, greifen viele Hersteller auf wesentlich günstigeres Pegasusfleisch zurück.\" Die geflügelten Pferde werden meist ähnlich wie Schweine oder Geflügel massenhaft in großen Hallen gehalten, wobei ihnen in regelmäßigen Abständen die Schwungfedern gestutzt werden, um Fluchtversuche zu unterbinden. Einhörner dagegen gelten als äußerst empfindlich und verenden in Gefangenschaft in der Regel innerhalb weniger Wochen jämmerlich. In Produkten, die tatsächlich echtes Einhorn enthalten, sind daher fast immer wilde Einhörner verarbeitet. Diese werden mit Netzen gefangen und dann mit einem sogenannten Einhornhaken aus Metall ausgeweidet. Geschmacklich unterscheiden sich Pegasus und Einhorn gravierend. \"Einhornfleisch ist sehr zart und hat einen leichten Nachgeschmack nach Regenbogen. Pegasus hingegen ist faserig und erinnert geschmacklich an eine Mischung aus Maulesel und Pute.\" ssi, dan, fed; Foto oben: Shutterstock/Hersteller, Foto unten: Shutterstock Artikel teilen:'"}, "time": 1742628565.8643954}