{"duration": 0.03139472007751465, "input_args": {"text": "'. Obama Pushes ‘Fake News’ Talking Point — It’s A ‘Threat To Democracy’ This piece can be seen as a continuation of \" Red Alert: The War on Alternative Media Has Begun... Print Email http://humansarefree.com/2016/11/obama-pushes-fake-news-talking-point.html This piece can be seen as a continuation of \" Red Alert: The War on Alternative Media Has Begun .\" As Democrats and Hillary Clinton supporters come to terms with a Donald Trump administration, the ‘fake news won him the election’ talking point was pushed to new heights as the outgoing president suggested ‘fake’ media websites are undermining the political process. “If we are not serious about facts and what’s true and what’s not… if we can’t discriminate between serious arguments and propaganda, then we have problems,” Obama said during a news conference in Germany. Obama suggested that ‘fake news’ affects voter opinions of candidates “in an age where there is so much active misinformation, and it’s packaged very well, and it looks the same when you see it on a Facebook page or turn on your television.”Yes folks, the alternative or ‘fake’ media is now able to look the same as CNN, which interviews its own camera people and tells viewers that they are protesters. “If everything seems to be the same and no distinctions are made, then we won’t know what to protect,” Obama said. “We won’t know what to fight for.” In other words, Obama is saying that the rigged playing field has now been leveled, and that’s a problem for the establishment. “Part of what’s changed in politics is social media and how people are receiving information,” he went on to say, adding “It’s easier to make negative attacks and simplistic slogans than it is to communicate complex policies. But we’ll figure it out.” Yeah, because the mainstream media certainly doesn’t engage in negative attacks or simplistic slogans. As we have documented, the ‘fake news’ talking point originated with a far left SJW writer , who spread around a list of websites to avoid if you want ‘real news’. The list included Infowars and Breitbart News. The idea is to attempt to force Google & Facebook to censor conservative websites. The talking point also dovetails with Twitter promising to purge numerous accounts belonging to members of the ‘Alt-Right’, egged on by partisan groups like The Southern Poverty Law Center. Other web tools, such as Quantcast jumped on the bandwagon and introduced tools to identify the so called ‘fake news’ sites. However, the move has rapidly backfired , as people quickly realized the whole talking point is part of a bitter backlash tantamount to censorship . Meanwhile, the Mainstream Media has been caught faking news countless times, which had serious consequences worldwide:'"}, "time": 1742628535.4752378}