{"duration": 0.1591801643371582, "input_args": {"text": "'Like many home cooks, I gave up on steak a while ago. First, meat started showing up on every list of foods to avoid, whether for reasons of health, ethics, economics or ecology. Then, the grill jockeys who blossom in American backyards in the springtime made steak seem impossible in an ordinary kitchen at a minimum, hot and   cooking areas, a dry rub and a spray bottle were required. So I never slowed to ogle the steak case until I started cooking for a   family. The meat aisle seemed to narrow daily. Chicken gets boring quickly pork is dry ground beef grows depressing veal is for the 1 percent. I started tinkering with steak on the stovetop. I had a   skillet and a memory of my mother sprinkling coarse salt into the pan, rather than on the meat. I’d heard rumors of a new method, a departure from the received wisdom that said to put the steak in the pan and leave it alone. After some grisly catastrophes, trying out different cuts, seasonings and heat levels, I had a   new system. It turns out that you truly don’t need a grill to cook a great steak: savory, salty, encased in a barklike crust. You don’t need to marinate or  . You don’t have to know your way around a   chart  —   with its bewildering eyes, rounds, chucks and clods  —   to buy a good one. And at dinner time, laying a few slices of steak next to the whole grains, the roasted vegetables and the leafy greens that (usually) fill most of our plates is an excellent strategy. The preparations are simple. Buy from a butcher, or directly from a producer, whose meat comes from cattle raised in a way that you feel comfortable with. Choose boneless cuts that are thinner (at one inch thick, they cook through evenly on top of the stove) dry them well (to maximize crust) then sear them in an insanely hot pan. Salt the pan instead of the meat, and turn over the steak every 30 seconds or so after the first minute of cooking. If you don’t have a   skillet, now is the time: nothing that gets as hot is also nonstick, and nothing else that is nonstick gets as hot. When and how to salt a steak has been endlessly debated. The salt in the pan clearly helped the crust develop. But when I also presalted the meat, whether for 2 days or 10 minutes, the finished steak was too salty beef has plenty of sodium on its own. I cheerfully abandoned the extra step of presalting. As long as the cooking surface is hot enough, all that turning will yield a magnificent crust and a   interior: juicy and pink throughout, without the usual gray ring under the crust. According to the food scientist Harold McGee, this is because the juices keep flowing instead of collecting in the middle, which makes the interior cook evenly. Keep in mind that this is stovetop steak, not steakhouse steak it will not have the visual punch of a    porterhouse. Grilling bloggers (and there are many) spend days attempting to replicate legendary cuts like the Playboy at Jess  Jim’s in Kansas City, Mo. or the Longbone Cowboy at Nick  Sam’s in Dallas. But steakhouses have   equipment and exhaust systems. The broilers at Peter Luger in Brooklyn heat up to a rumored 1, 800 degrees. Some steaks at Carnevino in Las Vegas are   for eight months. At the chef Michael Mina’s Bourbon Steak restaurants, the steaks lounge in a   bath of clarified butter before touching the grill. That sounds pleasant, but all you really need is a heavy skillet and the right cut of meat. The experts on   steak are not chefs but butchers  —   particularly butchers who were raised by butchers and grew up on a steady diet of meat. Pat LaFrieda, a   meat purveyor in Manhattan, would rather you didn’t buy his sirloin steak. “Sirloin is one of my   cuts,” he said it’s usually lean, making it difficult for home cooks to get just right. “It comes from the love handles of the animal on down,” one place where the fat collects under the skin, instead of working its way into the muscles. And intramuscular fat makes cooking steak at home far easier. “If it’s good quality steak, and you don’t cook it for more than five minutes per inch, you really can’t mess it up,” said Richard Schatz of Schatzie the Butcher on the Upper West Side (his bloody lineage goes back five generations). “Steak is nothing to be scared of. ” Buy steaks that are one inch thick for stovetop cooking they have just the right ratio of surface to interior. “Having the entire surface of the steak pressed against the entire surface of a   pan is pretty much ideal,” said Bruce Aidells, author of “The Great Meat Cookbook. ” That contact between the meat and the hot surface of the pan forms the crust you want much more effectively than if you cooked it in the broiler, where you can’t flip the steak or press down on it to sear it. Steak from   beef can be dry or gamy, but so can   beef. The thing to look for is marbling, the veins of creamy fat that make steak mouthfilling and juicy. Steaks that have the United States Department of Agriculture’s highest grade, Prime, have this marbling. Choice grade is hit or miss, but usually a hit: It can have excellent taste and texture. The next step down is Select and then Standard, an unappetizing category that is rarely labeled. There is a long list of cuts that do just fine on the stovetop. Boneless New York or Kansas City strip, flat iron,   and boneless   are   and tender. Outliers with long muscle fibers  —   cuts like skirt, flank and hanger  —   are less expensive and more flavorful. They are naturally chewy but can be tender when cooked rare and sliced across the grain. Mr. LaFrieda’s favorite cut for home cooking, and now mine, is the “outside” skirt, a cut that’s thicker than the flat “inside” skirt. “I wouldn’t want to call it ‘livery,’ ” he said. “From me that’s a compliment, but some people want their meat very mild. ” For   cuts, a wedge of lemon alongside the steak can do wonders. “It won’t do a lot for filet mignon,” the chef Michael Psilakis said. “But for anything well marbled, anything with some age on it, the acid in the lemon juice just brightens up the taste. ” Around the Mediterranean, meat is rarely served without lemon. After you have bought your steaks, keep them refrigerated until 30 minutes to an hour before cooking. (When they hit the pan, they should be cool, not cold.) Pat them dry with paper towels, then set aside on more paper towels, turning occasionally. Do not worry about “losing” the juices a dry surface helps build that strong crust. Fifteen minutes before dinner, turn the heat on high under your skillet and sprinkle its surface with salt. Do not oil the pan. When you think it’s hot, let it heat some more. If it’s not smoking, it’s not ready. When the heat and the suspense become unbearable, lay your steak in the pan and prepare to flip. As you flip, move it around in the pan so it absorbs the salt. If you like black pepper (I do) add it only when the steak is almost cooked. It burns easily. The total cooking time for a    steak is four to five minutes. The most accurate way to test it is with an   thermometer. Insert it into the side of the steak, not through the top. The temperature will rise significantly after cooking, so 120 to 125 degrees is the range for   meat. For those who don’t want to fiddle around with microtechnology when getting dinner on the table, fingers provide the best intel. The feel of a rare steak quickly becomes different from that of a   one. And if all else fails, remember this: “You’re not cooking in a restaurant,” Mr. Schatz said. “You can always just cut the thing in half and see what’s going on. ” Recipe:   Steak'"}, "time": 1742563074.469387}