{"duration": 0.15209341049194336, "input_args": {"text": "'WIMBLEDON, England  —   Having won the first two sets against the Serbian star Novak Djokovic before the rain came, Sam Querrey had a long night at Wimbledon to consider the prospect of one of the biggest upsets in recent tennis history. He now has a lifetime to savor it, while Djokovic can ponder the Grand Slam that got away. Querrey, a    Californian with a thunderclap serve and forehand, handled the mounting pressure and a total of four rain delays with surprising aplomb to close out his stunning   (6)       (5) victory in the third round on Saturday. Above all, he handled the   Djokovic, who has been in the deepest of grooves, having won 30 straight Grand Slam singles matches and four straight Grand Slam tournaments, including, last month, the French Open for the first time. “Definitely the biggest win I’ve ever had,” Querrey said. “But there’s another match after this, so hopefully I can keep it going, make a quarterfinal of a Slam, which I’ve never done before. ” And yet this was not the same   Djokovic who has deflected power and cruised through many a draw in the past two seasons. “It’s an amazing feeling, obviously, to be able to hold four Grand Slams at the same time,” Djokovic said. “Coming into Wimbledon, obviously, here I knew that mentally it’s not going to be easy to kind of remotivate myself. But the importance of this tournament is so immense that you always find ways to really get inspired and prepare and try to give your best. Obviously, my best wasn’t good enough this year. ” Last year, Djokovic dodged a similar sort of danger in the fourth round at Wimbledon when he rallied from a   deficit over two days to win against another tall,   and   opponent: Kevin Anderson of South Africa. But the   Querrey, relaxed enough between big points to keep flipping his racket in the air and catching it by the grip, was able to slam the escape hatch that Anderson had left ajar. Querrey finished with 31 aces against Djokovic, the world’s premier returner, and dominated in the short rallies, winning 124 points out of 220 in exchanges of fewer than five strokes. “I think Sam has got a really, really tricky game for anybody to play against,” said his coach, Craig Boynton. “He serves huge, and when he’s taking his full cuts at the ball, he’s not going to give you any rhythm. ” Boynton’s other pupil, Steve Johnson, also reached the fourth round, earning a shot at a major upset of his own against Roger Federer. Querrey is scheduled to face the unseeded Frenchman Nicolas Mahut. “It seemed to me Novak was a little bit off, a little edgy,” Boynton said. “A lot of people don’t understand how hard it is for these top guys. What they have to do, day in and day out, is incredible, but look: Novak is going to lose at some point. He’s human. ” Djokovic looked particularly mortal in the early and closing stages of this match, which stretched over two days because of the rain that has continued to rewrite the Wimbledon schedule. Djokovic had not lost before the quarterfinals of a Grand Slam tournament since the 2009 French Open, where Philipp Kohlschreiber beat him in the third round. But on Friday, Djokovic appeared listless and tactically adrift in the second set before play was called off. Though he came back stronger on Saturday, jumping out to a   lead in the third set before play was again stopped because of rain, he faltered with a fifth set in plain view. Djokovic served for the fourth set at   and was unable to close it out. He then lost a   lead in the tiebreaker with a series of uncharacteristic errors as Querrey reeled off six of the next eight points, including the one that mattered most when Djokovic made an unforced forehand error on Querrey’s second match point. Querrey, hardly the most demonstrative of men, celebrated with a leaping scissor kick and a fist pump and then hustled to the net to shake the hand of Djokovic, the champion who had beaten him in eight of their nine previous matches and had blown past him,       in the third round of the 2014 United States Open. Djokovic classily flashed him a   before the handshake. “What makes him so good is he wins those matches where he isn’t playing his best,” Querrey said of Djokovic. “Definitely, yesterday in the second, he lost some momentum. He wasn’t playing like he usually does. Today, I mean, he made me earn it. He’s not a guy that goes away. He made me come out and win those big points. Probably not the best he’s ever played, but not the worst he’s ever played. ” Wimbledon used to be a garden party away from home for the American men. John McEnroe won three titles here in the 1980s, and Pete Sampras won seven in the 1990s and 2000. Andy Roddick reached three finals in the 2000s. But the current generation of American men, led by John Isner and Querrey, has not had nearly that sort of success at Wimbledon  —   or at any other major tournament. The    Querrey, for all his big weapons, was only   in Grand Slam singles matches before his match with Djokovic on Court 1 on Saturday and had to rally from a   deficit in the first round here before beating Lukas Rosol,   in the fifth set. But he has a winning record now, along with a victory for the time capsule. “It’s not career defining, but it’s really exciting,” he said. “It’s something that I’ll always get to have, which is great. ” Djokovic had played no official tournaments on grass this season before arriving at Wimbledon, but then he had played no official tournaments on grass before he won the titles in 2011, 2014 and 2015. But winning a   title like the French Open can be draining in an unexpected way, and there is clearly a cumulative effect on any great champion from all the pressure resisted and upset bids thwarted. In this case, there was also the pressure of a potential Grand Slam  —   winning all four major titles in the same season  —   which no man has done since Rod Laver in 1969. Djokovic won the first two legs, at the Australian Open and the French Open, but the suspense did not last past the first week at Wimbledon. “I don’t think it played as big of a factor, to be honest,” Djokovic said. “Coming into this match, I knew that it’s going to be very close, not easy to break his serve. If he’s on a roll, as he was, it’s really hard to read his serve. He hits his spots really well. And whenever he had a chance from the rally, he was going for the shots. ” But Djokovic has snuffed out many a huge server in his career. The problem against Querrey was that he was not effective enough on his own serve. His   and   speeds are down significantly from a year ago. His winning percentage on his second serve  —   54. 3 percent for the tournament  —   was his lowest at Wimbledon since 2008, and he was able to win only 65 percent of the points on his first serves against Querrey. He finished with 34 winners to 31 unforced errors and a drawn face that perhaps reflected deeper concerns. Asked if he was 100 percent healthy, Djokovic answered: “Not really, but you know, it’s not the place and time to talk about it. Again, the opponent was playing on a very high level, and he deserved to win. ” Acknowledging that you are not 100 percent healthy is not quite giving full credit to the man who just ended your Wimbledon hopes. Querrey, a mellow man in a fraught microcosm, did not complain. He has had his own share of injuries and missed opportunities. At age 19, he reached the third round in his first Australian Open in 2007. Bigger Grand Slam success seemed only a matter of time. But the path has been more arduous than he might have suspected, and there have been major roadblocks in the form of Djokovic, Federer, Rafael Nadal and Andy Murray. “Those guys are just   really good,” Boynton said. “It’s not that our guys aren’t good, but you’re talking to me right now because Novak lost, and it doesn’t happen that often. And there’s a reason it doesn’t happen. To get through that bubble has been very difficult, but Sam got through it today. ”'"}, "time": 1742564592.0633245}