{"duration": 0.1246652603149414, "input_args": {"text": "'WASHINGTON  —   As Chase Sherman was returning home with his parents and fiancée from his brother’s wedding in November, he began to hallucinate. Apparently reacting to synthetic marijuana he took days earlier, he bit his girlfriend and tried to jump out of the back seat of the car as the family drove through Georgia toward Florida. About an hour outside Atlanta, at Mile Marker 55 on Interstate 85, his fiancée pulled over the car and his mother called the police, hoping they would help calm Mr. Sherman, 32. Less than a   later, Mr. Sherman, who worked at a   parasailing business on the Gulf Coast, was dead. He was stunned numerous times with Taser guns carried by two sheriff’s deputies, while handcuffed in the back seat of a rental car. Like other recent episodes involving the police, this one was captured on video, in this case by body cameras worn by the sheriff’s deputies as they tried to subdue Mr. Sherman. The video, a copy of which was obtained in recent days by The New York Times, is similar to recordings of fatal encounters involving law enforcement officers in Chicago North Charleston, S. C. and Staten Island. Each one depicts in stark terms a response from officers that resulted in a death. In this instance, there are no racial overtones: Both Mr. Sherman and the deputy sheriffs are white. The footage from Georgia was released Friday by prosecutors in Coweta County in response to requests from the family and the news media. It shows the sheriff’s deputies struggling to subdue Mr. Sherman as he tried to get out of the car, stunning him repeatedly with their Taser guns while he was handcuffed, and reacting frantically after realizing he was dead. Mr. Sherman’s death was a homicide due to “an altercation with law enforcement with several trigger pulls of an electronic control device,” according to his death certificate, which said that he had been shoved to the floor of the car and that his torso was compressed “by the body weight of another individual. ” “How can they do this when they know someone is having a breakdown?” said L. Chris Stewart, a lawyer for the Sherman family. “Once they started shocking him, how can someone comply when they’re being electrocuted over and over again?” Kevin and Mary Ann Sherman, Chase Sherman’s parents, said they were not sure what had caused their son’s odd behavior. They said they first became concerned when he began acting erratically while they were in the Dominican Republic for the wedding. Chase told his mother that he had taken the synthetic marijuana the day before they traveled there. “He was scared when we were down there,” Ms. Sherman said. “He said he heard different bad things were happening in different countries. He would see a couple of things that weren’t there. He thought people were watching him, and he didn’t want to go anywhere without his mom and dad or brother. ” But his parents said he had seemed fine on the flight back to Atlanta, where they were to change planes and continue their trip home to Destin, Fla. Then, as they waited at the Atlanta airport, Mr. Sherman grew agitated. The family decided it would be better to drive the rest of the way, so they rented a car. Not long into the drive, Mr. Sherman began trying to jump out of the car. “I couldn’t keep him in the car  —   he didn’t know where he was and was disoriented,” Kevin Sherman said. “I couldn’t keep him in the car by myself, so we needed to call for medical assistance. ” A body camera worn by one of the deputies started recording while en route to assist the Shermans. By the time he reached their car, parked on the shoulder of the highway, another deputy was already grappling with Mr. Sherman, who was handcuffed, in the car’s back seat. On the video, Mr. Sherman seemed alternately calm and desperate to get out of the car. To try to stop him, one of the deputies took out a Taser gun and pointed it at him, telling him to stop moving. Mr. Sherman grabbed the Taser gun, and a fight for it ensued. With Mr. Sherman’s mother and his fiancée, Patti Galloway, watching from the front of the car, the deputy shot him several times with the Taser, and the second deputy punched him in the head. The deputies then told the two women to get out of the car, and Ms. Sherman pointed her finger at the two deputies, pleading with them not to stun her son. Mr. Sherman was stunned again, and then he appeared to wrestle away control of the Taser despite still being handcuffed. Moments later, an emergency medical technician who had arrived at the scene tried to help subdue Mr. Sherman. “O. K. I’m dead, I’m dead,” Mr. Sherman said as he was shoved to the floor and wedged between the front and back seats. “I quit, I quit,” he could be heard saying. The medical technician pushed down on Mr. Sherman’s body. “I got all the weight of the world on him now,” he could be heard saying before Mr. Sherman was shocked again. But suddenly realizing that Mr. Sherman was not breathing, the deputy sheriffs and the medical technician pulled him out of the car and began performing cardiopulmonary resuscitation while his parents and Ms. Galloway watched. “There was no way for him to resist,” said the lawyer, Mr. Stewart. “For four minutes and 10 seconds after he said ‘I quit,’ they still tased him and kept him on the ground. That’s torture, and they killed him. ” Mr. Sherman’s death was initially investigated by the Georgia Bureau of Investigation, which made the evidence it collected available to the district attorney of Coweta County, Peter J. Skandalakis. Mr. Skandalakis said Friday that his office’s investigation into Mr. Sherman’s death was continuing. “I really haven’t formed a final opinion about it,” he said, adding that his office had planned to release the video before the inquiry’s conclusion because of “public interest in the case. ” He said he hoped to meet eventually with the Sherman family. In the meantime, the deputies who responded to the family’s request for help have not been suspended, according to Mr. Stewart, and are still working.'"}, "time": 1742563095.9335403}