{"duration": 0.09013748168945312, "input_args": {"text": "\"Print Email http://humansarefree.com/2016/11/president-trump-man-made-global-warming.html Man-made global warming is a hoax perpetuated by the elite to make money and damage the U.S. economy, according to President-elect Donald Trump – and America isn’t going to stand for it anymore. “Obama thinks it’s the number one problem in the world today. I think it’s very low on the list,” Trump said on the Hugh Hewitt show, indicating a major shift in U.S. policy. Trump continued: “You know in the 1920s people talked about global cooling, they thought the earth was cooling. I believe there is weather and I believe there is change and I believe it goes up and it goes down and it goes up again and it changes depending on years and centuries.“ Pointing out that U.S. manufacturing and the economy as a whole has suffered since climate change rules were introduced by global organizations – making everybody poorer, except the elites who profit from the fearmongering – Trump has promised to make America competitive again.Trump is putting his money where his mouth is. According to a member of his transition team, the President-elect is looking at ways to withdraw as quickly as possible from a costly global climate agreement currently being ratified in Morocco. Since Trump’s victory in Tuesday’s election, governments ranging from China to small island states have reaffirmed their support for the agreement at climate talks running until November 18 in Marrakesh, Morocco. But Trump believes the global rules and regulations will continue to harm the American economy and the President-elect wants out. “It was reckless for the Paris Agreement to enter into force before the election,” the source, who works on Trump’s transition team, told Reuters on condition of anonymity. Top Scientist Resigns: ' Global Warming is a $Trillions Scam — It has Corrupted Many Scientists ' 30,000 scientists agree with Trump A staggering 30,000 scientists have come forward agreeing with Trump that man-made climate change is a scam perpetuated by the global elite in order to make money. One of the experts is weather channel founder, John Coleman, who warns that huge fortunes are being made by man-made climate change proponents such as Al Gore . The weather has been so cold for so long that the global warming HOAXSTERS were forced to change the name to climate change to keep $ flow! — Donald J. Trump (@realDonaldTrump) January 29, 2014 If you’re still inclined to believe what Al Gore has to say about global warming, please consider the fact that since he embarked on his climate change crusade, flying around the world on his private jet, his wealth has grown from $2 million in 2001 to $200 million in 2016 – largely due to investments in fake “green tech” companies and the effective embezzlement of numerous grants and loans. From the National Review : “A 2008 survey by two German scientists, Dennis Bray and Hans von Storch, found that a significant number of scientists were skeptical of the ability of existing global climate models to accurately predict global temperatures, precipitation, sea-level changes, or extreme weather events even over a decade; they were far more skeptical as the time horizon increased.” Other mainstream news sources besides the National Review have also been courageous enough to speak out against the global warming propaganda – even the Wall Street Journal published an op-ed piece in 2015 challenging the Anthropogenic Global Warming (AGW) pseudoscience being pushed by global warming proponents. And, of course, there are the more than 30,000 American scientists (to date) who agree with Trump and have signed a petition challenging the climate change narrative – and 9,029 of them hold PhDs in their respective fields. Breaking: Global Warming Data FAKED by Government Many of those scientists who signed the petition were likely encouraged to speak out in favor of the truth after retired senior NASA atmospheric scientist John L. Casey revealed that solar cycles are largely responsible for warming periods on Earth – not human activity . Many more still are likely to sign the petition and speak out against the mainstream propaganda now that Trump has indicated a major change in U.S. policy. By Baxter Dmitry  \""}, "time": 1742562807.0207891}