{"duration": 0.1910092830657959, "input_args": {"text": "'■ White House press secretary Sean Spicer stood by President Trump’s false assertion that millions of illegal voters gave Hillary Clinton her popular vote win. ■ Gag orders seem to be proliferating throughout the federal bureaucracy, but the national parks are taking to Twitter to speak up. ■ A new national security political action committee, assembled by former intelligence officers and national security officials, has begun posting “no spin” research on the president’s business interests abroad. Sean Spicer, the White House press secretary, confirmed on Tuesday that President Trump has long believed that millions of undocumented immigrants voted illegally in the 2016 election, furthering a false claim from the podium of the West Wing briefing room and refusing to rule out an investigation down the road. “He said 3 to 5 million people could have voted illegally, based on the studies that he’s seen,” Mr. Spicer told stunned reporters, acknowledging a statement that Mr. Trump made privately in a meeting with congressional leaders on Monday afternoon. Mr. Trump and his aides repeatedly suggested during the transition period that “irregularities” contributed to his   loss by nearly 3 million ballots to Hillary Clinton. Mr. Trump won the Electoral College, but his    popular vote loss to Mrs. Clinton was the largest for a winning presidential candidate since the disputed election of 1876. Democrats and some Republicans have pointed to that margin to claim that Mr. Trump is an illegitimate president. Such assertions have rankled Mr. Trump deeply. A November 2016 blog post on Infowars, the conspiracy   website run by radio host Alex Jones, posited the idea that roughly 3 million people voted illegally. Mr. Jones has hosted Mr. Trump on his radio show in the past. The assertion was based on tweets from a   voter expert, who claimed to have a study. However, there’s no evidence of the study. And officials in swing states where Mr. Trump secured victory, many of which are governed by Republicans, say that there is no evidence of such fraud. Mr. Spicer also made vague reference to another Pew Research Center study that supposedly backed up Mr. Trump, but the author of the study in question, David Becker, now executive director of the Center for Election Innovation and Research, tweeted again that no such fraud happened. When a reporter pointed out to Mr. Spicer that such widespread fraud would be one of the biggest scandals in American electoral history and asked why the administration isn’t investigating, the press secretary said, “Maybe we will. ” Mr. Spicer, who worked at the Republican National Committee before working for Mr. Trump, declined to say whether he personally believes this claim. “What does it mean for democracy?” a reporter asked about Mr. Trump’s belief. “It means that I’ve answered your question,” Mr. Spicer said. With reports proliferating about executive branch agencies under gag orders, Mr. Spicer told reporters that the White House is “looking into it,” though he didn’t exactly deny it. “I don’t think it’s any surprise that when there’s an administration turnover, that we’re going to review the policies,” he said. It started when the National Park Service retweeted crowd shots this weekend attesting to a smaller audience for President Trump’s inauguration than for Barack Obama’s first in 2009. That prompted a blackout, then an apology, then lots of pretty pictures. “They had inappropriately violated their own social media policies,” Mr. Spicer said. “There was guidance that was put out to the department to act in compliance with the rules that were set forth. ” Well, looks like Badlands National Park has gone rogue. But it looks like    out there. Poor man wanna be rich. Rich man wanna be king. And a king ain’t satisfied, Till he rules everything. “Badlands,” Bruce Springsteen Daring Mr. Trump to make good on his grand infrastructure promises, Senate Democrats on Tuesday will unveil a   plan to rebuild the nation’s roads, railways, airports, waterways and sewer systems over 10 years. “From our largest cities to our smallest towns, communities across the country are struggling to meet the challenges of aging infrastructure,” Senator Chuck Schumer of New York, the Democratic leader, will say. “Our urban and rural communities have their own unique set of infrastructure priorities, and this proposal would provide funding to address those needed upgrades that go beyond the traditional road and bridge repair. ” Republicans resisted President Barack Obama’s push for an infrastructure “surge” for eight years, arguing that the federal government couldn’t afford it and that state and local governments should shoulder more responsibility for improvements. But Mr. Trump has taken up the Democratic cause. “We will build new roads, and highways, and bridges, and airports, and tunnels, and railways all across our wonderful nation,” he vowed in his Inaugural Address. The plan dedicates $180 billion to rail and bus systems, $65 billion to ports, airports and waterways, $110 billion for water and sewer systems, $100 billion for energy infrastructure, and $20 billion for public and tribal lands. “We’re asking President Trump to work with us to make it a reality,” Mr. Schumer will say. Next up from the Trump White House news fire hose: a nominee for the Supreme Court. President Trump has invited Senators Mitch McConnell of Kentucky, the majority leader, and Chuck Schumer of New York, the Democratic leader, as well as both the chairman and ranking Democrat of the Senate Judiciary Committee, to the White House at 3 p. m. Tuesday to discuss the nearly   vacancy on the Supreme Court. The president said a nomination would be announced next week. “We will pick a totally great Supreme Court justice,” Mr. Trump told reporters at the end of an event where he signed executive actions. Mr. McConnell, on the Senate floor Tuesday, said, “I appreciate the president soliciting our advice on this important matter. ” Mr. McConnell blocked consideration of any nominee to replace Justice Antonin Scalia, who died last February, during the final year of President Obama’s term. Former intelligence officers and national security officials have formed a new national security political action committee, called 4DPac (Democracy Development Diplomacy Defense) to publish what they call   research on Mr. Trump’s foreign investments. Their concern: that the president’s business dealings could clash with the nation’s national security interests. Their first targets: India and Turkey, with many more to come. White House aides have been trying to nudge the president to ditch his personal Twitter account and use the official @POTUS handle. After all, presidential communications are supposed to be archived and preserved under specific rules. Think Hillary Clinton’s private server, not something Mr. Trump appeared to approve of during the campaign. It’s not working. He started the day with: He continued with: (That one has the peculiarity of misstating the date of Mr. Trump’s inauguration.) And he has kept going. #MAGA! House and Senate Republicans decamp from Washington on Thursday for their annual retreat  —   this time in Philadelphia. And House Speaker Paul D. Ryan made it official: President Trump will be the guest of honor. Despite a rocky start to their relationship, Walter M. Shaub Jr. the head of the Office of Government Ethics, is apparently still “willing and ready” to help Mr. Trump handle his potential conflicts of interest. Mr. Shaub met with members of the House Oversight and Government Reform Committee in a   session on Monday afternoon at the request of the chairman of the panel, Rep. Jason Chaffetz of Utah. After Mr. Shaub publicly criticized Mr. Trump’s plans this month, Mr. Chaffetz accused him of playing politics  —   prompting Democrats and other watchdogs to come to the ethics monitor’s defense. According to a recap of Monday’s meeting by Representative Elijah E. Cummings of Maryland, the top Democrat on the committee, Mr. Shaub said that his office had not received copies of documents that Mr. Trump referenced at a news conference on Jan. 11, and that it had been provided with no new information. Still, Mr. Shaub said he would help the president, if called upon. There were about nine members of the committee at the meeting  —   eight Democrats and Mr. Chaffetz, according to his spokeswoman, M. J. Henshaw. After Mr. Chaffetz left the meeting with Mr. Shaub, he told reporters: “I think we understand each other better. ” Big Labor may have been With Her, but the unions that represent builders and pavers Love Him. “We have a common bond with the president,” said Sean McGarvey, the president of North America’s Building Trades Unions, after meeting on Monday with Mr. Trump and hearing him promise a major push to rebuild the nation’s infrastructure. “We come from the same industry. He understands the value of driving development, moving people to the middle class. ” If the labor movement divides over Mr. Trump, it would not be the first time. An old saying holds that the building trades would pave over their mothers’ graves if it created jobs. And before Mr. Trump’s rise, unions like the Communications Workers of America and the Service Employees International Union had split with the building unions over the Dakota Access and Keystone XL pipelines, with the former siding with liberal environmentalists and the latter seeing opportunities for work. In this case, the unions may unite with Democrats behind the new president  —   leaving Republican spending hawks in the cold. On his first working day as the country’s new secretary of defense, James N. Mattis spoke with the head of NATO and told him that the United States depends on it and on Europe for   security. The telephone conversation came just a week after Mr. Mattis’s boss, Mr. Trump, called NATO “obsolete,” because, Mr. Trump said, the alliance hasn’t done enough to combat terrorism. Mr. Mattis “wanted to place the call on his first full day in office to reinforce the importance he places on the alliance,” a Pentagon spokesman, Capt. Jeff Davis, said in a statement on Monday night.'"}, "time": 1742563188.9768877}