{"duration": 0.03161025047302246, "input_args": {"text": "'CAIRO  —   Egypt said Thursday that explosive traces had been detected on the bodies of passengers retrieved from EgyptAir Flight 804, which plunged into the Mediterranean Sea in May and killed all 66 people on board. The announcement by the Civil Aviation Ministry offers the strongest suggestion yet that a bomb might have felled the airliner as it flew to Cairo from Paris. Previously, officials had focused on a fire as a likely cause. Still, it was not clear why Egyptian officials had taken so long to draw the conclusion about explosives  —   most of the bodies were recovered from the sea by July  —   and experts said the cause of the crash remained a mystery. “The timing is odd, and the results are very late,” said Shaker Kelada, a former chief aviation investigator with the ministry. The announcement came amid new fears in Egypt over intensifying violence by the Islamic State and affiliated groups. Islamic State militants claimed responsibility for the deadly bombing of a Coptic cathedral in Cairo on Sunday and vowed more such attacks. Egyptian air crash investigations have a record of being slow, opaque and prone to political considerations. The authorities have yet to officially declare the cause of a Russian airliner crash in 2015 that killed 224 people the Kremlin says it was caused by a bomb. Mr. Kelada said it might be no coincidence that the EgyptAir announcement came after the cathedral attack, at a time when President Abdel Fattah   was seeking to galvanize the country against the Islamist threat. “The whole thing is very much politicized,” he said. “Maybe the government thought this was a good time to say ‘terrorism.’ ” No group has claimed responsibility for the EgyptAir crash. Some experts say there could be other explanations for the explosive traces besides a bomb. Readings from the plane’s data and voice recorders, made public by Egypt during the summer, indicated that smoke had spread through the cockpit just before the crash, and that one of the pilots had warned of a “fire. ” Investigators have said they did not know what caused the blaze, but the evidence indicated that the plane broke up in midair after the fire overwhelmed the crew. In September, the newspaper Le Figaro reported that French officials had found traces of explosives on the wreckage, but that their Egyptian counterparts had prevented them from conducting further tests. Egyptian officials cited in the article denied that the French team had been obstructed. The French authorities were cautious about Thursday’s announcement and declined to draw conclusions from it. The French Foreign Ministry said that the investigation would continue, “in order to determine the exact causes” of the crash. In the early months of the investigation, senior Egyptian officials openly favored the bomb theory because it shifted potential blame away from the EgyptAir crew and the company’s maintenance record, and on to the security procedures at Charles de Gaulle Airport, where the flight originated. A senior Egyptian aviation official said the latest crash update had been received by the government in November but was only made public this week for “political reasons. ” The official, who declined to elaborate, was not authorized to speak to the news media and spoke only on the condition of anonymity. Tarek Attiya, a spokesman for the Egyptian police, said prosecutors there would now turn to the French airport. “The prosecution will now have to go through diplomatic channels to uncover what happened,” Mr. Attiya said. “The plane should have left the airport in Paris completely clean. It’s completely their problem. ” Fears of   terrorism have worsened the damage in Egypt’s tourism industry, which has been struggling since the Arab Spring upheavals of 2011. The crash of a Russian airliner over the Sinai Peninsula in 2015 devastated the economy along the Red Sea coast, where the flight had taken off, causing flight cancellations and hotel closings. The slump in tourism is a central factor of Egypt’s foreign currency crisis, which has precipitated a sharp decline in the value of the Egyptian pound and has led to shortages of staples like sugar.'"}, "time": 1742628460.336269}