{"duration": 0.13721585273742676, "input_args": {"text": "'WASHINGTON  —   President Obama vetoed legislation on Friday that would allow families of victims of the Sept. 11 terrorist attacks to sue the government of Saudi Arabia for any role in the plot, setting up an extraordinary confrontation with a Congress that unanimously backed the bill and has vowed to uphold it. Mr. Obama’s   veto of the measure, known as the Justice Against Sponsors of Terrorism Act, is the 12th of his presidency. But unless those who oppose the bill can persuade lawmakers to drop their support by next week, it will lead to the first congressional override of a veto during Mr. Obama’s presidency  —   a familiar experience for presidents in the waning months of their terms. In his veto message to Congress, Mr. Obama said the legislation “undermines core U. S. interests,” upending the normal means by which the government singles out foreign nations as state sponsors of terrorism and opening American officials and military personnel to legal jeopardy. It would put United States assets at risk of seizure by private litigants overseas and “create complications” in diplomatic relations with other countries, he added. “I have deep sympathy for the families of the victims of the terrorist attacks of Sept. 11, 2001, who have suffered grievously,” Mr. Obama wrote. But enacting the measure “would neither protect Americans from terrorist attacks nor improve the effectiveness of our response to such attacks. ” Mr. Obama issued the veto behind closed doors on Friday without fanfare, reluctant to call attention to a debate that has pitted him against the families of terrorism victims. Not long before he did so, Hillary Clinton, the Democratic presidential nominee, who had previously backed the measure, confirmed that if she were in the Oval Office, she would sign it. Donald J. Trump, the Republican nominee, also said he would have signed the bill, calling Mr. Obama’s veto “shameful. ” The leaders of both chambers, Senator Mitch McConnell of Kentucky and Speaker Paul D. Ryan of Wisconsin, have said they expect the override vote to be successful, which requires a   majority. Mr. McConnell’s office said it would consider the veto message “as soon as practicable in this work period,” essentially ruling out the possibility, pressed by opponents of the measure, that the vote could be delayed until after the elections, when lawmakers might feel less political pressure to support the bill. Still, pressure is building on Congress to reconsider the measure, whose passage underlined the lasting political clout of the   families that have long demanded it  —   and the diminishing standing of Saudi Arabia and its supporters in Washington. Mr. Obama argues that the measure would overturn longstanding principles of international law that shield governments from lawsuits, potentially opening the United States to a raft of litigation in foreign countries. But supporters note that those principles already have several exceptions, and contend they are merely seeking to add another narrow one that would allow United States courts to hold foreign governments responsible if they assisted or funded a terrorist attack that killed Americans in the United States. Saudi officials have denied that the kingdom had any role in the Sept. 11 plot, and an independent commission that investigated the attacks found “no evidence” that the government or any senior official funded it. But the commission’s narrow wording left open the possibility that less senior officials or parts of the Saudi government had played a role. The Saudi government has deployed powerful lobbyists and public relations professionals to try to kill the measure. In recent days, it has turned to national security leaders, Fortune 100 corporate executives and retired military personnel for backing. White House officials were making the case to lawmakers that they should sustain the president’s veto. “We continue to make a forceful case to members of Congress that overriding the president’s veto means that this country will start pursuing a less forceful approach in dealing with state sponsors of terrorism and potentially opens up U. S. service members, and diplomats and even companies to spurious lawsuits in kangaroo courts around the world,” Josh Earnest, the White House press secretary, said before Mr. Obama vetoed the measure. He acknowledged that the stance was “politically inconvenient,” given the strong sympathy that exists for the families of the victims. Senator Chuck Schumer, Democrat of New York, called Mr. Obama’s action “disappointing,” and said it would be “swiftly and soundly overturned in Congress. ” “If the Saudis did nothing wrong, they should not fear this legislation,” Mr. Schumer said. In a statement, the Sept. 11 families said they were “outraged and dismayed at the president’s veto” and the “unconvincing and unsupportable reasons that he offers as explanation. ” “When we left at 5 o’clock yesterday, we were feeling very confident that we would have the votes for the override, but we’ve got to maintain that support through until next week,” said Terry Strada, a leading activist on the bill who lost her husband on Sept. 11 and was one of dozens of family members who traveled to Washington this week to lobby lawmakers to continue backing it. “Nobody is going to sleep this whole weekend. ”'"}, "time": 1742564245.168726}