{"duration": 0.07787513732910156, "input_args": {"text": "'Corpses of psychiatric patients were found with head injuries and unexplained bruises. Relatives were not informed of the deaths of their loved ones. The transfers of mentally ill patients were seen as business opportunities. Those were some of the findings of a South African government investigation published on Wednesday that determined that 94 psychiatric patients died of negligence last year after being moved by the authorities in Gauteng Province to facilities that were likened in some cases to concentration camps. The report prompted calls for criminal prosecutions. More than 1, 300 patients under state care were transferred last year from a unit of Life Healthcare Group, a private hospital group in South Africa, to 27 charitable organizations in an effort by the health department in the province to save money. Pretoria, the country’s administrative capital, and Johannesburg are in Gauteng. The investigation was opened last September after 36 patients were found dead after being moved to some of the facilities operated by the charitable organizations. The report, by Professor Malegapuru W. Makgoba, the South African health ombudsman, found that the death toll was nearly 100, however. Investigators found facilities that were overcrowded and “full of hungry patients,” adding that some were wearing pants held together with shoelaces. Other patients complained of rotten food and said they went weeks without medication. The decision to move the patients “was unwise and flawed,” the report said, “with inadequate planning and a chaotic and rushed or hurried implementation process. ” All 27 of the organizations operated under invalid licenses, it said, so patients who were transferred there had died in “unlawful circumstances. ” The authorities in Gauteng Province, along with some of the care centers, could not be reached for comment. “It’s remarkable that only one person has died from a mental   illness,” Professor Makgoba told local new outlets on Wednesday. The others died from “things like dehydration, diarrhea, epilepsy, heart attacks, all other things except mental illness. ” None of the care centers had professional doctors, nurses, psychiatrists or other therapists that normally cared for the patients, Professor Makgoba said in a separate interview on Thursday. “You have state patients in licensed institutions and you put them into unlicensed institutions,” he said. “I was shocked. ” The families of patients, as well as activists and psychiatrists, had vigorously opposed the plan to move the patients, arguing that it was dangerous to send them to facilities that were not equipped to handle them. Christopher Archer, of the South African Society of Psychiatrists, one of the groups that opposed the transfers, said that it was clear that “precipitous action had been taken without proper planning and these patients were moved prematurely before the facilities were property vetted. ” Public health services in South Africa are under enormous strain and severe budgetary constraints, Mr. Archer said in an interview. “There are more patients than there is money and this was considered a move to try to restrain public spending,” he said. “But it turns out it was completely inappropriate. ” The head of the provincial government’s health department, Qedani Mahlangu, resigned on Tuesday, just before the report was published, and there were mounting calls for David Makhura, the premier of Gauteng Province, to do the same. President Jacob Zuma thanked Professor Makgoba for his report, noting that it would help the government “ensure that such a tragedy does not recur in the health sector,” according to The Associated Press, but many South Africans said they were unconvinced. If 94 mental patients had died from official negligence in a “normal democracy,” the entire national government would have been forced to resign, Barney Mthombothi, a former editor of Financial Mail, a South African business publication, wrote on Twitter.'"}, "time": 1742564487.1475716}