{"duration": 0.12024664878845215, "input_args": {"text": "'Illegal aliens who crossed the border as children don’t have to worry about being sent home, President Donald Trump told the Associated Press in a Friday interview. [Illegals enrolled in the President Barack Obama’s “Deferred Action for Childhood Arrivals” DACA program can “rest easy,” Trump said, because “this is a case of heart. ”  Federal enforcement agencies are “not [going] after the ‘dreamers,’ we are after the criminals,” he said, using the Democrats’ ‘dreamer’ euphemism for young illegal immigrants. “That is our policy,” he added. The Friday comments confirm Trump’s reversal of his 2016 campaign promise to stop the DACA   created by Obama during his 2012 reelection campaign. He created the program in 2012 by telling his immigration enforcement officers to provide young illegals with free work permits instead of repatriation orders. The program has allowed at least 770, 000 illegal immigrants to find jobs in major U. S. cities, even though tens of millions of Americans outside the cities are unemployed or have given up trying to find work. Since his inauguration, Trump’s deputies at the Department of Homeland Security have awarded new work permits to illegals who claim they arrived before age 16, despite Trump’s “Buy American, Hire American” slogan. Trump’s support for the DACA program is one of his biggest “” said Mark Krikorian, director of the Center for Immigration Studies. “During the campaign,   Trump had said he was going to end that on day one because it’s an unconstitutional action by the president,” Krikorian told Breitbart News Daily SiriusXM host Alex Marlow on Friday. Krikorian continued: And of course he’s right, it’s illegal. And they’ve done nothing to it. They’ve done absolutely nothing. ” Trump’s   turnabout on DACA means that   reformers who want to reduce the impact of   workers in the job market will need to bring a lawsuit arguing that the federal government illegally awarded work permits to illegal immigrants, say advocates. Trump’s refusal to reverse or even stop the DACA program is also a bad sign for future immigration reforms, says Krikorian. That’s because he could stop the program and then use the resulting public outcry to pressure Democrats to establish   immigration policies. Those policies could include a mandatory requirement that employers check that job applicants are legal residents in the United States. In August 2016, Obama’s chief economist said the federal is imposing the economic pain of five simultaneous recessions on   Americans, thereby pushing millions of   men off jobs, out of the workforce, and into poverty. Roughly 10 percent of American “prime age” men, or 7 million men aged 25 to 54, have dropped out of the nation’s workforce of 150 million. They are not trying to get jobs, and are not participating in the nation’s labor force. “This [dropout] is caused by policies and institutions, not by technology,” admitted Jason Furman, an economist who chaired the president’s Council of Economic Advisors. “We shouldn’t accept it as inevitable,” he told a Brookings Institute expert, Dave Wessel on  August 10. The primary reason for reduced employment is that “the amount [of money] that employers would want to hire them for some reason has gone down,” he said. In February, Trump told that the AP that “DACA is a very, very difficult subject for me   …     It’s one of the most difficult subjects I have because you have these incredible kids. ”'"}, "time": 1742562544.137696}