{"duration": 0.11062145233154297, "input_args": {"text": "'Black Lives Matter activist and Christian minister Nyle Fort, a doctoral candidate at Princeton University who calls for revolutionary violence in the face of “white supremacist terror,” will return to Bucknell University this week. [As a part of an ongoing lecture series organized by the Griot Institute at Bucknell University entitled, “The Black Body (Re) Considered,” activist Nyle Fort will return to campus to “explore the moral and spiritual dimensions of the Black Lives Matter movement. ” His lecture is   by the English department.  In the   2014 issue of Syndicate Theology, a   periodical, Fort wrote,”under conditions of white supremacist terror, revolutionary violence can be an expression of Christian love. ” I addressed Mr. Fort’s work last year in the introduction to an event featuring   editor Milo Yiannopoulos, arguing that that the administration’s liberal politics motivated their respective responses (or lack thereof) to the Yiannopoulos and Fort events. Before Yiannopoulos spoke at Bucknell last February, the administration sent out a   email to calm the community’s concerns over his upcoming visit. Bridget Newell, then the university’s Associate Provost for Diversity, suggested that Yiannopoulos’ values contradicted the “qualities of inclusiveness and respect that we want to emulate” at Bucknell. Although he criticized President Obama and the Black Lives Matter movement in his event at Bucknell, Yiannopoulos argued that “there is stuff left to do on race in America  …    ( ) are still owed something. ” Yiannopoulos addressed the struggles faced particularly by   females, who he suggested are on the receiving end of   institutional discrimination. Just weeks before Yiannopoulos appearance, Fort spoke at Bucknell without the smallest amount of resistance from those in the community on the right. This week, he’ll return to Bucknell in the aftermath of an incident in which Bucknell Professor Marcellus Andrews slandered my peers and me, publicly calling us “racists” and instructing students to “impose a steep and lasting price” on us for organizing last year’s Yiannopoulos event. “I praise Mr. Ciccotta for helping the young and dark understand that there is not much that the administration can do about racism on campus, because y’all can’t,” Bucknell Professor Marcellus Andrews wrote in an email to University President John Bravman and I after I brought my concerns over Andrews’ conduct to the administration. If there were to be “revolutionary violence” at Bucknell, as Fort calls for, who would it be directed towards? In a political climate in which the labels “racist” and “white supremacist” are thrown around arbitrarily without hesitation, and sometimes, without legitimate cause, Fort’s call for violence should be deeply concerning to university administrators that host him on their campuses. Fort even acknowledges that his theories on violence are controversial, but justifies his radicalism by arguing that the theological concept of a god being “one in three persons” is equally controversial, but nonetheless worthy of serious consideration. To say Christian love can embody revolutionary violence is controversial. But so is saying God is “One in three persons”! Just because something is controversial doesn’t mean we shouldn’t take it seriously or even embrace it. The idea of the Trinity is controversial to many as is revolutionary violence. Interestingly, however, most Christians are silent about State violence on black bodies, and yet condemn the very idea of those same bodies engaging in counter, revolutionary violence. He adds that Christians must start to recognize “that the face of Jesus Christ is the body of Michael Brown,” because “Jesus shows up in the suffering of black bodies and all the world’s cruciﬁed peoples. ” Fort, of course, should be allowed to speak, even without a disclaimer from the University, but it is concerning that the same community that took such issue with Yiannopoulos’ brand of provocation and humor gave Minister Fort, and his justification of violence in the name of Christianity, a warm embrace, and will do so again this week at Bucknell a second time. This isn’t a conversation about violence, but rather the failure of university administrations to act objectively when faced with   matters. Last week, before American Enterprise Institute Scholar Charles Murray spoke at Middlebury College, the school’s president Laurie Patton injected her personal politics into the discussion and denouncing his scholarship, claiming that she “profoundly disagrees with much of Mr. Murray’s views. ” In January, Dean of Students Amy Badal attended a candlelight vigil held at Bucknell in response to President Trump’s executive order on immigration. Can students feel comfortable expressing their support of such legislation on campus if administrators like Badal are willing to take such a strong and public stance? Instead of defending my peers and I against Andrews’ threat and accusations of racism, Badal and the administration claimed that I had “mischaracterized” the email (which you can read in its entirety here). The administration argued that the university “values and encourages the free exchange of diverse ideas and perspectives,” despite the texts assigned throughout my economics curriculum consisting almost exclusively of leftist and   market perspectives. University administrators must adopt an objective set of moral principles that isn’t derived from partisan ideology if they are to ensure that all students are treated fairly, educated comprehensively, and so that they can rightfully condemn conduct that infringes upon students’ ability to participate in the tradition of open intellectual inquiry upon which the academy was founded. Tom Ciccotta is a libertarian who writes about education and social justice for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742564462.4087296}