{"duration": 0.05156731605529785, "input_args": {"text": "'Vladimir Putin has begun banning members of the corrupt Clinton cabal from Russia, just days after Vladimir Putin told President-elect Donald Trump he hopes the two nations can rebuild their relationship. \\nVia YourNewsWire \\n\\nMichael McFaul, a close Clinton ally and former US ambassador to Moscow under President Barack Obama, is the first of many to be banned from entering Russia, according to Russian Foreign Ministry sources.\\nMr McFaul, US ambassador in Moscow from 2012-2014, said he had learnt of the ban when applying for a visa to Russia last week. Asked what the purpose of his visit was, McFaul said it was to help presidential candidate Hillary Clinton prepare for what he assumed would be her transition to the White House.\\nNow McFaul, currently a Stanford University professor, is banned from Russia and Kremlin sources say he is the first of many Clinton allies to be banned.\\nMr McFaul said: “I have hundreds of friends in Russia. I’m really sorry that these sanctions will make communicating with people harder. “I was told that I am on the Kremlin’s sanctions list because of my close affiliation with Obama.”\\nThe Russian Foreign Ministry did not publicly confirm the ban, but ministry sources told Russian news agencies McFaul had been added to the sanctions list.\\nHe was not banned because of his support for President Obama, a Foreign Ministry source told the TASS and RIA news agencies, but because of his “active participation in the destruction of the bilateral relationship and relentless lobbying in favour of the Clinton campaign to destabilize Russia.”\\nPresident Putin was one of the first world leaders to congratulate Donald Trump following his election victory, telling the tycoon that he had followed the election closely.\\nRussia is hoping for a “new understanding” and “restored Russian-American relations” according to Kremlin sources, with President Putin said to be “encouraged” by the American people voting to back themselves and reject the prospect of a New World Order totalitarian world government.\\nAccording to sources, Putin believes that the result of the U.S. election proves the globalists’ destructive agenda is deeply unpopular with real people, and when given a chance they will instinctively reject it out of hand.“The American people stood up against the media, the banks, the establishment, everything was against them, but they said enough. They want change.”\\n'"}, "time": 1742561884.8073976}