{"duration": 0.09986543655395508, "input_args": {"text": "'With the year winding down and New Year’s resolutions just around the corner, it’s time to gear up for that   clutter purge. But the thought of tackling the kitchen junk drawer  —   or even taking down the decorations  —   can be overwhelming. So to help motivate you, several organizing professionals offered tips on how to streamline your closets, beat back the toys taking over the living room and, yes, finally deal with that junk drawer. START WITH THE HOLIDAY TRAPPINGS To keep plastic ornaments and Hanukkah candles organized, use small containers you already have on hand, like popcorn and cookie tins or empty shoeboxes and egg cartons. Wrap fragile ornaments in leftover tissue paper or newspaper, or invest in storage containers like archival ornament boxes from the Container Store. For strings of lights and garlands, use zip ties to avoid tangles and put them in plastic bags labeled according to use (tree lights, porch lights, balcony, bushes, etc. ). Zip ties can also be used on wreaths, so that they can be hung on coat hangers and covered with plastic garment bags from the dry cleaner. To avoid a stockpile of holiday cards, “save only those that are meaningful and special,” Tova Weinstock, a professional organizer in Brooklyn, said. “For the others, appreciate them as you receive them and then kindly send them to the trash. ” EDIT YOUR CLOSET Eliminating clothes you never wear is easier said than done. “I don’t believe in ‘If you haven’t used or worn something in a year, get rid of it,’” said Laura Cattano, another organizer in Brooklyn. “How you want to live moving forward is a much better guide for editing than whether or not you actually have used something in the past. ” Focus on the image you would like to project, she said, then start at one end of the closet and review each piece, pulling out those you know you can toss, donate or sell. Try on anything you haven’t worn in a while and consider how it makes you feel or if it could be styled differently. Clothes you have forgotten about could be “your new favorite thing,” she said, while there may be some pieces you wear all the time that should be retired. (If you subscribe to the Marie Kondo method of decluttering, ask yourself, “Does it ‘spark joy? ’”) Sort clothes by type, grouping pants together, then shirts or blouses, jackets or dresses. “If you can’t see it, you won’t wear it,” said Sharon Lowenheim, an organizer on the Upper East Side of Manhattan and the founder of the Organizing Goddess. “So remove dry cleaning bags and hang only one item per hanger. ” Arranging shirts by sleeve length, with the shortest at the front, makes them easier to find, said Ms. Lowenheim, who also subscribes to a rotation method: selecting garments to wear from the front of each section, then hanging them up toward the back after they are cleaned. “If you find yourself continually bypassing an item at the front, that is a signal to you that you just don’t like that item,” she said. “Get rid of it. ” Another way to keep your closet streamlined is to store   clothes out of sight, said Faith Roberson, an organizer in Manhattan and the founder of Organize With Faith. When clothes have been put away for half the year and you’ve done fine without them, “it changes your perspective,” she said. “You can honestly ask yourself, ‘Do I actually love this piece? And if I don’t, why am I holding onto it? ’” TACKLE THE TOYS Organizing pros agree that the best way to keep toys from taking over is to get children involved in selecting some to donate. “Finding a charity that provides toys to less fortunate children is very motivating for a child,” said Ms. Lowenheim, whose    daughter purged her playthings in this manner before each birthday and holiday, starting when she was a toddler. Before that, Ms. Lowenheim said, she would sneak into her daughter’s room while she was sleeping to gather up the games and stuffed animals she was no longer playing with. “When she was around 3, she started noticing if something was missing and would ask me about it,” Ms. Lowenheim said. “At that point, I realized that I had to involve her in the process. ” If they cooperate, be sure to respect their decision, Ms. Roberson said, even if they choose something you wouldn’t have. “Parents think about the money they’ve spent,” she said, or the sentimental value, which can make them reluctant to let go of that American Girl doll or the train set from Aunt Joan. Another strategy is to encourage them to sell the toys they no longer play with, either online or at a garage sale, and keep the proceeds for themselves. Once the toys have been pared down, Ms. Roberson swears by clear shoe or sweater drawers for storage. “They are stackable, they have dividers, are easy to clean, easy to label, and they come in four different sizes,” she said. To help maintain order, “label where each toy goes,” said Ms. Lowenheim, who recommends installing a tall bookcase and putting paints, jigsaw puzzles and other games that tend to leave a mess on the highest shelf. If your child is too young to read, label the containers with stickers or pictures. If everything has “a home” to return to at the end of the day, she said, cleanup will be easier. AND THAT JUNK DRAWER . .. “Don’t waste your time standing over the drawer sifting through it piece by piece,” Ms. Roberson said. Dump everything onto the floor or countertop, divide it into piles and then ask yourself: Do I want it? Does it work? Does it need to be in the junk drawer? If not, where else could it go? “Take it easy, and go pile by pile,” she said. Put things where they belong (like that miniature tube of toothpaste you got from the dentist that should go in your toiletries bag) and discard things you don’t need, like old keys and expired batteries and coupons. To ward off atrophy, buy a drawer organizer, suggested Ms. Lowenheim, who uses expandable drawer organizers from Staples in her own home. “The key thing is to measure the drawer, then find the organizer that best fits the space,” she said. “If it’s too small, it won’t help. ” The reward? “Keeping everything sorted by type,” she said, “will make it easier for you to find something when you need it. ”'"}, "time": 1742562074.8248649}