{"duration": 0.15249419212341309, "input_args": {"text": "'Posted by Madeline | Oct 26, 2016 | 2016 , Daily Blog | 0 | Thanks Gre!\\nBovendien \\nFormer Defense Minister of Canada, Paul Hellyer, has filed a lawsuit along with several others at the State Canada on the CETA treaty. CETA stands for comprehensive economic and trade agreement, a trade which are entered according to prosecutors constitutional and international rights of people with feet. Paul Hellyer called the treaty therefore Comprehensive Trade and Takeover Agreement. With this convention, which comes out of the hat of the international bankers, 62 families will obtain control over almost the entire world. Constitutions of member countries will no longer apply, only the will of the 62 families (the elite) will apply. \\nThe lawsuit was officially filed on October 21 of this year and actually consists of four \\nnamely separate indictments; the federal government does not have the constitutional authority to sign, execute and implement treaties without the express prior authority of Parliament through an Act of Parliament \\nthe federal government has no constitutional right to sign CETA and / or perform without having this treaty first by the Parliament through official channels. (2) the solid majority of the CETA articles and Their Impact encroach on exclusive Provincial spheres or forum-protected by the division of powers under the Constitution Act, 1867 \\nMost of the CETA provisions and their impact undermine exclusive legal rights protected by the Canadian Constitutional Law, 1867 the CETA gouge and extinguishes the constitutionally protected Judiciary in Canada by creating foreign tribunals to determining property and legal issues in Canada without any judicial oversight or Jurisdiction of the Canadian Courts over the disputes; and \\nCETA removes the constitutional legal system by setting foreign tribunals have to judge between property and other legal issues without overlooked may be the Canadian legal system, and various articles of the CETA violate constitutional enshrined rights in the Charter of Rights and Freedoms , and over-rides Charter Guarantees That ground Canada’s ability to mount public programs on Health, Education, Social Services, and public utilities-including the elimination of subsidies, monopolies, and state enterprises for public welfare. In short, the treaty places the rights of private foreign investors about Those of the Canadian Constitution and Canadian citizens. \\nvarious provisions of CETA violated constitutional built-rights enshrined in the document Charter of Rights and Freedoms and transcend guaranteed rights that Canada has the opportunity to develop public programs in the fields of health, education, social services and public funds, including the termination of subsidies , monopolies and state enterprises for the public interest. In short, the treaty puts the interests of private foreign companies over those of the Canadian constitution and its inhabitants. \\nBut this is not all! Paul Hellyer, which is so you can immediately see and hear his call to Canadians and the rest of the world, his mind has put on the roll of the largest crime syndicate has ever known the world, the international bankers, international intertwined the main industries in which the owners of the revenues come from only 62 families. \\nPaul Hellyer remembers the Canada which was separate from the bankers, yet not so long ago. Until 1974 the Canadian government expressed its money itself, there was no such thing as inflation, poverty and debt. Canada was one of the largest financiers behind the allies that Europe was liberated from the Germans at that time. Life was good, cheap and everyone had enough money to do the things they wanted to do. From one day to the issued money creation in 1974 the central banks and money was no longer free. Within a few years, Canada had a huge debt that is recovered just as us on the civilian population through numerous taxes. Paul Hellyer has evidence that this happened in unconstitutional manner and wants to decide turn back to Canada to give it right back himself pressing her money to spend. This affects every Canadian citizen a large sum of money to free education, health, housing, etc. can be paid without causing debts. Paul Hellyer does the same as Foundation for Our Money aims but in a turbo version! He lets no grass grow, does not perform educational skits for the people who maintain this crime for years, Paul Hellyer goes straight for the scapegoat. \\nNow the video of Paul Hellyer where he explains personally exactly what is going on and how they want to approach this. \\nDear readers. This could be the big break. This information should be shared very broadly as to all countries under the thumb are the bankers, the same applies. We can deliver all of this unfair system where our benefit only a handful of people. The power over the creation of money is a sovereign matter since no one has more to do with it. We want a better and fairer world, then this is the opportunity that everyone has been waiting for! \\nPrivatized money is the reason for all wars, privatized money is the cause of poverty, oppression, exploitation, neglect of our elderly and less fortunate. Privatized money is the root of all evil on this beautiful planet. Now is the chance to get out from under the yoke, to stand up for the future of ourselves and our children. Now is the chance to rid the world of those people who make a huge mess for over 100 years with one goal, to keep the creation of money in their hands and with it the power over almost anything this planet has to offer. \\nThe Earth is not a handful of bankers and politicians, the earth belongs to everyone!'"}, "time": 1742563728.3989263}