{"duration": 0.05458974838256836, "input_args": {"text": "'FBI Cops Out on Pressing Charges Against Hillary November 07, 2016 FBI Cops Out on Pressing Charges Against Hillary \\nDemocrat Hillary Clinton heads into the final day of a tight White House race against Republican Donald Trump on Monday with new momentum after the FBI said no criminal charges were forthcoming in an investigation of her email practices. Both Clinton and Trump will spend the day racing across a handful of battleground states that could swing Tuesday\\'s election, which polls show is close but tilting toward Clinton. FBI Director James Comey again sent shockwaves through the race by telling Congress on Sunday that investigators had worked around the clock to complete a review of newly discovered emails and found no reason to change their July finding that Clinton was not guilty of criminal wrongdoing in her use of a private email server while secretary of state. It was uncertain whether the announcement came in time to change voters\\' minds or undo any damage from days of Republican attacks on Clinton as corrupt. Tens of millions of Americans had cast early votes in the 10 days since Comey first told Congress of the newly discovered emails. \\n\"Nothing\\'s going to change between today and tomorrow to help [Clinton] win back\" undecided voters,\" Trump campaign manager Kellyanne Conway said on ABC\\'s \"Good Morning America.\" \\nTrump, who has not said whether he will respect the results of Tuesday\\'s election, questioned the thoroughness of the FBI review and said the issue would not go away. \\nClinton did not mention the FBI finding during her last two campaign events on Sunday. \\n\"That\\'s behind us now,\" campaign manager Robby Mook told CNN on Monday. \\nOn Monday, Trump will hit five battleground states - Florida, North Carolina, Pennsylvania, New Hampshire and Michigan - and close with a late-night rally in Grand Rapids, Michigan. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE!  '"}, "time": 1742562889.660014}