{"duration": 0.27735424041748047, "input_args": {"text": "'As women all over the world celebrated Women’s History Month this March, little attention focused on the number of women who form the backbone of President Trump’s National Security Council. [His two deputy national security advisers  —   K. T. McFarland (pictured above) and Dina Powell, and the person in charge of writing the national security strategy  —   Nadia Schadlow  —   are women.  It’s likely the first time that women have held those positions simultaneously  —   no insignificant fact in a field that’s still  . Together, McFarland, Powell and Schadlow bring different strengths to the table. McFarland is an experienced national security hand, starting at the NSC in 1970, as an    college freshman. “At that time, there were maybe two women who were research assistants, but to be a professional expert on the national security council as a woman, in that era, at the very beginning of the baby boom, that just wasn’t going to be an option for women,” she said. “It wasn’t that we were discriminated against, it just wasn’t thought of. ” It was a momentous time  —   Richard Nixon was president, Henry Kissinger was national security adviser. The issues were the Vietnam War, Paris Peace Accords, opening to China, arms control with the Soviet Union, Middle East shuttle diplomacy. McFarland started at the NSC as the nightshift secretary and left in 1976 as a research assistant. She later returned to government when Ronald Reagan became president, and was one of the highest ranking women at the Defense Department. Her experience served her well for her first challenge on the job: Building an NSC from scratch, particularly since her   Retired Army Lt. Gen. Michael Flynn, had never worked in the White House before. McFarland said she got the call from Trump on Thanksgiving night. Her first call was to her mentor, Kissinger. She then brought him and subsequent cabinet officials in to discuss their experiences. “Since President Trump did not come into office having a long experience in foreign policy and national security, had never been in government before, had never been in office before, I thought it made a lot of sense for us to start at the beginning and look   …     at former national security advisers,” she said. In the meantime, they were talking to Trump every day  —   he was already meeting and taking calls from foreign leaders. “It was a heady time, it was an exhausting time,” McFarland recalls. On January 20, she came into her new office. Her new desk was about 20 feet from where her first desk was, 47 years ago. She placed a call to Kissinger, so the dispatcher could say, “Henry Kissinger, the White House is calling. ” “He was so moved and so touched,” she said. McFarland said the first thing Trump asked her to do is look at North Korea. She convened the deputies at the Departments of State, Defense, and Treasury, the Joint Chiefs, and from the intelligence community, and instructed them to come back in a few weeks with some ideas, and to “think outside the box. ” “Don’t just think about a little bit of sanctions, a little bit of diplomacy. Open it wide, and think of any creative ideas you can and come back to us. And so they did. And what I was very impressed with was they had thought outside the box on a lot of things, and so we were able to craft some really good options for the president on how to deal with North Korea’s nuclear weapons program and that’s the process he’s in now,” she said. “We’ll do this for other issues as well  —   China, Russia, Venezuela, we’re going to look at the whole range of these issues for the president,” she added. McFarland calls terrorism “the challenge of our day. ” She said while there were kamikaze attacks during World War II, today’s terrorists are targeting civilians, not military targets, and are “happy to die as long as they can bring others with them. ” “If you look at the history of warfare, people always wanted to survive,” she said. “This is a threat we’ve never seen before. ” Fellow Deputy National Security Adviser Powell brings to the table 10 years of working on Wall Street and a “get it done” mindset. She first came into the Trump administration as an assistant to the president and senior counselor for economic initiatives. But it also made sense for Powell, an   who was born in Cairo, migrated to Texas when she was four, and worked in the former George W. Bush administration and Congress on defense issues, to expand her role to the foreign policy realm. Powell, who wants to stay out of the spotlight, is working closely with McFarland and Schadlow to help build out the national security strategy. She particularly believes in the economic empowerment of women, particularly in the Middle East. Coming from one   career field to another, she believes that talent will carry one through  —   whether it’s from a male or female. Still, she recognizes that it can be hard for women to be confident in areas where there might not be a lot of other women, and that sometimes there have to be role models to pave the way. Hers were former National Security Adviser and Secretary of State Condoleezza Rice, and former Sen. Kay Bailey Hutchison ( ). Schadlow, in addition to experience in government as a presidential management fellow, brings to the table experience in thinking deeply about   national security planning. Her first assignment in government was at the Department of the Army, where she was first exposed to the military. She later became the Pentagon’s first desk officer for Ukraine after the fall of the Soviet Union, a job that is the equivalent of country director today. Wanting more career mobility, she left the government for the   Foundation, where she researched emerging national security threats  —   which she said was great preparation for her current role. Her role models include Marin Strmecki, senior vice president at the   Foundation, but also her mother, who migrated from Italy to give her three daughters more opportunity, and encouraged them to be independent. Supporting McFarland, Powell and Schadlow is another echelon of accomplished women, such as Victoria Coates, senior director for strategic assessments at the NSC.  Coates (pictured right) is a protégé of Sen. Ted Cruz ( ) Gov. Rick Perry ( ) and former Defense Secretary Donald Rumsfeld. She last served as Cruz’s senior national security adviser. She has a Ph. D. in art history, and recently published a book on the history of democracy. Her role models were her mother, who is a chief compliance officer at a large firm, and Rumsfeld. She also credits McFarland with being a great friend and mentor. A typical day for them involves lots and lots of meetings. McFarland said a typical day involves getting up at 5 a. m. getting into office by 7 a. m. and receiving an intelligence briefing of major developments. Some days, she has an additional briefing on specific topics. Around 10 a. m. she usually goes in to see the president with her   Army Lt. Gen. H. R. McMaster, the CIA Director and other national security officials for the president’s daily briefing. “Then the rest of the day, I’m chairing meetings, I’m meeting with people on the NSC staff in the intelligence community, members of the White House staff, and then my day usually goes until seven or eight or nine o’clock at night,” she said. On one recent day, there were meetings ranging from Montenegro, Kurdish independence, to North Korea. The job is not particularly family friendly. The main obstacle? Classification issues. Much of the work can only be done in a secure environment inside the White House. That means mom has to live and work in Washington, D. C. McFarland’s five children are grown, but Powell, Schadlow and Coates all have young children who live at home outside of D. C. “You’re still not ever going to have it all  —   it’s impossible,” said Schadlow, who has three children. “I wished many times that I was a little more engaged with what my kids were learning in school, and I had the time to do a deep dive and just be part of that intellectual life that they’re experiencing, and in some ways I can’t do it    especially now,” she said. She said while there are more services for working mothers these days, it’s still a challenge. “Of course there are tradeoffs. My house is always a wreck,” she laughs. “It’s real. It’s a constant balance. ” Coates, who has a    daughter and    son, says it makes the time spent together more special. “I went to spring training with my son. We had 36 hours together  …     but they were 36 really good hours,” she said. Schadlow said as difficult as it is to be away from family, it can also be a luxury just to focus on work. “When you’re at home as a working mom, you’re constantly multitasking all day long, managing everyone’s schedules. A lot defaults to the mom, I think, still,” she said. “And here  —   no cell phones in your office, no way to communicate really    in the office. It’s really all about your work. ” “I’m so happy to have the opportunity. It’s a luxury to jump in and focus on one thing for awhile, and knowing that everyone at home has sort of agreed to just take care the  ” she said. At the NSC, the women say they’ve found no difference in treatment due to their gender. McFarland calls Trump an “equal opportunity guy. ” “President Trump is an equal opportunity guy in the sense of, I’m in a room, and as I said, I’m in the president’s daily briefing in the morning, and sometimes there’s only one woman in the room, and sometimes the vice president’s national security adviser  —   also a woman, Col. Andrea Thompson, is there, and the president will look at us and expect us to answer the tough questions just as readily as anybody else,” she said. “In fact sometimes when the really tough questions come, I look around at my male colleagues who are afraid to say something, and I’m the first one to jump in and say, ‘Well you could think of it this way, Mr. President.’ And often the only other person who jumps right in with me is the other woman,” she said. Her advice to women in any career field? “Don’t settle. Don’t settle for second best. And don’t quit, and don’t give up. ”'"}, "time": 1742561971.1990554}