{"duration": 0.09167265892028809, "input_args": {"text": "'Two months after the election heard around the world, I’m worried that the more things have changed, the more they have stayed the same in Congress. [Voters swept the Republican Party into full control of the federal government, expecting us to honor our promises to put a stop to a reckless status quo that is mortgaging their futures.  So what’s the first order of business for Republicans in Congress? To pass a budget that doesn’t balance.  Ever. To pass a budget that will put our voters on the hook for $9. 7 trillion of new debt over ten years. Is that really what we campaigned on?  Is that why voters turned out to the polls? I know it’s not why Kentucky sent me to Congress.  The budget’s defenders tried to sell me on it as just a “vehicle to repeal Obamacare. ”  I’ve even been told that it’s “just numbers” and not really a budget.  The legislation’s own title clearly says otherwise.  The numbers “really” say it will add $9. 7 trillion of new debt. But if these are indeed only numbers on a page, and if what’s in the budget doesn’t actually matter, then why don’t we at least use numbers that balance?  Why don’t we put a vision into the budget that represents what we as Republicans claim to stand for? Republicans say we are the conservative party.  Are we?  During President George W. Bush’s eight years, and under a partially Republican Congress, the national debt doubled from $5 trillion to $10 trillion.  The response?  “Well, he had Democrats to deal with, and if we could ever take all three branches of government, things would be different. ” The debt has gone on to nearly double again under President Obama, and finally the conservative party  —   the supposedly conservative party  —   has won all three branches.  So what are we looking at?  More debt, with the same kind of numbers we rightfully railed against during the Obama years! Congress has special rules for passing a budget that we can use to repeal Obamacare.  I’m all for that approach, as long as that budget moves us toward fiscal responsibility.  As a physician, you won’t find anyone more excited to get rid of Obamacare than me.  But are we so hurried that we can’t even be bothered to vote on a budget that represents our conservative view and doesn’t add $9. 7 trillion to the debt? This is outrageous, and it is unacceptable.  And I’m fighting back. We don’t need to choose between either repealing Obamacare or putting forward a budget that balances.  We can do both  —   without a single Democrat vote!  We have no excuse.  On Monday, the Senate will go on record on an amendment I am offering that will strike and replace the current budget resolution.  My alternative presents a conservative vision by freezing   spending and balancing by 2024  —   without changing Social Security.  And it still repeals Obamacare! It even starts in 2018 so as to allow agencies plenty of time to adjust to new spending levels.  By containing zero specific cuts to any function of government, it also offers Congress and the administration a chance to work together to prioritize spending. Is there really a difference between how a Republican and a Democrat Congress act?  We’ll soon find out.  But I need your help.  I need your senator and representative to hear from you with a clear message that says, “Enough is enough. ” Let’s balance the budget and repeal Obamacare.  Let’s do both now, and let’s honor our commitment to be the change voters called for in November.'"}, "time": 1742562054.9456065}