{"duration": 0.08778095245361328, "input_args": {"text": "'The truth about Zika: It\\'s a grand medical hoax \\nMonday, October 31, 2016 by: J. D. Heyes Tags: Zika virus , medical hoax , infectious disease (NaturalNews) One of the most interesting things about the Zika virus is that it is not a new ailment. It was first discovered in monkeys in 1947 and in humans in 1952, according to a fact sheet from the World Health Organization .While researchers have admittedly probably learned more about the virus since it was first identified, some of the health problems now being associated with Zika – such as microcephaly in newborns – have never before been seen, leaving many to wonder if there isn\\'t some sort of conspiracy being devised by globalists to suit their political agenda.For instance, according to TruthWiki , an investigative site that has recently delved into the history of the disease, populations in the past that were heavily infected with Zika never reported a single case of a newborn with a shrunken head. The current outbreak is far from being the only one. In the 1960s, outbreaks occurred in Oceania and Southeast Asia. And in 2007, the so-called \"Yap epidemic,\" which occurred on the Yap main island – part of the Caroline Island chain in the Western Pacific – infected three-quarters of the population. But no cases of newborn birth defects, like microcephaly, were reported. So the current hysteria over microcephaly allegedly being tied to Zika appears completely unwarranted. Will we see another \\'swine flu fiasco\\' with the Zika vaccine? The same year, TruthWiki reported, using funding that was provided by the Bill and Melinda Gates Foundation, a genetically altered version of the virus was developed by Oxitec (Oxford Insect Technologies), a British biotechnology company. Roughly two years later, in the fall of 2009, Gates helped usher in the first outdoor trials of genetically modified transgenic Aedes aegypti mosquitoes, which are the species known to transmit the disease. They were released ostensibly to fight the spread of mosquito-borne diseases including dengue, yellow fever and Zika , among others. The plan was to get the GM mosquitoes to mate with females to produce offspring that would die soon after birth, thereby halting the spread of the disease. But, TruthWiki noted, there was another agenda.In May 2014, the WHO and the Brazilian government colluded to spread propaganda that there were nearly 1 million \"suspected\" cases of Zika in Brazil, and recommended that the deadly poison pyroproxyfen be spread, to include areas of drinking water. The propaganda disseminated was that since mosquitoes were breeding in those areas of standing water, then they too had to be treated with the chemical, which was then spread primarily over poverty-stricken areas.The next thing we know, scores of cases involving microcephaly in Brazil began cropping up. And they were then blamed on Zika. Coincidence? Many think not. What\\'s more, there were really only about 500 children born malformed – not 5,000-plus as originally reported, TruthWiki points out.As TruthWiki notes further, Zika is a mild viral infection – always has been – and resembles the typical cold or flu. Most of those afflicted with it suffer a low-grade fever, some pain in their joints, a skin rash and conjunctivitis. In other cases, people have no idea they\\'ve even been infected. If symptoms appear at all, they may last up to a week. But like chicken pox, a one-time Zika infection can provide lifelong immunity. While severe cases of Zika may require hospitalization, they are rare, as are Zika-related deaths. Overkill? And yet, despite the virus\\' relatively mild symptoms, the U.S. government is set to pay a Japanese Big Pharma firm as much as $300 million to develop a vaccine , Natural News reported recently. If that\\'s not overkill, then nothing is – especially given the fact that most vaccines contain harmful substances and preservatives .Another disease outbreak \"emergency.\" Another vaccine with even more harmful chemicals and preservatives will go on the market. In fact, due to the \"gravity\" and \"dire nature\" of the Zika emergency, we may even see mandatory vaccination as we did with the swine flu fiasco in the mid-1970s. Then, a mandatory program of vaccination for the illness, which only killed one person, led to a dramatic spike in Guillain-Barre syndrome, in which the immune system attacks the nerves, causing paralysis. Ironically, today the Centers for Disease Control and Prevention is claiming that Zika may be causing GBS.Propaganda anyone?Read the entire TruthWiki report on the Zika hoax here . Sources:'"}, "time": 1742562606.7878773}