{"duration": 0.03164196014404297, "input_args": {"text": "'A jury in a South Carolina federal court handed down the death penalty to   Dylann Roof. The verdict by the 12 jurors came in after a   deliberation. [The jury of 10 women and two men recommended that Roof be put to death in each of the 18 counts where he was found guilty of murdering nine people in Charleston’s Emanuel African Methodist Episcopal Church in June 2015, CNN reported.  “From what I’ve been told, I have a right to ask you to give me a life sentence, but I’m not sure what good that will do anyway,” Roof told the jurors while representing himself during the sentencing phase of the trial. “But what I will say is only one of you has to disagree with the other jurors. ” No one did, and the jury quickly responded with the verdict of death. Judge Richard Gergel is expected to formally deliver the sentence on Wednesday morning. Breitbart Texas previously reported that some of the jurors cried during testimony provided by victim’s family members in the sentencing portion of the trial. Even court staff members were brought to tears during the emotional testimony. One such witness, Denise Quarles, the daughter of Myra Thompson, told the jury how much her mother meant to her. They talked several times a day, and her mother would make financial sacrifices for her even though they did not have a lot of money, Breitbart Texas reported. She said she still starts to dial her mother’s phone number but then she remembers that she is not there. Judge Gergel told a local television station he would have been stunned had the jurors not cried. As the sentencing portion of the trial began, Breitbart Texas reported that Roof announced he rejected the inanity defense. “(T) here’s noting wrong with me psychologically,” he told the jury. The judge had previously ruled Roof was competent to stand trial. He was instructed by the judge not to approach any witnesses or jurors while representing himself in the trial. A manifesto had previously been uncovered where Roof expressed “deeply racist,     and white supremacist views,” Breitbart News reported in June 2015. In the journal attributed to Roof, he wrote, ““Ni —    are stupid and violent. ” He continued, “Jewish agitation of the black race” is the reason blacks behave the way they do. He apparently supported segregation as a solution to race relations. “Segregation was not a bad thing   …     It existed to protect us from them. ” Dylann Roof was found guilty in the murders of nine black Americans. Those included six women and three men who were gathered at the church to pray. Editor’s Note: This article has been updated with additional information. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX.'"}, "time": 1742628587.0490246}