{"duration": 0.13239073753356934, "input_args": {"text": "'ANN ARBOR, Mich.  —   Amanda Delekta, a sophomore at the University of Michigan and political director of the College Republicans, was ecstatic when her candidate, Donald J. Trump, won the presidential election. But her mood of celebration quickly faded when students held an evening vigil on campus  —   to mourn the results  —   and her biology teacher suspended class on the assumption, Ms. Delekta said, that students would be too upset to focus. She was outraged. “Nobody has died,” Ms. Delekta said. “The United States has not died. Democracy is more alive than ever. Simply put, the American people voted and Trump won. ” She circulated an online petition and accused the university president of catering to the liberal majority by suggesting that “their ideology was superior to the ideology of their peers,” as she put it, when he sent out an email publicizing the vigil and listing counseling resources for students upset by the election. Three days later, she was invited to meet with the president in his office. “I was completely shocked that he even read the letter,” she said. “That was definitely a new thing. It was very exciting. ” Conservatives and liberals on campuses across the country have been clashing throughout the campaign  —   and throughout this year of protest. But the conflict has gained new intensity since the election, and students, faculty and administrators say they expect tension to get worse once the presidential baton is passed on Inauguration Day in January. Conservative students who voted for Mr. Trump say that even though their candidate won, their views are not respected. Some are adopting the language of the left, saying they need a “safe space” to express their opinions  —   a twist resented by   protesters. Administrators are struggling to maintain a balance between political factions. But some college presidents have entered the fray with statements that seem more sympathetic to the left, in some cases provoking a backlash. To Todd Gitlin, a professor of journalism and sociology at Columbia University, and a veteran of student protests in the 1960s, it all seems familiar  —   and a possible harbinger of conflict to come. Dr. Gitlin said that the ’60s, about which he wrote an influential book, were often seen as a radical decade, but that it was more accurate to call it a polarized time. Conservatives were strong on campus, particularly in the early part of the decade, he said, and it was only later that the academic culture came to be viewed as majority liberal. “I was at Michigan for two years in ’63 to ’65, so I can tell you there was a very widespread   movement,” Dr. Gitlin said. For conservative students like Ms. Deletka, the messages from university officials, seemingly assuming that everyone on campus was upset about the election result, were particularly offensive. At Columbia, the provost, John H. Coatsworth, sent out an email on Nov. 21 that began, “The presidential election has prompted intense concern for the values we hold dear and for members of our community who are apprehensive about what the future holds. ” The day after the election, Biddy Martin, president of Amherst College in Massachusetts, called for tolerance and acknowledged that some people might be rejoicing. But she also said in a speech on campus: “In the mirror we see virulent forms of racism, misogyny, homophobia and other ills and we see them celebrated by some as though the expression of our worst impulses were the definition of human freedom. ” Amherst also saw a bit of a controversy surrounding a professor who was singled out for his views. The professor, Hadley Arkes, an emeritus professor of political science, pulled out a bottle of champagne in his political science class to celebrate Mr. Trump’s election. An editorial in The Amherst Student newspaper criticized him for bringing alcohol to class, and suggested that college officials hold him “accountable” for supporting a candidate the paper’s editorial board thought was bigoted, homophobic and misogynist. “There are students on this campus whose lives and civil liberties will be compromised in the next four years,” the editorial said. “Not only does Amherst’s nonpartisan stance invalidate their struggles, but brash and insensitive political partisanship creates irreparable scars. ” Dr. Arkes said that he had offered students in his class a spectrum of ways to express their feelings postelection. For students who were grieving, he recited the Kaddish, the Jewish mourner’s prayer. For those who were celebrating, he quoted Churchill about not gloating: “In victory, magnanimity. ” Finally, in what he said was intended as a comic gesture, he pulled out the champagne. But mindful that he might be accused of offering an alcoholic beverage to underage students, he did not uncork it. Now it seemed, he said, that some people just could not take a joke. “There is no urbanity or humor  —   or the wit to deal with challenge, grave or light,” he wrote in an email. “They can respond only in ‘boilerplate,’ quite predictable reflexes  —   so predictable that I did predict it easily. ” The mood is muted at more conservative campuses, students and professors said. Erika Meitner, a creative writing professor at Virginia Tech, said that there was a strange quietness on her campus, and that she was not sure whether to think of it as détente or the calm before the storm. Ms. Meitner said that as a leader of small poetry seminars, she knew a lot about her students’ private lives. So she has been struck by how they have kept their reactions to the election to themselves. “It’s really weird, because I know all of their breakups,” she said. “I know when their cat died, because they write poems about this. ” Tim Sands, the president of Virginia Tech, was one of the rare college presidents who explicitly suggested in his postelection message that students might have a range of emotions about the outcome, or as he put it, be experiencing feelings “from vindication to shock, from outright fear to enthusiasm. ” Michigan students say that before the election, attitudes were less intense. “It was more like friendly banter, little side comments, but it wasn’t really serious,” said Anna Giacomini, an elected representative to the student government for the liberal arts college at the university. Now tensions are heightened. According to a campuswide message from Mark Schlissel, the university’s president, bias incidents have been reported. A student walking near campus was threatened with being lit on fire because she wore a hijab. Other students were accused of being racist for supporting Mr. Trump. A few days ago, Ms. Delekta and two fellow Republican students sat down at a local restaurant, Sava’s, to talk about the campus mood with several students with   views. The conversation soon grew tense as the students were unable to agree on almost anything. Ms. Delekta described how she had been offended when a classmate wondered why as a “white female,” she had not voted for Hillary Clinton. She resented what she saw as identity politics on campus. “My identity is so much more than my race and my gender,” Ms. Delekta said. “We’re all so much more similar than we think. ” She was able to separate Mr. Trump’s policies from his personal attitudes toward women, she said later. “I’m not electing a grandpa or a babysitter,” Ms. Delekta said. Ibtihal Makki, a   senior in a pink hijab who is studying biopsychology and neuroscience and is chairwoman of a student government diversity committee, objected to conservatives on campus saying they needed safe spaces to express their views. “To turn around and say that they need safe spaces after their candidate won I think is ironic and hypocritical,” Ms. Makki said. In the past, she added, conservatives did not understand the need for safe spaces, “because they never needed it, because they don’t have any of the identities that made them feel that way. ” White conservatives like Ms. Delekta, Ms. Makki said, are not as vulnerable as someone with dark skin or who is wearing a hijab, because she cannot be identified as a conservative by any outward signs. Another student, Maryam Ahmed, said she had been one of about 1, 000 students who marched in the campus vigil the day after the election. She said the marchers were positive but feared for their safety. Her friends were passing on text messages  —   which turned out to be false  —   warning that white militias were going to invade the streets of Ann Arbor. “There was definitely a divisiveness that came on campus postelection,” she said. “The election was like a needle poking into a bubble. ” She said she was hopeful the climate would improve, but added: “I could be wrong. It could get worse. ” When Ms. Delekta met with Michigan’s president, Dr. Schlissel, she brought Enrique Zalamea, president of the College Republicans, along with her. They proposed a kind of unity campaign for campus, in which students would march with signs saying, “I am a Wolverine,” to stress their similarities. And they suggested some   sessions on inclusivity and diversity. Dr. Schlissel told them that it was too early for such activities, and that they should allow a   period first, Ms. Delekta said. She was deeply disappointed. “That’s not my personality,” she said. Dr. Schlissel declined to comment on the mood on campus, but a spokeswoman, Kim Broekhuizen, said Ms. Delekta’s account of the meeting was accurate. Still Ms. Delekta was heartened by the meeting, seeing it as a sign that conservatives might be invited into the fold. She is hoping to score tickets to the inauguration, the beginning of a new era, she believes, for better. But she will not be surprised, she said, if tensions flare anew. “It’s going to be right back in the media,” she said. “I think people are going to start to get worked up again, whether it be in excitement or frustration and fear. ”'"}, "time": 1742561986.2940547}