{"duration": 0.09971880912780762, "input_args": {"text": "'BEIRUT, Lebanon  —   Government soldiers made advances in the center of the besieged city of Aleppo on Tuesday, as heavy aerial bombardments by Syria and its ally Russia extended into a fifth day,   media organizations said. Syrian state television reported that troops loyal to the government of President Bashar   had captured the   neighborhood of Farafra, near the city’s medieval citadel. The Syrian Observatory for Human Rights, a monitoring organization based in London, confirmed that government forces had pushed into the center of Aleppo as part of their siege of   areas in the eastern part of what was once Syria’s commercial capital. Airstrikes on Tuesday afternoon killed at least 23 people, including nine children, in the Sha’ar and Mashhad neighborhoods in eastern Aleppo, the observatory reported. The ground offensive, if confirmed, would be a major development in the battle for Aleppo, where fighting has raged off and on since 2012. However, social media accounts associated with opposition fighters said the government was exaggerating the magnitude of its advances. Insurgents from groups that identify themselves as the Free Syrian Army said they had blocked government forces trying to advance on the eastern sections of Aleppo’s Old City. Rebels have been fortifying the eastern neighborhoods under their control for years, and any ground offensive would probably be long and grinding, international officials have said. The Syrian military has not demonstrated an ability to quickly take and hold large territories, even with help from thousands of foreign militiamen commanded by Iranian Revolutionary Guards, including fighters from the militant group Hezbollah and from Iraq, as well as a small number of Russian ground troops and heavy application of Russian and Syrian air power. Over the last week, Aleppo has been the site of some of the most ferocious fighting in Syria’s   civil war, after the collapse of a   negotiated by the United States and Russia. Mohamed Abu Jaafar Kahil, the head of a medical charity, said in an electronic message that conditions in Aleppo were desperate. “Hospitals have no more room to receive even one more case, due to the huge number of casualties, of wounded and of martyrs who died today at the hands of barbaric Russian warplanes backed by Syrian warplanes,” he said. Mr. Kahil recounted “nonstop bombing” by rockets and other artillery, including cluster munitions, which maim and kill indiscriminately. He estimated that dozens had died and hundreds had been wounded. Dr. Mohamed   a radiologist reached via the messaging app Viber, described a dire situation at the hospital where he worked. “We’re running short of drugs we’re running short of respirators,” he said. “We don’t have baby milk, especially for newborns. ” Bassem Ayoub, an Aleppo resident, said food and medical supplies were running out. “Every day is worse than the last,” he said. “Every day I leave my house, I keep in mind that I might not be back. All the people are doing the same here. We’re living day by day. ” Humanitarian organizations were trying to repair a water pumping station serving the eastern part of the city. Hanaa Singer, the Unicef representative for Syria, said officials were worried that the supply of drinking water might run out, putting 100, 000 children at risk of dehydration. There was no progress on diplomatic efforts to halt the bloodshed. In Germany, Chancellor Angela Merkel denounced the violence but expressed skepticism that a   zone, one of the ideas for stanching the violence, could be instituted. “What we currently see on the ground is very, very brutal and clearly targeting civilians,” she told reporters in Berlin, according to The Associated Press. She added that the recent attacks amounted to a “deep, deep setback. ” “It clearly now is up to the Assad regime, and also Russia, to take a step to improve the chances for a   and humanitarian aid,” she said. The conflict in Syria has by some estimates left 500, 000 people dead, displaced half the population and, according to the United Nations, has sent more than 4. 8 million people into neighboring countries as refugees. The United States has accepted about 12, 500 Syrian refugees over the past year, Anne C. Richard, the senior State Department official for refugee issues, said on Tuesday. That exceeds the goal set by President Obama of admitting as least 10, 000 during the fiscal year. But it is a tiny fraction of the total number of refugees. Ms. Richard also announced that the United States would provide more than $364 million in additional aid,   of which is to be provided to Syrians who are inside the country. That brings the total humanitarian assistance the United States has provided during the conflict to more than $5. 9 billion. Donald J. Trump, the Republican candidate for president, has called the program to admit Syrian refugees a security risk and has said it should be suspended. Defending the program, Ms. Richard said the vetting was “extremely rigorous” and added that the State Department wanted to bring in a higher number of Syrian refugees next year, though there was not a specific target. '"}, "time": 1742563264.848786}