{"duration": 0.07862496376037598, "input_args": {"text": "'This is not a close call.\\nIt is not a judgement call.\\nIt is not subject to interpretation.\\nIt is a flat-out criminal offense. \\nAs secretary of state, Hillary Clinton routinely asked her maid to print out sensitive government e-mails and documents — including ones containing classified information — from her house in Washington, DC, e-mails and FBI memos show. But the housekeeper lacked the security clearance to handle such material.\\nIn fact, Marina Santos was called on so frequently to receive e-mails that she may hold the secrets to E-mailgate — if only the FBI and Congress would subpoena her and the equipment she used.\\nIt is a crime to knowingly, say much less intentionally, give access to classified information to someone who is not cleared to receive and handle it.\\nSantos also had access to a highly secure room called an SCIF (sensitive compartmented information facility) that diplomatic security agents set up at Whitehaven, according to FBI notes from an interview with Abedin.\\nFrom within the SCIF, Santos — who had no clearance — “collected documents from the secure facsimile machine for Clinton,” the FBI notes revealed.\\nJust how sensitive were the papers Santos presumably handled? The FBI noted Clinton periodically received the Presidential Daily Brief — a top-secret document prepared by the CIA and other US intelligence agencies — via the secure fax. \\nThis is a second and even more serious federal crime. \\nThe PDB is one of the most-seriously classified (top secret) documents routinely prepared for the President; it contains up to the minute information relating to various events and activities all over the world.\\nIt is also a crime to allow, through negligence or worse, intentional act, someone who is not cleared to have access to a SCIF.\\nThere is no possible argument that Hillary can raise of “retroactive” classification; that is, material that wasn’t classified at the time she handed it, when it comes to the PDB since those are always classified.\\nThat the FBI knew about this months ago, which is now a documented fact, and did not demand that Hillary be charged with myriad federal offenses related to said intentional and knowing conduct that threatened our national security is an outrage.\\nThe FBI has now proved that it is not a law enforcement agency but in fact it is a rogue band of armed thugs acting in direct support of a person who they know has repeatedly and willingly, on a daily basis, violated long-standing Federal Law and in fact have documented in writing that she violated those laws and yet they have intentionally and knowingly refused to act to bring her to justice .\\nThe FBI has documented in its own writing that it is an equally-guilty party to Hillary Clinton’s willful and intentional violation of federal law as it pertains to the handling of classified information on a literal daily basis and thus can no longer be treated as a legitimate law enforcement or investigative agency by the people of the United States.\\nIt does not matter what James Comey says; we are supposed to be a nation of laws and our Constitutional Republican form of government demands nothing less. When you declare a willingness to allow someone to violate the law with impunity you, and everyone who allows you in that position of authority to do so stand with them and in direct opposition to the Constitution of the United States. \\nOriginally posted at Market Ticker .\\n'"}, "time": 1742562034.4755254}