{"duration": 0.07364368438720703, "input_args": {"text": "'Trump is the Nation’s Abuser-in-Chief Trump is the Nation’s Abuser-in-Chief By 129 \\nAs an emotional abuse survivor, I get an eerie feeling watching Donald Trump. \\nIn fact, a checklist of 30 tactics used by an emotionally abusive partner , published by the blog Live Bold and Bloom , reads like Donald Trump’s debate prep to-do list. \\nOne of the telltale signs of such abuse, for example, is rooted in humiliation: \\n“They humiliate you, put you down, or make fun of you in front of other people.” \\nThis seems to be a cornerstone of Trump’s political speech — like making fun of a disabled reporter , or placing the women who accuse Hillary Clinton’s husband of sexual misconduct in the audience at the last debate. (I wonder if Trump has ever heard that expression about glass houses and throwing stones.) \\n“They accuse you or blame you for things you know aren’t true.” \\nFor example, accusing Hillary of laughing at a rape victim, which she didn’t do . \\n“They make excuses for their behavior, try to blame others, and have difficulty apologizing.” \\nLike the “locker room talk” apology t hat wasn’t. Tilting At Women, an OtherWords cartoon by Khalil Bendib. \\n“They call you names, give you unpleasant labels, or make cutting remarks under their breath.” \\nRemember Trump’s use of pejoratives like Crooked Hillary, Lyin’ Ted Cruz, Little Marco Rubio, Low Energy Jeb Bush, and “Pocahontas”? (That last one refers to Elizabeth Warren.) There’s even a Donald Trump insult generator online based on the candidate’s penchant for name-calling. \\n“They make subtle threats or negative remarks with the intent to frighten or control you. “ \\nIn the second debate: “You’d be in jail,” Donald threatened Hillary, if he becomes president. \\n“They play the victim and try to deflect blame to you rather than taking personal responsibility.” \\nAfter the 2005 video of Trump boasting about sexually assaulting women was leaked, he claimed the entire world was in a conspiracy against him — the media, the Clintons, the Republicans. \\nPoor Donald, everyone is calling him out for the racist and misogynist that he is. \\nMost familiar to me as an abuse survivor were Trump’s deflections of Hillary’s jabs during the second debate. In my experience, any time you confront an abuser with their past bad behaviors, you get one of three responses. \\nFirst, they might say they never did that. That thing never happened. This is called gaslighting . The name comes from a 1944 film called Gaslight . It’s used when someone attempts to manipulate you into doubting your own lived experiences. \\nSecond, they’ll turn your critique back onto you. You don’t like that they humiliated you in front of your friends? You’re too sensitive. That’s your problem. It’s just one more item on the long list of things that are wrong with you . \\nLast, they reply to your critique of them with what they don’t like about you. And sometimes, the responses can be quite arbitrary. \\nOh, Hillary doesn’t like that Trump bragged about assaulting women? Well, Bill Clinton had affairs. Never mind that Bill isn’t running for president, or that his well-litigated past isn’t the issue at hand. \\nTrue, Bill Clinton won’t go down in history for being faithful, but that doesn’t answer the question about Trump’s record with women and his qualifications to be president. \\nEmotional abuse can be hard to pinpoint when you’re the one being abused. So Donald Trump has just provided us all with a valuable service by demonstrating before a live TV audience what emotional abuse looks like in action. \\nThe best way to deal with a bully? Remove them from your life.'"}, "time": 1742563034.9119487}