{"duration": 0.13959240913391113, "input_args": {"text": "'NATO fighter jets on constant watch for Russian jets above Baltic states 11/08/2016 \\nDAILY MAIL Russian fighter jets are constantly probing Nato’s defences over the Baltic states, with more than 600 ‘interceptions’ so far this year. Ironically, considering the history, the Nato pilots defending the skies over Estonia, Latvia and Lithuania are often German. Seven German fighter pilots are based at an air base at Amari, west of the Estonian capital Tallinn. Lieutenant Colonel Swen Jacob, the commander of the German pilots, said they often flew as close as 10 yards from the Russian jets and one occasion a Russian pilot gave him a middle-fingered salute. Lt Col Jacob joked to the Washington Post : ‘Maybe he watched too much “Top Gun”.’ But the situation in the Baltic is deadly serious, with the Russian air force clearly under orders from President Vladimir Putin to be more aggressive in the air. An RAF Eurofighter Typhoon plane takes off over a field of poppies. German Typhoons are currently based in Amari, Estonia, and it is possible they will be replaced by British Typhoons in January The Typhoon jet (left) is flown by the German air force and the RAF aswell as the Italian and Spanish air forces. It is matched in the air with the Russian Sukhoi SU-27 Flanker (right) The German pilots have scrambled 34 times since they were posted in Estonia on August 31, with Sukhoi SU-27 Flanker jets the most common threat. The Russian planes are free to fly along an international airspace corridor running between St Petersburg and the Kaliningrad enclave and west as far as the Danish island of Falster. Russian pilots often fly without transponders, making them virtually invisible and increasing the danger of mid-air collisions. Lt Col Jacob told the Post: ‘The fighter aircraft are almost always armed to the teeth. Six kinds of missiles. They could carry up to 10.’ This Sukhoi SU-27 Flanker showed off its abilities at the Farnborough air show a few years ago, before the icy blasts of the new cold war descended on Europe The Flanker’s full armoury includes Vympel R-27, R-73 and R-77 air-to-air missiles, Zvezda Kh-35U anti-ship missiles, S-8 and S-13 rockets and a collection of guided bombs and cluster bombs. The French air force also has four fighter jets based at Šiauliai in Lithuania. Both the French and German contingents are due to be rotated out of the area in January and replaced by other Nato pilots, including possibly RAF pilots from Britain. \\n+20 Goodybe Mr President: Russia’s President Putin (left) has massively increased Russian military spending and anti-Western rhetoric and most experts agree he has outmanouevred President Obama (right) militarily and politically The Baltic states seized their independence from the collapsing Soviet Union in 1991 and, increasingly worried about the Russian bear on their doorstep, joined Nato in 2004. Putin was enraged that Nato was within 100 miles of Russia’s second city, St Petersburg, and in the last year he has been increasingly probing Nato’s defences in the region. Yesterday Nato chiefs announced plans to put together a force of 300,000 troops which they can put on ‘high alert’ in eastern Europe. Relations between Russia and the West have plunged in the last year, with Moscow’s insistence on backing its Syrian ally, President Bashar al-Assad, at all costs leading to serious tension with the US, Britain and France. Most Nato members cut their defence spending dramatically since the Soviet Union collapsed in 1991 but Russia has been bolstering its military capabilities, holding parades involving more than 100,000 troops each year. \\n+20 Nato soldiers stand on a pontoon bridge constructed across the Vistula river in Poland during the NATO Anaconda-16 exercise earlier this year Moscow has been throwing its weight around in recent years – in 2008 Russian troops humiliated the Georgians and in turn the White House by invading South Ossetia and Abkhazia in support of pro-Moscow rebels. Then in 2014 Russia annexed Crimea and supported ethnic Russian rebels in the eastern Ukraine. President Obama’s ‘Russian reset’ policy, which was designed to improve relations with Moscow, has looked increasingly like a policy of appeasement. \\n+20 At the weekend Russian soldiers, dressed in World War Two era uniforms, commemorate the 75th anniversary of a famous parade in 1941 when the Red Army headed out of Moscow to take on the Nazis Russia’s President Vladimir Putin has been accused of attempting to interfere with the US election process by hacking into the emails of senior members of the Democratic party and recently moved the Iskander nuclear-capable missiles into the Kaliningrad enclave, on the borders with Poland. But Nato members like Estonia, Poland and Romania, who are feeling increasingly threatened by Moscow, are now being promised a rapid deployment force. Nato Secretary General Jens Stoltenberg told The Times this week: ‘We have also seen Russia using propaganda in Europe among Nato allies and that is exactly the reason why Nato is responding. We are responding with the biggest reinforcement of our collective defence since the end of the Cold War. ‘We have seen Russia being much more active in many different ways. ‘We have seen a more assertive Russia implementing a substantial military build-up over many years; tripling defence spending since 2000 in real terms; developing new military capabilities; exercising their forces and using military force against neighbours,’ added Mr Stoltenberg. \\n+20 Russia recently moved its nuclear-capable Iskander missiles into the Kaliningrad enclave. The missiles could take out targets in Berlin Britain’s permanent representative to Nato, Sir Adam Thomson, told The Times it would currently take Nato six months to deploy a force of 300,000, which was simply too slow. At the weekend British military intelligence officers issued a warning over a new Russian ‘super tank’ which they claim is far superior to anything which is available to Nato. The document claims that Britain’s Challenger II main battle tank could be overpowered by the Kremlin’s new Armata tank. Officials believe the new Russian tank is ‘revolutionary’ and blames the government for failing to provide a proper response. The new tank has several highly advanced features including an un-manned turret which makes the machine safer for crews Yesterday’s military parade in Red Square commemorated a pivotal moment in World War Two when German forces were turned back from the gates of Moscow'"}, "time": 1742563524.160485}