{"duration": 0.13900470733642578, "input_args": {"text": "'La Cruzada Albigense amenaza el cetro Cristiano (Ronaldo) RESUMEN DE LA JORNADA 11 DE LA LIGA SANTANDER 2016-2017 Resumen de la jornada Sevilla 1-2 Barcelona \\nUn Leo Messi deslumbrante, prodigioso, quimérico, enajenado, mirífico, sobrehumano, preternatural, mágico y defraudador de Hacienda llevó a su equipo lideradamente a la victoria. Su tanto y el tanto de Luis Suárez dieron, por tanto, la vuelta al tanto de Vitolo, lo que les permite seguir a dos puntos del albino líder de la clasificación. Real Madrid 3-0 Leganés \\nCon Ronaldo desaparecido fue el galésico Bale quien se echó el equipo a la espalda. Con sus diez compañeros subidos a caballito encima de él, el galileico fue capaz de hacer dos goles. Morata, desde la chepa del galileo, cerró el marcador ante un Leganés impotente que acabó pidiendo la Viagra. Villarreal 2-0 Real Betis \\nLos astados llegaron al Madrigal, plaza difícil, con casta y empuje. Faenas de estética hueca pero efectiva de Trigueros (una oreja) y Roberto Soriano (oreja y vuelta al ruedo). Celta 2-1 Valencia \\nSe adelantó el Valencia gracias a un penalti. Parejo fue el encargado en transformar la pena máxima en gol, lo que dejó caras de sorpresa en los celtipetas, que empezaron a llamar a Parejo “El Druida” o “El hombre que transforma cosas en gol” y a tratarlo como una especie de semidiós de la cultura galaica. Superaron el estupor con dos goles que finalmente permitieron a los celtiñas llevarse la victoria y el corazón aún palpitante de Parejo. Espanyol 0-0 Athletic \\nEspanyol y Athletic terminaron firmando el armisticio en el campo de Cornellá tras un partido muy disputado: sorprendieron los vascos al situar el regimiento de Húsares cerca de la portería rival. Los cañones españolistas no tardaron en responder con varias andanadas pero sin dejar grandes ocasiones claras. Ya en la segunda mitad, la infantería de los partidarios de Isabel II y la Reina Regente pusieron en serios aprietos a las tropas Carlistas, pero sin obtener el resultado esperado. A destacar la actuación de Espartero. Las Palmas 1-0 Eibar \\nJonathan Viera logró el tanto de la victoria para Las Palmas al límite del tiempo aunque en realidad fue en el minuto 94 de partido porque el último minuto fue el 90 y ahí no había marcado gol, con lo que en propiedad estaba fuera del tiempo pero, si nos abstraemos de términos físicos, podemos llegar a la conclusión de que nuestra forma de considerar el tiempo está ligada al modo en el que pensamos porque, al fin y al cabo, nosotros no vemos realmente el paso del tiempo sino que, simplemente, sufrimos una serie de experiencias distintas de las que tenemos almacenadas en nuestros recuerdos y es esta diferencia lo que nuestra mente consciente percibe como tiempo. Importante victoria de los palmípedos. Osasuna 0-1 Alavés \\nLucha de santos en el Sadar: por un lado, el nuevo fichaje del Alavés, Christian Santos, y por otro el delantero pamplonica, San Fermín. Mayor fortuna tuvo el alavita que marcó un gol con el aura, tanto que daba la vitoria a los de Victoria. Real Sociedad 2-0 Atlético de Madrid \\nEl Atlético de Madrid llegó a Anoeta con más ilusión que otra cosa; ilusión que se vio desbordada por la dura realidad (dos penaltis). La actitud de los realistas fue demasiado para los de Simeone, que se encontraron con un realismo sucio, complejo, enfangante, que les dejó postrados en un estado de total impotencia. Granada 1-1 Deportivo \\n“Todo va bien, la vida te sonríe, crees que nada puede hacerte daño… hasta que el inútil de tu portero se mete un gol en propia meta. Oh, hados… oh, Fortuna… oh, portero”. (Gaizca Garitano, entrenador del Deportivo). Málaga 3-2 Sporting \\nLo más destacado del encuentro fue descubrir que en el equipo asturiano juega un señor que se apellida Cop. Cop significa “policía” en inglés -de ahí la película Robocop (Robot Policía o Polirobot, porque en realidad “cop” se traduciría más bien como “poli”)- pero Cop, el jugador, es de nacionalidad croata y a estas horas la redacción de El Mundo Today aún no ha logrado averiguar qué significa “Cop” en dicha lengua, aunque sí se sabe que, en catalán, “cop” significa golpe. Seguiremos informando.'"}, "time": 1742563750.3201003}