{"duration": 0.04814028739929199, "input_args": {"text": "'The addition of the incendiary   writer Milo Yiannopoulos to Friday’s lineup for the HBO   series “Real Time With Bill Maher” quickly proved controversial on Wednesday evening when another guest, the journalist Jeremy Scahill, said he would not appear on the show because of Mr. Yiannopoulos’s booking. Mr. Scahill, a   and editor of the news site The Intercept,  announced his decision on Twitter only hours after Mr. Yiannopoulos’s scheduled appearance was made public. Mr. Scahill said that allowing Mr. Yiannopoulos to appear on “Real Time” was “many bridges too far. ” “He has ample venues to spew his hateful diatribes,” Mr. Scahill said in a statement. “There is no value in ‘debating’ him. Appearing on ‘Real Time’ will provide Yiannopoulos with a large, important platform to openly advocate his racist,   campaign. It will be exploited by Yiannopoulos in an attempt to legitimize his hateful agenda. ” But Mr. Maher defended his decision. “My comments on Islam have never veered into vitriol,” he said. “Liberals will continue to lose elections as long as they follow the example of people like Mr. Scahill whose views veer into fantasy and away from bedrock liberal principles like equality of women, respect for minorities, separation of religion and state, and free speech. If Mr. Yiannopoulos is indeed the monster Scahill claims  —   and he might be  —   nothing could serve the liberal cause better than having him exposed on Friday night. ” Mr. Yiannopoulos, an editor at Breitbart News, often engages in provocative displays to highlight what he considers the intolerance of the political left. At an appearance in December at the University of   he mocked a transgender student while displaying her photograph during his talk. This month, a planned appearance by Mr. Yiannopoulos at the University of California, Berkeley, was canceled when protests against the speech turned violent and led to rioting that caused around $100, 000 in damages. He had been invited to speak by the school’s College Republicans group. In a Facebook video posted after the speech’s cancellation, Mr. Yiannopoulos said that the “hard left” was to blame, having “become so utterly antithetical to free speech in the last few years. ” “They simply will not allow any speaker on campus, even somebody as silly and harmless and gay as me, to have their voice heard,” he added. Other schools have withdrawn invitations to him in recent weeks. In January, a man was shot during protests outside a speech Mr. Yiannopoulos was giving at the University of Washington in Seattle. Last summer, Mr. Yiannopoulos was barred from Twitter after helping rally other users to direct racist and sexist remarks at Leslie Jones, a star of “Ghostbusters” and “Saturday Night Live. ” Mr. Maher, a comedian who is liberal on many issues  —   he donated $1 million to a “super PAC” supporting President Barack Obama’s   in 2012  —   features guests from across the political spectrum on “Real Time. ” His show on Friday was set to include the comedian Larry Wilmore, the actress Leah Remini and former Representative Jack Kingston, Republican of Georgia.'"}, "time": 1742562095.4307191}