{"duration": 1.6647379398345947, "input_args": {"text": "'EMAIL US: CONTACT@GOVTSLAVES.INFO Home › POLITICS | US NEWS › GEORGE SOROS: TRUMP WILL WIN POPULAR VOTE IN ‘LANDSLIDE,’ HILLARY’S ELECTORAL VICTORY IS ALREADY ‘A DONE DEAL’ GEORGE SOROS: TRUMP WILL WIN POPULAR VOTE IN ‘LANDSLIDE,’ HILLARY’S ELECTORAL VICTORY IS ALREADY ‘A DONE DEAL’ 0 SHARES \\nEven Republican politicians and former politicians are telling Trump to knock off such talk . \\nBut, as usual, Trump’s shrewdness and defiance of standard political decorum – in which the “opposition” party merely rolls over and surrenders in the face of Democratic pressure – is winning the day. \\nNone other than billionaire investor and longtime Democratic supporter George Soros has said that the fix is literally in for the election, in favor of Clinton – no matter how much of the popular vote, and from which battleground states, Trump captures. \\nAs reported by Top Right News and other outlets, during a recent interview with Bloomberg News , Soros – a Democrat mega-donor – openly admitted that Trump will win the popular vote in a “landslide.” \\nHowever, he said that none of that would matter, because a President Hillary Clinton is already a “done deal.” \\nIn the interview, which is now going viral, Soros says with certainty that Trump will take the popular vote, despite what the polls say now (which are completely rigged to oversample Democrats ), but not the Electoral College, which will go to Clinton. \\nWhen the reporter asks if that is already a “done deal” – that Clinton will be our next president no matter what – Soros says “yes,” and nods his head. \\nIs Soros just making a prediction out of overconfidence? Or does he truly know something most of us don’t know? \\nIn a recent column , Natural News founder and editor Mike Adams, the Health Ranger, says that Soros and Democrats have “bribed electoral college representatives” in a bid to “fix” the election outcome in favor of Clinton. In truth, that would be the only way it could be done, short of massive voter fraud through electronic balloting, as some reports have already claimed . \\nAdams further pointed out that Soros was one of the main money men behind the Black Lives Matter movement, which is being blamed for generating hatred and mistrust of police officers all around the country – some of which has led to the deaths of several officers already. \\nSoros also funds left-wing websites and groups that locate, pay and deploy volunteer “agitators” at Trump rallies, to start fights and engage in physical violence against Trump supporters (acts that the establishment media then blames on Trump ). \\nBut aren’t electors legally obligated to cast a ballot for the presidential candidate who won the majority vote in that elector’s district? No, they’re not. Nine-nine percent of electors have done what they’re supposed to do throughout our history, but this is no ordinary election \\nPer Archives.gov , there is no constitutional provision or federal law requiring electors to vote according to the results of the popular vote. Rather, these pledges fall into two categories: State law and those who are bound by promises made to respective political parties. \\nIn the past, the U.S. Supreme Court has ruled that the Constitution doesn’t require electors to be completely free to cast ballots as they please and, therefore, respective political parties may “extract pledges from electors to vote for the parties’ nominees,” Archives.gov notes. Some state laws hold that “faithless electors” could be subjected to fines or disqualification for casting an invalid ballot, and could then be replaced by a substitute elector. \\n“The Supreme Court has not specifically ruled on the question of whether pledges and penalties for failure to vote as pledged may be enforced under the Constitution. No Elector has ever been prosecuted for failing to vote as pledged,” said Archives.gov. \\nThe site notes that throughout our history, 99 percent of electors have voted as required. But this is no ordinary time, and it’s no ordinary election . And Democrats (and the establishment media) have already proven that they will do anything to stop a Trump presidency. Plus, establishment Republicans don’t want Trump either, so you can bet they wouldn’t balk at or challenge the buying off of electors. Post navigation'"}, "time": 1742564072.2919233}