{"duration": 0.11047649383544922, "input_args": {"text": "'Free Thought Project – by Jay Syrmopoulos \\nCannon Ball, ND – Pipeline opponents attempting to protect their water supply from the Dakota Access oil pipeline (DAPL), as well as prevent the continued destruction of burial grounds and cultural sites, are anticipating a confrontation with police today. This news come after “water protectors” refused law enforcement requests to vacate reoccupied land in the pipeline’s path, owned by Dallas-based Energy Transfer Partners. \\nLast week, native activists took the bold action of declaring eminent domain over their traditional territory and set up a new camp “Front-Line” camp directly in the pipeline’s path. Pipeline opponents say they have simply reclaimed the land under the Fort Laramie Treaty of 1851, clearly noting the Sioux never ceded that territory. The new encampment lies across Highway 1806, where pipeline security guards armed with guard dogs and pepper spray attacked protestors attempting to stop the bulldozing of cultural sites and burial grounds on September 3. \\nThe impending crisis comes after nearly 200 water protectors set up the new camp on land that Energy Transfer Partners last month purchased from a local rancher in an effort to bolster strategic and tactical control of areas surrounding construction of the controversial pipeline. \\nAccording to the AP , however, the Native Americans claim the land is theirs by way of an “1851 treaty and they won’t leave until the pipeline is stopped.” “We never ceded this land,” said protester Joye Braun. \\nThis latest flashpoint in the ongoing conflict is north of the larger and more permanent encampments, which have been constructed on federally owned land where over 200 Native American tribes have gathered to oppose the pipeline’s construction. \\nOn Wednesday, a heavily militarized law enforcement presence began mobilizing heavy equipment, including Humvees, armored personnel carriers, buses and demanded the protestors leave the occupied area. \\nIn an ominous sign, the Federal Aviation Administration (FAA) has restricted flights , and banned the use of drones within a radius of about 4 ½ miles of Cannon Ball. The FAA declared that only aircraft affiliated with the North Dakota Tactical Operation Center are allowed within the restricted airspace. The flight restriction went into effect Wednesday and will last until November 5. \\nIndian Country Today reports : \\nWhat began with prayers and a single tipi alongside Highway 1806 quickly grew to more than a dozen tipis surrounded by tents, buses, cars and hundreds of water protectors. Some are calling it the “1851 Treaty Camp” to acknowledge their Treaty rights. \\nAcross the road is the encroaching pipeline and a heavily militarized police force with armored vehicles, helicopters, planes, ATVs and busloads of officers. Tensions are growing as unarmed citizens worry that police will use unnecessarily harsh tactics. \\nIn recent weeks, nearly 300 unarmed water protectors who were arrested have been subjected to pepper spray, strip-searches, delayed bail, exaggerated charges and physical violence, according to interviews with several who were taken into custody. The ACLU and National Lawyers Guild recently sent attorneys to Standing Rock to help the Red Owl Collective, a team of volunteer lawyers headed by attorney Bruce Ellison, who are representing many of those arrested. \\nThe massive law enforcement contingent, consisting of sheriff’s deputies and officers from numerous other states and counties, as well as National Guard, began staging near the encampment — with scores of Armored Personnel Carriers, buses and Humvees poised at the ready. \\n“At some point the rule of law has to be enforced,” Cass County Sheriff Paul Laney said Wednesday. “We could go down there at any time. We’re trying not to.” \\nDakota Access LLC, the pipeline developer released a statement encouraging trespassers to “vacate the land immediately” or be “removed from the land.” \\n“Alternatively and in coordination with local law enforcement and county/state officials, all trespassers will be prosecuted to the fullest extent of the law and removed from the land,” the company said. “Lawless behavior will not be tolerated.” \\nJust days ago, sheriff’s officials had said earlier they didn’t have the resources to immediately remove activists from the private land, about 50 miles south of Bismarck. Subsequently, law enforcement officials put out a call for reinforcements, with hundreds of officers from out of state responding. \\nOn Wednesday, actor and environmental activist Mark Ruffalo and civil rights leader Rev. Jesse Jackson went to the new camp to speak and pray with the water protectors. Ruffalo had arrived the night before to speak on an anti-DAPL panel with Native activists at the Prairie Knights Casino and Hotel, according to Indian Country Today. \\nAfter touring the camp Jackson spoke to the crowd, reminding people that nonviolence is key to winning the battle for justice. \\n“With promises broken, land stolen, and sacred lands desecrated, the Standing Rock Sioux Tribe is standing up for their right to clean water. They have lost land for settlers to farm, more land for gold in the Black Hills, and then again even more land for the damn (sic) that was built for flood control and hydro power,” Jackson said. \\nWhen will the taking stop? When will we start treating the first peoples of these lands with the respect and honor they deserve? \\nThe rerouting of the pipeline away from Bismarck to its current route is “the ripest case of environmental racism I’ve seen in a long time,” Jackson said. “Bismarck residents don’t want their water threatened, so why is it okay for North Dakota to react with guns and tanks when Native Americans ask for the same right?” \\nThe pipeline was originally scheduled to run north of Bismarck until local residents expressed displeasure with the plan, with the DAPL ultimately being rerouted to its current trajectory near the Oceti Sakowin Standing Rock Reservation. \\nWith an impending militarized police raid of the camp, Mekasi Camp-Horinek, one of the camp coordinators, told officers the protesters planned to stand their ground, saying “Do what you’ve got to do,” according to the Bismarck Tribune \\n“I don’t have a crystal ball to know when it will happen, but we know it will happen,” said Mekasi Camp-Horinek, a member of the Ponca tribe in Oklahoma. “We’re going to hold this ground.” \\nWater protectors could be heard chanting, “Stand in peace against the beast.” \\n“I’m here to die if I have to. I don’t want to die but I will,” said Didi Banerji, who lives in Toronto but is originally from the Spirit Lake Sioux reservation in North Dakota. \\nThe protesters are simply trying to keep law enforcement from preventing their efforts to stop the pipeline said David Red Bear Jr., 30, from the South Dakota side of the Standing Rock Sioux Reservation. \\n“If we don’t stop them here, they’re going to cut us off closer to the pipeline. We can’t let that happen,” Red Bear said. “We’re not trying to force anybody’s hand. We’re just trying to stand up for what we believe in.” \\nThe reality is that the citizens of North Dakota are funding a protection force, in the form of police, for a multi-billion dollar corporate entity. North Dakota’s Emergency Commission previously approved $6 million in emergency funding for law enforcement costs related to the protest — with almost all of those funds having been used already. The Department of Emergency Services plans to ask for more, spokeswoman Cecily Fong said. \\nDo North Dakotans want their tax money spent on police acting as paid enforcers for Wall Street and big oil interests? \\nWhile law enforcement claims they are just doing their job and enforcing the law, in reality, they are acting as enforcers for an unjust corporate oligarchy that consistently puts money over people. The financial elite are the ones who the police are truly protecting and serving — not the American people. Read more at http://thefreethoughtproject.com/militarized-police-mobilize-assault-standing-rock/#PSrb86pVTC4uQDzq.99 Share this:'"}, "time": 1742562214.2214282}