{"duration": 0.0473332405090332, "input_args": {"text": "'Señal de Alerta\\nBCRP: ¡dinamita en el camino! por Herbert Mujica Rojas Socios | 3 de noviembre de 2016 BCRP: ¡dinamita en el camino! ¿A quién favorece el caballazo del Congreso con los tres directores nuevos en el Banco Central de Reserva? No es sólo la violación evidente de la ley orgánica de esa entidad sino –como lo demostró ayer Julio Alba Bravo- también la trasgresión de la propia ley del profesional economista cuando tiene vinculación con el Estado, datos que grafican la circunstancia sino que el Parlamento ha sido fautor de dinamita en el camino para quien debiera evitar esta naturaleza de fracturas: la señora Keiko Fujimori.\\n¿Qué clase de demostración fue la exhibida por la mayoría congresal del fujimorismo? Velocísima, expeditiva. No pareciera ser el mejor camino el de la provocación porque recuerda los años atroces de cuando el país navegaba en toneladas de robos, crímenes, inconductas y que terminaron con la administración de Alberto Fujimori en ruinas morales. Que algunos pretendan olvidar no es raro. Pero habemos quienes guardamos invicta la posibilidad de recordar esos aciagos hechos.\\nHan transcurrido apenas algo así como 100 días de la nueva administración y mientras que el gobierno del presidente Kuczinski también incurre en errores monumentales y hasta bobos, el Congreso no le va a la zaga. Pero ¿no debiera cautelar esa mayoría, la tercera candidatura presidencial de su aspirante Keiko Fujimori? Arriesgaría decir que con esas actitudes pioneras y tempranas, van a conseguir efecto contrario.\\n¿Son o no legítimas las protestas en las calles? La virulencia de calificaciones sobre las mismas y provenientes de reaccionarios huérfanos de ideas o frescura cuanto que honestidad, dan la razón a los muchachos y validan el voto con los pies.\\nEl miedo a la juventud que expresará su desacuerdo con el caballazo congresal, al margen de si se enmienda el error en el BCRP o no, da cuenta del pavor cerval que sienten los grupos políticos anquilosados en viejas prácticas y vicios.\\nEl relevo generacional fresco, pundonoroso, limpio, capaz de inventar sus propias respuestas sin necesidad de robar o estafar el bolsillo y la fe públicas, ha empezado a sonar sus campanas. Y esos decibeles serán la música que tanto anhela Perú.\\nRecordemos a Manuel González Prada:\\n“En esta obra de reconstitución y venganza no contemos con los hombres del pasado: los troncos añosos y carcomidos produjeron ya sus flores de aroma deletéreo y sus frutas de sabor amargo. ¡Que vengan árboles nuevos a dar flores nuevas y frutas nuevas!”\\n¡Los viejos a la tumba, los jóvenes a la obra!\\nHerbert Mujica Rojas Fuente\\nSenal de Alerta (Peru)'"}, "time": 1742628590.8891327}