{"duration": 0.025568723678588867, "input_args": {"text": "'Get short URL 0 4 0 0 The unique properties of the Caspian Sea has dogged decades of negotiations on the status of the body of water, political scientist Vladimir Sazhin told Sputnik Persian. Russian Defense Ministry Russian Caspian Flotilla Ships Successfully Complete Kalibr Missile Drill This week the 47th Session of the Special Working Group (SWG) on the development of the Convention on the Legal Status of the Caspian Sea met in Tehran, where deputy foreign ministers of the Caspian states met to discuss a possible agreement on the Sea\\'s status.\\nSince 1991, the five Caspian Sea countries have made agreements on a range of areas including the environment, the protection of marine resources, security, co-operation in the case of emergency situations and military activities in the lake. \\nIn practice, they have come to agreement regarding the division of the water surface into sovereign zones. According to this agreement, the five Caspian countries have the right to exploit marine resources up to 25 miles from their coast. This includes 15 nautical miles which constitutes national waters, plus another ten nautical miles in which each state has the exclusive right to fishing. The rest of the water is considered international. \\nPolitical analyst Vladimir Sazhin told Sputnik Persian that while the Caspian Sea countries have made a lot of progress on the issue, a final Convention is still far from being agreed. \\n\"I will say straightaway that for the moment the prospect is extremely remote. At the moment the legal framework for the Caspian Sea is based on two agreements signed by Iran and the Soviet Union in 1921 and 1940,\" Sazhin said. \\n\"Azerbaijan, Kazakhstan and Turkmenistan, three new littoral states established after the collapse of the Soviet Union, do not recognize these agreements and are holding discussions about the future status of the sea.\" \\n\"Of course, this is justified because after all there are now five, not two independent Caspian states, each of which has an equal right to this sea-lake, on the basis of their geographical location,\" Sazhin explained. © Sputnik/ Baku Summit to Enrich Persian Gulf With Caspian Sea Resources The issue of whether the Caspian Sea is actually a lake or a sea is at the core of many of the disagreements, since the two bodies of water are governed differently under international law.\\nIran is convinced that the Caspian is a lake, and should be divided equally five ways, giving Tehran control over 20 percent of the water and sea bed. \\nHowever, Iran\\'s four neighbors in the Caspian insist that, as reflected by its name, the body of water is really a sea. Therefore, they argue, the water and sea bed should be divided according to a modified median line. \\nAzerbaijan, Kazakhstan, Russia and Turkmenistan have all signed agreements according to this principle. However, since Iran\\'s Exclusive Economic Zone would constitute only 13 percent of the sea according to this principle, the proposal is rejected by Tehran. \\nAzerbaijan to the west of Iran and Turkmenistan to the east reject in turn Tehran\\'s idea, which would deprive them of maritime territory. ...'"}, "time": 1742628573.7918208}