{"duration": 0.19161558151245117, "input_args": {"text": "'After Henry Trombley died in December, a few weeks shy of his 80th birthday, his daughter, Mary Trombley, found a surprising product pitch among the newspaper clippings and Valentine cards from his youth. “Dear Toddler:” the letter begins. “A little bird told me that you’d be two years old sometime this year. If this is so, soon you will have most of your teeth. And at two years, you are just about old enough to enjoy Wrigley’s gum. ” Ms. Trombley, of Berkley, Mich. dates the letter to 1938, based on her father’s age. She sent a picture of it to her siblings, speculating that “Wrigley was trying to track down lots of babies and get them hooked on gum. ” According to the Wrigley Company, that’s exactly what William Wrigley Jr. the founder of the business, was trying to do. “Wrigley has been credited with being the father of direct marketing,” said Michelle Green, the United States marketing communications manager for Wrigley. “In the early 1900s, he actually shipped free sticks of gum to every address in the U. S. phone book, and that is thought to be the first national direct marketing campaign. ” The letter Ms. Trombley found was part of a campaign to mail free gum to every American child turning 2. Mr. Wrigley also commissioned a Mother Goose booklet starring “Sprightly Spearman,” the mascot for Spearmint gum, and sent thousands of the booklets to schools in poor areas, according to the Wrigley website. On Mr. Trombley’s letter, “we can kind of see the little glue dots where the stick was,” his daughter said. The reference to the sweet, juicy flavor and the use of the Juicy Fruit brand in the illustration in the letterhead suggest that the gum sent with the letter was Juicy Fruit, Wrigley’s oldest product. It was introduced in 1893, a few months before Wrigley’s Spearmint gum, the company’s website says. The letter claims that chewing gum “is good for children’s teeth, which need more exercise than they get with modern soft food. ” But there is no evidence for this claim or for any other oral health benefits of chewing the gum that was sold in the 1930s, all of which contained sugar, said Dr. Jade Miller, president of the American Academy of Pediatric Dentistry. “Back in the ‘20s and ’30s, quite honestly, there was really not a whole lot of science about whether gum had any effect on bacteria,” Dr. Miller said. But he hypothesized that perhaps people knew that gum increased saliva flow and thought the extra saliva, combined with the mechanical effect of the gum rubbing across the teeth, might have helped clean the mouth and teeth. Research now shows, though, that chewing gum containing sugar actually increases the risk of cavities. What’s more, the American Academy of Pediatrics now considers gum a choking hazard for children younger than age 5. “We also know a whole lot about how toddlers’ brains work, and    simply have not yet developed the ability to think through their actions, consider consequences or consistently follow rules,” said Dr. Laura Jana, a pediatrician and author of “The Toddler Brain: Nurture the Skills Today that Will Shape Your Child’s Tomorrow. ” She added: “If you’re 2 and something tastes good, you swallow it, regardless of whether you’ve been cautioned not to. ” Dr. Miller agreed. “When a child understands they shouldn’t be swallowing  —   that’s the right time to allow chewing gum,” he said. The letter also suggests that chewing gum might offer relief from teething pain. “If you still have a few teeth to come through, chewing Wrigley’s gum will help you,” it says. But this advice no longer holds up. Though teething babies have been known to gnaw on anything they can get their gums on, these days the recommended remedies are usually sanctioned teething toys or timeless homemade options like a cool washcloth. (Note that experts say to avoid frozen teething items  —   even frozen washcloths  —   since they can hurt the gums and cause pain.) Dr. Jana suggests a   toothbrush, which your child can chew, suck or rub on his gums to lesson discomfort. Wrigley was far from unique in promoting child care protocols that have since fallen out of favor. “There are many examples of significant shifts in parenting norms: Toddlers used to sit on parents’ laps in the front seat of cars before car seats were invented children’s hands were strapped to the side of the crib to prevent thumb sucking babies slept on their bellies and a bit of brandy for teething was a thing,” Dr. Jana said. “In all instances, we now know much better. ” Wrigley has since updated the science behind its recommendations. In 2006, the Wrigley Science Institute was founded to support research evaluating the effects of   gum on health. Interestingly, Mr. Trombley grew up to be a dental technician, making crowns and bridges for people’s teeth. Ms. Trombley is not sure what her father might have thought of the Wrigley letter but she said he preferred candy to gum. As for whether or not Mr. Trombley’s mother let him chew that free stick of gum in 1938: “We don’t have any idea, but we like to think she kept it for herself,” Ms. Trombley said. Does swallowed gum really stay in your stomach for seven years?  No. It’s true that our digestive system is unable to break down the synthetic gum base, but it doesn’t stay in the stomach for long. The gum eventually moves through the small intestine into the colon and is passed in the stool. Dr. Jade Miller notes that there have been rare instances in which gum has caused intestinal blockages in young children. He said the current thinking on the matter is “not to give gum to a child when they’re too young to understand not to swallow it. ” Does chewing gum build up your jaw muscles?  It is conceivable that chewing gum could strengthen the muscles in and around the mouth but it’s not likely to have any effect on your jaw line. “Almost all of the muscles used for mastication are not externally visible, so it wouldn’t impact your facial contour at all,” said Dr. John Dahl, assistant professor of otolaryngology at Indiana University School of Medicine and a surgeon at Riley Hospital for Children at IU Health. The more likely outcome of chewing a lot of gum is that you would get a sore jaw and exacerbate pain in the temporomandibular joint, or TMJ, the hinge that connects your jaw to the bones of your skull. Are there any health benefits to chewing gum?  Over the years, dental experts have come to the conclusion that chewing   gum after meals increases the flow of saliva, which can help clear sugars and bacteria from the mouth, neutralize plaque acids and strengthen teeth, all of which can help to prevent cavities. Dr. Miller said that increased salivary flow may be particularly helpful for people who have trouble with mouth dryness. “That can be caused by a lot of medications or medical problems, and increased salivary flow can really be helpful for reducing the risk of cavities,” he said. Can gum help with speech therapy? Yes. Some speech pathologists use gum and other chewy treats to exercise the mouth and improve articulation. As long as children are old enough, chewing gum helps them practice using their jaw, cheek and tongue muscles in new ways while managing saliva flow and breathing  —   skills that are all necessary for speaking. Therapists may also incorporate gum into sessions with children with autism because chewing offers sensory stimulation, which can help the children regulate their nervous systems.'"}, "time": 1742563074.310207}