{"duration": 0.10882401466369629, "input_args": {"text": "'MEMPHIS  —   Roy Williams, the coach at North Carolina, has a rule. It goes something like this: If his team is taking the ball out of bounds with more than six seconds remaining and in need of a basket, he resists the urge to call a timeout. On Sunday afternoon, he looked up at the clock at FedEx Forum: 7. 2 seconds. He opted to trust his players. Like nearly everyone else inside the building, Williams turned into a mere spectator as Theo Pinson, a junior swingman, pushed the ball upcourt, into the teeth of Kentucky’s defense, before tossing the ball outside to the sophomore forward Luke Maye, who set his feet and released an   jumper: swish. Maye’s effortless shot with 0. 3 of a second left broke a tie and lifted   North Carolina to a   victory over   Kentucky in the South Regional final of the N. C. A. A. tournament. It was a wild ending to a thrilling game, a classic that the Tar Heels punctuated by snipping the nets in  . “It’s a fantastic feeling right now,” said Williams, whose players doused him with water in the locker room. “Best dadgum bath I’ve ever had with my clothes on. ” By defeating the Wildcats, the Tar Heels set up a Final Four showdown between the Carolinas and the Pacific Northwest. On Saturday in Glendale, Ariz. North Carolina will face Oregon, and South Carolina will play Gonzaga in a matchup of newcomers to the Final Four. North Carolina, by comparison, will be making its 20th appearance in the Final Four, the most in tournament history. Justin Jackson scored 19 points to lead North Carolina ( ) and Maye finished with 17. On a court cluttered with   Maye  —   an unsung reserve who averaged about 14 minutes of playing time during the regular season  —   stood apart in the closing seconds. After trailing by 5 points with less than five minutes to play, the Tar Heels scored 12 straight points  —   a surge initiated by Williams’s decision to shift to a zone defense. Kentucky ( ) which starts three freshmen, looked lost before eventually rediscovering its rhythm. In the final minute, Kentucky’s Malik Monk made a pair of   the second with just seconds left to tie the game at  . Williams glanced at the scoreboard, saw how much time was remaining and folded his arms. He had watched his players fend off every rally. He had watched Joel Berry II, his starting point guard, fight through two sprained ankles. And at practice all season, he had watched them operate with a   shot clock in drills. He knew they were capable of pushing the ball. So he left them in charge. “I was just screaming, ‘Go, go, go! ’” Williams said. North Carolina stifled Kentucky’s star backcourt. Monk finished with 12 points. And two days after scoring 39 points against U. C. L. A. in a regional semifinal, De’Aaron Fox scored just 13. The Wildcats also labored with foul trouble throughout. Coach John Calipari was not pleased with the officiating. “You know,” he said, “it’s amazing that we were in that game where they practically fouled out my team. Amazing that we had a chance. ” For North Carolina, the win was the latest chapter in a   redemption tour. A couple of weeks after North Carolina lost to Villanova in last season’s national championship game, an assistant coach informed Williams that one of Villanova’s players was on campus. And not just any player: Kris Jenkins, the forward who had hit the winning jumper for Villanova. Jenkins was visiting his brother, Nate Britt, a senior guard for the Tar Heels, and wanted to know if he could join the team in some pickup games. “Tell him I’m sending a hit man down to take care of him,” Williams recalled telling his assistant. Williams chose benevolence, allowing Jenkins to work out with his players, but that loss to Villanova  —   and the memory of it  —   was becoming nearly impossible for Williams, his staff and his players to escape. In truth, they wanted it that way. They wanted that lingering disappointment to fuel them this season. “That was our ultimate goal last year: to win the championship,” the senior forward Isaiah Hicks said over the weekend. “We was four seconds away from that. Just to see your dream taken away right in front of you, that’s all the motivation you need. Of course, nobody likes to lose. But that one, when you’re right there  —   all of us, we just need that second chance. ” In a twist, Jenkins has become one of the Tar Heels’ most visible supporters. He sat behind the bench for both of the team’s victories in Memphis. For Maye, who was named the regional’s most outstanding player, his place in North Carolina lore seems secure. His father, Mark, played quarterback for the North Carolina football team in the 1980s, and Luke always wanted to be a Tar Heel. He intended to walk on as a freshman before Williams came through with a scholarship late in the recruiting process. “I was dumb, O. K. because I had offered some scholarships to some other people,” Williams said. Against Butler on Friday in a regional semifinal, Maye scored 16 points off the bench. On Sunday, he somehow outdid himself, sinking 6 of 9 shots from the field. Behind a player named Maye, the Tar Heels are marching on.'"}, "time": 1742563788.5189316}