{"duration": 0.0515284538269043, "input_args": {"text": "'PARIS, France: Front National legislative candidate Aymeric Durox has exclusively revealed to Breitbart London the new name of the Front National could be “Les Patriotes” or the Patriots. [Mr. Durox said the name change, which was talked about on Sunday evening following the defeat of   migration candidate Marine Le Pen, is likely to be Les Patriotes citing the office of vice president of the party Florian Philippot registering the name in 2015.  “I know that the director of the cabinet of Florian Philippot filed the name ‘Les Patriotes’ in April 2015, perhaps already with the prospect of a name change, but nothing is sure,” he told Breitbart London. He said the legacy of the name Front National still “scared off”  some voters and a name change and rebranding could bring more people into the movement. The Front National, or perhaps soon Les Patriotes, are challenging the establishment parties in next month’s French legislative elections. Mr. Durox, who is standing in Paris, said all the establishment candidates he is facing are old and have out of date ideas. “I shall incarnate the true change of my generation,” said the    who is a history and geography teacher. Durox was dismissive of his opponents saying they “have the presumption to pretend that they represent a real alternative”. The Front National is expected to win a minimum of 15 seats in the upcoming election, though some have forecast they could gain as many as 50 seats in the French National Assembly.  Durox said the party should look toward forming a group in the assembly, which would take at least 15 deputies, in order to be able to have more time to speak in the chamber and have more influence. “In any case 50 [deputies] would be a good number, especially if we are superior in numbers to the Socialist party,” he added. Currently, the Front National has two members in the assembly, one of which is Marion   Pen who recently announced her resignation from politics following the presidential election.   Pen said she wanted more time to spend with her young daughter away from the stresses of political life. “When a brave leader leaves his troops it is always very sad, but she is very young and we are sure that she will come back even stronger,” Durox said in reaction to the news of   Pen’s decision. He added: “The future belongs to her. ” Follow Chris Tomlinson on Twitter at @TomlinsonCJ or email at ctomlinson@breitbart. com '"}, "time": 1742564613.7901723}