{"duration": 0.07211947441101074, "input_args": {"text": "\". Fake Rice Made from Plastic is Everywhere — Here's How to Recognize Real From Fake There are no limits to what the black market will produce in the name of profit, and the latest worr... Print Email http://humansarefree.com/2016/11/fake-rice-made-from-plastic-is.html There are no limits to what the black market will produce in the name of profit, and the latest worry for the food market is the production of fake rice. That's right, fake rice is being produced on a massive scale and is finding its way on to supermarket shelves. It seems hard to believe that rice, one of the cheapest foods in the world is being imitated, but it is happening on a large scale in Asia, and China in particular. After being first found in China, it has since been found in Vietnam, India and more recently in countries in Europe, although it has not been identified in the USA yet.The problem with the fake rice is that it is almost undetectable from normal rice, and is being mixed up in normal everyday branded rice. The fake rice has been known to cause stomach complaints and it is thought to be able to cause serious digestive problems, as it is made from dangerous unregulated ingredients such as synthetics, chemicals and even potato off-cuts. Also, contaminated food from China is now entering the U.S. under the 'Organic' label . So, it's probably best to avoid foods imported from China altogether. Worries about the impostor rice are rife in poor areas where rice is a staple of people's diet, and can't be avoided. You should avoid any rice that has a faint plastic smell , and the fake rice is known to keep its shape after being boiled . It does not become soft like normal rice, so if you notice this stop using that product immediately. Reference: http://organicandhealthy.org Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related\""}, "time": 1742563221.896216}