{"duration": 0.07163524627685547, "input_args": {"text": "'ROME  —   As night fell in Italy’s Apennine Mountains on Thursday, prospects dimmed of finding survivors of an avalanche that had swept over a small resort hotel the previous night. At least 30 people were missing, according to the authorities. The avalanche occurred after four earthquakes struck central Italy, which has been hit hard in recent months. Giampiero Parete, a cook at the Rigopiano hotel and one of the two known survivors, had gone out to get something from his car when the avalanche struck. His wife and two young children remained inside and are among the missing. Quintino Marcella, a restaurateur, told the Italian newspaper Corriere della Sera that he had received a frantic call for help from Mr. Parete on Wednesday night. Mr. Parete told him that the hotel had been wiped out: “The hotel isn’t here anymore, it’s not here,” Mr. Marcella told the newspaper. He said that the guests had been waiting for a snow plow to clear the roads. “All the guests had their bags packed and were waiting to leave,” he said. Mr. Marcella said that he called the prefecture in Pescara, and an official told him that they had spoken to the hotel a few hours earlier and that everything was under control. “I insisted,” Mr. Marcella told Corriere della Sera. He said that he called police, the carabinieri, until someone finally said “maybe there’s something there. ” The authorities told the Italian media that they responded as soon as they learned of the disaster. The latest seismic activity, which prompted officials to close schools and the subway system in Rome as a precaution, shifted the nation’s attention back to areas in central Italy that were devastated by last year’s earthquakes, leading to criticism that victims had been left to fend for themselves. Fabrizio Curcio, the chief of the civil protection department, told RAI News that    teams had reached the hotel but that they faced an enormous challenge. Rescue workers, including dog units, were moving with caution he said, and some   teams reported no signs of survivors. News channels in Italy showed images of the roof collapsed on the Rigopiano, and    photographs suggesting that much of the structure had been buried by the avalanche. The last time Fulvio Vagnarelli heard from his brother Marco, who was staying at the hotel with his girlfriend Paola Tomassini, it was via a social media message late on Wednesday afternoon. “He told me that they were about to leave but that they were delayed because of the snow,” Mr. Vagnarelli told the Ansa news agency. Cars were blocking the road, “and they were waiting for it to be cleared. ” The father of a woman who worked at the hotel told Radio24 that the staff had asked to leave after the quake “because it was felt very strongly up there, and so they asked to come down. But there were three meters of snow, how were they supposed to leave?” Prime Minister Paolo Gentiloni said the rescue effort presented officials with “unprecedented” difficulties, describing the area as caught in a vise after intense snowfall “that hadn’t been recorded for decades,” and the strong earthquakes on Wednesday. The epicenters of the four earthquakes were in central Italy, which has been hit by deadly quakes with increasing frequency in recent years. Officials registered more than 100 aftershocks on Thursday. Emergency vehicles tried to assist mountain rescue teams in the region, part of the Gran Sasso National Park, but their efforts were hampered by heavy snow. Francesco Provolo, the prefect of Pescara, the province that includes Farindola, told RAI that rescuers had to travel more than five miles on skis and snowshoes to reach the hotel, as billowing snow continued to fall throughout the night. A spokesman for the civil protection department in Pescara estimated that up to 30 people were in the hotel at the time of the avalanche. The   hotel has 43 rooms, but it was not clear how many guests were staying there at the time of the avalanche. Rescue efforts continued at the hotel, which officials said had been swept from its foundations by the avalanche. Walter Milan, a spokesman for a specialized mountain rescue team, told RAI that rescuers were examining the scene of the avalanche section by section “to exclude that people remained trapped underneath. ” In the nearby hamlet of Ortolano, which has been cut off by the snow, 21 people were airlifted by helicopter to the airport in L’Aquila, said a spokesman for the Italian Financial Police, which was involved in the rescue operations. Three quakes in central Italy last year killed nearly 300 people in and around the medieval town of Amatrice on Wednesday, the tower of one of that town’s churches was destroyed by temblors. In 2009, the town of L’Aquila was devastated by an earthquake that killed more than 300 people. The latest earthquakes were a new setback for thousands of commercial, industrial and agricultural enterprises in four central Italian regions that have been struggling to recover from the natural disasters of the summer and fall. Mr. Gentiloni praised the courage of rescue workers trying to reach the hotel, and he said the country’s “heart and mind” were closely following their efforts. “Everyone is doing as much as they can” to reach people, clear roads and bring electricity to areas that have been cut off for days, the prime minister said. “But I ask all operators to increase their commitment. They have shown that they exist, are present, and are working  —   but I ask them, if possible, to do even more. ” The avalanche had buried cars and nearly everything else in its path. The National Institute of Geophysics and Volcanology said that more than 47, 000 temblors and aftershocks had rattled the region since August, and that there was no sign the situation would change anytime soon. After the earthquake in L’Aquila in 2009, the earth shook for four years, even though it wasn’t always perceptible to people, said Carlo Meletti, the director of the seismic hazard center at the institute. “We expect the sequence will last for many weeks,” he said. “After yesterday’s quakes, it is as though it has picked up in vigor. ” “We have always said that there were strong possibilities of new, stronger earthquakes, and now a new fault has opened,” he continued. “The one thing we don’t know is when they will occur or where, because the area that has been affected by the quakes is so vast. ” Mr. Meletti said in a telephone interview that it was unclear if the avalanche was a direct result of the earthquakes on Wednesday, but that a link was possible “considering that a lot of snow had fallen in a very short time and it was very unstable. ” Echoing a refrain heard after the earthquakes last year, many residents complained on social media that they had been abandoned, even as officials pledged that they were doing everything they could to reach stranded towns and hamlets. “Only the earthquake remembers the earthquake victims,” a banner headline on the front page of the newspaper Il Fatto Quotidiano read on Thursday.'"}, "time": 1742628607.9241467}