{"duration": 0.03170323371887207, "input_args": {"text": "'On Tuesday’s broadcast of CNN’s primetime edition of “The Lead,” OMB Director Mick Mulvaney said that President Trump is willing to sign a government spending bill that doesn’t include money for a border wall, and “We just thought that it would be a good first step to get these things that everybody agrees on and take that idea of a government shutdown off the table. ”  Mulvaney was asked, “A source close to efforts to avoid a government shutdown tells CNN that the Republican proposal in the House will not include funding for President Trump’s border wall with Mexico. Is President Trump willing to sign a government spending bill that does not include that money?” He answered, “Yeah. Because I think the bill  —   at least the offer that we received from the Democrats  —   the last couple days  —   included a good bit of money for border security. The Democrats said they’d go to the mat and shut the government down over the border wall, the bricks and mortar. But there’s a lot of things we agree on, both parties do, in securing the border. And it allows the president to follow through on his promise to make that border more secure, stop people coming over, stop drugs from coming over. So, there’s things we can do, by way of maintenance and technology, gates, bridges, roads, that kind of stuff, that make a real difference in that southern border security. ” Mulvaney added, “We’re not backing down. Keep in mind, this is just  —   this bill is just for the last five months of this year.   …     The discussion for what to do in fiscal year ’18, which starts October 1st, that discussion actually starts as soon as this bill is signed. So, we’re going to continue these conversations. We just thought that it would be a good first step to get these things that everybody agrees on and take that idea of a government shutdown off the table. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742564195.7550595}