{"duration": 0.1439838409423828, "input_args": {"text": "'Email \\nIt is literally impossible for the world community to get a clear understanding of, and truth about, the Fukushima nuclear disaster. This statement is based upon The Feature article in Columbia Journalism Review (“CJR”) d/d October 25, 2016 entitled: “Sinking a Bold Foray Into Watchdog Journalism in Japan” by Martin Fackler. \\nThe scandalous subject matter of the article is frightening to its core. Essentially, it paints a picture of upending and abolishing a 3-year attempt by one of Japan’s oldest and most liberal/intellectual newspapers, The Asahi Shimbun (circ. 6.6 mln) in its effort of “watchdog journalism” of the Fukushima nuclear disaster. In the end, the newspaper’s special watchdog division suffered un-preannounced abrupt closure. \\nThe CJR article, whether intentionally or not, is an indictment of right wing political control of media throughout the world. The story is, moreover, extraordinarily scary and of deepest concern because no sources can be counted on for accurate, truthful reporting of an incident as powerful and deadly dangerous as the nuclear meltdown at Fukushima. Lest anybody in class forgets, three nuclear reactors at Fukushima Diiachi Nuclear Power Plant experienced 100% meltdown, aka The China Syndrome over five years ago. \\nThe molten cores of those reactors melted down to a stage called corium, which is a lumpy hunk of irradiating radionuclides so deadly that robotic cameras are zapped! The radioactivity is powerful, deadly and possessed of frightening longevity, 100s of years. Again for those who missed class, TEPCO (Tokyo Electric Power Company) has no idea where those masses of sizzling hot radioactive goo are today. Did they burrow into the ground? Nobody knows, but it is known that those blobs of radioactivity are extraordinarily dangerous, as in deathly, erratically spewing radioactivity “who knows where”? \\nFukushima is a national/worldwide emergency that is the worst kept secret ever because everybody knows it is happening; it is current; it is alive; it is deadly; it has killed (as explained in several prior articles) and will kill many more as well as maim countless people over many decades (a description of radiation’s gruesomeness follows later on in this article). \\nYet, the Abe administration is talking to Olympic officials about conducting Olympic events, like baseball, in Fukushima for Tokyo 2020. Are they nuts, going off the deep end, gone mad, out of control? After all, TEPCO readily admits (1) the Fukushima cleanup will take decades to complete, if ever completed, and (2) nobody knows the whereabouts of the worlds most deadly radioactive blobs of sizzling hot masses of death and destruction, begging the question: Why is there a Chernobyl Exclusion Zone of 1,000 square miles after one nuclear meltdown 30 years ago, but yet Fukushima, with three meltdowns, each more severe than Chernobyl, is already being repopulated? It doesn’t compute! \\nThe short answer is the Abe administration claims the radioactivity is being cleaned up. A much longer answer eschews the Abe administration by explaining the near impossibility of cleaning up radioactivity throughout the countryside. There are, after all, independent organizations with boots on the ground in Fukushima (documented in prior articles) that tell the truth, having measured dangerous levels of radiation throughout the region where clean up crews supposedly cleaned up. \\nThe Columbia Journalism Review article, intentionally or not, paints a picture of “journalism by government decree” in Japan, which gainsays any kind of real journalism. It’s faux journalism, kinda like reading The Daily Disneyworld Journal & Times. \\nBased upon the CJR article: “The hastiness of the Asahi’s retreat raised fresh doubts about whether such watchdog journalism— an inherently risky enterprise that seeks to expose and debunk, and challenge the powerful—is even possible in Japan’s big national media, which are deeply tied to the nation’s political establishment.” \\nJapan’s journalists belong to “press clubs,” which are exclusively restricted to the big boys (and girls) from major media outlets, where stories are hand-fed according to government officialdom, period. It is the news, period! No questions asked, and this is how Asahi got into trouble. They set up a unit of 30-journalists to tell the truth about Fukushima and along the way won awards for journalism, until it suddenly, abruptly stopped. A big mystery ensues…. \\nAccording to the CJR article, “The Investigative Reporting Section [Asahi] proved an instant success, winning Japan’s top journalism award two years in a row for its exposure of official cover-ups and shoddy decontamination work around the nuclear plant.” \\nFurthermore, according to the CJR article: “The abrupt about-face by the Asahi, a 137-year-old newspaper with 2,400 journalists that has been postwar Japan’s liberal media flagship, was an early victory for the administration of Prime Minister Shinzo Abe, which had sought to silence critical voices as it moved to roll back Japan’s postwar pacifism, and restart its nuclear industry.” \\nAnd, furthermore, the truth be told: “In Japanese journalism, scoops usually just mean learning from the ministry officials today what they intend to do tomorrow,’ says Makoto Watanabe, a former reporter in the section who quit the Asahi in March because he felt blocked from doing investigative reporting. ‘We came up with different scoops that were unwelcome in the Prime Minister’s Office.” \\nIt comes as no surprise that Reporters Without Borders lowered Japan’s rating from 11th in 2010 (but one has to wonder how they ever got that high) to 72nd in this years annual ranking of global press freedoms, released on April 20, 2016. \\nKoichi Nakano, a professor of politics at Sophia University in Tokyo, says: “Emasculating the Asahi allowed Abe to impose a grim new conformity on the media world.” \\nWhen considering the awards Asahi won during its short foray into investigative journalism, like Japan’s equivalent of the Pulitzer Prize in 2012 for reporting about a gag-order on scientists after the Fukushima disaster and the government’s failure to release information about radiation to evacuating residents, now that Asahi has been forced to put a lid on “investigative journalism” and it must toe the line in “press clubs,” any and all information about the dangers or status of Fukushima are ipso facto suspect! \\nThe world is dead silent on credible information about the world’s biggest disaster! (Which causes one to stop and think… really a lot.) \\nThe evidence is abundantly clear that there is no trustworthy source of information about the world’s biggest nuclear disaster, and likely one of the biggest dangers to the planet in human history. However, time will tell as radiation exposure takes years to show up in the human body. It’s a silent killer but cumulates over time. Fukushima radiation goes on and on, but nobody knows what to do. To say the situation is scandalous is such a gross understatement that it is difficult to take it as seriously as it really should be taken. But, it is scandalous, not just in Japan but for the entire planet. \\nAfter all, consider this, 30 years after the fact, horribly deformed Chernobyl Children are found in over 300 asylums in the Belarus backwoods deep in the countryside. Equally as bad but maybe more odious, as of today, Chernobyl radiation (since 1986) is already affecting 2nd generation kids. \\nAccording to USA Today, Chernobyl’s Legacy: Kids With Bodies Ravaged by Disaster, April 17, 2016: “There are 2,397,863 people registered with Ukraine’s health ministry to receive ongoing Chernobyl-related health care. Of these, 453,391 are children — none born at the time of the accident. Their parents were children in 1986. These children have a range of illnesses: respiratory, digestive, musculoskeletal, eye diseases, blood diseases, cancer, congenital malformations, genetic abnormalities, trauma.” \\nIt’s taken 30 years for the world, via an article in USA Today, to begin to understand how devastating, over decades, not over a few years, radiation exposure is to people. It is a silent killer that cumulates in the body over time and passes from generation to generation to generation, endless destruction that cannot be stopped!'"}, "time": 1742562925.0444684}