{"duration": 0.11095046997070312, "input_args": {"text": "'  *Articles of the Bound* / Russian Operations Inside the United States Russian Operations Inside the United States November 1, 2016, 10:02 am by Denise Simon Leave a Comment 0 \\nBy: Denise Simon | Founders Code \\nThis site has posted countless articles on Russia clandestine operations around the world and the blueprint for what Putin’s ultimate objective may be. Putin not only affects the United States but the UK spy chief is declaring the same thing. \\nMI5 head: ‘increasingly aggressive’ Russia a growing threat to UK \\nExclusive: In first newspaper interview given by a serving spy chief, Andrew Parker talks of terror, espionage and balance between secrecy and privacy Andrew Parker said Russia was ‘using its whole range of state organs and powers to push its foreign policy abroad in increasingly aggressive ways’. Photograph: Jeff Overs/BBC/PA \\nDenial is a dangerous conditions and facts matter. \\nDuring the last months of the United States presidential campaigns, much has been investigated and written about how Moscow has injected itself into the process least of which is hacking….and the Kremlin does have global hacking operations without dispute. \\nHillary and her team are targeting Donald Trump for his Russian connections and that is followed by Harry Reid saying the same. Intelligence briefings are given weekly to key members of Congress that have chairman positions on certain committees and Trump has been included in those . Two media outlets, Slate and the New York Times have provided some deep summaries of investigations between Trump and a Russian bank surrounding a server. White Hats performed these studies. \\nThen there is Hillary herself and at least two events for which she colluded with Russia. Secretary Clinton approved the Open Skies Treaty with Moscow but worse she was the marshal of the agreement with the Kremlin and an IT company called Skolkovo . This company is a high tech espionage operation. Due to WikiLeaks we cannot leave out Hillary chief campaign architect, John Podesta for his investments with Russian oligarchs. \\nDo we have such a short memory that we have deported countless Russian spies back to the motherland? Brooklyn Resident And Two Russian Nationals Arrested In Connection With Scheme To Illegally Export Controlled Technology To Russia Defendants Used Brooklyn-Based Front Companies to Procure Sophisticated Military and Satellite Technology on Behalf of Russian End-Users \\nIt must be noted with distinction that the FBI is the only agency that assigns agents to run covert operations to track foreign operatives. It is also noted that James Comey has stopped short of his own declaration as to whether Russia is involved in missions inside the United States when several other agencies have published statements that Russia has operations inside the United States. What Comey may be covering is a real time and ongoing mission to track and trace more than one case dealing with Russian intrusion and he does not want that cover blown. That is how it works. \\nNow, lets go back to Putin himself and the recent changes he has made to his own intelligence agencies, obviously we need reminders. \\n**** Vladimir Putin resurrects the KGB The new agency revives the name of Stalin’s secret police and will be larger and more powerful than today’s FSB. By Owen Matthews \\nPolitico/MOSCOW — Soon after he was first appointed prime minister back in 1999, Vladimir Putin joked to an audience of top intelligence officers that a group of undercover spies, dispatched to infiltrate the government, was “successfully fulfilling its task.” \\nIt turns out Putin doesn’t do jokes. Over Putin’s years in power, not just the Kremlin but almost every branch of the Russian state has been taken over by old KGB men like himself. \\nLast week news broke that their resurgence is soon to be topped off with a final triumph — the resurrection of the old KGB itself. According to the Russian daily Kommersant, a major new reshuffle of Russia’s security agencies is under way that will unite the FSB (the main successor agency to the KGB) with Russia’s foreign intelligence service into a new super-agency called the Ministry of State Security — a report that, significantly, wasn’t denied by the Kremlin or the FSB itself. \\nThe new agency, which revives the name of Stalin’s secret police between 1943 and 1953, will be as large and powerful as the old Soviet KGB, employing as many as 250,000 people. \\nThe creation of the new Ministry of State Security represents a “victory for the party of the Chekists,” said Moscow security analyst Tatyana Stanovaya, referring to the first Bolshevik secret police. The important difference is that, at its core, the reshuffle marks Putin’s asserting his own personal authority over Russia’s security apparatus. \\nPutin, who in 2004 said that “there is no such thing as a former KGB man,” has always had a complicated relationship with the FSB. \\nOn the one hand, Putin has allowed the FSB to absorb pieces of the old KGB, chopped off when Boris Yeltsin tried to dismantle the once all-powerful Soviet security apparatus in the early 1990s. Under Putin, the FSB regained control over Russia’s borders, border troops, and electronic intelligence gathering. At the same time, former KGB men began their takeover of every institution of state, as well as Russian businesses. \\nBut at the same time, Putin has made several attempts to reform and control the FSB. In 2007 he put his close ally Viktor Cherkesov in charge of the Federal Anti-Drug Agency and tasked it with investigating the murky business dealings of top FSB officers. When Cherkesov’s clean-up failed, Putin built up another rival security agency, the Investigative Committee, and tasked it, rather than the FSB, with investigating high-profile political murders like those of journalist Anna Politkovskaya and opposition politician Boris Nemtsov. \\n“The aim in all cases seems to be to replace old-guard Putin allies with younger, more loyal and less independent figures.” \\nNow, however, Putin seems to have put that divide-and-rule policy into reverse and is instead consolidating power into a pair of super-agencies: the National Guard — created in July, that united internal security troops under the Kremlin’s control — and now the new Ministry of State Security. Putin will personally control these super-agencies. \\n“On the night of September 18 to 19 … the country went from authoritarian to totalitarian,” wrote former liberal Duma deputy Gennady Gudkov on his Facebook page . \\nFurther evidence of Putin’s gathering of power into his own hands is an ongoing purge launched over the summer that has already claimed the heads of the Federal Narcotics Service, Federal Protection Service (Putin’s bodyguard), the Federal Migration Service and Russian Railways, as well as the president’s Chief of Staff and personal confidant Sergei Ivanov. \\nThe aim in all cases seems to be to replace old-guard Putin allies with younger, more loyal and less independent figures. The same pattern has been repeated among regional governors — four of whom have recently been sacked, and two replaced by Putin’s personal bodyguards. Protect the regime \\nThe creation of the Ministry of State Security is part of a “project aimed at replacing old allies with new ones,” said independent Moscow-based analyst Stanislav Belkovsky. Putin “dislikes being surrounded by people who feel untouchable because of their personal closeness to him. He doesn’t want to have anything to do with his old friends, he wants people who can execute his will.” \\nHe’s even selected a hatchet man — Sergei Korolev, head of the FSB’s economic security department — to prosecute and eliminate any independent voices in the new Security Ministry, said Belkovsky. \\nThe deeper significance of all these purges and reshuffles goes beyond just Kremlinology. They are clear signs of a regime bracing for trouble. Ever since oil prices began to tumble in 2013, the Kremlin has been preparing for unrest and discontent — primarily with the help of distractions such as annexing Crimea and the campaign in Syria. But Putin is preparing an iron fist too. \\n“I can’t remember a time when so many security service guys ascended to power at once” — Dmitry Gudkov, State Duma \\n“The KGB, it should be remembered, was not a traditional security service in the Western sense — that is, an agency charged with protecting the interests of a country and its citizens,” wrote security analyst Andrei Soldatov , founder of the Agentura.Ru website. “Its primary task was protecting the regime. Its activities included hunting down spies and dissidents and supervising media, sports, and even the church. It ran operations both inside and outside the country but, in both spheres, the main task was always to protect the interests of whoever currently resided in the Kremlin.” \\nThat’s precisely what the Kremlin needs today as inflation remains in double digits and Russian business remains cut off from international financial markets and investment by Western sanctions over Ukraine. \\n“I can’t remember a time when so many security service guys ascended to power at once,” Dmitry Gudkov , an independent State Duma deputy, wrote of the summer’s purges on his Facebook page. “We don’t know anything about these people’s management expertise. Preparing the guns for battle, closing ranks — this is what these appointments are all about. [The Kremlin] can’t trust anyone but those in uniform.” ‘Terminator 2’ \\nAnd there’s a final, more personal reason for Putin’s purge and revival of the Ministry of State Security. \\n“In some ways, this is a sign of Putin’s strength, because he feels confident enough to full, personal, authoritarian rule,” said Belkovsky, who advised the Kremlin in the mid-2000s. “It’s also a sign of weakness because the reason behind it is to defuse the possibility of a palace coup.” Putin is a “man of systems and institutions” according to Belkovsky and, as such, knows his allies are also the greatest threats to his rule. \\nIn creating the super ministry, Putin is completing a full 25-year circle. When Boris Yeltsin came to power in 1991 in the wake of a hardline coup against Mikhail Gorbachev largely sponsored by the KGB and its boss, Vladimir Kryuchkov, Russia’s new leader attempted to create a security agency that would not meddle in politics or society and confine itself strictly to law enforcement. \\nYeltsin failed. According to Soldatov, by the mid-1990s “various component parts and functions of the old KGB had begun to make their way back to the FSK, like the liquid metal of the killer T-1000 android in “Terminator 2” … slowly reconstituting itself after having been blown to bits.” \\nNow those bits have finally coalesced into a full-fledged replica of the original — but with one important difference. The new Ministry of State Security has been designed specifically as a guarantor of Putin’s rule. \\nWhoever heads the new ministry will certainly be an important political player — but it’s clear that the true head of both the Russian state and its new, consolidated security organs will be Putin himself. \\nThat hasn’t happened since the rule of Yuri Andropov, KGB head-turned general secretary between 1982-84. He presided over a collapse in oil prices, a war in Afghanistan designed to boost the regime’s popularity that quickly turned disastrous, and finally an accelerating economic crisis that no amount of repression or propaganda could prevent from snowballing into collapse and revolution. \\nPutin is hoping that this time round, harsher repression and smarter propaganda will save him from the same fate. \\n*** As Russian spies play rough, ignoring Putin’s war against the West will only make it nastier 0'"}, "time": 1742628446.4385567}