{"duration": 0.09927010536193848, "input_args": {"text": "'The unchecked use of fossil fuels will produce a climate not seen since the Triassic period about 200 million years ago, researchers warn in a new report. [The culprit for this unprecedented warming is atmospheric carbon dioxide (CO2) suggest researchers led by the University of Southampton in the UK, which by the year 2250 could reach levels equivalent to those of the “age of reptiles,” when dinosaurs roamed the earth.  In their research, the researchers admit that CO2 levels are “much lower now” than they have been at other, hotter points in the earth’s history, yet they warn that levels are rising rapidly. During hotter periods in the planet’s history, the concentration of CO2 has climbed as high as 3, 000 parts per million (ppm) whereas in 2016, the concentration was only 400 ppm. If fossil fuel use continues unabated, the researchers predict, the concentration of carbon dioxide will reach 2, 000 ppm by about 2250. By the year 2400, the earth could reach temperatures not seen for more than 400 million years, they said. “So not only will the resultant climate change be faster than anything the Earth has seen for millions of years, the climate that will exist is likely to have no natural counterpart, as far as we can tell, in at least the last 420 million years,” said geochemist Gavin Foster from the University of Southampton in the UK. “We found no past time period when the drivers of climate, or climate forcing, was as high as it will be in the future if we burn all the readily available fossil fuel,” Foster said. At the same time, Foster recognized that scientists have no way of measuring CO2 concentrations from millions of years ago but must “rely on indirect ‘proxies’ in the rock record. ” Climate proxies have come under heavy fire from a number of scientists, however, who consider them to be beyond inaccurate. The “primitive modeling” involved with the use of climate proxies is “inaccurate and unreliable well beyond what is required for the conclusions drawn,” said Dr. Duane Thresher, a climate scientist with a PhD from Columbia University and NASA GISS. Climate proxies are very sparse, Thresher has noted, and a single measurement often has to represent thousands of square miles or more. “A single temperature for the Earth averaged from these measurements is meaningless and absurd,” he stated. But the use of unreliable proxies is not the only issue of contention among climate scientists. A deeper problem is the function and consequences of carbon dioxide in the atmosphere and the way that the earth reacts to it. Last fall, a group of scientists were amazed to discover that the world’s plants have somehow increased their capacity to assimilate carbon, resulting in an actual decline in the percentage of   CO2 remaining in the atmosphere. Researchers at Lawrence Berkeley National Laboratory found that despite the increased human emissions of greenhouse gases, between 2002 and 2014, plants were somehow able to absorb more carbon dioxide out of the atmosphere than in previous decades. In their study published in Nature Communications, the researchers noted that “terrestrial ecosystems play a significant role in the global carbon cycle and offset a large fraction of anthropogenic CO2 emissions. ” Moreover, some scientists vehemently disagree with treating carbon dioxide as a pollutant at all, suggesting that it is a necessary and beneficial component of the atmosphere. Dr. William Happer, professor emeritus of physics at Princeton University and a member of the National Academy of Sciences, has insisted that fearmongering regarding global warming creates needless hysteria. “We’ve heard that CO2 is a demon molecule that causes global warming,” Happer said, whereas in reality more carbon dioxide in the atmosphere produces increased crop yields and a greener planet. According to Happer, an increase in carbon dioxide would only benefit both plant life and human life. “We should tell the truth: CO2 will benefit the Earth,” he said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742561845.4041798}