{"duration": 0.042755842208862305, "input_args": {"text": "'Two English bishops have hit out after the government’s top advisor on integration said it was “not OK” for Catholic schools to oppose gay marriage. [The Catholic bishops of Portsmouth and Shrewsbury said it was becoming increasingly difficult to pass on traditional teaching in Britain, and that Christian values are facing discrimination.  Earlier this week, Dame Louise Casey, the British government’s senior advisor on integration told MPs: “It is not OK for Catholic schools to be homophobic and   marriage,” adding: “I have a problem with the expression of religious conservatism because I think often it can be  . ” Philip Egan, the Bishop of Portsmouth, said any restrictions on Catholic schools passing on Church teaching would by worthy of George Orwell’s Nineteen  . He told Catholic News Service that trying to preach on traditional sexual morality in Britain has become “like arguing with an alcoholic”. “After a while, they won’t argue with you on grounds of reason, they just become furious and respond that way. There is something in our culture increasingly like that,” the bishop said. Bishop Mark Davies of Shrewsbury also said that Britain’s values had been shaped by its Christian heritage. “These values would be undermined if an ‘equalities agenda’ in schools became the vehicle for an increasing intolerance of Christian teaching,” he said. “Strangely, it is the historic teachings of Christianity and the Christian vision of marriage which might be in need of toleration,” Bishop Davies added. He said the Catholic Church would benefit from a new papal document on anthropology to clarify Church teaching and counter the rise of gender ideology. In November, Dutch cardinal Willem Eijk called on the Pope to issue a   document condemning gender ideology, saying many Catholics were being “misled” into believing people could choose their own genders, partly because “they don’t hear anything else”. “[Gender theory] is spreading and spreading everywhere in the Western world, and we have to warn people,” he said. “From the point of moral theology, it’s clear  —   you are not allowed to change your sex in this way. ”'"}, "time": 1742562313.3579571}