{"duration": 0.10172653198242188, "input_args": {"text": "' Good morning. (Want to get California Today by email? Here’s the  .) Let’s turn it over to Jennifer Medina, a correspondent based in Los Angeles, for today’s introduction. Another day, another example of California’s continued fight with the Trump administration. The State Senate overwhelmingly approved legislation Monday that essentially turns California into a   “sanctuary state” for undocumented immigrants. The bill expands protections for immigrants at a time when the Trump administration has expanded who is considered a priority for deportation. The legislation prohibits any state or local law enforcement agency from using resources to investigate, detain, report or arrest people for immigration violations. Under the legislation, county jails would not be able to allow officers from Immigration and Customs Enforcement to work inside the jails or notify them when a prisoner is being released. After the bill came under fierce criticism from the California State Sheriffs’ Association, it was amended to allow local law enforcement officials to notify ICE of the release date of serious and violent felons. It also enables local law enforcement officers to alert federal officials if they come across someone who has a violent felony record and has been previously deported. Language in the bill was also changed to explicitly allow local agencies to participate in task forces even if they include immigration enforcement in investigations. The amendments did little to mollify the opposition. One Republican senator warned that the Legislature would be “kicking the president right in the groin,” with the law and warned that “he will strike back. ” After the vote, Kevin de León, the leader of the state Senate and sponsor of the bill, said, “Our communities will become more, not less, dangerous if local police are enlisted to enforce federal immigration laws. ” He called the passage of the bill a “rejection of President Trump’s false and cynical portrayal of undocumented immigrants as a lawless community. ” Just before the Senate passed the sanctuary state bill, lawmakers approved legislation to start a fund that would pay for lawyers for undocumented immigrants facing deportation. Several Republicans spoke out against the legislation, saying it was an unfair use of taxpayer money and also contradicted the idea that the state wants to stay out of immigration enforcement. Both bills will now move to the Assembly. Gov. Jerry Brown has not indicated whether he would sign either one. (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Fight, negotiate or beg: California Democrats are debating how to respond to President Trump. [The New York Times] • For struggling Kern County, Mr. Trump represents hope and change. [San Francisco Chronicle] • Slide Show: A first look at proposals for a border wall with Mexico. [San Diego  ] • With uncertainty over a program that lets tech companies import foreign workers, a rush for visas has become an   scramble. [The New York Times] • Calexit might be   but redrawing California’s state boundaries isn’t. [Opinion | The New York Times] • Today, Los Angeles voters are choosing a member of Congress to fill the vacancy left by Xavier Becerra. [Los Angeles Times] • A Los Angeles County judge denied a bid from Roman Polanski to have his sexual abuse case resolved in his absence. [The New York Times] • Studying surfers could offer clues to whether antibiotic resistant genes move from the seas into humans. [The New York Times] • Tesla surpassed Ford in market value for the first time and moved within striking distance of General Motors. [The New York Times] • Gary Austin died at 75. He helped changed the shape of American comedy as the founder of the theater company the Groundlings. [The New York Times] • The Athletics opened the baseball season with new optimism  —   on a field named after Rickey Henderson. [San Francisco Chronicle] • Photos: What 10 gallery crawlers wore to an opening in downtown Los Angeles. [The New York Times] • Vin Diesel decided to make himself a star after Hollywood didn’t give him a chance. [The New York Times] Some visitors to Big Sur go bird watching or relax with a novel at a seaside resort. Others suspend themselves high above the Pacific’s crashing waves on a narrow strip of nylon known as a slackline. Billy Rudiger, a reader in Carmel, shared a photo he captured of a slackliner traversing a cove just south of Monterey last November. Rope walking has existed for centuries. But the origins of the modern slackline, flat webbing strung loose enough to bounce like a trampoline, usually between two trees, is traced to Yosemite rock climbers in the early 1980s. It quickly grew into a   sport. In the last five or so years, social media has helped to propel its popularity. The pinnacle of the sport is a variation known as highlining, meaning the line is affixed at height. Highliners wear tethers, though a small number of elite practitioners sometimes go without. Injuries can happen, but they are usually of the sprained ankle variety and involve lines a few feet off the ground, said Sonya Iverson, president of Slackline U. S. a group that promotes the sport. “We aren’t daredevils or ” she said. Slackliners talk about the practice as a metaphor for the art of living  —   “balancing everything on the line to demonstrate life’s possibilities,” as the famed climber and highliner Dean Potter put it. For Ryan Robinson, 34, the highliner in Mr. Rudiger’s photo, the blue ocean juxtaposed against the jagged rocks represented a cathedral of sorts. “It’s such a beautiful place,” he said. “It’s nice to pay respect in a very unique way. ” California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and graduated from U. C. Berkeley.'"}, "time": 1742563180.3206687}