{"duration": 0.017990827560424805, "input_args": {"text": "'Rice is a staple food in many cultures, but are certain types of rice dangerous to human health? \\n\\nWhile fears about lead in rice are based in research, researchers who originally presented the study that found high levels of heavy metal in imported rice are realizing that their results may have been skewed by faulty equipment. \\n\\nTsanangurayi Tongesayi, a PHD of Monmouth University in New Jersey, first presented his alarming findings at the American Chemical Society’s annual meeting in March 2013. He conducted tests on rice imported from Taiwan, China, the Czech Republic, Bhutan, Italy, India, and Thailand, and revealed that the grains of rice could be contaminated with 6 to 12 parts per million lead. That is nearly 10 times the amount of lead that is considered safe by the U.S. Food and Drug Administration. \\n\\nYet, when he replicated those findings in order to get the study published in the Journal of Environmental Science and Health, the levels were less than 1 part per million which was less lower than his previous findings. \\n\\nTongesai had also sent the original testing equipment back to the manufacturer and the company had reported that it had been miscalibrated. \\n\\nThe authors of the study are still trying to understand the lead content in rice and are using other methods to analyze the amount of lead these grains contain. \\n\\nThough the amount of lead in rice is still questionable, detectable levels of the carcinogen arsenic has been found in every one of the 60 rice products tested. \\n\\nWhy would arsenic be found in rice? Arsenic can naturally occur in water, soil, and rocks, but its levels may be higher in some areas than others. It can readily enter the food chain and may accumulate in significant amounts in both animals. When eaten, this can have an effect on human health. \\n\\nArsenic is the primary reason to limit your consumption of rice because it is extremely detrimental to human health. \\n\\nIf you still love rice and want to be healthy in your consumption… \\n\\nTransition into eating wild rice which has much lower levels of arsenic than regular rice. \\n\\nEat rice grown in California because arsenic levels are higher in rice that is grown in areas like Texas, Louisiana, and Arkansas and much lower in rice that is grown in the west. \\n\\nSubstitute rice for grains like quinoa, buckwheat, millet, and amaranth. \\n\\n '"}, "time": 1742628378.354967}