{"duration": 0.11123061180114746, "input_args": {"text": "'They dug for revelations, extracting news nuggets  —   a rarity on a debate night  —   like Donald J. Trump’s admission that he had used a nearly   loss to avoid paying federal income taxes for years. They pressed for specifics, interrupting the candidates to demand concrete strategies for handling conflict in Syria and reforming the nation’s health care system. And they posed blunt, provocative questions at a forum that typically feels more like public broadcasting than cable news: Had Mr. Trump ever sexually assaulted a woman? Did Hillary Clinton really believe that her use of a private email server was not “extremely careless”? The duo overseeing Sunday’s presidential debate, Anderson Cooper of CNN and Martha Raddatz of ABC News, seemed to cast off the   pressures on this year’s crop of moderators  —   Is   mandatory? Are interruptions O. K.?  —   and put themselves directly in the mix of a   encounter. The immediate response was praise from many journalists and some grumbling from partisans. One prominent critic, in fact, was sharing the debate stage: Mr. Trump, who did not hesitate to make his complaints known in real time. “Why aren’t you bringing up the emails?” he asked Mr. Cooper, after Mr. Trump believed he had been unfairly cut off. When Mr. Cooper replied, accurately, that the moderators had asked about Mrs. Clinton’s email server, Mr. Trump threw up his hands. “One on three,” he muttered, suggesting that the panel was siding with Mrs. Clinton against him. Later, Mr. Trump again questioned the umpires. “You know what’s funny? She went a minute over, and you don’t stop her,” he said to Ms. Raddatz, who had cut him off. “When I go one second over it’s like a big deal  —  ” “You had many answers,” Ms. Raddatz replied. Mr. Trump did face notably sharp questions about the recording that surfaced Friday in which he boasts about kissing and grabbing women. “You bragged that you have sexually assaulted women  —   do you understand that?” Mr. Cooper asked. When Mr. Trump dismissed the comments as “locker ” Mr. Cooper pressed several times  —   “Have you ever done those things?”  —   until Mr. Trump finally asserted that he had not. The moderators also pushed Mrs. Clinton. Ms. Raddatz, discussing the candidate’s paid speeches to Wall Street banks, asked, “Is it O. K. for politicians to be  ?” Mr. Cooper asked Mrs. Clinton how she could “unite a country” after dismissing half of Mr. Trump’s supporters as “deplorable. ” There were moments, too, where the moderators chastised the audience for cheering  —   and sternly cut off the candidates  —   as they tried to   the   atmosphere that seemed to quickly envelop the room. “The audience needs to calm down here,” Ms. Raddatz said, turning to the crowd. When Mr. Trump interrupted Mrs. Clinton at one point, Mr. Cooper rebuked him, saying, “She didn’t talk when you talked. ” Some conservatives were unimpressed. “I may not care for Trump, but he beat Hillary tonight fair and square even with Martha Raddatz trying to defeat him,” Erick Erickson, a   commentator, wrote on Twitter. One group that appeared shortchanged was the undecided voters sitting onstage, who, between the moderators’ tough questions and the candidates’ heated exchanges, received relatively little airtime. The moderators appeared willing to buck the debate’s format when they deemed a particular interaction newsworthy or illuminating. This tactic was from the one Elaine Quijano used in the   debate last week, who often cut off candidates’ answers so she could move to her next question. And the moderators eschewed the minimalist approach by Lester Holt of NBC in the first debate, who was less assertive and often remained silent for minutes at a time. If the first debate became something of a referendum on the role of the moderator  —   to   or not to  ?  —   the buildup to Sunday’s event was more focused on the raucous nature of the evening. Mr. Trump, a temperamental figure under the best of circumstances, walked onstage Sunday facing a growing revolt within his own party and even his own ticket: His running mate, Gov. Mike Pence of Indiana, issued a statement declaring that Mr. Trump “has to show what is in his heart when he goes before the nation tomorrow night. ” Walking into this fray were Mr. Cooper and Ms. Raddatz, experienced moderators both, who were already preparing for unique challenges. The choice of Mr. Cooper, who is gay, prompted grumbling among some conservatives, who questioned his personal politics. Ms. Raddatz was the subject of a Breitbart News report on Sunday scrutinizing her coverage of President Obama. Although Ms. Raddatz moderated the   debate in 2012, that event was seen by 51 million viewers. At the high end, Sunday’s event was estimated to attract nearly twice that. Network executives were predicting a huge audience, in part because many Americans are home on Sunday evenings. But the extraordinary events of the last few days significantly raised those expectations. Last month’s debate between Mr. Trump and Mrs. Clinton was seen by about 84 million Americans  —   a record for presidential debates, but shy of the 100 million or more viewers that typically tune in for the Super Bowl. Typically, the second debate sees a drop in viewers. Still, in 2008, the second matchup between Barack Obama and John McCain attracted nearly 11 million more viewers than their first in 1992, the second debate among Bill Clinton, George Bush and Ross Perot outscored the first by about seven million viewers.'"}, "time": 1742563166.1160238}