{"duration": 0.0561375617980957, "input_args": {"text": "'AMSTERDAM  —   Geert Wilders, the   politician who is seen as a likely contender to become prime minister when Dutch voters go to the polls next year, was convicted on Friday of inciting discrimination and of insulting a group for leading an   chant at a political rally in the Netherlands. The   judiciary panel found that Mr. Wilders, the leader of the Party for Freedom, violated Dutch law with his remarks on March 19, 2014, but it elected not to convict him of inciting hatred, and it imposed no punishment, rejecting the prosecutors’ request to fine him 5, 000 euros, or about $5, 300. Mr. Wilders was found to have violated laws on inciting discrimination and group offense when he led a crowd at a political rally around the time of municipal elections in The Hague in chanting, “Fewer, fewer” to the question “Do you want more or fewer Moroccans in this city and in the Netherlands?” The court, however, said that Mr. Wilders was not guilty of   charges in connection with comments he made about Moroccans in a nationally broadcast TV program recorded at a public market a week before the rally. The effect of the verdict on Mr. Wilders and on his party’s chances when the Dutch elections are held in March is unclear, but the trial seems to have improved his party’s standing, rather than diminishing it, among voters. If the Party for Freedom wins the most seats in the elections, Mr. Wilders could become prime minister, and he would then have to form a coalition government with other willing parties. Prime Minister Mark Rutte, leader of the   People’s Party for Freedom and Democracy, said a year ago that he would refuse to join such a coalition unless Mr. Wilders retracted his comments about Moroccans. Mr. Rutte confirmed that sentiment at his weekly news conference on Friday, The Associated Press reported. Mr. Wilders, whose defense team said he would appeal the decision next week, was not present when the verdict was read by the chief judge, Hendrik Steenhuis, at a secured courtroom on a military base near Schiphol Airport, outside Amsterdam. The site was chosen to protect Mr. Wilders, who has been under constant guard because of death threats related to a long history of inflammatory comments, as well as the judge and prosecutors. “The most important thing is that he is found guilty of group insult and inciting discrimination,” said a spokesman for the public prosecution service, Frans Zonneveld. “For now, we’re very satisfied that he has been found guilty of these two charges. ” In their ruling, the judges said that Mr. Wilders’s comments at the rally had contributed to the further polarization of Dutch society by using “nationality as an ethnic designation” and that mutual respect was imperative in the “pluralistic” Netherlands. “He said that he was supported by millions of people and therefore was not to blame of offending a group,” Judge Steenhuis said. “It’s important to answer the question of whether he was guilty of this. That question is answered in our court system. We state that you cannot offend groups of people and discriminate against them. ” Mr. Wilders, who has taken a page out of   Donald J. Trump’s playbook  —   he adopted the campaign slogan “Make the Netherlands Great Again” and attended the Republican convention in the United States  —   has repeatedly made vitriolic and inflammatory remarks about Islam, the Quran, immigrants and Dutch minority groups. Since the election of Mr. Trump, the Party for Freedom has been surging in the polls. “I still cannot believe it, but I have just been convicted because I asked a question about Moroccans,” Mr. Wilders said in a video that was posted online. “The Netherlands have become a sick country,” he added. “I have a message for the judges who convicted me: You have restricted the freedom of speech of millions of Dutch and hence convicted everyone. No one trusts you anymore. ” Peter Kanne, a pollster with IO Research, an independent Dutch polling organization, said the most recent data, released on Nov. 25, indicated that the Party for Freedom had gained support and was currently about even with the People’s Party for Freedom and Democracy, the leading party. “A lot of people mentioned that they’re really getting angry that he is being accused and judged only for what he said,” Mr. Kanne said. “They think that he said something that is true, and they’re very angry that a politician cannot say that in a society where there is freedom of speech. ” After Mr. Wilders’s comments about Moroccans in 2014, more than 6, 400 Dutch citizens filed complaints against him at local police offices. Of those complaints, 41 became individual claimants in the criminal trial, asking for up to €500 in “immaterial damages” per person. None will receive compensation from Mr. Wilders in the case, the panel ruled. Michiel Pestman, a lawyer representing some of the claimants, said that his clients were “happy with the results” but added that it was rare for criminal courts in the Netherlands to convict someone without imposing a penalty. “It’s a bit weird,” he said, but “the principled nature of the decision is more important than the compensation. ” He added, “The judge has ruled for the first time in the Netherlands that there are limits to what even a politician can say. ” Just before the official court proceedings began on Oct. 31, Mr. Wilders said on his blog that he would boycott what he called “a travesty” against freedom of speech, but he changed his mind and testified during the defense’s closing arguments. Regardless of the verdict, he said, “no one will be able to silence me. ”'"}, "time": 1742628595.6804276}