{"duration": 0.09045720100402832, "input_args": {"text": "'On Valentine’s Day, couples often reminisce about that moment they knew they would stay together, whether during a vacation, over a fancy dinner or, perhaps, while meeting their future  . For Isaac and Rosa Blum, who became teenage sweethearts 75 years ago in a ghetto in   Poland, that moment came as they and thousands of other terrified Jews were being herded to a death camp by Nazi soldiers. “I saw her walking in front of me,” Mr. Blum recalled. “I went up to the German and told him, ‘That’s my sister,’ even though she was my girlfriend. ” Miraculously, they were both pulled off the line and managed to survive the Holocaust by working as slave laborers in a munitions factory. The following 70 years have been a cinch by comparison, the couple said on Monday in their   house in the Manhattan Beach neighborhood of Brooklyn. He is 94, and she is a year younger. Asked to recount their lengthy love affair, they noted the absurdity of couching it  —   a romance incubated in the hell of the Holocaust  —   in the frilly trappings of Valentine’s Day. “You have a mixed story here  —   you won’t be able to put them together,” Mr. Blum said, even while acknowledging that, yes, it was young, bold love that prodded him to stand up to a Nazi guard and save his sweetheart from being sent to the Treblinka death camp. A hasty marriage followed, and then a horrific honeymoon of sorts: stealing glances and brief exchanges under the stern watch of armed guards. By 1941, the Nazis had taken over the Polish city of Czestochowa and established a ghetto of about 45, 000 Jews. It was in this grim setting that the two met, flirted, gathered with friends, played records and danced together. By autumn 1942, the Nazis were rounding up Jews for extermination. Mr. Blum was pulled from the line to work in the factory, while his family was pushed onward toward the trains bound for Treblinka. He would never see his family again. In that chaotic, horrific moment, he spied Rosa, brazenly approached a Nazi officer and tried to save the teenage girl up ahead walking with her family. A Nazi soldier grabbed her and asked if she was Isaac’s sister, as he had claimed. She said yes. “I was young and strong and able to work,” she said. “He said, ‘Come with me,’ and I was pulled out of the line. ” The memories are still vivid and bitter today, but the silver lining is that they still have each other to grow old with, living largely independently and doting on each other. He calls her a Polish term of affection that translates to “old one. ” She calls him simply Blum, and makes his favorite soups every day. Mr. Blum is a   type who considers holding hands silly and, truth be told, has little use for Valentine’s Day. “He’s not very romantic,” Mrs. Blum said, but his thoughtfulness reveals itself in little gifts and almost begrudging acts of tenderness. “We have a different point of view, but somehow we’ve survived,” she said. “What keeps us together are the quarrels. That’s the cement of a marriage. ” “I love him in spite of all his defects,” she said. “It’s not so easy, but I wouldn’t change him for somebody else. ” They are both sharp and physically and socially active, even if they are no longer the strapping youngsters who were selected for labor by the Nazis. With their families sent to their deaths, they were placed in a smaller ghetto of about 5, 000 Jews and, the lie about being siblings never detected, they were issued a marriage license so they could live briefly in a residence for couples before being separated in different barracks at the factory site, which was patrolled by armed guards. They toiled long hours, she as a welder and he as an electrician, which gave him the chance to approach her workstation to share covert glances. They treasured their few minutes of contact during “  lunch,” Mrs. Blum recalled. “We didn’t know if we were going to live, so we wanted to be together,” he said. When word filtered out that most Jews were being killed at death camps, they were incredulous, and counted themselves lucky despite their misery. “We didn’t know you could build factories to kill people,” Mr. Blum said. “We didn’t want to believe it. ” As Mrs. Blum fixed lunch for her husband on Monday, she said she still had nightmares about the horrors, which included being   with a group of women while German soldiers watched and laughed. And she was in a medical ward after being pushed down some stairs by a Nazi. She shared the ward with a young Jewish woman who tried to hide her pregnancy from the Nazis. Jewish nurses drowned the newborn in a bucket, fearing that the baby’s cries would doom them all. After being liberated by the Allies near the end of the war in 1945, the couple stayed in a displaced persons camp and were married a second time, by a city official in Austria with borrowed rings. Soon after, they managed to buy their own rings with a silver coin they had hidden for months. The two rings wore down over the years, and the Blums never replaced them. They moved to Argentina and were married a third time, in a more proper service. They had two children and then moved in 1963 to New York City, where Mr. Blum opened a furrier business, with Mrs. Blum doing much of the handiwork. They stay busy through programs for Holocaust survivors offered by Selfhelp Community Services, which is partly financed by   of New York and the Conference on Jewish Material Claims Against Germany. Reflecting on why he risked his life by approaching the Nazi soldier that day in 1942, Mr. Blum said simply, “I wanted to be with her. ” Then, Mrs. Blum looked adoringly at her unromantic,    savior and said, “They could have killed him right away on the spot, but he loved me and he wanted to keep me. ”'"}, "time": 1742562161.0131562}