{"duration": 0.11271333694458008, "input_args": {"text": "'Top 10 amazing, indigenous, all-natural cures from around the world \\n  S. D. Wells Tags: natural cures , indigenous medicine , healing plants (NaturalNews) Before World War II, very few Americans suffered from cancer, Alzheimer\\'s, Parkinson\\'s, diabetes, heart disease, strokes, arthritis, osteoporosis, food allergies, psoriasis, eczema, autism, Asperger\\'s syndrome or even fibromyalgia. There were no processed foods, no genetically modified organisms, no chemical pesticides, no toxic vaccines loaded with mercury and aluminum, no over-the-counter medications loaded with artificial food dyes and heavy metal toxins, no artificial sweeteners, no fluoride in the tap water, no leaking nuclear reactors, and of course, there were no insidious oncologists giving people lethal chemical drugs (chemotherapy) to fight off cell disorder (cancer) that\\'s caused by chemical consumption in the first place.None of that was going on, because the American Medical Association had yet to figure out that if all mainstream medicine was simply made of chemicals, everybody who got sick would stay sick, and the medicine industry would become one of the biggest money makers in the history of the world.Yes, that was the time of amazing indigenous medicine , when natural healers were doing wonders for sick folks using natural remedies . And when people did get sick, they took medicine that had worked for millennia, not some lab-concocted chemicals that crooked science journals swore would work. The Chinese and the American Indians didn\\'t get lucky; they used food as medicine , and it worked.Have you had enough of medicine that\\'s so poisonous that they have to inform you about side effects more dangerous than the condition being \"treated?\" Are you sick of paying an arm and a leg for symptom-cover-up chemicals that make you fat, dumb, sicker and closer to death? So is everybody else. Join the club. End the insanity. Try the top 10 amazing, indigenous, all-natural cures from around the world, and never suffer another side effect, never perpetuate illness, and never, ever eat cancer again. All-natural, indigenous cures from around the world #1. Hemp Seed Oil : Ready for the most complete amino acid profile in the world? Hemp seed oil has a 3:1 ratio of Omega-6 to Omega-3 fatty acids that best supports heart health and promotes proper cardiovascular function, thus preventing degenerative diseases . The oil even has antioxidant and anti-inflammatory properties that protect against the aging process! The oil from the seeds also contains essential fatty acids (mercury-free) that are crucial for brain and eye health, especially during the first years of life.#2. Cannabidiol (CBD) : Made from the roots and stems of the cannabis plant, cannabidiol yields none of the psychoactive compound THC (tetrahydrocannabinol) that marijuana contains. Also known as the \"ultimate preventative medicine,\" \"the miracle herb,\" and even referred to as \"the forbidden medicine,\" CBD is a medical wonder, having anti-inflammatory and anti-cancer properties , including the support of mitochondrial function at the cellular level.#3. Oil of oregano : Pharmaceutical companies wish they could patent it. Produced from the perennial herb oregano, the oil is loaded with antioxidants that annihilate the free radicals that cause cancer . One of the most potent remedies in the world, oregano oil beats down viruses and knocks back allergies to pollen.#4. Chlorella : Stressed about keeping your blood sugar levels in a healthy range? A recent clinical study proved that superfood chlorella helps maintain healthy blood sugar metabolism, even at the genetic level! Be sure to buy organic chlorella (but not from China, because it\\'s contaminated with heavy metals).#5. Aloe : Wars have been waged to control areas where aloe flourishes. The Aloe vera plant has been used for thousands of years to heal all kinds of health conditions, including wounds, burns, skin irritations, sunburn and even constipation. Grown in mostly tropical locations, this succulent plant has more than 300 species with over 75 nutrients in the gel, including vitamins A, C, E, B1, B2, B3 (niacin), B6, choline, folic acid, alpha-tocopherol and beta-carotene. Plus, aloe extracts improve absorption of both vitamin C and vitamin E.#6. Maca : A member of the cruciferous family, maca root is an adaptive superfood grown high in the mountains of South America. Maca is very rich in nutrients and supports increased libido, hormone balance, immune boosting effects and increased energy!#7. Garlic cloves : Garlic contains a compound called allicin that\\'s a potent medicine that was used by the Egyptians, Romans, Greeks and Chinese to combat sicknesses, including the common cold.#8. Licorice root : Dating back as far as 190 AD, this Chinese herbal remedy is used in over 5,000 formulas for clinical purposes, including in aiding digestion.#9. Elderberry : Sambucol, a black elderberry extract, short-circuits the flu! Medical doctors will never tell you about this because it\\'s cheap and it works.#10. Medicinal mushrooms : Check out Reishi, Turkey Tail, Maitake, Shiitake and Chaga to boost immunity and brain power, and to fight cancer cells, for everything from brain cancer to breast cancer. Sources for this article include:'"}, "time": 1742562293.8788064}