{"duration": 0.09633874893188477, "input_args": {"text": "'Email \\nPoll-watching junkies are having a field day. There is one poll or another publishing its results on an almost hourly basis. As this is being written on noon Sunday, for instance, Investors Business Daily (IBD), which touts its survey as “the most accurate poll in recent presidential elections,\" has Donald Trump ahead of Hillary Clinton by one point. The USC Dornsife/ Los Angeles Times ’ “Daybreak” poll shows Trump ahead of Clinton by five points. \\nNate Silver, in his FiveThirtyEight 2016 Election Forecast, has Clinton’s chance of winning at 64.7 percent versus Trump’s 35.3 percent. Silver predicts Clinton will win 48.4 percent of the popular vote (versus Trump’s 45.5 percent, which will give her 291 Electoral College votes to Trump’s 246. \\nIn its running summary of other polls, Real Clear Politics shows Clinton up by 1.8 percent over Trump in the popular vote, while in the Electoral College it’s Clinton with 216 and Trump with 164, leaving 158 votes as “toss ups.\" \\nThere are at least two other prognosticators who don’t rely on polls at all, and they are predicting Trump will win on Tuesday. The first was explained by Tyler Durden at ZeroHedge back in January when he said that the stock market would predict November’s winner: This relationship occurs because the stock market reflects the economic outlook in the weeks leading up to the election. A rising stock market indicates an improving economy, which means rising confidence and increases the chances of the incumbent party’s re-election. Therefore, your time might be better spent from August through October watching the stock market rather than the debates if you want to know who will be President for the next four years. \\nRight on cue the stock market has declined nine days in a row (through last Friday), the first time that has happened since 1980. But more importantly is how it has behaved since Monday, August 1. The S&P 500 Index has declined by 4.5 percent which, according to Durden, translates into an 86 percent chance of Trump’s winning on Tuesday. \\nAnd then there’s the professor from Stony Brook University, Helmut Norpoth, and his “Primary Model”. Writes Norpoth on his website: Winning early primaries is a major key for electoral victory in November. Trump won the Republican primaries in both New Hampshire and South Carolina, while Hillary Clinton and Bernie Sanders split the Democratic primaries in those states…. For the record the Primary Model … has correctly predicted the winner of the popular vote in all five presidential elections since it was introduced in 1996…. For elections from 1912 to 2012 the Primary Model [has retroactively picked] the winner … every time except in 1960. \\nAccordingly, Norpoth gives Trump an 87 percent chance of winning Tuesday’s election. \\nThere’s also his “pendulum” model: What favors the GOP in 2016 as well … is the cycle of presidential elections. After two terms of Democrat Barack Obama in the White House the electoral pendulum is poised to swing to the GOP this year…. Donald Trump is predicted to defeat Hillary Clinton by 52.5 percent to 47.5 percent. \\nIn the “for what it’s worth” category, as this is being written, futures for Monday’s open are also turning negative. If the market closes down again on Monday, the 10th day in a row, it will only add validity to both Durden’s and Norpoth’s prediction: Trump will win on Tuesday. \\nAlso, Professor Norpoth has such confidence in his models that he is using his own money to bet on Trump to win. \\n\\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. .  '"}, "time": 1742563204.4560666}