{"duration": 0.07121491432189941, "input_args": {"text": "'Russia Tests Nuclear-Capable Ballistic Missile – But Have You Heard That Trump Grabs Pussies? \\nAndrew Anglin October 27, 2016 \\nBasically, we’ve got a Road Runner vs Wile E. Coyote situation going on here. \\nThe West just keeps coming-up with these elaborate, stupid schemes and Russia plows right past them. \\nI am really not sure that the West understands exactly what they’ve gotten themselves into here. \\nRT : \\nRussian strategic missile troops reportedly launched an RS-18 ballistic missile on Tuesday. The launch may have been a test of the advanced hypersonic glider warhead, which would be able to defeat US anti-missile systems. \\nThe test was conducted at midday from a site near the town of Yasny, Orenburg region, in the southern Urals, and the warhead reached the Kura test range in Kamchatka in Russiaâ\\x80\\x99s Far East. \\nâ\\x80\\x9cThe test was a success. The warhead was delivered to Kura field,â\\x80\\x9d the Defense Ministry reported. \\nPopular defense blog MilitaryRussia.ru says the launch was meant to test Russiaâ\\x80\\x99s hypersonic glider warhead, currently known by its developer designation, â\\x80\\x98object 4202â\\x80\\x99, or Aeroballistic Hypersonic Warhead. \\nA select few countries are currently developing the technology. The US has the HTV-2, a device developed by DARPA that has two partially successful tests under its belt. The Chinese warhead using the same technology is called DF-ZF, with Beijing first confirming a test in 2014. India is also studying hypersonic flight technology, but unlike Russia, the US and China, it is reportedly not developing a strategic missile warhead. \\nA hypersonic glider vehicle (HGV) is different from a conventional ballistic missile warhead in that it travels most of the time in the stratosphere rather than in space. It gives an HGV-tipped missile greater range and may give anti-missile systems a shorter window to respond to an attack. \\nWe are at a point in history where the American people are forced to make a decision. \\nWhich is worse: \\nA) Joking about sex with another man in a private conversation on a bus, or \\nB) Nuclear war \\nIf only the media were putting things in these terms. \\nI wonder why the media doesn’t put things in these terms?'"}, "time": 1742562267.863008}