{"duration": 0.11073946952819824, "input_args": {"text": "\"Eisenhower's Meetings With Extraterrestrials Are Only The Tip Of The Iceberg Please scroll down for video \\nOn December the 11th 1984, a television producer and UFO researcher called Jamie Shandera was surprised to find an envelope left anonymously for him to find. The envelope would prove to be a revelation for Shandera who found that it contained copies of top secret documents intended for the former President Dwight Eisenhower. These documents referred to the presence of extra-terrestrials here on Earth and strongly suggested that the president had been dealing with them. President Eisenhower’s great-granddaughter speaks out about the secret alien meetings \\nThe FBI took it upon themselves to investigate the documents but following a thorough investigation they claimed that the documents were nothing more than an elaborate hoax. Most people accepted the FBI’s explanation at face value and it might have been the case that nothing more would have been said about these unusual documents. However, this story has remained prominent for ufologists over the years because of the regularity in which other credible individuals have elaborated on Shandera’s story and furnished it with important details. \\nOne of these individuals is Timothy Good – a former government consultant in the United States. \\nPresident Eisenhower suddenly went missing on the evening of February 20th 1954. In order to dispel the rumours that he was taken ill or that he had died, his official staff said that the president was undergoing emergency dental work. But according to Good, this story is nonsense. Eisenhower had actually been hurried away to an emergency meeting with delegates from an alien race from the Pleiades star cluster. These aliens, whose vivid blue eyes, pale skin and blonde hair has earned them the sobriquet of the ‘Nordics’ are believed to be a peace loving species. They offered humanity assistance with technology and medical knowledge so long as human beings agreed to turn away from fossil fuels and nuclear weapons technology. Their terms were not agreed to at this meeting. \\nFollowing the refusal of the Nordics proposals, a second alien race is said to have made contact with humanity and offered their own deal. This race, known as the Tall Greys (or simply the Greys) offered Eisenhower access to highly advanced technology on the proviso that the United States would give the Greys leeway to abduct and perform experiments on civilians before wiping their memories and returning them to Earth. It is said that Eisenhower grudging accepted this deal . \\nWhile it might seem extraordinarily callous for a sitting president to put his civilians in such danger, others have been sympathetic to Eisenhower’s dilemma. The deal came as the Cold War was growing tenser and it is assumed that if Eisenhower had refused the offer from the Greys that they would have contacted his counter-part in the Soviet Union and gifted them with extraordinarily advanced technology instead. \\nThe Nordics continued their contact with human beings despite the fact that the government of the United States had entered into a pact with the Greys, an alien species the Nordics distrust. One such Nordic alien is referred to as ‘Valiant Thor’ who first appeared in 1957 in a quiet field, where he found a policeman and demanded to be taken to the president. Over the next three years, he attended meetings of high political importance in the United States and met with various other private individuals, including the creator of Star Trek, Gene Roddenberry. \\nPerhaps most compellingly of all is the testimony from Eisenhower’s own great-granddaughter, Laura who says that she has no doubt that the meetings between her great-grandfather and the two alien races took place. “It’s like there is this whole other reality going on that we don’t hear about!” she said, “These timelines and the deeper history connected to secret societies, connected to these deeper ET agendas that have been around for thousands of years!” According to Laura Eisenhower, the deal with the Greys has led the United States into a number of bizarre and highly dangerous secret space programs. She says that the actions of her great-grandfather should now serve as a warning about the dangers of the power and influence of the military industrial complex. \\nThis article (Eisenhower's Meetings With Extraterrestrials Are Only The Tip Of The Iceberg) is free and open source. You have permission to republish this article under a Creative Commons license with full attribution and a link to the original source on Disclose.tv 136316\""}, "time": 1742562218.017843}