{"duration": 0.09121894836425781, "input_args": {"text": "'Listen up everybody \\nIt is literally less than two weeks till the election. \\n@Colonel-Gunter.Brumm has had a brilliant idea. For the remainder of the race we need to focus on one last Glorious Memetic Campaign. It should primarily be focused on social media for widest distribution. \\nSpecifically via a ‘NORMIE FRIENDLY’ assault. \\nOur Orders: Add a shortcut to this article to your desktop. Check the BBS for great posts and send them out across your networks. Make a new folder on your desktop just for this campaign. Archive, create, distribute Go through ALL of your archives for the best memes you have. ONLY NORMIE FRIENDLY stuff. Anti Hillary and Glorious Trump stuff. NO Hakenkreuzes, chicken and watermelons or Daily Stormer watermarks, etc. Then assemble them all along with PNGs, blank backgrounds, finished products, etc so that we can mobilze and go full Klendathu Drop on her ass for the rest of the campaign. Because this is the ONLY TIME THAT COUNTS FOR MOST SHEEPLE. We need to reach the sheeple that we allÂ know personally and get them laughing, angry, emoting, etc. Deploy these normie friendly memes to flood your own personal social media, twitter etc. Put them into the hands of all of your colleagues at work, friends, relatives and their friends to flood the planet for the next 2 weeks. Again- NO Nazi stuff, just intense anti Hillary stuff right up to the edge of what we normally do and our best of the best Trump stuff we have. Make many posts, every day for the rest of the presidential campaign. Saturate all your networks (i.e. FB, Twitter etc.) Deploy all your accounts, IRLs, sockpuppets, etc. Reach out to other Alt-Right communities and have them join us. \\nCheck back here on this article every day to get more ammo and to leave more for others. \\nAnyone that blocks you is a Hillary voter so don’t worry about them. Anyone that’s pro Trump will not block you and will share your stuff. Anyone undecided will read and can be swayed by the humor and horror and beauty of our memes. \\nRemember this is about reaching the undecided, the fence sitters, the people who supported other candidates. The reason why they have to be specifically Normie friendly is so that everyone here feels comfortable enough to blast them into their own personal social networks. \\nThere are millions of us, blasting them into our networks extend their reach to billions. Stuff that your aunt and uncle can share with their friends too. We want them laughing and horrified. \\nWe think the best stuff to focus on is– Highlight her desire for war with Russia..– Highlight her corruption– Highlight Trump’s heroism and genius and glory– Highlight that all the smart and cool and sexy people support him. \\nThis is for real now. Get off your ass and do your duty for the Fatherland. \\nTo our Non American Brothers: This is your election too. The same orders apply. Help us so that we can help you. The US is the vampire heart of ZOG. If we bring it down here, you are free. Simple as that. \\nAlso here are some simple tools to make stuff and modify stuff you already like. Use them, make them and then post them here for others to deploy as well.'"}, "time": 1742562133.2950659}