{"duration": 0.08373856544494629, "input_args": {"text": "'by PAUL FASSA report this ad \\nThere has been a dramatic increase in neurological diseases linked to aluminum toxicity . The blood brain barrier doesn’t stop aluminum’s intrusion into our gray matter. Aluminum accumulates and remains in tissue that doesn’t have a rapid cellular turnover. report this ad \\nApoptosis is the natural cell death and replacement process that occurs throughout the body, excluding cancer cells. Cancer cells keep reproducing and colonizing into tumors unless apoptosis is introduced or the cells are outright killed from chemical compounds, both natural and synthetic. \\nAluminum accrues to toxic levels over time in slow apoptotic cell turnover tissues, such as bone matter, the heart and the brain. The brain and its associated nervous system is where diseases such as Alzheimer’s , Parkinson’s, MS, chronic fatigue and other neurological or auto-immune diseases manifest, including the complete autistic spectrum, from learning disorders to full blown autism. \\nThere is no shortage of aluminum toxins in our environment. It’s in cookware, beverage containers, foil, cigarette smoke, cosmetics, antiperspirants, sunscreen, antacids, and those ubiquitous chemtrails that most ignore from which aluminum nanoparticles can be breathed into our lungs and routed directly into our blood or through the sinuses into our brains. \\nAluminum is in all vaccines. Injecting aluminum bypasses the possibility of eliminating it through normal channels. Straight into the blood it goes to be carried into the brain and heart, adding to their accumulated aluminum toxicity loads. report this ad \\nAccording to Dr. Chris Exley, PhD, we have come into the aluminum age. Many trolling commentators love to explain how aluminum is the must common mineral on the planet and therefore it’s harmless. Dr. Exley has dedicated over two decades of his scientific life to researching aluminum toxicity. He calls the period of time from the early 20th Century to now the “Age of Aluminum.” \\nBefore then, aluminum remained in the ground as the most abundant mineral in earth that hadn’t yet been mined. Dr. Exley claims mining aluminum and using it in so many ways corresponds to the marked increase of neurological diseases. \\n\\nDr. Chris Exley’s Message to the 2011 Vaccine Safety Conference \\nA key aspect of his conference delivery concerned helping vaccinated kids improve their neurological damage. Ironically, it involves the second most abundant mineral in mother earth – silica. Exley has put kids who had autism spectrum disorders or other neurological damage from vaccinations on a form of silica known as silicic acid with excellent results. \\nSilicic acid is basically oxygenated silica. Exley considers this the best and most bio-available way to get silica through the gut and into the blood, then into brain matter where it binds with the aluminum molecules and leads them out of brain cell tissue safely through the urine. \\nHe had used a Malasysian mineral water called Spritzer on aluminum toxic children suffering from autism spectrum disorders with significant success. Aluminum is in almost all vaccines. Later he and his team had 15 Alzheimer’s disease (AD) patients use that water at the same rate of one liter per day for 13 weeks. \\nAluminum levels were lower by anywhere from 50 to 70 percent in all the subjects involved, and of the 15 AD patients, eight no longer deteriorated and three actually showed substantial cognitive increase. Perhaps coconut oil is better for reversing AD, but mineral waters high in Orthosilicic or ionic silicic acid will reduce aluminum toxicity in the brain to help ward off AD. \\nThe more USA accessible mineral waters with similar levels of silicic acid to Spritzer, which can penetrate the blood-brain barrier, are Volvic and Fiji. My personal favorite is Fiji because it has the highest level of ionic suspended silica as silicic acid and is the least expensive. I’ve seen it in WalMart at $1.99 per liter. \\nAlso, People’s Chemist Shane Ellison analyzed various water bottles and said Fiji water bottles are free of BPA and “its chemical cousins”. Others he rates highly as BPA free are Voss, Evian, and Smart Water. \\nThe suggested protocol is at least five days consuming a 1.5 liter bottle of water daily. More is required for high levels of aluminum toxicity. Dr. Exley considers drinking the whole bottle within an hour as the most efficient method of detoxing aluminum from the brain. \\nDr. Exley explains that there are three commercial bottled waters listing silica amounts as milligrams (mg) per liter on the bottle. Fiji has the highest amount of the three. Neither of us is affiliated with Fiji. \\nSilica mineral waters can be supplemented to help prevent dementia. Obviously it can also be used as an adjunct with pure cold pressed coconut oil to stop early onset Alzheimer’s or even reverse most of the symptoms after AD symptoms appear. More on coconut oil for Alzheimer’s can be found here . \\nAluminum (Al) is passed out through the urine when one supplements silica sufficiently. It seems there’s little danger of taking too much, as long as adequate water is consumed and vitamin B1 and potassium levels are maintained. \\n\\nMore About Silica \\nSilica helps ensure collagen elasticity of all connecting tissues in the body, including tendons and cartilage. This reduces aches and pains and maintains your body’s flexibility. It has also been determined that high levels of blood serum silica keep arterial plaque from building and clogging blood vessels. \\nA major culprit for arterial plaque has recently shifted from cholesterol buildup to arterial calcification from serum calcium that is not absorbed as bone matter. It’s known that silica is an important part of building bone matter. \\nWithout sufficient silica, magnesium, and vitamin K2, calcium doesn’t become part of bone matter and remains in the blood to potentially calcify in the soft tissue of inner artery walls and the heart. \\nSilica is vital for keeping strong bones and a healthy cardiovascular system. This qualifies silica as an essential anti-aging mineral that is much more than a skin deep beauty mineral. Other good sources of silica are the herb horsetail, cucumbers, and diatomaceous earth powder. \\nAlthough these three other sources are helpful for the recent aforementioned reasons, they lack the ionic suspension of silicic acid found in the mineral waters to penetrate the blood-brain barrier. I just found these other sources for ionic silica or silicic acid as well, here and here . \\n\\nPaul Fassa is a contributing staff writer for REALfarmacy.com. His pet peeves are the Medical Mafia’s control over health and the food industry and government regulatory agencies’ corruption. Paul’s valiant contributions to the health movement and global paradigm shift are world renowned. Visit his blog by following this link and follow him on Twitter here .'"}, "time": 1742562805.5138905}