{"duration": 0.15586447715759277, "input_args": {"text": "'Perhaps you’ve seen the new TV series whose pilot episode begins this way: A man and a woman are having sex, but something soon goes awry, and the whole production wraps up on an ungainly, awkward note. If you’re having trouble naming the show, it’s because there isn’t just one that commences this way. The   awkward sex scene has become a staple of the modern television series opener. And while it can seem like merely a (now hackneyed) storytelling device, its prevalence may also reflect recent tectonic shifts in heterosexual politics. First, a rundown of some examples (with a tip of the hat to Benjamin R. Cohen, a professor in engineering at Lafayette College, who alerted me to the trend): In “Love,” we are treated to no fewer than three sex scenes within the first six minutes, the most dramatically significant one being the male protagonist having stiff, monotonous sex with his aloof girlfriend, both of them still wearing tops, as he asks her to move in with him. (She says yes a month later, in their next scene together, she breaks up with him.) In “Togetherness” (canceled by HBO after its second season) the male lead attempts to initiate   sex with his wife. When rebuffed, he begins masturbating, hoping she won’t notice. She does, and kicks him out of bed, but not before asking him to take the baby monitor with him. “Master of None” opens with a   accident during a   stand. The two characters end up doing an online search for the risk of impregnation from   fluid (and, in learning about it, he admits that he masturbated before going out that night). The two leads of “Broad City” are having a   conversation on their laptops it is later revealed that Ilana has been having sex with a guy during their talk while Abby has been engaged in a “scheduled” masturbation session. Some of this litany has to do with the medium. As an   narrative strategy, depicting sex (erotically or not, à deux or solo) invariably succeeds. Comedy, for which all of the shows in question aim, doesn’t play well with dim lighting, sultry music and simultaneous orgasms. Furthermore, TV writers, especially those in mostly   premium cable and streaming TV, are undoubtedly eager to push the envelope of frank realism in a less puritanical era. Yet, perhaps, a bigger engine for the proliferation of awkward sex scenes is the change occurring in the contemporary bedroom. Compare the aforementioned shows to how “Sex and the City” began in 1998, with Carrie’s   relating the tale of a seemingly storybook romance (replete with “wonderful” sex, filmed in moonlight with silhouetted figures) that, inevitably, crumbles because of yet another noncommittal “toxic bachelor. ” In Carrie’s first sex scene, she is gratified by cunnilingus before turning down a request for fellatio and skedaddling off to work. The mood is not one of unease or embarrassment, but empowerment through role reversal. “I’d done it,” she proudly tells the viewer. “I’d just had sex like a man. ” The   show “made big headway” when it came to women “talking about their sex lives in a public forum,” said Sarah Heyward, a   on “Girls. ” “If the public is forced to get more O. K. with women talking graphically about their sex lives, inevitably on TV we’ll see women being more aggressive and being the initiator. ” “Sex and the City” not only paved the way for onscreen representation of women with more sexual agency, but also underscored a sea change in how both genders approach love and lust behind closed doors. After the “Broad City” scene ends, the guy in bed (Hannibal Buress) asks: “What are we? Are we just having sex, hooking up, dating? What is this?” “This is   …     purely physical,” Ilana says. “Why does this always happen to me?” he wonders aloud. Two decades ago, it’s doubtful a male character would have uttered such a lament on television unless it was played for straight laughs. On “Broad City,” though, it reads as a sign of the times: A woman can have sex “like a man,” as per Carrie’s declaration, and a man can express emotions as vulnerably as women have historically done. While this progressive movement toward equality ideally results in more satisfying romantic lives for all parties, television has mined the oftentimes vexed and perplexing renegotiations of status for humorous material. Consider an example from the pilot episode of “Girls” (which doesn’t open the show but takes place a demure 15 minutes in). The elusive and carnally adventurous Adam instructs Hannah to hold a physically uncomfortable sexual position. What follows is a superb comic scene pitting Hannah’s verbally open vulnerability and desire to please  —   up to a point  —   in conflict with Adam’s inarticulate desire that is unconcerned with her needs. The end result is a dampening of arousal for both parties. To a degree, theirs is a   pairing: the laconic, detached Adam, one of Carrie’s “toxic bachelors,” with the garrulous, needy Hannah. (In subsequent episodes, Hannah plays the role of the initiator more frequently, often to amusing results.) And, obviously, moments just like this took place in real life before the sexual revolution they just couldn’t have been shown on TV. Yet they were likely far less commonplace than now, and the particulars of their arrangement would have been very different (for starters, back then,   Adam and Hannah would have more realistically been married, not having exploratory casual sex). Gus, the nerdy male protagonist of “Love,” is closer to Mr. Buress’s character on “Broad City” than he is to Adam, and he struggles with the problems presented by his own inclination to   romance. “The show is trying to explore the limits of being sensitive,” said Paul Rust, who plays Gus (and is the   of the series with his wife, Lesley Arfin). “Maybe during sex is not the best time to ask if you want to move in together. That might not necessarily be a   in bed. It’s pragmatic dirty talk. ” “Love” seems to posit that behind the genial, meek facade of the domesticated millennial guy lurks the atavistic anger and repressed hostility of the male animal. “What am I?” Gus demands of his girlfriend as they fight during their breakup. “Am I too nice? Am I too mean?” She yells back: “You’re not nice! You’re   which is worse than being mean. ” Gus’s erratic navigation between the Scylla and Charybdis of domineering   and emasculated   behavior  —   the former no longer as socially acceptable as it used to be, the latter still not doing one many favors even on Tinder, let alone at a bar  —   constitutes much of the show’s subtext (and comedy). “You can do this, Gus,” he tells himself in a bathroom mirror, trying to psych himself up before approaching a girl at a party. “You’re the man. You’re   …     like a man. You’re close to being a man. ” “I’m sure it’s confusing for men: ‘Be like Don Draper, but also be this nice guy,’” said Daley Haggar, who has written for sitcoms like “The Big Bang Theory” and “Anger Management. ” Jon Hamm’s character on “Mad Men” may have been one of the more attractive leading men on TV to female viewers in recent memory, but Ms. Haggar pointed out that much of his conduct would be considered   or inappropriate in the 21st century. “Women fantasize about Don, but they don’t want an actual Don,” she said. “He’s cold and mildly sociopathic and he cheats. What they want is Jon Hamm dressed up in a suit doing a sort of cosplay of a ’50s stoic guy and being dominant. What he does, you’d be arrested for now. ” Moreover, she added,   intercourse with a figure like Don probably wasn’t all it’s cracked up to be on the show. “I don’t know that there were great orgasms with Don Draper,” she said. Mr. Rust looked to a different decade, the 1970s, as a bridge between the eras portrayed by “Mad Men” and the current crop of shows, and noted a possible subconscious influence in opening “Love” with an anticlimactic sex scene. His favorite film, 1975’s “Shampoo,” begins with Warren Beatty’s Lothario hairdresser having sex as another woman interrupts with a phone call. Watching it for the first time was a revelation. “There was a relief for me: ‘Oh, man, even Warren Beatty can have awkward sex,’” he recalled. His acting turn may have similar repercussions for today’s young men exploring their own sensitive sides, including those who may appear at first glance not to have any. “I was at an A. T. M. a couple weeks ago, and a    dude walked up to me,” Mr. Rust said. “He   me and said, ‘Dude, thanks for the vulnerability. ’”'"}, "time": 1742628610.208536}