{"duration": 0.09550189971923828, "input_args": {"text": "'STATE COLLEGE, Pa.  —   Before Lauren Davis finished writing her editorial about Joe Paterno for The Daily Collegian, Penn State’s   newspaper, she braced for the response. The piece she wrote, an editorial reflecting the opinion of about a dozen editors at the paper, said the university “needed a reality check” after it announced plans to commemorate Paterno at the Penn   football game Saturday, when it will host a celebration of his first game as coach of the Nittany Lions, 50 years earlier. Davis, the opinions editor, wrote that it’s not the right time or the right way to honor Paterno when current students associate him with Jerry Sandusky, a longtime assistant coach who was found to be a serial child molester. “This is our Penn State. It is a Penn State without Joe Paterno,” she wrote, adding, “Those of us here now are beyond ready to move on. ” Davis, a junior from Lancaster, Pa. received hundreds of emails and online reader comments  —   most of them negative, and many that appeared to have been written by alumni. She was called a “clueless treacherous traitor” and told to resign from the paper or transfer to another university. She was accused of hating her university and hating football, and knowing nothing about Penn State history. She was called an idiot  —   by a teaching assistant at a Catholic school, no less  —   and other words that I can’t use here. One man wrote, “I hope God can forgive you for your actions, I sure the hell can’t. ” The vitriol threw Davis off, especially because so many of the attacks, including personal ones, came from graduates from the 1950s, ’60s and ’70s. This wasn’t educated debate. It was parents and grandparents with pitchforks decrying Davis’s and the newspaper’s thoughtful opinion  —   all to protect a man who may have enabled Sandusky’s crimes by not acting to stop them. Testimony in one lawsuit claimed that Paterno was told as far back as 1976 that Sandusky was abusing a child. It was groupthink at its worst: typical blind allegiance of college sports fans, who so often toss aside reason in the name of   sports at their alma mater. Penn State’s decision to honor Paterno is a manifestation of that. “You’re bringing up this man who is legendary for what he did for this university, but for good, bad or worse, he is tied to the whole Sandusky situation,” Davis told me. “You can’t remove him from either sphere, so that puts him in this middle ground. What bothers me the most is that there was no universitywide conversation about how to handle this  —   whether to honor him, or when. ” Considering how quietly Penn State announced Saturday’s Paterno day, the university’s officials must have known it wasn’t a great idea. On Sept. 1, in a news release about this year’s football promotions, it listed Sept. 17 as the game when fans wear either blue or white, depending on their seating section, to “create a stripe effect” in the stadium. And, oh, by the way, there will be a ceremony celebrating Paterno’s first game, too. It’s the first time he will be publicly honored since he was fired. University officials declined my request to discuss the decision. They’re eager to prop up Paterno on Saturday, but they don’t really want to talk about it. Understandable. If I were planning to celebrate someone who was accused of standing by as dozens of children were sexually abused, I wouldn’t want to say much, either. The university did give me a statement from Sandy Barbour, the athletic director, saying that Saturday’s ceremony would focus on Paterno’s commitment to   and academics. Two players from the 1966 game would toss the game coin. There would be a video presentation. How fans will react to the ceremony, or if there will be any protests, nobody is sure. For last week’s game at Pitt, some Pitt fans wore “Joe Knew”  . Some students and community members here have compartmentalized their feelings, which is probably easier for ardent football fans than for the abuse victims and their families. “We felt betrayed by what happened with Sandusky and the whole situation, but I think to celebrate Joe’s football career and nothing else seems O. K. to me,” said Tom Rodgers, 55, a laboratory equipment salesman who also works checking in ushers at football games. On Thursday, Rodgers, who lives in nearby Hollidaysburg, and several   stopped to look at a large mural of Penn State and community leaders on the side of the university bookstore downtown. Sandusky’s image was gone. Paterno’s was there, with a halo above his head. Inside the bookstore, there is a cache of Paterno memorabilia tucked into a corner. A   cardboard Paterno sells for $42. 99. One display showed   with 409 on the front, a nod to Paterno’s 409 victories, which put him on top of the   wins list. The N. C. A. A. had wiped away 111 of those victories because of the child abuse scandal, but reinstated them last year. Some alumni don’t want to hear this, but the universal adoration of Paterno here is a thing of the past. Most of these undergraduates arrived after Paterno died of lung cancer in 2012, at 85. Some students are familiar with his name mostly because it’s on one of the university libraries. One young woman who was scooping the controversial “Peachy Paterno” ice cream in the   Berkey Creamery said the flavor was one of the originals. (Impossible: The creamery celebrated its 150th anniversary last year.) Football is still king here, though. More than a dozen tents were pitched outside the    Beaver Stadium on Thursday, not far from the grassy hill that was created to hide the spot where Paterno’s statue stood before it was taken down in 2012. Students were camping out to claim great seats at Saturday’s game. Patrick Shelton, a freshman, was there with his fellow freshman John Peregrim. Shelton is fine with commemorating Paterno. Peregrim says it insults Sandusky’s victims. “We actually talked about this in my rhetoric class,” Shelton said. “About half of the class said it was O. K. to honor him, the other half said it was wrong. I’d say the campus is pretty much split down the middle. ” Davis will also be at Saturday’s game. She wouldn’t miss it. Though she has been accused of having no allegiance to Penn State, she comes from a Penn State family. Her father, her grandfather and two uncles are alumni. But her Penn State experience is nothing like her family’s, she said. The outside perception of the university is so much different, the perception of Paterno is different. Last summer, for example, she was on a trip in North Carolina and someone noticed her Penn State  . They yelled, “How’s Sandusky?” Embarrassing. Just like the reaction to her editorial. Just like Penn State’s inexplicable decision to publicly cheer for a coach only five years after he was fired amid a child abuse scandal, as the facts of the case are still unfolding.'"}, "time": 1742562336.5879142}