{"duration": 0.06569123268127441, "input_args": {"text": "'  Glazebrooks, a family of three who last week moved into a semi-detached house in Coronation Street, say they have little interest in getting involved with the community in their new home in Weatherfield. \\n‘We like the quiet life,’ said 48-year-old Barry, an insurance underwriter. ‘We got the place at a knock-down price thanks to that recent thing we read in the local news about a tram crashing into a nightclub and killing four people. I only chose Weatherfield for the easy commute – which hopefully it will be, once the trams are up and running again.’ \\nAs a near-teetotaller, Barry added that he does not envisage spending much time in the local pub, the Rovers Return Inn. ‘Besides, what with the last four landlords packing it in in acrimonious circumstances, lorries crashing into it and it being burnt to the ground, an attempted murder in the cellar and arguments going on there most nights, it doesn’t sound like my sort of place,’ he added. \\nHis 17-year-old son Philip, who has now settled in well at the local fee-paying academy Oakhill School, said that he had no plans for romantic entanglements. ‘Don’t get me wrong,’ he told reporters, ‘I’ve seen that Tracey Barlow from down the road and I definitely would, and I’ve heard there’s some lesbian action going on down at the Websters’, but I just have no time for that sort of thing with my A-levels coming up.’ \\nMeanwhile, Mary Glazebrook, 45, who decided against seeking work at the local clothing factory because she doesn’t believe it’s healthy to spend all her time closeted in a single small street, is reluctant to mix with her neighbours. \\n‘I mean, take that Gail McIntyre,’ she said. ‘She seemed nice enough when she said hello to me, but it turns out she has a long history of feuding with her mother-in-laws, her first husband was murdered, her second one was a serial killer who tried to kill her whole family by driving her car into a canal, her daughter got pregnant at 13, her son is a borderline psychopath, her long-last father came back after 30 years and turned out to be gay, then to top it all she married the debt-ridden father of the son’s girlfriend and ended up in prison accused of his murder when he fell off a boat. Honestly, you couldn’t make it up.’ \\nAs of today, the Glazebrooks have no plans to have a housewarming. ‘To be honest,’ continued Mary, ‘I don’t think we could fit it in, what with hosting our swingers parties and sacrificing animals to Satan. Besides, I really need to have that conversation with Barry about how he’s not actually Philip’s dad – his brother is.’ Share this story... \\nPosted: Nov 19th, 2016 by Oxbridge Click for more article by Oxbridge .. More Stories about: From The Archives 0'"}, "time": 1742564402.8856883}