{"duration": 0.10951423645019531, "input_args": {"text": "'Home » Headlines » Finance News » The Hyperinflationary Death Watch \\nEvery hyperinflation is unique. No one wants the chaos it will bring. We are not rooting for it. Monetary crisis is always part and parcel or a extension of the inevitable cycles of history. The DEATH WATCH has begun… \\n\\nFrom Dr. Jeffrey Lewis : \\nAn almost hysterical antagonism toward the gold standard is one issue which unites statists of all persuasions. They seem to sense – perhaps more clearly and subtly than many consistent defenders of laissez-faire – that gold and economic freedom are inseparable, that the gold standard is an instrument of laissez-faire and that each implies and requires the other. – Alan Greenspan \\nEvery hyperinflation is unique. No one wants the chaos it will bring. We are not rooting for it. Monetary crisis is always part and parcel or a extension of the inevitable cycles of history. \\nThe current path will at some point become yet another statistic. Like each currency collapses that has come before it, the next one will be burned into the viscera and the psyche of a generation. It should serve as a warning, though sadly it will likely be forgotten again as the collective memory fades. \\nHere is an excellent summary of the underlying process from the How Fiat Dies blog: \\nIsn’t the U.S. very different from Weimar Germany or Zimbabwe? \\nEach case of hyperinflation is unique, so if you are looking for differences you will always find them. You need to understand the common characteristics. Hyperinflation happens because government debt gets over 80% of GNP and deficit gets over 40% of spending. It does not matter how you get into that situation. Hyperinflation works the same if you lose a foreign war, a civil war, a dictator goes crazy, a government with excessive foreign debt, nationalizing too many businesses, rampant corruption, productive collapse, excessive regulation, a regime change, too many taxpayers fleeing high taxes, a massive depression, or whatever. It just matters that the government is spending nearly twice what they get in taxes and has already borrowed more than is reasonable. When they are in this situation they cannot borrow more, except from the central bank under their control. So they get the central bank to make money and “loan” it to them. When the reality is the only way they can pay back that “loan” from the central bank is by first getting another “loan” from the central bank, you are probably headed for hyperinflation. \\nAnother problem is that people often compare the U.S. before hyperinflation to some country during hyperinflation, which is not a fair comparison. For example, after prices are shooting up and interest rates go up, no banks will be making 30 year loans. So people will say the fact that the U.S. is making loans shows that it is different than some country with hyperinflation. This is silly. Of course, a country that does not yet have hyperinflation is different from a county in the midst of hyperinflation. The real trick is recognizing the circumstances that lead to hyperinflation. \\nWhen a country gets hyperinflation, there are a number of stages it goes through. \\nThings are very different as hyperinflation progresses. \\nThe Buffet Paradox \\nWatch as they do, not as they say. \\nQuote from Warren Buffet’s father, Howard Buffet: \\n“I warn you that politicians of both parties will oppose the restoration of gold, although they may outwardly seemingly favor it. Unless you are willing to surrender your children and your country to galloping inflation, war and slavery, then this cause demands your support. For, if human liberty is to survive in America, we must win the battle to restore honest money.” \\nThe irony is nearly absurd. Warren Buffett and his partner Charlie are the archetypes of the ant-capitalist movement. \\nThey are perceived to be the enemies of precious metals. \\nWhy does this dynamic duo scorn precious metals? \\nBecause they need the system in tact. Their survival depends on the mainstream buying it. They are to the mainstream culture, as Goldman Sacs is to their clients. There is no awareness; no punishment for recommending a flawed strategy for your clients that enriches your owners. \\nIn essence, this is manipulation gone wild. It is what the bullion banks accomplish with their interventions. They move the price, paint sentiment, induce buying and scoop up the real assets. \\nBuffet is buying physical assets and infrastructure. Energy and transportation to move that energy. Essentially, he is dumping dollars. And it is perfectly rational from the mainstream perspective. \\nSimply follow the money. He is no different than you or I who, instead, dump dollars for hard assets and the infrastructure to store it. \\nGrowth is the key, velocity is the myth. \\nHave you ever seen an economy in which it’s so easy to borrow, but so hard to earn? \\nThat is the key – the juxtaposition of no growth and low interest rates. It is unsustainable – and as the system fails incrementally, the very medication applied will be increased. \\nWe have billions of dollars of corporate buybacks pushing stocks higher. This is a far cry from real growth. \\nThe socialization of the U.S. mortgage market – where privately issued mortgages (unbacked by government guarantees) have virtually vanished. \\nThe unemployment number farce; if you remove enough potential workers from the count, the unemployment plummets toward zero. Orwell is twitching in his grave. \\nThe U.S. economy contracted by 2% in the first quarter of 2014, managing to wipe out $100 billion in economic growth from the initial forecast for Q1 GDP. \\nBut what is more compelling is that if one excludes the artificial stimulus to the U.S. economy generated from the Obamacare Q1 taxpayer-subsidized scramble, Q1 GDP would have contracted, not by 1%, but by 2%! \\nAll of this comes with good intentions centered on the belief that intervention on this scale will magically lead to an economy that no longer needs extreme manipulations to sustain itself. \\nThe monkey’s conclusion after the fish dies is that he should have done more sooner. This echoes all the way up to the most powerful money policy makers, including the infamous Ben Bernanke and his narrow belief that the first Great Depression could have been avoided if more aggressive monetary measures had been implicated. \\nThe calm before the storm. \\nToday, we have the spectacle of stagnant wages and rising prices. \\nCurrently, we don’t have hyperinflation. We have steady, grinding, and relentless inflation. \\nIt’s not the inflation that makes you think of wheelbarrows. It’s the sort of inflation that quietly eats your grandchildren. \\nGrowth is the life blood of all organic systems. If an economy is not moving forward, it is dying. Organic growth in this iteration has all but vanished. Short term pain for long term gain is an anathema. Long written off and socialized out of the vernacular. This is the ultimate signal of impending collapse. And it is right in front of us. \\nThe next hyperinflation will very quickly become an historic anomaly difficult to relate with. Yet we can see the current experiment evolving right before our eyes. If only we dare to look and take action. 2017 Gold Pandas and 2017 Silver Pandas Are Now Available! Secure Your 2017 Panda Coins Today at SD Bullion!'"}, "time": 1742562059.7367105}