{"duration": 0.2864646911621094, "input_args": {"text": "'By Rahul Manchanda, Esq. on October 30, 2016 The Neo-Con/Communist natives are restless, they desperately want their World War 3... \\nby Rahul Manchanda, Esq. \\nNever in America’s history has she been in more danger of a “false flag” attack from her enemies, both foreign and domestic, than she is now. \\nThe contemporary term “false flag” describes covert operations that are designed to deceive in such a way that the operations appear as though they are being carried out by entities, groups, or nations other than those who actually planned and executed them. \\nHistorically, the term “false flag” had its origins in naval warfare where the use of a flag other than the belligerent’s true battle flag before (but not while) engaging the enemy has long been accepted as a permissible ruse de guerre ; by contrast, flying a false flag while engaging the enemy constitutes “perfidy.” \\nOperations carried out during peace-time by civilian organizations, as well as covert government agencies, can (by extension) also be called false flag operations if they seek to hide the real organization behind an operation. \\nAmerica has been thoroughly infiltrated by a mighty and wealthy foreign power and menace, while her people are suffering financially, and she is now poised to be sacrificed on the altar of history for a one world government headquartered overseas. \\nThe Neo-Con/Communist natives are restless, they desperately want their World War 3, and they are wanting to move their wealth and power to their next world empire, which will be the final one in their sick deluded minds, unopposed and permanent.   \\nNow that Hillary Clinton has been “theoretically re-indicted” by the FBI for the email scandals (although they are being obstructed by our very own US Department of “Justice” under Attorney General Loretta Lynch) this has effectively ruined her chances of becoming President through legal channels, so they only have one more option – and that is a false flag attack leading us directly into World War 3 in a nuclear war, using all of their carefully placed traitors in the Pentagon, Department of Defense, Department of Homeland Security, Federal Bureau of Investigation, Department of Justice, and cooperative local police departments all throughout the United States, with a declaration of a state of emergency in both the United States, and abroad. \\nThis is why it is vitally important that all Americans, both in the private and public sector, start watching their government and elected leaders like “hawks.” \\nAmericans need to use the Neo-Con’s mantra of “See Something, Say Something” against them. \\nThe Neo-Con/Stasi/Communist’s Zersetzung (organized gang-stalking under Bill Clinton’s Community Oriented Policing “COPS” program) needs to be turned by the People against them, and the American People need to watch each and every single one of them like they would watch a lunatic holding an AK-47 in a mall. “Regime Change” Brigade \\nThe Neo-Cons simply can not be trusted, as they work for the Plutocrats, who desperately want to hold on to their power, and will not willingly relinquish it to the People by way of Donald Trump and his Populist Revolt and Uprising. \\nSome examples of real false flags throughout history having routinely disastrous results, wherein the “winners” re-wrote history, include the: \\n(1) 1914 Battle of Trindad fought between the British auxiliary cruiser RMS Carmania and the German auxiliary cruiser SMS Cap Trafalgar which had been altered to look like Carmania; \\n(2) World War II German commerce raider Kormoran which surprised and sank the Australian light cruiser HMAS Sydney in 1941 while disguised as a Dutch merchant ship, causing the greatest recorded loss of life on an Australian warship; \\n(3) trial of Otto Skorzeny, who planned and commanded Operation Greif, by a U.S. military tribunal at the Dachau Trials included a finding that Skorzeny was not guilty of a crime by ordering his men into action in American uniforms; \\n(4) 1788 incident wherein the head tailor at the Royal Swedish Opera received an order to sew a number of Russian military uniforms to stage an attack on Puumala, a Swedish outpost on the Russo-Swedish border allowing King Gustav III of Sweden, who lacked the constitutional authority to initiate unprovoked hostilities without the Estates’ consent, to launch the Russo-Swedish War (1788–1790); \\n(5) September 1931 incident wherein Japanese officers fabricated a pretext for invading Manchuria by blowing up a section of railway; \\n(6) Gleiwitz incident in 1939 involving Reinhard Heydrich fabricating evidence of a Polish attack against Germany to mobilize German public opinion for war with Poland; \\n(7) November 26, 1939 incident wherein the Soviet army shelled Mainila, a Russian village near the Finnish border blaming Finland for the attack using the incident as a pretext to invade Finland, starting the Winter War, four days later; \\n(8) 1962 Operation Northwoods plot by the U.S. Department of Defense for a war with Cuba involving scenarios such as fabricating the hijacking or shooting down of passenger and military planes, sinking a U.S. ship in the vicinity of Cuba, burning crops, sinking a boat filled with Cuban refugees, attacks by alleged Cuban infiltrators inside the United States, and harassment of U.S. aircraft and shipping and the destruction of aerial drones by aircraft disguised as Cuban MiGs to be blamed on Cuba and a pretext for an invasion of Cuba and the overthrow of Fidel Castro’s communist government; \\n(9) Reichstag fire which was an arson attack on the Reichstag building in Berlin on February 27, 1933 using as “evidence” by the Nazis that the Communists were beginning a plot against the German government, whereby Adolf Hitler, who was sworn in as Chancellor of Germany four weeks before, on 30 January, urged President Paul von Hindenburg to pass an emergency decree to counter the “ruthless confrontation of the Communist Party of Germany” – with civil liberties suspended, the government instituted mass arrests of Communists, including all of the Communist parliamentary delegates; \\n(10) April 4 1953 incident wherein the CIA was ordered to undermine the government of Iran over a four-month period, as a precursor to overthrowing Prime Minister Mohammad Mosaddegh by carrying out false flag attacks “on mosques and key public figures” to be blamed on Iranian communists loyal to the government, code-named “TP-Ajax,” the tactic of a “directed campaign of bombings by Iranians posing as members of the Communist party” involving the bombing of “at least” one well known Muslim’s house by CIA agents posing as Communists; \\n(11) 2008 shooting of two minibuses carrying Georgians who lived in Abkhazia who wanted to cross the border so they could go and vote in the parliamentary election that day, in a volatile area on the border of Abkhazia and the Republic of Georgia, wherein President Saakashvili indicated that the attack had been an attempt to disrupt the election, implying that it had been Abkhaz or Russian forces who had been behind it, providing a favorable opportunity for the president to focus the nation’s attention on an external enemy, leading attention away from his domestic critics, as well as making use of his position as leader to rally the Georgians around his candidates in the election; \\n(12) assassination of Charlemagne Péralte of Haiti in 1919, after checkpoints were passed by military disguised as guerrilla fighters; \\n(13) Mau Mau uprising in the 1950s, wherein captured Mau Mau members who switched sides and specially trained British troops initiated the pseudo-gang concept to successfully counter Mau Mau; \\n(14) Algerian civil war in the middle of 1994 wherein death squads composed of Département du Renseignement et de la Sécurité (DRS) security forces disguised themselves as Islamist terrorists and committed false flag terror attacks; \\n(15) Mexican wars of 1819 and 1846-48; \\n(16) Spanish-American War of 1898 involving the surprise explosion of the battleship Maine at Havana, Cuba wherein the Hearst Press accused the Spanish and the USA declared war on Spain conquering the Philippines, Guam and Cuba; \\n(17) World War I in 1914-1918 wherein a U-boat torpedo hit ocean liner Lusitania near Britain and some 1200 people, including 128 Americans, on board lost their lives, and subsequent investigations revealed that the major explosions were inside the Lusitania, as it was secretly transporting 6 million pounds of artillery shells and rifle ammunition, as well as other explosives on behalf of Morgan Banking Corporation to help Britain and France; \\n(18) World War 2 in 1939-1945 where a U-boat torpedo hit the ocean liner Athenia near Britain with some 1100 passengers, of which 311 were Americans; \\n(19) US naval intelligence planning and suggesting “8 insults” to bring Japan into war with the US, and where President Roosevelt executed this plan immediately and also added some other insults, enraging Japan, such as a total blockade of Japanese oil imports, as agreed between the Americans, British and the Dutch – FDR also declared an all-out embargo against Japan and forbade them the use of the Panama Canal impeding Japan’s access to Venezuelan oil; \\n(20) one of many incidents provoking Japan to attack Pearl Harbor some 6 months later; \\n(21) Korean War in 1950-1953 wherein South Korean incursions (the Tiger regiment etc.) into North Korea (1949) led to contrary claims and into war – the cause of this war was covert action involving leaders of Taiwan, South Korea and the US Military Industrial Complex (John Foster Dulles has been mentioned as an organizer of the hostilities); \\n(22) Vietnam War in “The Gulf of Tonkin Incident” wherein the American destroyer Maddox was supposedly attacked twice by three North Vietnamese torpedo boats in 1964 in the Gulf of Tonkin – but which never happened; \\n(23) Grenada invasion whereby the Grenadian leader, Maurice Bishop, who favored the left and invited Cubans to build infrastructure to accommodate long range Soviet aircraft was deposed and executed in October 19, 1983 – six days later the US invaded, with the supposed reason that American medical students studying in Grenada were in danger due to a “Cuban presence”– and of course the new leader supported by the US favored more traditional values and the right; \\n(24) Panama invasion wherein an incident between American and Panamanian troops led to invasion and the earlier Carter administration plan to hand control of the canal over to Panama was cancelled; \\n(25) US-Israeli sponsored wars between Iraq and Iran from 1980-1988; \\n(26) Desert Storm War (First Gulf War) in 1991 wherein Saddam Hussein asked for permission from the US (via their ambassador April Gillespie) to invade Kuwait, and got an answer that the US was not concerned with “Arab quarrels” – this was a trap, and after Saddam occupied Kuwait, George Bush Sr. mobilized a coalition of some 40 nations to “liberate Kuwait” and smash the recently-built Iraqi military power base – this incident also involved a media hoax wherein the daughter of a Kuwaiti US Ambassador played a nurse on TV and testified to “witnessing” Iraqi soldiers throwing babies out of incubators in Kuwait; \\n(27) War on Terror launched by the Bush administration in October 2001 – claimed to be the response to terrorism, especially the 9-11 incidents; \\n(28) Operation Enduring Freedom (Afghanistan invasion); \\n(29) Enduring Justice (Second Gulf war); and \\n(30) countless others. \\nParagraph 43 of the Field Manual published by the War Department, United States Army, on 1 October 1940, under the entry Rules of Land Warfare states: “National flags, insignias and uniforms as a ruse – in practice it has been authorized to make use of these as a ruse. The foregoing rule (Article 23 of the Annex of the IVth Hague Convention), does not prohibit such use, but does prohibit their improper use. It is certainly forbidden to make use of them during a combat. Before opening fire upon the enemy, they must be discarded.” \\nThe American Soldiers’ Handbook states: “The use of the enemy flag, insignia, and uniform is permitted under some circumstances. They are not to be used during actual fighting, and if used in order to approach the enemy without drawing fire, should be thrown away or removed as soon as fighting begins.” \\nThe 1977 Protocol Additional to the Geneva Conventions of August 12, 1949 (Protocol I) states: \\nArticle 37. – Prohibition of perfidy – 1. It is prohibited to kill, injure, or capture an adversary by resort to perfidy. Acts inviting the confidence of an adversary to lead him to believe that he is entitled to, or is obliged to accord, protection under the rules of international law applicable in armed conflict, with intent to betray that confidence, shall constitute perfidy. The following acts are examples of perfidy: (a) The feigning of an intent to negotiate under a flag of truce or of a surrender; (b) The feigning of an incapacitation by wounds or sickness; (c) The feigning of civilian, non-combatant status; and (d) The feigning of protected status by the use of signs, emblems or uniforms of the United Nations or of neutral or other States not Parties to the conflict. 2. Ruses of war are not prohibited. Such ruses are acts which are intended to mislead an adversary or to induce him to act recklessly but which infringe no rule of international law applicable in armed conflict and which are not perfidious because they do not invite the confidence of an adversary with respect to protection under that law. The following are examples of such ruses: the use of camouflage, decoys, mock operations and disinformation. \\nArticle 38. – Recognized emblems – 1. It is prohibited to make improper use of the distinctive emblem of the Red Cross, Red Crescent or Red Lion and Sun or of other emblems, signs or signals provided for by the Conventions or by this Protocol. It is also prohibited to misuse deliberately in an armed conflict other internationally recognized protective emblems, signs or signals, including the flag of truce, and the protective emblem of cultural property. 2. It is prohibited to make use of the distinctive emblem of the United Nations, except as authorized by that Organization. \\nArticle 39. – Emblems of nationality – 1. It is prohibited to make use in an armed conflict of the flags or military emblems, insignia or uniforms of neutral or other States not Parties to the conflict. 2. It is prohibited to make use of the flags or military emblems, insignia or uniforms of adverse Parties while engaging in attacks or in order to shield, favour, protect or impede military operations. 3. Nothing in this Article or in Article 37, paragraph 1(d), shall affect the existing generally recognized rules of international law applicable to espionage or to the use of flags in the conduct of armed conflict at sea.” \\nIt is vitally important to note that while the United States may have these codes and regulations, her enemies, both foreign and domestic, are not bound by these Rules. \\nThe American People (and indeed the rest of the world) need to be exceptionally on guard and vigilant before the upcoming November 2016 election, and even many months afterwards, because the Neo-Cons/Communists may still try and get their World War 3, even if Donald Trump is elected. \\nAfter all, September 11, 2001 took place a full 9 months after George W Bush was sworn in at his Inauguration in January 2001, and this was blamed on Osama Bin Laden who was a known CIA Asset and who allegedly declared War on America in 1998 – he might have been the Neo-Cons’ insurance plan, cooked up during the 8 year Clinton Administration from 1992-2000. \\nAnd of course, 9-11 is what led to the wholesale bloodshed and regime changing wars for the past 15 years, leaving the Middle East in flames, with countless millions of innocent lives and refugees lost forever, the greatest genocide and bloodbath the world has ever known. \\nAnd don’t think that these crazed Neo-Con psychopaths won’t do it again, especially when there are only a few more countries left to “take out” now – Russia, Iran, and North Korea – as opposed to 20. \\nSee:'"}, "time": 1742562332.996035}