{"duration": 0.05871438980102539, "input_args": {"text": "'Posted 10/31/2016 12:28 pm by PatriotRising with 0 comments \\nHalloween seems as good a time as any to remind ourselves that the United States is in the midst of perhaps the most truly horrifying presidential election in modern history. Sure, we’ve seen buffoons, members of political crime families and unhinged warmongers run for president before — but seldom in American politics has a political candidate been as unpredictable as Donald Trump or checked as many unsavory boxes as Hillary Clinton. \\n\\nIn case you’re hoping to read an endorsement of Republican Donald Trump within the body of this piece, allow me to chill your anticipation: There won’t be one. \\n\\nWhile Trump has certainly led a successful life and smartly built a business empire by gaming a system which is stacked against the vast majority of Americans, there’s little reason to believe that he’s any more trustworthy than your average backcountry used car salesman. \\n\\nTrump’s worldview is shaded by a personal belief that everything he says and thinks absolutely is correct, believe me. That’s what makes him such a maverick salesman. In any sales 101 course, students learn that customers respond best to sales tactics dripping in assertions of authority on the subject of the product being sold. They don’t necessarily have to be true—but any fast talker worth his commission knows all the best words to make anything appear honest, if only long enough to get that signature on the dotted line. \\n\\nTrump is a gamble. \\n\\nAnd with that, maybe there is room for a slighted endorsement of a Trump presidency. At least he’s peddling a product to the American voting public. He’s going to “Make America Great Again,” whatever that means. \\n\\nWe haven’t actually gotten a good look at the nuts and bolts of the Trump sales equation, so it is at best an as-is sale. \\n\\nHillary Clinton, meanwhile, can be precisely defined as “the devil we know.” \\n\\nNot only has she spent three decades in various states of public office, but by mishandling sensitive information she’s also carelessly made available the finer points of her plans for the American future. \\n\\nUnfortunately, the terrifying reality of Clinton’s vision are of little consequence to her campaign. The Clinton family developed a winning formula for media manipulation way back when they occupied the Arkansas Governor’s Mansion, so she has no need to finesse supporters into believing in her product. \\n\\nIf you know anyone supporting Clinton simply because they are put off by Trump’s lack of a political record, here are a few things you ought to let them know. \\n\\nClinton’s email scandal is only just beginning. As president, the controversy would likely continue to distract her from the work of running America. \\n\\nShe is a deranged sociopathic war criminal who should be indicted for conspiracy and murder. \\n\\nA Clinton White House would heighten tensions between the U.S. and Russia by doubling down on Clinton’s failed State Department policies. \\n\\nClinton refuses to take responsibility for any of her actions . \\n\\nGiven Clinton’s trouble from transparency groups, her election would likely bring about a major crackdown on whistleblowers. \\n\\nClinton is also, as one journalist put it, beholden to scumbags who she will work for from the Oval Office. \\n\\nThe bottom line here is that Americans hoping for a transformative outcome in the 2016 presidential election are likely to be very disappointed. Aside from saying “not Clinton,” it’s pretty impossible to say anyone really deserves a thinking American’s vote in this cycle. The third-parties, as usual, are hell’s snowballs thanks to the political establishment’s efforts; and neither mainstream candidate is likely to reverse the nation’s leading causes of decline: cronyism, military adventurism, ballooning government and a continued disregard for the constitutional principles on which it was founded.'"}, "time": 1742563186.4068987}