{"duration": 0.0642087459564209, "input_args": {"text": "'Americans Go to the Polls to Choose Destiny for Nation November 08, 2016 Americans Go to the Polls to Choose Destiny for Nation \\nDemocrat Hillary Clinton and Republican Donald Trump face voters on Tuesday as millions of Americans turn out on Election Day to pick the next U.S. president and end a bruising campaign that polls said favored Clinton. In a battle centered largely on the character of the candidates, Clinton, 69, a former secretary of state and first lady, and Trump, 70, a New York businessman, made their final, fervent appeals to supporters late on Monday to turn out the vote. World markets braced for the outcome of one of the most contentious U.S. presidential elections in history, with stocks up slightly on cautious expectations of a Clinton win. The dollar and bond yields slipped, while gold inched up. Oil markets were rattled as well. Clinton arrived to cast her ballot at an elementary school in her hometown of Chappaqua, New York, on Tuesday morning. Trump, who planned to vote later in Manhattan, began Election Day with a ritual call to the \"Fox & Friends\" morning news show. \"I\\'m a little bit superstitious,\" he said. \"I\\'ve won many primaries speaking to you first in the morning. Each then hoped to hold an evening victory rally about a mile apart in New York City. \\nThe final week of campaigning was a grinding series of get-out-the-vote rallies across battleground states where the election is likely to be decided. \\n\"We choose to believe in a hopeful, inclusive, big-hearted America,\" Clinton said in Philadelphia before a crowd of 33,000 - the largest of her campaign. \\nShe was joined by Democratic President Barack Obama; his wife, Michelle; and Clinton\\'s husband, former President Bill Clinton, along with singers Jon Bon Jovi and Bruce Springsteen. \\nShe later made another star-studded appeal in Raleigh, North Carolina, flanked again by Bon Jovi and by Lady Gaga in a midnight rally. \\nLISTEN MORE: PASTOR RICK WILES AND GUEST AARON BRICKMAN DISCUSS THE AMERICA\\'S ELECTION DESTINY \\nAt an evening rally in Manchester, New Hampshire, Trump brought much of his family and running mate Mike Pence on stage. The raucous event in the state that gave Trump his first primary win featured a fog machine and red-white-and-blue lasers. \\nLater, Trump visited the traditionally Democratic state of Michigan, where he framed his candidacy as a historic choice for blue-collar voters he hopes will send him to the White House. \\n“Today is our Independence Day,” Trump said in Grand Rapids. \"Today the American working class is going to strike back, finally.\" \\nNews from Reuters , Editing and commentary from TRUNEWS Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles  '"}, "time": 1742562839.9390626}