{"duration": 0.06811761856079102, "input_args": {"text": "'By Reuters   7:16 pm Heading into the homestretch of the presidential campaign, Democratic candidate Hillary Clinton is looking to harness some celebrity star power to help get out the vote and energize volunteers in battleground states.   \\nBy Roberta Rampton \\nDAYTONA BEACH, Fla. (Reuters) – Heading into the homestretch of the presidential campaign, Democratic candidate Hillary Clinton is looking to harness some celebrity star power to help get out the vote and energize volunteers in battleground states. \\nJennifer Lopez will headline a free concert for Clinton supporters in Miami on Saturday, giving the former secretary of state a chance to connect with the key demographic of millennials she has sometimes struggled to reach – and some visual counter-programming to the latest email controversy to roil her race for the White House. \\nThe Federal Bureau of Investigation said on Friday it is investigating more emails as part of a probe into Clinton’s use of a private email system – a late-breaking surprise that will likely continue to get extensive media play leading up to the Nov. 8 vote \\nCelebrity-driven events like the concert “can serve as a bit of a distraction” from the controversy, said Eric Kasper, a political scientist at the University of Wisconsin-Eau Claire. \\n“It is a way to kind of take the edge off things because it tends to be more positive,” Kasper said. \\nThe JLo concert is the first in a series. Next week, Clinton will take the stage with Jay Z in Cleveland, and then with Katy Perry in Philadelphia on Nov. 5. \\nA Harvard University poll this week showed that among likely voters aged 18 to 29, Clinton is leading Republican rival Donald Trump, a celebrity in his own right who starred in the reality television show “The Apprentice.” \\nBut turnout is a concern. The exceptionally negative tone of this year’s race for the White House has soured young Americans on politics, Reuters/Ipsos polling shows. \\nPresidential candidates have long sought to create buzz with help from celebrity pals, said Tevi Troy, who chronicled the strategy in his book “What Jefferson Read, Ike Watched, and Obama Tweeted: 200 Years of Pop Culture in the White House.” \\n“Campaigns do it to reach out to people who are not necessarily interested in politics but are interested in pop culture,” said Troy, a presidential historian who worked in the George W. Bush White House. \\nThe events are like a larger version of a campaign yard sign, a way to show a “groundswell” of support behind a candidate – and a way to appeal to fans of the musicians, said Kasper, who has studied the intersection between pop culture and politics. \\n“It can create a kind of psychological connection that we otherwise might not have when a politician endorses a presidential candidate, for instance,” Kasper said. \\n(Reporting by Roberta Rampton; Editing by Leslie Adler) \\nConcert plus campaign: Clinton turns to celebrities in homestretch added by Reuters on Sat, Oct 29th, 2016'"}, "time": 1742564357.256587}