{"duration": 0.0540623664855957, "input_args": {"text": "'Chelsea Manning, the former U. S. soldier who leaked thousands of classified military documents to WikiLeaks, will receive free health care and remain on active duty after being released from prison. [Manning will be freed on May 19th and remain on active duty as well as continue to receive health care benefits conferred to members of the military and access to commissaries, army spokesperson Dave Foster confirmed.  “Pvt. Manning is statutorily entitled to medical care while on excess leave in an active duty status, pending final appellate review,” Foster said. In 2013, Manning was sentenced to 35 years in jail for leaking over 700, 000 classified documents, the biggest leak in U. S. military history. Manning was found guilty of 20 counts, six of them under the Espionage Act, but was acquitted of the most serious charge of “aiding the enemy. ” Much of the content of the leaks, published through Julian Assange of WikiLeaks proved explosive, including a video of an Iraqi airstrike the organization titled “Collateral Murder,” summary executions by U. S. troops of Iraqi civilians, as well as details of corruption within Tunisian leader Ben Ali’s government that potentially led to the Arab Spring. While in prison, Manning went on a hunger strike to demand sex change surgery, which officials eventually granted at the cost of American taxpayers. However, in the final days of his presidency, Barack Obama pardoned Manning and commuted the full sentence, claiming he felt “confident that justice has been served. ” “The notion that the average person who is thinking about disclosing vital classified information would think that it goes unpunished. I don’t think would get that impression from the sentence that Chelsea Manning has served,” Obama said at the time. President Donald Trump sternly criticized the decision, describing Manning as an “ungrateful traitor” who “should never have been released from prison. ” Ungrateful TRAITOR Chelsea Manning, who should never have been released from prison, is now calling President Obama a weak leader. Terrible!  —   Donald J. Trump (@realDonaldTrump) January 26, 2017,  Over the course of his presidency, Obama commuted the sentences of 1, 385 criminals and granted a total of 212 pardons, most of them guilty of   crimes. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com.'"}, "time": 1742564568.3909538}