{"duration": 0.07648897171020508, "input_args": {"text": "'Home / BREAKING NEWS / BREAKING: FBI Makes Stunning Reversal, Reopens Clinton Investigation After Discovery of New Documents BREAKING: FBI Makes Stunning Reversal, Reopens Clinton Investigation After Discovery of New Documents Claire Bernish October 28, 2016 Leave a comment \\nIn a thoroughly stunning development, the FBI has announced the relaunch of an investigation into Hillary Clinton’s emails and personal server, after learning of “ the existence of emails that appear to be pertinent to the investigation ,” as Rep. Jason Chaffetz tweeted this afternoon. FBI Dir just informed me, \"The FBI has learned of the existence of emails that appear to be pertinent to the investigation.\" Case reopened \\n— Jason Chaffetz (@jasoninthehouse) October 28, 2016 \\nWith just ten days to go before the presidential election, this development could knock the Clinton campaign for quite the loop — particularly amid growing controversy in revelations from campaign chair John Podesta’s emails, which continue to be published by Wikileaks on a daily basis. \\nFBI Director James Comey penned a letter to Congress Friday, noting the bureau had learned additional documents had become apparent that could have bearing in the investigation of Clinton, stating , in part, via NBC News : \\n“Although the FBI cannot yet assess whether or not this material may be significant, and I cannot predict how long it will take us to complete this additional work, I believe it is important to update your Committees about our efforts in light of my previous testimony.” \\nComey did not make apparent the content nor source of the documents, nor did he provide many extenuating details about the decision to relaunch the probe; however, after consulting with the team of investigators, “agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to asses their importance to our investigation.” \\nComey made no suggestion whether or not the documents could be “significant,” but the fact the investigation has now been reopened certainly piques additional questions about both the new items as well as how they might have originally escaped the FBI’s attention. \\n“There are outstanding questions .\\u2002.\\u2002. regarding a possible conflict of interest into this case,” stated House Oversight Committee Chairman Jason Chaffetz in a letter to FBI Deputy Director Andrew McCabe, as cited by the Washington Post . Chaffetz requested McCabe provide documentation concerning his wife’s 2015 bid for the Senate, which, as the Post notes, received financial support from Virginia Gov. Terry McAuliffe, who is close to Hillary Clinton. \\nChaffetz requested documents from McCabe concerning “when you first became aware the State Department was pressuring the FBI to reverse its decision regarding the classification of one of Secretary Clinton’s emails,” and, “when you first became aware the FBI had opened an investigation into Secretary Clinton’s email server.” \\nIndeed, Chaffetz notes several discrepancies in interdepartmental interactions during the course of the prior investigation, such as: \\n“In the spring and summer of 2015, the FBI interacted with multiple agencies regarding Secretary Clinton’s emails. In April or May of 2015, Under Secretary of State for Management Patrick Kennedy began contacting officials in the FBI’s National Security Branch, which you headed prior to serving as the head of the Washington Field Office. Under Secretary Kennedy pressured FBI officials to reverse a decision regarding an email deemed by the FBI to contain classified information. …” \\nConsidering the increasingly embattled campaign of Hillary Clinton, and the late date for initiating further investigation, one wonders whether the abrupt discovery could be related to the putatively missing 30,000 emails which have been the subject of both consternation and ridicule for months. \\nAlthough Comey did not reveal, well, much of anything about the decision to relaunch the investigation, it’s clear this will have a direct and resounding impact on Hillary Clinton’s contentious bid for the White House. Share'"}, "time": 1742563540.6451478}