{"duration": 0.09646463394165039, "input_args": {"text": "'November 09, 2016 First Thoughts On The Not-Hillary Election Results \\nSo I just woke up and found that the world has changed. World War III was called off. Trump won, Clinton conceded. His victory speech is fair and integrating. \\nMy \"not Hillary\" prediction for the election was right. That is, I believe, how Trump won. No so much by gaining genuine votes but by taking them from the crappiest candidate the Democrats could send into the race. This was not a \"white vote\". Trump did better with black (+5) and latino (+2) voters than Romney. Racism does not explain that. Clinton promised more wars. Those who would have to fight them on the ground rejected that position. \\nThe people voted against corruption, against international warmongering, against attacks of the culture of their life and against Zionist and Arab manipulation. In short - they voted against Hillary. \\nThe media with their outright and widespread manipulation and one sided reporting against Trump and for Clinton lost too. People did not believe the partisan crap that fact-checked Trump on every minor issue but hardly reported on the huge, huge scandals and corruption Wikileaks revealed about the Clintons. Fact-checkers ain\\'t a good weapon in a culture war. The polls, but the one of the LA Times, turned out to be systematic manipulation. \\nThe leading politicians in Europe will crap their pants. Nearly all but Putin bet heavily on Clinton. The European media were also strongly pro Clinton, even more so than in the U.S. There was zero reporting about Trump\\'s real political positions and support. Only tiny bits about Clinton\\'s corruption were revealed on the back pages. They always believe what the NYT writes is the essence of U.S. thinking. It is far from it. No one but a few east-coast party goers and the NYT cares about some 16 year old girl, who thinks she is \"transsexual\" and wants to use a men\\'s public toilet. The average people think that such craziness deserves zero attention if not a hefty kick in the ass. Pro-migration and other political correctness movements in Europe will have a difficult stand now. They can no longer work against the instincts of the people by pointing to the soothing, fake words of an Obama or Clinton. \\nThe Democratic party failed. The outright corruption of the party heads, who pushed Sanders out to move Clinton in by manipulating the primaries, blocked the natural development that went on at the base. They even wanted Trump as a candidate because they though Clinton could easily beat him. They were totally detached from real life. I am sure that post-mortem analysis will show that many, many potential pro-democratic voters were just disgusted and stayed at home or voted for a third party. The establishment of the Republican party were no better. They failed their voters just as much by shunning Trump and working for Clinton. All the neo-cons that flocked to Clinton will now scramble to get back to Trump. They will have little chance. \\nBut the election also created huge new dangers. People around Trump, including his vice-president, are not sane realist but fairly extreme ideologues. Trump himself isn\\'t. He is, in my estimate, fairly pragmatic. The Republicans also won the Senate and House. There is a danger that extreme policies will be implemented with huge and terrible long-term consequences. But remember that Obama had the same chance in his first two years of his Presidency. He never used it. From a progressive view he blew it. \\nWinning back the House and Senate in two years is a must for anyone with some middle-of-the-road thinking. \\nI believe that this result is good for Syria and the non-Jihadi and non-Zonist Middle East. Al-Qaeda in Syria will have a sad. Their main supporters leave the stage. The result is likely good for Europe including for Russia. It is bad for economic equality in the United States. \\nI for one feel mightily eased. The U.S. voters knocked over a chessboard that brought war and misery to many people. We do not know how the new game will look but I think there is a fair chance now that it, in total, will be somewhat less devastating for the global good. Posted by b on November 9, 2016 at 03:03 AM | Permalink'"}, "time": 1742562194.396154}