{"duration": 0.22081875801086426, "input_args": {"text": "'in: Mainstream Media , Politics , Propaganda , Sleuth Journal Yes, Virginia, there really IS a poll fairy skewing the polls in favor of Hillary Clinton. Yesterday, I wrote about a brand new leak that had come my way. I read through the first 5 pages, confirmed that the two entities in the document were genuine and were really in cahoots, and quickly got out the information that the polls we are seeing with Clinton in the lead are fake. But, in full disclosure, I made a mistake. I really should have read the last 3 pages, because if I had, I wouldn’t have published the document as a legitimate leak. It was full of outrageous Hollywood sci-fi “salvage options” for the campaign that included magnetized mind control and a fake alien invasion. It’s interesting to note that all of those options actually do exist – DARPA experiments on things like that , and things even creepier . However, it seems far-fetched that the Clinton campaign would/could go that far, and even more so that a business that does polls and analyzes them would have experimented with the tactics. So, I removed the post. There are enough lies and rumors going around the internet without me adding to them. That isn’t the end of the story, though, because part of that document was legit. I began to do further research and discovered that the gist of the fake document was accurate. The polls in the MSM that show Hillary in the lead are being faked, and they’re being bought and paid for. We’re all being manipulated by the collusion of Hillary Clinton, the DNC, and the media. Their attempts at predictive programming through fake polls is so blatant that even the most oblivious people have noticed that something seems awry. It has long been a successful method of propaganda to leave in just enough truth to make the lie seem viable. In Mein Kampf , Adolf Hitler wrote (emphasis mine): All this was inspired by the principle—which is quite true within itself—t hat in the big lie there is always a certain force of credibility ; because the broad masses of a nation are always more easily corrupted in the deeper strata of their emotional nature than consciously or voluntarily; and thus in the primitive simplicity of their minds they more readily fall victims to the big lie than the small lie, since they themselves often tell small lies in little matters but would be ashamed to resort to large-scale falsehoods. It would never come into their heads to fabricate colossal untruths, and they would not believe that others could have the impudence to distort the truth so infamously . Even though the facts which prove this to be so may be brought clearly to their minds, they will still doubt and waver and will continue to think that there may be some other explanation. For the grossly impudent lie always leaves traces behind it, even after it has been nailed down, a fact which is known to all expert liars in this world and to all who conspire together in the art of lying . First of all, I found a copy of the disbursements from a Clinton-aligned SuperPac called Priorities USA Action on the website Red State Watcher . (click image to enlarge) This shows that the SuperPac paid the princely (or should I say, presidential?) sum of $391,250.00 for polls that were overwhelmingly positive to Clinton. These documents appear to be legitimate. The website Conservative Treehouse did a great analysis and posted links to the FEC(Federal Election Commission) filing PDFs from the SuperPac, as well as screenshots. Here are links to the PDF – pages 92 and 118 show that they did indeed make the payments shown above. But… When I did a reverse image search, I found the same thing on the following sites. And by the same thing, I mean exactly the same. And, these sites with conservative sounding names are all relatively new sites. I checked on Alexa.com to see how long they’d been around. Aside from Red State Watcher, which is definitely legit and has been around for a long time, here’s the rundown on a few of the others. http://usapoliticsnow.com/ – since May 2016 http://incredibleusanews.com/ not long enough for statistics to be available http://truthfeed.com/ – since May 2016 Now, this doesn’t say for certain these sites are fake ones, put up by the opposition, but it does cast some questions on the credibility. These stories are all based on a video alleged to be by Anonymous, but in actuality, the YouTube channel is Anonymous Patriots. Their first video was posted 7 months ago – March 16, 2016. Other sources concur that the polls being broadcast by the mainstream are skewed or outright fake. A professor at SUNY has been saying all along that Donald Trump was strongly in the lead. Back in February, Fortune magazine published an article by Dr. Northrup that showed, based on his analysis, Trump had a 97% chance of winning the election. He still stands by this opinion. Dr. Helmut Norpoth wrote a post for The Hill explaining how these polls published by the MSM are misleading. To start with something basic, opinion polls are really about “opinions,” not actions. At their best, they can tell us how people feel about political issues and personalities. Do voters, for instance, like or dislike candidates such as Hillary Clinton and Donald Trump? Yet having an opinion and acting on it are two different things. Barely 6 in 10 voting-age American citizens turn out for presidential elections. Ascertaining the opinions of 100 citizens is just a start. Now you have to determine which 60 of them actually take the time to mark a ballot. They are the “likely voters.” They are the only ones that count. But to find them is no easy chore. It is ingrained in all of us that voting is civic duty. So nearly all of us say, oh yes, I’ll vote, and then many will not follow through. Dr. Northrup is not alone in his claims that Trump is far, far ahead of Hillary Clinton. The website Govt. Slaves reported on a polling app called Zip back in August. Despite a majority of opinion polls showing the 2016 presidential election going to Democrat Hillary Clinton, a smartphone app developer says his data suggests challenger Donald Trump will be the victor. “Based on the stats we see, he looks strong,” says Ric Militi, co-founder of San Diego-based Crazy Raccoons, maker of the Zip question and answer app. His app poses questions and polls responses based on an average of 100,000 daily users. “I go with Trump, based on what we see.” Breitbart showed evidence of Reuters “ back rigging” the polls in Georgia to indicate a Clinton victory. Speaking exclusively to Breitbart News, political polling pioneer Pat Caddell said the Reuters news service was guilty of an unprecedented act of professional malpractice…”This comes as close as I have ever seen to cooking the results ,” said the legendary pollster and political consultant. “I suppose you can get away with it in polling because there are no laws. But, if this was accounting, they would put them in jail.” … “The looks to me, are far as I can indicate, they have merely decided to go back and revise their numbers in a formula that removes voters or allocates them–I am not sure how they are doing this–proportionately,” he said. Reuters has rejiggered its methods in order to get the results they want, said the man , whose out-of-the-box interpretations of the American electorate were the brain-work behind the insurgent presidential campaigns of Sen. George McGovern (D.-S.D.) in 1972, Georgia Gov. James E. “Jimmy” Carter in 1976, President Carter 1980 and Sen. Gary Hart (D.-Colo.) in 1984 . Millenium Report concurs about the poll-rigging. In view of so much fake poll data that is systematically dumped into the public domain by the MSM, the American people being gradually conditioned to believe that Clinton is really ahead in this race. With each passing week the Clinton numbers increase by 5 or 10% which should put her with 175% of the populace by now. Yes, there contrivance of poll numbers is that ridiculous. 2016 Election Being Rigged By The Hour, Polls Fraudulent, Clinton Popularity Grossly Exaggerated These same fraudulent tactics were utilized during the democratic primary with much success. Bernie Sanders’ loss was the direct result os so much fixing and rigging, manipulating and scheming. That Sanders himself permitted all the fraud is the biggest scandal of all, particularly after he heartily endorsed Comrade Clinton for president. Such a transparent betrayal of his once loyal will most assuredly push many voters over to Trump. But here’s the real conspiracy. I think there is a Clinton-based conspiracy to cast doubt on everything coming out of the opposition, which in turn reinforces everything coming from them. First of all, vet your sources. Here’s how. When you see an article from a source you don’t recognize, go over to Alexa.com and paste in the homepage address. You’ll see a chart that shows you how long the website has been around, and below that will be the global and national ranking of the site. This isn’t conclusive, of course. There are legitimate new websites popping up all the time, but I have to think that some of these more outrageous, allegedly “conservative” websites could be new websites started by those who want Hillary Clinton to be in office. These sites can perpetrate all sorts of wild rumors and fake documents and this has a two-fold effect. Most importantly, these types of stories cast doubt on the real leaks that are out there. What better way to discredit the massive information being provided by Wikileaks than to mix in a bunch of fake leaks? People without critical thinking skills will extrapolate from this: “This leak is fake, so all the leaks must be fake. Holy cow, they’re lying about our Queen Hillary.” Secondly, crazy rumors being spread through conservative and libertarian sources make us all look…well, crazy. If we are dispensing inaccurate information from questionable sources, then everything we say becomes subject to more doubt. The Gateway Pundit shows an actuarial review that determined Trump could possibly be looking at a landslide victory. With all the liberal distortions and dishonesty we decided to have a small team of actuarial and statistics professionals take a look at a couple of the recent polls to get their take on the reliability of these polls. They selected the recent FOX poll from October 14 showing Hillary up by 7 and the WSJ/NBC poll from October 16 showing Hillary with an 11 point lead. The first observation is that both polls are heavily skewed towards Democrats. At a high level, the FOX poll consists of 43 Dems to 36 Reps to 21 Other while the NBC poll shows 44 Dems to 37 Reps to 19 Other. By selecting more Dems the polls are designed to provide a Dem result. Our experts next analyzed the data and calculated results using the same data from the two surveys on a split of 40 Dems, 40 Reps and 20 Other. The results show that using either sets of data Trump comes out ahead with a larger margin of victory using the FOX data. Clearly the polls using data that is heavily weighted towards Democrat voters is incorrectly skewed. … it is difficult to determine what the independent voters will do but many independent voters partook in the primaries to vote for Trump. Therefore it is more likely that Independent voters vote for Trump as well. If more Democratic voters vote for Trump than Republicans vote for Hillary and more Independents vote for Trump than Hillary, both scenarios which are highly likely, then the results of the general election will likely be a Trump landslide . It’s easy to see how this supports the possibility of a stolen election. Remember during the debate when Donald Trump refused to say that he would accept the outcome of the election if it wasn’t in his favor? Not only has Camp Clinton been caught more than once rigging the election, they’re redoubling their efforts in social perception. Here are a few ways they’re doing it: The discrediting of websites who are open about their dislike of Hillary Clinton. The fake polls that assure everyone that Clinton’s victory is guaranteed. The manipulation of public opinion through false reporting in the MSM. Potentially putting up websites with fake conservative names in order to spread misinformation in the hopes that other conservative websites will make the posts go viral, then “disproving” the rumor they started themselves. Coincidentally (or not), I’ve spent hundreds of dollars over the past few weeks because my websites have been hacked. I’d love to know if any other alternative media sites are having these issues. If you have information on this, drop me a quick private message on Facebook. Submit your review'"}, "time": 1742561821.0683506}