{"duration": 0.16817760467529297, "input_args": {"text": "'Joseph Sohm / Shutterstock.com \\nAccording to the mainstream media, in a recent speech in West Palm Beach, Donald Trump finally completely lost it. Sawing the air with his tiny hands in a unmistakeably Hitlerian manner, he spat out a series of undeniably hateful anti-Semitic code words … like “political establishment,” “global elites” and, yes, “international banks.” He even went so far as to claim that “corporations” and their (ahem) “lobbyists” have millions of dollars at stake in this election, and are trying to pass the TTP, not to benefit the American people, but simply to enrich themselves. He then went on to accuse the media of collaborating with “the Clinton machine,” presumably to benefit these “global elites” and “international banks” and “lobbyists.” \\nNow, a lot of folks didn’t immediately recognize the secret meanings of these fascistic code words, and so mistakenly assumed that “global elites” referred to the transnational capitalist ruling classes, and that “lobbyists” referred to actual lobbyists, and that “banks” meant … well … you know, banks. As it turned out, this was completely wrong. None of these words actually meant what they meant, not in anti-Semitic CodeSpeak. So the mainstream media translated for us. “Political establishment” meant “the Jews.” “Global elites” also meant “the Jews.” “Banks” meant “Jews.” “Lobbyists” meant “Jews.” Even “corporate media,” meant “Jews.” Apparently, Trump’s entire speech was a series of secret dog-whistle signals to his legions of neo-Nazi goons, who, immediately following Clinton’s victory, are going to storm out of their hidey holes, frontally attack the US military, overthrow the US government, and, yes, you guessed it … “kill the Jews.” \\nOK, maybe I’m exaggerating the mainstream media’s reaction just a little bit. Or maybe Trump’s speech really was that fascistic. Judge for yourself. Read the transcript. ( NPR offers a complete version of it here. ) Then compare the reactions of The Wall Street Journal , The New York Times , Washington Post , The Inquirer , The Guardian , and other leading broadsheets, and magazines and blogs like Mother Jones , Forward , Slate , Salon , Vox , Alternet , and a host of others, most of which rely on Jonathan Greenblatt, CEO of the Anti-Defamation League and former Special Assistant to the President, as their authoritative source on Trumpian cryptology. (Mr. Greenblatt, incidentally, should know better, given the treatment he has received from hard-line Zionist publications for refusing to demonize Black Lives Matter, and for “taking sides against” the State of Israel.) \\nLook, I’m not defending Donald Trump, who I consider a self-aggrandizing idiot and a soulless huckster of the lowest order, and whose supporters include a lot of real anti-Semites, and racists, and misogynists, and other such creeps. I’m simply trying to point out how the corporate media have, for months, been playing the same hysterical tune like an enormous Goebbelsian keyboard instrument, and how millions of Americans are singing along (as they were before the invasion of Iraq, which posed no threat to the USA , but which according to the media had WMDs), and how terribly fucking disturbing that is. In case you didn’t instantly recognize it, the name of the tune is “This guy is Hitler!” and it isn’t the short vulgarian fingers of Donald Trump that are tickling the ivories. And no, it isn’t “the Jews” either. It’s the corporate media, and the corporations that own them, and the rest of the global capitalist ruling classes … in other words, those “global elites.” \\nThe thing I find particularly disturbing is how these rather mundane observations — i.e., (a) that a global ruling class exists, (b) that it’s primarily corporate in character, (c) that this class is pursuing its interests and not the interests of sovereign states — how such observations are being stigmatized as the ravings of unhinged anti-Semites. This stigmatization is not limited to Trumpists. Anyone to the left of Clinton is now, apparently, an anti-Semite. For example, Roger Cohen, in The New York Times , riding the tsunami of condemnation of the insidious verbiage of Trump’s West Palm speech, executed an extended smear-job on Jeremy Corbyn and his “Corbynistas” (they’re fond of coining these epithets, the media), denouncing their virulent “anti-Americanism,” “anti-Capitalism,” “anti-globalism,” and “anti-Semitic anti-Zionism.” \\nWhich, let me hasten to add, and stress, and underscore, and repeatedly emphasize, is not to imply that the Labour Party, or the British Left, or the American Left, or any other Left, is anti-Semitism-free. Of course not. There are anti-Semites everywhere. That isn’t the point. Or it isn’t my point. \\nMy point is that this stigmatization campaign is part of a much larger ideological project, one that has little to do with Trump, or Jeremy Corbyn, or their respective parties. Smearing one’s political opponents is nothing new, of course, it’s as old as the hills. But what we’re witnessing is more than smears. As I proposed in these pages back in July , political dissent is being gradually pathologized (i.e., stigmatized as aberrant or “abnormal” behavior, as opposed to a position meriting discussion). Consider the abnormalization of Sanders, back when he was talking about “banks,” “global elites,” and other things that matter, or the media’s portrayal of British voters as racists in the wake of the Brexit referendum. And, yes, the charges being leveled against Trump, much as we might despise the man. Anti-Semitism, inciting violence, paranoid conspiracy theorizing, insurrection, treason, et cetera — these are not legitimate arguments one needs to counter with superior arguments; they are symptoms of deviations from a norm, signs of criminality or pathology, which is increasingly how the corporate ruling classes are dismissing anyone who attempts to challenge them. \\nA line is being drawn in the ideological sand. On one side of it are the decent people, the normal people, in their business wear, with their university degrees, and prescriptions, and debts. On the other side are … well, the deplorables, the ignorant, racist, anti-Semitic, neo-nationalist, populist extremists. This line cuts through both the Left and the Right … supersedes both Left and Right, making bedfellows of supposed adversaries like Obama, Clinton, Kagan, Wolfowitz, Scowcroft, and their ilk on the Normal team, and a motley crew of Trumpists, Putinists, European populists, Corbynistas, Sandernistas, socialists, anarchists, Wikileakers, anti-Zionists, anti-capitalists, neo-Nazis, Black Lives Matterers, angry Greek pensioners, environmental activists, religious zealots, the Klu Klux Klan, David Graeber, most of the contributors to CounterPunch, and various other “extremist” types, many of whom detest each other, in the Deplorables’ current starting line-up. \\nThe corporate media is sending a message … a message aimed at a much broader audience than undecided American voters (assuming such creatures really exist). The message is, “get with the fucking program, or get stigmatized as an anti-Semite, or a racist, or a Russian spy, or whatever.” The message is, “drop the populist rhetoric, shut the hell up about the Wall Street banks, and the corporations, and the ‘one percent,’ and … actually … forget about politics completely, except for identity politics, of course. Go ahead and knock yourself out with that.” The message is, “you’re either with us or against us … and it doesn’t matter why you’re against us, or what it is you think you’re for. Right, Left … who gives a shit? It’s one big Basket of Deplorables to us.” \\nThis message, of course, displays many of the hallmarks of the classic authoritarian mentality, the need for nearly total conformity, mindless allegiance to one’s so-called superiors, delegitimization of all opposing viewpoints, and the infantile type of hero-worship figures like Obama and Clinton inspire … not the old-fashioned authoritarianism that would-be despots like Trump represent, but, rather, a more attractive version, a hopey, changey, lovey version, where there are no frightening Hitlerian leaders barking out anti-Semitic code words, and no one is exterminating thousands of people in faraway countries they want to destabilize in order to entirely dominate the region. No, this is the version where Obama sells the TPP on the Jimmy Fallon show, and wars of aggression are not wars of aggression, but “humanitarian interventions.” It’s also the version where universal healthcare is, regrettably, “unrealistic,” but $38 billion for the State of Israel so it can operate its Apartheid State, and weapons sales to Saudi Arabia, so they can bomb the shit out of farmers in Yemen, and cut off people’s heads for blasphemy, is somehow in “America’s vital interests.” \\nBut what do I know? I’m just a satirist. I should probably leave all this complex stuff, like what is and isn’t in my interest, and what words really mean and all that, to the experts in the mainstream media. Since they did so well decoding Trump’s speech, maybe they could translate some of these other code words I’ve been having trouble with, like the ones I put in scare quotes above, or other such code words, like “enemy combatant,” “free trade agreement,” “security barrier,” “indefinite detention,” “targeted killing,” or “troubled asset relief program.” \\nI could go on, but I probably shouldn’t. Odds are, I’m already on the list of Putin-worshiping, anti-Semitic, racist, misogynist, neo-nationalist, non-standing up for the National Anthem, conspiracy theorizing America-haters. The last thing I need to do at this point is start jabbering about how the United States is an authoritarian corporatist dystopia ruled by a global capitalist elite that couldn’t give less of a shit about Americans (or any other actual people living in any other actual countries), where the corporate media can whip up mass fanatical support for wars of aggression, or corporate puppets, by pointing their fingers at yet another bogeyman and shouting “Hitler” at the top of their lungs. Next thing you know I’d be writing about “banks,” and “global corporations,” and “national sovereignty,” and we all know what that’s about, don’t we? \\nC. J. Hopkins is an award-winning American playwright and satirist based in Berlin. His plays are published by Bloomsbury Publishing (UK) and Broadway Play Publishing (US). He can reached at his website, cjhopkins.com, or at consentfactory.org. (Reprinted from Counterpunch by permission of author or representative)'"}, "time": 1742564612.7917652}