{"duration": 0.18134450912475586, "input_args": {"text": "'At the steering wheel my father consults his large paper map, turning it this way and that, squinting at the small blue lines that squiggle through tiny Maine coastal towns. He’s heard that the author E. B. White’s house is somewhere around here, and he’s determined to find it. My mother, next to him in the passenger seat of our rusty gold station wagon with my baby sister on her lap, raises her eyebrows at my other two sisters and me,   in the second row. It’s the early 70s, and seatbelts haven’t caught on yet. We gaze back at her, knowing that once Dad gets an idea into his head, it’s almost impossible to stop him. We range in age from 1 to 10 (I’m the oldest) and all of us are literally and figuratively along for the ride. Besides, we’re excited at the prospect of meeting this author we already feel we know. We’ve been lulled to sleep every night by the soft cadence of my dad’s Southern accent as he reads us stories about a wise spider and a hapless pig, a resourceful mouse and a mute swan. Dad pulls off the road into the dusty parking lot of a country store with a lone gas pump, and gets out of the car. We hear him chatting with the attendant through the open window. “Sure is nice around here. ” The guy shrugs. My sisters and I glance at each other. Rural Mainers tend to be   and   averse. But as usual, Dad doesn’t seem to notice. “You lived here long?” “Ayuh. ” Amazingly, before long, and with only a little coaxing, the attendant is telling Dad about his grandkids and his lobster boat and pointing off into the distance, giving him the intel he’s come for. “Mr. White lives right over that hill there. Privet hedge in front. Can’t miss it. ” Back on the road, my sister Cynthia ventures, “Isn’t it rude to show up on someone’s doorstep without asking?” Dad grins and winks at us in the rearview mirror. “He’ll be flattered. ” We pull up to the farmhouse to find a courtly   man trimming the hedge with a set of clippers. “It’s him!” Dad whispers. He rolls down his window and leans out. “Hello, good sir!” The man seems a little nonplused. “I have a car full of young readers here who’d give anything to meet their favorite author. A word from you, and they’ll remember this moment for the rest of their lives. ” What choice does the poor man have? Within a few minutes, the famously reclusive E. B. White is demonstrating to a cluster of little girls in bathing suits that when you crush pine needles between your fingers and hold it to your nose, the smell is as strong as patchouli. And Dad is right  —   we never will forget it. My childhood was rife with moments like this. Dad was always going out on a limb, befriending people who didn’t necessarily seem to want new friends, trespassing on private property, pushing the boundaries of acceptable behavior in quest of adventure. His philosophy was that you don’t need money or plans, only a willingness to be present in the moment and to go where inspiration takes you. If you don’t, you’ll miss the entire point of being alive. Raised dirt poor in rural Georgia by a millworker mother and a father who often went to the bar rather than home after work, Dad learned early on that his quickest route up the social ladder was through charm and smarts. He got himself to college  —   the first in his family  —   on a football scholarship, then used seminary to springboard to a doctorate in a foreign land. As a young academic in the ‘60s, he grew to reject traditional values and had scant respect for the social codes of privilege. At parties, he could often be found talking to the bartender or a    Irish grandmother in the kitchen rather than the hosts. A Southerner through and through, even after moving to Maine, he was constitutionally incapable of walking down a street in New York without stopping to chat with doormen, bodega owners and homeless people. He never met a taxi driver whose story he didn’t want to know. Dad’s unorthodox and sometimes embarrassing friendliness got him, and us, into trouble now and then. Some people didn’t take kindly to probing questions. Others found his   openness suspect or unsophisticated. But his innate, bottomless curiosity about the world also taught his four daughters to be open to new experiences and comfortable with improvisation. Even now, in his late 70s, he lives each day with a kind of purposeful recklessness, asking provocative questions and seeking new experiences in the belief that he can break through to something better, more meaningful, more satisfying. Though my parents had little money, they took us on adventures all over the world. Driving through Scotland in a rainstorm, we pulled over to the side of the road and rode the wild ponies grazing by the fence. We coaxed a stray lamb over to our rented R. V. to feed it. One year my father switched houses, cars, teaching jobs, committees and pets with a professor in Melbourne, Australia, sight unseen. Another year our family of six flew to Crete without a plan at the airport Dad bought a map and started asking random strangers, with the help of a woefully inadequate Greek phrase book: “What should we do?” “Where should we stay?” This spontaneity meant that we missed flights, lost luggage, drove on perilous roads late at night, stayed in some   hovels, and sometimes went hungry. But it also yielded beautiful surprises: an undiscovered beach, a fisherman’s hut with a breathtaking view, a hillside breakfast of goats’ milk yogurt and fresh honey that I still remember 35 years later. It led to his daughters’ sense of the world not as a huge frightening place but as a wonderland ripe for discovery. The Maine farmhouse in Andrew Wyeth’s iconic painting “Christina’s World” was not yet a museum or even open to the public when my father got it into his head  —   soon after our ambush of E. B. White  —   to take a family field trip there. Following his usual routine, he pulled into the small village of Cushing and asked a local how to find the Olson house. When we arrived (no doubt trespassing) we picnicked in the field where the woman in the pink dress in the painting had lain. Looking up at that weathered gray house on the hill, and hearing the story of the woman with my name who spent her lifetime there, I was entranced. Years later, I drew on that experience to tell my own story of the painting in my new book. There’s no doubt that my dad’s endless curiosity has shaped who I am. I often find myself  —   to my own kids’ embarrassment  —   chatting with strangers in lines, accepting spontaneous invitations, and seeking     adventures. I think the most important thing I learned from my dad is that when you go out on a limb there’s a risk it will break, but you’ll get a whole new perspective on the world. And if you’re really lucky, it can feel like flying.'"}, "time": 1742562787.6366491}