{"duration": 0.04765152931213379, "input_args": {"text": "'BNI Store Nov 6 2016 GERMANY: Bigger than the Berlin Wall, the 12-foot-high ‘Munich Wall’ is being constructed to protect local residents from illegal alien Muslim invaders Locals campaigned for the wall, in the suburb of Neuperlach Süd, after authorities decided that some 160 young (up to age 40) unaccompanied Muslim illegals will move into a large shelter which is less than 100 metres from a residential estate. UK Daily Mail Critics say the wall is further proof of the alienation voters feel with Chancellor Angela Merkel’s refugee policy. Deputy District Chairman Guido Bucholtz, said: ‘I was frightened when I saw this monster of a wall.’ (Not as frightened as Germans are of the Muslim invaders) He added that he thinks the wall is too high as another similar structure designed to fence off a migrant camp was just three metres high. He said: ‘This whole propaganda really sucks.’ (Yeah, I guess you don’t like it when people find out you’ve been lying to them) However residents from the neighbouring housing development from the asylum centre went to court to get the wall built. One of their arguments for the wall was the fear that the value of their homes would plummet if there was nothing to separate them from the refugees who could be there for years to come. Local residents said they are fearful of the ‘noise and behaviour’ of the Muslim thugs. The judge of the Administrative Court in Munich confirmed the wall in a judgment – noted that the migrants should not use if for ‘ball throwing games’ or other ‘leisure use’. The fact that it is higher than the Berlin Wall of the Cold War is not lost on locals and officials. But engineers said it had to be that high to provide an effective sound insulation. The wall is nearly finished. Locals say they do not care about how it looks; only that it will separate them from the unaccompanied Muslim freeloaders, rapists and jihadists who have often been at the centre of friction with locals in other German towns.'"}, "time": 1742562313.0552201}