{"duration": 0.029581546783447266, "input_args": {"text": "'Posted on October 28, 2016 by Baxter Dmitry in News , US // 2 Comments \\nGoldman Sachs CEO Lloyd Blankfein has broken his silence and endorsed Hillary Clinton as Wall Street’s preferred candidate. \\nIn an interview with CNN’s Fareed Zacharia, Blankfein said that although he had previously declared he would not endorse a candidate, the situation is now critical and Hillary Clinton must be elected. \\n“ I certainly, yes, I do — yes, so flat out, yes, I do ,” Blankfein said when asked whether he supports and admires Clinton. \\nAs was revealed by Wikileaks, Hillary Clinton spent the run up to her presidential campaign giving speeches to Goldman Sachs and other Wall Street banks, where she praised their talents and explained her real position on financial regulation. \\nIn essence, Hillary told the banksters she would let them set their own rules and regulations because “ the people that know the industry better than anybody are the people who work in the industry. “ \\nHillary Clinton has taken a tough public position on Wall Street during the campaign, likely due to Senator Bernie Sanders’ success in the primaries. But you can completely dismiss anything she has said in public. Wikileaks also revealed that Clinton admitted to the National Multi-housing Council in a private speech that “ you need both a public and a private position. ” \\nHillary Clinton’s private position has been exposed. She is the Wall Street candidate promising them the ability to set their own rules. Now, unsurprisingly, they have endorsed her. \\nOn October 24, 2013, Clinton told Goldman Sachs that Dodd-Frank had to be done mostly for “ political reasons ” because Congress needed to “ look like ” it was doing something about the crisis. \\nBehind closed doors, she assured the bankers she was on their side, saying,“ There’s nothing magic about regulations, too much is bad, too little is bad. How do you get to the golden key, how do we figure out what works? And the people that know the industry better than anybody are the people who work in the industry. ” \\nMusic to Wall Street’s ears \\n“ I mean, right now, there are so many places in our country where the banks are not doing what they need to do because they’re scared of regulations, they’re scared of the other shoe dropping, they’re just plain scared, so credit is not flowing the way it needs to to restart economic growth, ” Clinton said. “ So people are, you know, a little — they’re still uncertain, and they’re uncertain both because they don’t know what might come next in terms of regulations, but they’re also uncertain because of changes in a global economy that we’re only beginning to take hold of. ” \\nFor Goldman Sachs and the other big banks, was there really any other choice this cycle? After all, they did pay Hillary Clinton $675,000 for those three speeches, and have generously supported her political career. \\nConsidering the pay-for-play environment in the Clinton world, the real question is: what do Blankfein and Goldman Sachs want in return and what is Clinton’s private position on giving it to them?'"}, "time": 1742628568.5469265}