{"duration": 0.06998825073242188, "input_args": {"text": "'PARIS  —   The ability of an   Iranian director to attend the Academy Awards ceremony next month has been thrown into question by President Trump’s order temporarily banning citizens of seven predominantly Muslim countries from entering the United States. The director, Asghar Farhadi, whose film “The Salesman” is nominated in the best   film category, was not immediately available for comment. But early Saturday, Trita Parsi, director of the National Iranian American Council, based in Washington, said in a Twitter post: “Confirmed: Iran’s Asghar Farhadi won’t be let into the US to attend Oscar’s. He’s nominated for best   film. .. #MuslimBan” In a telephone interview hours later, Mr. Parsi said he had heard only second hand that Mr. Farhadi would not attend the ceremony on Feb. 26. Mr. Parsi said his intention with the message posted on Twitter was to show that under the new immigration policy announced on Friday, no Iranians would be allowed entry into the United States for 90 days. “The clarification of the law made it very clear that he can’t come, whether a green card holder or an Iranian citizen,” Mr. Parsi said of Mr. Farhadi, whose film “A Separation” won an Oscar for best   film in 2012. Mr. Parsi added that he had not meant to imply that the United States government had requested that Mr. Farhadi not come to the Oscars ceremony, but to call attention to the ban itself. “It is so stunning and shocking  —   so profoundly    —   that people have a hard time wrapping their heads around it,” Mr. Parsi said. It was unclear whether Mr. Farhadi would request an exemption to the visa ban or be granted one by the United States government. Earlier this week, one of the stars of “The Salesman,” Taraneh Alidoosti, said in a message on Twitter that she would boycott the Oscars to protest the visa ban, which she called “racist. ” The ban was not policy at the time. “I decided not to go even if I could, because it hurts me deeply to see ordinary people of my country being rejected for what might be their legal right to have access to their children abroad or to their school classes as students,” Ms. Alidoosti told The New York Times in an interview. The government of Iran approved the “The Salesman” for submission to the Academy Awards it is one of five films vying for best   film. The film tells the story of a couple in Tehran whose lives are upended when they move from one apartment to another while they are acting in an amateur production of “Death of a Salesman,” a play by Arthur Miller. In a statement, the Academy of Motion Picture Arts and Sciences said it was “extremely troubling” that Mr. Farhadi and the cast and crew of “The Salesman,” could be “barred from entering the country because of their religion or country of origin. ” The Academy gives an allotment of tickets to distributors and representatives of all nominated films, who are responsible for securing visas when necessary. The proposed ban has affected those connected to other films. The Iraqi director Hussein Hassan withdrew his visa application to the United States, where he was expected to attend the United States premiere of his film “Reseba  —   The Dark Wind” at the Miami Film Festival, Variety reported.'"}, "time": 1742564049.189011}