{"duration": 0.5018680095672607, "input_args": {"text": "'We Are Change \\nActivist and alleged Anonymous hacker Martin Gottesfeld who has been accused of orchestrating an attack on the Boston Children’s Hospital pleaded “not guilty” to charges of conspiracy and intent to cause damage to protected computers.\\n\\nAfter he was arraigned, Gottesfeld, who has been on a hunger strike for a month, rose from his chair and fainted in the courtroom.\\nGottesfeld, 32, is a human rights advocate and Senior Systems Engineer who was born and raised in Andover, Massachusetts. He is being prosecuted under the Computer Fraud and Abuse Act (CFAA) by Carmen Ortiz’s office . The same people who caused the death of Internet reddit founder pioneer and activist Aaron Swartz. \\nIf convicted,Gottesfeld could face up to twenty-five years in prison and $380,000 in restitution to the tormentors of Justina Pelletier, the patient he was initially fighting to protect. His attorneys are mounting a vigorous defense on his behalf, and need your help.\\nThe CFAA has been cited by digital rights group EFF as being overly broad and so that, “Creative prosecutors have taken advantage of this confusion to bring criminal charges that aren’t really about hacking a computer, but instead target other behavior prosecutors dislike… Compounding this problem is the CFAA’s disproportionately harsh penalty scheme . Even first-time offenses for accessing a protected computer without sufficient “authorization” can be punishable by up to five years in prison each (ten years for repeat offenses), plus fines. Violations of other parts of the CFAA are punishable by up to ten years, 20 years, and even life in prison.” The ACLU agrees and filed suit that it violates everyone’s first amendment rights.\\n“Marty has dedicated years of his life to fighting for the human rights of institutionalized children. He would often spend 8 hours at his job, come home, and spend another 8 hours campaigning against child abuse. He never profited from his activism,” according to a statement on FreeMartyG.org. \\nThe statement goes on to say:\\n“In 2013, Marty began a campaign against troubled teen industry institution Logan River Academy. Dozens of survivors left heartwrenching petition comments and some created videos.\\nMarty’s story first hit main stream media after he and his wife experienced trouble with their boat and were rescued by a Disney Cruise Ship . Since the FBI left out Justina’s name and her suffering from its complaint against him, many outlets merely printed that he allegedly ‘cyber-attacked’ a hospital.\\nMarty’s family and friends have launched the #FreeMartyG campaign to set the record straight and call on the public to show their support for him.”\\nJustina Pelletier was tortured by the Boston Children’s Hospital and denied treatment for her mitochondrial disease and her medication, according to former BCH employees. Gottesfeld came to her aide in the form of cyber attacks on the hospitals website for awareness of the case.\\nGottesfeld has said he will continue his hunger strike until the presidential candidates pledge to protect institutionalized children from abuse . He also said that he wants overzealous federal prosecutors to halt “political prosecutions” of people accused of crimes he considers harmless.\\nGottesfeld also argues that he did not harm patients or expose any private information, so he did not break the CFAA and commit a crime.\\nWho is Justina Pelletier? That question is answered again by the statement on FreeMartyG.org :\\n“Justina Pelletier was 14 years old when she arrived at Boston Children’s Hospital E.R. with her mother. Both she and her older sister had been diagnosed with mitochondrial disease, a condition that is often genetic and runs in families. However, doctors at Boston Children’s Hospital felt her symptoms had psychological causes, and just 4 days after meeting her, wanted to stop successful mitochondrial disease treatments prescribed since 2011.\\nFearful for her life, Justina’s parents refused to consent to such a radical departure from her well established treatment plan. They tried to discharge their daughter and bring her to previously scheduled appointments with her mitochondrial disease team.\\nWhat followed was any family’s nightmare. Unwilling to take “no” for an answer, Boston Children’s Hospital urged state officials to take custody of Justina and enforce their new treatment plan. This kind of thing happens more often than you might think. In fact, Boston Children’s Hospital even has a name for it. They call it a “parentectomy” (see the Wray and T. cases, as well as this open letter from a former federal prosecutor.) \\nPelletier’s abuse did not end at the Boston Children’s Hospital. It expanded to a DCF facility in Framingham, Massachusetts when she was transferred to a troubled teen industry facility, Wayside Youth and Family. Her contact with her family was severely limited , it was only after she took to smuggling notes hidden in her art projects describing her suffering that her family figured out.\\nJennifer Pelletier describes her little sister’s abuse in the video below, she goes on to say how a worker at DCF harassed her sister in the shower :\\n“It’s disgusting to harm a human being it’s in humane and these actions that they’ve done to my sister what they’ve been harming her for almost 15 months now all of them should be held accountable and they should almost be treated the same way that my sister has been treated to see how hurtful it’s been they should be all plucked out of their lives and told that people don’t believe in them and have them doubt their own. I don’t get how anybody can treat somebody so in humane this needs to end now and Justina needs to be home before May 24th on her 16th birthday and this needs to end now.”\\nhttps://www.youtube.com/watch?v=hBgds6xVMBc\\nThe case gained international attention and even congress’s attention when the hashtag “#FreeJustina” trended on Twitter. Jim Lyons spoke out on the floor of the House expressing his disdain for the case and presenting an amendment. Jim went on to say that Justina’s parents didn’t neglect their daughter and were innocent. He went on to say that “what we have here is the Department of Children and Family interfering with constitutionally protected parental rights to make medical decisions on behalf of their children.”\\nJustina Pelletier was eventually allowed to return home. She still hasn’t recovered from the torture though. She and her family have sued Boston Children’s Hospital and four of its doctors for gross negligence and civil rights violations. When the lawsuit was filed, Justina was quoted saying, “It was awful. Just imagine being a psych ward without needing to be in a psych ward.” \\nNow it’s time to bring Marty Gottesfeld home. He fought for Justina Pelletier and others in the troubled teen industry of private “treatment” centers for years, including fighting to expose Logan River if you can consider donating to my good friends at @FreeAnons to help Marty’s defense fund. Marty has written a book called “Parentectomy” if you wish to read that book and further your knowledge about the troubled teen industry of private treatment centers you can do purchase it on Amazon and support him or here for free in pdf format . You can also listen to Marty answer several questions about his case, his treatment in prison, his hunger strike and his actions in the YouTube playlist below.\\nIt shouldn’t be a crime to expose institutional child abuse even a congressional hearing has acknowledged the abuse below in which parents and survivors testified about the abuse that goes on in these privatized centers. Even the U.S. Government Accountability Office investigated the industry in 2007 and again in 2008 finding these centers abusive. Urge your representatives to pass legislation to curb the worst abuses and demand that places that have multiple notable claims of abuse are investigated and in severe cases shutdown.\\n#FreeMartyG #ShutDownLoganRiver\\n\\nMAIL MARTY A LETTER LET HIM KNOW HE’S NOT ALONE IN THIS FIGHT! \\nMarty Gottesfeld, Inmate #12982104\\nDonald D. Wyatt Detention Facility\\n950 High St.\\nCentral Falls, RI 02863 The post Anonymous Hacker Fighting For Justina Pelletier Pleads ‘Not Guilty’ In Children’s Hospital DDoS Attack appeared first on We Are Change .\\n'"}, "time": 1742563277.3779757}