{"duration": 0.19644570350646973, "input_args": {"text": "'Dr. Sebastian Gorka, former Breitbart News National Security editor and current deputy assistant to President Trump, discussed Syria policy on Wednesday’s edition of Breitbart News Daily. [SiriusXM host Alex Marlow suggested there were too many conflicting statements coming from various Trump administration officials about Syria, but Gorka insisted “we have absolute clarity. ”  “You just have to listen to the president, the  ” he advised. “He has been explicit, and nothing has changed from November the 8th to today. ” “We sent a very clear message concerning the use of weapons of mass destruction against women and children, but the president has said we have no interest in invading other people’s countries and occupying them. This isn’t the Bush administration of 2003, nor is it the first Gulf War of 1991. These things are very, very clear,” Gorka asserted. Marlow countered by playing a clip of Secretary of State Rex Tillerson seeming to endorse regime change in Syria. “I think it’s clear to all of us that the reign of the Assad family is coming to an end,” Tillerson declared. Gorka said it was “not a binary proposition” to call for regime change without also committing the United States to a military intervention. “Nothing that Secretary Tillerson said has anything to do with an invasion or forced removal of Assad. Nothing,” he said. “Everybody’s on the same sheet of music, whether it’s the Secretary of State, whether it’s Secretary Mattis, whether it’s General McMaster the National Security Adviser. They all follow the lead of the   . ”  “There’s more than one way  —   there are dozens of different ways that one individual can step down from power. He doesn’t have to be removed,” Gorka argued. “That’s why the action we took last Thursday was so seminal. We sent a message to the sponsors of this regime. ” “Remember this is a satrapy, it’s a client state of other nations,” he explained. “The message we sent is, there is a point at which an individual like Assad, when he does things as heinous as using chemical weapons against unarmed women and children, the   analysis for his sponsors  —   Moscow included  —   has to be reassessed. ”  “When that is reassessed, if he loses the sponsorship of places like the Kremlin, it becomes much easier for him to be forced out of office politically, not by force, because he simply loses the confidence of his supporters and also the people around him. Remember, Alex, Assad is just one man. He doesn’t have to be removed through force. He can be removed politically. We went a great distance towards that political resolution by the actions we took last week,” said Gorka. Marlow noted that much of President Trump’s voting base was “not expecting him to proactively get involved in foreign entanglements that did not directly impact the national security of America. ” “Number One, this did impact our national security directly,” Gorka responded. “Whether you live in San Bernardino, Boston, or whether you live anywhere else in the United States, the idea that you have the free use of chemical weapons in a war zone  —   where ISIS, our primary threat, is recruiting, is functioning, can access those weapons  —   that is a primary threat to the United States. ” “Secondly, this isn’t a ‘foreign entanglement’ in the way that our Founding Fathers described it,” he continued. “I say to your listeners, and this is a very important question  —   I understand the concerns, but really the people who voted for the president should not be concerned. ”  “Just compare the difference between two things: the invasion of 150, 160 thousand soldiers and Marines into a given theater, whether it’s Gulf I, whether it’s 2003  —   compare that please to the launching of 59 vehicles from the Med, from a ship in absolute safety, targeting one airfield used to launch those weapons,” he urged. “These two things are incomparable, and let’s have a little bit of sophistication in our analysis. One does not lead to the other. ” Marlow mentioned fears that even if American military actions remain as limited and   as Gorka described, there was still a danger we could be pressed into service as “the world’s policeman,” with an enormous number of atrocities around the world demanding our attention. “There is no intent, no desire, no endgame that involves us being a global police officer. Absolutely not,” Gorka replied. “With regard to the awful things that happen in mass numbers every day around the world, we have a different perspective,” he continued. “It’s not the last eight years, when the Obama administration looked at the world as it would like it to be, as opposed to how it is. This president is a pragmatist. You don’t get to be the most successful real estate mogul in New York, the toughest market in America, for 40 years unless you are a pragmatist. ” “We are interested in the overlap between moral imperative and national security. Strategy is exactly like politics: it is the art of the possible. We take action not because there is a global interest we take action because there is a national security interest, which sometimes may overlap with the global interest with regard to human rights or the use of chemical weapons,” Gorka said.  “The primary driving metric for everything the president does, because this is his primary mission, is the safety of the American people. In this case, this has nothing to do with being a globocop. This has to do with ISIS in theater, weapons of mass destruction, and the stability of the Middle East,” he stressed. Marlow said the Trump voting base was also wary of increased tensions with Russia, and was hoping the Russians could prove useful in defeating the Islamic State once and for all. He asked if the increasingly adversarial relationship between Presidents Trump and Putin was a response to “CNN conspiracy theories” about Russian interference in the 2016 election. Gorka responded by emphasizing Trump’s instincts as a pragmatist.  “The statements coming out of Moscow should not be taken at face value. Remember who Putin was. Remember what this regime has done in the last 12 years,” he added. Gorka quoted Trump’s response to a question at a press conference about relations with Russia: “I would like, if possible, to have good relations with Moscow. Right now, it doesn’t really seem like that’s possible. If that’s the case, so be it. ” “We do not make the national security interests of the United States hostage to other people’s opinions and propaganda,” he declared. “As a result, the president will keep his course. ” Marlow brought up White House spokesman Sean Spicer’s   gaffe comparing Syrian dictator Bashar Assad to Adolf Hitler, and said he hoped no one in the White House seriously thought Assad was in a league with Hitler. “Of course not,” Gorka replied. “Let’s close down the conspiracy theories. ” Marlow said it would not be easy to make the Left take that advice, because they are in “total meltdown over this, hysteria mode, even accusing him of Holocaust denial. ” “I’m used to it. This is what we’ve been living with for 12 weeks now: the absolutely   absurd fixation on   short little clips of interviews taken out of context to spin up fake news,” Gorka sighed. “Everybody knows that Sean misspoke, and he stated so,” he continued. “I want to say one thing to my colleague Sean, and everybody I think knows this: outside of the Oval Office, Sean Spicer is a great patriot, a great American, probably has the toughest job in America. If you offered me that job, I wouldn’t take it with a gun to my head. We have to recognize his professionalism. Sometimes you stumble, and he did yesterday, but he’s made up for it. Let’s move on. ” Turning to North Korea, Gorka reiterated his   determination not to “give away the playbook” on strategy, but allowed that there was a “similar dynamic” with North Korea and Syria. “North Korea doesn’t function without sponsorship, and we know who sponsors it,” he elaborated. “We are reasserting American leadership in the world. We’re filling the vacuum created by the last administration everywhere, including in Asia. ”  “I’ll simply put it this way: our actions are a forceful expression of our intent to provide leadership in the world and stability. We have    actors. North Korea is one of them. Our actions send a very clear message to those people that sponsor rogue regimes like North Korea, that they too  —   like Russia with regard to Syria  —   have to reassess their   analysis, and the calculation of how long they should support regimes like North Korea. Because North Korea is a destabilizing factor for all the nations of the region, and is a threat. That’s the message we’re sending,” said Gorka. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742561862.9980178}