{"duration": 0.1054692268371582, "input_args": {"text": "'License DMCA \" If we regard money as a thing, it becomes a given, and we lose our ability to change it in any way. . . . When we understand that money is created by a set of understandings and practices, we can begin examining the terms of these agreements to see whether they actually serve our collective aspirations and objectives. Currencies can be redesigned to better meet our needs.\" Bernard Lietaer In the first article of this series, following Lietaer, we defined money for what it is; an agreement within a community to use something as a medium of exchange. We noted that money is not stuff in the normal sense. Instead, it is numbers in a system of accounting. Sometimes something physical is used to represent the numbers in this accounting system, but it is just that, a symbol, not the money itself. Our current money has no physical representation. We then discussed how money works in its simplest form; a mutual accounting system. We noted that money involves commitments and claims on commitment. Commitments relate to debits, and claims on commitment relate to credits in the accounting system. In this analysis we intentionally did not use the commonly recited functions of money; medium of exchange, unit of account, store of value, and standard of deferred payment. The reason is that the latter two functions replace and obscure the fact that money is the measure of commitment and claims on commitment, which underlie store and standard. In the second article , we discussed the social implications of money, and the concept of capital. We introduced the rights/responsibility equation; how in a democracy, with every right there is a corresponding responsibility, commitments and claims on commitment being an example of the more general concept. We went on to define money capital;money capital is a large claim on commitment, and it relies on the commitment of its users to get this claim; again an example of fact that for every credit, there is a corresponding debit, following the rights/responsibility equation. In the third article , we described our present private-for-profit money system, and noted that in the present system, the rights/responsibility equation is ignored. Money is created by fiat, without acknowledging that the money created represents a commitment on the part of all of its users to the operation and stability of the money issue. The fact that this commitment is not acknowledged gives the managers of the money system great power over its users. They decide what money is to be created for, and what actions it will support. Money is created for its creator\\'s profit. In support of this argument, we disaggregated profit, demonstrating its two functions; providing compensation for time and effort exerted, and an unearned portion that is a private tax on the market. This private tax goes to the owners of the banking system and for profit businesses. - Advertisement - In the fourth article , we discussed alternatives that are currently being considered. We found that Central Government created fiat money has many of the characteristics of private-for-profit money. It is a top down, authority managed form of money that again ignores the commitment of its users to its operation and stability. A second weakness is that it leaves in place the private-for-profit banks as the interface between the users of the money and its creators. Thus the issue of the unearned private tax on its users is not properly dealt with. It is noted that historically, government created money has, over time been corrupted and taken over by the bankers, because of this weakness. In the fifth article we discussed natural and human capital. We noted that natural capital was here before humans came on the scene, and that it was treated as a commons by early man. We noted that the concept of private ownership depends on violence and power, not democratic decision making; that those who promoted private property promoted it to gain power, not to promote democracy. We pointed out that the drive for profit as the primary directive of the present money system is a major motivation for militarism, bullying, and the promotion of fear and anger. This contrasts with the values underlying simple money; to value its users and manage their mutual provisioning. The work of Henry George and Elinor Ostrom was shown to support the concepts of simple money. In this final article of the series we discuss a method for moving from our present money system to the use of simple money. Following the edict that we don\\'t concentrate on what is wrong, but on creating something that serves those of us who use it, and exhibits values that are consistent with what we need and want, we create a new system, and let the old one go its own way, as it doesn\\'t serve our use. - Advertisement - Unlike government issued money, simple money requires no legislation for its introduction; it can be introduced by its users. It will initially not be coin of the realm; useful in payment of taxes, but it will be useful to its users, and will demonstrate this usefulness to them, and those they deal with. Acceptance can be gradual, as approval is gained. It can support alternative businesses and institutions in their development and operation. In time, simple money can be acknowledged as official coin in local jurisdictions, and then larger ones. Open source blockchain accounting systems are the natural form for mutual money to be organized with our present technology. However in setting up democratic blockchain platforms, it is important that all the values built into the simple democratic system are implemented. It is important that systems be limited to a community scale, and that users know who each other are, so trust can be informally as well as formally supported. Structures need to be put into place so that users set limits on positive and negative balances, to prevent abuse. Crowd funding can be structurally facilitated, as well as community funding. Instead of \\'mining\\' for money, money would be created as a commitment to other members of the community. Balances will revolve around zero instead of always being positive to maintain the zero sum game. With these provisions, the money supply is automatically regulated.'"}, "time": 1742564276.2949164}