{"duration": 0.06832671165466309, "input_args": {"text": "'Email \\nDoes Thomas Jefferson hold the key to restoring unity in the Republican Party? Can the Sage of Monticello undo the damage done by the internecine battle between Donald Trump — the GOP\\'s presidential nominee — and the party\\'s Establishment wing? \\nIn an article published on October 27, Business Insider suggested that Jefferson\\'s ability to speak to the commonalities among Americans in his first inaugural address could provide a pattern for Donald Trump to follow to mending the substantial tears in the GOP\\'s big tent should he be elected president. \\nThe election of 1800 — called by Jefferson himself the \"Revolution of 1800\" — was a fractious moment in our electoral history. Owing to the constitutional method of choosing a vice-president (essentially the candidate who came in second became \"second banana\" to the winner), the vote that year ended in a tie. \\nPer the Constitution, the determination of who would succeed John Adams as president would be determined by the House of Representatives. \\nAfter 36 ballots — and political intrigue and arm-twisting worthy of book-length treatments — Thomas Jefferson was elected the third president of the United States of America. \\nJefferson recognized the rift that his unusual path to the presidency had caused among his countrymen. Accordingly, the author of the Declaration of Independence drafted a speech aimed at applying a balm to the infirm body politic. \\nThe text of that historic address is so inspirational and so seemingly clairvoyant that it merits study and review by those who would help heal our own enervated electorate. \\nJefferson soberly spoke to his \"friends and fellow citizens\": Utterly, indeed, should I despair did not the presence of many whom I here see remind me that in the other high authorities provided by our Constitution I shall find resources of wisdom, of virtue, and of zeal on which to rely under all difficulties. To you, then, gentlemen, who are charged with the sovereign functions of legislation, and to those associated with you, I look with encouragement for that guidance and support which may enable us to steer with safety the vessel in which we are all embarked amidst the conflicting elements of a troubled world. \\nHow would Jefferson describe the world of the 21st century, given he thought his own time was \"troubled?\" \\nNext, given the controversy that has arisen over questions of whether Mr. Trump will accept the result of an election he has deemed \"rigged,\" Jefferson\\'s own experience with charges of electoral illegitimacy and his approach to answering them should serve Mr. Trump as an example of how statesmen administer acceptance: During the contest of opinion through which we have passed the animation of discussions and of exertions has sometimes worn an aspect which might impose on strangers unused to think freely and to speak and to write what they think; but this being now decided by the voice of the nation, announced according to the rules of the Constitution, all will, of course, arrange themselves under the will of the law, and unite in common efforts for the common good. All, too, will bear in mind this sacred principle, that though the will of the majority is in all cases to prevail, that will to be rightful must be reasonable; that the minority possess their equal rights, which equal law must protect, and to violate would be oppression. Let us, then, fellow-citizens, unite with one heart and one mind. Let us restore to social intercourse that harmony and affection without which liberty and even life itself are but dreary things. \\nSpecifically addressing himself to the divisions, Jefferson opined that \"every difference of opinion is not a difference of principle.\" He then famously called himself a member of the opposite political party, declaring that all Americans were — in our own parlance — Democrats and Republicans. \\nNext, speaking of the exceptional strength of the structure of the government established under the Constitution, Jefferson identified the rule of law and the American adherence to the same as one of the surest and strongest beams upon which our government is built. \\n\"I believe it [the government of the United States] the only one where every man, at the call of the law, would fly to the standard of the law, and would meet invasions of the public order as his own personal concern.\" \\nIn light of the revelation of Democratic presidential candidate Hillary Clinton\\'s incitement of violence at rallies of Trump supporters, it is particularly prescient that Jefferson would highlight such disregard for the rule of law and conspiratorial attempts to disturb the peace in an effort to negatively impact the vote. \\nThere is in Jefferson\\'s next statement a question that should be put to both major party candidates in light of allegations of criminal misdeeds on the part of each of them. \\nJefferson asked, \"Sometimes it is said that man can not be trusted with the government of himself. Can he, then, be trusted with the government of others?\" \\nIn this statement the former governor of Virginia echoed Hugo Grotius, a man whose writings were of immense influence on the Founding Generation. \\n\"A man cannot govern a nation if he cannot govern a city; he cannot govern a city if he cannot govern a family; he cannot govern a family unless he can govern himself; and he cannot govern himself unless his passions are subject to reason....\" Grotius wrote. \\nWould even the most rock-ribbed backer of Clinton or Trump who has paid even passing attention to all that has been done, said, and revealed during this tumultuous presidential campaign claim that either candidate consistently behaves rationally? \\nFinally, Jefferson shares with those in attendance that mild afternoon (it was an unseasonably warm 55 degrees) at the U.S. capitol in Washington, D.C. on March 4, 1801, his view of the very best government. Jefferson says that \"a wise and frugal Government, which shall restrain men from injuring one another, shall leave them otherwise free to regulate their own pursuits of industry and improvement, and shall not take from the mouth of labor the bread it has earned. This is the sum of good government.\" \\nBoth Mrs. Clinton and Mr. Trump have published their plans for the first 100 days in office, should they be the next Oval Office occupant. In those lists, there are numerous promises, the fulfillment of which would be a violation of the constitutional limits on the powers of the executive as set out in Article II of the Constitution. \\nMany of the candidates\\' programs and policies would require   to increase taxes (thus taking \"from the mouth of labor the bread it has earned\") and to enter into those infamous \"entangling alliances\" that Jefferson warned would threaten our \"peace at home and safety abroad.\" \\nFinally, we would do well to remember that, as the Business Insider article reports, \"Jefferson\\'s wise words offer comfort that the American experiment can work.\" \\nAmericans committed to one or the other candidate and equally committed to upholding the Constitution should read Thomas Jefferson\\'s first inaugural address and then send a copy to their preferred presidential successor, with the hope that the candidate would memorize it and model it.  '"}, "time": 1742628419.3099759}