{"duration": 0.2924234867095947, "input_args": {"text": "'by PAUL FASSA \\nYou might think I’m joking. But I’m not. Yes, the accepted perception of cannabis aka marijuana’s effect on the brain is normally forgetfulness and goofy behavior, so one may not normally think cannabis would be a positive influence for any stage of dementia or Alzheimer’s. \\nWhile in office, president Ronald Reagan declared: “… the most reliable scientific sources say permanent brain damage is one of the inevitable results of the use of marijuana.” \\nThat declaration was based on a lone Tulane study authored by Dr. Robert G. Heath that force fed pot smoke into monkeys wearing masks, which gave them virtually no options of breathing normal air, equivalent to 30 joints daily for 90 days, after which the monkeys withered away and died. \\nAlthough autopsies confirmed many brain cells were damaged, critics claimed the monkeys brain cells suffered from oxygen deprivation, not from cannabis THC. Many attempts to duplicate Heath’s study failed. Evidently it was only designed and executed to satisfy the anti-pot agenda. \\n\\nA “Lost” Marijuana Study That Didn’t Fit the DEA Agenda But there is a study that avoided the public radar completely, forcing the DEA (Drug Enforcement Administration) to withdraw funding on that study in 1974 when the University of Virginia Medical College researchers began observing cancerous brain cells restored to healthy brain cells in mice instead of THC causing harm to normal brain cells, the DEA’s desired outcome. \\nThe DEA went beyond shutting that research down . All the papers from that research were confiscated and President Gerald Ford put a stop to any further research on whole plant produced cannabis while encouraging Big Pharma’s synthetic THC research. Studies Show Cannabis’s Ability to Reverse Alzheimer’s \\nGary Wenk, Ph.D, a professor of neuroscience, immunology and medical genetics at Ohio State University, is one of the pioneers for cannabis research regarding dementia and other neurodegenerative disorders. “I’ve been trying to find a drug that will reduce brain inflammation and restore cognitive function in rats for over 25 years; cannabinoids [found in cannabis] are the first and only class of drugs that have ever been effective,” he told Time Magazine. \\nHe believes the stigma of marijuana conditioning from the late 1930s on, still hinders cannabis-based medicine from being widely accepted, but is hopeful that things will change. “I think that the perception about this drug is changing and in the future people will be less fearful.” \\nA 2013 Spanish study using mice that are genetically predisposed to brain plaque accumulation associated with Alzheimer’s discovered “.. stimulation of CB2 (cannabinoid) receptors ameliorates several altered parameters in Alzheimer’s disease such as impaired memory and learning, neuroinflammation, oxidative stress damage and oxidative stress responses … .” (Abstract) \\nAnother research example was provided by independent scientists at the Roskamp Institute in Sarasota, Florida with their study, “Role of the cannabinoid system in the transit of beta-amyloid across the blood–brain barrier”. \\nThat study, published June 25, 2013 in the journal Molecular and Cellular Neuroscience, explained how the accumulation of abnormal structures called beta-amyloid (Aβ) plaque blocks neuron communication of brain cells. \\nLead author for the study, Corbin Bachmeier, Ph.D, explained that abnormal production of this plaque wasn’t the source of dementia or Alzheimers (AD), but “the result of impaired Aβ clearance from the brain.” \\nThe research team found cannabinoids from cannabis, of which the psychotropic THC is but one, through both in vitro (lab only) and in vivo (using live animals), enabled the plaque to be expelled through the blood brain barrier. This function occurs normally among those who are not afflicted with AD. (Study) \\nEarlier in 2013, Tim Karl, Ph.D, a senior investigator at Neuroscience Research Australia , found that mice with Alzheimer’s experienced dramatic improvements in memory after treatment with cannabis’s cannabidiol (CBD). \\nResearchers tend to focus on CBD, one of over 60 cannabinoids, because it’s without the THC’s psychoactive effects. “It basically brings the performance of the animals back to the level of healthy animals,” Karl told Sydney Morning Herald . \\nAnother in vitro lab culture study focusing on THC during 2012, published in the journal Neuropathology and Applied Neurobiology, demonstrated protection from Parkinson’s Disease (PD) neuron damage. (Abstract source) \\nIn 2004, the Prague Movement Disorder Center sent out anonymous questionnaires to attendees as part of a study: “Survey on cannabis use in Parkinson’s disease: Subjective improvement of motor symptoms”. \\nOf the many respondents who confided they used cannabis for PD treatment, almost half of them reported improved physical motor movement and reduced tremors. (Source) \\nGo to the comments section of this article to view some positive anecdotal reports using cannabis for Alzheimer’s and other forms of dementia \\nCannabis With or Without THC’s Psychoactive Effects \\nAccording to Canadian Rick Simpson , who pioneered and popularized cannabis oil , “smoking pot lets a lot of cannabis healing go up in smoke.” Cannabis oil is a decoction of the hemp plant with THC to produce very thick molasses type oil. Rick used it for his skin cancer and post head trauma affliction that mainstream medicine couldn’t handle. \\nThen he gave it freely to his small town fellow Nova Scotia neighbors who cured everything from cancer to cardiac issues. His video documentary, “ Run from the Cure ” is available free on youtube. Currently, most cannabis oil providers use grain alcohol instead of naphtha like Rick did to decoct the oil from the plant. \\nHemp plants can be bred to have lower THC levels. That’s what CBD (cannabidoil) is about. It’s used to greatly reduce seizures without side effects in epileptic children without concerns of THC’s psychoactive effects. \\nThe psychotropic compound THC is normally relatively inactive in the raw plant. But it takes a lot of plants to sufficiently juice hemp with THC therapeutically. Most medical marijuana card carriers are restricted with how many plants they can grow for themselves. \\nCannabis THC has to be highly heated to become more active, and producing cannabis oil involves heating. Some patients who use cannabis oil have resorted to inserting the oil or cannabis oil suppositories rectally to experience minimal or no psychotropic effects. \\nOf course, there are still restrictions in many states for medical cannabis with THC. But you do also have the option of using inexpensive and legal coconut oil to avoid or even reverse Alzheimer’s. \\nIt’s also important to maintain a schedule of moderate exercise, even walking briskly for a mile most days out of the week, to help improve your ability to naturally flush out those beta-amyloids before they accumulate. \\nIronically, it appears the fastest growing group of cannabis use is among the very senior citizens who used to be against it. \\nPaul Fassa is a contributing staff writer for REALfarmacy.com. His pet peeves are the Medical Mafia’s control over health and the food industry and government regulatory agencies’ corruption. Paul’s contributions to the health movement and global paradigm shift are well received by truth seekers. Visit his blog by following this link and follow him on Twitter here \\nSources:'"}, "time": 1742561649.2657976}