{"duration": 0.5342977046966553, "input_args": {"text": "'Editor’s note: We’re resurfacing this 2013 magazine article to remind you that tirelessly helping others could be the key to hyperefficiency. Just after noon on a Wednesday in November, Adam Grant wrapped up a lecture at the Wharton School and headed toward his office, a   speed walk away. Several students trailed him, as often happens at conferences, Grant attracts something more like a swarm. Grant chatted calmly with them but kept up the pace. He knew there would be more students waiting outside his office, and he said, more than once, “I really don’t like to keep students waiting. ” Grant, 31, is the   and   professor at Wharton. He is also one of the most prolific academics in his field, organizational psychology, the study of workplace dynamics. Grant took three years to get his Ph. D. and in the seven years since, he has published more papers in his field’s   journals than colleagues who have won   awards. His influence extends beyond academia. He regularly advises companies about how to get the most out of their employees and how to help their employees get the most out of their jobs. It is Grant whom Google calls when “we are thinking about big problems we are trying to solve,” says Prasad Setty, who heads Google’s people analytics group. Plenty of people have made piles of money by promising the secrets to getting things done or working a   week or figuring out what color your parachute is or how to be a brilliant   manager. But in an academic field that is preoccupied with the study of efficiency and productivity, Grant would seem to be the most efficient and productive. When we arrived at Grant’s office on the Philadelphia campus, five students were waiting outside. The first was a student trying to decide between Teach for America and a   job at Google. Grant walked her through some other possibilities, testing her theories about potential outcomes. Although she was aware of the crowd, she seemed to be in no hurry to leave, in part because Grant was so clearly engaged. A second student came in. Then a third. Someone dropped off a bottle of wine to say thank you another asked for a contact (Grant pledges to introduce his students to anyone he knows or has met, and they shop his LinkedIn profile for just that purpose). For every one of them, Grant seemed to have not only relevant but also scientifically tested,   advice: Studies show you shouldn’t move for location, since what you do is more important than where you do it. Studies show that people who take jobs with too rosy a picture get dissatisfied and quit. If you truly can’t make a decision, consider delegating it to someone who knows you well and cares about you. Is there anything else I can help you with? How else can I help? He was like some kind of  . Grant might not seem so different from any number of accessible and devoted professors on any number of campuses, and yet when you witness over time the sheer volume of Grant’s commitments, and the way in which he is able to follow through on all of them, you start to sense that something profoundly different is at work. Helpfulness is Grant’s credo. He is the colleague who is always nominating another for an award or taking the time to offer a thoughtful critique or writing a lengthy letter of recommendation for a student  —   something he does approximately 100 times a year. His largess extends to people he doesn’t even know. A student at Warwick Business School in England recently wrote to express his admiration and to ask Grant how he manages to publish so often, and in such   journals. Grant did not think, upon reading that   I cannot possibly answer in full every such query and still publish so often, and in such   journals. Instead, Grant, who often returns home after a day of teaching to an   of 200   responded, “I’m happy to set up a phone call if you want to discuss!” He attached handouts and slides from the presentation on productivity he gave to the Academy of Management annual conference a few years earlier. For Grant, helping is not the enemy of productivity, a   diversion from the actual work at hand it is the mother lode, the motivator that spurs increased productivity and creativity. In some sense, he has built a career in professional motivation by trying to unpack the puzzle of his own success. He has always helped he has always been productive. How, he has wondered for most of his professional life, does the interplay of those two factors work for everyone else? Organizational psychology has long concerned itself with how to design work so that people will enjoy it and want to keep doing it. Traditionally the thinking has been that employers should appeal to workers’ more obvious forms of  : financial incentives, yes, but also work that is inherently interesting or offers the possibility for career advancement. Grant’s research, which has generated broad interest in the study of relationships at work and will be published for the first time for a popular audience in his new book, “Give and Take,” starts with a premise that turns the thinking behind those theories on its head. The greatest untapped source of motivation, he argues, is a sense of service to others focusing on the contribution of our work to other people’s lives has the potential to make us more productive than thinking about helping ourselves. “Give and Take” incorporates scores of studies and personal case histories that suggest the benefits of an attitude of extreme giving at work. Many of the examples  —   the selfless C. E. O. ’s, the consultants who mentor ceaselessly  —   are inspiring and humbling, even if they are a bit intimidating in their natural expansiveness. These generous professionals look at the world the way Grant does: an   filled with requests is not a task to be dispensed with perfunctorily (or worse, avoided) it’s an opportunity to help people, and therefore it’s an opportunity to feel good about yourself and your work. “I never get much done when I frame the 300   as ‘answering ’ ” Grant told me. “I have to look at it as, How is this task going to benefit the recipient?” Where other people see hassle, he sees bargains, a little work for a lot of gain, including his own. The message sounds terrific: Feel good about your work, and get more of it done, and bask in the appreciation of all the people you help along the way. Nice guys can finish first! (Now there’s research to prove it.) But I couldn’t help wondering, as I watched Grant race through his marathon day (even one of his mentors admitted, “He can be exhausting”) about the cost of all this  . If you are devoted to being available to everyone, all the time, how do you relax? How can you access the kind of creativity that comes from not being on task every waking moment? How do you make time for the more important relationships in your life? As Grant’s office hours came to an end four and a half hours later, he patiently continued offering help until he finally had to close the door and tell a student to try him by phone he would squeeze him in on his commute or by  . But he would not say no. The study of job design in the   and   century focused on how to improve the drudge work of manufacturing: Grant is credited with reviving the field, shifting the thinking toward the more modern conditions of a service and knowledge economy. He first realized that his ideas about giving at work might actually yield quantifiable results when he was a    graduate student at the University of Michigan, and he proposed a study set in a university   call center. Call centers, even on college campuses, are notoriously unsatisfying places to work. The job is repetitive and can be emotionally taxing, as callers absorb verbal abuse while also facing rejection (the rejection rate at that call center was about 93 percent). The manager, Howard Heevner, did not have a lot of faith that Grant would be able to motivate his  . He had already tried, in a previous job at a call center, the usual incentives  —   cash prizes, competitive games  —   and was generally unimpressed with the results. But Grant had a different idea. When he was an undergraduate at Harvard, he took a job selling advertisements for the travel guide series “Let’s Go,” but he was terrible at it. “I was a pushover,” he says in “Give and Take,” “losing revenues for the company and sacrificing my own commission. ” Then he met another undergraduate whose job at “Let’s Go” was helping her pay her way through college. Suddenly the impact of his role became clear to him: without advertising revenues, the company could not make money, which in turn meant it couldn’t provide jobs to students who needed them. With that in mind, he was willing to make a harder sell, to take a tougher line on negotiations. “When I was representing the interests of students, I was willing to fight to protect them,” he writes. It would not be a   psychology book if every anecdote did not have a dramatic ending: Grant eventually sold the largest advertising package in company history and less than a year later, at 19, was promoted to director of advertising sales, overseeing a budget of $1 million. As a psychology major, Grant always hoped to do a study on the “Let’s Go” staff, in which the books’ editors and writers would meet with or read letters by people whose travels had been enhanced by their work. Would knowing how the books benefited others inspire them to work harder? Now, at the call center, Grant proposed a simple,   experiment: given that one of the center’s primary purposes was funding scholarships, Grant brought in a student who had benefited from that  . The callers took a   break as the young man told them how much the scholarship had changed his life and how excited he now was to work as a teacher with Teach for America. The results were surprising even to Grant. A month after the testimonial, the workers were spending 142 percent more time on the phone and bringing in 171 percent more revenue, even though they were using the same script. In a subsequent study, the revenues soared by more than 400 percent. Even simply showing the callers letters from grateful recipients was found to increase their   draws. When Grant went back and talked to the callers about their improvement, many actively discounted the possibility that the brief encounter with a scholarship student helped. “Several of them were stunned,” Grant said. “Their response was, ‘Yeah, I knew I was more effective, but that was because I had more practice,’ or, ‘That was because I had a better alumni pool in that period  —   I got lucky.’ ” Eventually, having replicated the test five times, Grant was confident that he had eliminated other explanations. It was almost as if the good feelings had bypassed the callers’ conscious cognitive processes and gone straight to a more subconscious source of motivation. They were more driven to succeed, even if they could not pinpoint the trigger for that drive. The study quickly raised Grant’s profile in his field, partly because it relied on hard data: dollars, as opposed to manager assessments or  . “I don’t know the last time there was a study in our field that had such striking results,” says Stuart Bunderson, a professor of organizational behavior at Washington University. “In terms of an intervention that has practical significance and moves the needle on employee behavior  —   you don’t see them that often. ” The intervention was also a manager’s dream: fast and practically free. Over the years, Grant has followed up that study with other experiments testing his theories about prosocial motivation  —   the desire to help others, independent of easily foreseeable payback. In one study, Grant put up two different signs at   stations in a hospital. One reminded doctors and nurses, “Hand hygiene prevents you from catching diseases” another read, “Hand hygiene prevents patients from catching diseases. ” Grant measured the amount of soap used at each station. Doctors and nurses at the station where the sign referred to their patients used 45 percent more soap or hand sanitizer. These studies, two of Grant’s best known, focus on typically worthy beneficiaries: needy students and vulnerable patients. But some of his other research makes the case that prosocial behavior is as applicable in corporate America as it is in a hospital or a university. “Think of it this way,” he said. “In corporate America, people do sometimes feel that the work they do isn’t meaningful. And contributing to   can be a substitute for that. ” Take, for example, Grant’s study of workers at Borders who contributed to an   fund managed by the staff, with Borders matching donated funds. The money was set aside for employees in need  —   someone facing a pregnancy that would put a strain on their finances, for example, or the funeral of a loved one. Interestingly, Grant found that it was not the beneficiaries who showed the most significant increase in their commitment to Borders it was the donors, even those who gave just a few dollars a week. Through interviews and questionnaires, Grant determined that “as a result of gratitude to the company for the opportunity to affirm a valued aspect of their identities, they developed stronger affective commitment to the company. ” The study is uplifting and troubling at the same time: even Grant acknowledges the possibility of corporations playing off their employees’ generous impulses, as a sop to compensate for other failings  —   poor pay or demeaning work. (After all, if the employees at Borders had better benefits and pay, they might not have needed the emergency fund.) Jerry Davis, a management professor who taught Grant at the University of Michigan and is generally a fan of his former student’s work, couldn’t help making a pointed critique about its inherent limits when they were on a panel together: “So you think those workers at the Apple factory in China would stop committing suicide if only we showed them someone who was incredibly happy with their iPhone?” Grant’s answer to these questions is academic: he tries to understand how these mechanisms function but does not necessarily advocate implementation. “I am also skeptical about the motivations of corporations,” he said. “My concern is ultimately for the success and   of people in organizations. To the extent that individual and group accomplishments and quality of work life contribute to profits, I’m happy, but that’s not my primary goal. ” For all his general interest in psychology, Grant doesn’t seem interested in digging too deeply into the origins of his own psyche. About his   desire to help, he says simply: “My mother has what she calls the   gene. Maybe I just inherited it. ” He grew up in the suburbs of Detroit, raised by a lawyer, his father, and a teacher, his mother. He was an upbeat boy, though socially awkward and burdened by numerous food allergies and strong aversions  —   to haircuts, to bluejeans, to chocolate. He felt things deeply those aversions were matched by equally consuming passions. An aspiring basketball player, he would not allow himself to go inside until he made 23 consecutive free throws, even if it meant missing dinner. (That he never made the   team is the one failure that still pains him.) On weekends, he played video games for so many consecutive hours  —   10 was not unusual  —   that his mother called the local paper to complain about what the paper called, in the subsequent article, “The Dark Side of Nintendo. ” Grant started significantly losing his hair in his 20s, as if his head were trying to keep pace with his overall precociousness. Now almost entirely bald, he has a striking, monklike look. Though he comes across as charming and agreeable, there are still traces of the awkward boy he says he once was, a hint of discomfort in the smile he gives a student he runs into unexpectedly, a longstanding dread of parties (“unless they like psychology or magic tricks, in which case I’d come alive,” he said). He is aware of his own introverted tendencies, and some of his research involves the strengths of introverts at work. For the most part, Grant has more than compensated for the shyness he felt growing up. Once phobic about speaking in public, he forced himself to lecture as much as he could as a graduate student, handing out feedback forms so he could methodically learn from his weaknesses. He developed strategies for socializing comfortably, even though, he said, “I feel uncomfortable when I’m in a situation and I don’t know what people want or expect of me. ” Giving, he eventually realized, was a reliable way of mediating social interactions. On the day I followed Grant as he hurried to his office hours at Wharton, I read something on his face that registered as more than just busyness he seemed anxious. I wondered whether Grant was driven by the desire to help or a deep fear of disappointing someone. “That is one astute observation!” Grant said when I asked him about that by  . (With Grant, every observation is an astute one.) Grant often starts his research with observations about himself  —   “” they call it in the field  —   and he had conducted a study trying to determine which of those two impulses was more motivating. The answer turned out to be a combination of the two. “Givers motivate themselves to avoid complacency by focusing on the benefits to others if they succeed and worrying about disappointing them if they fail,” Grant wrote. One of Grant’s roommates, he went on, once joked that he had a productive form of O. C. D. “He noticed that when I was anxious about something, I had a habit of throwing myself   into tasks in which I felt responsible to others,” he said. “A few days later, my mentor, Brian Little, sent me an article by Ian McGregor, one of his doctoral students, who studied ‘compensatory conviction’: anxiety in one domain motivates people to dive into passionate pursuit in another. It was one of those crystallizing moments that triggered a ‘Yes, I want to be a psychologist!’ reaction  —   I was fascinated by how closely his theory and findings mapped onto my own experience. ” It’s not hard to imagine a   interpretation of Adam Grant: that his generosity might have its roots in some kind of need  —   maybe a need he feels, even more than the rest of us, to be liked. Or perhaps that he is channeling his extreme ambition into a   form of achievement. Productive and happy, Grant could even be seen as a paradigm of Freud’s definition of mental health: aggression sublimated into work. But he has never put much stock in psychoanalysis  —   if the work is not   he’s skeptical. “I think a lot of it is baggage that goes back to Freud, and Freud would always say that whatever is going on with you can be traced back to something that happened early in childhood with your mother,” he told me, by phone, as he was driving to work one day. “You can either accept that or be in denial. You can’t win!” He would rather simply understand himself as someone who gets a lot out of giving, then harness that feeling, study it and see how the mechanisms involved can inspire others to succeed. One night Grant forwarded me a grateful   from a student whose life, the student said, changed because of some advice Grant gave her. I commented that most people would be thrilled to receive one note like that in a lifetime. “I get several dozen a week,” Grant said. He agreed to send some my way. That evening, at around 8:30, the   started coming  —   Thank you for our conversation the other day and for your genius. . . . I couldn’t have done this without you. . . . I cannot thank you enough for your time and insight. . . . I’m thrilled. And I have you to thank. . . . After the first 10, I was impressed when they kept arriving, I was surprised. On and on, until almost 11, my   kept pinging when I awoke the next morning, I saw that he had forwarded me 41   from the preceding week, each one of them numbered for my convenience. Was this compulsive behavior? “Not really,” Grant said. “I would see it as   and focused. ” He said the question had generated a new research idea for him: “How Prosocial Behavior Can Mitigate O. C. D. Tendencies. ” Grant’s book, incorporating several decades of   research on reciprocity, divides the world into three categories: givers, matchers and takers. Givers give without expectation of immediate gain they never seem too busy to help, share credit actively and mentor generously. Matchers go through life with a master chit list in mind, giving when they can see how they will get something of equal value back and to people who they think can help them. And takers seek to come out ahead in every exchange they manage up and are defensive about their turf. Most people surveyed fall into the matcher category  —   but givers, Grant says, are overrepresented at both ends of the spectrum of success: they are the doormats who go nowhere or burn out, and they are the stars whose giving motivates them or distinguishes them as leaders. Much of Grant’s book sets out to establish the difference between the givers who are exploited and those who end up as models of achievement. The most successful givers, Grant explains, are those who rate high in concern for others but also in  . And they are strategic in their giving  —   they give to other givers and matchers, so that their work has the maximum desired effect they are cautious about giving to takers they give in ways that reinforce their social ties and they consolidate their giving into chunks, so that the impact is intense enough to be gratifying. (Grant incorporates his field’s findings into his own life with methodical rigor: one reason he meets with students four and a half hours in one day rather than spreading it out over the week is that a study found that consolidating giving yields more happiness.) The studies are elaborate, the findings nuanced  —   but it is easy to walk away from the book forgetting the cautionary tales about people who give too much and remembering only the wash of stories about boundless generosity resulting in surprising rewards: a computer programmer who built a Web site at no cost for music fans (one of whom turns out to be an influential figure in Silicon Valley) a financial adviser who travels to take on a client thought to be impoverished (only to find that person sitting on a significant fortune) the writers who start out working free on a project for a friend (and somehow end up among the most successful in Hollywood). I had assumed that Grant, and the other examples of extreme givers in his book, were simply superhuman in one way or another  —   not only in the acute empathy that makes giving so rewarding for them but also in their unusual focus and stamina and   speed, traits that allow them to bend time and squeeze in more generosity than the rest of us. Grant, clearly, has some advantages beyond his propensity to help: more than one of his colleagues told me, for example, that when they cannot find the citation for a particular paper, they simply   Grant directly, who is more reliable than Google and almost as fast (his childhood friends called him Mr. Facts). But Grant believes that in terms of giving, we all have the same muscle it’s just that he and the other givers in his book have exercised it more. In “Give and Take,” he cites a study that found that most people lose physical strength after enduring a test of will, like resisting   cookies when they are hungry. Typically, the study’s subjects could squeeze a handgrip for only 25 seconds after an exercise in willpower. But one group distinguished itself, squeezing the grip for 35 seconds after the test of will. They were people who were on the giving end of the   scale. “By consistently overriding their selfish impulses in order to help others, they had strengthened their psychological muscles, to the point where using willpower for painful tasks was no longer exhausting,” writes Grant of the study, conducted by researchers at Northwestern University. It seems too simple to assume that Grant just happens to be capable of great discipline across all facets of his life all those exercises in will, he would argue, feed each other, with one making the others possible. I like to think I am a typically helpful person, but after reading Grant’s book, I found myself experimenting with being more proactive about it. I started ending   by encouraging people to let me know if I could help them in one way or another. I put more effort into answering random entreaties from students trying to place articles. I encouraged contacts seeking work or connections to see me as a resource. And I did notice that simply avoiding the mental lag of deciding whether to help or not was helpful. At a minimum, Grant’s example presents a   rule: Unless the person on the other end is a proven taker, just do it  —   collaborate, offer up, grant the favor. The first time I exchanged those   I usually felt good after the second exchange on a given topic, I thought perhaps I had done my duty. But I noticed that every offer of help I initiated or granted engendered four or five   at the end of which I sometimes felt surly and behind on my work  —   and then guilty for feeling that way. Worse, those exchanges often even ended with the person on the other end wanting to meet for coffee. Coffee! Now I struggled to find a way to say, gracefully, that there was no way I could meet for coffee  —   not this week or next or the week after that, because there are only so many hours in the day, and if I do not get home in time to make dinner, my children will dine on Pirate’s Booty and Smarties, which would not make me feel helpful or productive or good. Children. It must be said that in the middle of a national debate about flexible hours and telecommuting, there is precious little in Grant’s book about work and family balance. The division of labor in Grant’s own marriage is very traditional his wife, who has a degree in psychiatric nursing, does not work outside the home, devoting her time to the care of their two young daughters and their home. Grant would be an extraordinary giver under any circumstances but it can only help that he doesn’t have to worry about running to the grocery store or renewing the car registration. “Sometimes I tell him, ‘Adam  —   just say no,’ ” his wife, Allison, told me, referring to the hundreds of requests he gets every day. “But he can’t say no. That’s what he is. That’s his way. ” Grant is devoted to his family  —   he has dinner most nights at home and takes his daughter to a preschool activity on many afternoons. But he also works at least one full day on the weekend, as well as six evenings a week, often well past 11. Once, when Grant was asked to give a talk on productivity, he confessed to a mentor that for all his research, he was still not sure what he did that was any different from anyone else. It wasn’t exactly a mystery, his mentor told him: He worked more. “I made a commitment to talk about that more,” Grant said. He did not mean to suggest that everyone should work on weekends he wanted them to be aware that they were making a choice, maybe even one they felt good about. “The way I see it, I have several different roles,” he told me: teacher, scholar, adviser, friend, to name a few. “I’d be concerned if any of those roles took more of my time than my family. ” Grant, of course, has conducted a study investigating whether giving behaviors at work translate into happiness at home. He found that people who felt they had contributed to others’   at work did not always feel great at the end of the workday but they usually did by bedtime, especially if they had reflected about their contribution in the intervening hours. It turns out that bringing your work home with you can be beneficial after all  —   if you’re thinking about it the right way. A skeptic might read Grant’s book and conclude that extreme givers are just matchers who are in it, maybe even subconsciously, for the long run. Eventually, in ways that are predictable and unpredictable, the bounty returns to them. Grant’s giving instincts might be reflexive, but they do clearly contribute to his success. “The entire world feels like it owes him a favor  —   including me,” says Justin Berg, a doctoral candidate who studies creativity at Wharton and who has collaborated with Grant. “People rush at the opportunity to work with him. ” And one round of giving enables another: when Grant calls on a work contact and asks her to meet with an undergraduate seeking work, chances are that contact is more than happy to enable Grant’s favor, because she has already been the beneficiary of more than one from him herself. The path to success is filled with people helping to clear the way. From the point of creativity, Grant’s undiscriminating helpfulness also reaps professional benefits, Berg says. “The best ideas occur to people who are touching multiple worlds and domains. And in our field, he’s at the nexus of a lot of them. ” Because one study found that old friends and connections can be even more valuable as resources than current ones  —   because they intersect with different worlds and therefore have more fresh ideas  —   Grant has a tickler built into his calendar reminding him, once a month, to get in touch with a contact he likes but with whom he has temporarily lost touch. And he is highly efficient about his giving: he virtually never says no to the   favor, something that will help someone out  —   an introduction, a quick suggestion  —   but cost him very little, relative to impact. We were sitting in Grant’s office one afternoon talking about efficiency, when he said: “The truth is, I don’t care how many articles I publish or how many words I write. Productivity is an imperfect way of indexing how much I’m contributing, how I’m using my limited time to make the most difference. ” It wasn’t until I was transcribing the conversation a few days later that I realized that when he referred to his limited time, he wasn’t just talking about a busy schedule there was a more existential tug in the phrase. I brought it up with him by phone. “It’s the kind of thing I almost never talk about,” Grant said. “But my responsibility is to be open. ” Mortality, he said, was the one subject that gave him something like panic attacks. He had always felt that way, since he was a brainy, sensitive kid playing basketball in his driveway, staring at the sun, suddenly terrified of what would happen when it burned out. That was why he first wanted to be a scientist  —   before he realized biology bored him and he would never reinvent physics  —   so he could help figure out how to extend life, or at least design the spacecrafts that he is sure, even now, will take us to safer planets if this one runs dry. Mortality, he said, is “something I can’t fix. I can’t do anything with or about it. ” He can’t let himself think about it too much he has lost days at a time to his anxiety, “to the point that it’s the equivalent of extreme physical pain. ” It struck Grant as odd that no one had ever tried to figure how the awareness of death motivates people’s behavior at work, and in 2009, he published a paper trying to understand the link between mortality and productivity: “The Hot and Cool of Death Awareness at Work: Mortality Cues, Aging and   and Prosocial Motivations. ” The study walks the reader through the fascinating field of death awareness, which measures how people respond to reminders of death, like a news clip about a deadly car crash. When and how, he asked, does the prospect of death become relevant to employees at work? Grant argued that when people’s reactions to reminders of death are “hot”  —   anxious and panicked  —   those workers tend to withdraw. But when they are “cool”  —   more reflective, as in response to chronic reminders, the kinds, for example, firefighters face  —   those workers would be more likely to “reflect on the meaning of life and their potential contributions. ” Grant wrote the paper, in part, to try to sort out his own hot and cool feelings on the subject. Contemplating the meaning of life doesn’t make him want to relax and work less. “I always go back to William James,” he said. “ ‘The greatest use of a life is to spend it on something that will outlast it.’ A big part of it is being remembered. ” Besides, relaxing stresses him out. “For me, in my moments of idleness, I experience the most existential anxiety, so I like that every moment is scheduled, even when it’s having on my calendar that I’m going to watch a television show with my wife. It means my brain is engaged in other things, and it’s not going to be a terrifying evening. ” Grant would be the first to say that he is not purely altruistic  —   that pure altruism, giving without regard for one’s   perhaps does not even exist. When he writes those 100 student recommendations, he says, he gets the satisfaction of helping them succeed. But there are other happy byproducts of that work as well: he might end up the beneficiary of those students’ good will later on and possibly inspire them to try to do right by those who will eventually ask them for help. He will also have kept himself busy enough that he won’t have much time to spend agonizing over what happens when he can’t give anymore. As he left the office after one of our meetings, Grant headed for his car, carrying another gift of gratitude: a twiggy box filled with organic jellies and dried fruit from the Environmental Defense Fund, to which he had recently spoken about how to motivate their  . On the way to the garage, Grant told me the story of a time that someone asked quite a lot from him. “So I got an   out of the blue from a recent Ph. D. who wanted career advice,” Grant said. “And I spoke to him for a while on the phone  —   twice. But then, after that, he asks me if I could give him comments on his dissertation, and he sends me this thing that was like 300 pages long. It was one of those moments  —   yikes!” Grant did not know this academic and was not an expert on the subject. This, I thought, was the   last straw, an occasion when Grant not only said no but also perhaps found the request itself galling. Surely he did not shun his family, his students, his ultimate Frisbee game, his research and his   list of   requests for the hours that it would have taken him to analyze a   dissertation. Even Adam Grant must say no sometimes. Grant said that he rarely feels resentful of such requests. “It’s on me if I want to say no,” he said. “I own my guilt. ” He did decide that in this case, the time it would take to read the paper would be excessive  —   and that indulging the impulse to read it all would be tantamount, in the logic of Grant’s thinking, to letting himself down, flouting his own rules of efficient giving. “So I just skimmed it for the most important parts,” he said, and gave general feedback on those points. The author then reworked the paper completely and sent it back to Grant to read again. Grant, of course, complied. “And guess what?” Grant said, breaking out in a smile. “The paper was great!”'"}, "time": 1742562383.8460033}