{"duration": 0.03613638877868652, "input_args": {"text": "'The   Core New Mexico education secretary who once served as a staffer in former Gov. Jeb Bush’s administration in Florida is no longer a candidate for assistant secretary of the U. S. Education Department, reports Politico. [Hanna Skandera’s name was pulled from consideration for the position, the report says, because about a dozen Senate Republicans “were skeptical that they could ever vote yes” to confirm her, due to her support for the highly unpopular Common Core standards.  Skandera was deputy education commissioner under Jeb Bush and also a senior policy adviser and deputy chief of staff at the education department under former U. S. Secretary of Education Margaret Spellings, who served under President George W. Bush. Like Jeb Bush, Skandera is a proponent of the Common Core standards. She is head of the governing board of the Partnership for Assessment of Readiness for College and Careers (PARCC) one of the two federally funded test consortia that developed assessments aligned with Common Core. President Donald Trump campaigned on getting rid of the Common Core standards, and a   network of grassroots citizens across the country are vehemently opposed to the federalized program that was introduced in President Barack Obama’s 2009 stimulus bill. Emmett McGroarty, a senior fellow at American Principles Project, released the following statement: We applaud the Administration and the Senate for scuttling the nomination of Hanna Skandera due to her past support for Common Core standards and testing. Parents, students, and teachers detest Common Core because it locks children into an inferior education. As President Trump has said, Common Core “is a total disaster. ” We urge the Administration to look for appointees committed to achieving the President’s vision that “education has to be at a local level. We cannot have the bureaucrats in Washington telling you how to manage your child’s education. ” Though U. S. Education Secretary Betsy DeVos has funded and served organizations that promote Common Core  —   including Jeb Bush’s Foundation for Excellence in Education  —   since her nomination, she has denied she supports the controversial standards. DeVos, nevertheless, has surrounded herself with advisers and staff who have ties to Bush’s foundation, as well as to Indiana, where Common Core was repealed, but then simply “rebranded. ” The secretary recently said the federal Every Student Succeeds Act (ESSA) “essentially does away with the notion of a Common Core,” a statement many grassroots parent activists still battling against the Core in their states have rejected. Upon DeVos’s nomination, KOB4 in Albuquerque reported Skandera praised Trump’s pick, saying that while she did not know her well, she believed DeVos’s policies would not change Common Core in New Mexico. Breitbart News reached out to the press office at the U. S. Education Department to confirm the report but received no response.'"}, "time": 1742628406.3070176}