{"duration": 0.10576415061950684, "input_args": {"text": "'Source: Google Sites \\nMany people seem to dismiss HAARP as possessing any kind of level of threat, obviously they have completely and totally NO understanding of the potential of radio waves in transmitting actual power. \\nIn general of all the people who under estimate HAARP, I don’t read of anyone here blasting Einstein’s theories, and I can rest assured they understand HAARP less than they do “General or Special” Relativity. Yet from these theories came the Nuclear Weapons technology. So if you don’t believe HAARP can be used as a weapon then you obviously don’t believe Nuclear Energy can be used as a weapon either. \\nIn order to understand HAARP as a weapon, either you have to understand or generally accept the explanation of the technology by others who do understand, that is, if you don’t possess the intelligence to understand this technology. \\nSound is a mechanical wave that is an oscillation of pressure transmitted through a solid, liquid, or gas, composed of frequencies within the range of hearing and of a level sufficiently strong to be heard, or the sensation stimulated in organs of hearing by such vibrations. \\nSound Waves and Radio Waves possess some of the same properties and characteristics, yet utilize different mediums of propagation, in other words, Sound Waves use a physical mechanical pressure to be transferred through the air, a solid or liquid, \\nWhereas Radio Waves use electromagnetic energy as a type of “pressure” and can equally pass through the air, liquid or a solid, with the exception of reflective metals. At this point in order to understand the implications of HAARP, you’ll need to have at least a basic understanding of Electricity, Electrical energy, Electromagnetic energy, Radio Waves, Radio Frequency “ Resonance”, “Radio Wave Transmission and Propagation”, Microwave energy and “Power Transmission Via Microwave Emissions” Unlike the lower radio frequencies, Microwaves tend to act like visible light, very directional, very reflective, and they also have the ability to easily be absorbed by a non reflective medium or easily “permeate” ( go completely through ) a non reflective, non absorptive material, all with a varying degree of loss of power, depending on the medium or material. Microwaves also have the ability to be channeled or ducted through metal tubing or wave guides, but do not react to “Ducting” or being channeled between the layers of the Ionosphere, whereas High Frequency (30-300 MHz.) Radio Waves can be “Ducted” or channeled between the layers of the Ionosphere to be carried longer distances from their point of origin. Through the atmosphere you can simply use the “INVERSE SQUARE LAW” to determine an “exponential” loss of radiated power of any Electromagnetic or Radio wave. This calculation does not take into account the increased \"Photon Energy\" levels present in electromagnetic radiation at Microwave frequency levels, of which increase in the overall potential of the radiated power and since Microwave energy has a greater \"Photon Energy\" level than electromagnetic energy at lower frequencies, it\\'s \"actual\" power at lower wattage emission levels is greater than the power emitted from lower frequency radiation at the same wattage emission level. The HAARP Project is referred to as “High Frequency” and from what I’d read in the past (and I rechecked my sources for posterity) they claim to operate primarily on two frequencies, 3.39 Megahertz and 6.99 Megahertz, both within the 3 to 300 Megahertz or” High Frequency” range. \\nMy question has always been and no one seemed to address this issue yet, are these, the primary carrier frequencies? Or, are these the modulated sub-frequency or HARMONIC, of a higher carrier frequency? Transmissions at Super High Frequency and Extremely High Frequency range are all a little above the capability of most of the equipment I normally use right now or else I would have “tuned in” to investigate. Equipment in these ranges has to be extremely selectable, with a high degree of sensitivity, but maybe not too terribly sensitive at the power levels they boast. \\nIt is also claimed that the HAARP antenna array uses circumpolar polarization of its RF waves. It has been my understanding in the past that circumpolar polarization of the high frequency (3 – 300 Megahertz) wavelength is not as efficient as it is at higher frequencies, like in the Ultra High Frequency and especially the Super High Frequency and Extremely High Frequency (microwave) ranges. \\nNormally “High frequency” radio waves are generally absorbed by the ionospheres D layer (mainly during the daytime) and reflected back to the earth by the ionospheres E and F, layers when their present (mainly evenings and night), \\nWhereas “Microwave” transmissions are generally not affected by the Ionosphere, they tend to pass through the ionosphere with little or no effect, except an occasional minor distortion. \\nWith high altitude dispersant of Aluminum or most any other metallic particulates this energy can easily be “reflected” back TO the Earth and INTO the Earth and at the power levels mentioned can easily heat these areas as well. \\nAt the HAARP website they display the photo of what they call a Modular UHF Ionashpereic Radar Array. To me, this appears to be ground plane mounted Phased Array of UHF “circumpolar polarized antenna” capable of transmitting on a “wide band” of base frequencies or overtone harmonics of microwave frequencies. This is the only example of a circumpolar polarized antenna array in any given photo they show, all the other High Frequency of Very High Frequency arrays in any of their photos are definitely not “circumpolar polarized antenna” configurations. \\nActually if I had a large antenna capable of high power level transmission in higher frequency ranges like microwave, I’d place it in an enclosed “DOME” like the one shown in one of their photos they make no mention about. \\nWhen it comes to a U.S. Government funded operation, we are talking about the capability of operating well above 30 Gigahertz or even 300 Gigahertz, or well above that, Terahertz anyone? \\nBack in 1964 American Telephone and Telegraph had already began using, the already well developed “MASER” technology for point to point (tower to tower) telephone communications, which lead to the building of most of the Bell telephone towers you see now or have seen in the past, in most every city. I know, I was present at a Bell Labs Demonstration back in 1965. HAARP isn’t the only facility operating a High frequency Active Auroral Research Program, HAARP @ 110 Megawatts of Effective Radiated Power HISCAT (International Radio Observatory, Sweden) @ 350 Megawatts Effective Radiated Power \\nEISCAT (Tromsö, Norway) @ 48 Megawatts Effective Radiated Power \\nVOA (Voice of America – Delano, CA @ 27 Megawatts Effective Radiated Power \\nSURA (Radiophysical Research Institute, Nizhny Novgorod, Russia) @ 20 Megawatts Effective Radiated Power \\nArecibo (National Astronomy and Ionosphere Center, Puerto Rico) @ 20 Megawatts Effective Radiated Power \\nHIPAS High Power Auroral Stimulation Observatory (UCLA Plasma Physics Lab – Fairbanks Alaska) @ 17 Megawatts Effective Radiated Power \\n(Combined and operated simultaneously via satellite downlink that’s a total of over 590 Megawatts of total microwave power which can also be reflected by possibly satellites, metallic atmospheric dispersants or other reflective medium we may not even know exist and then directed to a centralized point) (remember, generally microwave transmissions generally DO NOT reflect off the ionosphere but go straight out into space unless reflected ) When it is taken into consideration the amount of power they discuss using, 3,600,000 watts, 110,000,000 watts or 350,000,000 watts of RF power (and who knows it could be even more), for you folks that don’t understand, this is one HELL of a lot of power in any Radio frequency range. Example The standard, everyday household microwave oven operates at 700 to 1100 watts of Radio Frequency power in the “Microwave” frequency range. \\nQUESTON? \\nWhen it takes a standard, everyday household microwave oven operating at 700 to 1100 watts of RF power to cook a 10 lb. turkey, then how many 10 lb. turkeys can you cook with 350 Megawatts microwave power? \\nThink about it! \\nDIRECTIONAL POWER: \\nRadio wave transmissions from non-movable, stationary antenna arrays (multiple antennas) can be ACTUALLY be made to be directional by applying more power to the antennas on any one side of the array and less power to the other side while transmitting. This creates electromagnetic wave “Side lobes” towards the side with more power applied and roughly points the transmissions in a selectable direction. \\nSO BEFORE YOU JUST ARBITRARILY DISMISS HAARP as a THREAT, or just because its radio waves they can’t have any effect on anything, then here are some FACTS to look into. History of Power Beaming The concept of wireless transmission of electrical energy — or power beaming — is not new. The idea has been around for decades, proposed primarily for space-based solar farms to supply energy to Earth or the surface of another world, or for wireless power on Earth. The two technologies that appeared suitable for power beaming involved microwave or laser energy. Researchers in several countries flew a variety of model aircraft using beamed microwave energy 20 years ago. However, the nature of the microwave beam causes it to spread out with distance, with a commensurate decrease in the power delivered to the target. While flight was easy to demonstrate at close distances with microwave beaming, flying an airplane at long distances would require a prohibitively powerful microwave beam to compensate for the energy loss as the beam spread. That left only lasers as a potentially viable option for practical power beaming…. ( http://www.nasa.gov/centers/dryden/news/FactSheets/FS-087-DFRC.html ) \\nWireless energy transfer \\nMicrowave method \\nMain article: Microwave power transmission \\nPower transmission via radio waves can be made more directional, allowing longer distance power beaming, with shorter wavelengths of electromagnetic radiation, typically in the microwave range. A rectenna may be used to convert the microwave energy back into electricity. Rectenna conversion efficiencies exceeding 95% have been realized. Power beaming using microwaves has been proposed for the transmission of energy from orbiting solar power satellites to Earth and the beaming of power to spacecraft leaving orbit has been considered. \\nhttp://en.wikipedia.org/wiki/Wireless_energy_transfer Let me refer you to the an article I read in the past, from the January, 1988 issue of Popular Science \\nWhere researchers successfully flew a lightweight model plane completely on microwave power converted to electricity to operate it’s electric motor driven propeller. \\nYou may want to watch this interesting but effective demonstration, \\n[u][b] Government terrorists can create earthquakes GOVERNMENT TRANSCRIPT IN INFO [/b][/u] \\nhttp://www.youtube.com/watch?v=x_ZlGLccC9E \\nH.A.A.R.P. \\nBy Michel Chossudovsky – Professor of Economics, University of Ottawa and TFF associate, author of The Globalization of Poverty, second edition, Common Courage Press \\nOTHER CONSIDERATIONS: \\n“Extremely Low Frequency Modulation of Microwave Emissions” \\nIt is completely feasible and possible to modulate a microwave frequency by means of Amplitude Modulation (AM), Frequency Modulation (FM), Phase Shift Keying (PSK), Frequency Division Multiplexing (FDM), as well as other transmission modes, as to generate an EXTREMELY LOW FREQUENCY wave resultant, with a COMBINED POWER of both the Microwave and Extremely Low Frequency, each frequency with its own unique characteristics and combined characteristics of both frequencies. \\nFor years now EXTREMELY LOW FREQUENCY radio transmissions were used to communicate with submerged submarines, because of ELF’s ability to be transmitted deep in to the waters of the ocean just like sound waves can be transmitted through water. \\nJust the same as in water, EXTREMELY LOW FREQUENCY radio waves can be easily transmitted below ground level and are used for below ground “Radar Imagining ” , Deep ground penetrating metal detectors, both which operate on low power levels. The higher the power levels the deeper underground it goes before being absorbed within the earth’s layers. \\nEXTREMELY LOW FREQUENCY radio waves are within the frequency range of Audible Sound waves, and just as sound waves at higher power or decibel levels can shake and vibrate whatever they encounter, the same holds true with Extremely Low Frequency radio waves. \\nFACTS: \\nNormal brain waves all fall under the Extremely Low Frequency range: \\nThe EEG is typically described in terms of (1) rhythmic activity and (2) transients. The rhythmic activity is divided into bands by frequency. To some degree, these frequency bands are a matter of nomenclature (i.e., any rhythmic activity between 8–12 Hz can be described as \"alpha\"), but these designations arose because rhythmic activity within a certain frequency range was noted to have a certain distribution over the scalp or a certain biological significance. Frequency bands are usually extracted using spectral methods (for instance Welch) as implemented for instance in freely available EEG software such as EEGLAB. \\nMost of the cerebral signal observed in the scalp EEG falls in the range of 1–20 Hz (activity below or above this range is likely to be artefactual, under standard clinical recording techniques). \\nBoth Extremely Low Frequency and Microwave, Radio Wave Transmissions have been admittingly linked mind control. \\nMICROWAVE MIND CONTROL'"}, "time": 1742628540.3744426}