{"duration": 0.0519251823425293, "input_args": {"text": "'Thursday, 10 November 2016 Don\\'t ask me how I did it. \\nHe said it would be rigged. He blatantly announced that the presidential election would be rigged. The squirrels supporting his presidential election promised the election would be rigged. \\nThey would have poll monitors at various neighborhoods to police the possibility, and the various neighborhoods were in the predominately black areas of the country. Granted, he has questionable integrity, but why is no one taking him at his word? \\nDid Trump rig the election? \\n\"We must support our new president,\" Hillary Clinton patriotically announced in her concession speech. \\nHold it. Back up a couple of weeks. \\nRemember when the KGB was hacking into the Democratic National Committee, and Wiki-leaks published over 300 emails from John Podesta\\'s computer? Seventeen US national security agencies announced that the hacking was traced to Russia. The former head of the KGB, Vladimir Putin, also had announced he was supporting Trump. \\nThen there was the Director of the FBI, James Comey\\'s fiasco. First Hillary was guilty of original sin! Ten days later, in a perfect example of a Governor Rick Perry \\'whoops\\', James Comey announced, \"There is nothing there, there!\" \\nSo there! \\nBack up again. Wringing his hands, Comey feared that mutinous members of the FBI were about to reveal new evidence against Hillary Clinton found in Anthony Weiner\\'s computer. Weiner is the estranged husband of Huma Abedin, Hillary Clinton\\'s chief of staff. \\nLong story to short: the new evidence was suggested in a book, Clinton Cash , written by Breitbart News senior editor-at-large Peter Schweizer. Breitbart News is a conservative website and the executive chairman, Stephan Bannon, is also the chief executive of the Donald Trump campaign. \\nThe dots are easy to connect: the smear campaign, drop in polls, catch up game and the votes were cast. \\n\"This election is going to be rigged.\" \\nHillary Clinton never regained the advantage she had before the Comey fiasco. The down ballot was definitely compromised. \\nQuoting someone from Wisconsin. \"Wisconsin went for Trump and we don\\'t know how that happened. At least she got the popular vote.\" \\nThe election was rigged. He said it would be. This time, believe him. \\nRead more by this author:'"}, "time": 1742561884.7558303}