{"duration": 1.520348072052002, "input_args": {"text": "'TEL AVIV  —   Radio talk show star Mark Levin slammed President Donald Trump for playing “footsie” with “known terrorist” Palestinian Authority President Mahmoud Abbas, saying, “This is turning into Obama 2. 0. ”[On his program on Monday, Levin also criticized Trump for seemingly being on the road to backtracking on his campaign promise to move the U. S. embassy in Israel to Jerusalem.  Listen below: “Why is the president of the United States playing footsie with Abbas, who is a known terrorist?” Levin asked. “Abbas dresses nicely, he comes to the U. S. and he makes what people consider reasonable demands and then when he goes back, the [PA] continue[s] to fund terrorism, they continue to encourage their children in elementary schools  —   and even in preschool  —   to become suicide bombers. I’m not even talking about Hamas, I’m talking about Fatah  —   the moderates!” Abbas, who Levin notes received his PhD for a thesis denying the Holocaust, is a “gruesome, loathsome, genocidal maniac who is treated as if he’s some kind of statesman. ” Trump met with Abbas on May 3 in Washington and is due to meet him again next week in Bethlehem during his visit to Israel. According to Levin, Trump “may not be informed” and instead has been placing his trust in people like Secretary of State Rex Tillerson and “military bureaucrat” H. R. McMaster, Trump’s national security advisor, both of whom, Levin argued, are “pushing the agenda” that a two state solution is still possible. Levin said, “So quickly and easily has the president of the United States fallen into the lap of the leftists, of the bureaucrats, of the State Department, of the swamp. ” Moroever, Levin said, despite Trump’s “vigorous and unequivocal” campaign pledge to move the U. S. embassy from Tel Aviv to Jerusalem, he now appears to be “betraying that promise. ” “Why did the president say he would move our embassy to Jerusalem when he didn’t mean it?” he asked. Levin referred to Tillerson’s remarks to NBC’s Meet the Press  —   an interview the radio host said was “an abomination”  —   in which the secretary of state said the impact of an embassy move on a future peace deal was being considered and the president “was listening to input from all interested parties. ” “What is the president’s obsession now with a peace negotiation? Where did this come from? In many respects a two state solution for Israel is a final solution for Israel,” Levin said. Later on the show, Levin lambasted Tillerson for using the phrase “Israel and Palestine” when the latter does not yet exist, saying Tillerson “has just given the Palestinians, effectively, a country. ” “I am stunned. I am shocked at how quickly the president of the United States reversed course and appears to have sold out. “I hope I’m wrong. I hope I’m wrong. Nothing effectively has been done yet, but this is really quite shocking to me. ”'"}, "time": 1742563770.8035414}