{"duration": 0.02208566665649414, "input_args": {"text": "'The New York Times offered a revisionist history of the ongoing crisis at Evergreen State College in Washington on Saturday, ignoring   violence and smearing liberal professor Bret Weinstein (above) who is a victim of the chaos. [The Times‘ Anemona Hartocollis reported that the college “had to hold its commencement 30 miles from campus, at a rented baseball stadium where everyone had to pass through metal detectors. ”  Her explanation of why that came to pass suggests conservative media are to blame for stirring up threats from outside the campus, and totally ignores the violent role of   activists on campus, some of whom have been “patrolling” campus with baseball bats. She ignored critical details in the story, such as the fact that campus police told Weinstein they could not protect him. Hartocollis also sided with critics of professor Weinstein, who supported black students’ efforts to draw attention to racial issues but refused to obey when they told white professors and students not to come to campus. She quoted a professor who is angry that he shared his dispute with the outside press: “That he took this public I just feel like is a breach of trust. ” Hartocollis also suggested Weinstein is acting out of greed, noting that he has a “new blog offering his subscribers insights into ‘evolution, civilization and intolerance‘ for a nominal monthly fee” [original link]. Moreover, she did not quote any of Weinstein’s supporters, but supplied a quote from a parent whose daughter is opposed to him: Ellis Paguirigan, a 1991 Evergreen graduate whose daughter, Melia, was graduating and planned to go into ocean conservation, said they were both disappointed in Professor Weinstein’s stance. Melia had Professor Weinstein in her freshman year and liked his class, Mr. Paguirigan said. But, he added, “my daughter is a person of color  —   she kind of takes it personal. ” The implication is that Weinstein is racist  —   exactly the false charge lobbed by the campus mob. The Times has featured at least one   criticizing the left’s behavior at Evergreen. However, its news coverage of the latest developments is a sign of where the paper’s true sympathies lie. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628447.3760374}