{"duration": 1.4540090560913086, "input_args": {"text": "\"Written by Mark Almond   The sudden resignation of Mikheil Saakashvili as Governor of Odessa and his accompanying tirade of accusations of corruption and treason against the Ukrainian President, Petro Poroshenko and his coterie in Kiev came as a bombshell for the Western media on 7th November. But it was a strangely bland bombshell. Yes, the voices of the West - the BBC, CNN, the New York Times, Wall St. Journal, Radio Free Europe/Radio Liberty – mentioned that the former Georgian President, who had been brought in to combat corruption in Ukraine’s key port and one of its major Russian-speaking cities, had resigned, even that he criticised his patron and old university chum, Poroshenko, for being on the take. But the reportage has been strangely opaque. Remember both Saakashvili and Poroshenko had been routinely characterised as the epitome of anti-corruption campaigners by Western neo-con voices whose echo-chamber is the supposedly liberal media, CNN, NBC in the USA and BBC and Channel Four News in the UK. No mention of Poroshenko’s past service to the “notoriously corrupt” regimes in Ukraine before 2014 is permitted, nor reference to his alleged business dealings with pariahs like Iran before he came on board for the regime-change of the decade in February, 2014. As for the reality that to most Georgians their ex-president, President, Mikheil Saakashvili, was the personification of a brutal, loud-mouthed demagogue that too was passed over in silence by those who boast that “they tell truth to power” from the editorial suites of Western newsrooms and newspapers. Saakashvili’s own people remember how it was exactly nine years ago on 7th November, 2007, that his Western equipped para-military police smashed demonstrations against him in Tbilisi with a mixture of high-tech ultra-low frequency disorientation weapons and swagger sticks and jackboots. The anniversary of Lenin’s seizure of power ninety-nine years ago has strange fascination for Saakashvili as his day for decisive coups. After his fall from power in Georgia four years ago, Saakashvili had become a kind of post-Communist Flying Dutchman albeit inverted. Abandoned by his Dutch wife after revelations of the crudest kind of tax-payer-funded infidelities, he roamed the West trying to find sanctuary. Even the USA quietly but firmly denied him a haven as revelations that underneath his glass-fronted police stations – much-vaunted in the Guardian and Transitions online as model reforms - secret dungeons housed torture and sexual abuse against his opponents have shattered his reputation at home and were known to insiders abroad. Saakashvili has of course embarrassed his US sponsors before by launching unilateral action without consulting them and getting full permission in advance. Remember how in August, 2008, he thought he could overrun South Ossetia before Russia could react and would earn the plaudits of the neo-cons in the West for his “courageous leadership”. Instead, he provoked a Russian backlash and the disintegration of his army. In a grand strategy worthy of Mussolini’s placement of his best troops in Ethiopia before invading Greece and Libya with badly equipped conscripts, Saakashvili had sent his 6,000 US-trained troops to do garrison duty in Iraq for his American sponsors when he decided to provoke Russia in 2008. The worthless adventure shattered Saakashvili’s value to the West less than a year after it had ignored his brutal suppression of opposition and had endorsed yet another rigged presidential election in his favour. Ousted by even some of his ex-cronies after 2012, it was his old university contemporary, Petro Poroshenko, who threw a lifeline to the ex-Georgian President and a slew of his ex-enforcers from Georgia. Rather as the old Soviet Communist Party had deployed loyal apparatchiks from outside each republic to enforce the Kremlin’s will on the multi-ethnic population of the USSR, so Washington now backed a strategy of parachuting outsiders from other ex-Soviet republics and of course the children of Nazi-era emigres from Ukraine itself into key positions to control the Ukrainian people themselves in case they took it into their heads to take democracy seriously. The Americans often overlooked the internal contradictions of this parody of Comintern tactics. Saakashvili was notoriously anti-Armenian in power in Georgia, when he bulldozed scores of ancient Armenian buildings in Tbilisi to make way for his Reichstag-look-alike presidential palace. So it wasn’t by chance that he got into a brawl with the ethnic Armenian interior minister of “independent” Ukraine last year. Saakashvili’s arrival in largely-Russian-speaking Odesa was a red rag to the locals. They resisted his attempt to massage local elections in favour of his preferred candidates for mayor and so on as he had done back home in Georgia. He denounced the opposition as corrupt but at best this was the pot calling the kettle black. Saakashvili’s own tarnished reputation went before him across the Black Sea even if seminars in Oxford or Harvard took his credentials as “Mr Clean” at face value. Now his wrestling match with the Ukrainian mafia and his attempt to impose his own Georgian clan in Odessa has come into the open. The publication of the Panama Papers was supposed to tarnish Vladimir Putin but in reality the dirt spewed out of Poroshenko for his murky Caribbean cash pile. Just as the revelation of David Cameron’s family ties to offshore accounts fatally undermined his standing in the run-up to the Brexit referendum. Poroshenko’s claims to represent Westernization for Ukraine were not without an ironic plausibility. Then to compound Poroshenko’s credibility gap as an anti-corruption campaigner, an MP of Soros-sponsored Afghan Communist background got a bill passed with American backing requiring politicians and officials to publish declarations of their wealth. The published amounts commonly enraged ordinary, poverty-stricken Ukrainians even if they were often a shadow of the real wealth stashed away by the representatives of the people. Having come to power by decrying Viktor Yanukovich’s alleged “orgy of corruption”, the Poroshenko crew looked odiously bloated with inexplicable wealth. Into the scandal stepped the unpopular, alien governor Odessa. Despite being appointed by the President, Saakashvili chose to denounce him personally for betraying the Ukrainian people, Western values and the anti-mafia crusade which Saakashvili claimed to personify. Western media express surprise at the ferocity of Saakashvili’s attacks on the integrity of his old university friend, Poroshenko, who had rescued him from exile and given him his new lease of political life in Odessa. Don’t these hacks remember how Saakashvili had been raised up by Georgia’s Eduard Shevardnadze, who became godfather to his protégé’s son, Eduard, while he was Minister of [In]Justice in that cruelly corrupt regime, before Saakashvili turned on his patron and ousted him in the so-called “Rose Revolution” in November, 2003? Now thirteen unlucky years later, Saakashvili has bitten the hand that fed him in Ukraine. Part of the Western media’s amnesia is of course that until yesterday both Saakashvili and Poroshenko were portrayed as model reformers, anti-corruption campaigners and so on. Suddenly, one paragon of civic virtue smears the other. CNN, BBC and Wall St. Journal can’t compute it. Clearly, no-one in the Central Information Agency had distributed the script in advance of this crisis – so unlike the well-signalled abandonment of a Western darling like Shevardnadze in 2003 or the preparations for the Maidan uprising in 2013-14. Then of course, the Amanpours et al. were on hand with the moniker and mood music to encapsulate the propaganda line. Yesterday’s hero was now a villain but forget about Shevardnadze or Kuchma, here comes an English-speaking motor-mouth spewing out all the New World Order guff about civil society, anti-corruption and, of course, Russophobia. The Saakashvili-Porodshenko spat not only casts a garish light on the sleazy reality of Western-backed regime change on either side of the Black Sea – Georgia as well as Ukraine – but more importantly it illustrates the dangerous tailspin into which the casual promotion of corrupt and unstable post-Soviet politicians as paragons of civic virtue has plunged Western policy in Eastern Europe. The recent uptick in sabre-rattling by NATO reflects the bankruptcy of the political options promoted by the Euro-Atlantic regime-changers. Having toppled and re-toppled post-Communist regimes, promoting and then pulling down successive corrupt and brutal “heroes of the street”, the West now faces the grim reality that its reputation is as tarnished by this sleazy process as much as its former local heroes. Maybe one of the youthful Najibullahs of Kiev will be pushed to fill the void. But don’t underrate the ability of Ukraine’s oligarchs to navigate the storms of post-Communist politics and never ending flow of embarrassing revelations of hypocrisy and corruption which the Dnieper can never wash away. Saakashvili has declared war in a most Hobbesian environment on the most powerful and odious characters in the country. Above all, he has denigrated the President of Ukraine himself whose authority cannot survive allowing his former protégé to abuse him with impunity. This cannot end well for both men. No-one should be surprised if Saakashvili and Poroshenko are suddenly reconciled, but any embrace of these two old comrades from the Komsomol can only follow Lenin’s dictum: put your arms around the enemy’s shoulders so you get your hands closer to his throat. Saakashvili may be counting on the Americans to save his bacon. He seems to have forgotten what President Sarkozy told him in August, 2008: “The Seventh Cavalry is not coming over the hill to rescue you.” Ultimately, even the global nation par excellence does not believe that a Georgian political clan can takeover Ukraine and rule it for Washington against the will of the Ukraine’s own mafias. Saakashvili’s impulsive detonation of this crisis might lead other Ukrainians to pose as champions of probity against Poroshenko, but the West’s international brigade of reformers who failed at home sent in to transform Ukraine have had their day. Some slink back home to the Baltic States or Chicago, but Saakashvili has no homeland anymore. With his Georgian citizenship revoked, and Tbilisi demanding his extradition for a host of alleged crimes in office from 2003 until 2012, Saakashvili has few places to run to. Remember the USA wouldn’t give him permanent residence which was why he jumped at the chance to serve Poroshenko’s bogus anti-corruption but very real anti-Russian drive in Odessa. With the boss-of-bosses’ backing in Kiev, Saakashvili could find himself facing extradition back to Georgia – or even to Russia which accused him of genocide for killing so many civilians in his madcap invasion of South Ossetia in August, 2008. The West can afford to throw away Saakashvili. Poroshenko and his prime minister, Groysman – godson of Poroshenko’s father – have been Washington’s key allies in Kiev. If they were to fall, or, if fearing Washington was about to push them, they jumped ship back to their old comrades in Moscow, the neo-cons’ house of cards in Eastern Europe could collapse. Maybe the strange silence of the West’s normally vocal media analysts about Saakashvili’s bombshell reflects their bewilderment that the best-laid plans for domination in the East are beginning to crumble like one of the stale cookies handed out in Kiev by that pin-up for regime-change, Victoria Neuland. After all the hullaballoo about Donald Trump being the cat’s paw of pro-Russian interests who had backed Viktor Yanukovich in the swirling crisis in Ukraine three years ago, that none of the hacks decrying his “hidden Kremlin links” have explained how Saaki and Porky Poroshenko fell out so spectacularly or what it means for Western grand strategy. Their silence is very revealing. Even Google’s Orwellian approach to news-management has rarely been so crude: the story was a bombshell, headlined with “live updates” – but not anymore. Amnesia not analysis is increasingly the Western media elite’s response to the crisis besetting its most cherished policies. Does this silence imply retreat or will the West lash out after Tuesday’s US Presidential election? Maybe Saakashvili’s tantrum will set the Seventh Cavalry in motion, not to rescue him today any more than in 2008, but to mask the failure of regime-change with open war in the East. Now that is something the Western media has been talking about a lot recently. Reprinted with permission from author's website . Related\""}, "time": 1742562420.3835022}