{"duration": 0.04896402359008789, "input_args": {"text": "'By Hrafnkell Haraldsson on Sat, Oct 29th, 2016 at 8:41 pm \"That fog that’s on Christians is the collective witchcraft that comes over the Body of Christ because there’s spirits being authorized to be released\"   \\nComing from people who believe in something called “spiritual warfare”– a nebulous spiritual struggle taking place over and above all the talk about issues and policy positions – it is perhaps no surprise that the Religious Right should declare that their messiah – Donald Trump – is being threatened with witchcraft. \\nLance Wallnau, whose Twitter page claims to be “Your Spiritual Warfare Guide to the 2016 Election,” appeared on “The Jim Bakker Show” to push the crazy idea that “many Christians feel this fog on their head at times” and “that fog that’s on Christians is the collective witchcraft that comes over the Body of Christ because there’s spirits being authorized to be released.” \\nWatch courtesy of Right Wing Watch: \\nOh sweet baby Jesus, the mighty Lance has struck out. What has happened, of course, is that the Religious Right not only endorsed but anointed a candidate who embodies the exact opposite of the values they claim to champion. It’s no wonder they feel in a fog . Metaphorically or physically, they’re selling their souls. \\nWallnau claims “The left is a smaller number of radicals better organized than the larger body of Christ who doesn’t work together,” and “That’s the dilemma that America’s in right now,” even though the left is a disparate alliance of various groups working together and the Religious Right has been organizing since Goldwater lost in ’64 . \\nA hypocrite just can’t catch a break, it seems: \\nThe web literally is coming down on America. And what’s sad is, how many Christians feel this fog on their head at times? Do you feel that? It’s almost like everything’s going wrong. We don’t realize it’s a remnant operating strategically through organizations that are intent on shifting the American culture and discipling the country. And that fog that’s on Christians is the collective witchcraft that comes over the Body of Christ because there’s spirits being authorized to be released. \\nWherever there’s agreement, there’s power. The more unbelievers agree with the narrative that they’re hearing, the more power and authorization Satan has to manifest. So unless the church has an exposure of what the enemy’s doing and begins to agree together with a counter-strategy, we’re going to deal with more and more fog. And the worst part is—we don’t have to surrender nations to the devil. \\nSo if you disagree with Wallnau, if you oppose Trump, it can only because you’re manifesting the power of Satan (who in the Old Testament is God’s lieutenant, not his adversary). So pick your Testament, I suppose. \\nLance Wallnau insists he is “not a big conspiracy theorist buff,” but this doesn’t do anything to convince us he’s not some wack-a-doodle instead. This is nothing new, as a non-Christian being told that you represent a “devil” you don’t even believe exists. \\nThere are 2,000 years of history backing up the accusation and testifying to its usefulness for religious zealots hoping to delegitimize (or worse) their opponents. \\nWithout charges of Satanism and witchcraft, you don’t have the genocide of European and Middle Eastern Paganism; you don’t have anti-Jewish pogroms; and you don’t have the Crusades or the Spanish Inquisition; you don’t have witch-burnings. \\nWhat this sort of nonsense illustrates for liberals and progressives is that we’re not fighting on the same battleground as our opponents. \\nNot only do they deal in a conspiracy-laden world, a world free of facts, but a world in which what might be hiding under your bed or in your closet has real power and reason – and let’s go ahead and say sanity – do not. \\nLet’s face it: Donald Trump’s biggest enemy is not Satan, but Donald Trump himself. And Wallnau can claim “believers have an edge” all they want, but all the belief in the world won’t overturn reality.'"}, "time": 1742628530.4890778}