{"duration": 0.12473249435424805, "input_args": {"text": "'What times these are for “work”! It’s the title of a song that Rihanna and Drake have made pretty much 2016’s best single, and the partial title of another that Fifth Harmony’s made one of the year’s naughtiest. The entire Beyoncé “Lemonade” experience involves the work of marriage and black womanhood. But no musician’s been more literal about the work he’s doing than Frank Ocean. “Work” because, late last month, he ended four years of obscurity with maximal creative output: new songs, a glossy   magazine, one   music video, one   music    tutorial, and four superbly   bodegas in four cities. Compliments of Mr. Ocean, the stores gave out the magazine and a CD, whose music was available for download exclusively through Apple and only as a single,   entity formerly known as an album. The most instructive piece of Mr. Ocean’s data dump is that 45 minutes. Packaged as a curio called “Endless,” it stars assorted Mr. Oceans (three of him) wearing sweats and sweaters, sending planks of wood through a table saw as airy, new, sporadically inviting music inhabits the soundtrack. It celebrates the making of something. By hand. In a sense, he’s just crafting. He’s also crafting mystique. Were he a different artist, Mr. Ocean might have made a perfunctory appearance at the Video Music Awards on Sunday, if only to say: “Hey  —   I’ve got this album. Here’s a song from it,” the way Kanye West used his slot for the premiere of a new video. But “Endless” proves that’s not what he’s about. The showmanship of the V. M. A.s seems beside Mr. Ocean’s point. The   of his peers illuminates his indifference to it. Mr. Ocean is   it’s “Endless” because the work never ends. Mr. Ocean presents himself not as an artist, per se, but as an art student, a hermit laboring in a business that runs on extroversion. As much I might like to see him do a lap of Carpool Karaoke, I’m not going to hold my breath. In this era of meticulous   his apparent apartness feels like something to celebrate. Sure, the randomness of the magazine’s content and the vague, plaintive earnestness of some lyrics are more unfashionably adolescent  —   more Tumblr  —   than you’d want from a   . But his     melancholy is a draw. He’s got the No. 1 album in the country, much to the bafflement of a music industry used to artists who want what it wants. He’s both giving away and selling  —   and selling himself sparingly, decorously. Looks like him, shirtless and wet, on the cover of the new record, “Blonde” (spelled “Blond” on the cover). His head’s down, his face behind his hand, his hair a Joker shade of green. Maybe he’s cracking up maybe he’s breaking down. He spends “Endless” in long shots and a few   toiling alongside those clones of himself. Shrunk down to smartphone size, however, the black and white render him a mere design element. It isn’t just that you can’t see him much. You can’t always hear his natural voice, either. Technology on “Blonde” distorts his singing, and usually that’s alluring  —   like David Bowie in one of his alien phases. But it also sounds like   as on “Nikes,” the album’s opening song. In the glittered short video, he sits outside in front of a car, his eyes rimmed in makeup. Elsewhere, he’s lying on the ground in different jump suits  —   one white and   one black and ablaze, eventually being extinguished. He’s human on the one hand, extraterrestrial on the other  —   the burning man who fell to earth. Who knows what this sense of alienation and the attraction to obscurity mean? It’s not Mr. Ocean’s duty to explain. But some of the breathless anticipation for new Ocean music has everything to do with the singular position he occupies. His coming out, in 2012, as a man who likes men, made him queer. And in the hetero, “no homo” realms of     RB and even pop, that admission made him an outlier. It’s also made us desperate to know his next moves: How does a major queer artist stay major? Homosexuality might be normal in this country. But a gay, black, male pop star is treated like an oracle, despite nothing in his discography bespeaking the oracular. It hasn’t been just music we needed from him. Unfairly or not, it’s been symbolism. What’s notable about this new music is how guarded it is, against meaning too much and meeting too many expectations. You can hear pain, confusion, curiosity, dispassion, anomie, defensiveness and need, feelings that were present on his magnificent previous album, from 2012, “Channel Orange. ” But there he housed feelings and moods within somewhat traditional song structures. He built songs around those feelings. The approach on “Blonde” and in “Endless” is deconstructionist. The best song on “Endless” doesn’t even belong to him. It’s a dreamy   position paper called “Device Control,” by the photographer Wolfgang Tillmans. Emotionally, Mr. Ocean finds loneliness instead of redemption, expressed in spare guitars, keyboards, static, noise and outsourced exasperation. For now, other people seem more interesting to him. This year is the 25th anniversary of “Truth or Dare,” Madonna’s landmark authorized peep show into her touring life. It’s still revealing layers of its star. “Endless” and “Blonde” reject that kind of disclosure. For instance, we don’t know the names of the people who’ve headlined Mr. Ocean’s hurt. He’s not Taylor Swift. He hasn’t made his “Lemonade. ” He doesn’t believe in blind news items. He believes in blinds. These are projects that prize process over persona. Unlike Beyoncé, he didn’t wake up like this. Unlike Beyoncé, he offers carpentry that’s literal: Mr. Ocean is grainin’ on actual wood. He’s all work, no play. And artistically, it makes Frank a dull guy. (Isn’t it worth noting that, in 2013, he lost the best new artist Grammy to the band Fun?) That processing is in the music: the minimalism the rejection of   pop the Sonic Youth, Radiohead and Arthur Russell the creative ranginess of Mr. West. If kicky new songs like “Ivy,” “Nights” and “ ” let you think he was headed toward Stevie Wonder, Prince or even Bill Withers: Oops. Mr. Ocean appears to be trying out an aesthetic and, for now, that aesthetic appears to be excessive asceticism. A denial, a denial, a denial. He didn’t invent idiosyncratic independence. He’s just dramatizing it. That makes the   gap between now and “Channel Orange” significant. He’s been exploring vocations. What he’s creating in “Endless” turns out to be a set of stairs. So, really, he’s making a statement  —   first about ascendance (he’s building his way up and out) then about effort: He’s doing it all himself, metaphorically declaring his independence. The steps he’s built aren’t just any steps. They’re like the golden spiral staircase, steps that, mathematically speaking and from a bird’  view, carry the climber farther away from the central axis of origin at a particularly pleasing rate. Mr. Ocean has willed himself from RB curio to major pop star to art student. That might sound like a regression, and musically, maybe so. The songs, the magazine, the stores that gave them away feel like final projects. Obviously, he’s released his first new work in a long time. But you could also say he’s arrived at a different milestone: graduation.'"}, "time": 1742563280.476095}