{"duration": 0.12252688407897949, "input_args": {"text": "'By the end of this week, all blood banks in the continental United States must begin testing donated blood for contamination with the Zika virus. Many banks are doing so already, and the early results indicate that the country has dodged a bullet  —   for now. Screenings in a dozen states suggest that Zika infection remains exceedingly rare. Among the approximately 800, 000 blood donations tested in the past six months or so, about 40 were initially positive for the virus. “It is good news that we are avoiding the transmission of Zika,” said Dr. Susan Rossmann, the chief medical officer at Gulf Coast Regional Blood Center in Houston. Still, she noted, it may not be surprising there are so few possibly positive cases, because blood banks have been dissuading people from donating if they recently traveled to an area in which the virus is circulating. Blood donation screening for Zika is performed with tests made by Roche Molecular Systems or by a collaboration between two medical companies, Hologic Inc. and Grifols. The screening effort is regulated as two gigantic clinical trials in which every blood donor is enrolled as a participant. All the results, therefore, are reported to the companies. By Friday, Roche’s machines had screened 475, 000 donations in the United States, excluding Puerto Rico. Just 25 have been “initially reactive” for Zika infection, said Tony Hardiman, who leads the company’s blood screening program. “Compared to Puerto Rico, it’s tiny,” he said. Roughly 1 percent of the blood donors in Puerto Rico were infected by July, with 1. 8 percent of them testing initially positive in the last week of surveillance, according to the Centers for Disease Control and Prevention. By   roughly 348, 000 donations had been screened using the test made by Hologic Inc. and Grifols. Fourteen were initially positive for the Zika virus. It may be that not all of these samples are truly contaminated. The technology is still in development, and the manufacturers are scrambling to confirm their results with further investigations of the donors. Of three donors examined by Hologic and Grifols, all seem to have been infected outside the United States. One donor gave blood at United Blood Services in Reno, Nev. after visiting Nicaragua. Another, a New Yorker, had been to Trinidad. The third lives in Arizona and had visited Mexico. All three donors had minute traces of the Zika virus in their blood, detected between 41 and 97 days after travel abroad, Jeffrey Linnen, an associate vice president at Hologic, told attendees at a recent conference for AABB, the   group for most blood banks nationwide. Viral material detected after 40 days is unlikely to be live virus, said Dr. David O. Freedman, an infectious disease specialist at the University of Alabama at Birmingham. “The farther along you are after infection, the more likely you are just detecting residual breakdown products from dead virus pieces that are still circulating,” he said. In August, the Food and Drug Administration required all blood banks to screen each of the millions of blood donations collected annually for Zika. Eleven states in   areas had to put in the new safeguards in a month. The rest must do so by Friday. At the time, experts feared that   mosquitoes would begin turning up in states along the Gulf Coast, prompting outbreaks like those seen in South America and threatening the nation’s supply of donated blood. Universal screening was necessary to avoid transmission of the Zika virus in donated blood, particularly to pregnant women. If exposed to the virus in utero, fetuses can have brain damage, visual and joint problems, and muscle tone so rigid it restricts movement. Florida is the only state with documented local transmission of the virus. In July, the F. D. A. temporarily halted collection of blood donations in   and Broward Counties until screening for the Zika virus could be put in place. Blood banks perform the screenings themselves or, more often, pay a laboratory to insure donations are  . The additional costs are passed on to hospitals. The range is from $6 to $10 a unit, Dr. Rossmann said. “It’s not inconsiderable, that’s for sure. ” One 2011 survey found that hospitals paid $210 on average for a unit of red blood cells, after screening for pathogens. The cost of blood is increasing, the researchers also concluded. “The F. D. A. requirement made it pretty clear that we don’t have much of a choice, and the hospitals don’t have much of a choice,” Dr. Rossmann said. Meeting the deadlines has been a monumental task for blood banks. Introducing a new test to screen donations usually takes six to 12 months. The F. D. A. ’s timeline was just one month for blood banks in Florida and 11 other states thought to be at high risk for Zika outbreaks, and three months for those in 38 other states. “It was extremely painful, extremely expensive,” said Phillip Williamson, the vice president for operations and scientific affairs at Creative Testing Solutions. “This was an unfunded mandate from our government. ” Rhode Island Blood Center, for example, acquired two new machines to screen 153, 000 annual donations and trained 17 employees to load blood samples and run the automated testing around the clock. “We’ve been scrambling to get ready,” said Dr. Carolyn Young, the chief medical officer. In the coming months, the main threat to the blood supply will be the roughly 4, 000 travelers infected with the Zika virus while abroad. Most do not have symptoms. Dr. Lyle Petersen, the director of the division of   diseases at the C. D. C. has called the number of travel cases in the continental states “extraordinary. ” The fear is not that they will all seek to donate blood, but that they will serve as vectors by which the Zika virus will spread in the population, even when the mosquitoes that carry the infection are not present. Sexual transmission is the likeliest route. “When people come back from trips, they generally have sex pretty soon,” Dr. Petersen recently told a packed room at an annual conference for blood transfusion experts. In all cases the C. D. C. has studied, he said, “transmission from infected travelers to their nontraveler partners has occurred within 20 days of the first sexual contact. ” Recently infected travelers have higher levels of Zika in their blood, semen and other bodily fluids, and are probably more infectious. Blood banks had been asking donors about their travel history and that of their sexual partners, and then asking them to postpone donating for at least a month. To prove that their new tests work reliably enough to be licensed, Hologic, Grifols and Roche may need to enroll millions of participants in their continuing trials. Roughly seven million people give blood annually Creative Testing Solutions screens about a third of them. “We have to sign up every one of those people for a clinical trial,” Dr. Williamson said. While the nonprofit can handle the burden, he added, “I’m sure a lot of places out there are struggling as the result of the aggressive implementation guidelines mandated by F. D. A. ” Still, most experts agree that universal screening is costly but necessary if the country wishes to avoid even a single instance in which a child is   because of a transfusion of contaminated blood. The Community Blood Bank of Northwest Pennsylvania and Western New York, based in Erie, Pa. has been drawing extra tubes of blood from donors to fly overnight to a Houston laboratory for Zika screening at $6 to $10 a sample. “Compared to the overall cost of health care,” said Scott Greenwell, the executive director of the blood bank, “this is spit in the ocean. ”'"}, "time": 1742562141.1688}