{"duration": 0.10052084922790527, "input_args": {"text": "'Breitbart News Senior Editor MILO claimed that “  educated doesn’t mean stupid,” during his talk at the University of Colorado Colorado Springs tonight, adding that a majority of his   educated employees are “some of the smartest and most successful people. ”[  “Let’s be clear about what the left lost. The white working class turned against the Democrat party in a historic fashion during this election. The numbers are stunning, even to someone as stunning as me,” MILO proclaimed. “I’m not a dataporn kind of faggot like those   losers at the Guardian and the spectacularly dreadful FiveThirtyEight, but I have to share a few of the key stats from Pew Research with you. ” “  whites voted for Donald Trump by a 4% margin. This is similar to how they voted for Mitt Romney,” he continued. “That is a bit embarrassing to be honest, but we have to admit that those goofy #NeverTrump people are all college eggheads. Proof that college can make you dumber. ” “But the numbers for those that didn’t graduate college are amazing. A 39% margin for Trump! These are the deplorables, ladies and gentlemen, just as much as the hip millennials posting Pepe on Twitter,” explained MILO. “Let’s be clear about one thing.   educated doesn’t mean stupid. It means you wisely chose not to pay $40, 000 a year to be lectured on microaggressions. Some of the smartest and most successful people in history have been either college dropouts, like me, or people who never attended at all, like a lot of my crew on this tour. ” MILO continued to claim that “They are smarter  —   and so am I  —   than 90 per cent of the people in this room. ” “They’re already more successful and they already have more enjoyable jobs and have more political and cultural influence than most of the people in this room. No offense!” he added. “But my point is that ‘  educated’ isn’t a synonym for dumb redneck or idiot. A good 50 per cent of the most successful people I know didn’t get a university degree. ” “The split among all voters is also amazing. All college graduates went to Hillary by a 9% margin, while all people without degrees went to Trump by 8%. We haven’t seen this kind of gap since 1980,” stated MILO. “So rather than smart versus dumb, try to think of this split in cultural terms. When we look at the way counties voted in battleground states, it is a similar story. Trump won Wisconsin by taking 10 counties that typically go Democrat. ” “Kenosha County has been Democrat since 1972, but it went to Trump. Similar stories and countries exist in every state,” MILO explained. “The evidence very clearly shows the left lost the white working class. ” Written from prepared remarks. MILO wears glasses by Givenchy, $350. Distressed blue jeans by True Religion, $329. Brown leather belt with gold buckle by Louis Vuitton, $450. Light pink dress shirt by Brooks Brothers, $92. Sparkly purple suit jacket by Angelino, $225. Burgundy crushed velvet slippers by Crockett  Jones, $370. Socks by Ralph Lauren, 3 pairs for $21. 98. Jewellery and pearls, too much money to count. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562784.749124}