{"duration": 0.030930280685424805, "input_args": {"text": "'Hillary’s DONE After Announcing Potential Cabinet Member, Try Not To Vomit Posted on November 1, 2016 by Robert Rich in Politics Share This \\nWith her numbers tanking, Hillary Clinton is desperate for any vote that she can get. Proving just that, she just floated an idea for a potential cabinet member, but it could actually end her once and for all. \\nAt this point, it’s clear that Hillary isn’t in control of her own campaign. If she was, she would have buried herself a long time ago. As we continue to get glimpses of her crooked behavior that she tries to keep behind the curtain, it doesn’t take too much of a genius to know that she doesn’t really have any good ideas of her own. Hillary Clinton \\nProving just that is a potential cabinet member she floated during an interview with Extra . As she didn’t have her strategists whispering in her ear at the time, telling her when to shut up and when to speak, she actually stated that she would love to have Michelle Obama as a part of her team . \\nMichelle Obama is a nobody outside of being married to a president. She’s been nothing more than a freeloader for the past 8 years who has done literally nothing but make the lives of the American people a living hell. Hillary Clinton and Michelle Obama \\nDespite Michelle’s failed legacies and lackadaisical tendencies, Hillary still thought that she would make a great addition to her team. Then again, both Hillary and Michelle have a taste for the finer things in life and enjoy the fruits of everyone else’s labor. \\nWhen directly asked if she would like Michelle in her cabinet, Hillary simply stated : \\n“She’s made it pretty clear she wants to focus on important issues like girls’ education around the world – she and I actually talked about it when we were together in Winston-Salem – and I want to be the best partner I can be for whenever she wants to be involved in government again.” \\nHowever, that wasn’t quite the end of the thought process as she next went against what President Barack Obama said in that Michelle wasn’t interested in the slightest when it came to furthering herself in the political realm. “I think she wants to take a break from it, but if she ever wants to do anything like that, I would be the number-one person,” Hillary said. “Well, I don’t know how anybody could have done what she’s done for the last eight years with more grace and more of a sense of purpose but inclusivity.” \\nHillary’s sentiments become laughable when she hints to the idea that Michelle actually did anything. Think long and hard about what she did and you’ll come up with nothing. Her lunch policy only left kids hungry and unsatisfied before failing overall when schools systematically began to reject her mandate. Michelle and Barack Obama \\nMaking sure girls are taught everywhere? Well, all we saw was Michelle flying around the globe and taking several vacations while demanding other countries change their ways. Beyond the fact that this does absolutely nothing for the American people (and actually hurts them on account of the cost associated with the several trips), it only ticked people off and made Americans look pretty stupid. \\nOf course, this would be a “smart” choice for Hillary seeing how blind leftists love and support Michelle for some reason. However, all it really equates to are a few more votes in her pocket as she panders to the audience of someone else. Basically, Hillary is trying to whore Michelle out. I wonder how she feels about that.'"}, "time": 1742628583.0154247}