{"duration": 0.016097545623779297, "input_args": {"text": "'Breitbart News reporter John Carney joined a panel of six establishment media journalists at the Columbia Journalism School to discuss the media’s role covering the Trump administration, including CNN’s media reporter Brian Stelter. [Stelter appeared aghast after Carney suggested that there was no reason for reporters to “panic” at the idea of a Donald Trump presidency.  Should Americans panic over @realDonaldTrump? Watch @carney and @brianstelter discuss  &gt pic. twitter.   —   Charlie Spiering (@charliespiering) March 3, 2017,  “I think that this is the best beginning of a presidency that I have experienced in my adult life,” Carney said, pointing out that Trump was delivering on his campaign promises. As an example, Carney pointed out that despite what cable news channels reported about Trump softening his position on immigration, he repeated his promise during his joint speech to Congress earlier in the week. “There’s not going to be a real wall,” Stelter protested. “This is what people say all the time,” Carney replied. “I believe there will be a real giant wall, and maybe it just got ten feet higher because he might have heard you say that. ” New York Times Washington Bureau Chief Elisabeth Bumiller boasted that they were increasing their staff of journalists in Washington D. C. to hold the administration accountable. “I think it’s extraordinary that the press sort of ‘woke up’ after Donald Trump’s election to a moment of clarity about its job,” Carney replied. “I think that is one of the things that actually people find alienating. ” Carney suggested that Trump’s worldview was fundamentally opposed to by many journalists who were tasked with covering the administration. “They can’t hear the word or phrase ‘economic nationalism’ without thinking that is bad. They come from, I would say, a globalist secularist point of view and the idea of a president who uses the phrase ‘America First’ strikes them as disturbing,” he said. Turning to the New York Times editor, Carney asked, “Do you think you have enough people who understand and sympathize with Trump’s worldview in your news organizations or do you think that you are predominantly staffed by people who view Trump’s view as not just wrong but probably also evil?” Bumiller shot back, “Do you have enough people in your news organization who disagree with Trump’s point of view?” During the panel, Carney explained why he moved to Breitbart News from the Wall Street Journal. “Breitbart is the most innovative and exciting source of journalism in America today,” he replied, referring to the familiar “entrepreneurial spirit” at Breitbart that he experienced when he helped create Business Insider. The   @carney on why he decided to join @BreitbartNews pic. twitter.   —   Charlie Spiering (@charliespiering) March 3, 2017, '"}, "time": 1742628601.0914443}