{"duration": 0.09830856323242188, "input_args": {"text": "'WASHINGTON  —   The Supreme Court on Wednesday seemed ready to side with Bob McDonnell, the former governor of Virginia who was convicted of public corruption and faces two years in prison. Justices across the ideological spectrum said the laws under which he had been convicted gave prosecutors too much power to say that routine political favors amounted to corruption. “It puts at risk behavior that is common,” said Justice Stephen G. Breyer. “That is a recipe for giving the Justice Department and prosecutors enormous power over elected officials. ” Mr. McDonnell, a Republican, was prosecuted on charges that he had used his office to help a businessman, Jonnie R. Williams Sr. who had showered the governor and his wife with luxury products, loans and vacations worth more than $175, 000. The gifts themselves were legal, and the question in the case was whether they were part of a corrupt bargain in which Mr. McDonnell reciprocated by using the power of his office to help Mr. Williams. Mr. McDonnell, who attended the argument on Wednesday, arranged meetings for and attended events with his benefactor. But Mr. Williams, whose company made a diet supplement, did not have any real success in obtaining support for his product from the state. A jury found that Mr. McDonnell’s actions amounted to corruption, and a federal appeals court upheld the conviction. Noel J. Francisco, a lawyer for Mr. McDonnell, said his client should not have been convicted, as he did not “make a government decision or urge someone else to do so. ” The corruption laws, he added, were “not meant to be comprehensive codes of ethical conduct. ” Michael R. Dreeben, a lawyer for the federal government, said such a narrow definition was “a recipe for corruption” that would “send a terrible message to citizens. ” Justice Breyer responded that “I’m not in the business of sending messages in a case like this,” adding, “I’m in the business of trying to figure out the structure of the government. ” Justice Anthony M. Kennedy also sounded frustrated, saying that “the government has given us no workable standard” to distinguish political favors from criminal acts. Mr. Dreeben took a hard line, saying that a vacation or an expensive lunch traded for arranging a meeting could be sufficient. But he added that it was hard to prove criminal intent. Justice Kennedy reacted with sarcasm. “You’re going to tell the senators, the officials with the lunches, that ‘don’t worry, the jury has to be convinced beyond a reasonable doubt,’” he said. Some justices said that even the standard urged by Mr. McDonnell’s lawyer converted too much ordinary conduct into a crime. “The word ‘influence’ is too broad,” Justice Breyer said, “because every day of the week politicians write on behalf of constituents letters to different parts of the government, saying, ‘Will you please look at the case of Mrs.    who was evicted last week? ’” Justice Kennedy said he would limit the definition of unlawful corruption to the “exercise of governmental power to require citizens to do or not to do something, or to shape the law that governs their conduct. ” Asking another official to have a meeting with a donor, he suggested, was not enough. Justice Ruth Bader Ginsburg, who seemed sympathetic to the government, probed the implications of such a standard, asking Mr. Francisco whether it would be lawful to charge $1, 000 for a meeting. “If there’s no indicia that you’re actually trying to influence the outcome, and it really is just a meeting, yes,” Mr. Francisco said. Chief Justice John G. Roberts Jr. said it might matter who was arranging the meeting. “If it’s the president who calls and says, ‘I want you to look at this matter for my constituent,’ that might exercise considerably more influence,” he said. But Chief Justice Roberts was considerably more animated and skeptical in questioning Mr. Dreeben, the government’s lawyer. The chief justice quoted from a supporting brief filed by several former White House counsels of both parties who warned that if the decision were upheld, it would “cripple the ability of elected officials to fulfill their role in our representative democracy. ” “I think it’s extraordinary that those people agree on anything,” Chief Justice Roberts said. Last year, the Supreme Court allowed Mr. McDonnell to stay out of prison while the court considered whether to hear his case, McDonnell v. United States, No.  . That unusual order was a powerful hint that the court might be inclined to rule in his favor. In their Supreme Court briefs, Mr. McDonnell’s lawyers relied on the Citizens United decision in 2010, in which the Supreme Court said that “ingratiation and access” were “not corruption. ” That year, the court ruled in favor of a former Enron executive, Jeffrey K. Skilling, saying that a federal anticorruption law governing “honest services” applied only to bribes and kickbacks. On Wednesday, Chief Justice Roberts noted that three members of the court  —   Justices Kennedy, Clarence Thomas and Antonin Scalia, who died in February  —   would have gone further in the Skilling case and ruled that the law was unconstitutionally vague. “Maybe the experience we’ve had here,” the chief justice said, “and the difficulty of coming up with clear enough instructions suggests that the caution the court showed at that point”  —   in construing the law narrowly rather than striking it down  —   “was  . ” Mr. Francisco, who had a good day, stumbled near the end of his presentation, referring to Justice Ginsburg as “Justice O’Connor. ” “That hasn’t happened in quite some time,” Justice Ginsburg said. Justice Sandra Day O’Connor, the first woman to serve on the Supreme Court, retired in 2006. Mr. Dreeben’s outing was rockier, but it ended in a tribute from Chief Justice Roberts, who congratulated him on presenting his 100th Supreme Court argument, a rare achievement. While a majority of the justices seemed inclined to vote in Mr. McDonnell’s favor, it was not clear that they would agree on a rationale. As Justice Breyer put it, Mr. McDonnell’s case presented “as knotty and complicated and difficult and basic a problem as I can think of. ”'"}, "time": 1742562800.9286542}