{"duration": 0.05470895767211914, "input_args": {"text": "'Critics are blasting President Donald Trump for ending an   policy of releasing White House visitor logs on Friday. [The American Civil Liberties Union (ACLU) for example, called the move “the latest in a series of efforts by President Trump to avoid public accountability. ”  In reality, the White House visitor logs rarely informed the public of anything. They were a fig leaf that let the Obama administration claim transparency while hiding its real operations. (Update: Moreover, the Obama administration went to court to resist releasing the visitor logs, at least initially.) Andrew Breitbart was the first to catch onto President Barack Obama’s con game. In March 2011, he posted an essay  —   at the Huffington Post, no less  —   titled: “The White House Guess List: How Obama Pulled a Fast One on the American People  —   in the Name of ‘Transparency. ’” Breitbart pointed out that “the visitor logs may hide more than they reveal”: The White House is still holding back “tens of thousands” of visitor logs, according to congressional testimony last week by Tom Fitton, President of Judicial Watch, who also added that “the Obama administration is less transparent than the Bush administration. ” We also know that some of the most important presidential visitors don’t even walk into the White House. The administration meets K Street lobbyists at Caribou Coffee, and holds secret meetings in Jackson Place townhouses  where there are no visitor logs. The visitor logs that have been released are problematic, because they are simply lists of names, with no way to verify whether a specific name belongs to a particular person.   …     With no way to verify, there is no real transparency. The visitor logs were a key part of President Barack Obama’s claim to have run “the most transparent administration in history. ” But in every other way, he was one of the least transparent presidents in the   era. Obama “set a record” for failing to comply with Freedom of Access to Information Act requests, among other   sins. Obama’s visitor logs were no deterrent to the crooked and malevolent. Logs revealed that   activist Robert Creamer, a convicted felon and the man behind an effort to instigate violence at Trump campaign events, visited the White House some 340 times, with 45 visits including the president himself. The media never cared, nor did he. Arguably, two wrongs don’t make a right. The fact that the Trump administration took advantage of the Good Friday holiday to announce the policy change might suggest some degree of moral doubt. Yet the fact is that visitor logs were never a useful tool to enforcing executive transparency. Better tools are needed, and it is foolish to pretend otherwise. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628339.4563084}