{"duration": 0.03180432319641113, "input_args": {"text": "\"Share on Facebook Studies conducted on rhesus negative blood types show that they are missing the Rhesus factor , a protein substance present in the red blood cells of other humans. Theories suggest that people with Rhesus (RH) negative blood may be from outside this world. Others suggest they are fallen angels from the heavens above or they belong to an alien race from somewhere in the vast darkness of space. What is clear is that those who have with Rhesus (RH) negative blood are different and unique. A person who has RH negative O blood is able to serve as a donor to any person regardless of their blood type. But if they need blood, only their own type will suffice. They represent 15% of the human race and are mostly from northern Europe. Truth Theory reports: The four common blood types of today include A, B, AB and O . The differences between each blood type is dependent on the proteins in the blood, but when it comes to RH negative blood types, which make up about 10 to 15 percent of the population, they don't have these proteins. The question that is on the minds of scientists now, is where this group of RH negative blood type people originates from. Looking back about 35,000 years, scientists believe that the blood type is linked to specific tribes and groups. Europeans have the greatest incidence of this blood type, but only 3% of African-Americans have it, and only 1% of Asian people have it. Some common characteristics of people with this blood type include having a higher IQ, having a lower body temperature, having more awareness (physically and emotionally), having red hair, being sensitive to heat, and having blue, green or hazel colored eyes. This blood type is shrouded in even more mystery when we look at pregnant women. RH negative women who become pregnant have difficulty delivering a baby with an RH positive blood type, as their bodies naturally attack and try to kill the fetus. Thus, they are given a special sterilized solution. ( Anti-D or RHo (D) immunoglobulin ) But, why would the woman's body attack the offspring it's been helping give life to? This is where a relatively new theory comes in and suggests that it's possible alien life has influenced this blood type. What’s even stranger is that almost every person who has reported being abducted by (or interacted with) aliens has the RH negative blood type. It's certainly very possible that aliens visited our planet, as they've done for centuries, and somehow tooled around with the genetics of mankind. After all, history from all over the world has shown time and time again, through ancient texts and depictions, that we've been visited by beings not of this world. What do you think about the blood type that is missing a key link to evolutionary humans ? Could it be that some of us have alien blood running through our veins? Related:\""}, "time": 1742628574.7995703}