{"duration": 0.07908296585083008, "input_args": {"text": "'by Laura Ingraham \\nElection Day is upon us. At this point, you’ve heard the evidence. You’ve heard lots of arguments from all sides. You’ve seen commercials and watched speeches. Most of you have already made up your minds. Some of you have already voted. For the rest of you, here is a closing argument as to why you should select Donald Trump for president. \\nLet’s start by dismissing the views of the sad cadre of pundits known as the “NeverTrumpers.” These people claim to be conservative, and insist that Hillary Clinton would be a terrible president. Yet they contend that since Donald Trump is also unfit to serve in the White House, the only principled option is either to not vote for president at all, or to vote for a third-party candidate who has no chance of winning. This argument need not delay us for long, as it simply ignores the realities of politics. \\nBy its nature, politics is a messy, uncomfortable business that requires compromise and coalition-building in order to succeed. If the NeverTrumpers aren’t willing to work with their fellow conservatives to stop Hillary Clinton, then they have effectively rendered themselves irrelevant to this election, and proven themselves to be untrustworthy going forward. \\nWith the NeverTrumpers out of the way, we now turn to the main event: Donald Trump or Hillary Clinton. Secretary Clinton has been at the highest level of American politics for the last 25 years. She played a significant role in her husband’s administration, she served eight years as a senator from New York, and she served four years as secretary of state under President Obama. \\nNormally, at this stage of a political career, the candidate will have a long list of triumphs and accomplishments to invoke in his or her favor. If nothing else, one would expect Secretary Clinton to claim the accomplishments of her husband and President Obama as reasons to vote for her. She has not done this, for the most part, and instead her campaign has relied almost entirely on personal attacks against Donald Trump. \\nWe have been told, for months, that whatever you may think of his ideas, Trump is a moral leper, a madman, a danger to the very future of the republic. Trump is too risky, goes the argument, and thus we must stick with Secretary Clinton. \\nBut what are the facts? It is true that Trump sometimes loses his temper — much like Andrew Jackson did. It is true that Trump has had a rather complicated personal life — much like John F. Kennedy did. It is true that Trump can sometimes be highly critical of his opponents — much like Harry Truman was. But the Trump critics ignore the fact that a President Trump will face very significant checks and balances. A Speaker Ryan, or a Majority Leader McConnell, will not be rubber stamps for President Trump. A federal court system full of liberal judges and GOP moderates will not hesitate to intervene if they believe Trump has overstepped his authority. A federal bureaucracy largely staffed with left-wing Democrats will resist Trump at every turn. \\nOur increasingly partisan media will attack Trump every single day. Under these circumstances, the idea that a President Trump could, without the support of the people and against the united opposition of much of official Washington, undermine or otherwise subvert our democratic system is simply not credible. \\nIn fact, Hillary Clinton presents a much greater threat in this regard. As we’ve already seen, the press is no check to Hillary Clinton — if anything, they see their job as protecting her from her enemies. Once Hillary has five liberals on the Supreme Court — and she will have five liberals on the Supreme Court — the court system will be little more than her footstool. \\nAs commander-in-chief, she will inherent sweeping power to launch military actions — power that she has already shown a willingness to use. As the nation’s chief law enforcement official, she will decide who is and isn’t prosecuted. As the nation’s chief executive, she will decide how the laws are interpreted. \\nShe will need to get money from Congress — but President Obama has shown that Congress will cave if she threatens a government shutdown. In other words, once she gets past this election, there will effectively be no check on her power. In this regard, she is a much bigger threat than Trump. \\nThat’s not all. The main reason Hillary Clinton has spent the last few months railing against Trump — and ignoring her own record — is that the events of the last 25 years prove that her administration will be a failure. All of the policies in which she believes — globalization, open borders, an aggressive U.S. military presence in the Middle East, using the courts to promote social liberalism — have not only been tried, they have mostly been U.S. law since the 1990s. \\nLooking around, we see the results. Since Bill Clinton urged Congress to support China’s entry into the WTO in 2000, we have lost more than 5 million manufacturing jobs. We have run up more than $12 trillion in national debt. We have had a disastrous financial crisis, followed by a meager recovery. We have seen a chasm of inequality open between the few at the very top, and the vast majority of Americans, who are falling behind. \\nAs the U.S. economy sputters, we are losing our ability to influence foreign affairs. As Americans lose faith in their future, social unrest continues to grow. \\nHere’s the bottom line: If Hillary Clinton is elected president, then the problems we face now will worsen and fester over the next four years. American workers will continue to struggle. Our country will grow weaker. China and our other enemies will grow stronger. Crime will continue to rise. Riots like we saw in Ferguson will be more common. The world will become more dangerous and unstable. Millions more Americans will give up on our system. And all of these events will be exacerbated by Secretary Clinton’s unique habit of fighting investigators. \\nIf you think the election of 2016 has been painful, then you really shouldn’t want to see what this country looks like after four years of a Hillary Clinton presidency. \\nBy contrast, Trump is merely suggesting a return to common sense and the rule of law. With respect to trade, he argues that the U.S. government should use its leverage to get the best possible deals for American workers — just as it always did until Bill Clinton persuaded Congress that we should join the WTO. With respect to immigration, Trump’s primary argument is that we should enforce the law — and isn’t that supposed to be the president’s job? \\nWith respect to foreign policy, Trump argues that we should be careful and prudent in the use of military force, and should no longer make promises we can’t afford to keep — a policy much closer to traditional American thinking than the pie-in-the-sky dreams that have resulted in so many recent disasters around the world. \\nWith respect to domestic policy, Trump argues for a combination of tax and regulatory changes — such as the repeal of Obamacare — that will put more money in American pockets, and give new encouragement for economic activities. \\nNone of these policies are outside of any American mainstream — indeed, for most of American history, they were regarded as simple common sense. The true radicals in this election are the ones who want to continue policies that have already failed, not those who want to correct the mistakes of the last 25 years. \\nIn short, the major risk in this election is not that we try something different with Donald Trump. The major risk — and it is major indeed — is that we continue on the failed and increasingly dangerous path that we are on. \\nIf Hillary Clinton is defeated, we can reverse the disastrous policies of the last few decades, and take a new approach that will focus on the needs and interests of the American people. That’s what this election is all about. That is why you should vote for Donald Trump. \\nPlease Like and Share if you are a TRUMP Voter! Comment on this Article Via Your Facebook Account Comment on this Article Via Your Disqus Account Follow Us on Facebook!'"}, "time": 1742628490.4698596}