{"duration": 0.154069185256958, "input_args": {"text": "'DeRay Mckesson, one of the best known voices for the Black Lives Matter movement, was among hundreds of people arrested at weekend demonstrations across the country. He spent 16 hours in a Baton Rouge jail cell until he was released Sunday afternoon, vowing to continue demonstrating because he was convinced that the authorities want activists to be “too afraid to protest. ” Mr. Mckesson, in a telephone interview shortly after his release, said he believed that his arrest was unlawful and that the police unfairly conducted mass arrests while people were peacefully assembled and out of the way of traffic along a highway. In a booking record, Baton Rouge authorities said Mr. Mckesson ignored a police officer’s order to stay out of the road and as a result was charged with simple obstruction of a highway of commerce. He was released on his own recognizance. On Sunday night, he was at the Triple S convenience store, where Mr Sterling was shot a week ago, and which on this night was distinctly devoid of police officers after tense protests downtown hours earlier. “The police want protesters to be too afraid to protest, which is why they intentionally created a context of conflict, and I’ll never be afraid to tell the truth,” he said. “What we saw in Baton Rouge was a police department that chose to provoke protesters to create, like, a context of conflict they could exploit. ” He said that officers chased several protesters and that he had retained a lawyer. He added that he and others jailed remain committed to the Black Lives Matter movement and would continue to use civil disobedience to make their points. Mr. Mckesson and several others traveled to Baton Rouge to protest the death of Alton Sterling, who was fatally shot early Tuesday. The authorities arrested more than 100 people in connection with a protest outside the city’s police headquarters, charging most of them with obstructing the road. Eight firearms were confiscated and one officer lost several teeth after he was struck by a projectile, the police said. At a news conference in Baton Rouge, law enforcement officials defended arresting people who had stepped onto a highway against police commands, saying that streets had been closed for marches elsewhere but that this was a major thoroughfare and needed to remain open. “We certainly respect the right people have to gather peacefully, to protest peacefully and we’re going to protect that right,” said Sheriff Sid J. Gautreaux III of East Baton Rouge Parish. “At the same time we’re not going to tolerate any violence, we’re not going to tolerate any lawlessness, we’re not going to tolerate any destruction of property. ” Mr. Mckesson filmed his encounter with the police using the   app Periscope. On camera, he told viewers that there was no sidewalk where they were walking. An officer could be heard shouting, “You with them loud shoes, I see you in the road. If I get close to you, you’re going to jail. ” “I think he’s talking to me, y’all,” said Mr. Mckesson, who often wears red sneakers to demonstrations. Later, Mr. Mckesson said, “Watch the police, they are just literally provoking people. ” Then, about five minutes into the broadcast, the video becomes shaky and a police officer can be heard saying: “City police. You’re under arrest. Don’t fight me. Don’t fight me. ” Sunday night, Mr. Mckesson said once he was taken into custody he was put in a van with dozens of others and was able to use another person’s phone to text people about what happened. He was eventually taken to East Baton Rouge Parish Prison. There he was at times housed with some 50 other men who took turns sitting on packed benches and sleeping on the floor. “Not everybody could fit,” he said. “Some of us had to stand. I, like many other people, slept on the floor or didn’t sleep at all because there just wasn’t enough room. ” After hours, Mr. Mckesson and others were then told to change into   jumpsuits and were fed a breakfast of orange juice, oatmeal and pastries. While inside, Mr. Mckesson was able to make several calls to his lawyers and friends to strategize how to be released. Mr. Mckesson, 31, a public school administrator turned activist, first gained national notice with his blunt critiques on Twitter of the police response in Ferguson, Mo. after the death of Michael Brown in 2014. He ran for mayor of Baltimore, his hometown, this year, ultimately losing the Democratic primary in April to Catherine E. Pugh.'"}, "time": 1742628293.612555}