{"duration": 0.052420616149902344, "input_args": {"text": "'TOKYO  —   For the first time in nearly two centuries, an emperor of Japan has said that he will abdicate the throne before he dies. According to NHK, the public broadcaster in Japan, Emperor Akihito, 82, who in 1989 succeeded his father, the wartime emperor Hirohito, told close aides that he intended to pass the throne to his son, Crown Prince Naruhito, 56, before he dies. No modern emperor has done so: The last emperor to abdicate was Emperor Kokaku, in 1817. The emperor’s role is now entirely ceremonial. Until the end of World War II, the Japanese public revered the emperor as a demigod, and he served as commander in chief of the army. After Emperor Hirohito surrendered at the end of World War II, the country’s American occupiers stripped him of all political authority. Today, many Japanese still hold the emperor in high regard. According to NHK, Emperor Akihito, who was treated for prostate cancer in 2003 and underwent heart surgery in 2012, plans to make a formal announcement shortly. “It’s a tiring job,” said Robert Dujarric, director of the Institute of Contemporary Asian Studies at Temple University in Tokyo. “He’s getting old. ” Emperor Akihito may be trying to avoid the drama of his own succession. His father was ill for many years before his death. “This emperor seems to want to make it easier and make it more matter of fact,” said Sheila A. Smith, senior fellow for Japan studies at the Council on Foreign Relations in Washington. After the NHK report, however, the Asahi Shimbun, a   newspaper, reported that Shinichiro Yamamoto, deputy director of the Imperial Household Agency, denied the abdication report, saying that the emperor had “no such intention. ” A spokesman for the Imperial Household Agency could not immediately be reached for comment. The report of the planned abdication comes just three days after the Liberal Democratic Party of Prime Minister Shinzo Abe and its allies won a commanding victory in parliamentary elections, capturing   of the seats in the upper house, the amount required to initiate a constitutional revision. Mr. Abe has long had an ambition to overturn the constitutional clause that calls for Japan’s complete renunciation of war. Although the emperor has no official political authority, Prince Naruhito could offer a counterpoint to Mr. Abe’s goals. He has repeatedly commended the pacifist Constitution written by the American occupiers in 1947. On the eve of his 55th birthday, in 2015, Prince Naruhito praised the Constitution and said he wanted to “engrave in the mind the preciousness of the peace. ” For the emperor to abdicate, Parliament would have to revise the imperial law, which stipulates that the throne passes on after the death of the monarch.'"}, "time": 1742563868.3840506}