{"duration": 0.06438899040222168, "input_args": {"text": "'Say you’re shopping at a farmer’s market in Rome, and you’d like to pick up some nice, ripe watermelon. The signs at some stands call it “anguria” others say “cocomero” or “melone d’acqua. ” Why so many different words for the same fruit? Because in their daily lives, many Italians don’t speak Italian. That is, they don’t shop or chat or argue in standard Italian, the kind that is studied in school and heard on the news. They use one of the country’s hundreds of local dialects, each with its own quirks of pronunciation, inflection and vocabulary. “You call it watermelon in New York, and that would be ‘anguria’ in Italian,” said Tino Mattiussi, a   owner of a fruit and vegetable stand in the colorful Campo de’ Fiori market in central Rome. “But here, everyone knows it as ‘cocomero,’ so I wrote what people understand better. ” A few stands away, Mauro Ranucci had a different approach. “We advertise it as ‘anguria,’ as that is Italian,” he said firmly. “At least, that’s how people call it in the north. ” When a southerner once asked him for a “melone d’acqua,” Mr. Ranucci said, it took him a minute to realize what he meant. “We all speak Italian with strong regional connotations, even if the discrepancies are minor,” said Giovanni Ronco, vice director of the Italian Linguistic Atlas. “No other country has so many linguistic differences in such a limited space. ” For centuries, Italy was a fragmented patchwork of thousands of small, insular communities. When the country unified in 1861, 90 percent of the population was illiterate and spoke only the local tongue. They are called Italian dialects, Mr. Ronco said, but many of these tongues are really separate languages, descended directly from Latin. That helps account for the many names for familiar things, even within a single region. An anchovy is an “alice” in some parts of southern Italy, for example, but an “acciuga” in others. Neighboring dialects may be similar, but people from opposite ends of Italy  —   say, Sicily and Lombardy  —   might struggle to understand what the other said. Only in the 1950s, when televisions began to appear in bars and homes, did many ordinary Italians around the country start to hear the same standard language being spoken it’s based on the Florentine dialect, which was used in the former royal courts and in many great works of literature. Now, most people know standard Italian as well as their local dialect  —   which sometimes necessitates thinking twice about what to call a fruit. “It’s not a big problem, after all,” Mr. Ranucci said as he offered a customer a yellow and dark red peach. “If we don’t understand each other, we just gesticulate. ”'"}, "time": 1742563935.4399147}