{"duration": 0.04762411117553711, "input_args": {"text": "'This post was originally published on this site \\nJohn Kirby has been spokesman for the US State Department since May 2015. In the short time he’s held the post, he’s produced one gaffe and embarrassment after another. Basically, he makes the previous ginger-haired smartass spokesgirl representing the United States, Jen Psaki, look like a genius. (Psaki left State to be Hillary’s spokesgirl at the White House, only to find herself in the center of a gaggle of devastated aides as Barack Obama acknowledged Donald Trump as president-elect.) \\nIn State’s latest charade, Kirby callously threw out more tired accusations of Russian aircraft bombing hospitals in Aleppo. The claims came from “credible relief organizations” — probably State/CIA fronts created precisely for the sole purpose of making such accusations. Probably a lot like the “Syrian Observatory for Human Rights,” which is still cited by western propagandists even after it was demonstrated to be a western intel op with literally 1 guy sitting in a UK flat making crap up. \\nWhen questioned by RT reporter Gayane Chichakyan to specify which hospitals, Kirby refused, referring to the “relief organizations.” He then demanded Chichakyan ask “her” defense ministry to own up to bombing the apparently fictional hospitals. When Kirby was derided by AP’s Matt Lee for his treatment of Chichakyan, he blustered, “ I’m not putting Russia Today on the same level with the rest of you. “ \\n[embedded content] \\nUnable to defend his ludicrous claims, Kirby went ad hominem, attacking RT as “state owned” – apparently forgetting that BBC, France24, Germany’s ARD and ZDF, and many other western broadcasters are state-owned or controlled. \\nIn summary, the exchange went like this: \\nKirby : Russia has bombed civilian hospitals in Aleppo! \\nRT : Which hospitals were bombed? \\nKirby : I don’t know, ask your defense ministry. \\nRT : If you tell us which ones, we can ask our defense minstry about them. \\nKirby : I don’t know which ones, ask the relief agences. \\nRT : Which relief agencies? \\nKirby : I don’t know which agencies…..and by the way, RT is state-owned! So there! \\nJohnny’s probably got a short fuse now that he knows his days of spinning out Ministry of Truth tripe are numbered. There is little prospect Donald Trump, who seeks rapprochement with Russia, will retain these useless, lying, neocon trained asshats in his administration. If they actually lied well, that would be a different story. But US diplomats are some of the worst fibbers in the business. Y ou almost have to pity the bastards. Maybe it’s because to tell a good lie, you need a least a kernel of truth. They have literally zero facts on their side to work with. \\nAltogether one more pitiful, pathetic performance by the US Department of State, and another disgrace to the United States. And, we hope, while looking forward to the next US administration with guarded optimism, one of the last. Related '"}, "time": 1742561828.3124402}