{"duration": 0.07975125312805176, "input_args": {"text": "'Starstruck and Party-Fanatic: The Moral Paradox of Trump Support Posted on Oct 28, 2016 \\nBy Juan Cole / Informed Comment \\nDonald J. Trump’s poll numbers in California have cratered down to 28% . If he actually does that poorly in the election, he will set a record for poor performance of a presidential candidate in California. Ever. \\nWhat is difficult to explain is why he isn’t doing that poorly everywhere. Let’s just review what Trump says he stands for: \\n* Manhandling of women without their consent * Torture * Suggested that crime in Baltimore spiked because we have an African-American president * Jail time for women who have an abortion. * Reducing taxes paid by billionaires. * Stigmatizing Latinos as rapists and felons * Revival of the Ku Klux Klan without the sheets * Carpet-bombing civilian cities to get at ISIL * Unconstitutional treatment of US citizens of Muslim faith * Passage of political libel laws as a means to censor the press \\nMost Americans are opposed to these planks of the Trump platform. So why is he still winning any states in the polls? \\nI think there are two things going on here that give Trump a floor in many states that he does not have in California. Those two things are his celebrity status and blind party loyalty. \\nAdvertisement Square, Site wide \\nTrump is a celebrity of a sort we have never had run for president. Ronald Reagan, a B actor in his youth, was not in the same category. When Reagan ran for president in 1980 his acting days were long behind him and few people in the electorate cared about his old black and white films. Trump, in contrast, was on a popular reality show for 11 seasons and until just before he announced his run. Early in its run, the Apprentice got as many as 20 million viewers. It is true that the audience rapidly dropped thereafter, but nevertheless Trump was before millions of people a week. \\nMost politicians have to spend time introducing themselves to the public. Most everybody knew who Trump was. I have a strong suspicion that this name recognition has inflated Trump’s poll numbers in the generals. That is, there are a lot of Americans who don’t follow politics. 42% of them don’t bother to vote in a typical presidential election. Many of the rest aren’t paying much attention until September and October just before Election Day. So in most years when pollsters call in August and ask people who they are voting for and name the two candidates, I think they probably get a lot of suspicious answers because some proportion of their sample has never heard of that person or can’t describe what the candidate stands for. \\nNot so in the case of Donald Trump. (Hillary Clinton, of course, also probably has high name recognition, but she hasn’t been in people’s living rooms the way Trump has. And no, I don’t mean it that way.) \\nMoreover, Americans are often forgiving of their celebrities’ foibles. Celebrities are there to entertain us or offer us power fantasies, not to behave themselves. Los Angeles prosecutors notoriously have an uphill battle in getting jurors to convict even obviously guilty celebrities. Whereas Americans at least always used to be puritanical in their expectations of politicians, they are tolerant of moral lapses in the Hollywood set. Trump confuses many of them because he is both a celebrity and a politician, but many are more willing to be lenient with him than they likely would be with some lawyer they’d never heard of who was running for office. \\nThe other distorting variable here is party loyalty. Perhaps the rise of social media has cemented party polarization in the US. There were people in the old days who voted Clinton and then voted Bush (white Protestant women did so in droves). But party loyalty seems to have solidified with the rise of social media. Maybe it is embarrassing to switch sides in public when you’ve been involved in Twitter or Facebook slamming matches on behalf of the last party you voted for. \\nA lot of Republicans are clearly clinging to Trump despite the Billy Bush tape and subsequent charges from the women he’s groped. These include evangelicals and ‘blue hairs’ (the little old white ladies who are reliably Republican and usually morally censorious). Some 82% of self-identified Republican women are still supporting Trump, groping and all. \\nSo why is California different here? Well, in part it just no longer has many Republicans. About half of the some 40 million Californians are registered to vote. About 28.9 % of those registered voters are Republicans. So the party-loyalty distorting factor may still be at work there. But the GOP in California long ago tied itself to the declining white population (now a minority) and so suffered an implosion. National GOP policy and certainly that of Trump is making the same mistake, which is why they can’t win national presidential elections any more. \\nSecond, Trump has lost many women independents , those famous ‘soccer moms’ who voted for Bill Clinton and then switched to W. \\nSo we should expect Trump everywhere to be getting about the same percentage support as the percentage of registered voters who are Republicans. Hence, he wins in Alabama. And he might even do a little better than that, gaining those independents (especially men) willing to wink at a celebrity’s hi jinx if only he will get the Federal government off their backs and halt immigration. \\nI usually don’t hold people’s votes against them on moral grounds. People make their own judgments in politics and there are good people in both parties. \\nBut I think there is a moral deficit in anyone still willing to vote for Trump, despite all the racism, fascism, sexism, and sexual predation. If our two-party system and our current modes of communication have led us to this place, it is time to rethink them. Otherwise the Republic is in danger. TAGS:'"}, "time": 1742561934.785401}