{"duration": 0.24931597709655762, "input_args": {"text": "'LONDON  —   In November 1967, four years after her husband’s assassination, Jacqueline Kennedy traveled to the temples of Angkor Wat in Cambodia on a   trip with David Ormsby Gore, a friend of her husband and himself a recent widower. There was much speculation of a romantic attachment. A few months later, Mr. Ormsby Gore, a former British ambassador to Washington, proposed marriage. She turned him down. In a handwritten letter, filled with anguish and a touch of cruelty, she explained her decision to marry Aristotle Onassis instead. “If ever I can find some healing and some comfort  —   it has to be with somebody who is not part of all my world of past and pain,” she wrote. “I can find that now  —   if the world will let us. ” The letter was part of a set of papers found in locked   cases discovered only last month in Wales at the family home of Mr. Ormsby Gore, who died in 1985. They are being auctioned in London next month by his grandson to help restore the house. The letters point to the depth of feeling behind the public mask of one of the most celebrated women of her time. Among them is the letter to Mr. Ormsby Gore, also known as Lord Harlech, dated Nov. 13, 1968, a month after her marriage to Mr. Onassis and five months after the assassination of Robert F. Kennedy. In it, Mrs. Kennedy spoke of the love and bond she felt for Mr. Ormsby Gore, whose wife had died in a car crash in May 1967. “We have known so much  shared  lost so much together  —   Even if it isn’t the way you wish now  —   I hope that bond of love and pain will never be cut. ” Writing from Mr. Onassis’ yacht in Greece, on stationery with the ship’s crest, a clear if cold message, Mrs. Kennedy told Mr. Ormsby Gore: “You are like my beloved beloved brother  —   and mentor  —   and the only original spirit I know  —   as you were to Jack. ” Mr. Ormsby Gore had expressed incredulity at her choice of Mr. Onassis, and she tried to respond. “Please know  —   you of all people must know it  —   that we can never really see into the heart of another,” she wrote. “You know me. And you must know that the man you write of in your letter is not a man that I could marry. ” Mr. Onassis, she wrote, is “lonely and wants to protect me from being lonely. And he is wise and kind. Only I can decide if he can, and I decided. “I know it comes as a surprise to so many people,” she continued. “But they see things for me that I never wanted for myself. ” Mr. Ormsby Gore was an old friend of John F. Kennedy, whose younger sister Kathleen, or Kick, married Mr. Ormsby Gore’s first cousin. After the election of the young president in 1960, Prime Minister Harold Macmillan sent Mr. Ormsby Gore to Washington as Britain’s ambassador. The two men, a year apart in age, were extremely close, and President Kennedy consulted with him on every key issue of foreign policy, especially during the 1962 Cuban missile crisis, and in discussions of Vietnam and nuclear disarmament. Robert Kennedy said that Mr. Ormsby Gore was “almost a part of the government,” adding that the president “would rather have his judgment than that of anybody else. ” Among the letters is one in which President Kennedy praised the ambassador: “I appreciate as you know, in all these critical matters your judgment  —   which I have found to be uniformly good and true. ” Mr. Ormsby Gore inherited the noble title, Lord Harlech, when his father died in 1964. His grandson Jasset, who inherited the title a year ago, is the one selling the papers, along with other possessions, at Bonhams, London, in an auction scheduled for March 29. Some of the letters will be on view on March 2 in New York at the Bonhams showroom, at 580 Madison Avenue. In total, there are 18 handwritten letters and one typed letter from Mrs. Kennedy to Mr. Ormsby Gore, as well as other papers. Those include a pass admitting him to the White House on Nov. 23, 1963, one day after the assassination a jocular 1963 letter from Robert Kennedy, signed “Bobby” and instructions for pallbearers for Robert Kennedy’s funeral. The papers also include a letter Mrs. Kennedy wrote to Mr. Ormsby Gore after the death of his wife, Sylvia, known as Sissie, which seemed to foreshadow his desire to marry her. “Your last letter was such a cri de coeur of loneliness  —   I would do anything to take that anguish from you,” she wrote. “You want to patch the wounds  match the loose pairs  —   but you can’t because your life won’t turn out that way. ” One of the most moving documents is a draft letter Mr. Ormsby Gore wrote to Mrs. Kennedy after she turned down his proposal. “All the pathetic plans I had brought with me for visits to Cyrenaica, holidays near one another and a whole variety of solutions to our marriage problem, including one for a secret marriage this summer  —   plans which I saw us eagerly discussing, calmly and with complete frankness as we did at the Cape and in Cambodia for the next wonderful ten days  —   all had become irrelevant trash to be thrown away within a few hours of my landing in New York,” he wrote. “As for your photograph I weep when I look at it. Why do such agonizing things have to happen? Where was the need for it?” The Kennedys and the Ormsby Gores socialized frequently, even stirring resentment among other diplomats and members of the administration. There were small dinners at the White House and shared vacations. One   “incoherent letter as written on Martini” from Mrs. Kennedy, in the spring of 1962, discusses their coming vacation at the America’s Cup races. Others mention her love of dance. Matthew Haley, the head of fine books and manuscripts at Bonhams, said that “you just don’t get this quantity of insight into Jackie’s personal life and that level of intimacy. ” Mr. Ormsby Gore was her husband’s great friend, but “the fact that they developed such an intimate friendship in such a short space of time is important,” he said, even if built on shared sadness. Contacted about the letters on Friday, a representative of the Kennedy family said that they had decided not to comment. Barbara Leaming, who has written biographies of President and Mrs. Kennedy, said that Mr. Ormsby Gore was “the pivotal relationship Jack had in the presidency,” a man he trusted almost as much as Robert Kennedy. “Jackie loved in Jack the man he wanted to be, and David was the man helping him, in her eyes, to be the man Jack wanted to be,” she said. The distress that followed Robert Kennedy’s assassination in June 1968 was one reason she turned to the security of Mr. Onassis, Ms. Leaming said. “It was the second great trauma for her,” Ms. Leaming said. “She was very clear it was not a marriage of love, as she said to Joe Alsop in a letter. She was seeking safety. ” As for Mr. Ormsby Gore, “of course he fell in love with her  —   she understood him so well,” Ms. Leaming said. “But I have no idea if it was consummated or not. ” Mr. Ormsby Gore did marry again, in December 1969, to Pamela Colin, an American who bore more than a passing resemblance to Mrs. Onassis. He died in 1985, at 66, after a car crash. Mrs. Onassis attended his funeral.'"}, "time": 1742564277.8672078}