{"duration": 0.08974695205688477, "input_args": {"text": "'You can buy “Trump That Bitch” buttons and   on Amazon to show your disdain for Hillary Clinton. You can hear the word shouted at rallies for Donald J. Trump and spread across Twitter. At one event last month, a   boy standing with his mother yelled out, “Take the bitch down. ” Now, you can see the word applied to Clinton in a headline on the Opinion pages of The New York Times: “The Bitch America Needs. ” Those words appeared over the weekend above a piece that tried to reclaim that particular bit of obscenity from those trying to degrade women with it. “For more than 20 years in American politics, Mrs. Clinton has embodied what we might call Classic Bitch,” wrote Andi Zeisler, founder of a feminist organization, appropriately named Bitch Media. “She’s perceived as an interloper who challenges or threatens masculinity, entitlement and a   worldview she’s the scandal magnet who can seem as heartless and venal as any  ’  member. Worst of all, she’s the woman who accepts that she will be disliked and carries on anyway. ” Zeisler wrote a provocative piece, with plenty of good political history on the word, including its use against Clinton back in 2007, when someone at a public forum asked Senator John McCain, “How do we beat the bitch?” McCain responded, “Excellent question. ” Zeisler’s piece was an interesting read, strongly   and  . But several readers took issue both with the headline and the editors’ decision to use it. This one from Paula DiPerna of New York City was typical: “I know the piece is mere opinion, but it nevertheless represents a new low in titillation journalism, as if written by a gleeful child who just got permission to use curse words. It is a disservice to the idea of public good in that, disguised as feminism, it actually delivers nothing but tweet fodder to   forces. ” I sought out the Opinion editor Rachel Dry to ask her how the essay came about as well as the concerns highlighted in DiPerna’s letter, some of which I share. Dry says she commissioned the piece because she wanted someone to wrestle with how this particular profanity is being used against Clinton. “Certainly the word focuses one’s attention,” Dry said to my questions about its use in the headline and so frequently in the story. “But that’s what the essay is about. ” I did find the essay readable and smart, and given that the   pages are intended to throw out the welcome mat to all views, it’s hard to argue that this wasn’t a worthy offering. But I too was jolted by the headline. Have we really reached the point that it’s O. K. for The Times to refer to Clinton in bold type as “The Bitch America Needs”? Dry said she was unaware of a previous time when the word was used in a headline. What bothered me about the headline was that it seemed to come from the voice of The Times, at least when you come on it cold, as all readers do. It’s one thing for an author, under her own byline and in the context of her ideas, to write the type of opinion piece Zeisler did. But the word bitch  —   particularly when it’s lobbed at you across a room or on the street or in social media  —   is surely intended as crude and demeaning. I suspect that’s the same way Trump supporters use it. And it seems to be the way the Clinton campaign takes it, as it has made clear in the past. Dry says that when opinion editors write the headlines, they are distilling the author’s perspective, not the view or the voice of The Times. That may be, but referring to the first female presidential nominee as the right bitch for the job brings an air of legitimacy to the word that seems beyond where we are at this moment in history. The mainstream may someday apply this term to women who stand up for themselves and bust through feminine stereotypes. Until then, it remains an insult, degrading and misogynistic.'"}, "time": 1742564567.1832955}