{"duration": 0.09281468391418457, "input_args": {"text": "'Share This Adam Aliev had a sex change operation before marrying his male lover. However, after his brutal murder by an anti-LGBT “bigot,” don’t expect to hear a peep from the liberal media. \\nA young transgender, who recently had surgery to become a woman, was found brutally hacked to pieces and completely unrecognizable at a gruesome murder scene. However, as soon as the liberal media found out the identity of the suspected killer, they fell eerily silent about the major news story they’d otherwise blast across the airwaves. \\nThe liberal agenda is clear — propagate everything that promotes their progressive ideals. However, when it comes to Islam, the left has an incredibly difficult time defending its teachings since they almost always oppose liberal values. Once again, the left has proven that ratings and the already soiled reputation of their favorite religion are more important than even their own beliefs. \\nFrom a young age, Adam Aliev believed he was meant to be female. Unfortunately, his family was not supportive of his decision to live as a woman, to say the least, but this only empowered Aliev to undergo a sex change operation and take the name Raina. Sadly, shortly after 25-year-old Aliev made the transformation and married his male lover, he was brutally murdered for his lifestyle. While all of this fits the liberal dream of pushing a victimized LGBT poster children in an attempt to demonize conservatives, the leftist media won’t be flooding social media with Aliev’s face for one crucial reason. \\nNaira Naija News reports that not only is Aliev’s disapproving family made up of devout Muslims, his father is also suspected of being responsible for his son’s heinous murder. Aliev was reportedly butchered and hacked into pieces just after his father Alimshaikh Aliev rallied other devout Muslims on live television to honor kill his transgender son. \\n“Let him be killed, I don’t want to see him. Bring him here and kill him in front of my eyes,” the father ordered. Aliev’s passport shows him before his surgical transformation, the final straw that prompted his Muslim family to demand his gruesome murder. \\nShortly after the broadcast, police confirmed that Aliev was “cut up” into pieces and unrecognizable to those who knew him. \\n“I did not recognize Adam’s cut-up body when it was brought to the village,” an official said. \\nAliev was born into a Muslim Chechen family in Dagestan, a Muslim-dominated area in the Russian Trans-Caucasus. According to Alimshaikh, his son’s decision to live as a woman and marry a man had apostatized him from Islam, which the Quran teaches is worthy of execution. \\nAlthough it is unclear whether Alimshaikh is an actual murder suspect, he is undeniably responsible for bringing about his son’s death, which could and should result in criminals charges. \\nAccording to Daily Mail , Aliev’s mother was reported to be “crying day and night” after she heard about his sex change and un-Islamic wedding. It was then that the father publically broadcasted a “purman,” which is an invitation for Muslims to kill a particular person. \\n“He cheated them, he went there to Moscow, had surgery and he turned from a boy to a girl,” said a female neighbor of the victim’s father. “And now in Chechnya it is known too. His mother is saying ‘I don’t want to see him, I gave birth to a son, but what for? It is such a disgrace for the family.’ If the mother and father give a purman, it means they want him to be killed.” \\nMuslims are responsible for 91 percent of the world’s honor killings, which have motives ranging from marrying against their family’s wishes to simply insulting Islam by becoming “too Western.” In fact, even the family’s Muslim neighbor believes that Aliev’s actions are so dishonorable that they warranted his death. \\nMad World News reported in December 2015 that a 23-year-old Muslim woman brutally drowned her 2-year-old daughter after she caught her own father raping the child. The little girl suffered severe internal injuries before the mother walked in on the girl’s 59-year-old grandfather sexually abusing her. The woman drew her still bleeding daughter a bath and held her underwater until she stopped breathing because she wanted to “avoid scandal.” This is just one example of the sinister measures Muslim will go to in order to preserve their religion’s idea of honor. \\nWhile the left claims to be the champion of LGBT rights, don’t expect them to make a fuss over Aliev’s death. As they have consistently proven, Islam trumps the LGBT community. Either because they are terrified of Muslims or because they are blindly ignorant of the ideology, liberals will likely come to the defense of Islam over its transgender victim.'"}, "time": 1742561818.8950524}