{"duration": 0.10555768013000488, "input_args": {"text": "'Politics Iranian Foreign Minister Mohammad Javad Zarif attends a news conference after a meeting with his counterparts Walid al-Muallem from Syria and Sergei Lavrov from Russia in Moscow, Russia, on October 28, 2016. (Photo by Reuters) \\nIranian Foreign Minister Mohammad Javad Zarif says comprehensive international determination is necessary to fight and uproot terrorism in the Middle East. \\nThe Iranian foreign minister made the remarks at the end of a three-way meeting among him and his Russian and Syrian counterparts, Sergei Lavrov and Walid al-Muallem respectively, in Moscow on Friday on the latest situation in Syria. \\nZarif said Tehran, Moscow and Damascus should reinforce their cooperation in the campaign against terrorism. \\nHe stressed the importance of adopting strategies to stop the delivery of weapons and military equipment to the foreign-backed Takfiri militants wreaking havoc in Syria. \\n“The political settlement of the crisis in Syria will be possible through negotiations between the sides in order to put an end to this crisis,” Zarif said. \\nThe three foreign ministers agreed to intensify the fight against terrorism and said their countries have a common stance on the anti-terror campaign in the region, particularly in Syria. \\nLavrov said Iran, Russia and Syria have determined necessary frameworks for fighting terrorism and expressed their readiness to take measures that will play a key role in the campaign against the malicious phenomenon. \\nThe Russian foreign minister added that the Moscow meeting highlighted the significance of a firm and efficient battle against terrorism in the Middle East, particularly in Syria. \\nHe said the meeting’s participants also discussed ways to send humanitarian aid to civilians in Syria and stop the flow of weapons into the hands of terrorists operating in the war-hit country. \\nMuallem, for his part, said the US is making no effort to find a political solution to the Syrian crisis. \\nThe Syrian foreign minister added that a recent agreement between Washington and Moscow, signed in the Swiss city of Geneva in September, failed to bear any fruit. \\nAfter marathon talks in Geneva, US Secretary of State John Kerry and his Russian counterpart reached an agreement on September 10 to impose a ceasefire in the Syrian city of Aleppo and to coordinate military operations against terrorist groups in the country. \\nAleppo, Syria’s second largest city, remains divided between government forces in the west and foreign-backed terrorists in the east, making it a frontline battleground. \\nRussia, which has been conducting an aerial military campaign against extremist militants in Syria, has repeatedly voiced its readiness for a ceasefire. Russia has been insisting, however, that any such lull in fighting should be accompanied with a meticulous separation of terrorists from less extremist militants fighting against the Syrian government. \\nThe Syrian foreign minister said Washington is not interested in solving the crisis in Damascus and takes measures only to serve the its own interests and those of its regional allies. \\nSince March 2011, Syria has been hit by militancy it blames on some Western states and their regional allies. Backed by the Russian air cover, the Syrian military is engaged in an operation to rid the country of Daesh and other terrorist groups. \\nThe so-called Syrian Observatory for Human Rights and United Nations Special Envoy for Syria Staffan de Mistura have put the death toll from the Syria conflict at more than 300,000 and 400,000, respectively. \\nThis is while the UN has stopped its official casualty count in Syria, citing its inability to verify the figures it receives from various sources. \\nOver the past few weeks, the Syrian forces have wrested control of several areas across the war-torn country as they press ahead with their counter-terrorism operations. \\nIran, Russia share strong anti-terror stance: Zarif \\nMeanwhile, in a meeting with his Russian counterpart earlier on Friday, the Iranian foreign minister said Tehran and Moscow have “tough stances in the fight against terrorism in the region through common strategies.” \\n“Tehran and Moscow have broad cooperation on regional issues such as the campaign against terrorism and extremism and we share views [on these matters],” Zarif added. Russian Foreign Minister Sergei Lavrov (R) speaks with his Iranian counterpart Mohammad Javad Zarif during a meeting in Moscow, Russia, on October 28, 2016. (Photo by Reuters) \\nHe also noted that Iran and Russia have succeeded in making considerable progress in all fields including in economic and political sectors as well as regional and international developments. \\n\"I am pleased that in recent years relations between the Islamic Republic of Iran and the Russian Federation, as two good neighbors and two key players, have made many positive developments,” Zarif said. \\nLavrov, for his part, said Tehran and Moscow urged cooperation on an unrelenting approach to terrorists operating against the Syrian government. \\nIran and Russia have similar stances on the ongoing deadly crisis in Syria. Moscow and Tehran reject any foreign interference in the affairs of the war-hit country, stressing that only the Syrians are entitled to decide their own fate. \\nIran has been providing military advisory assistance to the Syrian government in its campaign against terrorism. Loading ...'"}, "time": 1742564356.5203252}