{"duration": 0.11290192604064941, "input_args": {"text": "'COLUMBUS, Ohio  —   Hillary Clinton pounded away on Tuesday at Donald J. Trump’s business record and economic proposals, seeking to turn his claims of astounding financial success and genius against him and predicting a recession and global panic if he is elected president. In a stern but     speech at an education center garage here, Mrs. Clinton took care to intermingle the policy proclamations of Mr. Trump and his professed image as a business success of the highest order. “Donald Trump has said he’s qualified to be president because of his business record,” Mrs. Clinton said. “A few days ago he said  —   and I quote  —   ‘I’m going to do for the country what I did for my business.’ So let’s take a look. ” Though she leveled predictable blows against various   products, noting that many items  —   Trump ties, Trump steaks, Trump furniture  —   were made outside the United States, Mrs. Clinton’s most pointed refrains sought to depict Mr. Trump, her presumptive Republican opponent, as an enemy to the very people he had claimed to champion in the primary. She checked off the stumbles of his casino business in Atlantic City disparaged his companies’ bankruptcies (Mr. Trump’s many books about business “all seem to end at Chapter 11,” she joked) and insisted that his “one move” in business and politics was to make “   promises” and then let people down. Mrs. Clinton invoked her father, who owned a small drapery business in Chicago, as she described Mr. Trump’s history of failing to pay painters, waiters, plumbers and other contractors who had completed work for him. “My late father was a ” she said. “If his customers had done what Trump did, my dad would never have made it. So I take this personally. ” She added, “This is not normal behavior. ” The barrage comes at a perilous moment for Mr. Trump, who fired his campaign manager on Monday and faces severe disadvantages in   and    organization. One supporter introducing Mrs. Clinton said gleefully that the campaign had more staff members in Ohio than Mr. Trump had nationwide. Although polls often show that voters see Mrs. Clinton as more qualified than Mr. Trump on foreign policy, her economic views have not always been an easy sell. In the Democratic primary race, she was dogged by criticism of her support for trade deals struck during the administrations of her husband and President Obama. Mr. Trump, posting repeatedly on Twitter to counter Mrs. Clinton, said he planned to make his own “big speech” Wednesday to discuss her “failed policies and bad judgment. ” The Trump campaign, which has seldom engaged in rapid response, also sent a barrage of news releases to reporters in an effort to undercut Mrs. Clinton’s arguments. Their subjects included Bill Clinton’s former position on the board of a   college, the loss of manufacturing jobs since 1993 and a slew of negative headlines about economic indicators under President Obama. In one Twitter post, Mr. Trump seemed to embrace a label Mrs. Clinton had tried to make stick: that he had referred to himself as the “king of debt. ” “I am ‘the king of debt,’” Mr. Trump wrote on Tuesday. “That has been great for me as a businessman, but is bad for the country. I made a fortune off of debt, will fix U. S. ” Mrs. Clinton had taken Mr. Trump to task for suggesting that the United States might default on its debts under his leadership, arguing that Alexander Hamilton, the first Treasury secretary, “would be rolling in his grave. ” “The full faith and credit of the United States is not something you just gamble away,” she said, predicting that because the global economy “hangs on every word our president says,” even raising the possibility of a default “would cause a global panic. ” At one point, she ridiculed Mr. Trump’s suggestion that he could “sell off America’s assets” if necessary. “Even if we sold all our aircraft carriers and the Statue of Liberty, even if we let some billionaire turn Yosemite into a private country club,” she said, “we still wouldn’t even get close. ” Mrs. Clinton attacked Mr. Trump on several other issues, including immigration and pay equality for women. She also ridiculed Mr. Trump for saying that climate change was a “hoax invented by the Chinese,” noting that it was “a lot easier to say a problem doesn’t exist than it is to actually try to solve it. ” The speech on Tuesday was the centerpiece of a coordinated attack on Mr. Trump’s fiscal sense. On Tuesday morning, Mrs. Clinton’s team released a video, “Bad Businessman,” featuring clips of figures including Mitt Romney and Senators Marco Rubio and Elizabeth Warren insulting assorted   ventures. “What ever happened to Trump Airlines?” Mr. Romney asks in one excerpt, taken from a speech he made in March that struck a similar tone to Mrs. Clinton’s. The campaign introduced a website, Artofthesteal. biz, detailing Mr. Trump’s checkered history in Atlantic City, his father’s role in bolstering his fortunes and his constellation of enterprises. By early evening, Mr. Trump’s team had responded with its own site, LyingCrookedHillary. com, which was not immediately functional but would be in coming days, according to the campaign. In her next scheduled public appearance, on Wednesday in Raleigh, N. C. Mrs. Clinton is expected to shift to a more positive message, outlining her vision for what she has labeled a “growth and fairness economy. ” Her plans include increasing the minimum wage, closing tax loopholes that encourage companies to move jobs overseas and expanding benefits for working families. Mrs. Clinton has leaned this week on an analysis for Moody’s Analytics led by Mark Zandi, who she noted was an economic adviser to John McCain’s 2008 presidential campaign. The report predicted that Mr. Trump’s proposals on trade, taxation immigration and spending would produce a lengthy downturn and significant job losses, particularly hurting   and   workers. Mrs. Clinton quoted from the report during her speech. But moments before her remarks, Mr. Trump’s campaign emailed reporters, noting Mr. Zandi’s ties to Democrats. He has donated to Mrs. Clinton’s campaign. As she wrapped up, Mrs. Clinton reiterated a campaign theme  —   “Stronger Together”  —   that has become more prominent in recent weeks, and argued that Mr. Trump “believes in the worst of us” and cannot be trusted at the controls. Mr. Trump still seemed to be watching. “Hillary defrauded America as Secy of State,” he wrote on Twitter. “She used it as a personal hedge fund to get herself rich! Corrupt, dangerous, dishonest. ”'"}, "time": 1742562193.8614428}