{"duration": 0.11141347885131836, "input_args": {"text": "'Only one American has ever won an Olympic gold medal in judo: Kayla Harrison. And she has won two, in London in 2012 and in Rio this year. Yet despite her achievements, Harrison is the country’s   famous judoka. No. 1 is her former roommate Ronda Rousey, who won a bronze medal in 2008 and went on to fame, fortune and magazine covers as the   fighter in mixed martial arts. Now Harrison, 26, plans to follow her into the cage, in the World Series of Fighting organization. “If you had peeked through our apartment window in 2007 and said, ‘One of you is going to win two Olympic gold medals, and one is going to become a sports icon,’ we both would have said: ‘What are you talking about? We’re eating ramen noodles and barely getting by,’” Harrison said. “Four years ago, if I wanted to be an M. M. A. athlete, it’s not something a female could really make a lot of money doing. ” Harrison said. Referring to Rousey, she added: “She trailblazed a way for girls like me who want to make some money. I’m hoping to stand on top of her shoulders and continue to have judo girls kill it in the cage. ” It will be quite a change for Harrison. The   world of Olympic sports like judo is vastly different from the colorful, crazy scene of mixed martial arts. When asked about a possible career in mixed martial arts after winning her second gold medal, in August, Harrison said, “I don’t know if I’m cut out for a world where you get fights by how pretty you are and how you talk. ” She stands by that remark, but said: “The World Series of Fighting is looking to bring some legitimacy to the sport, and have real athletes who are treated like real athletes, not W. W. E. superstars. I hope to see it go more toward the professional route versus the entertainment route, but I’m not in charge. ” The man who is, Carlos Silva, the chief executive, said: “I want people to perceive it as a sport, not just a show. A big part of that is adding sporting people like Kayla. ” Harrison competed in judo at 172 pounds but expects to fight at 145 pounds. (Such discrepancies are not unusual Rousey competed in judo at 154 but fights in the Ultimate Fighting Championship at its highest weight class, 135.) Women at 145 pounds have been somewhat overlooked in mixed martial arts in favor of smaller fighters. The World Series of Fighting expects to add athletes to build up the division with its new star in mind. The biggest name in the heavier division is Cristiane Justino, known universally as Cyborg. Currently signed with the U. F. C. she is a fearsome competitor with a   record and a brutal knockout punch. A match between her and Rousey, if it could be arranged, would undoubtedly be one of the biggest in mixed martial arts history. The bigger Harrison, though, might be a more natural matchup for Cyborg down the road. “I’m not going to go out in my first fight and fight Cyborg,” Harrison said. “That would be crazy. ” But she admitted: “I had a dream the other night that I was fighting Cyborg and I got her in an armbar and I broke her arm. But she wouldn’t tap, so I choked her unconscious. ” In Rio, when Harrison was asked about a possible career in mixed martial arts, her longtime coach, Jimmy Pedro, sitting next to her, was seen shaking his head. “That pretty much sums up how he and his father feel about it,” Harrison said of Pedro and his father, known as Big Jim. “They just feel like I’ve accomplished everything an athlete could ever dream of, having such an amazing career in judo. And I think personally they don’t want to see me put that all on the line and see me get hurt. ” Still, Harrison will continue to work with the Pedros, as well as adding training in disciplines like boxing and wrestling. She said her serious training will begin in January. Harrison has no timetable for her first fight. She will start her mixed martial arts experience as a commentator for the World Series of Fighting’s card at the Theater at Madison Square Garden on Dec. 31. The event will feature three championship bouts, including lightweight champ Justin Gaethje against João Zeferino. For a judoka transitioning into mixed martial arts, the biggest issue is striking, which is not allowed in judo. “I feel I have a great base, because judo is takedowns and finishes, armbars, chokes,” Harrison said. “When you’re doing judo, you’re gripping, your hands are moving, so I already have that spatial awareness for striking, which I think gives me an advantage learning a new sport. “I’ve been doing the same thing for 20 years. Everything I do in judo I learned in the first six months with the Pedros. Now I’m learning new things. I’m learning heel hooks and knee bars and a jab and a hook, uppercuts. It’s invigorating. ” Still, Harrison is aware that the differences are there, and that they are real. Soon, for the first time, she will be hitting people in the face, and being hit in the face in return. “Judo is controlled violence,” she said. “Judo in Japanese means ‘the gentle way.’ It’s about disarming your opponent or defending yourself, but never killing them. But M. M. A. is   gladiating. So, yeah, I’m scared. Absolutely. I would be foolish not to be. ”'"}, "time": 1742561773.4869037}