{"duration": 0.04996061325073242, "input_args": {"text": "'Iraq Iraqi firefighters work to extinguish the fire caused by a car bomb explosion at a gas station near the city of Hilla, November 24, 2016. \\nA car bomb has reportedly exploded south of the Iraqi capital, Baghdad, killing around 100 people, mostly Shia pilgrims. \\nAccording to security sources, a truck loaded with explosives went off on Thursday at a gas station in the Shomali village in the suburbs of the city of al-Hilla, located 120 kilometers (75 miles) southeast of the capital Baghdad and around 80 kilometers (50 miles) from Karbala. \\nReports say most of the victims were Iranian nationals. The photo shows the site of a blast at a gas station near Hilla, south of the Iraqi capital, Baghdad, November 24, 2016. \\nThe incident occurred at a time when buses packed with Shia pilgrims were parked at the gas station. The people were returning from Arba’een mourning rituals in the holy city of Karbala. \\n“At least seven buses with pilgrims were inside the petrol station at the time,” an unnamed police lieutenant colonel told AFP. People carry away the bodies of victims from the site of a bomb attack near Hilla, Iraq, November 24, 2016. \\nAFP also quoted an unnamed police intelligence source as saying that “those buses were loaded with Iranians, Bahrainis and Iraqis. Ambulances and civil defense are on their way to the site.” \\nThe Takfiri Daesh terrorist group claimed responsibility for the deadly bombing. \\nIn recent weeks, Daesh has resorted to similar acts of violence in areas outside its control in a desperate attempt to undermine a large Iraqi battle aimed at liberating the northern city of Mosul, the terror group’s last remaining foothold in the country. \\n‘Iran won’t waver in backing Iraq’ \\nHours after the incident, Iran’s Foreign Ministry spokesman strongly condemned the fatal terrorist blast, expressing sympathy with the Iraqi government and nation as well as all the families of the victims. \\nTouching on reports that Iranian citizens were among the victims, Bahram Qassemi said, “The Foreign Ministry and the Islamic Republic of Iran’s Embassy in Baghdad are investigating the issue with seriousness” and will take necessary measures in that regard. \\nThe Iranian official also stressed that such pre-planned and savage assaults emanate from the desperation of the terrorists, who are taking successive blows on the battlefield. \\n“These brutal and inhumane acts will not affect the Iraqi government and nation’s determination and the Islamic Republic of Iran’s support for the oppressed Iraqi people in the unrelenting fight against terrorism,” Qassemi said. The photo shows the site of a blast at a gas station near Hilla, south of the Iraqi capital, Baghdad, November 24, 2016. \\n‘Terrorists killing pilgrims will be brought to justice’ \\nIn another development, Iraq’s President Fuad Masum strongly condemned the terrorist attack in Hilla, emphasizing that such terrorist crimes would not go unpunished. \\nIssuing an official statement hours after the terrorist attack, which was claimed by the Daesh Takfiri group, Masum emphasized that terrorists, who target the lives of innocent pilgrims traveling to Iraq from Islamic countries, will be brought to justice. \\nHe also called on Iraq’s security forces to double their efforts and take necessary measures to uproot terrorist groups that endanger the life and safety of the pilgrims visiting Iraq’s holy shrines. Iraqi security forces gather at the site of a truck bomb attack targeting a gas station in the city of Hilla south of Baghdad, Iraq, November 24, 2016. (Photo by REUTERS) \\n‘Takfiris spilling blood in the name of religion’ \\nMeanwhile, Lebanon’s resistance movement, Hezbollah, condemned the explosion as a crime committed by the terrorists, who have no conscience and spill the blood of innocents in the name of the religion. \\nIn a statement released on Thursday, Hezbollah extended its condolences to the Iraqi nation over the tragedy, calling for more efforts to root out terror outfits in Iraq and restore security to the country. A man reacts at the site of a truck bomb attack targeting a gas station in the city of Hilla south of Baghdad, Iraq, November 24, 2016. (Photo by REUTERS) \\nGruesome violence has plagued the northern and western parts of Iraq ever since Daesh terrorists mounted an offensive there more than two years ago, and took control of portions of Iraqi territory. \\nIraqi army soldiers and allied fighters are trying to win back militant-held regions in joint operations. \\nThe United Nations Assistance Mission for Iraq (UNAMI) says a total of 1,792 Iraqis, among them 1,120, lost their lives in acts of terrorism, violence and armed conflict in October. Loading ...'"}, "time": 1742628601.6575782}