{"duration": 0.07778668403625488, "input_args": {"text": "'Doctors prescribe deadly opioid for pain-related issues that aren’t even legal share in: Big Pharma , FDA , Harmful medicine , Health , medical marijuana , Pharmaceutical Drug Addiction \\nCorruption. Bribery. Death. All three are examined in various news reports on a little known “specialty pharmaceutical company” called Insys Theraputics. They are currently under legal fire for Subsys, a controversial sublingual spray that disperses fentanyl, a very fast acting opioid that is “80 times more potent than morphine.” The under the tongue delivery allows the fentanyl to bypass the gastrointestinal system and deliver the opioid directly into the blood stream. The Federal Drug Administration (FDA) has ruled that Subsys can only be prescribed to help cancer patients gain relief from “sudden spikes of excruciating pain.” \\nSarah Fuller was a 32 year old woman who suffered from anxiety and fibromyalgia . She didn’t have cancer. But that didn’t stop her doctor from prescribing Subsys for her aches and pains. The fentanyl acted quickly with Sarah’s already prescribed Xanax, a benzodiazepine. She died. Her family is suing the manufacturer. But why did Sarah’s doctor prescribe a drug that wasn’t approved? That’s easy to answer. Just follow the money. \\nAs Stat reports, the sales of Subsys grew to $331 million precisely because physicians give it to patients that don’t have cancer, like Sarah Fuller. Doctors get big dollars to simply talk about the drug over dinner, or lunch. Over $6 million dollars have been paid to doctors and health practitioners for this word of mouth activity. \\nTake the example of nurse practitioner Heather Alfonso from Illinois. She was paid $83,000 to “go to dinner with a few people,” and in response, prescribed $1.6 million dollars of Subsys scripts to patients that weren’t suffering with cancer pain. She didn’t contest the allegations against her. \\nGetting paid to speak isn’t automatically a bribe, but it appears to be a consistent theme when it comes to Susbys marketing methods. Alabama prosecutors built a case against Nancy Reed Perhacs, who used to be a sales representative for Insys Theraputics. Ms. Perhacs coordinated speaking fees for a doctor friend, provided he prescribed Subsys. Her take was $700,000. Other investigations about similar practices are ongoing in Kansas, Rhode Island, New York, Oregon, Michigan, Florida and New Hampshire. \\nThe chief executive, founder and chairman of Insys Theraputics is billionaire John Kapoor. He’s been around the block with other controversial pharmaceutical start ups. Kapoor thinks doctors are “all ethical.” His new FDA approved drug is a chemically created synthetic tetrahydrocannabinol (THC) called Syndros. As states legalize the real medicine in cannabis , THC and CBD oil , this is an important pharmaceutical to boycott. \\nSources: '"}, "time": 1742564621.361662}