{"duration": 0.16027498245239258, "input_args": {"text": "'Via UsualRoutine “There exists a shadowy government with its own Air Force, its own Navy, its own fundraising mechanism, and the ability to pursue its own ideas of the national interest, free from all checks and balances, and free from the law itself.” – Senator Daniel K. Inouye, the highest-ranking Asian-American politician in United States history SPONSORED LINKS Scroll Down For Video Below \\nOne great way to find out is to follow the money, and in doing so, it becomes immediately apparent that corporations sit higher than the government itself. \\n“It’s corruption really, the might of money, the corporations that hold governments in their hands, because of lobbying power and so forth, it’s really frightening.” – Jane Goodall ( source ) \\nThe recognition that we now live in a ‘corporatocracy’ rather than a democracy has become almost a commonplace for many people. Above the corporations (who continually require access to cheap money), however, are the big banks. These groups supply cheap loans to corporation, enabling them to maintain their lobbying power and thus their influence over governmental policy. The banks in question include Chase, Bank of America, and Goldman Sachs, to name a few. \\nAbove these big banks are the national central banks, like the Bank of England and the Federal Reserve. Above them still are the international central banks — the International Monetary Fund (IMF) and the World Bank. And finally, above these two is the central bank of central banks, the Bank for International Settlements. \\nThe Rockefeller and Rothschild families are and have been involved with the creation of this system. If we follow the money, that is precisely where it leads. \\nWhen it comes to the UFO phenomenon, we know that governments have been kept in the dark, that there are developments being made within the “ black budget ” world, most notably within unacknowledged and waived Special Access Programs (SAPs), that ‘world leaders’ know little about. \\n“It is ironic that the U.S. would begin a devastating war, allegedly in search of weapons of mass destruction, when the most worrisome developments in this field are occurring in your own backyard. It is ironic that the U.S. should be fighting monstrously expensive wars in Iraq and Afghanistan, allegedly to bring democracy to those countries, when it itself can no longer claim to be called a democracy, when trillions, and I mean thousands of billions of dollars have been spent on projects about which both the Congress and the Commander in Chief have been kept deliberately in the dark.” – Paul Hellyer, Former Canadian Defence Minister ( source ) \\nI think it is a fair assumption to say that information surrounding UFOs and extraterrestrials, along with this “shadow” government, lies within the hands of those who sit atop these major financial institutions — a group of private, international elites. \\n“A power has risen up in the government greater than the people themselves, consisting of many, and various, and powerful interests, combined into one mass, and held together by the cohesive power of the vast surplus in the banks.” ( source ) – John C. Calhoun, the 7th Vice President of the United States \\nToday, we have no shortage of evidence for the existence of UFOs. In fact, the reality of these objects has been officially verified in the ‘mainstream’ world, as thousands of government documents have been released showing that there are objects in our atmosphere performing impossible maneuvers at unbelievable speeds. The Rockefeller Family and UFOs \\nWhat evidence is available suggesting that the Rockefeller family had information regarding UFOs and possible extraterrestrials? \\nWe can start with the fact that we now know that Laurence Rockefeller, the prominent third-generation member of the Rockefeller family and the fourth child of John D. Rockefeller, encouraged UFO research. \\nHow do we know this? \\nHe heavily supported the work of Harvard University professor, psychologist, and Pultizer prize winner Dr. John Mack, who had a great interest in UFOs and those who have had supposed contact with extraterrestrials. You can learn more about Mack in an article we published earlier this year where he dealt with 60 school children who all witnessed non-human beings and a large craft landing. According to the US National Library of Medicine, Mack’s “disparate personas—from esteemed professor of psychiatry at Harvard Medical School to social activist and believer in alien abductions—were as incongruent as the extraordinary assemblage of his supporters, who included venture capitalist Laurence Rockefeller. . . .” ( source ) The John E. Mack Institute website also states that Rockefeller funded Mack. \\nPeter Sturrock, an Emeritus Professor of Physics, gathered a group of other world-renowned scientists in 1997 to stress the fact that the UFO topic deserves serious attention and is accompanied by physical evidence. The scientists met at the Pocantico Conference Center near Trrytown, New York, and the conference was financially supported by Laurance Rockefeller. ( source )( source ) \\nLaurence Rockefeller initiated an effort alongside Hilary Clinton and Bill Clinton encouraging the U.S. government to officially disclose the existence of extraterrestrials and UFOs. It’s what’s known today as the “Rockefeller Initiative,” and you can view all of the documents to and from Laurence Rockefeller to various people regarding this initiative here . They were obtained through the Freedom of Information Act by various researchers, including the Paradigm Research group, who was responsible for the Citizens Hearing on Disclosure, an event that brought together researchers and high ranking military and political personnel to testify about the reality of UFOs and extraterrestrials in front of several former United States congresspeople. You can learn more about that here . ( source ). Laurence has also supported the work of Dr. Steve Greer, head of the disclosure project . \\nHERE is a picture with Hillary Clinton meeting with Laurence Rockefeller, holding a book believed to be written by Paul Davies titled, “Are We Alone?” You can see from the information above why it’s not unreasonable to assume this, and we published an article earlier this year explaining how we determined the identity of the book. What’s interesting about this point is the fact that John Podesta, Former White House Chief of Staff under the Clinton Administration, councillor to Barack Obama, and current head of Hilary Clinton’s presidential campaign, has gone on the record stating that: \\nI’m skeptical about many things, including the notion that government always knows best, and that the people can’t be trusted with the truth. The time to pull the curtain back on this subject is long overdue. We have statements from the most credible sources – those in a position to know – about a fascinating phenomenon, the nature of which is yet to be determined. (taken from Leslie Kean’s 2010 New York Times bestseller, UFOs: Generals, Pilots, And Government Officials Go On The Record, for which Podesta wrote the forward) \\nPodesta also made a live appearance at the National Press Club years before this, stating that “it’s time to open the books on questions that’ve remained in the dark” regarding “government investigations of UFOs.” ( source ) \\nSo What Exactly Does The Rockefeller Family Know About UFOs? \\nAs stated earlier, based on my research, I believe that the secrecy surrounding this subject has been dictated by a small group of elite who sit atop the global financial system. I believe this same international group has heavy influence inside the military industrial complex/ black budget , and I believe they are responsible for what President Eisenhower warned us about many years ago — “the acquisition of unwarranted influence whether sought or unsought, by the military industrial complex. The potential for the disastrous rise of misplaced power exists, and will persist.” \\nI also believe that information regarding this subject could lie in the hands of people above those who control our global economy/financial systems — with a group that’s completely, one hundred percent clandestine, even possibly beyond the big banks… but who really knows? \\nThat being said, it’s only possible to find information linking Laurence Rockefeller to UFOs; we don’t have much evidence to suggest his other family members have been involved, but it’s not illogical to assume that given the fact that Anne Bartley, the stepdaughter of Winthorp Rockefeller, was also involved We know he has shown a clear interest in the subject, and, as illustrated above, financed a few prominent people who were studying the subject. It’s clear that Laurence had a heavy interest in this subject and certainly encouraged the disclosure of classified information, as the above information demonstrates. Whether he was doing this out of pure interest or because he and his family were already involved in the cover-up is unclear. Who knows what information he was privy to? Or what the other members of his family knew about the subject? Laurence was the only one to openly take interest in it, but other members of his family could have been working behind the scenes. \\nWhat are your thoughts?'"}, "time": 1742562323.9543447}