{"duration": 0.027426719665527344, "input_args": {"text": "'Teenager ‘enamored with ISIS’ in court over ‘viable device’ found on London... Teenager ‘enamored with ISIS’ in court over ‘viable device’ found on London Underground By 0 53 \\nA poker-fixated teenager, who was “enamored with ISIS” and charged in connection with a “viable device” found on the London Underground, has appeared in court. \\nDamon Smith, 19, of South East London, has been accused of unlawfully and maliciously making or possessing an explosive substance with intent to endanger life or cause serious danger to property, the Metropolitan Police said. BREAKING – 19 year old Damon Smith charged with possessing or constructing explosives after device left on London tube train last Thursday pic.twitter.com/b0BekmI1aw \\n— Mark White (@skymarkwhite) October 26, 2016 \\nHe did not enter a plea in relation to the charge during his hearing at the Westminster Magistrates’ Court on Thursday. \\nDefence counsel Simon Eastwood, however, indicated that his client, who has a form of autism, would be pleading not guilty on the grounds it was a prank, according to Sky News. \\nThe device was found last Thursday on a tube carriage on the Jubilee Line at North Greenwich station, near the O2 Arena. It had been left inside an abandoned black Adidas rucksack and was found by two members of the public. \\nRead more \\nThe station was evacuated for several hours, and counter-terrorism police destroyed the item in a controlled explosion. \\nThe prosecution told the court that experts carried out a forensic examination of the package and deemed it to be a “viable improvised explosive device” which would have caused injury had it detonated. \\nThe bomb was a “pressure” type device and contained grey powder, ball bearings, and a clock-type detonator, the court was told. \\nFour properties have been searched in connection with the investigation. \\nOn Saturday, another device was discovered at an address in Newton Abbot by police investigating the North Greenwich incident. The item was later declared not viable. \\nSmith had just moved to London from Newton Abbot, Devon, to study IT at the London Metropolitan University. \\nHe has been described as a “mummy’s boy” and a “loner,” with an interest in martial arts and online poker. \\nFriends of Smith have also claimed he was “enamored” with Islamic State (IS, formerly ISIS/ISIL), Sky reports. \\n“He had a Koran and knew several phrases and he wore a black headscarf. Damon had replica guns and air rifles and even posted a video of himself shooting a replica Glock on YouTube,” a former friend told the Sun. \\nSmith has been remanded back into custody and will next appear at the Old Bailey on November 17. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742564399.314386}