{"duration": 0.05553913116455078, "input_args": {"text": "'Donald J. Trump, who said last week that a   judge was biased against him because of his heritage, said on Tuesday that his remarks had been “misconstrued” and that he did not think that the judge’s ethnicity created a conflict of interest. “I do not feel that one’s heritage makes them incapable of being impartial,” Mr. Trump said in a long statement in which he continued to raise questions about his treatment in the Trump University case. Mr. Trump created a firestorm last week when he suggested that Judge Gonzalo P. Curiel, who was born in Indiana, was not handling his case fairly because of his immigration policies, which include deporting immigrants in the country illegally and building a wall along the southern border. The remarks were considered racist by Democrats and Republicans, several of whom distanced themselves from the presumptive Republican nominee. Mr. Trump said in his statement that he had many friends of Hispanic and Mexican descent and that he thought that his words had been twisted. The reversal was a rare one for Mr. Trump, who has tended to dig in after his provocative remarks have stirred controversy. However, after many Republicans started to panic about the direction of his campaign he tempered his tone toward the judge. “It is unfortunate that my comments have been misconstrued as a categorical attack against people of Mexican heritage,” Mr. Trump said. “I am friends with and employ thousands of people of Mexican and Hispanic descent. ” “The American justice system relies on fair and impartial judges,” he added . “All judges should be held to that standard. ” Mr. Trump, who did not apologize for the remarks, continued to express doubts about Judge Curiel, noting that he was appointed to the federal bench by President Obama. “Due to what I believe are unfair and mistaken rulings in this case and the judge’s reported associations with certain professional organizations, questions were raised regarding the   judge’s impartiality,” Mr. Trump said. “It is a fair question. I hope it is not the case. ” Heeding calls from Republican leaders to focus on issues that matter to Americans, Mr. Trump said he remained focused on bringing jobs back to the country. He also insisted that he would win the Trump University case. “While this lawsuit should have been dismissed, it is now scheduled for trial in November,” Mr. Trump said. “I do not intend to comment on this matter any further. ” In an interview with The New York Times last week, Mr. Trump said it was clear that he considered Judge Curiel’s heritage an issue: “I’m building the wall, I’m building the wall. I have a Mexican judge. He’s of Mexican heritage. He should have recused himself, not only for that, for other things. ” Some of Mr. Trump’s critics said that his statement did not go far enough. Jeb Bush, a former rival for the Republican nomination whose wife is from Mexico, has been largely silent since exiting the race but on Tuesday said that Mr. Trump should fully retract what he said. “Donald Trump should retract his comments, not defend them,” Mr. Bush wrote in a post on Twitter. “There is no place for racism in the GOP, or this country. ”'"}, "time": 1742563243.161377}