{"duration": 0.04735994338989258, "input_args": {"text": "'After coming under fire from her fans and celebrity colleagues, RB and soul   Chrisette Michele is defending her decision to perform at an undisclosed event during Donald Trump’s inauguration. [“We can’t be present if we’re silent,” Michele wrote in an open letter she posted to Twitter Friday.  The   says she is willing to take the heat if it means she can “be a bridge” to bring people together. “I am willing to be a bridge. I don’t mind These Stones, if they allow me to be a voice for the voiceless,” the singer wrote. https:  .  | An Open Letter pic. twitter.   —   chrisette michele (@ChrisetteM) January 19, 2017,  Though Michele has worked with the likes of Jay Z, John Legend and will. I. am, the    star has faced backlash for agreeing to perform for Trump. Film director Spike Lee said he’s no longer using Michele’s song “Black Girl Magic” in his new Netflix series after he learned of her inauguration event. “I Wuz Thinkin’ ’bout Using Chrisette’s   BLACK GIRL MAGIC In My Netflix Series SHE’S GOTTA HAVE IT  …    . NOT ANYMORE,” Lee wrote in an Instagram post.  Good Morning Folks. I Wuz Sorry To Read That ”Sistuh Girl” Is Singin’ At DT’s Inauguration (And To Use His Fav  ). I Wuz Thinkin’ ’bout Using Chrisette’s   BLACK GIRL MAGIC In My Netflix Series SHE’S GOTTA HAVE IT  …    . NOT ANYMORE. And Dat’s Da Truth, Ruth. A photo posted by Spike Lee (@officialspikelee) on Jan 19, 2017 at 4:10am PST,  Questlove, drummer for The Roots, the longtime   band for The Tonight Show Starring Jimmy Fallon,  tweeted on Wednesday that he would pay Michele not to perform at Trump’s inauguration. I’d pay Chrisette to NOT perform 😔  —   Questlove Gomez (@questlove) January 18, 2017,  Michele joins a growing lineup of inaugural performers many of them, including Toby Keith, and rock band Three Doors Down, are expected to perform Friday for the “Make America Great Again! Welcome Celebration. ” Soul singer and civil rights activist Sam Moore, who also recently defended his decision to perform at the inauguration, is also expected to tale the stage on Friday.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562108.1923938}