{"duration": 0.10558056831359863, "input_args": {"text": "'In Historic First, ICC Preparing to Investigate US War Crimes in Afghanistan   An employee of Doctors Without Borders stands among the charred remains of a hospital hit by a U.S. airstrike in Kunduz, Afghanistan. (Najim Rahim / AP) \\nThe International Criminal Court (ICC) is preparing to initiate a full investigation into potential war crimes in Afghanistan, including those committed by U.S. military personnel, Foreign Policy exclusively reported Tuesday. \\nThe magazine writes: \\nMultiple sources have indicated that the chief prosecutor, Fatou Bensouda, will seek to initiate an investigation in the coming weeks, likely after the U.S. presidential election but before the end of the year. U.S. officials visited The Hague recently to discuss the potential investigation and to express concerns about its scope. \\nA formal investigation of U.S. activities would be the first in the history of the ICC, to which the U.S. is not a party. But because Afghanistan is a member, an investigation is “certainly possible,” Phyllis Bennis of the Institute for Policy Studies told Common Dreams. “Afghanistan joined the ICC in 2003, so all actions after that time are subject to ICC jurisdiction,” Bennis said. \\n  \\n“But then you get to the question of political will,” Bennis added. \\nThe ICC has famously failed to investigate powerful Western nations while prosecuting African dictators, a disparity so glaring that several African countries recently quit the court, condemning it as the “International Caucasian Court.” \\n“Is the prosecutor concerned enough about the accusations of discrimination levied against the ICC that she’s willing to go after U.S. clients and U.S. officials?” Bennis asked. \\nRights advocates hope that Bensouda may be willing to take aim at powerful nations. The prosecutor was behind the preliminary ICC report published last year, “Report on Preliminary Examination Activities,” which suggested that the U.S. was “responsible for ‘physical and psychological’ violence and torture that ‘debased the basic human dignity’ of those detained” in Afghanistan, as Common Dreams reported . \\nIndeed, photos released by the Pentagon earlier this year demonstrated the brutal abuse of detainees at the hands of U.S. forces in Afghanistan. \\nBensouda may also probe the deadly bombing by U.S. forces of a Doctors Without Borders/Médecins Sans Frontières (MSF) hospital in Kunduz, Foreign Policy reports. MSF has characterized the airstrike as a war crime, and rights groups have harshly criticized the Pentagon for its light punishment of those responsible for the attack. \\nDespite the looming investigation, Foreign Policy observes that prosecution of U.S. forces for war crimes is still a long way away and may not happen: \\n[Prosecution] would require significantly more evidence than the prosecutor’s office currently possesses. The ICC normally does not interview witnesses, take testimony, or gather forensic evidence during its preliminary examinations, and that work would be just the beginning. \\nIn order to charge Americans with war crimes, Bensouda would likely also have to demonstrate a link between the conflict in Afghanistan and U.S. detention policies, which may not be easy; the United States reportedly brought several detainees to Afghanistan from other parts of the world. Perhaps most controversial, the prosecutor’s office would have to determine that the United States has failed to address allegations of torture through its own domestic prosecutions, investigations, and reviews. \\nMoreover, any indictments related to Afghanistan would be months if not years away. Because no ICC member has referred the situation to the court, Bensouda will need the approval of a three-judge panel before launching an investigation. ICC judges have approved all three previous investigative requests from the prosecutor (in Kenya, Cote d’Ivoire, and Georgia), but their review can take several months, and the judges might request additional information before authorizing an investigation. \\n“Still, the readiness of the prosecutor’s office to open an investigation represents a sharp setback for President Barack Obama’s administration, which has sought several times to discourage an investigation in Afghanistan and even to avoid ICC mention of possible U.S. crimes,” Foreign Policy notes. \\nAnd once an investigation is underway, Bennis noted, the ICC prosecutor will be faced with “the question of how far up the chain of command do you go.” \\n“Do you start and stop with the soldier who tortured and abused detainees? This is what happened with Abu Ghraib,” Bennis explained. “Individual soldiers were slapped on the wrist. Their commanders who set the standards that said it was okay to humiliate and sexually abuse people, to tie them up naked in a dog collar and take pictures of it—the commander establishes the tone of what their work entailed, but that was never considered.” \\nBennis observed: “One of the questions that will have to be dealt with by the prosecutor if she decides to go forward is: do you go all the way up? Do you go after George W. Bush for using torture as a part of U.S. strategy? TAGS:'"}, "time": 1742561743.990056}