{"duration": 0.05647540092468262, "input_args": {"text": "'Getty - Saul Loeb The Wildfire is an opinion platform and any opinions or information put forth by contributors are exclusive to them and do not represent the views of IJR. \\nWith ObamaCare premiums set to soar in some states by more than 50% in 2017, Barack Obama and the Democrats are busting their butts to blame anyone and everything they can for the staggering increases and unpopularity of the so-called \\'Affordable\\' Care Act. \\nOn Monday, ObamaCare architect Ezekiel Emanuel and CNN blamed Republicans for the price hikes, with Emanuel actually saying they\\'re “not a big increase.” \\nThursday afternoon, Obama came up with a new scapegoat: the media . THE MEDIA. — Washington Examiner (@dcexaminer) October 27, 2016 \\nSome would argue that the so-called \\'mainstream media\\' has carried Obama\\'s water for eight years. Yet, they\\'re to blame for the ObamaCare trainwreck? Yup. \\nObama told more than 25,000 volunteers on a White House call: \\n\"We\\'re not going to get that much help from the media. This is going to be a ground game. \\nThere is a faction of people who are continually trying to root for failure, despite the fact that we keep on insuring people and folks continue to get help.\" \\nThat “faction of people” is a majority of Americans, by the way. Here\\'s what a recent Gallup poll found: \\n51% disapprove of the law; 44% approve \\n18% say it has helped their families; 29% say it has hurt them \\nLong term, most Americans believe it will hurt or not make a difference \\nAnyway, Obama told the volunteers that they\\'ll have to help him “clear the mud off the windshield” to get people to sign up— mud presumably put there by the media. \\nSpeaking of the media, Townhall\\'s Guy Benson and The Daily Caller\\'s Derek Hunter were a bit \\'skeptical\\' of Obama\\'s charge: The press is sending those premium hike letters, canceling people\\'s plans, and forcing insurers out of the exchanges?? Wow! ???? #whining https://t.co/0b2ffrdX7I — Guy Benson (@guypbenson) October 28, 2016 Yesterday it was Republicans\\' fault, now it\\'s the media. Total number of media and Republicans who voted for/had any input in Obamacare = 0. https://t.co/rGjeM95bL4 — Derek Hunter (@derekahunter) October 28, 2016 \\nAs were other Twitterers: Oh. I guess the press wrote a dumpster fire law, passed it with trickery in the middle of night, after lying about it. Interesting take. https://t.co/kvVjLaIKZT '"}, "time": 1742562034.5882123}