{"duration": 0.10097193717956543, "input_args": {"text": "'WASHINGTON  —   Pressure mounted on Sunday for a broader congressional investigation of Russian cyberattacks aimed at influencing the American election, even as a top aide to   Donald J. Trump said there was no conclusive evidence of foreign interference. The effort was being led by a bipartisan group of senators, including John McCain, Republican of Arizona, and Chuck Schumer of New York, the Senate Democratic leader, who called on Sunday for the creation of a Senate select committee on cyberactivity to take the investigative lead on Capitol Hill. “Recent reports of Russian interference in our election should alarm every American,” the senators wrote on Sunday in a letter to Senator Mitch McConnell, Republican of Kentucky and the majority leader, who has said a select committee is not necessary. “Cybersecurity is the ultimate   challenge, and we must take a comprehensive approach to meet this challenge effectively. ” The developments served to deepen the fissures between   lawmakers of both parties who see American intelligence reports implicating Russia as the basis for additional inquiries and Mr. Trump, who continues to reject the conclusions of those reports. But the developments also put new strain on Mr. McConnell. He now faces calls from Mr. McCain and Lindsey Graham, two Senate Republicans considered well versed on national security issues, to form a select committee. If he were to reject that appeal, he would be subject to criticism that he was trying to avoid a spotlight on an issue that senators in both parties believe is worthy of more focused scrutiny. Mr. McConnell said last week that while he respects the intelligence agencies’ conclusions, the Senate Intelligence Committee is “more than capable of conducting a complete review” itself. He also acknowledged that Mr. McCain could conduct an investigation on the Armed Services Committee, an option that remains open should Mr. McConnell decide against a select committee. Those divisions, coming as the Electoral College prepares to meet on Monday to ratify Mr. Trump’s election and the   completes his cabinet choices, all but ensured that the issue would cloud the first months of Mr. Trump’s presidency, when he will be asking Congress to approve an aggressive legislative agenda. Several permanent congressional committees have already been tasked with examining various aspects of the Russian interference, which has been largely accepted as fact by most members of Congress. But in their letter on Sunday, the lawmakers argued the issue was too important and complicated for an existing committee to take on properly. “We share your respect for, and deference to, the regular order of the Senate, and we recognize that this is an extraordinary request,” the senators wrote to Mr. McConnell. “However, we believe it is justified by the extraordinary scope and scale of the cyber problem. ” In addition to undertaking a “comprehensive investigation of Russian interference,” the senators recommended that such a committee also develop “comprehensive recommendations and, as necessary, new legislation to modernize our nation’s laws, governmental organization, and related practices to meet this challenge. ” Select committees, which are typically created to examine a particular issue for a limited time, are rarely formed. The most prominent recent example is the House Select Committee on the attacks in 2012 on the American diplomatic compound in Benghazi, Libya, an inquiry that Democrats have denounced as unduly partisan. Speaker Paul D. Ryan said last week that the House Intelligence Committee would continue its own examination of Russian hacking. Mr. Schumer said in a news conference on Sunday that they intended to avoid such charges of partisanship. “We don’t want it to just be finger pointing at one person or another,” Mr. Schumer said. “We want to find out what the Russians are doing to our political system and what other foreign governments might do to our political system. And then figure out a way to stop it. ” A spokesman for Mr. McConnell, David Popp, referred to Mr. McConnell’s earlier comments and said the majority leader would be reviewing the latest letter. The letter was also signed by Mr. Graham, Republican of South Carolina, and Senator Jack Reed, Democrat of Rhode Island, two members of the Senate Armed Services Committee that Mr. McCain leads. It follows a signed statement from the lawmakers, released last week, warning that any congressional investigation into the hacks “cannot become a partisan issue. ” Mr. Trump, for his part, has sought to paint the intelligence community’s conclusions about the matter as just that  —   a partisan attack against him. He said last week that the reports were “just another excuse” by Democrats frustrated with the election results that might be used to try to undermine his victory. Asked on CBS’s “Face the Nation” on Sunday what information Mr. Trump had received that led him to reject intelligence assessments, Kellyanne Conway, one of Mr. Trump’s top advisers, insisted that the reports about the hacking were groundless. “Where is the evidence?” Ms. Conway asked, turning the question around. “Why, when C. I. A. officials were invited to a House intelligence briefing last week, did they refuse to go?” Robert M. Gates, the former defense secretary under President Obama and President George W. Bush who has offered counsel to Mr. Trump, speculated on NBC’s “Meet the Press” that the   “felt the way this information came out through newspaper stories and so on was somehow intended to delegitimize his victory in the election and that he’s reacting to that rather than ‘the facts on the ground,’ as it were. ” But Mr. Gates also said the Russian hacking was aimed at discrediting the American electoral process. “Whether or not it was intended to help one candidate or another, I don’t know,” said Mr. Gates, who also served as C. I. A. director under President George Bush. “But I think it clearly was aimed at discrediting our elections, and I think it was aimed certainly at weakening Mrs. Clinton. ” Mr. Obama, in a news conference on Friday, vowed that the United States would respond to the attack. He said that he was still weighing a mix of covert and public actions to retaliate before he leaves office. And lawmakers from both parties have proposed new sanctions to punish Russia. Speaking Sunday on CNN’s “State of the Union,” Mr. McCain sought to add urgency to the matter. “There’s no doubt they were interfering and no doubt that it was cyberattacks,” he said of the Russians. “The question now is how much and what damage and what should the United States of America do? And so far, we have been totally paralyzed. ” Mr. McCain said that he had faith that “reality is going to intercede at one point or another” on Mr. Trump, suggesting that the   might come to agree about Russian influence. Asked on CBS about Mr. Obama’s pledge of retaliation, Ms. Conway said Mr. Trump “respects” Mr. Obama’s right to respond as he sees fit for the remainder of his presidency. But, she added, that “doesn’t mean that new President Trump will agree with it and continue it. ” “It does seem to be a political response at this point because it seems like the president is under pressure from Team Hillary, who can’t accept the election results,” she said.'"}, "time": 1742561761.401971}