{"duration": 0.6246449947357178, "input_args": {"text": "'10 Signs That An All-Out Attempt Is Being Made To Sabotage The Trump Campaign Michael’s Latest Video The New York Times Calls For Obama To Support A UN Resolution That Would Divide The Land Of Israel   October 9th, 2016 \\nWhile most Americans are focused on the endless circus surrounding Donald Trump and Hillary Clinton , a drama of earth-shattering importance is playing out behind the scenes. Most people seem to assume that we don’t have to be concerned about Barack Obama anymore because his second term is scheduled to end in a few months, but the truth is that an absolutely critical decision is in his hands right now. Both Donald Trump and Hillary Clinton have said that they will not support a proposed UN Security Council resolution that would formally establish a Palestinian state, that would set the parameters for the new state, and that would grant them East Jerusalem as their capital. So at this moment there is a tremendous amount of international pressure on Barack Obama to support such a resolution, because the U.S. veto power on the UN Security Council is the only thing standing in the way of formally dividing the land of Israel. I wrote about this in August , in September , and now I am writing about it again in October. If Obama is going to do this, it needs to happen by January 20th, 2017, and so for the next few months we are officially in “the danger zone”. \\nOn Thursday, the New York Times editorial board added their voice to the growing chorus of those calling for a “parameters resolution” in a piece entitled “ At the Boiling Point With Israel “… \\nThe best idea under discussion now would be to have the United Nations Security Council, in an official resolution , lay down guidelines for a peace agreement covering such issues as Israel’s security, the future of Jerusalem , the fate of Palestinian refugees and borders for both states . \\nIn the article, the New York Times editorial board also strongly endorsed the U.S. State Department’s recent condemnation of Israel’s plan to build new housing units in the West Bank. \\nI have included the official State Department statement on this matter below. Just like Barack Obama did at the UN recently , the State Department referred to Israel’s presence in the West Bank as an “occupation”… \\nWe strongly condemn the Israeli government’s recent decision to advance a plan that would create a significant new settlement deep in the West Bank. \\nProceeding with this new settlement, which could include up to 300 units, would further damage the prospects for a two state solution. The retroactive authorization of nearby illegal outposts, or redrawing of local settlement boundaries, does not change the fact that this approval contradicts previous public statements by the Government of Israel that it had no intention of creating new settlements. And this settlement’s location deep in the West Bank, far closer to Jordan than Israel, would link a string of outposts that effectively divide the West Bank and make the possibility of a viable Palestinian state more remote. \\nIt is deeply troubling, in the wake of Israel and the U.S. concluding an unprecedented agreement on military assistance designed to further strengthen Israel’s security, that Israel would take a decision so contrary to its long term security interest in a peaceful resolution of its conflict with the Palestinians. Furthermore, it is disheartening that while Israel and the world mourned the passing of President Shimon Peres, and leaders from the U.S. and other nations prepared to honor one of the great champions of peace, plans were advanced that would seriously undermine the prospects for the two state solution that he so passionately supported. \\nIsraelis must ultimately decide between expanding settlements and preserving the possibility of a peaceful two state solution. Since the recent Quartet report called on both sides to take affirmative steps to reverse current trends and advance the two state solution on the ground, we have unfortunately seen just the opposite. Proceeding with this new settlement is another step towards cementing a one-state reality of perpetual occupation that is fundamentally inconsistent with Israel’s future as a Jewish and democratic state . Such moves will only draw condemnation from the international community, distance Israel from many of its partners, and further call into question Israel’s commitment to achieving a negotiated peace. \\nAs you can see on the official State Department website , that press release was issued on October 5th. \\nAt the exact same time, Hurricane Matthew was rapidly gaining strength, and it ultimately became the first category 5 hurricane to form in the Atlantic since 2007. It proceeded to slam into the southeastern United States, causing billions of dollars of damage in the process. The following comes from Wikipedia … \\nPreparations began in earnest across the southeastern United States as Matthew approached, with several states declaring a state of emergency for either entire states or coastal counties; widespread evacuations were ordered for extensive areas of the coast. On October 6, U.S. President Barack Obama declared a federal state of emergency for Florida. [1] The federal disaster declaration was later extended to include Georgia and South Carolina. [2] In Florida, over 1 million lost power as the storm passed to the east, with 478,000 losing power in Georgia and South Carolina. \\nWhen will we learn? \\nFor decades the pattern has always been the same. Every time we come against Israel, the consequences are immediate and they are dramatic. \\nUnfortunately, our leaders never seem to learn, and now we stand on the precipice of perhaps the biggest betrayal of Israel of all time. Here is more from the New York Times about why they believe it is important to put “pressure” on Israel in the form of a UN Security Council resolution… \\nThe most plausible pressure would come from Mr. Obama’s leading the Security Council to put its authority behind a resolution to support a two-state solution and offer the outlines of what that could be. That may seem like a bureaucratic response unlikely to change anything, but it is the kind of political pressure Mr. Netanyahu abhors and has been working assiduously to prevent. \\nNo, such a resolution would not just be “a bureaucratic response”. \\nA UN Security Council resolution would be legally binding on both Israel and the Palestinians, and whoever is elected in November would not be able to go back and undo it. \\nSuch a resolution would permanently divide the land of Israel, it would give formal UN recognition to a Palestinian state for the very first time, and it would hand East Jerusalem over to the Palestinians. \\nAnd according to the Times of Israel , the UN Security Council could begin discussing these matters as soon as next Friday… \\nThe Security Council is expected to hold a session next Friday under the official banner: “The settlements as the obstacle to peace and a two-state solution.” \\nThe meeting, initiated by the Palestinians, is considered the opening salvo to a resolution condemning Israel for settlement activity. \\nThis process could result in just a resolution condemning Israeli settlement activity, but there is also a tremendous amount of concern that Obama could use this as an opportunity to “leave a legacy” in the Middle East. Here is more from the Times of Israel … \\nIsraeli government members have been worried that Obama, before leaving office in January but after a successor is chosen in November, may seek to impose or advance a solution to the Israeli-Palestinian conflict, or at least set out parameters for how it should be solved, including through the Security Council by not using the US veto for any anti-Israel resolutions . \\nAccording to a Channel 2 report Thursday, an Israeli official charged that the “disproportionate criticism” from Washington over the latest construction plans was “an alibi” to cover plans by Obama to take anti-Israel actions in the final weeks of his presidency. \\nIf this happens, it will be the worst thing that Barack Obama has done during his entire time in the White House. \\nWhether it is Barack Obama or someone else, the truth is that someday the U.S. government will have a major role in dividing the land of Israel, and it is one of the most important prophetic markers that we are watching for. \\nBecause once the land of Israel gets divided, all hell is going to break loose in America. \\nI have discussed the potential consequences for dividing the land of Israel on television , and in my new book I warn about all of the historic disasters that are coming to this nation. \\nIf we get to January 20th and another president takes over and there has been no UN Security Council resolution, perhaps we can breathe a little bit of a sigh of relief. \\nBut if Barack Obama does what the New York Times and so many others are urging him to do, the consequences for this country and for the world will be absolutely unimaginable. \\nSo while you are keeping up with the latest insults that Trump and Clinton are hurling at one another, don’t forget about Obama, because what he decides to do regarding Israel in the months ahead is going to have dramatic implications for all of us. \\nAbout the author: Michael Snyder is the founder and publisher of The Economic Collapse Blog and End Of The American Dream. Michael’s controversial new book about Bible prophecy entitled “The Rapture Verdict” is available in paperback and for the Kindle on Amazon.com.* Russia Is Preparing For A Nuclear War With The United States » watchmannonthewall \\nLet’s see: If I remember correctly, Mr. Obama’s first visit to Israel came shortly after He was sworn in to begin his second term, about March of 2013. He never went there during his first term. \\nHe went to Jerusalem and encouraged college students to stand up to the Prime Minister, to seek “peace” the way Obama wanted it done, not the way Mr. Netanyahu publically stated it needed to come about. He sent advisors to the opposition to try and prop it up to keep the PM from being able to again form a goverment when Netanyahu called for early elections, while helping Israel’s enemies move right up to its borders in a number of places. He has been busy dividing the land of Israel, its people, for the last four years. Has anyone noticed he has done the same here, during the exact same period of time? Scipture says, “Do unto others as you would have them do unto you” and “Love your neighbor as you love yourself.” Those who don’t care for scripture say it this way, “What goes around, comes around.” Either way, the outcome is the same! iris \\nIt certainly appears that he has wanted Israel’s demise all along. GIVVO6_B \\nUnfortunately he doesn’t and his Mentor Rahm Emanuel (ex Israeli soldier) would not allow it. A.S. \\nIf G-f forbid, Israel is divided, I said this once and I said this again. When the Gaza expulsion happened, a day later Katrina happened. Around 10,000 Jews were lost their homes when expelled. Around 100,000 Americans lost their homes. \\nThis time, it will not be 10x, but 40x. 40 is a mystical number in Judaism. It is the number that relates to punishment and repentance. The rain lasted for 40 days during the flood. Moses was up on the mount for 40 days. The Jews were walking the desert for 40 years. This time, G-d will use 40x. \\nAccording to a google search: The total population of all settlements in the West Bank was nearly 400,000 in 2014, excluding East Jerusalem. As of December 2015, altogether over 800,000 Israeli Jews resided over the 1949 Armistice Lines (including east-Jerusalem neighborhoods), constituting approximately 13% of Israel’s Jewish population. \\nHowever, we are at the end of 2016 and I believe many people were accounted for, especially those that hold dual citizenship. I would put the number at about 1.25 million. If we take 1.25 M x 40 = 50 M. That is 50 million people that will lose their homes. So what may happen? \\nCalifornia has about 50 million people. A 10.0 Earthquake could strike and destroying everything into rubble. The North East U.S. has about 50 million people. Another hurricane could strike, this time flooding everything by about 10 feet of water. The area around the New Madrid fault line has about 50 million people. The Earthquake could strike and destroy everything. Or maybe the Yellowstone volcano will erupt, burying by 10 feet of ash 1/3 of the U.S. That is way more than 50 million people, but G-d loves Israel and doesn’t look at what happens from his vengeance. \\nSo take your pick people. Who is willing to offer themselves to be the sacrifice? Will people in CA stand by Obama? They seem to be behind Hillary. Will people in the North East stand by Obama? They seem to be behind Hillary too! If you want to have your homes, schools, roads, malls, community, etc., then tell Obama “NO NO NO. Dividing Israel will be the death of us.” \\nI hope Obama is listening. Because his legacy may just well be something like the state of California being turned into rubble. The North East being flooded with 10 feet of water. The midwest begin turned into rubble. 1/3 of the U.S. being buried with 10 feet of volcanic ash. How will Obama apologize for this? How will be come to the rescue? iris \\nI agree with you, A.S., those who come against His chosen people and I believe that also includes those who have put their hope and trust in Yeshua of Bethlehem, will only curse themselves. It may not always be a physical torment or event, but I’ve lived long enough to see that hatred, arrogance and their associated behaviors, always end up destroying individuals, families, etc. He is faithful to all of His promises and His warnings are meant to be taken just as seriously. He is so much bigger than all of the theologies and doctrines man can come up with, greater than our challenges, fears, sins and sorrows. GIVVO6_B \\nYou mean like the hatred shown by land stealing mass murdering Jews towards the Palestinian natives of Palestine. PK Hodges \\nThe Palestinians, also known as Hamas, ISIS, Islamics, Syrian refugees, and many other names (but always Islamic by religion) are none other than ye old Canaanites. David described them in Psalm 83 (Plus allies).The ancient families who inhabited the land that God took from them because they served other gods, created ones, and not Him. He renamed this land “The Promised Land.” He took it and gave it to tiny Israel, His own people. This is the background. Now that we are in the very last pages of Revelation, and Jesus is coming back very, very soon (no, not someday. He’s closer than someday. He’s almost here.), they are back for revenge. They are the 10 horns on the Beast. These guys, these horns or kingdoms are described to John as “was is not (Islam was not around in John’s day. Neither were any other Canaanite kingdom), will be again shortly.” I call them the One Hour Kingdom. That’s what they are prophetically. They are here for one brief hour, but in that time, they will destroy wonderfully as Daniel puts it. You could say they are the Hitmen for the Beast because they have given the Beast their authority and power in exchange for the promise that they will again have a kingdom. Of course, the Beast cannot give what it doesn’t have to give, but they are sure giving it a go. Don’t you think? Theirs is a virtual kingdom in the devil’s virtual fairytale kingdom of today, but it sure does look real, feel real and sound real. (The lie always does). Those refugees (often referred to as rapeugees) are pouring into Europe, and whereever they go, the Governments there are giving them full support. In fact, they are bending over backwards to please them: handing them money, food, clothing, the best places to live, and punishing any person who speaks against the chaos, the havoc, the riiots, the rapes, the murders that are happening in these nations. \\nMeanwhile, back last year, on the last day of September 2015, two flags were symbolically raised together (united stand…Well, okay, as united as kingdoms who love hate and hate love can be). The flags were raised over the UN building. Whose flags were they anyway? The two flags were none other than the Vatican, the small horn (smallest kingdom in the world, also known as a city-state), and Palestine (the kingdom that is a virtual kingdom for one hour). \\nNest thing we know is that the world is preaching Islam even more than before. What I mean by preaching is that they are promoting it in every way, shape and form they can. Anyone that protests against Islam is called what? Islamaphobic or Zenophobic or Nazis. \\nObama even gave the One Hour kingdom a big promotion in his most recent State of the Union address. Yep, they want the land god took from them back, but not by humbling themselves before the One true God and the Son He sent to save all whom call on His name. In fact, they point blank refuse to recognise the son of God as being the Son of God. No.They want to steal the land.. They want revenge. The leaders of Islam preach revenge. Tell me, if you’ve never had something in the first place, how could it be called as revenge? Revenge is trying to get even for something from the past. Revenge is trying to get back something that used to be yours. \\nBut, are they settling for the area called the Promised Land. No, Siree. Why do that when a Caliphate, a world wide kingdom is so much bigger and better? Keep watching. The Word of God is being fulfilled and will be fulfilled to the letter. Do not believe every thing you are hearing in the world. Those guys speak with twisted mouths. Our bproblem is we’ve been taking the word of scientists and newsmen, the world’s wisemen, as the gospel truth, and placing it above what God’s Word says. Make sure you take every word, everything you hear and compare it to the what the Bible says about it. No conclusion jumping allowed. No opinions. There is only one truth. Not many versions of the truth. (Note: the Word of God is written by many men but inspired by One God who is not schizophrenic.) “You’ll shall know the truth and the truth shall make you free.” Get into the Word. Say it. Pray it. Believe it over anything you hear, see or feel. Believe it and do it (act on it, live it). And then?:Wait before the Lord. And Let Him show you what is truth and what is not. We cannot find truth in a world that is following a dragon who is the Father of lies, theories and opinions, and false predictions). God wants us to know the truth, so that we will be prepared. He will unlock His word and give us greater understanding so that we can endure in faith till the end and be saved. chief white eunuch \\nYour comment is too long to read but the Islamics are descendants of Ishmael & Bible calls them wild. They could be Canaanite descent but I think that mainly refers to descendants of Cain. GIVVO6_B \\nUtter nonsense! The Palestinians are the people of the land who previously worshiped at the Temple and then converted to Christianity. chief white eunuch \\nPalestinians are Arabs. GOOGLE SEARCH + google images Most Arabs seem to be Muslim. Over 50% of Muslims believe in Sharia Law!!! \\nIshmaelites iris \\nyep. They’ve killed everyone else off, too, including most of the Christians and Jews outside of Israel, which lived in enclaves in the ME for a very long time, until about 30 years ago and counting, that is. JF \\nThe ancient Romans gave the lands of Judea and Samaria that name. It never existed before then. iris \\nTrue. JF, you probably know this, but the Brits double crossed Disraeli after he basically saved their behinds in the 1800s. All he asked for in return was a homeland for his people. He died in 1881 without that promise they made to him, being kept. Israel didn’t get a homeland again until 1947, took effect in 1948. But, the Brits and others, conveniently chopped up areas of “Palestine”, (even affected countries like Nigeria), all to do with natural resources of the countries they had overseen for so long, especially, oil (British Petroleum). I don’t think they expected or probably even wanted, Israel to make it this long. I think they fully expected that the war which was instigated by surrounding Arab nations the day after Israel’s statehood came into effect, would be quick and decisive. God had a different idea though, and has been fulfilling prophecy about the end times. Those born in 1947 on, are the “generation which will see all these things come to pass”, because like it or not, that fig tree, Israel, has again put forth, just as Jesus said would happen. carson \\nso hamas is christian? If you called a hamas’er a christian he’d probably beat you silly or worse… \\nDid many palestinians ‘disappear’ when hamas came to full power? \\nAnd what is the right of return that is taught in arab/palestinian countries, and what if a palestinaian speaks against it..etc etc etc. \\nso the folks who stayed and celebrated and followed hamas are christians? \\nOr did what christians were there flee and or go underground or were disappeared. \\nand if christians are a minority in every other nation why would they be a majority in gaza area? \\noh so many questions, worth looking into if one is duped into thinking gaza is full of christians. \\nAnd aside from that and no matter should we be praying and preaching the gospel to all, palestinians included, arabs, muslims and all..eternity is forever, it’s not about this world or it’s tribes or gangs, it’s about Christ and who will escape the wrath of God for sin and unbelief/rejection of Christ. iris \\nha ha ha … The award for dumbest comment goes to …PK Hodges greanfinisher . \\nI see absolutely nothing wrong at all with a U.N. resolution mandating the creation of a Palestinian state provided that it also includes the recognition of Israel’s existence. JF \\nThat land, and much more actually, was given to the Jewish people for all eternity. www.tomatobubble.com \\nNo, it wasn’t. Plus, the Jewish people of today are impostors who have no genetic link to the ancient Hebrews anyway. They are not the same people. iris \\nSome simple DNA testing of those living in and outside of Israel who claim Jewish heritage, will dispel that myth. There are many Arabs living in Israel, although they too, have Semitic bloodlines. Funny, most Arabs living in Israel know how good they’ve got it, and don’t want to leave. I’m sure there are also plenty of purposefully placed Arab trouble makers there, however. iris \\nAnd UN shills. watchmannonthewall \\nOne thousand years with the Lord is as a day, so said Peter and David. It has not quite been 2 days since He left to return to His Father and so that is how He is coming quickly. \\nUnderstand the prophesy within the writiings of John where Jesus spent 2 days, 2,000 years, with the Samaritan woman, the GENTILE, at the well (giving out Living Water) before he went back into Galilee, after beginning His ministry in Jerusalem at Passover. \\nThere is a reason Hosea writes, “Come, let us return unto the LORD: for He has torn, and He will heal us; He has smitten, He will bind us up. After TWO DAYS He will revive us; in the THIRD day, He will raise us up and, and we will live in His sight.” (Hosea 6:1-2) \\nAfter the two days comes the third day. This is the day we will live in His sight and is also the same day we are revived. This is the “day” we become the nation He intended for us to become at Sinai. Why? Because His Word doesn’t return unto Him void but accomplishes the purpose for which He sent it! Sinai hasn’t yet been fulfilled! \\nThis “day” is counted from His death and resurrection, and begins about 2030 C.E. This “day” is just around the corner and we will live in His sight as He rules from Jerusalem. \\nIt is also the 7th day, or the Sabbath rest for the people of God which the writer of Hebrews speaks of in Hebrews 4. Jesus, Yeshua, is also “LORD of the Sabbath”, the 7th millennium. He is its KING of Kings and LORD of Lords! \\nThe key to interpreting scripture is to know how the Father defines HIS terms. We should not pay attention to man’s definitions of terms. Doing so will only lead us astray in our doctrine, and it has. www.tomatobubble.com \\nWho cares? The earthly, anti-Christ state of Israel has no place in God’s plan. The Israelites of the Old testament have been replaced by the Christian church in the New Testament as God’s chosen people. \\nGalatians 3:29. “And if you are Christ’s then you are Abraham’s seed, and heirs according to the promise.” All the promises of scripture are for God’s people. Today Christians are that people if they “continue in His (God’s) goodness.” Rom. 11:22 . Jim Davis \\nWho cares, indeed. If you care more about Israel’s borders than you own country’s borders, well, you might just be a cuckservative! iris \\nYou cited Romans. According to Paul, and I believe the Old and New Testaments are inspired and authoritative, then if you are a Gentile Christian, you are grafted into Israel. Their olive tree bears you. If God has forsaken them, He could just as flippantly (according to your theology) forsake you, for your sin put Jesus Christ on the Cross, also. But He is faithful to His promises, and His unconditional election. According to Romans 11, He has concluded all under sin, so that He might show mercy to all. You have extrapolated in your isogesis, putting in a figurative Greek interpretation of something which is meant to be taken literally. iris \\nYeshua, Jewish, also all of the apostles and the first evangelists. In Romans 11, Paul foretold of the fulfillment of prophecy which is to come, that all of Israel will someday come to faith in Him as Messiah, witnessed by Zechariah. There was much anti Semitism in place among Greeks during the 2nd century, when Supersessionism, also known as Replacement Theology, took hold. It insidiously made its way into the beginnings of the RCC, and its poison was pervasive in the European culture which influenced Luther and Calvin. That didn’t make it canonical by any means. The Biblical concepts of God’s love, election, grace and mercy are connected, not allegorical, not related to a flippant Greek mythological god. Yeshua still loves His people and when one dismisses them in the way that Replacement Theology does, God Himself is not only dismissed, it pierces “the apple of His eye”. www.tomatobubble.com \\nWhatever, keep on in your delusion. The Christian church is the true Israel, not the current earthly Israel. Jews can be saved by converting to Christianity, apart from that they are God’s enemies. GIVVO6_B \\nYeshua as you call him named the Jews as “Whited walls, full of dead men’s bones” He also said they were of their father the Devil, who was liar and a murderer from the beginning. You don’t really know anything about Christianity at all do you? It is certainly clear you do not read and understand what is written in the New Testament. carson \\njohn 8:44 was summed up in john 8:42.. If God were your Father you would love Me..said Jesus. \\nBut with the replacement’ers the gentiles/chinamen or those of mayan descent or south pacific islanders descent or african or anyone but jews..all get a free pass from having the devil as their father even though they too do not love Christ? Wake up and stop listening to what tickles the ears. \\nalso if the church has replaced israel then joel 3:2 reads really odd..for my heritage Israel (for my heritage the church? Since you say the church/believers have replaced israel) whom they have scattered..(so the church was scattered?) and parted my land…what? what land? the ‘land’ doesn’t matter per the replacement’ers theory, what land could God be talking about..etc etc. \\nand romans 11:26-28..as concerning the gospel they are enemies for your sakes, but as touching the election they are beloved for the fathers sake…enemies for your? sake? Yet BELOVED? It’s not hard to figure out when you read the whole chapter and the rest of the bible, the book of acts as another one, after Christ was hung on a cross and after He ascended keeps repeating how God is attempting to save israel/jews to that day, this is after the event of Christ supposedly shutting out israel/the jews for ever more, so if their shut out why is God still saving them in the book of acts and after and still to this day and the event/day that’s coming due, that day of romans 11:26. \\nit’s clear the replacement’ers have it wrong just from 3 area’s of verses not to mention the many more truths/verses. iris \\nPerfectly said, thank you, carson. Only those who put their trust and hope in Yeshua of Bethlehem as God come in the flesh and their savior because of what He did for us on the Tree, have a reconciled relationship with God, but to reinterpret Scripture and state that God has annulled an irrevocable promise He has made, slaps Him in the face. carson \\nHi iris..God bless you! \\nIt’s also odd and that people don’t stop and think..in their youth they too walked in darkness and evil and ruined the world and ruined their surroundings, same stuff they blame only the jews for in smaller scale. And yet God had mercy and granted them faith in Christ (if indeed they be in Christ at all). iris \\nAbsolutely. It amazes me that replacers have such an adamant faith in the doctrine of election, but can only apply it to themselves. I’ve shared your same observation about their concept of mercy; if they grasp the concept, but can’t share it, that reminds me of Jesus’ statement of not being forgiven if one does not forgive. White supremacy groups and radical jihadists share this same self righteous attitude against Jews and Israel, what does that say? Imo, it’s a good example of a mental assent “profession” of Christian faith, but with no heart change; no empathy, no mercy, no love. \\nIf there were a personal relationship with Him through faith in God’s great grace, mercy and love, given for us all and displayed to us all by His reconciling, atoning death, and that, when we were all still His enemies, according the the very Jewish Paul, then thanksgiving, humility, awe and worship of God, would be quite evident. They would reflect Jesus and point to Him, not vaunt themselves and single out a people group for judgement and wrath according to their taken out of context understandings of Scripture. \\nPerhaps they don’t have much awareness of the depth of their own depravity, which ironically, replacers are also always talking about. They need to get a small glimpse of the pain they have caused their Jewish Messiah’s heart by hating His people. He died on purpose for replacers, white supremacists and radical jihadists, too, however. God bless you, also, carson! carson \\nHi iris, good observations and I’ve noticed the same, also how through many’s own speech it comes out that their hearts are very much tied to this present world and it’s kingdoms and as the world fails they pick up a scapegoat to blame for the worlds failing. Loving the world blinds a person and leads to scapegoating..hope they wake up to the devils snares and get free in Christ Jesus! Yep know them by their fruits. JF \\nAnd he still loves his chosen people regardless of what man says. iris \\nYep, He loves all people, and requires us to love Him with everything we have and are. If we really know Him, we’ll love Him in return, love all people, and as we love ourselves. “By their fruits, you shall know them”. Doesn’t mean we approve or help when it comes to sinful attitudes and behaviors, but we’ll love. JF \\nAny real Christian recognizes our ties to Israel. Your church is definitely not a true church. The Jewish people are the ‘apple of God’s eye’ and God does not change his mind. www.tomatobubble.com \\nRead Galatians 3:29. “And if you are Christ’s then you are Abraham’s seed, and heirs according to the promise.” \\nThe vast majority of Jews are not in Christ and most likely never will be, so how can they still be Abraham’s seed. iris \\nThat verse is talking about a spiritual truth, and while you are so correct if you realize that personal faith in Messiah is tantamount, the same writer of Galatians also wrote Romans, and he stated that one day, although for now they are “partially blinded” to the truth, the whole nation of Israel will recognize Him as their Messiah. Then, the physical and spiritual, irrevocable promise God made to them as a people, will be manifested. He’s not done with anyone, believer or not, until He calls it, and He hasn’t called it. Why can’t you have mercy on them, if He had mercy on you? Why can’t you recognize that even now, Israel is the safest haven in the ME for Christians and other religions, including practicing Muslims, as long as they obey the nation’s laws? The Christians there appreciate Israel. Jesus told us to pray for our enemies, so if you count Jews and Israel as such, you could do that. The Christians there, do. MaxRockatansky33 \\nWestern Civilization is called Judeo-Chrisitan. We can’t allow that serpents of Crescent will destroy this. Darlene F. Burgi \\nMost of Christ’s historical sites are on the portion the Palestinians are pushing for. They simply want to destroy these sites. I care. No it won’t have any bearing on my eternal soul, but we need to make sure these sacred sites are kept protected and open to Christians all over the world. iris \\nI hope they’re protected, too, and all of the historical Jewish sites, also, but they’ve already destroyed some of those. Meanwhile, we get Roman arches of conquest and Nimrod statues paraded around the world. GIVVO6_B \\nWhat a complete load of old bollocks that has been preached by religious numpties like you for 2,000 years. The kind of people that burned others at the stake and murdered the entire population of Jerusalem in 1099. thomas jefferson \\nI watched as THE POPE had one arm of NETANYAHU,and OBAMA had his other arm,and they forced him to a table with a agreement to DIVIDE ISRAEL,and then forced him to sign it,dividing ISRAEL in to pieces,THEN THE LORD GOD OF HEAVEN ,DESTROYED ITALTY and THE UNITED STATES,new york was wipped off the map,you couldn’t even see where it had been,just miles of burned dirt in every direction……… MaxRockatansky33 \\nAgain. The same article about dividing of Holy Land. There will be no Palestinian State. Netanyachu will not allow this to happen. Barack Hussein will not force this. Stop scaremongering. carson \\nnetanyahoo may not allow it, or then again…but either way it’s shown in joel 3:2 so will eventually happen. \\nand from joel 3:12 Let the heathen be wakened, and come up to the valley of Jehoshaphat: for there will I sit to judge all the heathen round about, 3:14 Multitudes, multitudes in the valley of decision! For the day of the Lord is near in the valley of decision. and psalm 2 \\nWhy do the heathen rage, and the people imagine a vain thing? \\n2 \\nThe kings of the earth set themselves, and the rulers take counsel together, against the LORD, and against his anointed, saying, \\n3 \\nLet us break their bands asunder, and cast away their cords from us. \\n4 \\nHe that sitteth in the heavens shall laugh: the Lord shall have them in derision. MaxRockatansky33 \\nThe Bible is the instruction for the Establishment. Hitler read Nostradamus prophecies and the Bible as well. iris \\nThat’d be great, Tatiana, if their daily, publicly repeated mantra, as well as Iran’s, and other nations, wasn’t calling for “Death to Israel, Death to Jews!”. They refuse peace talks, and every dialogue attempted has ended, as they consistently insisted that Israel had no right to exist. It’s a one sided deal on their part. RW \\nMichael, Could this become the fulfillment of Daniel 9:27? Will this UN “peace” covenant be seven years in duration? Will it allow Israel to build the third Temple, which will sit slightly to the north of the Dome of the Rock Shrine, in line with the Eastern Gate in accordance to Revelation 11:1-2? \\n– Institute of Biblical Defense Seattle, WA'"}, "time": 1742562016.4262242}