{"duration": 0.03190755844116211, "input_args": {"text": "'Col. Michael Bumgarner, the former commander of the guard force at the U. S. detention center at Guantanamo Bay, Cuba, stated in an interview on Sunday that he is “disgusted” by President Obama’s continued effort to empty out Gitmo. [Bumgarner charged Obama with attempting to use Gitmo to ensure his legacy at the expense of national security. He served from April 2005  —   June 2006 as commander of the Joint Detention Group, the guard force component of the Joint Task Force at the U. S. prison in Guantanamo.  The Pentagon announced last Thursday that four detainees had been released to Saudi Arabia, where they will purportedly participate in a rehabilitation program.  From the 535 detainees in Gitmo during Bumgarner’s work there, the population is now down to 55, and 19 of those have reportedly been cleared for release. There is speculation Obama may release more detainees in his final days in office. “It has nothing to do with national security reasons,” stated Bumgarner. He was speaking on this reporter’s Sunday night talk radio program, “Aaron Klein Investigative Radio,” broadcast on New York’s AM 970 The Answer and Philadelphia’s NewsTalk 990 AM. Listen to the interview here: Continued Bumgarner: His whole motivation has nothing to do with national security. In my mind, it is clearly a legacy issue for Obama who signed on, you know, day one of his presidency, ‘I am going to close Guantanamo.’ I knew then   …     that would never happen. It is just impossible. He had no clue what he had just signed. And he has found out how hard that is. So, the argument always is that they (the terrorists) make this a propaganda matter to recruit more people. You and I both follow this pretty closely. I don’t ever see it out there that Guantanamo is your call to battle, you know. I never see that. You and I both know what drives this fight. It has nothing to do with national security. Again, it’s a legacy issue for Obama. And I’m ashamed that it is occurring. Embarrassed. Disgusted. I don’t know how it to make it stronger. Asked whether he had any advice regarding Gitmo for   Donald Trump, Bumgarner replied: One, it certainly should not be closed. And two, increase its population. And by that it’s just not that we want to stack up Guantanamo Bay. But the whole purpose is  —   this may strike people as funny  —   but rather than kill the terrorists on the battlefield when we engage with the ISIS fighters, bring them in for the intelligence value that they can provide.   …     Use the intelligence value. The great capacity and capability of Guantanamo. Let’s fill it up with people and let the intelligence world go to work and develop the human intelligence that we so badly need. Fox News last week cited statistics from U. S. officials saying 30 percent of previously released Gitmo detainees are suspected of returning to terrorist activity. Bumgarner commented, “And you know Aaron when we talk about these numbers   …     let’s just think about that.   …     Think about the destruction that just one man carried out in Berlin. That fellow in France. So, if you can stop one, you saved numerous lives. ” Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742628547.3567069}