{"duration": 0.07436013221740723, "input_args": {"text": "'Kering, the French   group that owns the brands Alexander McQueen, Saint Laurent and Gucci, among others, and has made something of a mission out of championing women’s rights  —   with initiatives like the Chime for Change campaign for female empowerment, the “Women in Motion” talks for film industry professionals and a partnership with the United Nations Women French National Committee  —   has put its   policy where its cause is. Also, probably not coincidentally, where its customer base is. Last week, the conglomerate  announced a new   policy that, to many, might seem like a luxury itself: a minimum of 14 weeks of paid maternity or adoptive leave and five days of paternity or partner leave, beginning Jan. 1, 2017 for all employees who have worked there for more than a year. What made the move unusual was that the group, which operates in nearly 60 countries and employs more than 38, 000 people, established the policy across all brands and all locations. “These decisions are usually made country by country and not across borders,” said Ariane Hegewisch, the program director of employment and earnings at the Institute for Women’s Policy Research. “Human resource management, such as benefit policies and pay levels, is very influenced by national legislation, labor markets and the union structures in different countries. ” Previously, Kering’s various brands set their own policies, in compliance with local regulations. That means its   employees in the U. S. where federal law mandates only 12 weeks unpaid time off for new parents, were offered either no compensated time off or a combination of paid and unpaid leave. Meanwhile, Kering’s Italian contingent  —   about 7, 000 people  —   was given 22 weeks of maternity leave and three to four days of paternity leave with at least 80 percent of the salary paid out. That approach is not atypical in luxury, an industry focused on attracting women (80 percent of Kering’s consumers are women). Moët Hennessy Louis Vuitton, or LVMH, which owns fashion houses like Dior, Givenchy and Marc Jacobs, has different policies in different places, as does Prada Group, an umbrella organization for Prada, Miu Miu, Church’s and more, as well as   Heusen, which owns Calvin Klein and Tommy Hilfiger, among others. But Kering’s move has placed it among a growing list of multinational companies, including Nestlé, L’Oreal and Spotify, that have set minimum   standards across all geographic zones where their employees work in the last few years. LVMH is set to follow in Kering’s footsteps this spring with a program called “Coeur Social,” which will include a global   policy. A report by the Center for American Progress argued that companies are taking these actions to balance out discrepancies in benefits across regions, in particular the unequal leave policies between the U. S. and most other nations (research focusing on members of the Organization for Economic Cooperation and Development and a few other nations found that the U. S. was the only one that didn’t mandate paid parental leave). “I think these companies realize they can retain women who leave and come back, and that is a real cost saver for them,” said Myra H. Strober, a professor of economics at the Stanford Graduate School of Business. “It’s very much an economic decision for them, and that’s good, because those tend to stick. ” Among fashion, beauty and retail companies that have made their   policies public, Kering’s offer of 14 paid weeks for mothers and parents who adopt stands out. “This is a private company, so an investment of 14 weeks is high,” said Ms. Hegewisch. By comparison, Patagonia, considered a leader in sustainability, gives its workers 80 days of maternity leave and 60 days of paternity leave, both paid. Toms Shoes offers eight weeks for all parents Jane. com gives 30 days of maternity or adoptive leave Old Navy allows 60 days of   unpaid maternity leave and   Heusen offers   weeks paid for birthing mothers and six weeks paid for all other parents. Still, Ms. Hegewisch expressed surprise at the stark difference between Kering’s maternity and paternity leaves. Though Kering brands such as Gucci and Bottega Veneta have decided to merge genders on the runway, they haven’t made the same leap in leave policies. “Five days is really very minimal,” she said of the company’s paternity leave. According to someone familiar with the discussions at Kering who was not authorized to speak, the company based the number of days on recommendations from the International Labor Organization, which adopted a resolution in 2000 stating that women should be entitled to a minimum of 14 weeks maternity leave, but hasn’t established any formal guidelines for paternity leave. Kering declined to comment publicly on the policies beyond its announcement last week. Ms. Strober noted that there’s more of an uphill battle in getting fathers to take time off, even when it’s available to them. “Even when companies have more generous   policies, fathers don’t always take advantage of them,” she said. “It took years of Sweden having a national program giving men paternity leave before they began to take it. ” She added: “Eventually  —   don’t ask me when  —   men and women will have the same parental leaves and they will all take them. But we’re not there yet. ”'"}, "time": 1742562075.2186487}