{"duration": 0.07904624938964844, "input_args": {"text": "'MONTERREY, Nuevo Leon  —   A leaked video that was allegedly taken inside a prison in this border state revealed how a group of cartel members dressed their rivals in lingerie and mocked them as they were forced to clean various cells. [The video shows a group of cartel members on their hands and knees wearing bras and other lingerie crawling on the floor while other kick them and shout various insults. The   inmates are forced to clean one of the common areas inside the Apodaca state prison.   Some of the insults shouted by the inmates point to the humiliated cartel members being members of the Cartel Del Noreste (CDN) faction of the Zetas cartel. Breitbart Texas has reported in the past that the CDN has been fighting a territorial war with a rival faction of the Zetas called “Vieja Escuela Z” or Old School Z. It remains unclear if the inmates humiliating the CDN are rivals or members of the same faction who have switched sides.  One of the men on the floor has been identified as Daniel Gustavo “El Muletas” Valencia Treviño. A regional leader within the CDN, he was named Muletas or “Crutches” due to the loss of his leg. Valencia Treviño was arrested in late February by Mexican authorities.  It remains unclear when the video was taken, however Nuevo Leon authorities confirmed to Breitbart Texas that  as soon as the video surfaced, they carried out a series of raids at the prisons in Apodaca and Topo Chico where they seized a cell phone, various shanks, and some small remnants of marijuana. Editor’s Note: Breitbart Texas traveled to the Mexican States of Tamaulipas, Coahuila and Nuevo León to recruit citizen journalists willing to risk their lives and expose the cartels silencing their communities.  The writers would face certain death at the hands of the various cartels that operate in those areas including the Gulf Cartel and Los Zetas if a pseudonym were not used. Breitbart Texas’ Cartel Chronicles are published in both English and in their original Spanish. This article was written by “M. A. Navarro” from Ciudad Victoria, Tamaulipas and Tony Aranda from Monterrey, Nuevo León. '"}, "time": 1742564422.5035317}