{"duration": 0.1332695484161377, "input_args": {"text": "'Collective Gridwork Fluctuations 10/23/2016 \\nWe are going through many fluctuations in the gridwork this month and these are challenging many as they are “moved” from one gridwork to the next… connected, disconnected, connected, disconnected… there are huge periods of template wipes where we go offline, disconnect and then come back up online… This is the strongest I’ve experienced this since June 2015. Huge disconnects, which need to occur so we can shift to a whole new collective timeline. \\nIf you are feeling this, then it’s continual re-calibrations in the gridwork, which you hold/link up to with your Crystalline LightBody Structure. \\nA lot of people’s feelings are all over the place, whether subtly or loudly…. The more we exist as a soul, the more subtle this is. The more human, the more external/loud this is. There have been such huge energetic releases lately by collectives…. \\nThis month has been about re-calibrating our systems, massive physical upgrades for many as how we function is completely re-worked even more than before. \\nTo cleanse collective wounds for more love to emerge from within all, many must experience what they don’t want before they understand what’s important and the kundalini fire must be ignited to awaken the spirit/soul inside. This mass root chakra awakening that was triggered collectively in January 2016 has lit the fire, fueling the souls need to emerge from within. As collectives exit the old 3D matrix simulation and awaken from the slumber, all the suppression and victimhood must be cleared as each takes their power back from within. As chaos ensues for many to release, the more released, the more the gridwork is affected by the masses coming online, going back offline, coming back online… These fluctuations are affecting all of us, in our own ways. \\nTo understand, one must be totally connected inside and in-tune with their own energetic gridwork to be aware of what is what. While the more crystalline light we are, the less we are subjected to unconscious collectives, we are affected when our NEW Earth Gridwork is being re-calibrated with such intensity now. \\nSo, for those who feel disconnected, this is a part of the process as we clear old timelines and move/jump into new ones. We have to disconnect from anything that’s no longer in alignment/supporting our new existence here. The programs for this were held in the physical body/cellular structures and these continue immense re-sequencing and re-coding, because of these mega-frequency upgrades that we are experiencing every day now. \\nAs multi-dimension light beings, you can experience multiple emotions simultaneously, while not being bound by any of them. You can observe what your re-calibrations are and honor this, while not being affected by the transitional phases as much as before. Your mind is no longer dictated by the emotion you feel. You can be a peace and always feel the magic while something else cleanses/clears. You don’t shift out of alignment while your body/mind/emotions do their thing. It’s a process that you honor and understand through your presence and connection inside. You can feel disconnected yet not be totally disconnected…. for you know the adjustments are important to move you into your next phase of a more awesome reality…… \\nThe reason I write this is because if there is any human’ness left, the human aspect will go to judgement and this creates suffering inside. Let go of the judgment and be okay, accept whatever you are feeling or not feeling inside and choose how you desire to experience the phase you are going through as these huge shifts occur. Kindness and compassion towards yourself, will allow you to feel these for others too. Remember, you are evolving beyond human comprehension and you don’t always need to understand everything first…. it takes awhile….be patient and listen to your body, honor you and how you need to feel as you shift. Pull away if you need to, connect with others if you need to…. \\nThese are unprecedented vibrations we are in now. These are new territory for all. We don’t know until we experience, and those predicting can only predict according the the vibrations that they have access to thus far. No one can tell you what timeline you are going to be in, for every moment is a different vibration now. Vibrations create realities, so the moment you shift vibrationally, then your timeline changes. As you master what you are doing/creating/transmitting vibrationally, then you get to participate in which timelines you desire to activate to experience here. Some timelines are always a surprise, because there are always a gazillion that were a higher vibration than you had access to before. The faster we integrate, the faster we experience the highest one’s possible thus far. \\nNow, we have connected back up and the Unified Field is stronger and at a much higher frequency than before. Collectively the gridwork is back online. We have super high frequencies continually now. Much is going on for everyone moving further into being responsible for the realities that they create. The backlash of unconsciousness is going to continue to be more visible as the physical reality becomes louder for those hearts and minds not open yet. The beauty and magnificence for intentionally transmitted conscious realities become more profoundly magical by the moment. The polarity continues out there, but it does not have to inside. The more in-tune and aligned one is, the softer and easier physical realities are. These higher vibrational realities are very soft, the exchanges are beyond beautiful when all is aligned. You will know when it is not, as you won’t be happy, inspired and in-joy the experience. Just the recognition gives you the ability to choose where you are going to focus your energy and attention for what you experience here. \\nGet ready loves….. powerful energies is an understatement. For many of us, we are going through physical realignments more than normal, as our crystal bodies are embedded with deep sacred soul codes now. It’s not an emotional or mental experience anymore. It’s just physical re-calibrations and our physical bodies process energies much differently than before. We’ve moved beyond the heart and the head. Now the spine is the primary processing center, which is why so many are experiencing the nervous system overhauls. I’ll share more on this as we go. Bizarre is an understatement for our “new bodies”…. They require great care now. \\nSee you guys tomorrow. Sleep well and happy traveling! p.s. We entered Galactic Frequencies a bit ago as well. Not that these all aren’t, but we’ve achieved the overall frequency field-wise to be fully galactic right now. In-JOY these exquisite HOME frequencies loves! ♥'"}, "time": 1742561895.171874}