{"duration": 0.12137222290039062, "input_args": {"text": "'LONDON  —   As American allies across Europe and Asia brace for President Trump, Britain stands out for the degree to which it is proceeding as if little has changed. The country, consumed with managing “Brexit” and its associated domestic political dramas, appears to have taken relatively few steps to prepare for the geopolitical earthquakes that Mr. Trump could bring to the international and European orders on which Britain relies, and that his proposals would undermine. “The people at the top of our system, whether they’re politicians or officials or journalists or think tankers like me, we’re all totally focused on Brexit,” said Charles Grant, who heads the   Center for European Reform. “We haven’t thought about Trump as much as we should have. ” It is possible that Prime Minister Theresa May, by throwing in her lot with Mr. Trump, could ride out any changes to the international order. But if that approach does not succeed, it could have severe consequences both for her nation and for the world that Britain plays a role in keeping together. Mrs. May has sought to win over Mr. Trump, whom she will visit this week, just as her European counterparts are exploring more fundamental questions about American reliability. “The British debate on Trump is over very trivial stuff, like who Trump spoke to before May, and the German debate is over the future of the liberal order in the West,” said Mark Leonard, the director of the   European Council on Foreign Relations.   Steinmeier, the German foreign minister, wrote in a column this week for the German newspaper Bild that, with Mr. Trump’s election, “the old world of the 20th century is gone” and that Germany could confront drastic changes. François Hollande, the French president, said last month that Mr. Trump’s election “opens a period of uncertainty. ” British leaders, Mr. Leonard said, have not accepted the view, growing in other European governments, “that our prosperity and security are based on an international architecture that’s now being threatened. ” “There’s an assumption that’s all going to remain,” he continued. Since Britain’s decline from a global power in the years just after World War II, the country’s foreign policy has rested on two pillars. First is the   partnership, which allows Britain to project its power and safeguard its interests globally. Second is European unity, which is essential for Britain’s economic prosperity and, by removing the   diversions of European conflict, frees up Britain to act on the world stage. But both of those pillars could now be crumbling under the strain of European populism, Russian resurgence and particularly Mr. Trump’s threats to step away from Europe. Britain’s challenge is not just that each of those elements is coming under strain. Mr. Trump’s avowed opposition to the European Union has put them in direct conflict. For instance, Mr. Trump offered to reward Britain’s exit from the European Union with a speedy trade deal. But this risks encouraging more exits from the bloc and possibly its disintegration. The resulting turmoil on the Continent, which includes several top British trading partners, could risk harming Britain’s economy far more than an American trade deal would help. Mr. Trump’s proposed alignment with Russia poses a similar quandary. Germany and other leading European powers oppose such a realignment, which they fear would open the way for Russia to dominate Eastern Europe, breaking the Continent’s unity on security matters. Mrs. May remains hawkish on Russia. But it is unclear whether she would oppose Mr. Trump on the matter, particularly as she more fully ties her fate to the alliance. “If America eases up on Russia, Britain will be under heavy pressure to pick the United States, not to side with Merkel,” said Robin Niblett, the director of Chatham House, a   think tank, referring to Chancellor Angela Merkel of Germany. Mrs. May is increasingly focused on maintaining the alliance with the United States, the world’s largest economy and military power. Whereas leaders such as Ms. Merkel have responded sharply to criticism from Mr. Trump, Mrs. May has been more forgiving. For example, she overlooked Mr. Trump’s decision to meet with Nigel Farage, a former leader of the fringe U. K. Independence Party, before speaking with her. Even if Mrs. May succeeds in upholding the alliance, it is unclear that her government is preparing for the range of more seismic changes that Mr. Trump’s election and other events could bring. Jeremy Shapiro, an American and the research director for the European Council on Foreign Relations, said he had struggled to convince British officials that the old order is “eroding all around them. ” Mr. Shapiro paraphrased the “dominant” British view of Mr. Trump as, “We didn’t want him, but pressures of the presidency, checks and balances, our expert tutelage will socialize him, and it’ll be O. K. ” British hopes, he added, often rest on Senator John McCain’s persuading of Mr. Trump to drop his controversial plans and revert to traditional positions such as upholding European unity. Mr. Shapiro said he had been unable to convince British officials that Mr. McCain, whom Mr. Trump has publicly mocked, was an unlikely savior. Lawrence Freedman, emeritus professor of war studies at King’s College London, said there was a simple reason that British leaders never seemed to discuss their backup plan should they fail to moderate Mr. Trump. “There isn’t a Plan B,” he said. Preparing for life without American support, British leaders worry, could send the message that the United States can safely withdraw, risking exactly the outcome Britain wishes to avoid. “This has always been the problem,” Mr. Freedman said, because it leaves Britain unprepared for a situation that could be deeply destabilizing  —   much as it failed to prepare for Brexit. Brexit has focused attention inward, on    political dramas and on the countless challenges of negotiating Britain’s exit from the European Union. “We’re going through a very solipsistic moment,” Mr. Leonard said. This has led the British to behave “as if the only independent variable is Britain leaving the E. U. and the manner in which it’s done. ” This is shaping British foreign policy in other ways. “There’s always going to be a question of whether we’re better off using our political capital to advance the international security order or to try to get a good trade deal,” Mr. Leonard said. Britain’s party politics also distract. Mrs. May is only barely holding together the governing Conservative Party, leaving her overwhelmingly focused on managing divisions that are mostly about Brexit and migration. Both she and her foreign secretary, Boris Johnson, have spent their careers focused on domestic issues. The opposition Labour Party is riven by its own divisions. Its leader, Jeremy Corbyn, tends to be skeptical toward Britain’s global role. As a result, there are no major voices in British politics who have an interest, either ideological or political, in addressing the country’s foreign policy challenges. Britons’ view of their country as a pillar of a European and world order, rooted in their experience of standing up to fascism and militarism in World War II, is also shifting. “Until quite recently, we saw ourselves as   of the European order, but we don’t sort of see ourselves in that way anymore,” said Mr. Freedman, the King’s College professor. This has accelerated with the enmity toward immigration, which has focused politics inward and portrayed the outside world as something to guard against rather than to protect and uphold. That has ramifications beyond Britain. Even after Brexit, the country remains important for upholding the postwar order in Europe, where it is the largest economy after Germany and the biggest military spender after Russia. If its horizons continue to narrow, that will contribute to the Continent’s continuing fracturing on economics and opposition to Russian power. Mr. Niblett, the Chatham House chief, said he was worried Britain would become the “weak link” on European sanctions on Russia for its annexation of Crimea. “The U. K. which traditionally sees itself as upholding the spine of Europe toward Russia, is pulling itself out of that role,” Mr. Niblett said. Other European states are already preparing for the possibility that the Continent can no longer rely on Britain, Mr. Leonard said, on issues from Russia to the Iran nuclear deal to global free trade. “They don’t know if Britain’s going to be there or not,” he said.'"}, "time": 1742563555.2310693}