{"duration": 0.15571856498718262, "input_args": {"text": "'Normani Kordei, a member of the girl group on the rise Fifth Harmony, sat for a lighthearted Facebook Live interview earlier this month. Within a week, she had been chased off Twitter by a mob spewing racist insults. “I’ve not just been cyber bullied, I’ve been racially cyber bullied with tweets and pictures so horrific and racially charged that I can’t subject myself any longer to the hate,” she wrote. Her account has been silent since. Online harassment has become a depressingly common workplace hazard for people of color in the public eye. Last month, the “Ghostbusters” star Leslie Jones temporarily quit Twitter after weathering a deluge of racist abuse. And last year, the Brazilian actress Taís Araújo reported a series of harassers to the police after they had inundated her Facebook page with similar comments. But the racist taunts hurled at Ms. Kordei didn’t originate from some white supremacist message board, or even from a crew of Fifth Harmony haters. It came from within the Fifth Harmony fandom itself. The incident illuminates some strange similarities between the bands of internet trolls stalking the web and the legions of online fans seeking to stir up some drama. They both know that the most hurtful weaponry to wield against black women include images of apes, threats of lynching and a    . Fifth Harmony is a Simon   girl group that snagged its first Top 10 hit this year with the saucy single “Work From Home. ” Its brand would best be described as “gyrating girl power. ” But when Ms. Kordei sat down with the digital lifestyle magazine Galore for the Facebook Live interview on the subject of female friendship, one question  —   “Describe each girl in one word”  —   ripped a fault line through the group’s young, female fan base. Of her bandmate Ally Brooke, Ms. Kordei said: “Sunshine, because she is literally the light of the group. ” Of Lauren Jauregui: “My therapist, I can go to her about absolutely anything, and I feel like I can trust that she won’t judge anything that I say. ” And Dinah Jane: “She’s like the   queen, she just has a good time anywhere she is. ” When she reached Fifth Harmony’s final member, Camila Cabello, she paused. “She is   …     let’s see. Camila. Very quirky. Yeah, very quirky. Um, cute. Quirky. ” That’s it. But that was enough to enrage some fans of Ms. Cabello, the    who has been positioned as Fifth Harmony’s breakout star (and earned a spot in Taylor Swift’s squad). To this set, Ms. Kordei’s answer was apparently insufficiently effusive. “Camila is a lot more than cute and quirky she’s kind, classy, mature and hardworking,” one fan tweeted. The backlash soon grew big enough to hit the teen gossip sites (“OMG: Did Normani Kordei Throw Shade at Camila Cabello?” the magazine   asked) before curdling into something more sinister. In fan enclaves across the web, a subset of Fifth Harmony followers called Ms. Kordei “Normonkey,” “coon,” and “nigger. ” One said she “deserves to be lynched. ” Another Photoshopped her face onto the body of a woman hanging from a tree. This is the kind of rhetoric you expect to see on 4chan’s political message board, a den of white supremacist rhetoric fused with ironic memes. The trolls of 4chan have lately helped power the online presence of the   the folks who led the Twitter assault against Ms. Jones. Now the internet’s most unruly celebrity fans are cribbing their troublemaking tactics from the same playbook. The firestorm against Ms. Jones was touched off by a nasty review of “Ghostbusters” published by Milo Yiannopoulos, a conservative provocateur. As the attacks built, comment threads unspooled inside 4chan, surfacing racist images and commentary to hurl at Ms. Jones in Twitter’s open marketplace. Abuse against Ms. Kordei was organized, too, by an anonymous Twitter account that popped up directing fans to inundate her with slurs. Trolls thrive off provoking a response from their targets. When Ms. Jones began speaking out against the abuse on Twitter, 4chan posters traded gleeful messages. Fans, too, delight in forging some connection with the stars, even if it comes in the form of a rebuke. The abuse against Ms. Kordei escalated after she took to Twitter to deny a feud with Ms. Cabello and to denounce the fans attempting to stir up trouble. That behavior eventually scored a response from Ms. Cabello, too. “You don’t have to hate on somebody else to support me  —   I don’t appreciate it and it’s not what I’m about,” she tweeted. “Be kind or move on. ” Most Fifth Harmony fans, who call themselves Harmonizers, are not racists. As the abuse mounted, support for Ms. Kordei poured out under the hashtags #IStandWithNormani and #WeLoveYouNormani. Still, racially tinged remarks about Ms. Kordei have been a   presence amid her rise in popularity  —   fans have expressed surprise that she reads books and called her “ugly” and “ape” —   and the abuse tends to flare at dramatic moments within the roiling fan narrative of imagined alliances and feuds (like the supposed ongoing beef between Ms. Kordei and Ms. Cabello). A similar dynamic has played out among One Direction fans, some of whom have greeted Zayn Malik, the group’s lone Muslim member, with death threats and slurs like “terrorist. ” He briefly quit Twitter in 2012, citing Islamophobia, and left the band last year. And when Robert Pattinson started dating the singer FKA Twigs in 2014, a subgroup of his fans inundated her with racist abuse on Twitter that left her “genuinely shocked and disgusted. ” Some level of infighting is embedded within pop fandom itself. Like One Direction before it, Fifth Harmony is a   pop group that’s been perfectly primed to exploit differences in personality, style and ethnic background of the group’s singers. The Spice Girls played this trick most baldly, naming and dressing members after a singular trait  —   Baby, Scary, Sporty, Posh and Ginger. But supporting a favorite bandmate can easily degrade into trashing a least favorite. In a New York Post article from 1998, one    Spice Girls fan said of Ginger (Geri Halliwell): “A lot of people don’t like her. I think some people hate her the most out of all of them. ” She added: “I personally don’t like Scary Spice, though. ” Typically, girl group loyalism falls into the benign end of human  . But in the crucible of online fandom, demographic distinctions can coarsen into warring factions. A fan fantasy that frames the band members as hating one another  —   and paints one of them as rude, stupid, evil, and deserving of death because she is black  —   is no longer just idle fan fictions. As Ms. Kordei put it in one of her notes to fans, “For those of you who enjoy speculating creating drama that doesn’t exist, please keep in mind that myself and the other girls in the group are PEOPLE. ” She added: “This is our story so let us write it our way, instead of you trying to write it for us. ”'"}, "time": 1742561638.888195}