{"duration": 0.19887709617614746, "input_args": {"text": "\"Email \\nIt’s ironic, when a man who rails against the homosexual agenda may represent its ultimate victory. Milo Yiannopoulos (shown), the bodacious, bleached-blonde, bohemian, British bad boy of Breitbart, has long been an alt-right hero. Yet, increasingly, his fan base has extended to conservatives in general. American Thinker’s Jeremy Egerer wrote a Monday piece entitled “In Praise of Milo Yiannopoulos,” and the next day HeatStreet attempted to explain why conservatives are falling so hard for him. Oh, it should be mentioned why his rise is notable. \\nYiannopoulos is homosexual — and, it’s fair to say, flamingly so. \\nYiannopoulos certainly isn’t the first prominent homosexual “conservative.” As with all groups you find all types: adulterers, philanderers, fornicators, fetishists, etc., etc., etc. The difference is that those types don’t wear their sexual indiscretions on their shirtsleeves. They don’t conduct an “Antagonistic Adulterer Tour” or “Fearsome Fornicator Tour.” Yet Yiannopoulos’ recent outrageously popular (and lucrative) college-appearance series is actually called the “Dangerous Faggot Tour.” This brings us to an oft-heard bit of praise from his conservative admirers; as commenter “Eric H” wrote under Egerer’s article, “One of the biggest appeals of Milo is that while he's openly gay, he doesn't use the fact he's gay to ask for special treatment or protections.” No, he doesn’t “ask” for it. \\nBut he absolutely does use his homosexuality to get special treatment — via cultural affirmative action in the marketplace. \\nWhile Yiannopoulos did write last year that, for homosexuals, “it’s time to get back in the closet” (though his reasoning isn’t what you’d suppose), it’s apparent he has no intention of leading by example. Yiannopoulos is a master of self-promotion. He plays the homosexuality card in his own way because, being the sharp fellow he is, he knows it’s integral to his success. Just like someone who gets more votes because he could be our “first black president” or “first female president,” Yiannopoulos is a novelty: a flamboyant homosexual with movie-star good looks, mainly “conservative” views (gasp!), and a British accent (in the United States, people generally think that anyone with a nice Brit accent is smart). If he had the same views and eloquence but were ugly and shared a mafia don’s accent — and were straight — you’d never have heard of him. \\nYet the main point is this: We’ve long seen “out” and outrageous homosexuals applauded in the liberal cesspit that is Hollywood. In politics, Democrat congressmen Gerry Studds and Barney Frank both were openly homosexual already in the ‘80s, both were scandalous, and both were frequently reelected. But now we’re seeing how, quite predictably, this defining of deviancy downwards has bled into the conservative fold. \\nAnd the bleeding is now profuse. In his heroization of Yiannopoulos, Egerer writes, “Milo is a savior of sorts all the same, putting himself on a cross when the rest of us were stuck in our sociable sins and taking our beating when we should have been willing to take it [the cross] ourselves.” Mr. Egerer, speak for yourself. Many good men have long been on the front lines speaking the Truth as boldly, eloquently — and more deeply — than Yiannopoulos (Alan Keyes and maybe someone else come to mind). That a land slouching toward Gomorrah (hat tip: Robert Bork) chooses to ignore them isn’t their fault. \\nThen there’s Red Alert Politics , which wrote , “Yiannopoulos delivers like no conservative before; part standup, part lecture, and mixed with a little drag makes his speech one of the most exciting events coming to campuses across the country.” This prompted HeatStreet to incredulously ask, “Did anyone expect a right-wing site to describe a drag event as ‘exciting’? Did anyone expect the right wing to accept and welcome a flaming gay into their ranks? Did anyone expect Republicans to enjoy it?” \\nYes — I did — a long time ago. I explained how today’s conservatives are simply yesterday’s liberals ; in fact, I have an essay on this very matter in the current issue of The New American (November 7, 2016). \\nEgerer states that “aging conservatives” won’t be able to understand why someone as “filthy” as Yiannopoulos is enjoyable. But it’s not hard. It’s the same reason why many find porn, car crashes at auto races, and decadent entertainment titillating: the allure of sin. As ancient Chinese sage Confucius put it, “I never knew anyone who loved virtue as much as sex.” But my question for Egerer is, can he understand the danger posed by a society that exalts such filth? \\nEgerer acknowledges the “sinfully delicious” factor, writing, “What we can also appreciate about Milo is that he's actually interesting.... He's stylish and original and something bordering on dangerous.... Following Milo on Facebook is much more like taking drugs.” Perhaps, but whatever happened to “Just say no”? Take a gander at Yiannopoulos in his get-up below: \\nThen consider how Yiannopoulos is famous for talking explicitly about his sexual predilections, an example being his oft-expressed affinity for black d***. This matters because who we choose for our heroes matters. What will you tell your son? “Well, Johnny, dressing like a girl and engaging in perversion is okay — if you do it for the ‘cause’”? \\nEgerer certainly is right about Yiannopoulos being interesting; he does engage in masterful takedowns of feminists, snowflake social-justice warriors, and other leftist ne’er-do-wells, and he can colorfully turn a phrase. Therein lies the problem. HeatStreet opines, “It’s easy to assume that Milo’s influence over Republicans is a sign of changing attitudes toward LGBTs, but that’s not the case.... Milo isn’t normalizing homosexuality for the right, he’s merely a sign of what the New Right values and wants.” But this is wrong on both counts. Polls clearly show that conservative acceptance of homosexuality has increased, and younger conservatives are generally quite libertine. Just as significantly, though, Yiannopoulos’ influence is without question a normalizing one. \\nHollywood has long had a practice of putting homosexual characters in shows and films and making them particularly attractive, intellectual, rational, and likeable. This is no accident. It’s part of a strategy prescribed in the 1989 homosexual-activist book book After the Ball: How America Will Conquer Its Fear and Hatred of Gays in the 90’s . You see, people have always had trouble “hating the sin but loving the sinner”; they tend to either love both or hate both. So you prey on this weakness: Get them to love a sinner — who identifies so closely with his sin that he embodies it — and you can get them to love, or at least become numb to, the sin. \\nThe Yiannopoulos phenomenon is a matter of life imitating art: He’s that attractive (to conservatives) homosexual character who softens people’s minds to sin — which is followed by a hardening of the heart to Truth. As another commenter under Egerer’s piece put it, “The most effective revolutionaries are those who present themselves as defenders of a current order of things while undermining the moral foundations upon which it rests.” \\nAnd there’s more to this undermining. Yiannopoulos can be seen in the videoed interview below (warning: graphic language) talking about how — at the age of, as he put it, “something like” 14 — he performed fellatio on a man of the cloth. He insisted the encounter “was consensual” and that he, not the clergyman, “was the predator.” Worse still, Yiannopoulos talks (4:46 in video) about how, as a grown man, he attended parties hosted by high-status Hollywood figures where he saw things that “beggared belief”: namely, grown men using for sex boys who were, as Yiannopoulos describes it, “very young — very young.” \\nYiannopoulos obviously didn’t report the child sexual abuse to authorities and refused to name names, saying in the interview, “I don’t want to be indiscreet about specific people because I think it’s going to be, yeah, dangerous.” Okay, now, isn’t this the kind of thing that destroyed late Penn State football coach Joe Paterno? Note that Paterno was not found guilty of any criminality, molested no one, and even reported child sexual abuse by an underling to a superior. But that he didn’t go to authorities himself was enough so that he would become a pariah, die in disgrace, and have his Penn State statue torn down. \\nIn contrast, Yiannopoulos describes the clergyman who abused him as “a great priest.” So we should ask, what is his definition of “great”? And what does he think the age of consent should be? Fourteen? Twelve? \\nThis is another example of special treatment and protection that Yiannopoulos may not ask for, but certainly enjoys. It’s much as with the Gene Robinson case . An Episcopal priest, Robinson came out as homosexual and left his wife and children to live with a man. Yet while a straight father who left his family to pursue sexual gratification would be branded a dog, Robinson was hailed as brave; and far from being defrocked, was rewarded by being elected bishop in 2003. \\nYiannopoulos, too, has been called “brave.” But how brave is a man who protects the identities of pedophiles/pederasts because it’s “dangerous”? Note that this reflects precisely what I reported on in “Hollywood Dearest: Seared Souls and the Silver Screen” ( The New American , March 2014): Pedophilia is rampant in Tinseltown — but everyone who could save future victims is too cowardly or corrupt to come forward. \\nIn his praise of Yiannopoulos, Egerer writes that “Milo is not a saint, and thank God it was never his intention to be.... But in an age when respectable men are cowering beneath the shadow of a new and ugly heterodoxy, what we need are not always polite and political men.” Believe it or not, however, there’s something between being a Devil’s-politeness coward-con and a drag-queen callow-con. George Washington was known for virtue, honor, and never using a foul word, and no one could accuse him of lacking bravery or willingness to oppose tyranny. But we have gradually lost sight of what virtue is and consequently what a true hero is ; in particular, we’re in the grip of our day’s “great heresy,” which, noted philosopher G.K. Chesterton in 1926, “is going to be simply an attack on morality; and especially on sexual morality.” Thus, he predicted, “The madness of tomorrow is not in Moscow but much more in Manhattan.” \\nThat tomorrow was yesterday. And with today’s conservatives, the madness now lies not just in Manhattan but in much of Middle America where Milo is queen. “Dangerous faggot,” indeed. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.\""}, "time": 1742563122.74468}