{"duration": 0.07621955871582031, "input_args": {"text": "'The Seattle judge who temporarily banned the White House’s refugee reform plan acted after mistakenly claiming the federal government has not arrested jihadi migrants from the seven Muslim countries covered by the reform. [But the federal government has arrested and jailed at least 76 people since 2001 from the seven countries covered in the first stage of the president’s reform, which was announced late January.  That fact means there is a huge error in the judge’s rationale for imposing a “Temporary Restraining Order” ban on the president’s popular reform of the expensive refugee and immigration programs. In a hearing before the decision, Judge James Robart told a lawyer from the Department of Justice that the federal government has not arrested people since 2001 from any of the seven countries named in the reform, since the 20o1 atrocity in New York. “How many arrests have there been of foreign nationals for those seven countries since  ?” he asked. The justice department’s lawyer replied, “Your Honor, I don’t have that information,” prompting Robart to answer his own question: Let me tell, you, the answer to that is none, as best I can tell. You’re here arguing on behalf of someone that says we have to protect the United States from these individuals coming from these countries and there’s no support for that. But according to a database built by the Senate’s immigration subcommittee, the federal government has arrested and convicted at least 73 people from the seven countries of Iran, Iraq, Libya, Somalia, Syria, Sudan, and Yemen. The Senate’s database was assembled despite repeated refusals by Obama’s deputies to provide   data to the Senate subcommittee in 2016. However, by reviewing public data, “at least 380 of the 580 individuals convicted of terrorism or   offenses between September 11, 2001 and December 31, 2014, were born abroad,” the report concluded in June 2016. The committee’s report also added: At least 380 of the 580 were   (71 were confirmed   and the remaining 129 are not known).  Of the 380   at least 24 were initially admitted to the United States as refugees, and at least 33 had overstayed their visas. Additionally, of those born abroad, at least 62 were from Pakistan, 28 were from Lebanon, 22 were Palestinian, 21 were from Somalia, 20 were from Yemen, 19 were from Iraq, 16 were from Jordan, 17 were from Egypt, and 10 were from Afghanistan. A check by Breitbart News shows that the people convicted include five Iranians, 19 Iraqis, two Libyans, 21 Somalians, six Syrians, three Sudanese and 20 Yemenis. That’s a total of 76 people, at least. The committee’s review of arrestees was overseen by Alabama Republican Sen. Jeff Sessions,   of the Senate immigration panel. Sessions is expected to become the nation’s Attorney General, and will likely reverse the justice department’s 2016 policy of hiding information about terrorists’ immigration status from the public. A review of the Senate’s data in 2016 by Breitbart News showed that at least 100 men named for Mohammed have been arrested and convicted for   crimes since 2001.  '"}, "time": 1742561726.591817}