{"duration": 0.06303834915161133, "input_args": {"text": "'Prince wasn’t someone many people said no to. The model Naomi Campbell was apparently one who did. “I was 17 years old when I met him,” Ms. Campbell said on Thursday, the day of Prince’s death. “I was with Azzedine Alaïa and   Mondino in Paris, and I remember Prince said to me not to wear high heels, and I wore the highest heels I could find. Because it went with Azzedine’s outfit. ” But the two soon became fast friends, and she was often a fixture at his concerts no matter where (or, more notably, when) Prince decided to play. “He used to call me every time he came to London or Paris,” Ms. Campbell said. “It would be 2 o’clock in the morning and he’d say, ‘I’m going to play’ and I would go out in my pajamas. That was it. He was impromptu. The last time I saw Amy Winehouse was when she performed with Prince. They sang one of her songs and one of his. They were a powerhouse, the two of them. He loved talent. ” For many in the fashion world, the film and album “Purple Rain” became their gateway to a lifelong connection to Prince, as both a performer and role model. “I saw it three times in three days,” said the photographer Bruce Weber. “It was just like ‘wow.’ Only he could make this wonderful movie that was kind of about nothing and yet was about everything. Part of what I also loved was that not only did he do great music but he was smaller than the other musicians and he always got the girl. You felt like the biggest, tallest guy even though he wore high heels because he was so short. ” George Cortina, one of the industry’s   stylists, said: “I’d just gotten out of rehab when I first heard ‘Purple Rain.’ I couldn’t believe that album. It was the most brilliant thing I ever heard. ” Edward Enninful, the creative and fashion director of W, can still remember what it was like when he found out about Prince. He was a gay kid in London when his older brother came home to their mother’s flat and pulled out a copy of “Dirty Mind,” the singer’s 1980 album that featured a black and white image of the Minneapolis singer wearing an open studded trench coat that amply displayed his   androgynous glory. “I’d never seen anything like it in my life,” Mr. Enninful said. “Someone so blatantly challenging the ideas of race and gender and sexuality. In a way, it was comparable to David Bowie, except that Prince brought that to the black community. ” There’d been hints of that before with Teddy Pendergrass and Rick James, as well as Sylvester and Little Richard. But the remix seemed entirely new with Prince, and Mr. Enninful worshiped at his altar, loving his ruffled shirts with the Edwardian collars and black matador outfits with the crazy crop tops. In time there were comparisons to another great superstar of his time: Michael Jackson. But Prince was different. Adept not just as a singer, guitarist, keyboard player and dancer, he was also virtually unmatched in his ability to destabilize people both privately and publicly. Where Mr. Jackson used songs like “Bad” and “Billie Jean” to shed his androgyny and sexual ambiguity, Prince reveled in them, singing, “Am I black or   I straight or gay. ” “I always saw it like Prince was the bad brother and Michael was the good brother,” Mr. Enninful said. “He was pop, with clean lyrics. Prince was not scared. The first time I heard someone sing about AIDS it was Prince: ‘In France, a skinny man died of a big disease with a little name.’ He was not afraid of taboos. ” That fearlessness extended to his costumes, which were further exercises in contradiction and gender ambiguity. He rocked heavily embellished   heels but his shirts were open to the navel, showing off his chest hair. “He wore the most incredible opulent fabrics and the boots were always made to match,” said Mary Kay Stolz, who worked on the singer’s costumes for the tour of “Purple Rain. ” “International Silks and Woolens, the best fabric store in L. A. would stay open late for me because I would fly in late from Minneapolis just to get fabric and turn around. ” Mystery was an essential component of his persona. There was an aura of secrecy about him even among the people who wound up in close proximity to him. “He didn’t make a lot of eye contact and I did sign a   nondisclosure before I left,” Ms. Stolz said. “When I was there, the bodyguards said to people, ‘Don’t talk to Prince unless he talks to you.’ It wasn’t like, ‘Hey Prince.’ It’s not like anything was really conveyed, although he liked what he liked. I would leave the clothes at night and he would try them and if he liked them they wouldn’t be there anymore. He was in his musical world and that was it. ” Invariably, the fashion world claimed him as one of their own. Designers like Donatella Versace hired him to play at their shows, including in 2011, when Prince performed along with Nicki Minaj at an opening night party in New York for a collaboration between Versace and H  M. By this point Prince was not so much the sartorial maverick he’d once been as the Las Vegas version of himself, playing guitar in a pair of black ovular shades and decked out in a tight red suit. Among those in attendance was the designer Joseph Altuzarra. “I remember how epic the performance was,” he said. “I think more than anyone, really, Prince felt like he was above it all  —   just such a legend, a living legend. ” Mr. Altuzarra recently channeled Prince’s style for his fall 2015 collection of ruffled lace blouses, one he said had been inspired in part by what he called the singer’s   period in the 1980s. “There’s always something that he wore that I think is really fascinating, and I tend to really love looking at musicians’ wardrobes for inspiration. I’ve definitely looked at his style pictures. ” Ms. Versace, who did get to know Prince over the years, found a lack of pretension beneath the surface. “One of the last conversations I had with Prince was about coming to my show,” she said in statement. “He said to me: ‘Let’s have no celebrities in the first row, no V. I. P. s. Let’s have the smart and real people who do what they think is right and put all their energy to make our world better and don’t get the attention they deserve. ’” “I am crying,” she added. “All my memories are coming back to me. He was one of my closest friends. ”'"}, "time": 1742628507.684026}