{"duration": 0.09257745742797852, "input_args": {"text": "'\\nYou didn’t think she’d go down without a fight did you?\\nThe Clinton campaign is clawing it’s way to what they hope may land Hillary in the White House. Though Clinton officially conceded the race to Trump on Wednesday morning, a concession is not legally binding. During the 2000 election Al Gore conceded to George Bush on the night of the election, only to begin court proceedings a few short hours later to contest the results and initiate recounts.\\nAccording to Jim Stone , the race between Trump and Clinton may not be over just yet:\\nThey may be trying to steal Arizona and Michigan, and then use special powers to flip 9 electoral votes away from Trump. THERE IS A REASON WHY THEY HAVE REFUSED TO MAKE THEIR TOTALS OFFICIAL. THIS IS NOT OVER YET \\n…\\nTrump won Arizona. Why has it not been made official? Trump won Michigan. Why has it not been made official? They are calling the counts “unofficial,” WHY?\\nElection officials in Michigan, Wisconsin, Arizona and New Hampshire are still counting votes. The vote differentials while the counts conclude are so close that Clinton could potentially inch out a win with early voting ballots and provisional ballots. The small difference in votes in most of these states could trigger recounts. And given what we know about the Clinton campaign, we suspect that any recount would bring with it the real possibility of “uncounted votes” being discovered in back closets, much like we saw in Florida during the 2000 election debacle. \\nNewsweek confirms that Clinton still has a chance:\\nAP analyst Michael McDonald says he is skeptical that Trump won Wisconsin, as the AP projected. If that state flips for Clinton and she wins the other toss-up states, she and Trump could be in a tie at 269 votes each .\\n“Maybe Clinton actually wins Wisconsin,” McDonald says. “Look, just because the media calls something does not mean that that’s actually the outcome of the election.”\\nIn that event that neither candidate hits the 270 electoral vote threshold, the vote for President would be passed on to the Repoublican controlled House of Representatives and the vote for Vice President would be put before the Senate, also controlled by Republicans.\\nOne might say this is a no-brainer, except we have two words: #NEVERTRUMP.\\nThe NeverTrump movement, started by conservatives and championed publicly and privately by sitting U.S. Congressional leaders, could potentially steal the win right out from under Donald Trump.\\nThough unlikely, it remains a distinct possibility. \\nAnd never to go without a Plan B, as John Podesta hinted on election night , Clinton has a second option, which involves targeting the electoral college directly.\\nChange.org has already filed a petition that includes 361,000 signatures as of this writing asking members of red States’ Electoral College to turn on the will of the people of their state and cast a vote for Hillary instead of Trump. The situation would not be unprecedented, as there have been 157 “faithless electors” since the inception of the College in 1787. None of those faithless votes ever resulted in a significant shift in the election. Electors are bound by most states to cast the vote for their pledged party and failure to do so comes with fines and, in some cases, jail time.\\nWhat it boils down to is that Hillary could conceivably flip 10 Electors to her side, however unlikely of a scenario that is:\\nPetition Excerpt: \\nOn December 19, the Electors of the Electoral College will cast their ballots. If they all vote the way their states voted, Donald Trump will win. However, they can vote for Hillary Clinton if they choose. Even in states where that is not allowed, their vote would still be counted, they would simply pay a small fine – which we can be sure Clinton supporters will be glad to pay! \\nWe are calling on the Electors to ignore their states’ votes and cast their ballots for Secretary Clinton. Why?\\nMr. Trump is unfit to serve. His scapegoating of so many Americans, and his impulsivity, bullying, lying, admitted history of sexual assault, and utter lack of experience make him a danger to the Republic.\\nSecretary Clinton WON THE POPULAR VOTE and should be President.\\nHillary won the popular vote. The only reason Trump “won” is because of the Electoral College.\\nBut the Electoral College can actually give the White House to either candidate. So why not use this most undemocratic of our institutions to ensure a democratic result?\\nWe can fully expect Hillary Clinton to push, even if she does so from behind the scenes.\\nWe expect that within hours or days the push from the liberal media will be widespread and the thousands of protesters taking over major cities across America will be calling for recounts, faithless electoral votes and revolution.\\nIt’s definitely not over until the electoral votes are cast on December 19.\\nAlso See: We Finally Know Why Hillary Disappeared On Election Night: “She Was Crying Inconsolably… It Was Hard To Understand What She Was Saying” \\n'"}, "time": 1742562059.3768888}