{"duration": 0.18405699729919434, "input_args": {"text": "'WASHINGTON  —   President Trump put both political parties on notice Monday that he intends to slash spending on many of the federal government’s most politically sensitive programs  —   relating to education, the environment, science and poverty  —   to protect the economic security of retirees and to shift billions more to the armed forces. The proposal to increase military spending by $54 billion and cut nonmilitary programs by the same amount was unveiled by White House officials as they prepared the president’s plans for next year’s federal budget. Aides to the president said final decisions about Medicare and Social Security would not be made until later in the year, when he announces his full budget. But Sean Spicer, his spokesman, cited Mr. Trump’s campaign commitments about protecting those programs and vowed that “he’s going to keep his word to the American people. ” In effect, Mr. Trump appears determined to take sides in a generational struggle between older, sicker Americans who depend on the entitlement programs, and their younger, poorer counterparts whose livelihoods are shaped by the domestic programs likely to see steep cuts. He also set up a battle for control of Republican Party ideology with House Speaker Paul D. Ryan, who for years has staked his   reputation on the argument that taming the budget deficit without tax increases would require that Congress change, and cut, the programs that swallow the bulk of the government’s spending  —   Social Security, Medicare and Medicaid. “I don’t know how you take $54 billion out without wholesale taking out entire departments,” said Bill Hoagland, a longtime Republican budget aide in the Senate and now a senior vice president at the Bipartisan Policy Center. “You need to control it in the area of the entitlement programs, which he’s taken off the table. It is a proposal, I dare say, that will be dead on arrival even with a Republican Congress. ” Speaking to governors at the White House, Mr. Trump said his spending demands would be at the core of the speech he gives Tuesday night to a joint session of Congress. “This budget follows through on my promise to keep Americans safe,” he said, calling it a “public safety and national security” budget that will send a “message to the world in these dangerous times of American strength, security and resolve. ” In the first part of the speech, Mr. Trump will recount “promises made and promises kept,” said the aides, who requested anonymity during a briefing with reporters. The rest of the speech will focus on how he will help people with their problems and how he intends to protect the nation. The president’s budget proposals  —   which were short on detail but are said to exempt not just Medicare and Social Security but also veterans’ benefits and law enforcement efforts  —   would lead to deep reductions in federal programs that touch millions of lives. The White House signaled that it would begin with agencies like the Environmental Protection Agency, the Internal Revenue Service and social   programs. A budget with no entitlement cuts and one that does not balance most likely has no chance of passing the House, and could be rejected by Senate Republicans as well. Mr. Trump’s proposals are too far to the right in terms of domestic cuts and too far to the left in terms of balance. Their failure could have practical implications for the White House. If Congress fails to pass a budget blueprint for the fiscal year that begins in October, Mr. Trump’s promise to drastically rewrite the tax code could also die, since the president was counting on that budget resolution to include special parliamentary language that would shield his tax cuts from a Democratic filibuster. Without it, any tax legislation would have to be bipartisan enough to clear the Senate with 60 votes. But beyond legislative considerations, the fate of Mr. Trump’s proposal will go a long way toward determining how significantly his brand of economic populism has changed Republican orthodoxy. Mr. Trump repeatedly said during the campaign that Republican promises to transform Medicare and slash entitlement spending were the reason the party lost the White House in 2012, helpfully   Mr. Ryan, who sat at the bottom of the ticket that year, in his analysis. Social Security, health care and net interest now comprise nearly 60 percent of all federal spending, and that figure is expected to soar to 82 percent over the next 10 years. “Paul Ryan’s budget plans with cuts to Social Security and Medicare are not that popular with most voters, and what helped elect Donald Trump was the promise not to cut benefits and programs,” said Douglas Elmendorf, the recently departed director of the Congressional Budget Office and current dean of Harvard’s John F. Kennedy School of Government. “That is an unresolved tension. ” White House officials said the broad outlines of a spending plan represented the logical culmination of Mr. Trump’s efforts to make good on his campaign pledges to prune what he considers wasteful government spending even as he expands what he considers an underfunded military. “It will show the president is keeping his promises and doing exactly what he said he was going to do,” said Mick Mulvaney, the president’s budget director. “We are taking his words and turning them into policies and dollars. ” Mr. Trump’s advisers said aid to foreign governments, which makes up a tiny fraction of federal spending, was one such target. The budget for the I. R. S. which was the target of Republican criticism during Barack Obama’s administration, would be slashed by 14 percent, according to documents obtained by The New York Times. The Community Development Financial Institutions Fund, which provides grants for community banks and local development, would be all but eliminated. The White House blueprint calls for a 24 percent cut to the E. P. A. ’s budget, according to a person who had seen the document but was not authorized to speak on the record. That would amount to a reduction of about $2 billion from the agency’s annual budget of about $8. 1 billion, reducing its spending to levels not seen since Ronald Reagan’s presidency. But it is far from clear whether Congress will approve such steep cuts in popular programs. While congressional Republicans have long targeted the E. P. A. ’s regulatory authority, they are also aware that about half the agency’s annual budget is passed through to popular   programs, like converting abandoned industrial sites into sports stadiums and other public facilities, which lawmakers of both parties are loath to cut. And most of the agency’s federal office spending goes toward funding programs that are required by existing laws. Last year, even as congressional Republicans railed against the Obama administration’s E. P. A. regulations, they proposed cutting only $291 million from the agency’s budget. Environmental advocates denounced the proposed cuts, saying they would devastate environmental protection and public health programs while doing little to increase national security. “The assault on human health begins now with President Trump’s plan to slash the E. P. A. ’s resources, which are vital to protecting Americans’ drinking water and air from pollution,” said Scott Faber, vice president of government affairs at the Environmental Working Group. But the information to emerge about the budget raises more questions than it answers. Democrats, of course, will be no friend, either. “Democrats will make crystal clear the misplaced priorities of the administration and the Republican majority,” said Representative Nita M. Lowey of New York, the   Democrat on the Appropriations Committee, “and we will fight tooth and nail to protect services and investments that are critical to   American families and communities across the country. ” But the budget may be the most striking example in Mr. Trump’s young presidency of the ways in which he is challenging the orthodoxy of his own party. Since the start of his insurgent campaign, Mr. Trump has opposed the Republican Party’s   positions on a range of policies, including free trade, how to deal with Russia and the future of government entitlement programs. Republicans in Congress had hoped that the influence of the two former Republican House members in Mr. Trump’s cabinet  —   Tom Price, head of health and human services, and Mr. Mulvaney  —   would have led to new conclusions about the need to address entitlement programs that are swelling drastically with baby boomers’ retirement. Instead, Mr. Trump appears intent on extracting the savings he needs for military spending from the one part of the budget already most squeezed, domestic discretionary spending.'"}, "time": 1742564620.0145845}