{"duration": 0.0546565055847168, "input_args": {"text": "'\\nA North Carolina police officer has been terminated after shooting her own daughter. She was showing off her service weapon to guests at her home when the girl was shot in the abdomen.\\nA Lincoln County sheriff’s deputy is facing a double tragedy after accidentally shooting her daughter with her service firearm while off-duty. Misty Michelle Flowers allegedly had friends to her home Saturday night and was showing her service weapon to them when she accidentally fired.\\nThe bullet traveled through a wall and hit her 11-year-old daughter in the abdomen, the Shelby Star reported .\\nThe girl is expected to recover, unlike her mother’s career.\\nAs a result, Flowers has been terminated and is being investigated by the State Bureau of Investigation.\\nWhile it is not uncommon for officers to bring their service weapons home with them after a shift, the sheriff’s office’s policy states, “ Members shall ensure that all firearms and ammunition are locked and secured while in their homes. ”\\nIn addition, the policy manual states : “ Members should be aware that negligent storage of a firearm could result in civil liability. ”\\nLincoln County Sheriff David Carpenter has made efforts to distance his department from Flowers’ actions, saying, “ I find gross negligence and disregard for the safety of others over what transpired Saturday. ”\\nHe also reiterated how the department’s policy on storing firearms had been made clear, saying basic firearm safety measures are “ included in hundreds and hundreds of hours of training they received during basic law enforcement training and also during service training. ”\\nFlowers had been with the department since August 2015. She was terminated on Monday while at the hospital. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by RT.com of RT.com . '"}, "time": 1742563711.3264992}