{"duration": 0.10325741767883301, "input_args": {"text": "'With Justice Neil Gorsuch now seated on the Supreme Court of the United States (SCOTUS) the NRA is launching a “series” of lawsuits aimed at rolling back gun controls in California. [The NRA’s first move is a suit filed with the California Rifle and Pistol Association  —   a suit which seeks to have California’s “assault weapons” ban declared unconstitutional.  The suit was filed April 24, and the   announced: The National Rifle Association Institute for Legislative Action ( ) today announced it is supporting, along with the California Rifle and Pistol Association (CRPA) an important Second Amendment lawsuit challenging California’s newly expanded Assault Weapons Control Act (AWCA). The suit, Rupp v. Becerra, seeks to have the courts declare the AWCA unconstitutional because the   law will do nothing to stop terrorists or violent criminals, and infringes on the right to keep and bear arms under the Second Amendment. The Los Angeles Times reports that the suit is the first in a “series” that the NRA plans to file, now that Gorsuch is on the bench. President Trump campaigned on using SCOTUS to save the Second Amendment. On October 9, 2016, he said: I am looking to appoint judges very much in the mold of Justice Scalia.   …    People that will respect the constitution of the United States. And I think that this is so important —  also, the Second Amendment which is totally under siege by people like Hillary Clinton. Gorsuch’s nomination, and subsequent confirmation, were widely viewed as the fulfillment of Trump’s campaign pledge. And the Times reports that the NRA is undertaking a legal push that it had been holding for such a time as this: The flurry of legal action comes as Neil Gorsuch, President Trump’s choice for the Supreme Court, takes his seat, returning a conservative majority to the nation’s highest court. And as the Republican administration begins appointing additional judges to the federal court system,   advocates say they hope that some of the more restrictive laws imposed in recent years will be vulnerable to legal challenge. Chuck Michel is one of the attorneys representing the   Amendment groups in the suit against the “assault weapons” ban, and he purposefully points out that   and similar rifles are “commonly possessed for lawful purposes by   citizens for   defense or shooting sports. ” The reference to firearms “commonly possessed” for “ ” ties back to language in the crucial majority opinion of District of Columbia v Heller (2008) wherein Justice Antonin Scalia indicated that for every epoch of American history, the Second Amendment protects weapons “‘in common use at the time,’ for lawful purposes like  . ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562845.609413}