{"duration": 0.03762030601501465, "input_args": {"text": "'On Tuesday’s broadcast of “Fox  Friends,” author Dr. Qanta Ahmed argued that while “a lot of Muslims around the world” are scared of President Trump’s extreme vetting, “many of us, especially opposed to radical Islam, are welcoming it. ”  When asked about the feelings of Muslims about extreme vetting, Ahmed said it was “complex. I think a lot of Muslims around the world are afraid. But many of us, especially opposed to radical Islam, are welcoming it. We don’t want to prohibit refugees here forever. We, as Americans, want to help those in need, but we do think we have to make assessments based on the regions that are identified. Libya, the third front of ISIS. Somalia, beyond failed. It’s own government cannot travel outside its capital, let alone govern it. Iraq, we’re fighting ISIS, but special exception must be made for Iraqis helping US forces. So, we see it as very pragmatic. Muslim minorities that are persecuted badly in Pakistan and other places were thrilled that this draft wording includes penalizing those that commit honor violence or persecution of minorities. A lot of Muslims are subject to that. So, I think there is a positive feeling. ” She added that Trump’s proposal to build safe zones in Syria is a “fantastic move, and one the last administration failed for years, when Muslim leaders asked President Obama to do the same. I think any Syrian that’s been displaced from their country would rather prefer to live there, if it was safe for them to do. That’s a strong move. Look at what’s happened, these people protesting in our city and around the world. Where were those protests when those babies were washed up? Nobody was carrying about the neglect of Syria for this  —   for the last six years. So these tears are rather hollow, in my opinion. It is a powerful move to argue for   zone. ” Ahmed concluded that she didn’t think Saudi Arabia should be on the list of countries that are under travel restrictions, because while the country is “complicated,” the US “needs it geopolitically. ” She further stated that since Saudi Arabia is where Mecca is, if the US “prohibits American Muslims from visiting Mecca coming backwould be appalling. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742563539.9111173}