{"duration": 0.0156707763671875, "input_args": {"text": "'Beijing holds surprise South China Sea drills in response to US patrol Published time: 27 Oct, 2016 01:20 Get short URL © AFP China’s navy is gearing up for drills near the disputed islands in the South China Sea, less than a week after a US guided-missile destroyer sailed through the waters where Beijing asserted sovereignty in what US called a ‘freedom of navigation’ patrol. \\nThe announcement of an exercise to be held in parts of the South China Sea was posted on China’s Maritime Safety Administration website. Read more ‘Illegal & provocative’: US destroyer sails through contested waters amid Chinese warnings \\nWithout disclosing the details of the drills, the maritime authority provided the coordinates for the maneuvers, which are planned for Thursday. It also ordered civilian vessels to stay away from the waters just south of Hainan island and northwest of the disputed island chain in the South China Sea. \\nThe announcement of the drills, which are quite routine in the disputed waters, comes less than a week after USS Decatur conducted a “freedom of navigation” sail-by near the disputed Spratly or Paracel Islands, through which some $5 billion dollars’ worth of trade passes through each year. \\n“USS Decatur (DDG 73) conducted this transit in a routine, lawful manner without ship escorts and without incident on October 21,” Pentagon spokesman Commander Gary Ross told the Navy Times. “The United States conducts these routine operations on a regular basis around the world, in full compliance with international law.” \\nThe US operation last Friday was the fourth “ freedom of navigation” maneuver conducted in the past year by Washington. The move, as always, drew strong response and criticism from Beijing. \\nAccording to the Chinese Defense Ministry, as the USS Decatur was “trespassing\" by the islands it was approached by at least two Chinese vessels. The People’s Liberation Army Navy ships repeatedly warned the US warship to leave, as they escorted USS Decatur from waters claimed by China. Read more US to hold joint drills with Philippines despite Duterte\\'s scandalous outbursts \\nCalling the American sail-by a “serious offense” and “aggressive behavior,” China accused the US intentionally sending US warship to Chinese territorial waters “without permission.” \\n“We strongly urge the US side to respect China’s sovereignty and national security concerns. Do not repeat the mistakes again,” Chinese Defense Ministry said . \\nAt the same time, Beijing vowed to increase military air and sea patrols, as well as to strengthen the defense capacity to better protect the country\\'s national sovereignty and security. \\nThe Spratly Islands are comprised of more than 750 islets and reefs off the coastlines of Vietnam, the Philippines, Taiwan, Malaysia, Brunei, and China, with all the claimants having their own national names for the archipelago. \\nChina has a strong military presence on the archipelago concentrated around Woody Island, where Beijing maintains a runway and an arsenal of surface-to-air missiles. Beijing continues to claim the reefs in defiance of a Hague International Arbitration Court verdict this summer.'"}, "time": 1742628434.5679805}