{"duration": 0.05068540573120117, "input_args": {"text": "'Atlético Nacional, the Colombian team that was to play Chapecoense of Brazil in the finals of the Copa Sudamericana soccer tournament this week, has asked the organization in charge of South American soccer to award the trophy to Chapecoense, which had nearly all of its players and coaches killed in a plane crash on Monday night. Nacional said in a statement on its website and its Twitter feed that it had requested that the South American confederation, Conmebol, cancel the   finals and declare Chapecoense the champion of the tournament, South America’s   prestigious club competition. “Atlético Nacional calls on Conmebol to award the title of the Copa Sudamericana to Chapecoense for its huge loss, and in posthumous homage to the victims killed in the accident,” the team said in a statement. The competition’s organizers acknowledged that the request had been made after the “unanimous agreement” of Nacional’s players. On Monday, Chapecoense was flying to Medellín, Colombia, for the first leg of the finals when its chartered plane crashed on the outskirts of the city, killing nearly everyone on board. The plane was carrying 77 people, and Colombia’s civilian aviation authority said that six people had survived the crash: three of the 22 players, two of the nine crew members and one of the 21 journalists accompanying the team. The teams in Brazil’s first division released a “statement of solidarity” with Chapecoense, volunteering to lend it players for the 2017 season. The teams also said they had issued a “formal request” to the Brazilian soccer federation that “Chapecoense not be subjected to relegation” for the next three years. “It is a minimum gesture of solidarity that is at our disposal,” the statement read. “But it is endowed with the sincere objective of reconstruction of this institution that Brazilian football has lost. ” Brazilian soccer officials ordered all games in the country canceled for a   mourning period beginning Tuesday, and around the world, other teams and leagues offered moments of silence before matches and  practice sessions. Teams and players used social media to offer their condolences to Chapecoense, a minor regional club whose rise to the country’s top division had led it to be described as the Cinderella of Brazilian soccer. As recently as 2009, the club was playing in Brazil’s fourth tier. Two years ago, it won promotion to the country’s top flight, and its berth in the Copa Sudamericana finals brought the promise of the biggest games in the club’s history. Juliano Belletti, a former defender for Barcelona, Chelsea and the Brazilian national team, said the club’s rise through the ranks had “brought joy and hope” to the entire country. The Italian club Torino and the English powerhouse Manchester United also posted poignant condolences on Twitter. Each club’s history includes its own air disaster: Torino’s team was decimated in 1949 when a plane carrying 22 players crashed into a mountain, and Manchester United met with a similar catastrophe in 1958 when 23 people died in a crash in Germany as the club returned from a European Cup game. One of the members of the Chapecoense squad on board the chartered flight was Danilo, a goalkeeper who was reported to have died at a hospital after being rescued from the wreckage.'"}, "time": 1742561965.568805}