{"duration": 0.057557106018066406, "input_args": {"text": "'Duterte Pulls a 180: China to Build Fake Islands Right Off Philippine Coast   Underground Reporter \\n( UR ) Beijing — In a move signaling a point of no return in Philippine President Rodrigo Duterte’s recent pivot to China, it was reported Tuesday the Philippines have granted a state-owned Chinese infrastructure group the right to build artificial islands in the South China Sea — they very practice Duterte’s predecessor had sought to restrict via U.N. intervention. \\n“China Communication Construction Company (CCCC), a State-owned infrastructure group, recently signed a contract with the Philippines’ Mega Harbour Port and Development Inc. to conduct a 208-hectare land reclamation project in Davao’s harbour,” wrote China’s state-run People’s Daily . \\nTo be built just off the Philippines’ southern coast by “moving sediment from the seafloor to a reef,” the four islands “will be used for government offices, businesses, residences, ports and industrial land.” \\nThe CCCC Dredging chairman stated “the project will elevate cooperation between China and the Philippines’ port construction companies to a new height” and that he “expects the project to become a model for future cooperation between the two nations.” \\nIt was barely three months ago that a United Nations arbitration court ruled China’s nearly all-encompassing claim of territorial rights to the South China Sea was invalid. That case had been brought by the administration of Duterte’s predecessor, President Benigno Aquino, because China had begun to construct artificial islands in those waters. \\nSuch a drastic shift in policy — and the, admittedly, somewhat puzzling nature of it — was remarked on by Steve Mollman who, writing for Quartz , reported on the new China-Philippines deal on Thursday: \\n“You’d think that rewarding China’s dredging sector would be the last thing the Philippines wants to do. After all, in recent years Chinese dredging ships have been an unwelcome presence in parts of the South China Sea near the Philippines, helping to build islands atop reefs that then became Chinese military bases, complete with runways and ports.” \\n\\nSouth China Sea, with Paracel and Spratly Islands. [Public domain] \\nIndeed, for awhile it appeared the navies of China and the United States — who physically intervened on the side of the Philippines — would succumb to all-out war in the South China Sea. \\nTensions have since deescalated considerably, however, due in large part to the fact that Duterte, who’s officially announced he intends for his country’s future to unfold within the Chinese sphere of influence, has taken away the one thing the U.S. needed to stick its nose in the affairs of the region — an excuse. \\n“In this venue, your honors, in this venue, I announce my separation from the United States,” Duterte said while speaking at the Great Hall of the People during a historic trip to Beijing last week. \\nIn that speech, the Filipino president made his reasoning for the pivot quite clear. “America has lost,” he said flatly. He made equally clear he wants to be a part of what he feels is the winning side: “I’ve realigned myself in your ideological flow and maybe I will also go to talk to (Russian President) Putin and tell him that there are three of us against the world — China, Philippines and Russia. It’s the only way.” \\nSo Duterte is now allowing China to build fake islands in the South China Sea. \\nThat statement, in itself, is enough to raise the eyebrows of people following the developments in that region. And with regard to the South China Sea dispute — on the Philippines front, at least — Duterte, in a very real sense, is right. American has lost. Because, after all, it’s awfully hard to convince folks of Chinese aggression when China and the country in question are cooperating voluntarily.'"}, "time": 1742561918.4878016}