{"duration": 0.03967690467834473, "input_args": {"text": "'California Gov. Jerry Brown cited the disaster relief and infrastructure needs of his state as he told reporters on Monday in Washington, D. C. that there are areas where he is seeking to work with the Trump Administration. [“I find complexity and contradiction very congenial to my bent of mind,” Brown said, in response to questions of whether he felt “conflicted and torn” under pressures to oppose or cooperate with the Trump administration.  Brown met with Federal Emergency Management (FEMA) Agency acting Administrator Bob Fenton on Monday, according to the Sacramento Bee which posted video of Brown’s comments to reporters. Brown has estimated storm damage at over $500 million dollars. On Sunday Brown, sought a fourth federal disaster declaration from President Donald Trump according to KTLA. Brown was told in the meeting of Trump’s great concern for disaster relief in California. While Brown expressed a positive response to Trump’s words, he did not relent in his criticism of the administration’s choice to review greenhouse gas standards, according to the report. California is still dealing with the damaged Oroville Dam spillway. Storms have brought welcome water to the   state, while at the same time further stressing critical infrastructure. Brown has continued to slam GOP and Trump administration aims, including the repeal and replacement of Obamacare. But under the pressure of the needs of California, he seemed more willing to work with the administration on Monday. Asked again about pressure to be the “voice of the resistance,” Brown replied, “I will pursue my own rhetorical paths. ” He continued: I will do so in the spirit of advancing the interest of California and recognizing that we’re a part of the union and there’s a lot to be, that we’re not going our totally separate way. we are distinct. we have a sovereignty. we will pursue that. but we also have a commonality with other states and with the national government  …     Brown said he is seeking to “find common ground” and that he “wouldn’t rule anything out or anything in. ” Brown faces the heavy needs of his state as well as the left’s strong calls to “resist” the Trump administration. As the concluded his comments to reporters Monday, Brown stated there “could be cause for alarm” or for “some optimism” as he said, “[n]othing’s all that predictable in the current administration. ” Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742563890.4427238}