{"duration": 0.05585455894470215, "input_args": {"text": "'South African golfer and   major champion Ernie Els looks forward to the return of Tiger Woods at the Farmers Insurance Open next week at Torrey Pines in La Jolla, California. [The smooth swinging    Els, AKA The Big Easy, thinks it quite plausible that Tiger can work his way back to winning tournaments again, including major championships. Els, who won the last of his four major at the British Open at Royal Lytham  St. Annes Golf Club in 2012 at age 42, points out, “If players like myself, Darren Clarke and Mark O’Meara won (majors) in our 40s, surely Tiger thinks he can do it too. I am sure it’s on his agenda. ”  Els says he would love to see Tiger play like his old self and thinks that he can do it if he can get it going at some of his favorite tournaments.  “Mentally, he is as strong as anybody but he needs to find some momentum at his favorite events and if he gets that, he can start believing again. I would love to see him play like he did back in the 90s, but I am not sure that is going to happen,” Els told reporters on Wednesday. Certainly, there are a number of events he likes and no one exemplifies the idea of “horses for courses” more than Tiger. Woods has dominated more golf courses than any golfer in the history of the sport. He’s won at least four times on the same course at seven different Tour stops: Cog Hill (former home of the BMW Championship) Firestone (WGC Bridgestone) Doral (WGC Cadillac) Muirfield Village (the Memorial) Bay Hill (Arnold Palmer Invitational) Augusta National (the Masters) and Torrey Pines (Farmers Insurance Open). The South African knows where his bread is buttered and who has held the spreader for the last couple of decades. “We would not be playing for the money we play for if it wasn’t for Tiger, so we have to thank him for that, for what he has done for the game and it can only be good if he plays well. ” Els praised Tiger for his achievements, observing that “It’s been 20 years since he won his first major at the Masters and it’s quite amazing what he has achieved. ” He added, Woods “has won 14 majors in that span and he was injured for at least three or four of those seasons, so it’s really a major for every year he has been healthy as a professional. That’s incredible. ”'"}, "time": 1742564538.387288}