{"duration": 0.040557861328125, "input_args": {"text": "'GENEVA (AFP)  —   European countries must stop returning asylum seekers to Hungary due to deteriorating conditions there for new arrivals including children, and allegations of abuse, the United Nations said Monday. [The situation for asylum seekers and other migrants has long been considered dire in Hungary, but it has worsened since the country last month introduced a new law on the systematic detention of all asylum seekers.  “I urge states to suspend any Dublin transfer of   to this country until the Hungarian authorities bring their practices and policies in line with European and international law,” said Filippo Grandi, United Nations High Commissioner for Refugees. The   Dublin Regulation, which aims to stop people making asylum claims in multiple countries by requiring asylum seekers to be sent back to the first European country they arrived in, applies to European Union nations as well as   Switzerland and Norway. Grandi said he was “encouraged” by a European Commission decision to work with Hungarian authorities in a bid to bring Budapest’s practices in line with EU law, but stressed in a statement that “urgent measures are needed to improve access to asylum in Hungary. ” The UN refugee agency has repeatedly cautioned that Hungary’s use of physical barriers and restrictive policies basically deny the access to asylum guaranteed under international law. Since Hungary’s new law came into force on March 28, all new asylum seekers, including children, have been “detained in shipping containers surrounded by high razor fences at the border for the entire length of their asylum procedures,” UNHCR pointed out. According to the government 324 shipping container homes have been installed at two separate locations called “transit zones” built into a fence that Hungary erected along the   ( )  border in 2015. UNHCR warned last month that the new practice would “have a terrible physical and psychological impact on women, children and men who have already greatly suffered. ” As of last Friday, 110 people, including four unaccompanied children and children with their families, were being held there, UNHCR said. EU member Hungary previously systematically detained all asylum applicants but suspended the practise in 2013 under pressure from Brussels, the UN refugee agency and the European Court of Human Rights. Grandi on Monday hailed recent efforts by Hungarian authorities to address allegations of police violence. But he said: “We remain very concerned about highly disturbing reports of serious incidents of   and violence against people crossing the border into Hungary, including by state agents. “These unacceptable practices must be brought to an end and I urge the Hungarian authorities to further investigate any allegation of abuse and violence,” he added.'"}, "time": 1742562311.073517}