{"duration": 0.0937814712524414, "input_args": {"text": "\"Proper hygiene can go a long way in helping to prevent easily-treatable diseases and viruses. Credit: EcoSoap Bank \\nThanks to a college student’s inquisitive thinking and passionate followthrough, thousands of Cambodians have been saved from contracting easily-treatable diseases and viruses. It began when student Samir Lakhani traveled to Cambodia and witnessed first-hand the amount of suffering that results from Cambodians not having access to something most people take for granted: soap. \\nGoodNewsNetwork relays that Lakhani visited Cambodia to help build fish ponds with an NGO called Trailblazer Cambodia Organization. While he was there for the summer, he witnessed a mother washing her child with laundry detergent. Because few people have soap – as it is considered an expensive luxury, it is not unusual for Khmers to rub their bodies in ash or use harsh cleaning supplies like the mother and her child did. \\nDistraught by this reality, the inspiring activist began to ponder solutions to the conundrum. Before long, the Pittsburgh University student realized that Siem Reap – a popular tourist hotspot which hosts over 2 million visitors a year – is home to over 500 hotels and guesthouses. Surely, he thought, their waste could be recycled into others’ benefit. After working on the problem long enough, he finally developed a formula for sanitizing and recycling hotel soap bars that would otherwise be tossed in the trash. \\nAfter returning to the U.S. and obtaining his degree in environmental studies, Samir began crowdfunding for his idea to create an Eco-Soap Bank organization. Two years later, he had gained corporate sponsorship and the vision he intentioned was realized! \\nSince the project took off, over 650,000 Cambodians have been provided with clean bars of soap. 30 workers are now employed by the company Lakhani founded. In addition to selling the company’s eco-friendly products as a source of income, they serve as “hygiene ambassadors” to bring soap to local schools and educate the populace on the importance of proper hand-washing techniques. \\nThanks to this student’s ingenuity, thousands of Cambodian lives have likely been saved.What are your thoughts? Please comment below and share this news! \\nThis article ( College Student Collects Unused Hotel Soap, Saves Thousands of Cambodians From Disease ) is free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and TrueActivist.com \\nDo you like our independent & investigative news? Then please check these two settings on Facebook to guarantee you don't miss our posts:\""}, "time": 1742563969.6300862}