{"duration": 0.4816477298736572, "input_args": {"text": "\"by Lambert Strether \\nI will add my thanks to Yves’ for a highly successful fundraiser. But if you are able, you can still help us make next year the best one ever for Naked Capitalism! We still had donations coming in after the formal close of our fundraiser, and they most assuredly are still welcome. Please visit our fundraiser page to see how to contribute by check, credit or debit card, or PayPal. And thanks again for all your support! \\nBy Lambert Strether of Corrente . \\nTTP, TTIP, TISA \\nCETA: “‘I trust that an agreement will be reached in the course of today with Belgium, Wallonia and other parts of the country,’ Mr Juncker told the European Parliament in Strasbourg, France” [ Business Times ]. “Some two hours of Belgium negotiations broke up without an apparent agreement early Wednesday, following six hours of similar talks the previous evening.” Reading all the Eurocrat statements, it looks to me like “an” agreement, to Juncker, means an agreement to sign the agreement, CETA, at some future date (so that Thursday’s summit with Justin Trudeau can proceed). \\nCETA: “What’s Wallonia’s deal? A primer on its role in CETA’s crisis” [ Globe and Mail ]. ” [Walloon Premier Paul Magnette’s] Socialist Party is under growing political pressure within Wallonia, an economically depressed rust-belt region. The Marxist party has been steadily gaining ground in recent polls, pushing the Socialists further to the left on issues such as trade.” There needs to be a left equivalent for “Always Be Closing.” \\nCETA: “CETA has bigger problems than not-so-‘tiny’-after-all Wallonia” [ Rabble. ca ]. “[B]y EU standards it is not all that small. Wallonia’s population is 3.5 million, almost a third of the Belgian total of somewhat more than 11 million. There are seven EU countries with smaller populations. Each of the EU’s 28 member states has veto power over CETA. That is how the EU works – on the Three Musketeers principle, one for all and all for one. If one or more of the smaller member states, such as Slovenia or Estonia, or one of the tiny island states with far fewer than a million people, Cyprus or Malta, vetoed the deal, would we be calling them tiny and insignificant?” \\nCETA: “Corporate Sovereignty Helps To Bring EU-Canada Trade Deal To Brink Of Collapse” [ TechDirt ]. This looks like what’s on offer to Wallonia: \\nThe fact that CETA’s ISDS/ICS remains the most problematic area can be seen from a fascinating CETA document (pdf) that was recently leaked. It’s called the “Joint Interpretative Declaration on the Comprehensive Economic and Trade Agreement (CETA) between Canada and the European Union and its Member States,” and is an attempt to offer additional guarantees that are enough to convince Magnette and other CETA skeptics to allow its signing and ratification: \\nThis interpretative declaration aims to provide a clear and unambiguous statement of what Canada and the European Union and its Member States agreed in a number of CETA provisions that have been the object of public debate and concerns. This includes, in particular, the impact of CETA on the ability of governments to regulate in the public interest, as well as the provisions on investment protection and dispute resolution, and on sustainable development, labour rights and environmental protection. \\nThe section on Investment Protection is by far the longest, reflecting the seriousness of the problems there. Here’s a key paragraph: CETA clarifies that governments may change their laws, regardless of whether this may negatively affect an investment or investor’s expectations of profits. Furthermore, CETA clarifies that any compensation due to an investor will be based on an objective determination by the Tribunal and will not be greater than the loss suffered by the investor. \\nAs that demonstrates, there is nothing new in the declaration. Nobody is claiming that CETA will stop governments changing their laws, just that the massive fines that can be imposed by supra-national tribunals are likely to discourage them from doing so. Similarly, claiming that those fines will be “based on an objective determination by the Tribunal and will not be greater than the loss suffered by the investor” simply confirms the untrammelled power of the tribunal to impose whatever fine it thinks is appropriate. \\nLipstick on a pig. \\nTPP: “If the trade deal comes up during the lame-duck session this fall, the two [Vice Presidents] could play leading roles on opposite sides of the debate: Kaine as a potentially significant “no” vote should the pact come up for a vote while he’s still in the Senate, and Biden as President Barack Obama’s go-to guy for shoring up Senate support and casting the tie-breaking vote if need be” [ Politico ]. \\nTPP: “The TPP ‘provides no guarantee of equal rights and remedies to migrants for labor violations, no regional task force or other solution to address region-wide trafficking issue and no region-wide restrictions on abusive behaviors by recruiters who prey on desperate workers simply trying to feed their families,’ Celeste Drake, the AFL-CIO’s trade and globalization specialist, said during a call with reporters. While the broader deal does not contain migrant worker protections advocated by the labor group, Malaysia is obligated through a separate ‘consistency plan’ to undertake certain reforms for protecting migrant workers” [Politico]. Weak-ass framing from the AFL-CIO (no surprise here) and terrible reporting from Politico (ditto). The issue with Malaysia is not “certain reforms to protect migrant workers,” and not even “trafficking.” The issue is slavery , which Obama is enabling in order to get the deal passed. Use the word! \\nTPP: “Australia could face a growing number of expensive legal claims from foreign corporations if the Trans-Pacific Partnership (TPP) comes into force, a new report has warned” [ Guardian ]. “Dr Kyla Tienhaara, from the Australian National University, said Australia ought to learn from Canada’s experience after it signed the North America Free Trade Agreement (Nafta), which came into force in 1994 and led to dozens of legal cases against Canada by US corporations [under ISDS].” \\n“Selected Government Statements and Actions Against Investor-State Dispute Settlement (ISDS)” (PDF) [ Public Citizen ]. Lots of good quotes (the US is at the end) for you to use when you write your Congresscritter. \\n2016 \\nDays until: 12. That’s less than two weeks! \\nCorruption \\n” But Trump’s biggest local political donation [in Chicago] was the $50,000 he donated to Emanuel’s first mayoral campaign” [ Chicago Reader (DG)]. “That donation came on December 23, 2010, a couple months before Rahm was elected. In 2011, Emanuel’s administration approved the god-awful 20-foot-high “T-R-U-M-P” sign that the Donald felt compelled to plaster on his building overlooking the Chicago River. But Mayor Emanuel’s not Trump’s only Democratic pal in town. Trump also hired Alderman Burke’s law firm to handle his tax appeals to Assessor Berrios’s office. Burke then won Trump several million dollars worth of property tax breaks.” There don’t seem to be many degrees of separation between the elites. I suppose that’s why they’re elites… \\nPolicy \\n” A hotelier’s guide to the 2016 presidential election” [ Hotel News Now ]. “Many hotels in the U.S. rely on a flow of legal immigrants to fill a variety of positions. Hoteliers want that pipeline of potential employees to remain open, while avoiding additional red tape to verify their statuses.” \\n“Battlegrounds: The Fight for Mosul and Election Day Disruptions” (podcast) [ Foreign Policy Editor’s Roundtable ]. If you want to get a good reading on the insanity that is The Blob , this is the podcast for you. The speakers spend a good twenty minutes discussing the details of Syria and Iraq, concluding that historians will look back on it as “a forty year’s war,” without ever once giving a reason for us to be there . Soothing NPR voices, no anger, a lot of laughter. Smart people. \\nWar Drums \\n“Hillary Clinton Promises A More Muscular Foreign Policy As President” [ HuffPo ]. “As secretary of state, Clinton was an early supporter of arming and training members of the Syrian opposition to fight Assad, a plan that faced resistance out of concern that it would be difficult to appropriately vet fighters and ensure that weapons didn’t fall into the hands of extremists. Today, the program is off to a slow start, with only 54 graduates from the first class, several of whom scattered after coming under attack by an al Qaeda affiliate in Syria. As commander-in-chief, Clinton would dramatically escalate the program, she said. ” Who was in charge of the training program? Ira Magaziner? \\nThe Voters \\n“What Do Trump and Marx Have in Common?” [Jochen Bittner, New York Times ]. This is another piece along the lines of the article from the Manhattan Institute’s City Journal that Yves linked to this morning, although it’s not a piece of outright hackery. For example: “When Hillary Clinton calls half of Mr. Trump’s voters a ‘basket of deplorables,’ she sounds as aloof as Marie Antoinette, telling French subjects who had no bread to ‘eat cake.'” But both articles deploy the “angry populists of left and right” vs. the “sensible center” trope (remember that in the Beltway you should never display anger; it’s a strong taboo). Bittner concludes: “Mrs. Clinton has the chance to change, by leading a political establishment that examines and processes anger instead of merely producing and dismissing it.” Obama destroyed hope by not delivering change. And now Clinton is holding the bag for the anger that caused. From the Department of Schadenfreude… \\nDownballot \\n= \\nThe Trail \\n“But academic research has picked up something that thousands of hours of campaign punditry has missed completely: Donald Trump talks like a woman” [ Politico ]. “Donald Trump is a stunning outlier. His linguistic style is startlingly feminine, so much so that the chasm between Trump and the next most feminine speaker, Ben Carson, is about as great as the difference between Carson and the least feminine candidate, Jim Webb. And Trump earns his ranking not just because he talks a lot about himself or avoids big words (both of which are true); according to Jones, he also shows feminine patterns on the more subtle measures, such as his use of prepositions and articles. The key then is not what Trump talks about—making Mexico pay for the wall or bombing the hell out of ISIL—but rather how he says it.” Readers? \\nWell, well: \\n&mdash; Bugei Nyaosi (@bnyaosi) October 25, 2016 \\nRealignment \\n“This party was dead before Lincoln got here” [ USA Today ]. “Pity the poor Republican Party, which has been on its deathbed since the age of 2. Never mind that Republicans currently control both houses of Congress, 30 state legislatures and 31 governors’ mansions — this split between Establishment Republicans and Trump Republicans is a sure sign the party will be flatlining any day now. ny day now …” \\nDemocrat Email Hairball \\n“Hillary’s 33,000 emails might not be ‘missing’ after all” Like a MacGuffin in a Hitchcock movie? [ New York Post ]. Important! \\n“Richard Nixon could only wish he got Hillary’s FBI treatment” [ New York Post ]. True! Sadly, I have to quote the New York Post twice in a row. It is what it is. We are where we are. \\nAnd then there’s this: LOL. If Neera thinks Hillary is going to forget about that one, she&#39;s fooling herself. https://t.co/ovVrqZJws6 \\n&mdash; Billmon (@billmon1) October 25, 2016 \\nHopefully, Our Neena can kiss that chief of staff position goodbye. \\n“New Research Blames Insiders, Not North Korea, for Sony Hack” [ Time ]. The obvious parallel being… \\nStats Watch \\nNew Home Sales, September 2016: “New home sales in September, up 3.1 percent to a 593,000 annualized rate, proved very solid though sharp downward revisions to both August (575,000 from 609,000) and also July (629,000 from 659,000) do lower the degree of what is still, however, solid strength in the new home market” [ Econoday ]. And: “Overall I view this as a good report, which was slightly below market expectations. Dispite the fact the data jumps around, the three month rolling averages are solidly improving” [ Econintersect ]. And: ” The glass is more than half full. This is very solid year-over-year growth” [ Calculated Risk ]. But: “Data from the monthly NAHB survey has continued to suggest that there are shortages of available lots and labour shortages have also been an increasingly important feature in recent surveys. The new home sales data will reinforce these concerns and there will also be concerns over affordability issues” [ Economic Calendar ]. “[L]abour shortages”… If only there were something… like an invisible hand… to solve this problem! \\nMBA Mortgage Applications, week of October 21, 2016: “Purchase applications for home mortgages fell a seasonally adjusted 7 percent in the October 21 week to the lowest level since January” [ Econoday ]. \\nInternational Trade in Goods, September 2016: “In a positive for Friday’s third-quarter GDP report, the nation’s trade gap in goods narrowed sharply in September” [ Econoday ]. “In a negative indication of retail expectations for the holidays, imports of consumer goods fell 1.8 percent following a 0.6 percent decline in August. And in a negative indication for domestic business investment, imports of capital goods fell 3.6 percent… [I]n a negative indication for domestic business investment, imports of capital goods fell 3.6 percent.” And we are a capitalist society… \\nPurchasing Managers’ Index Services Flash, October 2016: “Markit Economics’ U.S. samples are reporting a sharp upturn in business this month, first with Monday’s manufacturing report and now with the service flash where the headline index is up nearly 3 points” [ Econoday ]. “The sharp gains for Markit’s samples are a surprise but are still only anecdotal indications. Definitive data on October will be posted next week with the month’s unit auto sales and of course the monthly employment report. ” However: “Even with the stronger than expected surge in business activity, cautious staff hiring continued this month” [ Economic Calendar ]. \\nGlobalization: “Sluggish global trade is taking its toll on one of the world’s biggest ports operators. DP World reported just 1% growth in container volumes over the first nine months of 2016 at ports it’s owned for at least a year. Modest increases in traffic in Europe were offset by a sharp decline in the United Arab Emirates, where the company is based” [ Wall Street Journal ]. “DP World operates marine terminals on six continents, insulating it from economic slowdowns in individual countries or whole regions. But the company’s geographic reach can’t protect it from weak economic growth around the world, plus the ongoing commodities bust.” \\nShipping: “The Suez Canal’s managers are opening a new front in their fight with the Panama Canal for a greater share of global shipping. Egypt’s Suez Canal Authority is negotiating with large shipping lines to secure payment of tolls three to five years in advance and with a break on pricing, the WSJ’s Costas Paris reports. Egypt has spent billions of dollars deepening the canal and opening it to two-way traffic, but the number of vessels passing through has barely grown amid a slowdown in global shipping” [ Wall Street Journal ]. \\nShipping: “Fundamentals of shipping are changing, warns Danish shipowners boss” [ Splash 247 ]. “Global trade will not double by 2030 as [ Anne Steffensen, director general of the Danish Shipowners’ Association’ and the other organisers of the [third annual Danish Maritime Forum] originally thought at the first forum back in 2014…. [T]he age old link between GDP growth and world trade has broken.” \\nRetail: “More than 90% of ‘genuine’ Apple chargers & cables sold on Amazon are fake, says Apple” [ 9to5Mac ]. I bought some and they fried. I figured it was the house’s electrical system. What a relief! \\nRetail: “How Amazon counterfeits put this man’s business on brink of collapse” [ CNBC (DK)]. “Once a thriving product for movers and contractors available at a dozen big-box retailers including Wal-Mart, Target and AutoZone, Forearm Forklift has been ravaged over the past half-decade by counterfeiters, mostly selling on Amazon. Scores of merchants have copied the patented product, using its name, images and labels and undercutting the real Forearm Forklift on price.” \\nThe Bezzle: “Moody’s Investors Service and S&P Global Ratings Inc. are cutting companies slack on mergers and acquisitions, an analysis of credit-ratings data by Bloomberg News found” [ Bloomberg ]. “Over the past year and a half, both have bumped up their ratings by two, three or even six levels on a majority of the biggest deals, the analysis found…. Some investors warn the approach has encouraged an epic debt binge that could pose dangers as years of near-zero interest rates come to an end.” \\n“In a clear nod to major market-makers’ concerns about the effect of more transparency on cash market liquidity and their own profit margins, Antonio Weiss, a counselor to U.S. Treasury Sec. Jack Lew, told an audience at a market structure conference on Monday that the Treasury market information transparency debate ‘should shift from whether to seek increased transparency to how, when, and on what basis'” [Francine McKenna, MarketWatch ]. “Information on activity in cash Treasury markets is not readily accessible, and regulators lack visibility into dealer-to-customer activity, which, according to some estimates, is over 50% of the cash market.” \\nToday’s Fear & Greed Index: 47 Neutral (previous close: 55, Neutral) [ CNN ]. One week ago: 39 (Fear). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Oct 25 at 5:31pm. \\nPolice State Watch \\n“AT&T Is Spying on Americans for Profit, New Documents Reveal” [ Daily Beast ]. “The telecom giant is doing NSA-style work for law enforcement—without a warrant—and earning millions of dollars a year from taxpayers.” Not sure what’s new here…. \\n“The day when police zap suspects from the sky with drones carrying stun guns may be nearing” [ Wall Street Journal ]. \\nBlack Injustice Tipping Point \\n“The U.N. Caused Haiti’s Cholera Epidemic. Now the Obama Administration Is Fighting the Victims” [ The New Republic ]. 2014, still relevant today. \\nGeographic Information Systems can be empowering: @BmoreDoc Anyhoo, this Bikeshare thing is only the tip of the bicycle iceberg. pic.twitter.com/zg43T3jkIb \\n&mdash; Cham Green (@Cham10101) October 26, 2016 \\nWater \\n“A perfect storm of aging infrastructure, stretched municipal budgets, and changing climate conditions are putting even more of the country’s water systems under pressure. Faced with the steep cost of fixing their broken and ill-prepared infrastructure, lawmakers on both sides of the aisle are turning to private money in their search for an answer to the country’s water woes. While the record of private companies handling water supplies has been mixed, this trend toward water privatization seems to be some kind of tacit acknowledgment that local governments can’t fix the problem on their own” [ Quartz ]. Ideal infrastructure projects, eh? \\nGaia \\n“Far beyond the eight planets of the solar system, beyond even Pluto and the diminutive dwarf planets, may lurk a major new world called ‘Planet Nine.’ Few if any discoveries can be as sensational as finding another planet orbiting our sun, making the feat a Holy Grail for astronomers, who have managed to pull it off only a few times over the centuries. No one yet knows exactly where this ephemeral world might be—or even if it really exists at all” [ Scientific American ]. \\n“Tilting, sinking San Francisco high-rise raises alarm” [ AP ]. Best quote ever: “What concerns me most is the tilting.” \\nClass Warfare \\n“Don’t Diss the Dark Ages” [ Of Two Minds ]. ” New modes of production and new social /political orders do not arise fully formed. They are pieced together by trial and error and numerous cycles of adaptation, innovation and failure.” Salutary reminder! \\n“This issue brief explains how monopsony, or wage-setting power, in the labor market can reduce wages, employment, and overall welfare, and describes various sources of monopsony power. It then reviews evidence suggesting that firms may have wage-setting power in a broad range of settings and describes several trends in recent decades consistent with a growing role for monopsony power in wage determination. It concludes with a discussion of several policy actions taken by the Obama Administration to help promote labor-market competition and ensure a level playing field for all workers” [ Council of Economic Advisors ]. How I hate that dead “level playing field” metaphor. Generally, playing fields are level. It’s the refs and the crooked guys with their hands in the till in the front office that I worry about. \\n“In late 2007, before the recession started, the prime-age employment-to-population ratio in the U.S. was about the same as in other Group of Seven developed nations (which also include Canada, France, Germany, Italy, Japan and the U.K.). The U.S., however, experienced a much larger decline during the recession, and remains much farther from undoing the damage. As of June, the G-7 as a whole had recovered almost completely, while the U.S. was only 60 percent back from its lowest point” [ Bloomberg ]. “Prime-age” like “prime beef”… \\nNews of the Wired \\n“#WeAreTwitter” [ The Internet of Ownership ]. “Twitter is up for sale. Big companies are circling around looking to buy. But what about us, Twitter users? This proposal to turn one of the world’s most important platform utilities into a platform co-op has started spreading from a mere idea to an organizing campaign. Read, spread, and organize!” \\n“Only governments can safeguard the openness of the internet” [ Aeon ]. \\n“Opia, sonder, liberosis: The dictionary for all the emotions you feel but can’t express” [ Quartz ]. The Dictionary of Obscure Sorrows . \\n____. n. The despondency that steals over you when you’re committed to inventing an election drinking game but have just realized that no rules can possibly be adequate to the task. \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (KR): \\nKR writes: “A nice profile of bee on untidy flower.” Winter is coming… 0 0 0 0 0 0\""}, "time": 1742564540.7299943}