{"duration": 0.09543800354003906, "input_args": {"text": "'The recent presidential election inspired a notable amount of accessorizing, with hats  and   as impassioned voters wore their positions on their sleeves (or head or chest). The postelection atmosphere suggests this trend is not slowing down any time soon. The latest political fashion statement? The safety pin, an object that’s been adopted in the past by   celebrities (remember Elizabeth Hurley’s Versace dress?) and the punk movement. After the election of Donald J. Trump, fears are growing that segments of his base may physically or emotionally abuse minorities, immigrants, women and members of the L. G. B. T. community. As a show of support, groups of people across America are attaching safety pins to their lapels, shirts and dresses to signify that they are linked, willing to stand up for the vulnerable. “It’s a matter of showing people who get it that I will always be a resource and an ally to anyone and everyone who wants to reach out,” said Kaye Kagaoan, 24, a graphic designer from the Philippines who lives in Brooklyn. “When I saw it on Facebook, it was so simple. It resonated with me. ” On Friday, the actor Patrick Stewart posted a photo of himself to Twitter wearing a pin on his jacket, and the photographer Cass Bird shared an Instagram post about why she’s wearing one that started with “If you wear a hijab, I’ll sit with you on the train” and ended with: “If you need me, I’ll be with you. All I ask is that you be with me, too. ” Between the two statements, sentences began with “If you’re a person of color   …     ” and “If you’re a refugee   …     ” and offered various forms of support. The actress Jaime King posted the same words to her Instagram account. In wearing the safety pin, participants are taking a page from protesters of the Brexit referendum results. After British citizens voted to leave the European Union in June, the nation experienced a 57 percent rise in reported xenophobic incidents. An American woman living in Britain tweeted a suggestion that people wear safety pins to show support to those experiencing abuse. Two days later, #safetypin was trending on Twitter. The woman, who used a Twitter account, @cheeahs, that has been deleted, had been inspired by the #illridewithyou movement in Australia, in which people offered to take public transportation with Muslims fearing a backlash after a Muslim gunman held people hostage in a cafe in 2014. Those who’ve donned the pin over the last week are quick to point out that their message isn’t necessarily in opposition to the  . “More than anything, it’s ” said Sabrina Krebs, 22, a Barnard student from Guatemala City. “I wouldn’t say it’s resistance towards Trump. It’s a form of resistance to hate and to negativity. ” It is also, Ms. Krebs noted, a readily accessible item. “Everyone has safety pins in their house,” she said. “It’s something everyone can join. ” (But in case someone wants a more haute kind of protest, fashion has already jumped on the movement, with Fashionista suggesting “13 Safety Pin Brooches to Wear Now and for the Next Four Years,” with items ranging from a   pin to one with crystal embellishments.) And it’s easy to put on. “It doesn’t take much to wear a safety pin,” said Robert Clarke, 52, a truck driver from Harrington Park, N. J. “I have them on several jackets, so I don’t have to think about it. ” Some Twitter users voiced criticisms of the   trend, calling it “slacktivism,” a word that blends “slacker” and “activism. ” They expressed concern that wearing something doesn’t equate to action. Christopher Keelty, an author and nonprofit   denounced the safety pins as something white people are wearing to assuage their guilt. “They’ll do little or nothing to reassure the marginalized populations they are allegedly there to reassure marginalized people know full well the long history of white people calling themselves allies while doing nothing to help, or even inflicting harm on,   Americans,” he wrote. Wearers responded by acknowledging the critique. “I recognize that wearing a #safetypin is not sufficient action and does not supplement provide active, constructive work,”  @OliviaHungers wrote. “Donate time. Donate money. Support people in your community with action. If you still wear the pin be sure to be ready to back it up. ” For his part, Mr. Clarke said that the pin isn’t just a signal of allegiance to those he encounters, but a constant reminder to himself. “A big part of wearing it is the mental preparation on my part,” he said. “If I do see something, I’ve thought it through, and I’ll stand up and say something and not be a silent witness. ”'"}, "time": 1742562219.7417314}