{"duration": 0.16108059883117676, "input_args": {"text": "\"Lights, Camera, Propaganda! Washington's Anti-Russia Campaign Invades Hollywood \\nKeep those Russian baddies coming! Originally appeared at RT \\nFor years the influence of the CIA in Hollywood was hidden and unacknowledged. Now it’s more of an open secret; not publicized, but pretty easy to read up on if you care. Just ask the spy agency’s Entertainment Industry Liaison. \\nYes, such a thing really exists . \\nYou see, the CIA’s man in Hollywood wants to help actors, authors, directors, producers and screenwriters “gain a better understanding” of the intelligence agency in order to ensure “accurate portrayals” of its activities. It even wants to help fire up the neurons and actually give you some good ideas if you’re coming up short in that department. Indeed, the CIA provides “inspiration for future storylines” and lists them on its website. Of course, it’s all in the interest of creating authentic and balanced portrayals of US intelligence agencies and the US military. And they’re quite busy, too. Between 2006 and 2011, the CIA public relations office had input into at least 22 film and movie projects. \\nIn a column for the Washington Post in 2011, David Sirota noted that the Pentagon too enlists the help of Hollywood for PR purposes when things are going awry and Americans are becoming weary of war. Movies like Top Gun in the 1980s and Zero Dark Thirty more recently were made in consultation with the Pentagon and White House. The result of this“creative input for Pentagon assistance” bargain created an entertainment culture “rigged to produce relatively few anti-war movies and dozens of blockbusters that glorify the military” and which amounts to “government subsidized propaganda,” \\nThe CIA has had a hand in creating TV shows like 24, Homeland andAlias. The Americans — an FX show about two Russian spies living undercover in the US — was created by a former CIA agent, and the agency reportedly approves the scripts for each episode. \\nA piece in the Guardian in 2008 called the CIA’s involvement in Hollywood a “tale of deception and subversion that would seem improbable if it were put on screen”. Of course, it’s unlikely to be put on screen, given that the agency which provides guidance on CIA-related movies (...) is the CIA. \\nEnlisting Hollywood help with “anti-Russia messaging” \\nRemember the “inspiration for future storylines” list mentioned earlier? Well, guess what? The liaison’s “current pick” for a possible future movie project is about one Ryszard Kukliński — a Polish colonel and spy for NATO who spent years passing secret Soviet documents to the CIA. I wonder why they’d be interested in that sort of thing right now. It couldn’t be anything to do with deteriorating relations between Russia and the West, could it? \\nIt may sound like conspiracy theory, but the 2014 hack of Sony Pictures Entertainment revealed that the the US State Department has actively sought out the biggest players in Hollywood and tried to enlist their help with what they called“anti-Russia messaging” for the public’s consumption through innocent entertainment. In other words, the government asked Hollywood for help producing propaganda — although I’m sure the State Department would call it something nicer. \\nRichard Stengel, the US under secretary for public diplomacy, wrote to Sony CEO Mark Lynton explaining that the government needed help countering both ISIS and “Russian narratives” and said this wasn’t something the State Department could do “on its own”. He suggested convening a meeting of media executives to discuss ideas, content, production and “commercial possibilities”. Lynton responded with a list of media executives at other entertainment companies including Disney and Fox. It’s unclear from the emails whether that meeting Stengel requested ever happened, but judging by much of the recent entertainment industry output, one might be forgiven for assuming it did. \\nNegative depictions of Russia in American and British news and entertainment media are hardly new — but at least as far as I can tell, there’s certainly been an uptick over the past 12-18 months, and it coincides nicely with a major US government-led anti-Russia messaging campaign which has also spilled over into much of Western print and broadcast media. Gratuitous mentions of Russia and Vladimir Putin where they are not necessary are becoming tiresome. For me, the last straw was sitting down to watch Bridget Jones’s Baby last month and being subjected to an entirely unnecessary and irrelevant subplot about the anti-Putin punk band Pussy Riot and their struggle for free speech. It was the last straw because it was just one more in a long line of useless allusions to big bad Russia that seemed to come from nowhere. \\nFor me, the last straw was sitting down to watch Bridget Jones’s Baby last month and being subjected to an entirely unnecessary and irrelevant subplot about the anti-Putin punk band Pussy Riot and their struggle for free speech. \\nIn the Netflix political drama House of Cards, Pussy Riot — the real ones this time — got their own cameo alongside evil Putin (not the real one). But even when there isn’t a major storyline attached to Russia, somehow the country frequently gets thrown in anyway. Russia is still the go-to country when there needs to be a joke about scary or immoral foreigners. There are endless examples. \\nIn NBC’s Scandal, one character suggests Putin might randomly invade Belarus. In CBS’s Madam Secretary, one character spews the line: “I can’t go back to Russia, it’s a pigsty.” In the recently released movie Bad Moms, one of the bad moms, protesting something or other which I can’t recall, shouts “What is this, Russia?” The short-running show Allegiancewas entirely about a Russian sleeper cell in the US which was suddenly reactivated and whose members — now fully adapted to blissful life in America — no longer wanted anything to do with Russia. How original. \\nNBC’s Blacklist has given us multiple Russian baddies and the sitcom 2 Broke Girls has made its fair share of Putin jokes. The third installment of The Purge introduced us to a gang of menacing Russian “murder tourists” who take advantage of the annual 12-hour period during which any crime, including murder, becomes legal. I could go on, but you get the idea: Russians are bad. \\nIs it all CIA influence? Is it all the result of the State Department’s“anti-Russia messaging” campaign? Not necessarily. While the CIA does have huge influence in Hollywood on specific projects, many of the random negative references to Russia are probably the result of a media information war which naturally spills over into the creative output of writers and directors. Many of them probably shouldn’t be blamed too harshly. They’re fed a diet of anti-Russia messaging through the news media, so it’s no wonder these kinds of lines end up in their movies and TV shows. \\nInterestingly, in June, the Senate Intelligence Committee included an amendment to Congress’ annual intelligence spending bill which would require the Director of National Intelligence to submit reports detailing the relationship between the CIA and Hollywood. But the Senate committee is no doubt less worried about the propaganda effects and more worried about the CIA divulging sensitive and classified information to movie directors, as was the case, controversially, with Zero Dark Thirty. \\nAnyway, tip for aspiring filmmakers and TV producers: Leave the Russia jokes out. It’s getting boring. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire\""}, "time": 1742563760.1305008}