{"duration": 0.13019847869873047, "input_args": {"text": "'Obama running out of time to Pardon Clinton 02.11.2016 AP photo By Michael Wells Friday, 11 days before the American Presidential election, FBI Director James Comey announced that he has re-opened the criminal investigation into Hillary Rodham Clinton , former American First Lady, regarding the private email server that she used to illegally circumvent the government\\'s official, secure digital record storage and retrieval systems. Why she needs to be pardoned During the 4 years that she was Secretary of State under the Obama Administration, she admittedly diverted all official electronic communications that she sent or received through her own email server, which was not secured properly to store sensitive government information. This left the information vulnerable to hacking by criminals or other governments. Moreover, the server was in her non-approved basement location, which even left the digital records subject to possible physical theft. Print version Font Size She controlled which official communications got passed on to the government and which were selectively held back from the historic record of our country, with common sense telling us that the ones that incriminated her never made it to the official record. The collection, removal, or storage of sensitive government documents in an insecure location constitutes espionage under American law, and Clinton\\'s dereliction of duty in securing the electronic documents is all that is needed to prove a crime. Even if she had \"accidentally\" left the information unsecured, her negligence would still constitute espionage . Not done with her yet The announcement by Comey on Friday that the investigation was once again open (based on newly discovered emails that were recovered from a laptop in an unrelated investigation of the husband of one of Clinton\\'s aides) was a serious blow to the Clinton campaign, casting light once again on Clinton\\'s deceptive and megalomaniacal character . (Note: the case was never \"closed.\" It was technically still \"open,\" pending finalizations and administrative procedures, but the investigation had completed and the case would have been closed pending those finalizations). Comey had originally declared the case against Clinton closed in July, stating that while Clinton had obviously broken laws, he felt that there was no reason to prosecute. This was a truly baffling decision, as the publicly-known facts of the case alone are enough to bring a successful espionage indictment. Not only had Clinton secretly housed and controlled government documents at her home, she actively destroyed subpoenaed documents . Clinton and her aides showed clear intent to mislead investigators in the face of a \" mountain of evidence of her criminal behavior .\" \"Although there is evidence of potential violations regarding the handling of classified information, our judgment is that no reasonable prosecutor would bring such a case,\" Comey stated in July when he originally \"closed\" the case. Equal treatment under the law Any other person in America who was investigated for mishandling state secrets, and there was \"evidence of potential violations regarding the handling of classified information,\" would face a swift and unpleasant prosecution for the Capital offense of espionage. They would be held in prison while the investigation and trial proceeded. One Navy submariner was recently charged with espionage for taking selfies in the engine room where he worked. Once he realized he was being investigated, he destroyed a laptop, cell phone, and memory card. He was charged under the Espionage Act and pleaded guilty to Retaining Classified Information on his phone, but the Obstruction of Justice charged was dropped. Even so, he faces 10 years in prison. By comparison, Clinton removed thousands of government documents, controlled which ones the government had access to, and housed them at her home for years exposed to hackers. According to the U. S. Code , this crime carries varying levels of prison time and monetary fines, with a maximum penalty of death, at the judge\\'s disposal based on the actual specifics and severity of the case. The re-opening of the case is based on the recovery of several thousand new email messages, and it is going to take time to review and analyze the new material. This is not a task that will be completed before the Presidential election on November 8. Therefore, Hillary Rodham Clinton will be the first Presidential candidate in history to be under criminal investigation for espionage by the FBI at the time of the election... unless she is pardoned first . It seems that the only chance her campaign has of winning now is if she receives a Presidential pardon, and quickly. This would completely absolve Clinton of any wrongdoing concerning her email server, and prevent her from being subject to prosecution for the crime or any related crimes, now or in the future. Her espionage crimes against the country would vanish, as though she had never done anything wrong. The Clinton Family would simply walk away from Hillary\\'s 4-year international crime spree that resulted in the deaths of many of our most loyal Americans, while she represented the United States of America and wielded all the power that comes with being the Head of State to her personal gain. Obama had better hurry The sooner President Obama pardons her, the better the chance of Clinton\\'s campaign successfully righting itself by feeding lies to the voters and attacking her opponent, Donald Trump . Having been pardoned will restore much of her credibility with her voters, who would tend to see it as a statement of innocence. With only 10 days until the election, Obama will need to act quickly to save his magnificent successor and seal his legacy as the true enabler of the most corrupt politician in history .President Obama pardoned 98 people Thursday, bringing the total number of people that he has expunged of guilt this year to 688. According to USA Today , this is \"the most commutations ever granted by a president in a single year.\" It sounds like President Obama is quite familiar with the process of \"officially forgiving\" criminals for their digressions against humanity. Why wouldn\\'t he forgive yet another career criminal, then, in a desperate bid to keep his political party in power? It\\'s obvious that he will . He is too much of a pawn for the Clinton Machine to rise up against their power. That\\'s why the world witnessed the head of the Justice Department (Loretta Lynch) improperly meet with Bill Clinton (the husband of the subject of an ongoing Justice Department criminal investigation) in a jet in Phoenix. That\\'s why Lynch promised to accept the findings of the FBI during the first Clinton investigation, no matter what conclusion they reached - even though she had never done that before. And that\\'s why you saw James Comey buckle and \"close\" the case the first time. It was (obviously, to the layman) a badly orchestrated \"pretend Hillary didn\\'t break the law\" order that came down from Obama. James Comey stopped his investigation, as he was instructed, and came up with the \"she\\'s guilty but we\\'re not going to prosecute\" line. Director Comey has finally stood up to Clinton by \"re-opening\" the case, and he\\'s playing a dangerous game by investigating her again. It is a widely accepted notion that crossing the Clintons can result in one\\'s death , usually with \"suicide\" or \"unusual circumstances\" listed as the cause. Of course, there are rarely and suspects charged in these cases. Keep them out In my opinion, the world would be a better place without the Clintons in power, and America should keep them out of the Whitehouse at all costs. The FBI won\\'t have time to indict Hillary before Obama pardons her, and the most corrupt politician in history will be cleansed of all wrongdoing, ready to destroy the most powerful office in the world with her greed and sense of entitlement. Michael J Wells'"}, "time": 1742564244.8781574}