{"duration": 0.49685049057006836, "input_args": {"text": "'Archives Michael’s Latest Video End Time Persecution Is Here: Russia Just Banned Evangelism And China Has Torn Down 1000s Of Crosses By Michael Snyder, on July 12th, 2016 \\nWe always knew that this was coming. For years, the horrifying persecution of Christians in the Middle East has made headlines all over the globe, but now we are seeing very disturbing examples of government-sanctioned persecution literally all over the planet. As you will read about below, Russia just banned virtually all types of evangelism outside of a church or religious site. And China has been tearing down thousands of crosses and has been demolishing dozens of churches in a renewed crackdown on the growth of Christianity in that nation. Overall, there are 53 countries that now have laws that restrict the Christian faith according to one recent report. When are we going to wake up and realize what is happening? \\nWhen I heard about the new law that was just passed in Russia, I was absolutely stunned. I was in Moscow just a few years after the Berlin Wall fell, and the people were very eager to hear about the Christian faith which had been brutally repressed under the Soviet regime for decades. \\nSadly, Russia has now decided to revert back to the old Soviet ways. This new law, which Vladimir Putin wanted, represents almost a complete and total ban on sharing the gospel … \\nThe law, which will come into force on July 20, will prohibit evangelism anywhere outside a church or religious site – including private homes and online – and those in breach of it will be fined . Only named members of religious organisations will be able to share their faith, and even informal witnessing between individuals is forbidden. \\nAccording to the New York Times, this ban also includes “preaching and praying” that is done outside the boundaries of “officially recognized” religious institutions. \\nIn recent years, I have defended Russia in many of my articles. But there is no defending this. \\nThis new law is the single worst thing that Russia has done since the collapse of the Soviet Union, and they should be utterly ashamed of themselves. \\nMeanwhile, government officials in China have launched a renewed crackdown on Christians as the underground church continues to grow like wildfire. \\nAccording to some reports, the government has torn down more than 2,000 crosses in Zhejiang Province alone in recent months… \\nMore than two thousand crosses have now been forcefully removed from churches as part of a government campaign to regulate “excessive religious sites”. \\nThe nation’s leadership launched the crusade to eradicate Christianity in the coastal province of Zhejiang almost two years ago. \\nSeveral members of the public have since been arrested for attempting to halt the government’s crude attempt to suppress the Christian faith. \\nBut sometimes government officials don’t stop there and decide to tear down an entire church. In fact, since the beginning of this year at least 49 churches have been destroyed in Zhejiang Province. Just recently , one group of believers defied the government and returned to their destroyed church to hold a worship service… \\nChristian worshipers gather to worship among the ruins of their demolished church, defying the Communist Chinese government anti-Christian drive. These congregants in China’ Wenzhou, Zhejiang province conducted a prayer service despite their church building demolished by the government officials. \\nZhuyang Church, which was a government-sanctioned church, was routed as a part of an unprecedented church demolition drive. On May 20, the church was demolished by about 100 government officers took down the church building authorized despite the fact that it had the government authorization to operate. \\nThe church member said that the only reason the official could provide for church’ demolition was that the church was “transforming the villages in the city.” \\nBut even the churches that have been left standing in Zhejiang Province are also feeling the pain of the crackdown. According to China Aid, there is a new law that is forcing many churches “ to turn over all of their tithes and donations to state authorities “… \\nThe communist government of China’s Zhejiang Province is enforcing a new law that demands numerous churches to turn over all of their tithes and donations to state authorities. \\nAccording to a nonprofit Christian organization dedicated to serving the persecuted Church in China, the officials of Pingyang County in Wenzhou are compelling members to give all of their churches’ income to state authorities. \\n“The government officials will interfere with church affairs, managing our donations and some large-scale projects,” a source told China Aid . \\nFor so long, most Americans have considered the Chinese government to be our friend. But that is not true at all. The communist Chinese are a corrupt, wicked regime that has always been deeply anti-Christian. Anyone that believes otherwise has simply been deluded. \\nMeanwhile, the persecution of Christians continues to intensify in many parts of Africa. Just recently, a mother of seven children was “ hacked to death ” by Islamic radicals in Nigeria for openly preaching the gospel of Jesus Christ… \\nA Christian mother of seven was hacked to death by suspected Muslim radicals in Nigeria and her mutilated body was discovered in a pool of blood along with a Bible and megaphone she used to preach every morning. \\nAccording to local reports , 41-year-old Eunice Olawale, a pastor at the Redeemed Christian Church of Nigeria and an evangelist, was murdered in the early morning hours on Saturday while she was out evangelizing near Nigeria’s capital of Abuja. \\nOlawale’s husband, Olawale Elisha, told local media that his wife had left their home around 5 a.m. Saturday morning to preach in the neighborhood but she never returned home. \\nEver since the first century, Christians have been martyred for publicly preaching the gospel, and we were warned that this kind of terrible persecution was coming in the last days. \\nOf course Christians in the Middle East don’t exactly need to hear about “the coming persecution” because they have been living it for many years. Christians are being tortured, beheaded and crucified by radical terror groups such as ISIS, and in other areas of the Middle East the persecution is being imposed on a national level by the government. For instance, just check out what is happening right now in Pakistan … \\n“ The government of Pakistan has announced plans to force Islam on young people by making Quranic study compulsory for all school and college students , which is contrary to the country’s constitution and the Islamic precept that there should be no compulsion in religion. This is the latest escalation of the country’s bias against Christians, other minority faiths and non-believers,” said Peter Tatchell, Director of the human rights organisation, the Peter Tatchell Foundation. \\n“Pakistani Christians, including children, are at risk of kidnapping, forced marriage and forced religious conversion to Islam. Some are also victims of blasphemy charges, which carry the death penalty. There are regular violent assaults on Christian families, homes, shops and churches. \\nThe persecution of the end times is here. \\nAll over the planet, the Christian faith is under assault. In the western world we may not have to face much violent persecution just yet, but our faith is relentlessly mocked, ridiculed and demonized on television, in the movies and on the Internet. Laws that are anti-Christian in tone and substance are regularly being passed, and many of our top politicians are not even pretending to be fair to us any longer. \\nJust like in much of the rest of the world, we are starting to discover that there is a great price to be paid for following Jesus Christ. \\nIn Matthew 16, Jesus told us that if anyone would choose to follow Him, that individual should “d eny himself, and take up his cross, and follow me.” \\nAre you ready to take up your cross? \\nThe persecution of Christians is only going to get worse in the years ahead, and in order to make it through what is coming we need to be ready to give up everything for Him. \\nPeople were saying that Putin was Christian. This latest development suggests otherwise. Jim Davis \\nHe is a Russian nationalist and supports the Russian Orthodox Church and evangelical Christianity. I don’t agree with such a law, but I suspect the real target of the law may be Islam. GoldenGirl \\nThat is an interesting point (about Islam being the target), and would be worth investigating. RageHard84 \\nBut, with this law, the Russian Orthodox Church won’t be able to evangelize non-Christian populations within Russia. Jim Davis \\nHe is a Russian nationalist and supports the Russian Orthodox Church and evangelical Christianity. I don’t agree with such a law, but I suspect the real target of the law may be Islam. James Dohnalek \\nIf we are part of the alien universe, this proves that we may be at the bottom of all beings in the world. Religion obliteration by elites is an outrage. End of days for sure. Jim Davis \\nPutin is not obliterating the Russian Orthodox Church Jim Davis \\nPutin is not obliterating the Russian Orthodox Church Dont Mention The War \\nSo she was set-upon by folks whilst she was preaching in the streets with her MEGAPHONE at 5AM on a SATURDAY morning. Not surprising everyone was sick to death of her. Jim Davis \\nWhat should try to do sometime is attempt have a rational, logical discussion with one of these types. It’s quite entertaining. IsReal \\nYou should watch the atheist vs. Christian debates on YouTube. Atheists get exposed as fools! Jim Davis \\nWhat should try to do sometime is attempt have a rational, logical discussion with one of these types. It’s quite entertaining. Paul Patriot \\nSame thing in Muslim countries, Muslims pray early in the morning and can be heard all over town….very annoying, sounds like a hyeena or a sick child screaming. \\nBut, if a Christian wants to share the “only name under heaven in which man can be saved” she is violently murdered. \\nA ….the “religion of peace” doing what it does best, murder those who disagree with you. Dont Mention The War \\nI would posit that it probably had nothing to do with her religion; they were just fed up with her caterwauling with a megaphone at 5am every morning! iris \\nAgree. The moderate Muslims are either apostates or hiding their intentions, according to former jihadist terrorists who have believed and received Christ Jesus. But it’s not politically correct for them to say so, even though they lived it and witnessed it. Bran Mak Morn \\nAnd DHIMMIWATCH about DHIMMITUDE spreading in the west! I think Donald Trump is very right to go for an alliance with Russia against the Islamists and Islamic state! he should wipe them out in Syria and elsewhre and let not more Muslims come to European and other countries and USA. Fight Sharia whereever it tries to spread, like the British do in GB and UK now, they have to fight for their pure survival and freedom there against Muslim gangs and Islamists and crimes and corruptions! Fight Islamism worldwide! For example read JIHAD WATCH about it. And DHIMMIWATCH about DHIMMITUDE spreading in the west! I think Donald Trump is very right to go for an alliance with Russia against the Islamists and Islamic state! he should wipe them out in Syria and elsewhre and let not more Muslims come to European and other countries and USA. Fight Sharia whereever it tries to spread, like the British do in GB and UK now, they have to fight for their pure survival and freedom there against Muslim gangs and Islamists and crimes and corruptions! Fight Islamism worldwide! Be Still \\nThe more you persecute us. The more we grow. The Christian explosion is in Asia, China and India for example. When you see them banning it’s because the growth is exponential. Rhialto the Marvellous \\nPersecution against Christians is happening in this very comment section. One commenter is trying his best to shut down the voice of God’s people by using ridicule and lies. Dont Mention The War \\nOh do grow up, it’s called a discussion! You should be happy people [can be bothered to] challenge/discuss your faith; it gives you an opportunity to think about things from another persons perspective if nothing else! GV \\nawwww, poor delicate little snowflake, sounds like you need to grow a pair Washington Ervin \\nI was wondering when this story would make news in the West. I read about this last week \\nThe stage is being set. K \\nWhen some young people have been taught that Hitler and Stalin were Christians. That the inquisition, and crusades are strong examples of what Christians stand for. Can persecution be far away? To believe such lies, shows how easily they are manipulated. If such outrageous lies can be believed. What lie will they not believe? As once the Jews were made to wear yellow stars. We may yet be made to wear yellow Crosses. \\nI would wear that yellow cross with pride. iris \\nMe too, and a yellow star. K \\nBux and Iris, Amen. Hawk5000 \\nI read this and to me it is business as usual. Religion continues to be the most devices aspect of human society. www.tomatobubble.com \\nPutin is only banning foreign spies and domestic traitors who want to use “evangelization” as a cover to subvert Russia. Good for him. GV \\nthat’s may be what the Chinese authorities are thinking too they have seen how the U.S. government uses NGOs to subvert governments www.tomatobubble.com \\nI’m sure Chinese see through it too. homeport \\nPutin is an egotistical former KGB thug who envisions a revitalized Russia with him as the “czar”. Christians have always been a thorn and threat to oppressive govts, from Rome to Nazi Germany to Soviet and post-Soviet Russia. This law will serve to intimidate Christians and strengthen the power that the “czar” craves. Ditto for the Chinese. www.tomatobubble.com \\nExcept you forgot to mention a little detail that Putin himself is a devout Christian. \\n“Putin is an egotistical former KGB thug” That’s just pure unfounded drivel. True, he is a former low level KGB, that doesn’t make him a thug. \\nOh, and Nazi Germany wasn’t anti-Christian either. GV \\nI see you’ve bought into the neo-con BS about Putin. The biggest threat to world peace (indeed survival of the planet) is the U.S. government GV \\nand George H.W. Bush was head of the CIA (Criminals In America) DJohn1 \\nThe problem with Putin and others is that they are provoking a huge return of people to the Christian Faith simply by denying them the right to practice their religious faith without persecution from the powers that be in that country or countries. I do not know what idiot in those countries came up with a plan to deny people the right to believe what they want but it works against Satan because people are very offended by this denial. This goes beyond a logical discussion of what to believe and what not to believe and places it squarely in the quarter of not playing by the rules. God has the right to take these people like Putin down and in God’s good time He will. So decisions are made by people to be Christian and if that means Satan ending their lives through these Satan people then according to the Faith itself they are assured a place in Heaven with Jesus Christ. These people will take no revenge because revenge is the Lord’s not ours to give. My own experience I have seen Satan’s people suffer plagues simply because of their actions against Christ’s people. Suddenly a cancer forms and rapidly kills them. None of which has anything to do with the persecuted. God on the other hand might have a lot to do with it. I am simply explaining the mentality that when Christians remove themselves from the revenge route what is likely to happen. The reward for those killed is Heaven and Immortality. I have perhaps 20 years left maybe. Could be 40. Even if it was, I will eventually die like every other person dies on this planet. Somewhere between birth and probably a max of 130 years, we all die. In the wisdom of Soloman of Proverbs fame, there is a time for everything. Satan has had much better results from allowing the Christians to do what they want. So in a way, this is crazy on his part. SO I can only conclude that someone under his control is doing this on their own. In the end, God, the alpha and the omega, controls everything. So one might ask God, why are you allowing this breech of the rules? And there are rules that not many people even understand. www.tomatobubble.com \\n“The problem with Putin and others is that they are provoking a huge return of people to the Christian Faith simply by denying them the right to practice their religious faith without persecution from the powers that be in that country or countries.” \\nNo, the problem is you for being willfully ignorant of what’s really going on in Russia. Those “nice Christian” evangelists are not there to bring Jesus, but to overthrow the Russian govt and replace it with pro-Western tyrants, just like they did in Ukraine. Thank God Putin won’t let that happen. GV \\n“…God has the right to take these people like Putin down and in God’s good time He will….” \\nbilge, where was your “god” when Bush and Obama were committing war crimes? iris \\n(: Yes, indeed, even the demons must serve and obey God. He always wins in the end. The contrast between good and evil and truth and falsehood somehow comes into brighter focus during times of persecution. Think it was Shakespeare who said, “Iron bars do not a prison, make”. jj \\nTotal disinformation and the manipulation of the facts! Synder has lost all credibility. GV \\n“…This new law is the single worst thing that Russia has done since the collapse of the Soviet Union, and they should be utterly ashamed of themselves….” \\nwhy don’t you report the Russian government’s rationale for the proposed law? Robert \\nPutin is doing what the Russian Orthodox Church wants him to do. Too much modern evangelization is nothing more than easy belief and then live like you want to. Much deception . IsReal \\n“modern” is an incorrect term to use, if you wanted to use Apostasy, that’s one thing. The old orthodox churches are in Apostasy, there has been much revelation pouring out, the spirit of God isn’t static but redeeming and restorative each day after repentance of sin. The Word is true and the rock, but the Holy Spirit is a living person, not some cross hanging on a wall. Linda \\nThis may be true about China. But I think you should do a bit more investigating with Russia. I recently read elsewhere: “The Russian Law does not halt the “preaching of the Gospel” or the preaching of the Gospel to any Russian. It does stop every cult and denominations that has created theologies that deny Jesus Christ, or offer a false christ, (anti-christ) and have turn into fronts of Cultural Marxism, the Gay Agenda and Chrislim.” \\nAnd I think this should be taken in context with what is going on right now. Currently, Obama has soldiers and missiles sitting all around Russia and is rattling the chains tryig to start a war. As another poster mentioned, it is common CIA tactics to send NGO’s into countries to destabilize them, often on the pretext that they are “preaching the gospel,” when they are not. He has been begging world reporters to start reporting what is going on. I really don’t think he wants a nuclear war with the US. Obama? I wouldn’t doubt that this is his motive, just as he is trying to start a race war here. \\nAnd I do believe that Putin has become a Christian. The number of churches in Russia has exploded in the last 10 years, and he should get some of the credit for that. Robert McMaster \\nAdd Scientology to the list. All these NGOs function in bad faith, sorry for the pun. Seize all their assets, expose all their documents and files. Putin doesn’t care if he or government policy is openly criticized on the level. But deceit and malice is the American Way. Justin \\nAnd you shall know them by their fruits. So in the 2,000 years since Christ came can anyone name one righteous city in all the world? Cut it down He said to his servants because we know Him who said, “Vengeance is Mine!” Cast out the slave woman. Michael doesn’t understand; the blind leading the blind. Understand that it is the Lord himself doing this. These faithless children are being cast out and the nation is being given to another people. Tim \\nYour comment doesn’t make sense. Jesus was referring to the nation of Israel in that parable. After 3 years that nation hadn’t produced fruit, so they were cut off. But the elect nation of Israel hasn’t been completely forsaken. Right now the Lord is taking out of the Gentiles a people for His name. When the fulness of the Gentiles has come in, the Lord will return to dealing with the nation of Israel. The Lord is using the Gentile nations to provoke Israel to jealousy. Read Romans 11. Justin \\n“Though they swear, ‘As the Lord lives’ surely they swear falsely”. The reason you do not understand is that you worship a dead God. Tim \\nI worship the triune God. He is the great I AM. He is the Alpha and Omega, the beginning and the ending, which is and which was and which is to come, the Almighty. He is from everlasting to everlasting. iris \\n(: Me, too! Where would we be without His Love? Pandadude12345 \\nThey aren’t Jealous. They are deluded into believing that they are still superior to us. iris \\nNo, they don’t trust the Christians in name only, like the Crusaders and Nazi Germans who posted Hitler’s photo in their church sanctuaries, the KKK, etc. Show them love and mercy and respect, like Paul says to do in Romans, if you really know Christ. Paul was Jewish and loved his people, Jesus was Jewish and loved His people. Imo, you speak for satan. I’m a Christian, and find you superior in arrogance, jerk, so don’t speak for me. Pandadude12345 \\nMine was not jerky. You are just offended because I told the truth: your kind is deluded by satan into hating us goyim. The illusion that satan brought among your people has held well. Also, should we have just let our nations fall to the menaces of Islam and Communism? This is precisely what Hitler and the Crusaders wanted to do. DOUBT IT NOT! And honestly, with a little bit of convincing, your kind will cease their hatred amongst us. Think: 80% of your kind believes “THERE IS NO GOD” iris \\nSorry, I shouldn’t have called you a jerk. Think your statement was jerky, but we’re loved by God, despite our behaviors. (Hmm, that could apply to the nation of Israel and Jews, too, couldn’t it?) I do hope you read Romans 9, 10 and 11 again. Shalom. Justme \\nIn this war, sorry but just a thought i heard someone say, this is a good one for atheists who believe in evolution. If apes evolved into man, when was the last time they saw one evolving? Kent Harris \\nPulpits need to face persecution along with it’s congregants. How does sacrifice make the church better? It removes pretense and creates genuinous in the faith. When you say I risk it all, ultimately one’s faith becomes stronger. The Bible overflows with that very virtue. Be strong, be courageous for the Lord your God is with you. iris \\nAmen! michael malachi \\nPretribulation believers, I guess that you missed your rapture, because the tribulation is here. You may want to deny it, but there are many around the world who are living tribulation today. You may say that tribulation has not begun, but tell that to the families of those who die as martyrs every day. You better be 100% committed, for you ever know when your time will come. iris \\nI think many Christians are waking up to the probability of a mid or end trib rapture now. Suddenly, many well known evangelistic speakers and authors are now citing as tied into the tribulation period; the magnitude and severity of world wide economic crises, famine, death of great quantities of ocean fish, increasing seismic events of 6.0+, newly discovered diseases, violence and persecution of believers, (especially currently seen with IS), etc. I even think it possible that the 3.5 years could be a symbolic, rather than literal number. What if they stand for decades? More Christians have died for the name of Jesus in the last 30 years than in the last 2000 years combined. I don’t want to go outside of Scripture, but I also don’t want to assume that some doctrinal position has to be the correct interpretation, simply because it’s popular or current. SantosGarcia \\nPlease prayerfully consider with your Bible in hand, my “Last Days Series”… in 4 Parts; beginning with: https://zionsgate.wordpress.com/2011/10/16/the-day-of-christ-and-the-day-of-the-lord/ chriscas \\nThis sadly informative column should be sent to all those who say the Consecration of Russia to the Immaculate Heart of Mary has been done as our Lord wanted Sister Lucy, one of the Fatima visionaries denied it has been done properly. And Francis is more concerned about climate change so it won’t be done under his pontificate. Coming up next: the Annihilation of Nations!! JackerRaabit \\nMmmm. \\nShould, say, the SDA be allowed in Russia? What about ‘churches’ where ‘God’ is a woman? ‘Jesus’ is a Black Lives Matter activist? What about the never-to-be-sufficiently-accursed Catholic Church? \\nAmerica’s so called ‘freedom of religion’ is flawed: atheists and non-Christians (where a Christian must read only the KJV, or the Textus Receptus Hebrew/Greek) should have been relegated to 2nd-class citizen status, and stripped of both 1st and 2nd amendment rights (just to start with). \\nThe alternative is America of today, a place where MOST ‘Christians’ will never see Heaven, and where the USA (as per its governmental and legal ACTIONS) has become the Left Hand of Satan on earth. \\nSo do lets wait and see: maybe Putin is simply… sane. GV JackerRaabit \\nSays a Satanist. \\nIn the grand scale of things, even if you were correct about me, you are far worse than that. \\nBurn in Hell, filth. \\nF you with a rusty chainsaw, p.o.s. JackerRaabit \\nI just love the way you poked holes in what I said, using sound reason… oh wait, the super-low IQ that made you a Satanist in the first place, precludes reasoning about anything, ever. GV \\nr ght, anyone who doesn’t agree with WhackerRaabit’s st pidity is a satanist JackerRaabit \\nSays the little retarded Satanist who can’t read or think too good. \\nDon’t you have to go breed with your cousin, little Muslim? Shoo. GV \\nSays the little retarded fascist who can’t read or think too well. \\nDon’t you have to go breed with your sister, little WackerRaabit? Shoo. JackerRaabit \\nCan’t even think up your own insults: pathetic. GV \\na , WhackerRaabit upset I used his own insult against him. \\nwell, you’ll get over it. \\nnow run along little WhackerRaabit and go play in traffic JackerRaabit \\nWow. You did it again. You really are a pathetic little tard. GV \\n“…He is rapidly going towards becoming Russia’s Kim Jun Un….” \\nbought into that neo-con BS, eh Julian Williams \\nI am confused. Russia standing up for authentic, historical Christianity, is some how a persecution of Christianity? Does not make sense. GV \\n“…Putin…is planning to nuke and EMP the USA….” \\nuh, no, American neo-cons want to have a nuclear first strike against Russia'"}, "time": 1742563707.9109519}