{"duration": 0.18396282196044922, "input_args": {"text": "'by Bill Holter, JS Mineset : \\nHere we are again, just six days away from a major COMEX gold (and silver) delivery month with a huge outsized amount of contracts outstanding versus deliverable inventory. For a background, COMEX holds 2,083,000 (nearly 65 tons) of registered gold. This amount is much higher than it was last December when it stood at a miniscule 152,000 ounces (4.7 tons). \\nSince May of this year, something has drastically changed in the monthly amounts delivered. For all of 2015, only 51 tons were delivered which amounted to about 4.25 tons per month. If you recall, many months would arrive at first notice day with a huge amount of contracts open, only to see the contracts evaporate before the close of the delivery period. I postulated then and still believe, contract holders were offered premiums to “just go away” and not take delivery. I cannot prove this but you must ask, why someone would FULLY FUND their account to take delivery and then not follow through. It makes no sense other than if they were enticed not to take delivery after placing the full amount of funds in their accounts to settle delivery. \\nSo far this year, 191 tons have stood for delivery, 168 of those tons since May. The average delivery since May has been over 24 tons per month with only two of the seven months being a traditional delivery month. June and August amounted to nearly 93 tons alone. The change since May has been astonishing. Rather than contracts being “bled down” each month (enticed by premiums offered?), nearly every single month has had more standing by the end of the month than were at the beginning of the month (nearly double in some cases). Another big change is, previously, the bulk of deliveries would be withheld until just before the end of the delivery period. Now, massive deliveries are being made on the 2nd, 3rd and 4th delivery days of the month. Please remember, it makes no sense to “wait” to make a delivery as storage fees add up for each day …it seems to me that it is now known that many contract owners cannot be enticed with premiums! \\nSo why has this begun to happen, why are more contracts demanding delivery and why are they jumping queue and opening more contracts during expiration? I believe it is simply because there is either a greater “need or desire” for gold. If I had to guess, I believe the new and different demand is in large part a function of the Shanghai Gold Exchange opening in September. Immediately after opening, we saw close to $4 premiums for gold (versus COMEX and LBMA pricing) and around .50 cent premiums for silver. These premiums are now recently much higher! For the last few weeks these premiums have grown to the $10-$12 range for gold and over $1 for silver. The premiums shot up on Monday to $20.33 for gold and $1.35 for silver. This is obviously more than generous enough to allow massive arbitrage to occur. \\nAs a side note, I have been asked why we are not seeing arbitrage en masse? Simply put, I believe there is a great risk here where you sell something for delivery without knowing positively you will be delivered on the buy side. Should the game end, an arbitrager might be contracted to deliver something (sell side) they cannot attain in a runaway upside market (because of the failure to deliver on the buy side). Curious that these large premiums exist as they should never exist …unless the players do see risk in a supposedly risk free trade! The premiums are now getting to large to ignore and look more like the elephant in the room. \\nSo where are we now for December expiration? Currently with only six trading days left before FND (first notice day), 217,000 contracts representing 21.7 million ounces versus 2.08 million registered to deliver. At the very same day last year, there were only 133,000 contracts outstanding or a difference of 84,000 contracts (8.4 million ounces). \\nWhile we certainly cannot say the COMEX will default and not be able to deliver for December, we can say the numbers are much larger …AND so is the pressure (via arbitrage)! To again put this in perspective for you, the entire registered category holds well less than $2.5 billion worth of gold. I would ask you this, “how many $2.5 billion events have occurred”? The answer of course is too many to count and they happen every single day in many markets, and all over the world. The spread in silver is getting close to a 10% number, how long will the spread be allowed? The problem of course is this, when the arbs do come in to close the gap it will create buying. The buying will require delivery as the sell side in Shanghai will demand metal for their purchase. This poses the problem, COMEX inventories cannot meet Chinese demand. \\nTo finish, please keep in mind that the global credit markets are now experiencing extreme liquidity tightness. Previous “credit events” were ugly and all ended the same way …with more debt and more currency units issued. As we have seen in India, as gold has not been available since their recent kamikaze currency move, gold was changing hands at $2,900 per ounce on Friday and $3,600 over the weekend due to lack of supply. Ask yourself, at what dollar price will gold be available should someone (or collectively) put up $2.5 billion to clean out COMEX? Yes I know, COMEX is not the only market in the world. But a run on COMEX will be a run everywhere and will result in finding available gold nowhere. A “run” can start for any number of reasons. It can be “intentional” or not. The problem from a visual standpoint is this, the amount of physical gold behind the paper gold edifice is like a “BB” in relation to the financial Earth. If you don’t believe the global debt can ever be paid back in current currency values …dig into this one as it’s even more lopsided, paper gold can never be delivered by the real thing as the real gold simply does not exist! \\nThat will do it for this holiday week as I plan to take a little time off. Unless something really big breaks, Jim and I do not plan on our weekly interview and will resume next week. We wish you and your families a Happy Thanksgiving!'"}, "time": 1742562929.9816663}