{"duration": 1.7242836952209473, "input_args": {"text": "'FAIR BLUFF, N. C.  —   Under a clear twilight sky, well after Hurricane Matthew broke up and moved offshore, this tiny town was drowning. Homes were submerged and deserted after officials evacuated about 400 people by boat and by truck, and Main Street was a canal of   water. Frank Horne, 79, drove a large tractor slowly through the water inundating the lovingly maintained main drag. Most of the awnings and street lamps were eerily intact, even as merchandise and storm debris floated through businesses like the Ellis Meares  Son hardware store and community pillars like the town hall. At the Ford dealership, every vehicle was partly underwater. “My granddaughter has a beauty shop right up on the right,” Mr. Horne said grimly on Monday, pointing toward Carolina Class Salon. “If that hardware store goes, the town’s gone. That’s the only thing holding us. ” Hurricane Matthew’s disastrous turn over North Carolina lashed some areas with more than a foot of rain and left behind swelling rivers and streets like rivers throughout much of the region south and east of Raleigh. By Tuesday, emergency crews in trucks, boats and helicopters had rescued more than 2, 000 people from houses, porches and rooftops. Here in Fair Bluff, they included James Thomas, 57, who cannot walk because of a spinal cord injury, but was hoisted into a boat by firefighters on Sunday. The upheaval had a special sting here in a town that has tried, with no shortage of grit and heart, to remake itself in the face of economic shifts that have sucked the life out of so many other small towns. Now, Fair Bluff’s future looks even more challenging. The extent of the damage here and in places like Lumberton, Fayetteville, Goldsboro and Pinetops sank in like a recurring bad dream on Tuesday after a storm that killed 17 people in the state and left commerce and daily life in some areas grinding to a halt. “Certain parts of the state, we’re going through recovery at this point in time,” Gov. Pat McCrory said on Tuesday morning. “Certain parts of the state, we’re still going through ongoing floods. And now, we have other parts of the state that are about to deal with some very serious circumstances, especially along two of our major rivers. ” Mr. McCrory said that a state trooper had shot and killed a man on Monday after a “confrontation”  —   the authorities later said he had become “hostile” and displayed a handgun  —   in Lumberton, a site of major flooding north of here. He added that state officials were especially worried about residents farther northeast, in and near Goldsboro, Greenville and Rocky Mount. With flooding expected in the state throughout the week, he urged drivers to use caution. “There are going to be conditions during the next 72 hours which will be extremely dangerous,” Mr. McCrory said. As residents evacuated and the authorities imposed curfews, officials issued advisories to boil tap water for drinking and school districts canceled days of classes. The airport in Greenville, a city of about 91, 000, will be closed until Oct. 20. “A lot of communities are dealing with terrible flooding,” President Obama said on Tuesday night in Greensboro, where he addressed a campaign rally for Hillary Clinton. “Lives have been lost, and so the entire country has been thinking about North Carolina. ” The flooding this month has evoked memories of Hurricane Floyd, which devastated parts of the state 17 years ago. “The scars of the memories of 1999 are still there, and they’re fresh,” said Tony Sears, the city manager in Kinston, where the Neuse River is expected to approach a record height by Saturday. “And people are thinking back to how difficult of a time that was, and they’re anticipating that this time. ” In Fair Bluff, with a population of about 900, officials said the water rose further on Tuesday, to levels no one here had seen. The town has a poverty rate of 33 percent, and its population has decreased over time, with older residents dying off and the young moving away. Some in the area wondered if all of the flooded businesses, most operated by longtime residents, would reopen. “Because it’s so small, income levels are so low here, it’s going to be hard for them to justify putting the money back in to reopen their businesses,” said Brenden Jones, a candidate for state representative from nearby Tabor City and an owner of a funeral home in Fair Bluff that was spared from flood damage. Fair Bluff was incorporated in 1873, with the Lumber River  —   currently inundating the town  —   and a railroad as its lifeblood, supporting logging and trade. By the 1970s, it was small but thriving, sustained by tobacco farms and warehouses, said Ken Elliot, 48, who like many people here grew up in a tobacco farming family. When those tobacco farms began to go under, people found new work. Mr. Elliot became a firefighter and paramedic, and he spent last weekend rescuing his friends and neighbors from the encroaching floodwaters. Others found work in a new plant that makes vinyl building materials. The town, which has a museum, built a visitors’ center and a new river walk, earnestly seeking tourists. And locals fought tooth and nail to sustain a vital Main Street as the town’s heart despite pressure from stores like Walmart and Family Dollar. “That’s what keeps this area above water,” Mr. Elliot said, adding that the town would pull together once again. Would everything reopen? “I’m not going to lie,” Mr. Elliot said. “That’s always a worry. ” Others were confident the town would prevail. Kathy Ashley, 55, the vice president of the Chamber of Commerce and Mr. Horne’s daughter, said that Fair Bluff was a   trading post and had shown a penchant for reinvention ever since. “We got history,” Ms. Ashley said. “When the water goes away, we’re going to sweep it out and we’re going to make our town better. ” Critical to the floods’ devastation was how surprising they were: Many people did not expect Hurricane Matthew to drop nearly as much rain as it did, and they prepared only for a small storm. “This is a river town,” said Rodney Singletary, 47, a behavior specialist at the county school who took a boat back to his house on Monday to pick up medication for a relative. “We’re used to the river. We just don’t think that it’s going to look like that. ” His family had evacuated on foot over the weekend, walking along the railroad tracks as water rose on both sides. “We had to get out of here,” he said. “I have to say, I was a little frightened. ” At a shelter at West Columbus High School in a neighboring town, Cerro Gordo, Fair Bluff residents described harrowing rescues and domestic crises. Twyla Denise King, 44, worried about the five dogs she had left at home in the evacuation. And Simon Stephens, 33, who called for a rescue of himself, his wife and his two children when the waters rose because he cannot swim, wondered what had become of his house and two cars. “Words cannot describe it,” said Mr. Stephens, a fabricator. “House paid for, cars, one car paid for, only $800 left on the truck. ” So when it was time for a shelterwide meeting, Tom Guilliams of the Salvation Army opened with a prayer. “We thank you for getting us out of the waters and onto the land,” he said. “Be with us through the storm. ”'"}, "time": 1742564311.0860367}