{"duration": 0.0592041015625, "input_args": {"text": "'President Donald Trump has scheduled five calls to world leaders on Saturday, and has completed most. Among the most anticipated was his conversation with Russian President Vladimir Putin, which occurred at noon today. [The call between Trump and Putin was the first of its kind regarding policy, and reportedly lasted around 30 minutes. The two had spoken on the phone most recently in November, when Putin called to congratulate Trump on winning the presidential election.  During the call, White House Press Secretary Sean Spicer posted a photo of the Oval Office on Twitter, showing the President engaging Putin while surrounded by senior staffers: National Security Adviser Michael Flynn, Chief of Staff Reince Priebus, Chief Strategist and Senior Counselor Stephen K. Bannon, and Vice President Mike Pence. After speaking with Chancellor Merkel for 45 minutes @POTUS is now onto his 3rd of 5 head of government calls, speaking w Russian Pres Putin pic. twitter.   —   Sean Spicer (@PressSec) January 28, 2017,  Neither the White House nor the Kremlin have released details regarding the contents of the call at press time. Kremlin spokesman Dmitry Peskov answered questions regarding the scheduled call on Friday, however, lowering expectations for any major policy breakthroughs. “One can hardly expect substantive contacts on the entire range of affairs from this call  …     Let us wait and see, let us be patient,” he told reporters in Moscow. Peskov added that Russia and the United States had yet to establish official contacts in the new Trump era, but that “routine diplomatic work is underway” to ensure proper communications. In addition to the phone call following November’s election, Putin sent President Trump a letter in December wishing him a merry Christmas and happy holiday season, which Trump described as a “very nice Christmas letter” and thanked Putin for. While Putin’s relations with the Obama White House were notoriously strained  —   though Putin greatly expanded the diplomatic influence of Russia during President Obama’s tenure, particularly in the Middle East  —   Putin has appeared publicly favorable to establishing positive relations with the Trump administration. Following President Obama’s announcement of new sanctions on Russia in December, shortly before Trump took office, Putin said in a statement he would not retaliate, calling President Obama’s actions “regrettable” and implying he would wait for Trump to assume the presidency before evaluating how bilateral relations should go forward. Putin also came to Trump’s defense following the publication of unverified documents by the entertainment website Buzzfeed, which claimed Trump had engaged in inappropriate behavior while in Russia. Putin called those giving publicity to the documents “worse than prostitutes” and stated that, while he did not believe that Trump had requested the services of “loose women” while in Moscow, “ours are undoubtedly the best in the world. ” Putin also appeared unintimidated by President Trump’s call for the refurbishing of America’s nuclear arsenal, stating that there was “nothing unusual” about the President wanting to maintain the quality of the U. S. military. Prior to speaking to Putin, Trump held conversations with German Chancellor Angela Merkel, Australian Prime Minister Malcolm Turnbull, and Japanese Prime Minister Shinzo Abe. Abe is scheduled to visit the White House on February 10.'"}, "time": 1742564306.1938734}