{"duration": 0.014030694961547852, "input_args": {"text": "'What Happens If Trump LOSES The Election? What This Means For America! by IWB · October 27, 2016 \\nAre the elite foreshadowing the future of America?! \\nIt seems so. \\nAll throughout the month of October, mainstream media has made cryptic statements, scenarios, and outcomes regarding what America could look like if Donald Trump loses the presidential race. \\nIn an article from The Boston Globe, one scenario includes a potential American uprising. During the presidential debates and campaigns, Mr. Trump has alleged the election as being “rigged,” in favor of Hillary Clinton. According to a Bloomberg News poll, 56% of Trump backers believe the election will be ‘‘rigged”… even though the “election” is really a SELECTION. \\nHowever, The Washington Times has also questioned the same thing: Will there be some type of uprising, civil unrest, or some other triggered outcome if Donald Trump were to “lose” the elections? \\nIt’s also very cryptic to note how former Republican Joe Walsh made this interesting Twitter statement as of October 26th, 2016: “If Trump loses, I’m grabbing my musket.” \\nThen there’s the “Russian threat,” which is constantly making its way into mainstream news. According to Western sources, Vladimir Zhirinovsky, who is an ally of Vladimir Putin, has warned Americans to “vote trump or face nuclear war” — claiming that the Republican candidate is the only person who can prevent an escalation in tensions between Moscow and Washington. He has also said that: “The only way they can get worse is if a war starts.” \\nAnd while the American government continues to constantly blame Russia for alleged cyberthreats, cyberattacks, and election hacks — we know this is all propaganda in preparation for world war. \\nDo The Elite Know Something We DON’T?!?! \\nLEARN MORE!'"}, "time": 1742628490.1262088}