{"duration": 0.1562659740447998, "input_args": {"text": "'DALLAS  —   When Andre Stubblefield leaves his dilapidated apartment complex in southern Dallas, he always carries his work gloves, vest and hard hat, even when he is not going to work. The police have stopped him regularly over the years, asking for identification  —   about four times in the last four months alone. So he carries his work attire to show that he is a working man, not a criminal. “I got to fake like I’m wearing my work stuff, so they won’t mess with me,” said Mr. Stubblefield, 30, who works in demolition. In the wake of last week’s sniper shooting that left five Dallas police officers dead, many people have lamented that it happened in this city, with a black police chief who even critics say has made inroads with the community and worked to steer his force away from its history of racism and abuse. Since Chief David O. Brown took over the department in 2010,   complaints have dropped 64 percent, and he has started   training and a successful community policing program. But for all the progress that the Dallas police have made, this remains one of the most segregated big cities in the country, with yawning racial gaps in housing, schools and employment. Decades of discriminatory federal, state and local policies have concentrated the city’s black population in deeply poor and underdeveloped neighborhoods south of Interstate 30, which serves as a line of demarcation between opportunity and neglect. While downtown Dallas is flush with glassy skyscrapers and   restaurants, large tracts of the city’s southern sector are empty and ragged. “People look at the Black Lives Matter movement as people protesting against police brutality,” said Terry Flowers, the executive director and headmaster of St. Philip’s School and Community Center in South Dallas. “I think it is much larger than that. People are protesting against a social engineering of inequity. In the broader community here, there is tension. You get pulled over by a police officer, there is automatic tension. ” So while the Dallas Police Department has gained national acclaim, the extent to which these reforms have changed how black residents view the police, and the extent to which they have altered the way the city’s most marginalized residents interact with the police, depend largely on whom you ask. A 2014 survey by the   Embrey Family Foundation found that while 67 percent of Dallas’s black residents believed that the city’s black men received “a lot” of discrimination, only 37 percent of white people thought the same. From his small brick home in a predominantly black,   part of Oak Cliff in southern Dallas, Yafeuh Balogun, 32, said that    complaints might be down in Dallas, but that police harassment of community members and police killings of unarmed citizens had not gone away under Chief Brown. That is why Mr. Balogun helped found the Huey P. Newton Gun Club in 2014. The group is named for the Black Panther who advocated armed   and its members go on patrols with rifles on their backs in an effort to watch the police and to reduce their presence by guarding their own neighborhoods against crime. The club was created after a Dallas police officer killed an unarmed black man in an Oak Cliff apartment complex and injured a child with a stray bullet. Chief Brown defended the officer, who was not disciplined. Perched at a computer in his home and wearing camouflage pants, Mr. Balogun said he and other activists had already fought for the release of data on use of force, petitioned City Hall to overhaul a   process that has failed to hold police officers accountable for fatal shootings, and protested what they perceived as police brutality. “We found out those actions were not enough,” Mr. Balogun said. So, they decided to pick up guns. Armed   he said, is a more    means of resisting police brutality. Mr. Balogun’s group is part of a constellation of militant black nationalist groups in Dallas, birthplace of the New Black Panther Party, born out of a legacy of police brutality stretching back at least 40 years. The most infamous case was the 1973 death of a    Latino boy, Santos Rodriguez, after an officer who believed he had stolen money from a vending machine killed the handcuffed child in a game of Russian roulette. The officer served just two and a half years. Members of the black nationalist groups sometimes find their way into   Connection, an Afrocentric store where the owner, Akwete Tyehimba, said she tried to direct their “energy to the more positive areas. ” Her store, which sells items like books, Bobo masks and Kuba cloths, promotes the “unification of African people around the world,” she said, and disavows violence. One young man who wandered into her store during a Malcolm X celebration in May was Micah Johnson, the sniper in last week’s fatal shootings, she said. Mr. Johnson showed no signs of militancy, she said. Instead, he was enamored of the store’s collection, as though “he was maybe coming into some level of   of his culture,” Ms. Tyehimba said. “He was very warm,” she added. “He said he had never seen anything like this before. ” Mr. Balogun met Mr. Johnson briefly in the months before the shooting. He said that Mr. Johnson did not mention his plan, but that the videos of officers killing Alton Sterling and Philando Castile and that frustration over the lack of police accountability had probably led to his killing rampage. Activists from the group Mothers Against Police Brutality were among the protesters on Thursday when Mr. Johnson began shooting. They said the crowd was protesting national events, but also homegrown police killings. Collette Flanagan, 53, helped found the group after the Dallas police killed her son, Clinton Allen, who was unarmed, in 2013. The officer who fired his weapon said that Mr. Allen had been choking him, and he was not charged criminally. Ms. Flanagan has not been impressed by Chief Brown’s supposed efforts at transparency. She pointed to an April department newsletter in which Chief Brown cited pressure from the Justice Department for police agencies to release    data as the reasoning behind the department’s publishing the information. “By doing it on our own terms, we can release this information in our own format, which allows us to tell our story,” he wrote. That has led to data that is not as transparent as it seems, activists argue. For example, Ms. Flanagan’s son is listed as an armed suspect in the police shootings data. His weapon? His hands. “Clinton wasn’t a martial arts expert or a professional boxer,” Ms. Flanagan said. “Yet all of their investigations find in favor of the officer. ” But from the small living room of a home in a tidy   subdivision of Oak Cliff, a few minutes’ drive from Mr. Balogun, the view of the police under Chief Brown looked decidedly different. With the smell of Sunday’s dinner  —   collard greens, pulled pork and baked mac and cheese  —   wafting from the kitchen, Carol Hampton and her group of friends discussed the positive impacts of Chief Brown’s reforms. “Community policing is working,” Ms. Hampton said. The friends, all of them black, had been appalled by the deaths of Mr. Sterling and Mr. Castile, but did not believe policing was a problem in Dallas anymore. “I don’t think we have those issues,” Kevin Walker, 48, said. “I think about harsh policing in Louisiana, and people getting stopped 20 times a month. I don’t hear about that kind of harassment here. ” Yet all five people in the living room who had sons said they would still give them “the talk” about how to react if stopped by the police. Hilari Younger, 35, the youngest adult there, was the only one among them who had attended the protest last week. “My neighborhood is very hostile to the police,” Ms. Younger said. “The police look for every little reason to stop you. ” Quaneque McCarver, 23, learned that the hard way. A couple of years ago, she said, the police mistook her for a prostitute and briefly cuffed her and made her sit on the ground while she was pregnant. Still, that has not changed her attitude toward the police in general, she said. “I wasn’t hurt,” she said. “They let me out of my handcuffs, and they let me go about my business. ” The police have also helped her in the past. So the shooting angers her, she said, because she believes it will only stoke tensions between the police and black communities. Mr. Stubblefield, too, was upset about the shooting, saying it would only worsen a bad situation for black men like himself. About three years ago, he said, he worked for a party rental company and set up a bouncy house for a children’s party in a predominantly white part of Dallas. As he used his phone to take video of the house for his boss to make sure they had set it up correctly, the police rolled up. Someone had complained, they said, that he was taking pictures of people without their permission. So they pulled him to the side and made him sit on the ground with his hands behind his back. “It made me feel like, that’s embarrassing,” he said. “Kids coming with their parents, looking, whispering. ”'"}, "time": 1742563725.352553}