{"duration": 0.09020638465881348, "input_args": {"text": "'NEO – RT’s Bank Accounts Closed – It’s Nothing to Do With Syria ‹ › Ian Greenhalgh is a photographer and historian with a particular interest in military history and the real causes of conflicts. His studies in history and background in the media industry have given him a keen insight into the use of mass media as a creator of conflict in the modern world. His favored areas of study include state sponsored terrorism, media manufactured reality and the role of intelligence services in manipulation of populations and the perception of events. Israel makes ‘Hail Mary’ move to influence US election – FBI commit treason? By Ian Greenhalgh on October 28, 2016 According to New York Times, federal officials discovered new emails in a separate review of the former NY Jewish congressman Huma Abedin and Anthony Weiner in happier times [Editor’s note: As Gordon wrote yesterday, in his coverage of the Alex Jones attempt to boost Trump’s shattered credibility, Israel and the Zionist cabal are getting desperate, time is running out for them to influence the election in favour of their candidate. We have been expecting some kind of ‘October Surprise’ to happen, some kind of attempt to fatally undermine the Clinton campaign just as they did in 1979 to Jimmy Carter, a move that allowed them to get their candidate, Ronald Reagan, into office and we all know what that lead to – incredible damage to the US in so many ways. Reagan destroyed the credibility of the US on the world stage, he hugely increased military budgets, rigged the system in favour of the banks and big corporations, destroyed the economy, waged war on behalf of the cabal, overall he was a disaster for the US and it’s people. However, Reagan was just an actor playing a role, a puppet for the Zionist crime cabal, put in power by their intrigues and it was Roy Cohn who was behind it all, he was the enabler, the man who made it all happen. Today, the same thing is happening again, Cohn is long gone, but the Judeo-Zionist mafia – the ‘Kosher Nostra’ is still alive and well and they are attempting to repeat the same tricks that got their man Reagan into the White House. Do not forget for one second that Donald Trump was created by Roy Cohn and like Reagan, Trump is just an actor playing a role; he is not a billionaire successful businessman, he just plays one on TV. He is not at all a massively wealthy man, his main source of income is NBC and his reality TV show; he does of course, have assets, but how many of those does he really own? In most cases he is just the front man, the real owners of his assets being silent partners who are invariably, members of the Kosher Nostra. We have watched in disgust as Israel, via their Mossad disinfo operation Wikileaks have released more and more emails taken from Hilary’s email server. Invariably these emails have been modified, ‘sexed up’ in order to make Hilary look bad, all in an attempt to influence the US election in favour of Trump. As we have written several times already, there are no white hat hackers passing this info to Wikileaks, rather, the NSA has been monitoring all communications, passing the raw data to Tel-Aviv where the Mossad have filtered and vetted it in order to find anything they can use against Hilary, always with something added to make them seem more damning. This makes the NSA guilty of treason, they are aiding and abetting a hostile foreign power in it’s attempts to exert a nefarious influence over US politics. Today, with this new set of emails, the FBI has joined them in committing treason; make no mistake, the timing and nature of this latest ‘revelation’ is a most cynical attempt to swing things in favour of Trump and in announcing this investigation with just 10 days to go until polling day, the FBI have acted on behalf of Israel. The reason Hilary was using a private server in the first place was to attempt to keep her important communications away from the prying eyes of the Israelis, an act which shows that her loyalty is to the US and it’s people rather than to Israel, this sets her apart from the majority in Washington and brings her into the crosshairs of the Zionist cabal. It remains to be seen what the result of this new FBI email investigation will be, but I cannot escape the uncomfortable feeling that the Zionists have played a Hail Mary and may just score a touchdown that lands Trump in office and condemns the US and it’s people to even worse Zionist oppression than ever before. A truly frightening scenario. Ian]'"}, "time": 1742563643.7796786}