{"duration": 0.05935931205749512, "input_args": {"text": "'Trump Mistakes Ex-Marine Black Supporter For Protester, Calls Him A ‘Thug’ (TWEET/VIDEO) ‹ › Trump Says Alec Baldwin’s Impression Of Him Is Unfair: ‘He’s Portraying Someone Mean And Nasty’ (VIDEO) By Andrew Bradford on October 29, 2016 Subscribe \\nDonald Trump doesn’t have a sense of humor. While he may smile from time to time, it always seems forced, as if he’s afraid his face will crack if he smiles too broadly. And now he’s whining yet again about Alec Baldwin’s brilliant portrayal of him on Saturday Night Live. \\nAs part of an interview with AJ Calloway of Extra , Trump had this to say about the way Baldwin plays him: “Well, I think I’m a much nicer guy than he’s portraying. He’s portraying someone who’s very mean and nasty, and I’m not mean and nasty. I think I’m a much nicer person than he’s portraying, so I think it’s an inaccurate portrayal of me.” \\nClearly, in addition to Trump not having a sense of humor, he also is deficient in the self-awareness department. \\nWould the Donald ever do SNL again? Not a chance, he declared: “They want me to go back. No, I’m not interested in going back…They’re making me out to be a very mean, bad kind of a guy and that’s not me.” \\nTrump was also asked about the fact that NBC had fired Billy Bush due to the leaked videotape in which Trump said he likes to grab women “by the pussy” and kiss them against their will. The GOP nominee cryptically responded that “they did it to him,” but would not elaborate on who “they” might be. He then added : “I have always liked Billy, but I have not [spoken to him]…but I always found Billy to be a good guy.” \\nYeah, a good guy who laughed when you brazenly talked about how you get off on sexually assaulting women because you happen to be wealthy and famous. \\nFace it, Donald, you’re a pig. And to make matters worse, you can’t even laugh at yourself. \\nFeatured Image Via Screengrab About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect'"}, "time": 1742562049.85957}