{"duration": 0.1593644618988037, "input_args": {"text": "'For the past few months, the sports media has been embroiled in a fight over “stick to sports. ” The phrase comes from a common online rebuke directed at sportswriters and pundits and players and coaches and anyone in the world of sports, really, who takes a political stance on anything that doesn’t occur on a field or a court or in a locker room or front office. The dividing line is predictable: Many jocks and traditionalists argue for a separation of church and state many young fans say that sports, just like everything else, is politics. But as the sports media critic Bryan Curtis has pointed out in The Ringer, the debate is mostly moot now: Trump’s presidency, with its daily explosions, has made it impossible to cover pro sports, even in the simplest   ways, without detouring onto the White House lawn. This comes, in part, from the way basic sports coverage works. Reporters ask questions before and after every game, and when the only thing anyone wants to talk about is Trump, some of those questions will be about the president. In the past, a paradoxical yet symbiotic relationship generally characterized whatever relationship existed between sports and politics. The big American leagues, especially the N. F. L. and Major League Baseball, gave every indication of wanting to distance themselves from partisan frictions. They typically prefer to honor troops, fly fighter jets over stadiums and hold moments of silence to honor the victims of tragedies. When they tackle overtly political issues, it’s through selective editing and legacy building. The settled politics of the past, where details can be kept few and the tone nostalgic, are fine. We know, for example, that Jackie Robinson broke baseball’s color line, stole home and wore 42 on his back. Muhammad Ali championed equality and said some funny stuff to Howard Cosell. Billie Jean King beat Bobby Riggs. Their lionization reassures us that the stands they took were good  —   and can now be consigned to bygone eras. But the latest intrusion of political talk into sports  —   whether you deem it excessive or welcome  —   has had a drastic effect on coverage. It has brought with it a currency and immediacy that we haven’t seen since the ’60s and early ’70s, when athletes like Jim Brown, Kareem   and Curt Flood openly talked about civil rights. The day the White House declared its immigration and travel ban in January, the Milwaukee Bucks played the Toronto Raptors in Canada, and there was some concern that the Bucks’ rookie center, Thon Maker, would not be let back into the United States after the game: Maker is a citizen of Australia, but his family emigrated there from Sudan. The day after the game, Alex Lasry, a Bucks executive and the son of one of the team’s owners, tweeted: “I appreciate all the fans’ concerns and prayers for Thon. And today a Sudanese refugee who fled oppression and is an incredible young man will make his second N. B. A. start. I’m incredibly excited and proud of him. He’s a symbol of what makes America great and all immigrants believe about America. ” Maker was directly affected by Trump’s policies (though he   the United States without problem) and his teammates, fellow players and coaches in the N. B. A. publicized their support. This was not surprising, given the N. B. A. ’s wealth of international players and its cosmopolitan fan base in recent years, the league has encouraged its stars to speak out on matters important to them. More unexpected was the Super Bowl’s inability to avoid the fray. During this year’s   media day, usually a hollow parading of the players before the microphones and cameras, Tom Brady’s continued refusal to talk about his presidential friend was big news. Brady had been ignoring these questions for almost a year and a half now, ever since reporters saw a red “Make America Great Again” hat in his locker, but he finally gave in. All he could muster was: “What’s going on in the world? I haven’t paid much attention. I’m just a positive person. ” Brady’s   elisions were hardly surprising  —   he, perhaps more than any athlete since Tiger Woods, has doggedly confronted us with his right to never publicly say anything interesting to anyone. But the fact that his act hasn’t quite kept the inquisitors at bay suggests that the days of Woods, Derek Jeter and Michael Jordan just grinning through any edgy conversation are over, at least for now. Athletes, especially famous ones, are less likely to be left to stand alone as ciphers of sporting excellence. Their images will be shaded by their politics, even if these have to be assigned to them. And as players continue to be asked about their political beliefs by reporters  —   especially as the international players in basketball and baseball are prompted to talk about immigration  —   they have an opportunity to give voice to resistance. If they want a model, they should look toward the W. N. B. A. whose players have been exemplifying thoughtful political expression. Last summer, the W. N. B. A. fined several players for wearing black   in support of Black Lives Matter at pregame practices following the next game after the fine was announced, some players refused to discuss basketball, instead using the postgame news conference to talk about police shootings. (The W. N. B. A. rescinded the fines soon after.) Last month, Breanna Stewart, the league’s reigning Rookie of the Year, attended the airport protest at LAX. Stephen Curry, arguably the world’s most popular basketball player, may be following the W. N. B. A. lead. After the chief executive of Under Armour recently referred to Trump as a “great asset” for the country, Curry, whose endorsement deal with the company runs through 2024, said, “There is no amount of money, there is no platform I wouldn’t jump off, if it wasn’t in line with who I am. ” Perhaps more than any other N. B. A. star lately, Curry has tended to project a charming blandness, but in putting his sponsorships and money at risk  —   however improbable the prospect of his losing any  —   he went further than most outspoken athletes. In the week following the Super Bowl, at least six Patriots players  —   including Martellus Bennett and Devin McCourty, who earlier in the season raised fists in solidarity with Colin Kaepernick’s   protest  —   said they would not make the traditional victory visit to the White House. (Brady went to Washington after his first three championships, when George W. Bush was president, but skipped the fourth trip during the Obama presidency.) “I was a black man yesterday, and I’m going to be a black man tomorrow,” Bennett tweeted in response to the predictable storm his announcement kicked up from the “stick to sports” crowd. “My wife and daughter are women today and will be women tomorrow. ” The Patriots absent from the White House photo op will be the most conspicuous part of what usually is a goofy, perfunctory moment in the N. F. L. ’s   and reporters will reach out to them for comment, which will provide another occasion for criticism. Those athletes who do speak out might find a curiously receptive ear in the White House. Let’s remember that Trump, perhaps even more than his   predecessor, is a sports fan. He owned a team in the United States Football League (while almost   running the league into the ground) he hosted fights at his Atlantic City casinos he tried to buy the Buffalo Bills he brags about his friendship with Brady. Above all, he has shown a crippling sensitivity to the opinions of his fellow celebrities. Professional sports usually provides a poor, inaccurate reflection of politics, but sometimes elements of that imagery  —   the machismo, the posturing, the adoration of stars  —   align exactly. Jocks, if nothing else, know how to get the president’s attention.'"}, "time": 1742564375.551675}