{"duration": 0.6441164016723633, "input_args": {"text": "'Every week or so during the spring, I met with Reince Priebus, the chairman of the Republican National Committee, at the party headquarters on Capitol Hill. We fell into a familiar routine. I would enter his office, usually chaperoned by Sean Spicer, the R. N. C. ’s chief strategist and head of communications. Priebus has a healthy appreciation for gallows humor, which is not a bad thing for an R. N. C. chairman these days. “I haven’t started pouring Baileys in my cereal yet,” he says often enough that it has become a signature line. I would regularly break the ice with something sarcastic, like asking Priebus how his party’s Hispanic outreach program was going on the morning after the committee’s head of Hispanic outreach resigned rather than work another day for Donald Trump’s election. “The scent of party unity is in the air,” I said in May when Paul Ryan reported that he was “not there yet” on supporting Trump. “No, that’s incense,” Priebus said, pointing out that he had been burning some behind his desk. As suits a man occupying what might be the toughest political job in America, Priebus does his best to stay availed of serene distractions. He plays jazz piano at home late at night and gazes into the   saltwater fish tank that he keeps next to his desk. “You see that big eel?” Priebus asked one day, pointing out a black slithery creature on the bottom, before noting others. “That’s a yellow tang, hippo tang, a spotted puffer. There’s an anemone. An urchin. An orange clown fish. ” He took a hunk of shrimp from a refrigerator and dangled it with a set of tongs into the water. A race to the bottom ensued as bits fell away and the fish vied for pieces of flesh. It was difficult to look away from the feeding frenzy. The big orange clown fish flailed at front and center. I asked Priebus if it reminded him of anyone. “That’s not funny,” he said with something between a slight grunt and chuckle. No matter how much Trump has roiled the Republican water, it remained Priebus’s job to carry it. The presumed Republican nominee appears on many days to be at open war with the party that is about to nominate him. The entire campaign, meanwhile, has been a proxy battle for the proverbial “soul of the party” that has been escalating between the G. O. P. ’s populist grass roots (captured by Trump) and “party leaders” (embodied by Priebus, the House speaker, Paul Ryan, and the Senate majority leader, Mitch McConnell). Is the G. O. P. now the “party of Trump”? Priebus bristles when people ask him this  —   or taunt him. I asked Priebus some variation on this question during each of my visits. “Donald Trump is Donald Trump,” Priebus says. “And the party is the party. ” “Priebus” is a German name, pronounced like the Toyota Prius with a “b” stuck in the middle. Reince (short for Reinhold, rhymes with “pints”) is 44 but has an  ’s vibe. He is often underslept, has the beginnings of jowls and tiny goose pimples clustered under his eyes like those on the belly of a toad. He speaks in the slow and slightly   manner of an adolescent whose parents are always hassling him about the nightmare house guest. The Trump issue, in other words. It’s never far from anything, and really, these days, what else is there? Plenty, Priebus kept trying to convince me. The Republican Party had its own distinct identity and principles and points of pride. It controls both chambers of Congress and holds more federal and statewide seats than at any time since 1900, he said. What keeps eluding Republicans is the White House. They have lost the popular vote in five of the last six national elections. “Cultural elections,” Priebus calls them  —   “the big ones. ” A chief reason for this is that many voters dismiss Republicans as being culturally and demographically stuck in 1900. It was Priebus who commissioned and endorsed the findings of the G. O. P. “autopsy” after Mitt Romney’s defeat in 2012. Formally christened as the “Growth and Opportunity Project,” the report warned that the G. O. P. was “increasingly marginalizing itself” to a point where it would be “increasingly difficult for Republicans to win another presidential election in the near future. ” That is, the report concluded, unless the party expanded its aging white base to include more immigrants, ethnic minorities and women, precisely the groups the next likely   has so splendidly repelled. Priebus refers to himself as a “party guy. ” He spent much of his youth in Kenosha, Wis. organizing pizza parties for Republican volunteers, putting up yard signs and listening to Newt Gingrich speeches on cassettes in his car  —     things. His first date with his future wife included a trip to a Republican Lincoln Day dinner, an evening sexed up by the presence of two Republican congressmen: James Sensenbrenner of Wisconsin and Henry Hyde of Illinois. Being a “party guy” can come off sounding a little   nerdy, like being a   guy. But Priebus speaks of this identity with sincere pride, and his allegiance is clear: to “the party,” not any one nominee. Still, our meetings sometimes took on the feel of therapy sessions, with Priebus playing the role of the betrayed spouse trying to convince me that his tormentor really could change. Trump would soon be “pivoting” into a more “presidential” mode, Priebus kept promising. But after a while it became clear that Trump’s outrages would continue unabated. Within the space of a few weeks, he suggested that Bill Clinton had committed rape and (along with Hillary) might have killed his former aide Vince Foster and that Ted Cruz’s father might have associated with Lee Harvey Oswald and that Mitt Romney walked like a penguin and. . .. Priebus pretty much stopped bothering with “presidential. ” On this particular day, cable news was    with stories: the surfacing of an audio tape of someone sounding a lot like Trump claiming to be a Trump “spokesman” the discovery of a Facebook post from Trump’s longtime butler calling for President Obama to be killed and news that the Trump campaign had selected a white nationalist leader to be a California delegate (the delegate wound up resigning). Priebus eventually pivoted to Trump’s supposed “authenticity. ” Yes, “authenticity” was a better word, more latitude. He settled on the idea that Trump was a “unique” candidate who had created a new standard for what a politician could say and get away with. “He’s carved out this idea that he’s this earthquake in a box,” Priebus says. Priebus was saying in effect that it would be possible to build a wall around Donald Trump and not have the G. O. P. pay for it. Trump did not define its values in the long term, even if he might temporarily defile them. “We’re the party of the ‘open door,’’u2009” Priebus told me, as he often does. Not big, beautiful walls. For a while this spring, it seemed possible to contain the earthquake. Trump showed flickering signs of “maturing” as a candidate, and Republicans seemed willing to “support the nominee,” if not endorse him. The “normalization” of Donald Trump became a media watchword, the idea that his daily affronts could be integrated into the routine paces of a quadrennial exercise. Formerly hostile primary opponents like Marco Rubio, Lindsey Graham, Bobby Jindal and Rick Perry all at various points said they would support Trump or were at least no longer (in Rubio’s case) deriding him as a “fraud,” “con man” and “lunatic” or (in Graham’s) a “  xenophobic, religious bigot” or (in Jindal’s) a “madman who must be stopped” or (in Perry’s) a “barking carnival act. ” I imagined Trump laughing at how easy it was to get Republicans to submit to him after he had savaged so many of them during the primaries. Actually there was no need to imagine because Trump was doing exactly that. “I’ve never seen people able to pivot like politicians,” he said at a rally in California in late May while boasting of his support from Perry. In an interview, I asked Trump if it was harder to flip politicians or the real estate people he has dealt with over the years. His smirk was audible over the phone. “Well, I’m not referring to any politicians in particular, but I’ve said many times that businesspeople are much tougher,” Trump said. “Politicians tend to be much more deceptive and deceiving and more willing to break a deal. But they are not as tough. ” Priebus, meanwhile, kept working the phones, trying to coax   Republicans back to the party line and persuade  —   beg  —   Trump to lay off the elected Republicans he kept dumping on. “I have encouraged him to constantly offer grace to people that he doesn’t think are deserving of grace,” Priebus said. Trump, in turn, calls Priebus “Mr. Switzerland” and speaks well of him. “Reince is a peacemaker, a very good person for getting people together,” he said. Trump was calling me from his limo after a rally in Anaheim, Calif. He was in the midst of an intrapartisan grudge tour of the American West, during which he disparaged, among other Republicans, Jeb Bush, the South Carolina governor, Nikki Haley, and the New Mexico governor, Susana Martinez, who is one of the   Hispanic elected officials in the G. O. P. He also reiterated that Romney was a “loser” and a “choker” and for good measure boasted that “I have a store that’s worth more money than he is. ” Priebus’s mother is Greek, which he says trains him for dealing with whatever the Greek word for mishegas is. “Ever see ‘My Big Fat Greek Wedding’?” he asked. “That’s my family, that’s my life. The arguing starts at 7:30 in the morning, everyone’s in each other’s business. It was good family chaos. ” I asked if what the G. O. P. was going through now was “good family chaos. ” “It depends how it turns out,” he said. At this point in the    calendar four and eight years ago, Romney and John McCain had built massive campaign operations and   networks that were orders of magnitude larger than Trump’s. They had accumulated armies of elected officials promoting them and were diligently making peace with vanquished opponents and paying courtesy calls to party dignitaries and congressional leaders in the name of “unity. ” The period between the end of the primaries and the start of the conventions is typically one of consolidation,   harvesting and turning full attention to the   opponent  —   all of which Trump has succeeded in achieving the   opposite of. Trump would of course be the first to point out that both McCain and Romney lost and that he has been doubted at every step of his campaign. But the degree to which he seems unconcerned with his pariah status among name Republicans remains a key feature of his pursuit. To a comical extent, top Republicans willed themselves invisible when I reached out to them for this article, fearing, not incorrectly, that the conversation would turn to Trump. This included some of the most typically quotable Republicans, including former Trump challengers like Graham (“He’s sorta had his fill talking about Trump,” a spokesman emailed) Perry (“Thanks for thinking of him”) and Ted Cruz (“Not great timing on our end”) the previous nominee Mitt Romney (“You are kind to think of me,” he wrote) Trump stalwarts like Chris Christie (“We are going to take a pass this time”)   Republican governors like Charlie Baker of Massachusetts (“The governor won’t be available”) and senators like Mike Lee, of Utah (“Senator Lee would love to talk to you about the state of the G. O. P. and conservatism in general. We are free anytime after Nov 8. ”). I tried Rubio, who has undergone more public agony than perhaps anyone about Trump. Rubio looks nauseated whenever someone asks him about the man he called “the most vulgar person to ever aspire to the presidency” but who later said he would be “honored” to speak for at the Republican convention before clarifying that if he did speak, he would only “speak about things I believe in, not somebody else’s platform. ” Rubio also holds the astonishing position of saying he’ll vote for someone he has previously declared unfit to hold the American nuclear codes. You envision him under a mushroom cloud, assuring his kids that it could be even worse  —   at least he didn’t vote for Clinton. There’s a palpable weariness among Republicans, and it’s still only June. Every day, it’s something else. “What it does is suck all the oxygen out of the chamber,” Senator Susan Collins, a Republican from Maine, told me. “I’m trying to do my job as a senator, which does not end because we have a contentious and bizarre presidential candidate. ” Trump, after accumulating enough delegates to win the nomination with almost no visible operation or recognizable strategy, has only nominally scaled his campaign beyond where it was a few months ago. There is barely any   or field apparatus to speak of, and Trump has outsourced a great deal of the   of an enormous   campaign to the overtasked R. N. C. Priebus has won praise for revamping the   data and field infrastructure that he inherited from his embattled predecessor, Michael Steele, in 2011. But no national committee in recent memory has been called upon to pick up as much operational slack in a general election. I asked Priebus if he was frustrated that so much has been thrown into the R. N. C. ’s lap. “It’s more frustrating for us when a campaign comes in and layers over our field staff,” is how he spun it. In addition to celebrating the presidential nominee, national conventions are a showcase for party eminences, rising stars and elected officials. Not so here. The last nominee, Romney, and two living former presidents, George W. Bush and George H. W. Bush, have said they are not supporting Trump or will not campaign for him. McCain has said he would be skipping the convention and is pursuing his senate   in Arizona with characteristically gritted teeth: the familiar “it pains me to do this” routine. Three of the top five   in the primaries  —   Cruz, Jeb Bush and the Ohio governor John Kasich  —   have either made no commitment to support Trump or, in Bush’s case, said definitively he would not support him. A fourth, Rubio, in addition to his prolonged and winding agony over Trump, has said he does “not want to be considered” as Trump’s running mate. This is a popular distancing trick doubling as a nifty   among reluctant Trump endorsers. “To the members of the press who are asking, while I am flattered to be mentioned,” Nikki Haley said, “my plate is full, and I am not interested in serving as vice president. ” (For the record, Trump finds these expressions annoying. “They were never asked,” Trump told me. “I don’t like it when they do that, because it’s very dishonest. If they’ve taken themselves out, it means they’re not being asked. ”) There is a distinct sense among leading Republicans that if you take proper precautions  —      —   it’s possible to avoid contagion. Ryan agreed to be interviewed for a Father’s Day feature in People Magazine but only on the condition that no Trump questions be asked. Trump seems to fundamentally welcome the party’s revulsion. As Ryan wavered over supporting him, Trump was privately saying that Ryan’s rejection might actually help him, that he was just the kind of political lifer whom Trump positioned his campaign against. His   director (and a former caddie) Dan Scavino Jr. actually went public with this, tweeting out a link to a column in Breitbart headlined, “Paul Ryan Is the Reason the G. O. P. Is Losing America. ” While Ryan is trying to refashion and sell the G. O. P. as a party of innovation and heart, Trump is a creature of mouth and gut and other   drivers. They can try to operate in parallel G. O. P. universes, but the two styles are often in obvious conflict. On the sunny morning of June 7 in Washington, Ryan and a group of seven House colleagues visited the mostly black neighborhood Anacostia to highlight a central idea of Ryan’s agenda. After a meeting at a residential   center, the representatives took turns giving testimonials on why Republican policies  —   lower taxes, entitlement reform, less regulation  —   would better address the intractable problems of urban poverty. This was Ryan at his most earnest and  . His concern for the urban poor derives heavily from his intellectual mentor, Jack Kemp, the former Republican congressman, housing secretary and patron saint of     conservatism. Poverty is the first item of Ryan’s   policy plan. He spoke at a lectern, surrounded by community leaders, and then invited questions from the press. Did Ryan have any regrets about endorsing Trump? “I told you,” Ryan said, smiling, turning to one of his hosts. The first six or so questions were about Trump. He was then in the midst of a furor over his repeated claims that Judge Gonzalo Curiel, the   jurist presiding in a civil case against Trump University, could not rule fairly because he was “Mexican. ” Ryan was blunt on the Curiel matter. “Claiming a person can’t do their job because of their race is sort of like the textbook definition of a racist comment,” he said. That was the headline. Ryan expressed great frustration that such comments by Trump “undercut these things,” meaning this   event. When we spoke, Ryan was most eager to discuss Priebus, his old friend and fellow Wisconsinite. Along with the   governor, Scott Walker, the trio form a formidable G. O. P. axis of cheese heads. I asked Ryan how he, as the   elected Republican, would distinguish his mission as a party leader from Priebus’s. “I see my role as helping to define the standard, which are the issues,” Ryan told me. Priebus’s role is building the party’s apparatus to be ready for the  . “Reince is basically being the adult in calming the situation,” he added. “He is protecting that   process. Reince is protecting that from being disfigured or hijacked. ” Ryan views himself as a guardian of conservative “ideas. ” “Ideas” is one of those fetish words, popular among ambitious young pols (conservative   are constantly dropping Kemp’s name). As the speaker of the Florida House, Rubio published a book in 2006 of “100 innovative ideas” and spoke about his love of ideas during his presidential campaign, before he started making   jokes about Trump. Bobby Jindal, the Louisiana governor who was then considered one of the   innovators of the party, warned after Romney’s defeat in 2012 that the G. O. P. must stop being “the stupid party” and urged fellow Republicans to talk “like adults” and swear off “offensive and bizarre” rhetoric. He then embarked on a presidential campaign in which his most memorable “idea” was suggesting that Trump “looks like he’s got a squirrel sitting on his head. ” (Jindal dropped out in November Trump barely bothered to insult him.) Jindal’s “stupid party” remark reflected a concern among idea conservatives that was marinating well before Trump came along: that the Republican Party has taken on an increasingly   bent. There has been a strong populist allergy to elitism within the G. O. P. coalition for a long time. But Sarah Palin’s emergence as the   nominee in 2008 and subsequent tenure as a party celebrity was a benchmark. Lesser imitators like Michele Bachmann and Herman Cain took turns as Republican   in 2012. Trump made his name as a national political figure in 2011 and 2012 with his flamboyant campaign to prove that Obama was not born in the United States, an   notion that was especially offensive to  . Four years later, the leader of what many Republicans had hoped was a nativist fringe movement is the party’s presumed nominee. Ryan believed that he and fellow   in Congress could preserve the party’s substantive core. This would be the laboratory from which he could remake the party’s conservative identity while attracting new Republicans, including young and minority voters. “I have to protect conservatism from being disfigured,” Ryan told me. His focus, he said, is on “ideas, temperament and the future of conservatism. ” Ryan has little confidence that Trump cares at all about his ideas, possessed that temperament or had thought at all about the future of conservatism. Trump almost never talks about “ideas,” unless you count blustery promises to “build a wall and make Mexico pay for it,” end lousy trade deals and “win” again. When, after considerable public hesitation, Ryan finally did say he would “vote for” Trump, he wrote a column in a newspaper in Janesville, Wis. reiterating his view that “politics can be a battle of ideas, not insults” and that “if we’re going to unite, it has to be over ideas. ” He said he had become convinced that Trump “would help us turn the ideas in this agenda into laws. ” What Trump had going for him more than anything, in Ryan’s eyes, was his willingness to outsource the conservative “idea” architecture of his administration to Ryan and   Republicans in the same way that he’s farming out much of his   campaign to the R. N. C. Even so, there’s no avoiding that Trump has over the last year been the ubiquitous voice of the G. O. P. to most voters, many of them new ones. He can cut a problematic image, to say the least. (In a June 15 Bloomberg poll, just 32 percent of Americans view the Republican Party favorably, the lowest figure since the survey’s 2009 inception.) Priebus and Ryan were relatively powerless during the primaries as Trump undertook his systematic disfiguring of the R. N. C. ’s plans for a more inclusive party. Last summer, during the relatively innocent months of Trump’s campaign, Priebus called and urged him to tone down his remarks (about “Mexican rapists,” for example). Trump scoffed at the idea that such a puny figure, a party guy, would ever try such a thing. “We’re not dealing with a   Army general,” Trump said. Priebus paid a debasing house call to Trump Tower last fall to accompany Trump as he signed a loyalty pledge to the eventual nominee. He listened this spring to Trump predict “riots” in Cleveland and complain about the “rigged” system that might deny him his rightful nomination. (“Give us all a break,” Priebus tweeted at one point.) He has endured an outpouring from a gallery of   who are urging the R. N. C. to take extraordinary measures and disavow its extraordinary nominee. “If Priebus ends up blessing the Trump nomination,” wrote the Washington Post columnist Michael Gerson, the head White House speechwriter for George W. Bush, “it would turn the sins of Trump into the sins of the G. O. P. And Priebus would go down as the head of the party who squandered the legacy of Lincoln, the legacy of Reagan, in a squalid and hopeless political effort. ” Priebus is not a man for extraordinary measures. He is an organization man in a time of disruption, runaway   and selfie campaigns. Party guys go along. It’s not always a fair fight. Political parties have seen better days in America. They are like many big and traditional institutions that way: the government, the church, among others. Signing on with the Donkeys and Elephants would seem a tired construct in a disintermediated culture of free agents and personal brand customization. Identities have replaced affiliations. In the course of reporting this article, I asked many Republicans of varied perspective why a young person today should consider joining a major political party. The question elicited sighs and head shakes, as if I were asking them why a millennial would join a Kiwanis Club, except that Kiwanis Clubs aren’t actively being resisted the way the Democratic and Republican parties are. Based on data from a 2014 Pew survey, 39 percent of the electorate identify as independents, compared with 32 percent as Democrats and 23 percent as Republicans (that’s the highest proportion of independents in nearly eight decades of surveys despite the fact that the country remains heavily partisan). It’s certainly worth pointing out that people have been predicting the death of the   system in America for years and also the demise of individual parties at various low points. The G. O. P. was supposedly terminal after Barry Goldwater’s landslide defeat of 1964, as were the Democrats following the rout of George McGovern in 1972 each party came back to win the White House four years later. Priebus, not surprisingly, is a defender of the party status quo. “The reality is, there’s two doors that people can walk through in this country,” he told me. “It’s not Italy. We don’t have 12 different parties where everyone can fit into their exact box. ” Still, the culture and speed of technological change has fueled an accelerated shift in how voters engage with and perceive political institutions and politicians. When I asked Trump the “why join a party?” question, he said, “I think the whole system is changing. ” His toggling between parties over the years has been well documented. Likewise, his embrace of atypical Republican positions during the primaries  —   his support for some aspects of Planned Parenthood  —   did nothing to thwart his nomination. It would indicate that voters might not be as wedded to the assumed conservative orthodoxies as G. O. P. leaders might think. “You have people who are socially conservative and fiscally nonconservative and vice versa,” Trump told me. “You have so many different permutations now. ” Trump’s embrace of this à la carte approach comports to a sensibility of voters’ choosing between models of disruption rather than a singular ideology. In a sense, disruption in and of itself has become an ideology. Whoever swings the biggest wrecking ball wins. “Washington is so broken and needs to be disrupted, and a lot of what could happen in this disruption would be good,” said Ben Sasse, a freshman Republican senator from Nebraska. “Unfortunately, it has to be someone who takes seriously the stewarding of a whole nation. And who cares about facts. And who is trustworthy. ” Sasse was pointedly not talking about Trump. He has said that he could not support him as his party nominee. He would not be voting for Clinton either. “There are Dumpster fires in my town more popular than these two ‘leaders,’’u2009” he wrote in a Facebook post in which he predicted the imminent breakup of both parties. He was harsher on Trump. Everywhere he goes in Nebraska, Sasse told me, people ask him for advice. “People say: ‘I’m distraught. I’m opposed to everything Hillary Clinton stands for, and yet I think I have to vote for her. How do you make sense of this? What should I do? ’’u2009” he said. “These are young evangelical women, teary sometimes. They say, ‘I can never tell my kids I voted for that man. ’’u2009” Sasse, who is 44, became an instant luminary of the   Never Trump movement after he unloaded on Trump. He is mostly avoiding interviews, though in a classic bit of politician   took this as an opportunity to share with me that “I’ve turned down something like 45 Sunday shows in a row. ” I asked Sasse if America’s fascination with celebrity might help explain the rise of Trump. No, he said. “There is such crisis of shared vision for what America means right now,” Sasse, a   former college president and business consultant, said. “People desperately seek shallower pop culture as a form of escape rather than finding actual meaning. ” For politics to be satisfying, it requires deeper ideals. And to partake of it as just another celebrity snack food leads a citizen to feel, after a while, “like you’ve eaten a   of cotton candy. ” In a tweet from early May, Sasse tried to nudge the former senator Tom Coburn into making a   bid. Coburn, an Oklahoma Republican and   physician, left the Senate in 2015 after spending his career  —   six years in the House, 10 in the Senate  —   as one of Washington’s proudest conservative mavericks and procedural troublemakers. Sasse told me that Coburn is one of his political idols. He also mentioned Paul Ryan. “If Tom Coburn and Paul Ryan have a baby,” Sasse said, “I’m their hideous offspring. ” All things being equal, Coburn would welcome having a superdisrupter in Washington. He has never been a party guy. “I don’t think it really matters, the parties,” Coburn, now retired and living in Tulsa, said. But Trump has been “repulsive to me,” he said, adding that Trump’s ability to win a party nomination “kind of fits with the modern social decline of America. ” I asked Coburn what Trump’s nomination signaled about the state of G. O. P. He was characteristically glib, apocalyptic and idealistic. “Either Trump is going to totally destroy the Republican Party,” Coburn said. “Or in the aftermath of him possibly losing an election, we’re going to rebuild it stronger than ever. ” The    option is predicated on Trump’s losing. Several Republicans I spoke to seemed to hope for this, if not explicitly. It is politically fraught, obviously, to say they will not support their party’s presidential nominee. But based on my discussions, I’m willing to bet a good portion of the elected Republicans who claim minimal allegiance to “the nominee” will wind up voting for Clinton in the privacy of their voting booths while rooting for Trump’s complete humiliation. “We’re just going to have to swallow it,” said Mark Salter, the longtime chief of staff and confidant of John McCain. “He’s just unfit for the office,” referring to Trump. As for Clinton, he said, “I mean, the worst thing you can say about her is, she’s kind of a hack. ” Ed Rogers, a Republican lobbyist and veteran of the Reagan and George H. W. Bush White Houses, calls himself a “not yet Republican,” meaning he is “not yet” ready to support Trump and has in fact moved in the opposite direction since Trump clinched the nomination last month. Rogers, a longtime business partner of the former Mississippi governor and R. N. C. chairman Haley Barbour, acknowledged that the Republicans tend to exaggerate Clinton’s flaws as a trade prerogative. “The Clintons have never been the demons ideologically that we’ve made them out to be,” Rogers told me. “From a character standpoint, they’re pretty bad, but Hillary isn’t the frightening offensive character that Trump is. ” If   Republicans rebelled against the “establishment” in the primaries, Trump has provided the establishment with mounting ammunition to fight back in the 11th hour. The first half of June has been a running train wreck for Trump, beginning with his crusade against Judge Curiel. Trump has been provoking increasing alarm among Republicans at the moment he should be proving himself nominally “presidential. ” The Republican senator Mark Kirk of Illinois announced that he could no longer support Trump in the aftermath of Curiel (“I think he’s too bigoted and racist for the Land of Lincoln”) Lindsey Graham did the same and urged other Republicans backing Trump to rescind their endorsements. Top Republicans voiced widespread opposition   to Trump’s reiterated calls for a temporary ban on Muslims entering the country. Trump in turn called party leaders “weak” and pounded them for not falling in line behind him. “Just please be quiet, don’t talk,” he railed at them at a June 15 rally in Atlanta. “We have to have our Republicans either stick together or let me do it by myself,” Trump said. “I’ll do very well. ” He would be banking on the   system being sufficiently hobbled that allegiance to him would prevail over partisan loyalty. Republicans wouldn’t hold it against Trump that he’s anathema to their establishment while Democrats would feel no loyalty to their traditional home team, let alone to Hillary Clinton. Trump appeared at this moment prepared to begin an independent   campaign under the nominal banner of the Republican Party, while using their abundant resources. This looked more like a jail break than a pivot. The second week of June was shaping up as another one of those “Baileys in my cereal” stretches for Reince Priebus. We were two days past the mass shooting in Orlando, a horrific event that moved Trump to tweet immediate thanks to all those who sent him “congrats” for predicting it. He also called on Obama to resign and later seemed to suggest that the president might have even been complicit in the tragedy. This invited swift repudiations from Republicans and Democrats, including a furious Obama, whose presidential stature seems to grow the longer Trump dominates news cycles. Obama’s net   rating has risen nearly 20 points since Trump became the G. O. P.   and the party’s inescapable face last summer. Priebus spent the weekend in Utah at an annual “ideas” gathering that Mitt Romney hosts for Republican luminaries, donors and business leaders. In a normal year, this would serve as a Republican unity confab before the convention: party bonding in the mountains. But this year’s edition was more of a rock slide. It convened a huddle of the Never Trumps, disaffected    and increasingly skittish party notables like Ryan and Senator Bob Corker of Tennessee. Romney set the tone for the weekend when he told Wolf Blitzer on CNN that Trump in the White House could “change the character of the generations of Americans that are following” and might result in “  racism,” “  misogyny” and “  bigotry. ” In a    session with Ryan, the   chief executive Meg Whitman, who was the G. O. P. nominee for governor of California in 2010, questioned how Ryan could endorse such an appalling figure. She placed Trump in the company of Hitler and Mussolini. Romney appeared to tear up at one point, according to an account in Politico. “Seeing this just breaks your heart,” he said. Priebus played the good party soldier. “Respect Mitt and differences but couldn’t disagree more,” he tweeted at Romney after his remarks. “Let’s stop this and unify. ” Priebus told Trump opponents at the retreat that Trump would win “with or without their help. ” He conveyed the exasperation of a substitute teacher being pelted with flying erasers. In almost every visit, Priebus and I had engaged in some variation on the same discussion. I kept asking him: “Whose party is this anyway? Who gets to define the G. O. P. ?” “It’s the party’s party,” he always answered. “The party defines the party. ” Convention delegates write the platform that lays out the party’s tenets. Trump can’t really change those: It’s a common refrain these days among   Republicans. “Trump is not going to change the institution,” the Senate majority leader, Mitch McConnell, told Politico last month, referring to the G. O. P. “He’s not going to change the basic philosophy of the party. ” Priebus and others might try to shape Trump’s behavior. They talk every day, Priebus and Trump. And tens of millions of people are having their impressions formed, shaped or solidified about today’s Republican Party by watching Donald Trump. They will vote for or against him in droves, not based on anything they read in the platform, whose readership probably amounts to less than 1 percent of Trump’s Twitter following. As I waited for Priebus in the lobby of the R. N. C. I noticed a tweet from an Associated Press reporter saying that Lamar Alexander, a Republican senator, had just suggested Trump might not be the surefire nominee after all. “We do not have a nominee until after the convention,” Alexander said. “That’s what you say,” Alexander added in response to a reminder that Trump was in fact the “presumptive nominee. ” It would seem ridiculously late in the process to be haggling over modifiers, at least it would be in a mythical normal year. When I walked into Priebus’s office, he sat on his couch and soldiered forth like a good party guy. If Ryan and McConnell tried to remain boxed off from the earthquake, Priebus occupied another shelter, constructed of   armor, alternate reality and denial. “I’m feeling good about things,” Priebus told me. His voice was flat and deliberate,   mode. It was hard to resist a few pokes at the organization man. How’s that Trump pivot working out? “I think it’s a work in progress,” Priebus said. He was trying to be upbeat. “I have Hillary Clinton on the other side,” he said, clinging to her as a lifeline. He was hoarse. I noticed him fiddling with a drink coaster. The coaster bore a cartoon rendition, sure enough, of Donald Trump: the only physical likeness I noticed anywhere in the building. Priebus had swiped a couple of these coasters from the bar at the   Hotel and found them amusing. He set them on a side table in his office, next to the fish tank. He predicted that Clinton’s campaign would be a “race to the bottom. ” Well, yes. There’s nothing like claims of moral high ground on a campaign. But I couldn’t help reminding Priebus that Trump recently accused President Bill Clinton of rape, Obama of treason, Hillary Clinton of murdering Vince Foster, Cruz’s dad of associating with assassins, Romney of not being a “real” Mormon and the rest of the litany. Where did the bottom even begin, and where could it possibly end? Priebus said that the rape and Vince Foster things were “sort of just warning shots to the Hillary campaign. ” He also claimed that Trump and Clinton were running “tied in the polls,” though this was being contradicted as we spoke. Clinton led Trump by 12 points in a new Bloomberg survey, with 55 percent of respondents saying they would never vote for the Republican and in an ABC   Post poll, seven in 10 Americans viewed Trump unfavorably, up 10 points in just the last month. A few days earlier, the conservative radio host Hugh Hewitt said that Republicans’ accepting Trump as the nominee was “like ignoring Stage IV cancer. ” There was a new wave of “Dump Trump” stories in the media, mostly featuring the same band of   Never Trumpers who seem to spend vast amounts of time on Twitter. I asked Priebus about any convention situation that could deny Trump the nomination. He did not reject the possibility, but it’s remote. It would require an alternative candidate (none currently) an organizing effort and a confluence of highly unlikely rule changes, delegate votes and procedural   whose likelihood Priebus compared to drawing an inside straight three times in a row. “I think people are living in Fantasy Land,” he said, not saying whether he shared in the fantasy. Priebus was heading out to catch a flight to Greensboro, N. C. for a   event with Trump that night. He was playing a role, the party guy, the proprietor of the china shop in the time of the bull. There was something oddly comforting to me about this presence, as thankless and unenviable as the life of Priebus might seem these days. What could be better for a lifer apparatchik? Priebus made a perfect   foil to a new politics of blazing chaos. “It could be a great moment or a bad moment,” Priebus told me. “But it’s going to be a moment. ” I thanked Priebus for his time. He was still fumbling with the cartoon Donald Trump coasters. “Your party’s made this story fun for me,” I told him. “Have I made it fun?” he asked, almost plaintively. “Or have I made it less fun?”'"}, "time": 1742563146.530097}