{"duration": 0.15001893043518066, "input_args": {"text": "'The Kansas Supreme Court ruled on Thursday that the state’s spending on public education was unconstitutionally low, dealing a new blow to Gov. Sam Brownback, who is facing a rebellion from his own Republican Party over his trademark   doctrine. In a unanimous ruling, the court said black, Hispanic and poor students were especially harmed by the lack of funding, pointing to lagging test scores and graduation rates. The justices set a June 30 deadline for lawmakers to pass a new constitutional funding formula, sending them scrambling to find more money to pay for a solution. This is the second time in about a year that Kansas’ highest court has ruled against the state’s approach to paying for schools, just as Mr. Brownback finds himself wrestling with growing budget deficits and as his relations with fellow Republicans have deteriorated to new lows. Mr. Brownback, who has made cutting taxes and shrinking government the centerpiece of his administration since taking office in 2011, championed the largest tax cuts in state history, turning Kansas into a national testing ground for his staunchly conservative philosophy. But the state has since struggled with gaping deficits, and patience has run thin, even among some former allies. Just last month, the   Legislature approved a tax increase that would have raised more than $1 billion to help narrow the budget gap  —   a bold rejection of Mr. Brownback’s vision. In the end, the governor vetoed the measure, and he barely survived an override attempt. The school funding ruling now adds yet another layer of fiscal trouble for Kansas and political tumult for Mr. Brownback. “Either the governor will have to bend, or we have to get enough votes in the House and Senate to override him,” Dinah Sykes, a Republican state senator, said, noting that lawmakers will have to get to work immediately to find money in the budget to satisfy the court’s requirements. “I thought that the tax plan that we put on his desk that was vetoed, I thought that was a compromise,” Ms. Sykes said. She added that lawmakers now had to prepare to find a legislative solution  —   with or without the governor. “We just have to dig in and figure out how to solve this problem,” she said. The court did not specify how much more money was needed for the state’s schools, but finding any could prove difficult. Current budget deficits reach into the hundreds of millions. “I think there’s a clear supermajority of legislators that want to move away from Brownback economics and the failed tax experiments,” said State Representative Jim Ward, the Democratic leader in the Kansas House. “Now the school decision expedites the importance of getting that done sooner rather than later. ” Mr. Brownback, who is barred by term limits from seeking   next year, has faced plunging approval ratings and increasingly criticism from the moderate wing of the Republican Party. In a statement, he acknowledged that some students in Kansas had not received a suitable education, calling for a new funding formula to “right this wrong. ” “The Kansas Legislature has the opportunity to engage in transformative educational reform by passing a school funding system that puts students first,” Mr. Brownback said. “Success is not measured in dollars spent, but in higher student performance. ” He made a pitch for schools outside of the public education system, suggesting that parents “should be given the opportunity and resources to set their child up for success through other educational choices. ” School funding consumes about half of Kansas’ budget, and its political salience cuts across party lines. Kansas prides itself on its public schools, and, in many small towns, the high school serves as a community anchor. The right to a suitably funded education is enshrined in the state Constitution. The current lawsuit was prompted by a slide in education financing that began after the recession under Mr. Brownback’s predecessor as governor, Mark V. Parkinson, a Democrat. But the school funding mechanism has been litigated in Kansas courts for years, and there are sharp regional distinctions in how the issue is viewed. In the affluent Kansas City suburbs, where test scores are high, many want to preserve special taxes that benefit their local school districts. In rural and urban parts of the state, where incomes are lower and academic performance sometimes lags, plans to provide more   funding for minorities and poor students have greater resonance. “Because of the budget cuts, frozen budgets, we’ve had to eliminate almost all of our extended learning time,” said Alan Cunningham, the superintendent of Dodge City Public Schools, a district where the first language of a majority of students is not English. “Those kids are not able to get the time they need to learn the things that they need to learn to be successful,” Mr. Cunningham said. In its ruling, the court detailed statistics that showed   and Hispanic students, as well as poor students and those learning the English language, lagging behind their peers academically. Cynthia Lane, the superintendent of public schools in Kansas City, Kan. where more than 80 percent of students come from   households and qualify for free or   lunches, said lawmakers needed to make special provisions for disadvantaged children in the new funding plan. “For a decade, we have been cutting support  —   we have been offering less tutoring, less support, less enrichment,” said Dr. Lane, whose school district was one of the four plaintiffs in the case before the Supreme Court. “So this ruling today gives me great hope that we can start talking about our aspirations, not just worrying about protecting where we are. ” James E. Ryan, the dean of the Harvard Graduate School of Education, said that courts in school finance cases frequently order state legislatures to come up with funding formulas that are fair  —   and Kansas was no exception. “What you see in Kansas you see in states across the country,” he said. “Namely, that there is an achievement gap between poorer kids and more   kids, and between white students and students of color. ” Mark Tallman, a lobbyist for the Kansas Association of School Boards, said he was pleased with the court’s ruling and hopeful that it would result in more resources in schools. He also said the ruling was an indication that the political winds in Kansas had shifted against Mr. Brownback, particularly with a more moderate Legislature voted into office in November, when Democrats gained 13 seats. “I do think that this Legislature is much more interested in funding education,” Mr. Tallman said. “I think the election results suggest that voters are seeing problems with our funding system that they want to address. ” For now, Mr. Brownback has shown a willingness to use a veto pen, leaving it uncertain whether lawmakers can agree on a new school funding plan by the June deadline, and whether they can raise enough revenue to support it. “You have enormous political will in Kansas to make the changes necessary,” Mr. Ward, the Democratic lawmaker, said, “and any politician obstructing that does it at their own peril. ”'"}, "time": 1742562805.6976345}