{"duration": 0.09168243408203125, "input_args": {"text": "'American Thinker November 1, 2016 \\nThe criminal investigation underway over Anthony Weiner’s alleged child sex infraction has a couple of characteristics that make it especially awkward for Hillary Clinton and Huma Abedin, the estranged wife of Weiner and close companion of Hillary. \\nEd Timperlake points out to me that in an underage sex investigation, all electronic communications of the investigative target are pursued. This probably led to the grand jury that was announced 11 days ago issuing a subpoena for all of the devices in the possession of Weiner and his family, including Huma. As Lucianne Goldberg quipped, they even seize the Speak & Spell toys in these cases. This grand jury is in New York, possibly less politically supervised than the first Hillary email investigation. \\nEvidently, some of these devices were not turned over in the first investigation and contained “pertinent” emails. We do not know with certainty, but some reports indicate the pertinent emails may have been found on Weiner’s laptop. Recall that the initial investigation did not convene a grand jury and did not, therefore, have subpoena power. It is possible that Huma Abedin misled the FBI over the existence of pertinent emails on her then husband’s computing devices. \\nSo what could have been on the laptop Carlos Danger used for sexting? \\nAdam Yoshida, with a background in information technology consulting for affluent and powerful people emails: \\n…Clinton [was] using e-mails seemingly like most people use IMs or text messaging. Her holding onto Blackberries (and seven switching back to older models when the software was upgraded) [demonstrates this]. It might even explain at least SOME of the motivation for the e-mail server itself. I’ve seen plenty of cases where a powerful person says basically, “I want my e-mails on this thing” and, regardless of whether it’s a good solution, people respond, “ready-aye-ready.” \\nSo, what could they have found on Weiner’s computers that would have caused such alarm? \\nI’d think one of two things: \\n1) Either that Huma signed in her e-mail account at one point and, presumably, it being Exchange or IMAP, dumped the whole account onto the computer and that account has plenty of e-mails between her and Clinton that were deleted. \\nOr – \\n2) There’s mention of Huma having a Yahoo account to which she would forward things for printing purposes. This struck me right away because, of course, printers are often difficult to configure as are e-mail accounts. It struck me as strange, yet very believable, that she mentioned that she’d forward stuff to that Yahoo account to print them. I mean, printing in theory should be platform agnostic, but – if you’re technically unsophisticated – you might have serious problems trying to setup an e-mail account or a printer on a device. Thus I imagine a scenario where she has a portable machine that either she can’t (or can’t be, for some reason) configured to use her home printer and a desktop machine (I imagine an slightly-older iMac here) that’s physically connected to the printer that serves as a shared “family computer” or whatever. She either can’t setup the e-mail account on that computer (perhaps it requires a VPN or something like that) or doesn’t want to, so she forwards everything that she wants to print to the Yahoo account that she does have setup on that computer. The FBI takes this computer as part of the Weiner investigation and, bam, they find thousands of e-mail messages – again, evidence of what was destroyed earlier.'"}, "time": 1742562340.1860824}