{"duration": 0.4374110698699951, "input_args": {"text": "'30 Views Share: \\nDr. David Duke offers a New Paradigm for Humanity. Read and listen to this amazing statement that will create a revolution in the concept of Human Rights. A recognition of the absolute right of every people to preserve its Human diversity, independence and freedom. The right of every people to preserve its culture, traditions, art forms and characteristics of society. \\nA path to peace and harmonious nations and societies. Why we must resist Globalist destruction of freedom, Globalist forms of economic and financial slavery, and Globalist, Zionist wars. \\nIn the power of its reason, love and understanding, this declaration of Human Diversity and Freedom can be the moral engine to saving our European heritage and truly the rights of every people on Earth! The Foundation of Human Freedom \\nI believe that each of us must be committed to the preservation of Human diversity. I cherish not only the value of every form of life on Earth in what we call biodiversity, but also respect and honor the diversity of Mankind. I believe that every people has the right to preserve their expression of Humanity, its own heritage and culture. That every people on earth has the right rule themselves and the right to be free and independent. \\nHuman freedom is the principle that all peoples must be free to be different. Humanity is not one, it is many. Destroying the variety, diversity and freedom of a diverse Humanity is a destruction of Humanity itself. \\nNot recognizing the inborn urge of every people to express their essence in their own forms of art, music, culture, religion, societal structure and government, leads to Human conflict and often to violence and Human suffering on a horrific scale. \\nMuch of the world’s conflicts are not because peoples and cultures are different, but because they are not allowed to be different! because Globalists and imperialists seek to expand their empires. They want to control the resources and economy of all nations and destroy real Human diversity. Human differences in values, cultures, economies, religions and their freedom and independence to preserve and celebrated those differences stand in the way of the Globalists who want to regiment mankind and make them soulless consumers. Human Diversity is natural \\nHuman life is expressed in a multitude of diverse peoples created by geographic and social adaption over the course of thousands of years. Whether we celebrate Human diversity as the handiwork of Nature or in a religious sense as the creation of God, we celebrate the rich tapestry of different peoples and cultures across the Earth. \\nWe believe that every people and culture has the right to preserve its unique expression of Humanity, that every people has the right to maintain and enrich its unique culture, to nurture its particular expressions of art, music, literature, philosophies, architecture, religion, diet, traditions and values that make every people unique and add beauty and possibility for Mankind. \\nWe believe that every people has the right to be politically free and independent, and not be ruled over or exploited by any other people or nation. And we reject the Globalist power that seeks to destroy the independence and freedom of every people and destroy Human diversity. Every people must have the right to self preservation and freedom \\nWe believe that every free people has the right to live in a harmonious society created in its own image, its own nature and spirit. \\nFor example, the people of Tibet have the Human right to live in a society oriented to the heritage, culture and tradition of that nation, as should all peoples. Today the Tibetan people are threatened by massive non-Tibetan immigration forced by an imperial power meant to marginalize the heritage and culture of Tibetan people in their own homeland. The loss of the unique people and culture of Tibet is a horrific loss for them and truly a loss for all of Humanity. What is true for Tibet and the Tibetan people is true for every people on Earth. We believe that the people of Tibet and every nation have the right to defend their borders, and an inherent Human right to preserve its unique ethnic and cultural character, and its freedom and independence. \\nNations more similar in their cultural, ethnic, religious and social traditions are tend to be far more harmonious that those wracked with internal cultural, ethnic or religious divisions. \\nWe also affirm that states with significant ethnic and cultural minorities tend to be more happy, peaceful and cooperative when each group has the freedom to an autonomy that makes each group feel more at home in society. \\nIf one looks honestly at the world, he quickly recognizes that the greatest source of civil conflict, hatreds, wars, genocide and other horrific Human rights violations comes from ethnic conflict, often accompanied by religious conflict. And when that happens it is like putting a fuse into dynamite. \\nIt is a truism that if you want to reduce ethnic conflict, you must endeavor to give every people the Human right to live and to create society and community in its own values and, that every group respect the right of every other group to do this. \\nWe believe that these endemic conflicts are rooted in supra-national states and globalist denial of the reality of Human diversity and denial of the natural Human desire of people to live in a society reflecting their own heritage, traditions, culture and values. One size does not fit all. \\nInstead of recognizing this reality, the globalists and empire builders seek to destroy the distinctions of Humanity so they will become more compliant to their control and exploitation. Instead of accepting the reality of Human nature and truly the diversity of all life, including Human life, the globalists continue to promote destructive policies that destroy the harmony of traditional societies and historical character of nations. Massive immigration of diverse peoples into another people’s living space produces conflict not harmony \\nWe believe that massive forced immigration of non-indigenous people into other people’s lands is almost always against the will of the indigenous people. \\nAnd this leads to civil repression, conflict, hatreds, violence. One does not have to look much further than the Palestinian Nakba, or the massive immigration into Tibet as examples of this universal truth, but this reality is just as true in Europe and other areas of the world that have undergone massive immigration into it regions and nation states. \\nLook at the riots and deep social unrest and conflict that have befallen traditional harmonious societies that have experienced massive, unwanted immigration. \\nA world of independent cultures is true diversity and freedom. \\nA multicultural state does not contribute to Human diversity. It does not contribute to Human happiness, peace and harmony. It more often than not lessens Human love and Human rights. No matter what the high motive, it produces more disharmony than harmony, more discord than accord. \\nJust as in the natural world every life form needs its own living space, and needs the preservation of its own ecosystem to survive and flourish, so it is true for every people of Humanity. \\nEvery people needs a living space and eco-cultural system in which it can thrive. Ignoring this reality leads to conflict. Diverse Human peoples and cultures and religions competing in a limited living space is the greatest single cause of civil war and crimes against Humanity. \\nUnited Nations studies show ethnic, cultural and religious conflicts within nations are the primary engines of civil conflict and war which takes an enormous toll in Human suffering, numbering hundreds of millions of dead, injured, and dispossessed Human beings. \\nThis urge to diversity has always been in Mankind, and always will be. Not to recognize this elemental part of mankind’s Nature is the progenitor of conflict. \\nIn fact, with the rise of the idea that people have the right to be free, ethnic conflict is increasing as the imperial states created by conquest can no longer repress the desire of diverse people for their freedom and ethnic expression. \\nNations whose rulers have established immigration policies ignoring Human differences are increasingly divided and conflicted. Trying to change the natural urge toward freedom is like screaming against the tide \\nThe global elite in government and media which has a huge stake in trying to regiment the world’s populations, tell us we are all the same and they endeavor to destroy every unique culture and Human expression . \\nThey attempt to change Human nature, but history and an increasingly conflicted world show that this is like screaming against the tide. \\nBetter to recognize Human nature, and within that context support national and regional freedom that lessons conflict and supports mutual respect. \\nIt is time to teach the new ethic that recognizes the Human right of every people to exist and thrive. However, those who seek their own people’s freedom must understand that these rights must be afforded to every people. And any effort toward this worthy goal must be in the spirit of not destroying the rights of others and to peaceful resolution of the conflicts. \\nIt is far better to recognize these realities and inherent desires of Humanity and avoid as much Human conflict as possible, than to try to destroy Human distinctions in pursuit of imperialist empire or globalist regimentation and conformity. Even if the destruction of people’s is based on a utopian vision, because it goes against basic human nature it ultimately leads not to a dreamed of peace and love between people but to conflict and hate. Attempts to control, exploit or harm any people is a crime against Humanity \\nWe must condemn violence and the harming or destruction of any people. We must adopt a clear Human ethic that attempts to control or exploit any other nation or people is a crime against Humanity. \\nWe support Human freedom and we support Human diversity and we support the right of every people to have their own nation or society, but we do not support supremacism, control or repression of any other people. Efforts to control or exploit is a crime against Humanity. \\nAs a person of European descent I see that much of the repressive globalism damaging the world originates in mostly European peopled nations that are today called the West. I see that this globalism not only damages and harms the world’s diversity of peoples but that it harms my own people. And I have learned that we must not allow this exploitation of our own heritage and be just as committed to the well being of all of humanity. \\nThis is a life-changing lesson that I have learned in my own life. As a very young man I joined a non-violent Klan organization in my community. Like so many young people across the world, I longed to identify with my own people, to defend the heritage that I love and that I believed was threatened. \\nBut still as a young man I left the organization because I came to realize I have no moral right to speak about Human rights for my own people unless I embrace the idea of the same Human rights for every people, and further, that we must be committed to securing Human rights, not with war, not with violence, not with Human suppression but the power of human ideas and ideals. \\nI believe that the vast majority of the earth’s people believe in the principles I set forth here. In my own life I further realized that other peoples have the same the desires for their own people’s heritage and rights that I have for mine. \\nI realize fully that only in a context of genuine commitment to respect the rights and freedoms of all Humanity, can one morally campaign for your own people’s fundamental rights. Defending the Diversity of Humanity is a defense of Humanity itself \\nThere is nothing wrong with a people defending their own rights and heritage. In fact defending and preserving the diversity of Humanity is defense of Humanity itself. \\nBut, it must come with a genuine concern for the rights and heritage of all. \\nIn that context and only with that understanding, can we move toward peaceful resolutions of social, religious and ethnic conflicts and at the same time preserve our own heritage and the diversity and freedom of Humanity. \\nNations that have an overwhelmingly unifying heritage, culture, religious and social tradition have the right to preserve their expression of Humanity and their societal harmony. \\nIt is a crime to destroy those values in pursuit of so-called multiculturalism. And if one wants to see where massive immigration of alien peoples, cultures and religions lead, just look to what happened in the war-ravaged now dismembered nation once called Yugoslavia, look to the cultural and ethnic genocide in Tibet, look to the tribal and religious conflicts in many nations of the Mideast. \\nGroup differences run deep. Even though the Muslim Qur’an repeatedly teaches Muslim unity, still some extremist elements of Shiites and Sunnis blow up the children of each other in the other’s holy places of worship. Nor did the admonitions of Jesus Christ against violence and for love and reconciliation stop Irish Catholics and Scottish-derived Protestants from a cascade of violence that has lead to the death of countless innocents. \\nAlthough we understand the historical motives of mass immigration of one people into another people’s lands, we must not continue to repeat those mistakes in the modern world and create more divided and strife-torn communities, regions and nations. Models of self rule and societal harmony \\nAnd just as a majority has the Human right to live in a social fabric in harmony with its history and values, so minorities must be accorded their Human right to have their own communities or regions that reflect their own essence, or helped to migrate to a sovereign region of compatriots. \\nThis is Human freedom and this is Human rights on the most fundamental level. Those nations with significant minorities of diverse people should strive toward recognizing their desire for freedom and self expression. \\nAutonomy within nations, such as the German language speaking South Tyrol region of North Italy and the Italian, French and German-speaking Cantons of Switzerland offer models of how recognition of differences in language, heritage, ethnicity and a liberal degree of autonomy can lead to a more peaceful national fabric. \\nNation states that seek imperial power through the conquering and subjection of other peoples are now coming apart at the seams because of the inherent will to freedom and identity that grow in suppressed people. \\nEven European nations divided by slight differences in history, identity, genetics and culture, seek this freedom. The artificially created nation of Czechoslovakia was composed of Czechs and Slovaks held together by 50 years of intense totalitarian physical suppression, propaganda and conditioning. \\nWhen the communist tyranny collapsed they used their new freedom to create the independent states of the Czech Republic and the Slovak Republic. \\nThey did this with mutual respect and not war, and without horrific crimes against Humanity. \\nContrast that to the artificially created state of Yugoslavia created in name of empire, and then held together under a ruthless authoritarian regime. When Communism fell, people wedded to old ideas of empire tried desperately to hold on to control over vast areas of diverse peoples. As a result, a long war and brutality and massive crimes against Humanity occurred on both sides of the conflict. \\nHow much better if all parties in the conflict had embraced the ethic that all people have a right to self rule and self expression in their own regions. Take for example two of the many peoples trapped in the old Yugoslavia, the Serbians and the Croatians. Even though Serbians may have dominated the government of Yugoslavia, to effectively control other peoples such a totalitarian state must suppress the natural differences in people and force a regimentation and conformity. \\nSo even the Serbian people lost some of their unique identity as well as the other peoples over whom they ruled. People now warmly embrace the right of Serbians and Croatians to be themselves and rule themselves. Globalism is a continuation of Yugoslavian totalitarianism on a global scale \\nIronically, the Serbians and the Croatians and indeed all of us, face globalist tyrants demanding to control the economy of Serbia and Croatia, their currencies, controlled by New York and London rather than by their own people, and increasingly they are subject to a media controlled by Hollywood and New York rather than the spirit of their own traditional heritage and values. \\nAnd in the height of insanity, the Globalists are eyeing mass immigration into both Serbia and Croatia of massive numbers of non-European immigrants who are far more fundamentally different than Serbs and Croats. A prescription for future Human conflict. The rights of both majorities and minorities \\nThere are many harmonious nations on earth that are overwhelmingly of one primary heritage, with only minor differences among their inhabitants. \\nBut, nations corrupted by the globalist power and media elite, and propagandized that Humanity is one and not many go against the people’s will and usher in massive immigration of an alien population. \\nThis process is almost always against the democratic will of the nation’s inhabitants as history repeatedly shows. And then as the numbers increase and societal differences and conflicts and discord increase, the globalists resort to the old totalitarian tactics of suppressing free speech, free association, and all kinds of Human liberty, even to the point of forbidding the public displays of the traditional culture of the vast majority. \\nA powerful example is how the American government has now made it illegal to display a Christian Christmas motif on public ground, even in an overwhelmingly Christian cultural nation. America supposedly created by e pluribus unum (out of the many, one) is now dominated by identity and ethnic politics. \\nThe most powerful lobby in American politics by far is, for instance, the Jewish Lobby, comprised of an ethnic group of two percent of the American people but driven by ethnic and religious supremacism. Jewish organizations lead the fight in the destruction of Christian Christmas traditions. \\nThe political landscape of America is dominated by special interest groups to which every politician must now bow, except of course the European American majority which must silently watch as its cultural traditions, such as Christmas are destroyed. Of course, it goes far beyond Christmas. Americans are experiencing increasing identity politics and division such as generated by massive illegal immigration. The rights of small nations cannot be sacrificed \\nOn the international level it must be recognized as a crime against Humanity for any imperial state to occupy another people’s lands for exploitation of its labor or resources. Where autonomy or independent regions are not possible, a degree of autonomy is certainly possible where significant groups in an area can have community institutions, schools and other structures oriented toward both their needs and their spirit. \\nIt is time to stand for freedom for all peoples. It is time to stand up to Globalist destruction of biodiversity, destruction of Human diversity, destruction of the earth’s indigenous cultures, artistic expressions, lifestyles, traditions and independence. Zionist Globalism is actually supremacism \\nThe globalists seek the destruction of every unique expression of Humanity. They want to destroy the unique character of your people and every people on the earth. \\nThey seek to destroy the Human diversity of the earth so they can more easily rule over all of us, and market the same brands of junk movies, media and music. They want you and all of us to consume the same junk food from a world agribusiness and media that advertises it, that not only destroys the planet’s ecosystems, but destroys your health and the health of hundreds of millions of people spawning epidemics of obesity, heart disease, diabetes and other ills. \\nThey want to control the value of the currency in your pocket, and force you and your nation under a corrupt Zionist-controlled global banking system that exploits you and all of us and put whole nations and peoples as slaves in a perpetual debt. \\nThey want to put you and all of us under a soulless, Globalist government that takes away your freedom and that of every people and every nation. \\nAnd these globalists want war, perpetual wars and conflicts in their attempts to expand their power over the earth and over all people. \\nThey grow stronger by divide and conquer tactics, and they seek to stamp out Human diversity and seek to regiment all of Humanity to their New World Order all while the New York centered Globalist media supports Israel as a quote “Jewish State”, and supports Zionist control of the International Banks and the Globalist media. So in reality, Zionist-Driven Globalism is actually form of Jewish supremacism. \\nGlobalism is Imperialism on a global level, and the greatest threat to human freedom, diversity and independence in all of world history. Yes to Freedom, yes to Diversity and Independence \\nBut, my dear friends all over the world, in my homeland of America and that of my brethren in Europe, but among all freedom loving people across the globe, millions of us say no to globalism. \\nWe say yes to freedom, yes to Human diversity and independence. \\nWe say no to globalist wars such as the Iraq War, the Afghanistan War, the planned war on Iran, horrific wars that are part of the Zionist, Globalist agenda. \\nWe say no to the Zionist dominated Globalist media that spout the lies that fuel these wars. \\nWe say yes to a free Internet and the freedom of people create their own media, literature, music and art forms. No longer will we drink the toxic poisons of the Globalist elite. \\nWe say no to Globalism, yes to Human freedom, yes to Human diversity, yes to world of peace and prosperity. \\nWe say yes to every people’s striving to preserve their way of life, their particular heritage, their particular expression of Humanity. \\nWhether we are Kurds, or Pakistanis, or Iranians or Palestinians. Whether we are Chinese, or Japanese, or Africans or Indians or of European heritage, we say no to globalism. \\nWe say yes to Human Freedom and Global Diversity. We say yes to the peoples of our own nations and societies determining our destiny. \\nWe say no to the Global corporations and huge imperial powers wiping out Human diversity in pursuit of their ungodly power. We say yes to preserving our heritage and our way of life, yes to our independence and freedom no matter who we are or where we live upon the earth. \\nWe are Humanity. We are many. \\nBecause we honor our own heritage and traditions, we honor every heritage and tradition. \\nBecause we value our own freedom and independence we value the freedom and independence of every people on Earth. \\nBecause we refuse to be economically exploited we pledge not to exploit other s. \\nJust as most Europeans now want to preserve their own heritage and cultures, we refuse to support the Globalists who seek to use us to control and exploit other nations around the world. \\nBecause we love peace, we refuse to support their Zionist-driven globalist wars. A New Paradigm of Human Rights \\nThis is a new affirmation of Human rights, a new paradigm. It is the Human freedom movement and it is found wherever there are free people who desire to preserve their heritage and freedom. \\nIt is found where people yearn for Human societies allowed to be as naturally diverse as the biodiversity in Nature. \\nThe Globalists have global economic, media political and military power. But we represent the true desires of Humanity for freedom. \\nWe represent the natural desires of every majority population to want to preserve the character of their nation and people, and every minority population who seeks more freedom and autonomy in their own communities or regions. Human Diversity, Freedom and Independence \\nWe must resist rule of the Globalists over us with a Global coalition of mutually free peoples. \\nWe are rising in every nation. \\nOur Paradigm for Human Freedom and Diversity is growing among people all over the world. \\nThe Globalists cannot rule over us without our consent. They cannot defeat us if we rise in defense of Human freedom and diversity, not just for ourselves but as a new principle for all Mankind, good for all people on this planet. \\nThe principles we stand for we hold, for our own people and for every people on the face the Earth. \\nThis is the world I am committed to, the Humanity I am committed to, the nation in my own land that I am committed to. \\nI hope you join me in this quest for a new paradigm for Humanity, a new commitment to Human freedom and diversity. \\n\\nDr. David Duke \\nPostscript: \\nAs I publish this most recent updated edition, Zionist Jewish Supremacists are committing mass murder against the people of Gaza. We must support Gaza! Gaza is a symbol today of the need for Global freedom from the Tyranny of Zionism. Free Palestine. Free Europe and the Western World, Free the World!'"}, "time": 1742564329.1157815}