{"duration": 0.06159162521362305, "input_args": {"text": "'On a recent night, somewhere in the swamps of Jersey, it was the children, primarily, who asked the hard questions. “Could a bat eat a human?” one girl asked. “Only on HBO,” answered Joseph D’Angeli, who is known in some quarters as the Batman of New Jersey. “How do you attract a bat to a bat house?” a woman asked. “A   female bat,” the single,    Mr. D’Angeli said, before quickly adding that a bat house should be allowed to weather, to lose the scent of humans. The children were among 50 people who had turned out at Ridgefield Park High School for the first night of Batstock, an annual series of events in Bergen County created by Mr. D’Angeli in 2009 to celebrate bats, which he said were underappreciated and misunderstood. The creatures are also being wiped out throughout the Eastern United States by a fungal disease, which Mr. D’Angeli said now made education even more important. Mr. D’Angeli, the director of the Wildlife Conservation and Education Center in Ridgefield Park, has spent more than two decades promoting bat conservation. He spent Sunday night dispelling myths about bats and highlighting their positive traits. No, they don’t want to suck your blood, and less than 1 percent of bats actually carry rabies. Some, however, do eat hundreds or even thousands of insects every night. “Bats are our best natural defense against mosquitoes,” he told the audience. It is one reason the decline in bat populations is so grave, Mr. D’Angeli and other experts say. Since 2006,   syndrome, a fungal disease, has decimated the hibernating bat population in the Northeast. Brooke Maslo, a professor in the department of ecology, evolution, and natural resources at Rutgers University in New Brunswick, N. J. studies North American bats. She said in an interview that the disease had killed millions of bats in the United States. “When it first came through, the bats were just dead on the floor of the caves,” she said. “And now there’s just the skeletons. “It’s like walking though a graveyard,” she said. Dr. Maslo said that loss of bats could result in a huge growth of insect populations, especially of crop pests. Mr. D’Angel said the population decline had added urgency to his mission to educate. “I do admit, some of them look mouselike,” he said as he looked at a bat’s head on a screen with the audience. “But they are not rodents at all. ” Nearby, three   fruit bats hung in a cage. Audience members fed them pieces of papaya and honeydew on wooden skewers at the end of the program. Mr. D’Angeli usually hangs out with some 20 bats in his education center, a storefront in Ridgefield Park. He is one of only two people licensed to have bats in New Jersey, according to the State Department of Environmental Protection. The center also houses spiders, snakes and other animals, most of which came from shelters or private owners who could no longer care for them. Bats were not always Mr. D’Angeli’s primary focus in life. In the late 1980s and early ’90s, he was the lead singer of Roxx, a glam metal band known for a stage show that included laser lights and pyrotechnics. “Go big or don’t go at all, that’s how Joe likes to do his shows,” said John Banaski, a friend of Mr. D’Angeli’s since the music years and a Batstock volunteer. Mr. Banaski, 48, said the two met more than 20 years ago at one of Mr. D’Angeli’s concerts. Roxx disbanded in the   Mr. D’Angeli said, around the same time he began devoting himself to educating the public about bats. He lectures and exhibits bats throughout New Jersey, he said, at schools, libraries and other venues. Many at Batstock took to the furry winged creatures. “I like the different designs on them,” Vilaiwan Galarza, 9 said. Vilaiwan, who was with her mother and younger brother, said she was not afraid. “I’ve seen more disgusting creatures,” she said. Her mother, Kamolchanok Galarza, said she was “O. K. ” with bats. “I think it’s good if they help kill mosquitoes,” Ms. Galarza, 37, said. Tehilla Blau, 12, said she thought bats were interesting. “Some of them can’t really be described as cute, but they’re also not repulsive,” said Tehilla, who was with her brother and grandparents. Batstock will continue with a bat walk at the Teaneck Creek Conservancy on Sept. 18. “It’s not Woodstock by any means, but it’s still nice,” Mr. D’Angeli said. “There’s one goal and one goal only,” he added. “And that is to make sure that bats get the attention they deserve. ”'"}, "time": 1742628423.0208607}