{"duration": 0.08459782600402832, "input_args": {"text": "'Common Sense as defined by the Cambridge Academic Text Dictionary is the ability to use good judgement in making decisions to live in a reasonable and safe way. While that may have sounded reasonable and safe back in the sixties and seventies when I was growing up, I find myself at risk daily based on the judgement of others who make decisions that have lasting and irreversible consequences. Ever since I started writing sporadically, beginning in the early eighties for small newspapers like the Chicago Daily News and the Chicago Defender, I have enjoyed the opportunity to research, find and expose resources. I started with “Canons on Careers”, which was my weekly contribution to those readers who were looking for career and employment opportunities and financial aid to pay for, and in some cases get paid for attending college. When I started “Just Saying” for the Guardian Liberty Voice in 2014, I was motivated to express my personal opinions about the world around me as I saw it through my limited world view. As I see the local landscape that I travail everyday, and the world at large portrayed to me and others by media moguls and highly paid infotainment charlatans, I write to vent my frustrations and fears that the world around me has been dumb down to the point where Common Sense will never again be Common!\\nSince I grew up in public housing and went to public schools, I have never really thought of myself as an intellectual or the brightest candle on the cake. I never ever thought that those around me would fall to such a level of illiteracy where the adults and the majority of inner city youth and young adults would struggle to read and write at an eight grade level or higher. I am in the business of hiring people daily and 7 out of ten people who I put to work daily cannot properly fill out an application or transfer information from a Resume’ to the application. The fact that illiteracy has been broken down to three categories, functional, cultural and moral doesn’t ease my anxieties as I see relatively modest and simple differences of opinion escalate to levels of violence and idiocy that cost people their limbs and their lives. While Functional illiteracy plagues over 24 million Americans, with over a million of them graduating from high school with a diploma the value of a wet food stamp, Cultural illiteracy is the lack of knowledge of the significant historical events that shaped this country which obscures the lessons learned ( or Not learned )! Moral illiteracy completes the three forms of illiteracy, and to my view causes the senseless and heinous callousness that prevails in the United States today! Our young are not taught the moral values of the old and therefore disrespect the old, value the new and care more about the self than the community of you! That said, how could common sense ever factor into the equation ! There is no ME in common and the only sense that counts is mine!\\nI’m Just Saying……What’s a fella to do? I live in a country that just elected a guy named Donald Trump, President, who says he represents the people and that he is the change agent that is going to make America GREAT again. Yes, this is the guy who going to bring back all the jobs that our poor trade polices gave away. Yes, this is the guy who says Climate Change is a hoax and all those coal mining jobs are coming back to West Virginia, Pennsylvania and all those lily white towns who used to thrive on those deadly but well paying jobs. This is also the guy who is the protege’ of Roy Cohn (the instigator and arbitrator of McCarthyism) who caused many people to commit suicide and destroyed countless lives with tactics of fear using race, misogyny and communism! In a NUTshell, Donald Trump cohnned many of America’s so-called common folk into thinking he was with them and one of them! Yep, a millionaire/billionaire (who knows, he never revealed his taxes) who claims to be a commoner! It took me a long time Dad but now I get it…….Common Sense is not Common!!!!'"}, "time": 1742562351.7325861}