{"duration": 0.09005308151245117, "input_args": {"text": "'Poland is Empowering Women with Free, Nationwide Self Defense Classes Nov 11, 2016 0 0 \\nPoland’s Defense Ministry is opening free self-defense classes across the nation for women in order to cultivate their self-defense skills. Classes based in Aikido and Jiujitsu will teach women how to defend themselves against strangulation, and even a weapons assault. \\nThe free trainings will be offered through June at 30 military bases across Poland starting November 19, 2016. Anyone woman who is in good health and above the age of 18 can attend. \\nThough Poland’s officials have been accused of using the free classes as a method of political persuasion and propaganda, Poland’s defense minister Antoni Macierewicz, claims the goal is to teach women “basic fighting techniques” and improve their overall physical fitness, adding that women will learn, “how to react in a dangerous situation.” \\nBy gender, 45% of women in the world say that they do not feel safe walking alone at night , and that ‘street-harassment’ is a common occurrence for them. \\nHow does Poland compare to other countries where women might feel threatened, too? \\nPoland: Hollaback! Poland conducted an informal online survey of 818 people (mostly women) in 2012 . They found that 85% of female respondents had experienced street harassment in public spaces in Poland, as had 44% of men. \\nAfghanistan: The Women and Children Legal Research Foundation conducted research in October 2015 with 364 women and girls about sexual harassment in public spaces, workplaces, and educational institutions in seven provinces of Afghanistan. 93% said they were harassed in public spaces , 87% said workplaces, and 89% said educational institutions. Additionally, 90% had observed sexual harassment in public places , 79% in educational settings, and 72% in workplaces. \\nAustralia: Research by The Australia Institute in 2015 of 1426 females found that 87% were verbally or physically attacked while walking down the street . 40% of women feel unsafe in their own neighborhoods at night. In addition to verbal harassment, physical street harassment was also a relatively commonplace occurrence, with 65% of women experiencing physically threatening harassment. \\nBangladesh : The Bangladesh Bureau of Statistics and United Nations Population Fund surveyed 12,600 women across the country in 2014 and most said they regularly face sexual harassment in their daily lives. About 43% said public spaces were the spot where they experienced it the most. \\nBrazil: Think Olga commissioned a survey conducted by journalist Karin Hueck as part of their anti-street harassment campaign Fiu Fiu Enough. There were 7,762 participants for the opt-in survey and 99.6 % of them said they had been harassed . \\nCanada : Using a national sample of 12,300 Canadian women ages 18 and older from 1994, sociology professors Ross Macmillan, Annette Nierobisz, and Sandy Welsh studied the impact of street harassment on women’s perceived sense of safety in 2000. During their research, they found that over 80 percent of the women surveyed had experienced male stranger harassment in public and that those experiences had a large and detrimental impact on their perceived safety in public. \\nBeijing, China: A 2002 survey of 200 citizens in Beijing, China, showed that 70 percent had been subjected to a form of sexual harassment . Most people said it occurred on public transportation, including 58 percent who said it occurred on the bus. \\nCroatia: Hollaback! Croatia informally surveyed 500 people (mostly women) online about street harassment in 2012 . They found that 99 percent of women experienced some form of street harassment in their lifetime, and 50 percent experienced it by age 18. \\nEcuador: A UN scoping study in 2011 found that 68% of women experienced some form of sexual harassment and sexual violence in public spaces during the previous year. \\nEgypt: The United Nations Entity for Gender Equality and the Empowerment of Women published a report in 2013 showing that 99.3% of Egyptian women have experienced some form of sexual harassment. The study indicates that “ 96.5% of women in their survey said that sexual harassment came in the form of touching , which was the most common manifestation of sexual harassment. Verbal sexual harassment had the second-highest rate experienced by women with 95.5% of women reporting cases.” \\nMumbai, India : We the People Foundation’s 2012 study found that 80% of women in Mumbai had been street harassed , primarily in crowded areas like trains and railway platforms. \\nUnited Kingdom : End Violence Against Women Coalition commissioned YouGov to conduct the first national poll on street harassment in 2016 . 64% of women of all ages have experienced unwanted sexual harassment in public places. Additionally, 35% of women had experienced unwanted sexual touching. 85% of women ages 18-24 had faced sexual harassment in public spaces and 45% had experienced unwanted sexual touching . \\nUSA : Penn, Schoen and Berland Associates conducted a nationally representative telephone survey of 612 adult women between June 17 and June 19, 2000 . From this survey, they found that almost all women had experienced street harassment: 87 percent of American women between the ages of 18-64 had been harassed by a male stranger; and over one half of them experienced “extreme” harassment including being touched, grabbed, rubbed, brushed or followed by a strange man on the street or other public place. Shattering the myth that street harassment is an urban problem, the survey found that women in all areas experienced it: 90 percent in rural areas, 88 percent in suburban areas, and 87 percent in urban areas. Sadly, 84 percent of women “consider changing their behavior to avoid street harassment .” \\nIt looks like Poland’s idea to empower women against unwanted attention isn’t such a bad idea for many countries. \\nFeatured image: Polish Defence Ministry Vote Up Christina Sarich Christina Sarich is a musician, yogi, humanitarian and freelance writer who channels many hours of studying Lao Tzu, Paramahansa Yogananda, Rob Brezny, Miles Davis, and Tom Robbins into interesting tidbits to help you Wake up Your Sleepy Little Head, and *See the Big Picture*. Her blog is Yoga for the New World . Her latest book is Pharma Sutra: Healing The Body And Mind Through The Art Of Yoga .'"}, "time": 1742561796.8958673}