{"duration": 0.08810782432556152, "input_args": {"text": "'sowjetunion Möchte Moskau die Sowjetunion wiederauferstehen lassen? Quelle:Panthermedia / Vostock-photo \\nFührende Experten des politischen Lebens, die von Montag bis Donnerstag am Waldai-Klub in Sotschi teilnahmen, diskutierten die aktuelle russische Außenpolitik und verglichen sie mit jener der Sowjetunion. Derzeit würden dem modernen Russland sowjetische Ambitionen nachgesagt. Vor diesem Hintergrund versuchten die Experten, die wichtigsten Mythen über die sowjetische Vergangenheit aufzulisten und die Zukunft Russlands vorherzusagen. Der Zerfall der Sowjetunion war nicht prädestiniert \\n“Ich glaube, dass der Zerfall der Sowjetunion 1991 vermeidbar war. Es gab genauso gute Gründe, warum sie hätte weiterexistieren können”, sagte Robert Legwold, Ehrenprofessor des Lehrstuhls für Politikwissenschaft an der Columbia University und ehemaliger Leiter der Euro-Atlantic Security Initiative. Laut Legwold lasse sich der Zerfall nicht hundertprozentig auf einen bestimmten Grund zurückführen: Weder politische oder wirtschaftliche Probleme, noch das Streben der Völker nach Unabhängigkeit könnten dieses Phänomen erklären. Wandmosaiken: Ikonen der Sowjetzeit in Russlands Städten “In Russland ist die Meinung verbreitet, dass die Sowjetunion von außen zerstört wurde”, erklärte Andrej Zygankow, Professor am Lehrstuhl für Politikwissenschaft und Internationale Beziehungen der San Francisco State University, im Interview mit RBTH. Diese Meinung werde auch dadurch gerechtfertigt, dass sich die wirtschaftliche Situation 1988 verbessert habe, sagte Zygankow. “Eine andere Politik hätte die Situation ändern können”, vermutet der Experte. „Russland ist mit sich selbst beschäftigt“ \\nAber noch interessanter sei die Tatsache, dass man dem modernen Russland die Methoden der sowjetischen Außenpolitik zuschreibe, so Zygankow. “Das ist aber Schnee von gestern”, glaubt auch Richard Sakwa, Professor für russische und europäische Politik an der University of Kent, zu. Man liege falsch, wenn man jede Aktivität Russlands im postsowjetischen Raum als Versuch betrachte, die Sowjetunion wiederzubeleben, sagt der Experte. \\nDas moderne Russland habe nicht die Absicht, benachbarte Länder in einen neuen Kalten Krieg zu verwickeln, meint Legwold. Russland wolle genau wie jeder andere Staat auch seinen Einfluss auf Entscheidungen in der Region wahren, wann immer die eigenen Interessen betroffen seien, so der Experte. Genau deswegen sei Russland für den Westen keine potenzielle Gefahr. John Mearsheimer, Professor an der University of Chicago, stimmte zu und sagte, Russland sei derzeit mit der Verbesserung der eigenen wirtschaftlichen und demografischen Situation beschäftigt. Russische Politik ist eine Antwort auf die USA \\nDie Experten erklären die Kritik an den Integrationsinitiativen Russlands damit, dass diese Initiativen den westlichen Glauben an die alternativlose moderne Weltordnung ins Wanken brächten. „Das vom Westen nach 1991 aufgebaute, universelle System versucht, den politischen Raum weltweit zu homogenisieren. Die Entwicklung der Brics-Staaten sowie die Ausweitung anderer Initiativen ist ein Zeichen dafür, dass es Alternativen gibt und die monopolare Weltordnung der Vergangenheit angehört”, sagte Sakwa. Das Erbe der Sowjetunion Dabei habe Russland nicht die Absicht, der westlichen Welt eine alternative Weltordnung zu präsentieren, meinen die Experten. Man sei überzeugt, dass russische außenpolitische Initiativen, darunter auch eine engere Zusammenarbeit mit China, eine Folge der amerikanischen und europäischen Politik gegenüber Russland seien. “Russland gibt in der Regel eine Antwort auf amerikanische Handlungen. Es sind die Amerikaner, die Russland motivieren, sich in Richtung Chinas zu bewegen. Das ist jedoch nicht im Interesse der USA, oder?”, fragte Mearsheimer.\\nSolange Russland und der Westen einander als Aggressoren und Welteroberer betrachteten, werde es keine Normalisierung der Beziehungen und keine gegenseitig vorteilhafte Zusammenarbeit geben, sind sich die Experten einig. Alle Rechte vorbehalten'"}, "time": 1742561824.9560192}