{"duration": 0.15524077415466309, "input_args": {"text": "'Hillary Clinton and Donald J. Trump hopscotched from Pennsylvania to North Carolina to Michigan on Monday in the final, frenzied hours of the presidential campaign, offering clashing closing arguments as the sprawling map of the United States was reduced to a string of   states. Accompanied by rock stars,   old friends and their grown children, the Democratic and Republican nominees pleaded with voters to end a traumatic campaign with an emphatic endorsement of their visions for the country. In Philadelphia, Mrs. Clinton drew the biggest crowd of her   campaign to the vast plaza in front of Independence Hall, where Bruce Springsteen, the balladeer of   America, rhapsodized about her values and the candidate portrayed herself as a protector of freedom and equality. “Tomorrow we face the test of our time. What will we vote for  —   not just against?” Mrs. Clinton asked. “Every issue you care about is at stake. ” She concluded with an appeal to those who have waited decades for a female president. “Let’s make history together,” she said. In Manchester, N. H. Mr. Trump took the stage with his family at Southern New Hampshire University Arena as “God Bless the U. S. A. ” blared, blue laser beams illuminated the dark hall and a smoke machine piped a haze over the crowd. Mr. Trump asked a country polarized over his personality and tactics to embrace his plan to thoroughly shake up Washington. “I am asking for the votes of all Americans, Democrats, Republicans, independents,” Mr. Trump said, “who are so desperately in need of change. ” The contrasts between the candidates and their messages were on vivid display in the campaign’s last full day. As she embarked on a   tour, Mrs. Clinton gave a sunny and optimistic summation of her candidacy for the White House. “Tomorrow, you can vote for a hopeful, inclusive,   America,” she told a crowd in Pittsburgh. Mr. Trump, who campaigned in five states on Monday, took a harsher approach, assailing the “crooked media,” attacking a “corrupt Washington establishment” and mocking Mrs. Clinton over and over. “It’s a rigged, rigged system,” he declared in Raleigh, N. C. “And now it’s up to the American people to deliver the justice that we deserve at the ballot box tomorrow. ” As the campaign wound down, both candidates dispensed with ritual. Mrs. Clinton, who relishes upbraiding her opponent, toned down her usual assault on Mr. Trump’s conduct and temperament. And Mr. Trump, who normally seeks to convey confidence at all times, sounded uncharacteristically vulnerable. “They say we’ll get a tremendous amount of credit, win or lose,” he said during a rally in Sarasota, Fla. “I said: ‘No, no, no, no. I don’t want any credit if we lose. ’” Despite the ugliness of the campaign, there were signs that Americans were seizing the opportunity to express themselves at the ballot box in large numbers. Turnout in states that allow early voting was high, and in interviews, many voters said they were eager to bring an end to this unusual, exhausting and still suspenseful election. “I’m totally ready for this election to be over,” said Mary Hoch, 54, who attended Mr. Trump’s rally in Sarasota with a “Make America Great Again” hat on her head and a “Deplorable Lives Matter” pin on her shirt. Ms. Hoch predicted a Trump victory. “I think there are a lot of silent Trump voters,” she said. Daniel Saunders, 58, who attended a rally for Mrs. Clinton in Charlotte, N. C. was just as exasperated by the race. “I’m embarrassed by it,” he said. But Mr. Saunders said he believed that Mrs. Clinton would eke out a win. “These things always tighten up, but I think she’ll pull it out,” he said. Both Mr. Trump and Mrs. Clinton sent their running mates, families and allies across the country to maximize their reach in crucial swing states. Mr. Trump relied on his three oldest children  —   Ivanka, Eric and Donald Jr.  —   along with Rudolph W. Giuliani, the former New York mayor, and Sarah Palin, the former governor of Alaska and 2008 Republican   nominee. Mrs. Clinton deployed President Obama and former President Bill Clinton, as well as Vice President Joseph R. Biden Jr. and the first lady, Michelle Obama, perhaps the most popular political figure in the country. “Tomorrow, with your vote, you can say that this country has always been great,” Mrs. Obama said. “That it is the greatest country on earth. ” Mrs. Clinton’s running mate, Senator Tim Kaine of Virginia, spent much of the day campaigning in North Carolina, which Mr. Obama carried in 2008 but lost four years later to Mitt Romney. “It’s great to see a finish line, isn’t it?” Mr. Kaine said at an outdoor rally in Charlotte. He expressed confidence in the ticket’s chances on Tuesday, but warned supporters against complacency and implored voters to embrace the chance to elect the nation’s first female president. “Every election is important, but not every election will change history,” he said. “If we do what we know how to do, this election will change history. ” Mr. Trump’s running mate, Gov. Mike Pence of Indiana, started the day with a brisk jog across a windswept tarmac in an unlikely spot for a Republican: Duluth, Minn. It was the Republican ticket’s second stop in   Minnesota in two days, and although few signs point to a Republican upset there, a modest crowd near Mr. Pence’s plane lapped up his attacks on Mrs. Clinton. “It’s almost hard to keep up, all the headlines, all the scandals flowing out of just her years as secretary of state,” Mr. Pence said. Both campaigns conspicuously reached across party lines in their final pitches. In Scranton, Pa. Mr. Trump spoke to what he said were “Democratic voters in this country who are thirsting for change. ” In Ann Arbor, Mich. Mrs. Clinton reminded an audience of her days as an intern for President Gerald R. Ford, a Republican from Michigan, and of all the Republican leaders who have endorsed her this year. “We must put country ahead of party when it comes to this election,” she said. Mr. Trump seemed sensitive to the fact that his final 48 hours on the campaign trail lacked the star power drawn to Mrs. Clinton, who was accompanied by musicians like Jay Z, Beyoncé, Lady Gaga and Mr. Springsteen. (Collectively, her surrogates have more than 80 Grammy Awards.) “Beyoncé and Jay Z,” Mr. Trump said dismissively. “I like them. ” But, he added mischievously, “I get bigger crowds than they do. ” But the hypercompetitive Mr. Trump could not resist trying to outshine his rival. In Manchester, he read aloud a letter that he said was from Bill Belichick, the coach of the New England Patriots football team. “Congratulations on a tremendous campaign,” it purportedly read. “You have dealt with an unbelievable slanted and negative media and have come out beautifully. ” (A spokesman for the Patriots said he could not confirm or deny the letter’s authenticity Monday night.) As a final flourish, Mr. Trump claimed that Tom Brady, the team’s quarterback and a hero across New England, had cast a vote for him. In a radio interview on Monday, however, Mr. Brady said he had not yet voted.'"}, "time": 1742562010.2708397}