{"duration": 0.08379817008972168, "input_args": {"text": "'The Louvre museum in Paris has been evacuated after what the French Ministry of the Interior has called a “serious public security event” in which a number of soldier opened fire on a man with a machete who cried “Allahu Akbar”. [Update 1900 CET  —   Attacker was Egyptian national Sources close to the investigation have revealed the “Allahu akbar” shouting attacker who was shot five times Friday morning after he launched an attack on soldiers protecting the Louvre palace museum is an Engyptian national who only arrived in France days before, reports Le Figaro.  Having come by way of Dubai, the    unnamed    applied for a Schengen tourist visa. French President François Hollande, whose soon to end term has been characterised by Islamist terror attacks said Friday evening that the attack was “a terrorist act with little doubt”. French   police have searched the Louvre museum and the bags carried by the Egyptian national for weapons and explosives. Searches have also taken place in the Paris address given on the tourist visa. French journalists have reported the attacker was carrying one machete, a “military style” knife, and what have been described as a number of “paint bombs” in his bags.  The story so far: Soldiers fired five shots to disable a man at the entrance to the Louvre in Paris, France Friday morning after the   attacker shouted threats and the   Islamist phrase “Allahu Akhbar” rushed the troops while carrying two backpacks, reports Le Figaro. The man was shot in the stomach and   teams have been deployed to assess the contents of the man’s bags. Police have said no explosives have been found. The soldiers, who are among the 100, 000 deployed to the streets of France to protect schools, places of worship, railway stations, and sites of interest as part of operation Sentinel were patrolling in a group of three men when the attack took place. One soldier sustained light injuries during the attack.  The   Louvre museum which houses noted artworks including Leonardo da Vinci’s Mona Lisa and the Aphrodite of Milos was evacuated around 10am local time, and surrounded by heavily armed police. The French interior ministry said Friday morning that some 250 visitors to the Louvre museum had been locked down in secure areas and were being released in small groups. Prominent Front National politician Marion Le Pen, niece to the party leader who is leading the polls for the coming Presidential elections, congratulated the   soldiers. Taking to Twitter, she said: “Kudos to the military that has neutralised the Islamist assailant in the #Louvre”. Bravo au militaire qui a neutralisé l’assaillant islamiste au #Louvre. Ne baissons pas la garde face au terrorisme !  —   Marion Le Pen (@Marion_M_Le_Pen) February 3, 2017,  Video shot at the scene by onlookers show officers directing traffic away from the museum and the Carousel du Louvre, the underground reception and shopping centre best known for its glass pyramid and at which the attack is understood to have taken place. The Parisian transit authority RATP closed the Louvre’s metro station, saying through social media that trains on line 7 would pass without stopping. The attack comes as France remains on the highest level of alert following terror attacks in 2015 and 2016 which saw 216 killed. The French army has been constantly deployed since the Bataclan attack, with the French government voting to extend the national state of emergency in December. Evénement grave de #sécurité publique en cours à #Paris quartier du #Louvre, priorité à l’intervention des forces de sécurité et de secours pic. twitter.   —   Ministère Intérieur (@Place_Beauvau) February 3, 2017, '"}, "time": 1742562032.0774353}