{"duration": 0.15333318710327148, "input_args": {"text": "'“Were you on drugs?” New York Governor Andrew Cuomo asked convicted murderer Judith Clark before commuting part of her     sentence. “No,” she explained. “I was on politics. ”[Clark’s addiction long predated her participation in the October 20, 1981 robbery of an armored car that left a guard and two cops dead.  “There’s no question I was a red diaper baby,” she wrote in an autobiographical sketch. “I was still in diapers when my mother, Ruth, journeyed across two oceans with my    brother and me to the Soviet Union to join my father in a   sojourn. My father, Joe, was a CP organizer from the age fourteen. In 1949, when I was born, he was a Party leader and writer for the Daily Worker. My mother, like many Party women, was a mass organizer, working with settlement houses on the Lower East Side and on the congressional election campaigns of progressive politicians such as Vito Marcantonio. ” Like Brink’s robbery   Kathy Boudin, Greenwich Village townhouse casualty Ted Gold, and Weatherman comrade Eleanor Raskin, Judy Clark grew up Old Left only to find political expression in the New Left. “Some of them were trying to repudiate their past,” former Weatherman Mark Rudd tells Breitbart News of the   babies. “Some of them were trying to better their parents. ” As Clark herself explained during a 2003 appeal, “My choice of social activism and even the vehemence of my beliefs were, in some ways, consistent with my parents’ values and history. But my insistence on the need for violence represented a real break from their values. This was part of its attraction for me. While I was driven to take up their abandoned mission of transforming society, I also felt I had to atone for their failure to sustain their commitment. ” Whereas her parents displayed contempt for America by migrating to Stalin’s Russia, Judy Clark did so by taking the fight to the streets of America. Chicago cops arrested Clark at the Days of Rage, the 1969 orgy of violence that resulted in one of Mayor Richard J. Daley’s confidantes becoming a quadriparetic. Late that year at the Wargasm in Flint, where the Weathermen iconized Charles Manson, Clark created, along with future Brinks   Kathy Boudin and       Diana Oughton, a massive poster spelling out murdered actress Sharon Tate’s name in bullets. When the FBI caught up to Clark outside of a Manhattan movie house in late 1970, the federal fugitive ate pieces of paper while fleeing before kicking, swearing, and spitting on the arresting agents. A decade later, she greeted law enforcement similarly. Becoming the only   Weatherman fugitive apprehended by authorities during the group’s heyday proved disastrous for Clark —  and law enforcement. “The people aboveground tended to be pretty hardcore,” Rudd, who evaded arrest until turning himself in to the authorities in 1977, notes. Whereas members of the Weather Underground focused on staying underground, Clark and others aboveground fixated on revolution. “People found each other,” Rudd tells Breitbart News. “Somehow or another Judy must have found people aboveground, many of whom I’ve never met, who thought like she did. ” Clark ventured forth, with several   Weathermen including Boudin and Dave Gilbert, in something called the May 19 Communist Movement. The group embarked on a series of bombings, helped break   Assata Shakur free from a New Jersey prison, and pursued “expropriations” that resulted in numerous casualties, including, ultimately, its own members, who wasted away in prison. Clark’s group of white revolutionaries joined forces with the Puerto Rican FALN and the   Black Liberation Army. On October 20, 1981, an amalgam of the BLA and May 19 calling itself The Family, robbed a Brink’s truck outside of a mall in Nanuet, New York. Earlier that year, the group robbed a Brink’s truck in the Bronx of more than a quarter of a million dollars. Tyrone Rison, who swore to Clark’s participation in the Bronx job, confessed to killing a guard in that operation. Despite understanding the risks to innocent life, Clark participated in the robbery in Nanuet that resulted in the murder of a Brink’s guard and two Nyack, New York, cops. “Shamefully,” Clark later noted of the action, “I contemplated the irony that in the name of Black Liberation, a respected black police officer, Waverly Brown, had been murdered. ” “She was armed,” Kenneth Maxwell, the FBI’s case agent on the Nanuet Brink’s robbery, points out. “The way the Family operated, every single one of them was armed going out to the scene. She was much more than a getaway driver and a lookout. She was not, as certain media and government voices purport her to be, a peripheral player. She was a leader of the May 19 Communist movement that benefitted from these robberies. ” In addition to driving the muscle to the robbery, Clark carried a gun. Maxwell notes that upon arrest, cops discovered shattered glass on her person that came from the UHaul hiding the gunmen and from a police cruiser. Rather than a momentary lapse of reason, Clark’s behavior that day fit a pattern. On June 2 of that year, a gunman alleges she played a similar role in an assault on a Brink’s truck in the Bronx that left one guard dead and another wounded, netting $250, 000 for the group’s revolutionary delusions and cocaine addictions. Two years earlier, the May 19 Communist Movement helped break Assata Shakur from prison. The indictments in that case named Clark as an uncharged  . Because it looked certain that the remainder of Clark’s days would transpire behind bars, the authorities did not bother to charge her in the deadly Bronx robbery or the prison break. Her behavior in custody in 1981 mirrored her behavior after the 1970 arrest, when she spat, kicked and swore at FBI agents. “I had heard that story,” former special agent Maxwell tells Breitbart News of the resistance that earned a place in FBI lore. “It predated my entry into the FBI. It certainly was validated by her demeanor that she exhibited   after she was captured fleeing the scene in Nyack in 1981. When they took her into custody —  extremely uncooperative. ” No mellowing took place in Clark in the 11 or so years that transpired. “When the court ordered a lineup, here’s what she did,” Maxwell explains. “She repeatedly resisted any attempts to go into the lineup to the point where she kicked, scratched, bit, and spit in the faces of   folks, hissing and screaming in a demonic way. Jim Stewart, lieutenant detective in the Rockland County district attorney’s office, said she reminded him of the character in the movie The Exorcist. That’s how Judy Clark acted. ” Her unruly conduct resulted in law enforcement placing her in a straitjacket. Her strange behavior continued in the courtroom. “I am an   freedom fighter,” Clark announced at her 1983 murder trial. “I don’t recognize the legitimacy of this Court. ” The court reciprocated by not recognizing the legitimacy of the     counsel’s arguments. At her 1983 trial, Clark demanded    status, the right to wear armbands in solidarity with the New African Freedom Fighters, and a change of venue to another nation. She compared herself to George Washington and asked potential jurors, “Do your children play cowboys and Indians?” and “Are you a member of the Ku Klux Klan?” She refused to remain in the court upon the reading of her sentence. “The D. A. calls what happened on October 20, 1981, a robbery and murder,” Clark explained to a befuddled courtroom. “We say it was an attempted expropriation because revolutionary forces must take from the powers that be to build their capabilities to struggle against this system. ” Something got lost in translation from sixties rhetoric to eighties reality. The Hiroo Onoda of the   ’t received a sentence of    . She received an additional sentence of two years in solitary confinement in 1985 after evidence implicated her in an escape plot. Until Governor Cuomo cut that mandatory minimum by more than half in late December, she looked forward to a parole date past her 100th birthday. Now she could gain release this year. Like so many of her comrades from the 1960s, Judith Clark traveled on a long, strange trip. That journey, from Stalin’s Russia to the Bedford Hills Correctional Facility for Women, ended perhaps more predictably than the trips of others.'"}, "time": 1742563152.666236}