{"duration": 0.15409398078918457, "input_args": {"text": "'We Are Change \\nIn a new video investigating voter fraud released by Project Veritas Action Fund (PVA), a plot to bus impoverished voters – – told who to vote for – to the polls is caught on hidden camera.\\nIn the video, PVA journalists posing as political consultants met Reverend Marlon Mack of Sweet Home Baptist Church in Gary, Indiana to discuss how to influence the election. Mack spoke of his political influence, prompting the PVA journalists to schedule a meeting with Reverend Mack and a friend of his, Reverend Marion Johnson, to see what their plans were for Election Day.\\n“We’ve got people to get on school buses and go to Indianapolis and the state houses and we just need you to show up,” said Mack.\\n“They didn’t even know what they were going down there for, all they know is the Pastor asked them,” said Johnson.\\nMack and Johnson explained how they bus minority members of their community congregation to the polls and tell them how to vote.\\n“The thing is, I keep repeating this, our people getting to the polls. If we get our people to the polls they know who to vote for. It’s not going to be, ‘Oh who do I vote for?’ Because we’re going to tell them who to vote for,” said Johnson.\\nIRS code provides that 501 (c) 3 organizations cannot “Participate in, or intervene in, any political campaign on behalf of/in opposition to any candidate for public office.” Pastors and church staff should not be using church resources to engage in political campaigns.\\n“My thing is this. What I do is tell people who I am going to vote for. I say I’m voting for Hillary Clinton. And that’s automatically telling our congregation to vote for Hillary Clinton,” said Johnson…And you see all these vans rolling to the polls. With the name of the church and the pastor’s name on the side. And they know that the Pastor’s providing that. They know who they’re voting for. They know who they’re supporting,” said Johnson.\\n“We have church vans… I mean literally, we can have twenty vans roll up,” said Mack.\\nReverend Mack and Reverend Johnson told PVA journalists times that they were sure their community would follow their lead at the polls, as long as they had the funds. They also were hoping that the PVA journalists would connect them with a donor to fund their “get out the vote” efforts and they had a very specific way they wanted the donation to be made so that a paper trail wasn’t left.\\n“He could possibly make the check to you. You cash the check and give cash. Or he could make the check to a particular church and then it works out as a charitable donation, because it looks like he just gave a donation to the church,” said Mack.\\nIn an effort to avoid making their 501(c) 3 violation apparent, the Reverends suggested that the check be made as an anonymous charitable donation.\\nOn Election Day, PV journalists traveled to Gary, IN to see if they would be told for whom to vote.\\nPV Journalist: “So should I just vote straight ticket Democrat?”\\nMack: “That would be nice…you’re heading to the polls and don’t really have a lot of information to deal with issues…that would be probably the best bet…So prayerfully you’ll go in and just hit straight Democratic ticket and give us the help that we need.”\\nThe post Holy Voter Fraud: Reverends Caught on Cam, “We Tell Them Who To Vote For” appeared first on We Are Change .\\n'"}, "time": 1742562728.6331327}