{"duration": 0.06656408309936523, "input_args": {"text": "'So the band has done it; finally, a group of like-minded individuals has started to write music and playing shows. It is exciting, corralling friends and family in a crowded bar and blasting them with the sonic abilities of the new band.\\nMaybe members of the musical group have started posting flyers and setting up a Facebook, ReverbNation, SoundCloud, and even a Twitter account. At some point, however, being a good band is not enough to bring in new fans. All musical groups arrive at the crossroads where they have to make a decision on where to record their music.\\nHistory of the Recording Industry There are many options today, compared to the recording industry 10 years ago. In previous years, there were not many choices. There were a handful of studios that catered to any genres, all bands, and solo artists. The quality was top of the line, however, it was expensive to record, especially for starving artists. But now, with the digital age, things have changed. It seems that anyone can stumble upon dozens of small studios within the area. Nevertheless, among all the choices, who can be trusted with original music? And even more important, what is the right balance of expense and quality?\\nBefore digital recording became the industry standard, everything was done on reels or with ADAT hardware, and it was expensive to produce an album. That is no longer the case. For less than $1,000, with a little bit of practice and creativity, a creative music studio can be set-up at home. Is this really the right option for artists today? The answer is simple…maybe, sort of, possibly.\\nSome artists might look forward to tirelessly editing track after track to make that perfect cut. However, they might be robbing the band of the actual gains from a musical engineer. Sometimes having an unbiased ear that is not married to the guitar player is the insight needed to turn a song from mediocre to a hit. Most musicians forget this factor when they begin building a studio for themselves.\\nRecording Options Part of the price of using a professional studio is the benefit of an engineer who cares about the project and offers a new, creative element to a song the band has been playing for the last few years. If the group decides not to purchase an M-Box, Pro Tools set-up for $500, and learn the engineering side of things, there is still that big question…Which is the right studio for the band?\\nLarger studios will always be able to craft great sound. With their resources, they can stay up-to-date on new software, some programs cost as much as $10,000, and have access to the newest and hottest electronic “toys” on the market. However, most musicians are worried that while larger, more professional studios can produce great sound, will it be an accurate representation of the group’s style and be reproducible.\\nStudios that have access to all the gear and software to produce great sounding demos or albums can do so because of their sheer volume of customers. They may not be unable to give every project the time it deserves. Also, musicians may find themselves bound to a setting where the engineer does not even listen to the genre the band is playing, or maybe even hates it. Some musicians feel that paying someone to care, is not enough to put their dreams in someone else’s hands. So, it the studio is not the right option, then what?\\nWith the digital age and loads of free software like “Reaper” and “Garage Band,” smaller, home studios have blown up all over. It seems like anyone with a handful of microphones and a computer is a self-proclaimed engineer/producer. They can be found on Craigslist, through referrals from fellow musicians, or maybe it is even a best buddy from grade school. Still, are these small studios going to have the talent to take the band to the next level?\\nWhat to Look for When Reviewing a Small Studio Is the engineer running the studio out of his living room or worse, his parents’ garage? After all, how can someone, who wants to charge money, not able to afford an actual place to work, and more importantly, create the desired sound? Smaller places like this may be significantly cheaper but may not have the resources necessary to produce the desired sound, regardless if they are a fan of the band and style. Is the engineer qualified? Has he/she gone to school or been involved in an apprenticeship program? What makes them qualified to produce an album? (That being said, there are many famous people who have fantastic talents behind the mic and the glass.) The lowest price in the world is not worth anything if the group signs up to record with a producer who has little or no idea what they are doing. Listened to previous work they have recorded. Have they produced anything like the genre and sound of the band? What is the quality of their work? There is no right answer when looking for the perfect studio for a project, but there are plenty of options. Whether it be a local staple studio, a smaller less expensive place, or create a home studio, there is one thing that is almost guaranteed to happen. Most musicians will never be satisfied with their recording.\\nMaybe the drummer could have done this differently, the singer was sick, or a guitar player was just a fraction out of tune. Most likely, while dissecting the demo or album, after thousands of playbacks, some sort of imperfection will be discovered. Hopefully, it is something fans will not notice, like a slight EQ problem or a fade that should have gone just a little longer.\\nIt is important that no matter where the music is recorded, musicians go prepared. Have realistic expectations of what the end product will sound like from a qualified engineer. This is the best way for the band to feel their money was not wasted on a great project that sounds terrible.\\nBy Alexander Johnston\\nEdited by Jeanette Smith\\nSources:\\nPersonal experience from business (the music lab)\\nImage Courtesy of Yasunari Makamura’s Flickr Page – Creative Commons License    bands , Music , Recording , studio'"}, "time": 1742628425.1378284}