{"duration": 0.07650089263916016, "input_args": {"text": "'LONDON  —   The cat can stay. The only member of the household on Downing Street to be spared the indignity of one of the fastest political transitions in recent memory will be Larry the Cat, a tabby who holds the title of chief mouser to the cabinet office. The sudden victory of Theresa May, Britain’s home secretary, in the Conservative Party’s leadership contest on Monday put Prime Minister David Cameron in the unenviable position of having to vacate his residence in about 48 hours. A large blue moving van pulled up on Downing Street on Tuesday to retrieve the Cameron family’s belongings. It is a rite of passage Britain has experienced many times, but one that is unfamiliar for most Americans. In the United States, a newly elected president has more than two months  —   between Election Day in early November and Inauguration Day, Jan. 20  —   to set up a new administration. Transitions in Britain are far swifter. A prime minister typically takes up official residence at 10 Downing Street upon getting the job, as Mr. Cameron did in 2010, when his Conservative Party took power after 13 years of Labour Party government. But the transition can seem even more jarring when a prime minister takes office without a general election. This occurred most recently in 2007, when Gordon Brown succeeded Tony Blair, and before that in 1990, when John Major took over from Margaret Thatcher. “The prime minister has said he is glad there will not be an elongated leadership process,” a spokesman for Mr. Cameron’s office said in a phone interview on Tuesday, speaking on condition of anonymity because of government protocol. He noted that the need for stability engendered by Britain’s vote to leave the European Union had created a sense of urgency. “This is how British democracy works. When the leader changes, the prime minister changes, and the evacuation of the premises soon follows. It’s a quick departure, but it is what it is. ” Mr. Cameron led his final cabinet meeting on Tuesday. On Wednesday, after his final prime minister’s questions in Parliament, he will visit Queen Elizabeth II at Buckingham Palace to tender his resignation. Shortly after, Ms. May will be granted an audience with the queen and invited to form a government. She and her husband, Philip, will most likely pose for a photo in front of 10 Downing Street with Mr. Cameron and his family, as their predecessors have done. Larry the Cat will be staying, the government spokesman said wryly, adding that Ms. May would inherit the tabby, adopted from an animal shelter in 2011 to help address a rat problem. Mr. Cameron made his resignation announcement on June 24, one day after the referendum to withdraw from the European Union, a decision commonly known as Brexit. On Monday, after he announced the timetable of his departure and expressed his support for Ms. May, he was recorded jovially humming as he   10 Downing Street, seemingly relieved. But the rapid departure poses logistical challenges for Mr. Cameron and his wife, Samantha, including the question of where to live. The Camerons have three children  —   their youngest, Florence, is 5  —   and hope to stay in the capital. But their home in the North Kensington area of west London has been rented out, and their farmhouse in the hamlet of Dean, Oxfordshire, about 73 miles northwest of London, is probably too far for daily commuting. The arrival of the moving van at the rear entrance on Downing Street suggested that the Camerons have at least found temporary lodgings, although officials would not confirm this. The movers arrived with 330 boxes, 30 rolls of tape and three rolls of Bubble Wrap. Simply Removals, the company that handled the Camerons’ move into Downing Street in 2010, and calls itself “London’s affordable removal firm,” advertises a “Big One” package that includes 25 standard boxes, two large boxes, two wardrobe boxes, Bubble Wrap, packing paper and tape, for 169 pounds, or about $224. A recording on the company’s office phone extolled its qualifications, adding: “That’s why we were Prime Minister David Cameron’s choice when he first moved into No. 10. ” The house at 10 Downing Street has been the official residence of the prime minister since 1735, but the Cameron family actually lives in more spacious quarters at 11 Downing Street. That house is the official residence of the chancellor of the Exchequer, Britain’s finance minister. (In 2010, the chancellor, George Osborne, chose to remain at his residence in the Notting Hill section of west London.) Peter York, a cultural commentator, said the speed with which Mr. Cameron was being “ejected” reflected the viciousness of the power struggle within the Conservative Party. The party has been known for disposing of its leaders with ruthless efficiency, notably in 1990 when Mrs. Thatcher was effectively ousted in a party coup. “He is practically being thrown out of his house, though I dare say he will have some people to help him pack his bags,” Mr. York said in a phone interview. Comparing the Conservative establishment to an elite boarding school like Eton, which Mr. Cameron attended, Mr. York added: “They are saying: ‘You are no longer the head boy. Get out of the house. It’s for the good of the school. ’” Mr. York predicted that Ms. May, the  daughter of a vicar, would bring a change in the atmospherics at 10 Downing Street, including, he said, replacing the “socially smart,   ” social circles of the Camerons  —   the “Notting Hill set,” as observers often call it  —   with a   middle England sensibility. “Theresa will make No. 10 more mainstream bourgeois, and redo the place for the   era,” Mr. York predicted. “I imagine lots of floral sofas. ”'"}, "time": 1742562740.4560366}