{"duration": 0.049695491790771484, "input_args": {"text": "'Gold & The Dollar Moving In Tandem? Fund Manager Explains Important Shift Posted on Home » Silver » Silver News » Gold & The Dollar Moving In Tandem? Fund Manager Explains Important Shift \\nThe manipulated gold and silver correction is OVER… \\n\\nFrom PM Fund Manager Dave Kranzler : \\nOne interesting occurrence that has not been written about in the precious metals alternative media or blog space yet is that gold has been quietly moving in tandem with the dollar over the past several trading sessions. It has been quite pronounced during the past four trading days, today inclusive. In the previous 15 years, gold’s best periods of return have occurred when gold and the dollar move in tandem higher for a brief period of time, followed by a period of time when the dollar heads south and gold continues higher. \\nIf you look at graphs of both gold and the dollar side by side, you’ll see that this occurred in late 2005 into early 2006, when gold moved higher until May while the dollar fell and again in late 2008. It’s too early tell if that will happen now, but suffice it to say that both are moving in tandem right now and it’s worth watching to see if it continues. My theory is that there’s flight to safety into gold and the dollar ahead of an adverse economic event. As the event unfolds, the dollar begins to sell off but capital continues to flow into gold as the ultimate wealth preservation asset. \\nThe above analysis is an excerpt from the latest issue of IRD’s Mining Stock Journal which was released last night. Earlier today, Bill “Midas” Murphy poked his head out of the New Orleans Investment Conference and asked me why the metals were acting “so goofy” this morning, to which I replied: \\nInterestingly, gold and the dollar have been moving in tandem the past several days. Not perfect correlation but I bet its 80-85%. I discussed this in the latest issue of my Mining Stock Journal . Over the last 15 years, gold has had some of its best performance periods when it moved in tandem with the dollar for a bit then took off higher while the dollar sold off. It’s been moving in tandem with the dollar today as well. \\nThe manipulated correction is over. India and China are buying a LOT of gold right now. Two days ago nearly 100 tonnes were delivered onto the SGE. I don’t think the cartel can take gold lower and I think right now they are merely trying to keep the “beachball” from popping above the surface of the water. Every time gold pops up, they hit it, but gold bounces back like one of those punching clowns. \\nAt some point they are going to have to go back into “managed retreat.” Maybe once the election is over. \\nYou’ll note that there’s now been a complete reversal in the precious metals sector, with gold, silver and the HUI running higher and the SPX/Dow headed south. This entry was posted in Gold News , Silver News and tagged Dave Kranzler , gold manipulations , gold update , silver manipulation , silver update . Bookmark the permalink . Post navigation'"}, "time": 1742562716.415898}