{"duration": 0.12773871421813965, "input_args": {"text": "'The Protocols of the Elders of Zion — Probably Wrote by the Rothschilds Lucifer Triumphant, Mankind Enslaved Many people think \" The Protocols of the Elders of Zion ... http://humansarefree.com/2016/11/the-protocols-of-elders-of-zion.html Lucifer Triumphant, Mankind Enslaved Many people think \" The Protocols of the Elders of Zion \" is anti Semitic \"hate literature\" and a fraud. Nobel Prize winner Alexander Solzhenitsyn wrote that the book exhibits \"the mind of genius.\" This is pretty unusual for a fraud. Solzhenitsyn said it exhibits, \"great strength of thought and insight...Its design...(increasing freedom and liberalism, which is terminated in social cataclysm)...is well above the abilities of an ordinary mind...It is more complicated than a nuclear bomb.\" I\\'m afraid Protocols may be genuine They are lectures addressed to Jewish Luciferians ( Illuminati , Freemasons ) detailing an incredible plan to overthrow western civilization, subjugate mankind, and concentrate, \"all the wealth of the world... in our hands.\" The book , typical of similar Illuminati documents, was leaked to the Czarist Secret police and published in Russia in 1905. The issue of anti Semitism diverts attention from this plot which has been unfolding for over 200 years and is behind world government, September 11, Iraq, Homeland Security and the bogus \"War on Terror.\" FAIT ACCOMPLI. The plotters control the world\\'s wealth. Their multinational corporations have Freemason symbols for logos. Shell and Citibank have the rising sun; Exxon the double cross, CBS and Time Warner the eye of Horus; Alcan and AOL, the circle in the triangle. The mass media, education and politics all create an illusion of democracy in order to control and defraud humanity. The Great Seal of the United States reflects the unhappy truth. It is also a Freemason symbol and bears the inscription \"We have achieved New World Order .\" Almost all American Presidents including George W. Bush are Freemasons or Illuminati. Israel\\'s Star of David (interlaced triangles) is the Masonic symbol for the double divinity, Adonai and Lucifer. The issue of anti Semitism is irrelevant because Jewish and non-Jewish Luciferians have intermarried. (See Milan Martin, Lucifer\\'s Children p.74) The elite now consists of humanity-haters of all stripes. No wonder corruption is endemic. As the Greeks say, the fish rots from the head. ROTHSCHILD — Meyer Amschel Rothschild (1744-1812) played a key role in advancing this monstrous conspiracy. He was a follower of the occult Cabbalism (or Lucifer worship) that is the basis of Illuminism and Freemasonry. (See Albert Pike, Morals and Dogma of the Ancient and Accepted Scottish Rite of Freemasonry ) Researchers have speculated that Adam Weishaupt or Asher Ginzberg penned Protocols. I think it may have been Rothschild himself. I came to this conclusion after reading Protocols 20-23 , the \"financial program... the crowning and the decisive point of our plans.\" These lectures require considerable knowledge of banking and finance. Moreover the author states that all power ultimately will reside in the \"King of the Jews,\" which is how Rothschild was known. THE SOURCE OF POWER The author makes clear that whoever creates money is sovereign. He ridicules the goyim kings for forfeiting this power and says he doesn\\'t intend to repeat this mistake. \"When we come into our Kingdom,\" the government will change from being \"a payer of tribute by loan operations...into a lender at a profit.\" \"This measure will stop the stagnation of money, parasitic profits, and idleness which were useful for us among the goyim so long as they were independent but are not desirable under our rule.\" The Protocols is full of Talmudic contempt for non-Jews. \"How clear is the undeveloped power of thought of the purely brute brains of the goyim... What could have been simpler than to take the money they wanted from their own people? \"... We \"will put an end to those abuses to which we owe our mastery over the goyim, but which cannot be allowed in our Kingdom.\" (I am using the L. Fry edition of The Protocols, entitled Waters Flowing Eastward, available from gsgbooks@mindspring.com) COMMUNISM, SOCIALISM, LIBERALISM, FEMINISM Similarly the bankers have financed intellectuals and politicians to promote a mania for, \"senseless utopian principles\" like \"collectivism,\" \"freedom of conscience, equality and the like.\" They are designed to bring down the Old Order but will have no place in the New. \"We have set them on the hobbyhorse of an idea about the absorption of individuality by ... collectivism... \"They have never yet and they never will reflect that this hobbyhorse is a manifest violation of the most important law of nature, which has established from the very creation of the world one unit unlike another and precisely for the purpose of instituting individuality...\" \"The purely brute mind of the goyim is incapable of analysis and observation...Their eyes are open but see nothing before them...\" \"Everything in this world is in a state of submission... to what is stronger. And so shall we be this something stronger for the sake of good.\" THE BOLSHEVIK REVOLUTION Estonian journalist Juri Lina has examined the recently opened Soviet archives and documented the connection between the Bolshevik Revolution and Jewish Illuminism in his book \" Under the Sign of the Scorpion .\" (1994) I will probably devote a separate column to this book. Suffice to say here that Communism was the outcome of the plan outlined in Protocols. No wonder this book was banned in the USSR on pain of death! Its informal ban in America is a measure of our condition. Karl Marx, Lenin and Trotsky, were all Jewish Freemasons, dysfunctional losers who were employed by the Illuminist bankers to hoodwink the masses. Lenin for example had been an unsuccessful lawyer who had only six cases in which he defended shoplifters. He lost all six cases. A week later he gave up the law to become a highly paid revolutionary. Lenin declared: \"Peace means quite simply the domination of Communism over the entire world.\" His reign of terror caused nine million deaths but you never see him compared with Hitler. The secret police, the Cheka, dominated by Jews, published the names of 1.7 million people they murdered in 1918-1919, including 300,000 priests. \"A river of blood flowed through Russia,\" Lina writes. \"According to official Soviet Reports, 1,695,904 people were executed from January 1921 to April 1922. Among these victims were bishops, professors, doctors, officers, policemen, lawyers, civil servants, writers... Their crime was \\'anti social thinking\\'\" CONCLUSION Jews will never understand anti Semitism until they realize it is not always based on irrational prejudice. In 1920, Winston Churchill made a distinction between national and \"International Jews.\" He said the latter have been behind, \"a worldwide conspiracy for the overthrow of civilization and the reconstitution of society on the basis of arrested development, of envious malevolence, and impossible equality... \"It played ... a part in the tragedy of the French Revolution. It has been the mainspring of every subversive movement during the Nineteenth Century; and now at last this band... have gripped the Russian people by the hair and have become practically the undisputed masters of that enormous empire.\" ( Ref. ) Our culture, not The Protocols , is a fraud. Communist Jews set an example for the Nazis . Luciferians like Rothschild, Lenin and Hitler still control the planet and are determined to enslave humanity. I\\'m afraid that this will become increasingly evident. I pray I am wrong. By Henry Makow Ph.D. Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742562421.1101997}