{"duration": 0.07494974136352539, "input_args": {"text": "' Read Roberta Smith’s review of this exhibition. The   gilded objects by Pierre Gouthière sitting in regal silence in the Frick Collection galleries make one thing brilliantly clear. Gold is not a material of mere decorative art. It is the visualization of power. From the Renaissance to Gouthière’s   French royal court to masters of the modern universe, gilt  —   gold’s application to metal, whether powder, leaf or plate  —   is the assertive surface of  . We seem to be having a Midas moment. With the election of the commercial Sun King Donald J. Trump to the presidency, and the pedestrian aristocracy of gold sneakers walking the street  —   Chuck Taylors, Nikes, Skechers, Keds for Kate Spade  —   there is again the gleam of gilt in the public eye. Reappearing from an unscheduled hospital stay this month, Kanye West suddenly had gold hair when he visited Mr. Trump in New York, framed for the photo op by the aura of the Trump Tower lobby. In addition to Gouthière at the Frick, there is Charles Percier, architect and designer to Napoleon Bonaparte, on exhibit in drawings and extraordinary     objects at the Bard Graduate Center on the Upper West Side. Farther uptown on Fifth Avenue, the Guggenheim has Maurizio Cattelan’s “America,” an   solid gold toilet, on working display. Downtown, Martin Puryear’s “Big Bling,” a    sculpture with a monumental     shackle, commands Madison Square Park until April. Few today would hope to approach the level of artistry in Gouthière’s work  —   from the original conceptions to the irreplicable craft. Yet, for a select group of artisans, designers and their clients, interest flourishes in contemporary interpretations of   objects. And foundries, finishers, gilders, patinators and other workshops produce them, with processes that recall, remarkably, the 18th and early 19th centuries. At his studio in Long Island City, Queens, beneath the Long Island Expressway, William P. Sullivan creates   furnishings for the architect Robert A. M. Stern and Michael S. Smith, who designed the Obama family’s living quarters at the White House. Mr. Stern deployed Mr. Sullivan’s   and   mirror in the private sales suite of Tiffany’s Fifth Avenue headquarters. “There is something about the pouring of bronze,” Mr. Sullivan said. “You feel like you’re at the beginning of civilization. ”  Polich Tallix in Rock Tavern, N. Y. cast and finish many of Mr. Sullivan’s designs. Polich Tallix also produced the 2016 Oscar statuettes  —   the contemporary world’s most famous  . Empire Metal in Astoria, Queens, does much of Mr. Sullivan’s plating. Alexander Kellum, a Brooklyn artist, is director of specialty finishes at EverGreene Architectural Arts. EverGreene executed the gilding on the  ’s latest project, the Trump International Hotel in Washington, in particular its    presidential ballroom. To quote William Shakespeare, “All that glisters is not gold. ” The ballroom’s gilt is composition leaf, a copper alloy with only trace amounts of gold, a variation of which gilders call brass leaf. Brassy, yes. Gold, no. “Real gold leaf in this situation would be a 60 to 80 percent increase in cost,” Mr. Kellum said, declining to discuss actual pricing. EverGreene also gilded Mr. Puryear’s “Big Bling” and has worked on residences and hotel spaces at the Plaza in New York (23.  gold). Michael Kramer, president and founder of the Gilders’ Studio, a company in Olney, Md. that gilded the William Tecumseh Sherman monument at the entrance to Grand Army Plaza in Central Park, estimated the cost of using brass leaf at roughly $2 a square foot, excluding installation. Gold leaf could run $25 to $35 a square foot. Gilding is a topical application of precious metal to an object. In Gouthière’s workshop, gilt was applied with fire gilding, a process by which an amalgam of mercury and gold was gently baked onto an object in a low fire, the mercury evaporating and the gold remaining as a coating of gilt. Electroplating  —   using an electric current to adhere the gold to the object  —   appeared in the 19th century, largely replacing fire gilding, whose mercury fumes are highly toxic. Fire gilding, specifically, is now rarely used except in   restorations. Objects in Gouthière’s time were first modeled in wood, wax or porcelain, pressed between blocks of compressed sand and removed. Molten metal was poured into the reclosed casting to create the design in bronze. Chasing and matting achieved with hand tools, provided detail and relief to the ornament of the castings before they were gilded, and in some cases, after the gilt was applied. At P. E. Guerin, a hardware manufacturer in Greenwich Village, this process continues largely intact from 1857, when the company was founded. Guerin pours its bronze on Fridays at the top of the building, molding objects with liquid brass heated to 2, 000 degrees in sand blocks, or flasks. The hardware is finished and plated in the two floors of workshops below. Visiting the premises is like walking into an engraving. Because of its encyclopedic inventory of   and   models, Guerin works with projects like the Henry Ford estate Fair Lane, in Dearborn, Mich. presently being restored, and its clients have included Susan Gutfreund, whose apartment at 834 Fifth Avenue, decorated in the French style, is on the market for $96 million. Guerin is collaborating with William Sofield of Studio Sofield to produce custom bronzes for the interiors of 111 West 57th Street in Manhattan, the luxury condominium tower rising over Steinway Hall. “I always think it’s important to design things that look better with age, and I think bronze is a material that does that,” Mr. Sofield said. “For me, it gets better. ” SHoP, the architects on the project, created a major bronze component for the facade: an ascending fretwork that appears to stitch the building together delicately as it spins vertiginously to the   top. “The material has a kind of bright, brassy aesthetic that will age within a year to a rich, dark, warm brown,” Gregg Pasquarelli, one of SHoP’s founding partners, said. SHoP moved its offices three years ago into the Woolworth Building, one of Manhattan’s high temples of giltwork. Its influence seems to have had its effect. At a symposium at the Frick on Dec. 12, conservators, curators and craftsmen from France, England, the Netherlands, the Metropolitan Museum of Art, the J. Paul Getty Museum and elsewhere gathered before the Gouthières, many borrowed from what Ian Wardropper, the Frick’s director, called “very private” collections. Eric Thiriet, who specializes in finishing techniques, and Marc Voisot, a restorer who works with fire gilding, huddled    before a golden column and capital at the entrance to the exhibition, whispering in low conspiracy about its detail. In other corners of the galleries’ hushed, carpeted rooms, swans attacked, goats bleated, poppies unfurled and snakes slid over the rims of Chinese urns, frozen in gold but animated in time by Gouthière’s almost obsessively executed observation. “It’s not ornament anymore it becomes a story,” said Charlotte Vignon, the exhibition’s curator, standing before a pair of hissing swans whose angry gold wings upheld two potpourri vases. Joseph Godla, the Frick’s chief conservator, pointed out that Gouthière would gild an object four or five times to get a thick layer in which to work his naturalistic art. Gouthière’s work was five times more expensive than that of his contemporaries, Ms. Vignon said. He also had chronic issues over payment with some of his noblest patrons. At his death in 1813 in a retirement home, Gouthière’s estate  —   only small items of furniture  —   was valued at 41 francs, a negligible sum even two centuries ago. His laughing, lively work outlived his clients, though, many of whom did not survive the French Revolution. The artist’s lesson? If you want your name to rule forever, make it in gilt bronze.'"}, "time": 1742628563.6272988}